*                                                                       00001000
* %DCL IEEZB834_INCLUDED CHAR EXT;                                      00002000
* %DEACTIVATE IEEZB834_INCLUDED;                                        00003000
* %IF IEEZB834_INCLUDED = '' %THEN                                      00004000
* %DO;                                                                  00005000
*/* Macro made bi-lingual on 07157. CBGEN compile date 07117         */ 00006000
*% /*                                                                   00007000
         MACRO                                                          00008000
         IEEZB834 &DSECT=YES,&LIST=YES,&TITLE=YES,&VDRSARR=YES          00009000
                      GBLC  &IEEZB834_INCLUDED                          00010000
                      GBLC  &ZCBPRINT                                   00011000
&IEEZB834_INCLUDED    SETC  'YES'                                       00012000
                      AIF   ('&LIST' EQ 'NONE').P0                      00013000
                      AIF   ('&TITLE' EQ 'NO').P5                       00014000
 TITLE                'IEEZB834  - VARY Device Service Results         *00015000
                          '                                             00016000
.P5                   ANOP                                              00017000
**/ IEEZB834_1:;                                                        00018000
*/* START OF SPECIFICATIONS ******************************************/ 00019000
*/*                                                                  */ 00020000
*/* MACRO NAME: IEEZB834                                         @D1C*/ 00021000
*/*                                                                  */ 00022000
*/* DESCRIPTIVE NAME: VARY Device Service Results                    */ 00023000
*/*                                                                  */ 00024000
*/*01* PROPRIETARY STATEMENT=                                        */ 00025000
*/***PROPRIETARY_STATEMENT********************************************/ 00026000
*/*                                                                  */ 00027000
*/*                                                                  */ 00028000
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00029000
*/* 5694-A01 COPYRIGHT IBM CORP. 1993, 2008                          */ 00030000
*/*                                                                  */ 00031000
*/* STATUS= HBB7750                                                  */ 00032000
*/*                                                                  */ 00033000
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 00034000
*/*                                                                  */ 00035000
*/* DSECT NAME: VDRSARR                                              */ 00036000
*/*                                                                  */ 00037000
*/* COMPONENT: Master Scheduler (SC1B8)                              */ 00038000
*/*                                                                  */ 00039000
*/* EYE-CATCHER: None                                                */ 00040000
*/*                                                                  */ 00041000
*/* FUNCTION: Maps the output from the IEEVARYD service.             */ 00042000
*/*                                                                  */ 00043000
*/* METHOD-OF-ACCESS:                                                */ 00044000
*/*                                                                  */ 00045000
*/*   PLAS: %INCLUDE SYSLIB(IEEZB834)                            @D1C*/ 00046000
*/*                                                                  */ 00047000
*/*       %VDRSARRSTORAGE can be used to set the storage             */ 00048000
*/*         attributes for the VDRSARR array:                        */ 00049000
*/*                                                                  */ 00050000
*/*           Examples:  %VDRSARRSTORAGE = 'AUTOMATIC'               */ 00051000
*/*                      %VDRSARRSTORAGE = 'BASED'                   */ 00052000
*/*                      %VDRSARRSTORAGE = 'BASED(ptr)'              */ 00053000
*/*                                                                  */ 00054000
*/*           Default:   %VDRSARRSTORAGE = 'BASED'                   */ 00055000
*/*                                                                  */ 00056000
*/*         %VDRSARRNUM can be used to define the number of          */ 00057000
*/*         elements in the VDRSARR array:                           */ 00058000
*/*                                                                  */ 00059000
*/*           Examples:  %VDRSARRNUM = '1'                           */ 00060000
*/*                      %VDRSARRNUM = '5'                           */ 00061000
*/*                      %VDRSARRNUM = '*'                           */ 00062000
*/*                                                                  */ 00063000
*/*           Default:   %VDRSARRNUM = '*'                           */ 00064000
*/*                                                                  */ 00065000
*/*   ASM:  IEEZB834                                             @D1C*/ 00066000
*/*                                                                  */ 00067000
*/* CREATED BY: Caller of IEEVARYD service                           */ 00068000
*/*                                                                  */ 00069000
*/* DELETED BY: Caller of IEEVARYD service                           */ 00070000
*/*                                                                  */ 00071000
*/* POINTED TO BY: N/A                                               */ 00072000
*/*                                                                  */ 00073000
*/* STORAGE ATTRIBUTES: In storage of caller of IEEVARYD service     */ 00074000
*/*                                                                  */ 00075000
*/*   SUBPOOL/DATASPACE: Caller                                      */ 00076000
*/*                                                                  */ 00077000
*/*   KEY: Caller                                                    */ 00078000
*/*                                                                  */ 00079000
*/*01* SIZE:                                                         */ 00080000
*/*            VDRSARR -- X'0068' bytes                              */ 00081000
*/*                                                              @L1A*/ 00082000
*/* SERIALIZATION: None                                              */ 00083000
*/*                                                                  */ 00084000
*/* DEPENDENCIES: None                                               */ 00085000
*/*                                                                  */ 00086000
*/* NOTES: None                                                      */ 00087000
*/*                                                                  */ 00088000
*/* EXTERNAL CLASSIFICATION:                                     @D1C*/ 00089000
*/*                                                                  */ 00090000
*/* GUPI: BASE                                                   @D1A*/ 00091000
*/*                                                                  */ 00092000
*/* DMTI: FIELDS VDRSARR_OFFLINE_OPERATOR                        @D1A*/ 00093000
*/*                                                                  */ 00094000
*/* END OF EXTERNAL CLASSIFICATION:                              @L1A*/ 00095000
*/*                                                                  */ 00096000
*/* CHANGE-ACTIVITY:                                                 */ 00097000
*/* $MAC(IEEZB834),COMP(SC1B8): VARY Device Service Results          */ 00098000
*/*   $L0=SYSOPS   HBB5510 921204 PDCF:  Sysplex Operations          */ 00099000
*/*   $D1=DMN4005  HBB5510 930121 PDLC:  Rename to IEEZB834          */ 00100000
*/*   $D2=DIG0061  HBB5510 930415 PDLC:  Delete device reason codes  */ 00101000
*/*   $L1=SYSOP16  HBB5510 930520 PD3J:  SHOWHDR updates             */ 00102000
*/*   $D3=DIG0138  HBB5510 930621 PDCF:  Add new device reason codes */ 00103000
*/*   $L2=SHRTP83J HBB5520 940415 PD3J:  VARY AUTOSWITCH             */ 00104000
*/*   $P1=PXD0044  HBB7703 991215 PDKP:  Devices reserved            */ 00105000
*/*   $01=OW46498  HBB7703 001006 PDKP:  Fix Assembler error         */ 00106000
*/*   $L3=CSTAR    JBB7727 020904 PDTA:  Hardcopy Console cleanup    */ 00107000
*/*   $L4=CNZ2A    HBB7730 040702 PDSS:  MC/Switch Elimination       */ 00108000
*/*   $L5=UNAVAIL  HBB7750 070427 PDTA:  Mark Tape Unavailable       */ 00109000
*/*                                                                  */ 00110000
*/********************************************************************/ 00111000
*/* A  Rename macro from IEEDVDRS and add device reason codes    @D1A*/ 00112000
*/* D  Delete device reason codes 3, 4, and 5                    @D2A*/ 00113000
*/* C  Update prolog fields for SHOWHDR                          @L1A*/ 00114000
*/* A  Add new device reason codes                               @D3A*/ 00115000
*/* A  Add new return/reason codes for VARY AUTOSWITCH           @L2A*/ 00116000
*/* A  Add new reason code for devices that are reserved         @P1A*/ 00117000
*/* C  Fix PXD0044.  Had an Assembler error due to a missing '*' @01A*/ 00118000
*/*    for a comment line.                                       @01A*/ 00119000
*/* C  Update comments for VDRSARR_HARDCOPY_CONSOLE to indicate  @L3A*/ 00120000
*/*    that it is no longer applicable, since hardcopy consoles  @L3A*/ 00121000
*/*    are no longer supported.                                  @L3A*/ 00122000
*/* C  Update comments on fields dealing with the Master that    @L4A*/ 00123000
*/*    they are not used as of HBB7730.                          @L4A*/ 00124000
*/* C  Convert to CBGEN                                          @L4A*/ 00125000
*/* C  Update comments to include UNAVAILABLE state for some     @L5A*/ 00126000
*/*    return/reason codes.                                      @L5A*/ 00127000
*/*END OF SPECIFICATIONS *********************************************/ 00128000
*% /*                                                                   00129000
.P0                   ANOP                                              00130000
                      AIF   ('&ZCBPRINT' EQ 'NO').P1                    00131000
                      AIF   ('&LIST' EQ 'YES').P2                       00132000
.P1                   ANOP                                              00133000
                      PUSH  PRINT                                       00134000
                      PRINT OFF                                         00135000
.P2                   ANOP                                              00136000
                      AIF   ('&VDRSARR' EQ 'NO').L0002                  00137000
                      AIF   ('&DSECT' EQ 'YES').L0003                   00138000
                      AIF   ('&VDRSARR' NE 'YES').L0002                 00139000
.L0003                ANOP                                              00140000
*                                                                       00141000
* ********************************************************************  00142000
* *                                                                  *  00143000
* * VARY Device Service Results                                      *  00144000
* *                                                                  *  00145000
* ********************************************************************  00146000
*                                                                       00147000
*                                                                       00148000
                      AIF   ('&DSECT' EQ 'YES').L0004                   00149000
VDRSARR               DS    0D     VARY Device Service Results Array    00150000
                      AGO   .L0005                                      00151000
.L0004                ANOP                                              00152000
VDRSARR               DSECT        VARY Device Service Results Array    00153000
.L0005                ANOP                                              00154000
VDRSARR_OUTPUT_FLAGS  DS    CL2    Output flags                         00155000
                      ORG   VDRSARR_OUTPUT_FLAGS                        00156000
VDRSARR_OUTPUT_FLAGS1 DS    CL1    First byte of output flags           00157000
*  Bit definitions:                                                     00158000
VDRSARR_OUTPUT_VALID  EQU   X'80'  Device output is valid               00159000
VDRSARR_MSG_RETURNED  EQU   X'40'  Message area contains a message      00160000
VDRSARR_OUTPUT_FLAGS2 DS    CL1    Second byte of output flags          00161000
                      DS    CL2    Reserved                             00162000
VDRSARR_RETCODE       DS    F      Device return code                   00163000
VDRSARR_RSNCODE       DS    F      Device reason code                   00164000
                      DS    CL12   Reserved                             00165000
VDRSARR_MSGAREA       DS    CL71   Message area                         00166000
                      DS    CL9    Reserved                             00167000
VDRSARR_LENGTH        EQU   104    Length of VARY Device Service       *00168000
                                   Results Array Entry                  00169000
*                                                                       00170000
* ********************************************************************  00171000
* *                                                                  *  00172000
* * Device Return Codes (values for VDRSARR_RETCODE)                 *  00173000
* *                                                                  *  00174000
* ********************************************************************  00175000
*                                                                       00176000
*                                                                       00177000
VDRSARR_OK            EQU   0      Successfully varied online/offline  *00178000
                                   or the AUTOSWITCH attribute or the  *00179000
                                   unavailable state for the device    *00180000
                                   was successfully changed             00181000
VDRSARR_ALREADY_OK    EQU   4      Already online/offline or in        *00182000
                                   requested AUTOSWITCH mode            00183000
VDRSARR_PENDING       EQU   8      Pending offline                      00184000
VDRSARR_ONLINE_WITH_REST EQU 12    Online with restrictions             00185000
VDRSARR_FAIL          EQU   16     Did not come online/offline or the  *00186000
                                   AUTOSWITCH attribute or the         *00187000
                                   unavailable state was not changed   *00188000
                                   for the device                       00189000
VDRSARR_OFF_PENDBOX   EQU   20     Offline and pending boxed            00190000
VDRSARR_PENDOFF_PENDBOX EQU 24     Pending offline and pending boxed    00191000
VDRSARR_UNEXP_ERR     EQU   32     Unexpected error                     00192000
*                                                                       00193000
* ********************************************************************  00194000
* *                                                                  *  00195000
* * Device Reason Codes (values for VDRSARR_RSNCODE)                 *  00196000
* *                                                                  *  00197000
* ********************************************************************  00198000
*                                                                       00199000
*                                                                       00200000
VDRSARR_NO_INFO       EQU   0      No additional information            00201000
VDRSARR_SEE_MSGAREA   EQU   1      See message area                     00202000
VDRSARR_NOUCB         EQU   2      No UCB for device                    00203000
VDRSARR_UNIT_MUST_BE_OFFLINE EQU 3 Unit must be OFFLINE before its     *00204000
                                   AUTOSWITCH attribute or unavailable *00205000
                                   state can be changed                 00206000
VDRSARR_DEVICE_NOT_VALID EQU 4     Unit is not a valid device type for *00207000
                                   the AUTOSWITCH attribute or         *00208000
                                   unavailable state                    00209000
VDRSARR_NO_LOG_PATHS  EQU   6      Device has no logical paths          00210000
VDRSARR_NO_PHY_PATHS  EQU   7      Device has no physical paths         00211000
VDRSARR_IN_USE        EQU   8      Device in use by system function     00212000
VDRSARR_ABORT         EQU   9      VARY processing aborted              00213000
VDRSARR_DYN_PATH      EQU   10     Dynamic pathing failed               00214000
VDRSARR_ASSIGN        EQU   11     Device assigned to another system    00215000
VDRSARR_INCOMP_ASSIGN EQU   12     Incompatible assign requested        00216000
VDRSARR_ASSIGN_FAILED EQU   13     Assign failed                        00217000
VDRSARR_PENDOFF_BOXED EQU   14     Pending offline and boxed            00218000
VDRSARR_KEPT_OFFLINE_CM EQU 15     Device being kept offline by a      *00219000
                                   configuration manager                00220000
VDRSARR_OFFLINE_OPERATOR EQU 16    Device is offline due to operator   *00221000
                                   and cannot be brought online as     *00222000
                                   part of an SMS library operation     00223000
VDRSARR_IN_TAPE_LIB   EQU   17     Device is in a system-managed tape  *00224000
                                   library                              00225000
VDRSARR_IN_USE_BY_CUIR EQU  18     Device is in use by C.U.I.R.         00226000
VDRSARR_NOT_ELIGIBLE  EQU   19     Device is not eligible for a vary   *00227000
                                   operation (e.g., device is SYSRES   *00228000
                                   or non-base multiple exposure)       00229000
VDRSARR_VOLUME_NOT_READ EQU 20     Volume could not be read             00230000
VDRSARR_MANAGED_BY_JES3 EQU 21     Device is managed by JES3            00231000
VDRSARR_CONSOLE_CHANGING EQU 22    Device is the console device for a  *00232000
                                   console which is currently changing *00233000
                                   console status                       00234000
VDRSARR_CONSOLE_IO    EQU   23     Device is the console device for a  *00235000
                                   console which has invalid           *00236000
                                   input/output capabilities            00237000
VDRSARR_MASTER_OFF_FORCE EQU 24    Device is the console device for    *00238000
                                   the master console and the OFFLINE  *00239000
                                   and FORCE keywords were not         *00240000
                                   specified. This value is not used   *00241000
                                   in HBB7730 or above.                 00242000
VDRSARR_MASTER_OTHER_ACT EQU 25    Device is the console device for    *00243000
                                   the master console and there is at  *00244000
                                   least one other active full         *00245000
                                   capability console. This value is   *00246000
                                   not used in HBB7730 or above.        00247000
VDRSARR_MASTER_MSTCONS EQU  26     Device is the console device for    *00248000
                                   the master console and the VARY     *00249000
                                   MSTCONS command can be accepted     *00250000
                                   from any console. This value is not *00251000
                                   used in HBB7730 or above.            00252000
VDRSARR_MASTER_CANDIDATE EQU 27    Device is the console device for    *00253000
                                   the master console candidate or the *00254000
                                   local candidate. This value is not  *00255000
                                   used in HBB7730 or above.            00256000
VDRSARR_HARDCOPY_CONSOLE EQU 28    Device is the console device for    *00257000
                                   the hardcopy console Note: this     *00258000
                                   return code is no longer used as of *00259000
                                   JBB7727.                             00260000
VDRSARR_DEVICE_RESERVED EQU 29     Device is not allowed to be         *00261000
                                   OFFLINEd when it is reserved         00262000
VDRSARR_LEN           EQU   *-VDRSARR                                   00263000
.L0002                ANOP                                              00264000
                      AIF   ('&ZCBPRINT' EQ 'NO').P3                    00265000
                      AIF   ('&LIST' EQ 'YES').P4                       00266000
.P3                   ANOP                                              00267000
                      POP   PRINT                                       00268000
.P4                   ANOP                                              00269000
.P_EXIT               ANOP                                              00270000
                      MEND                                              00271000
**/ IEEZB834_2:;                                                        00272000
* %IEEZB834_INCLUDED = 'YES';                                           00273000
* %DCL ZCBPRINT CHAR EXT;                                               00274000
* %DEACTIVATE ZCBPRINT;                                                 00275000
* %DCL IEEZB834_LIST CHAR EXT;                                          00276000
* %DEACTIVATE IEEZB834_LIST;                                            00277000
* %IF IEEZB834_LIST ^= 'NO' &                                           00278000
*    ZCBPRINT ^= 'NO' %THEN                                             00279000
*   %GOTO IEEZB834_3;                                                   00280000
*   @LIST PUSH NOECHO;                                                  00281000
*   @LIST NOASSEMBLE NOECHO;                                            00282000
*   @LIST OFF C NOECHO;                                                 00283000
* %IEEZB834_3:;                                                         00284000
*/* Start of PL/X Source                                             */ 00285000
*/********************************************************************/ 00286000
*/*                                                                  */ 00287000
*/* VARY Device Service Results                                      */ 00288000
*/*                                                                  */ 00289000
*/********************************************************************/ 00290000
*%IF VDRSARRSTORAGE = '' %THEN                                          00291000
*  %VDRSARRSTORAGE = 'BASED';                                           00292000
*%IF VDRSARRNUM = '' %THEN                                              00293000
*  %VDRSARRNUM = '*';                                                   00294000
*DCL 1 VDRSARR (VDRSARRNUM) VDRSARRSTORAGE BDY(DWORD), /* VARY Device   00295000
*                                     Service Results Array          */ 00296000
*      3 VDRSARR_OUTPUT_FLAGS CHAR(2), /* Output flags               */ 00297000
*        5 VDRSARR_OUTPUT_FLAGS1 CHAR(1), /* First byte of output       00298000
*                                     flags                          */ 00299000
*          7 VDRSARR_OUTPUT_VALID BIT(1), /* Device output is valid  */ 00300000
*          7 VDRSARR_MSG_RETURNED BIT(1), /* Message area contains a    00301000
*                                     message                        */ 00302000
*        5 VDRSARR_OUTPUT_FLAGS2 CHAR(1), /* Second byte of output      00303000
*                                     flags                          */ 00304000
*      3 *             CHAR(2),    /* Reserved                       */ 00305000
*      3 VDRSARR_RETCODE FIXED(32), /* Device return code            */ 00306000
*      3 VDRSARR_RSNCODE FIXED(32), /* Device reason code            */ 00307000
*      3 *             CHAR(12),   /* Reserved                       */ 00308000
*      3 VDRSARR_MSGAREA CHAR(71), /* Message area                   */ 00309000
*      3 *             CHAR(9);    /* Reserved                       */ 00310000
*DCL VDRSARR_LENGTH FIXED(32) CONSTANT(LENGTH(VDRSARR)); /* Length of   00311000
*                                     VARY Device Service Results       00312000
*                                     Array Entry                    */ 00313000
*/********************************************************************/ 00314000
*/*                                                                  */ 00315000
*/* Device Return Codes (values for VDRSARR_RETCODE)                 */ 00316000
*/*                                                                  */ 00317000
*/********************************************************************/ 00318000
*DCL VDRSARR_OK               FIXED(32) CONSTANT(0);  /* Successfully   00319000
*                                  varied online/offline or the         00320000
*                                  AUTOSWITCH attribute or the          00321000
*                                  unavailable state for the device     00322000
*                                  was successfully changed      @L5C*/ 00323000
*DCL VDRSARR_ALREADY_OK       FIXED(32) CONSTANT(4);  /* Already        00324000
*                                  online/offline or in requested       00325000
*                                  AUTOSWITCH mode               @L2C*/ 00326000
*DCL VDRSARR_PENDING          FIXED(32) CONSTANT(8);  /* Pending        00327000
*                                  offline                           */ 00328000
*DCL VDRSARR_ONLINE_WITH_REST FIXED(32) CONSTANT(12); /* Online with    00329000
*                                  restrictions                      */ 00330000
*DCL VDRSARR_FAIL             FIXED(32) CONSTANT(16); /* Did not come   00331000
*                                  online/offline or the AUTOSWITCH     00332000
*                                  attribute or the unavailable state   00333000
*                                  was not changed for the device       00334000
*                                                                @L5C*/ 00335000
*DCL VDRSARR_OFF_PENDBOX      FIXED(32) CONSTANT(20); /* Offline and    00336000
*                                  pending boxed                     */ 00337000
*DCL VDRSARR_PENDOFF_PENDBOX  FIXED(32) CONSTANT(24); /* Pending        00338000
*                                  offline and pending boxed         */ 00339000
*DCL VDRSARR_UNEXP_ERR        FIXED(32) CONSTANT(32); /* Unexpected     00340000
*                                  error                             */ 00341000
*/********************************************************************/ 00342000
*/*                                                                  */ 00343000
*/* Device Reason Codes (values for VDRSARR_RSNCODE)                 */ 00344000
*/*                                                                  */ 00345000
*/********************************************************************/ 00346000
*DCL VDRSARR_NO_INFO       FIXED(32) CONSTANT(0);  /* No additional     00347000
*                                  information                       */ 00348000
*DCL VDRSARR_SEE_MSGAREA   FIXED(32) CONSTANT(1);  /* See message       00349000
*                                  area                              */ 00350000
*DCL VDRSARR_NOUCB         FIXED(32) CONSTANT(2);  /* No UCB for        00351000
*                                  device                            */ 00352000
*DCL VDRSARR_UNIT_MUST_BE_OFFLINE FIXED(32) CONSTANT(3); /* Unit must   00353000
*                                  be OFFLINE before its AUTOSWITCH     00354000
*                                  attribute or unavailable state can   00355000
*                                  be changed                    @L5C*/ 00356000
*DCL VDRSARR_DEVICE_NOT_VALID FIXED(32) CONSTANT(4); /* Unit is not a   00357000
*                                  valid device type for the AUTOSWITCH 00358000
*                                  attribute or unavailable state       00359000
*                                                                @L5C*/ 00360000
*DCL VDRSARR_NO_LOG_PATHS  FIXED(32) CONSTANT(6);  /* Device has no     00361000
*                                  logical paths                     */ 00362000
*DCL VDRSARR_NO_PHY_PATHS  FIXED(32) CONSTANT(7);  /* Device has no     00363000
*                                  physical paths                    */ 00364000
*DCL VDRSARR_IN_USE        FIXED(32) CONSTANT(8);  /* Device in use     00365000
*                                  by system function                */ 00366000
*DCL VDRSARR_ABORT         FIXED(32) CONSTANT(9);  /* VARY processing   00367000
*                                  aborted                           */ 00368000
*DCL VDRSARR_DYN_PATH      FIXED(32) CONSTANT(10); /* Dynamic pathing   00369000
*                                  failed                            */ 00370000
*DCL VDRSARR_ASSIGN        FIXED(32) CONSTANT(11); /* Device assigned   00371000
*                                  to another system                 */ 00372000
*DCL VDRSARR_INCOMP_ASSIGN FIXED(32) CONSTANT(12); /* Incompatible      00373000
*                                  assign requested                  */ 00374000
*DCL VDRSARR_ASSIGN_FAILED FIXED(32) CONSTANT(13); /* Assign failed  */ 00375000
*DCL VDRSARR_PENDOFF_BOXED FIXED(32) CONSTANT(14); /* Pending offline   00376000
*                                  and boxed                     @D1C*/ 00377000
*DCL VDRSARR_KEPT_OFFLINE_CM FIXED(32) CONSTANT(15); /* Device being    00378000
*                                  kept offline by a configuration      00379000
*                                  manager                       @D1C*/ 00380000
*DCL VDRSARR_OFFLINE_OPERATOR FIXED(32) CONSTANT(16); /* Device is      00381000
*                                  offline due to operator              00382000
*                                  and cannot be brought online as      00383000
*                                  part of an SMS library operation     00384000
*                                                                @D1A*/ 00385000
*DCL VDRSARR_IN_TAPE_LIB   FIXED(32) CONSTANT(17); /* Device is         00386000
*                                  in a system-managed tape             00387000
*                                  library                       @D1A*/ 00388000
*DCL VDRSARR_IN_USE_BY_CUIR FIXED(32) CONSTANT(18); /* Device is        00389000
*                                  in use by C.U.I.R.            @D1A*/ 00390000
*DCL VDRSARR_NOT_ELIGIBLE FIXED(32) CONSTANT(19); /* Device is          00391000
*                                  not eligible for a vary operation    00392000
*                                  (e.g., device is SYSRES or           00393000
*                                  non-base multiple exposure)   @D1A*/ 00394000
*DCL VDRSARR_VOLUME_NOT_READ FIXED(32) CONSTANT(20); /* Volume could    00395000
*                                  not be read                   @D3A*/ 00396000
*DCL VDRSARR_MANAGED_BY_JES3 FIXED(32) CONSTANT(21); /* Device is       00397000
*                                  managed by JES3               @D3A*/ 00398000
*DCL VDRSARR_CONSOLE_CHANGING FIXED(32) CONSTANT(22); /* Device is      00399000
*                                  the console device for a console     00400000
*                                  which is currently changing          00401000
*                                  console status                @D3A*/ 00402000
*DCL VDRSARR_CONSOLE_IO FIXED(32) CONSTANT(23); /* Device is the        00403000
*                                  console device for a console which   00404000
*                                  has invalid input/output             00405000
*                                  capabilities                  @D3A*/ 00406000
*DCL VDRSARR_MASTER_OFF_FORCE FIXED(32) CONSTANT(24); /* Device is      00407000
*                                  the console device for the master    00408000
*                                  console and the OFFLINE and FORCE    00409000
*                                  keywords were not specified.         00410000
*                                  This value is not used in            00411000
*                                  HBB7730 or above.             @L4C*/ 00412000
*DCL VDRSARR_MASTER_OTHER_ACT FIXED(32) CONSTANT(25); /* Device is      00413000
*                                  the console device for the master    00414000
*                                  console and there is at least one    00415000
*                                  other active full capability         00416000
*                                  console.                             00417000
*                                  This value is not used in            00418000
*                                  HBB7730 or above.             @L4C*/ 00419000
*DCL VDRSARR_MASTER_MSTCONS FIXED(32) CONSTANT(26); /* Device is the    00420000
*                                  console device for the master        00421000
*                                  console and the VARY MSTCONS         00422000
*                                  command can be accepted from any     00423000
*                                  console.                             00424000
*                                  This value is not used in            00425000
*                                  HBB7730 or above.             @L4C*/ 00426000
*DCL VDRSARR_MASTER_CANDIDATE FIXED(32) CONSTANT(27); /* Device is the  00427000
*                                  console device for the master        00428000
*                                  console candidate or the local       00429000
*                                  candidate.                           00430000
*                                  This value is not used in            00431000
*                                  HBB7730 or above.             @L4C*/ 00432000
*DCL VDRSARR_HARDCOPY_CONSOLE FIXED(32) CONSTANT(28); /* Device is the  00433000
*                                  console device for the hardcopy      00434000
*                                  console                              00435000
*                                  Note: this return code is no longer  00436000
*                                  used as of JBB7727.           @L3C*/ 00437000
*DCL VDRSARR_DEVICE_RESERVED  FIXED(32) CONSTANT(29); /* Device is      00438000
*                                  not allowed to be OFFLINEd when      00439000
*                                  it is reserved                @P1A*/ 00440000
* @LOGIC;                                                               00441000
* #PRAGMA TOOL=CBGEN.                                                   00442000
* #USEORG.                                                              00443000
* #ALIGNOP.                                                             00444000
* #EPRAGMA.                                                             00445000
* @ENDLOGIC;                                                            00446000
*/* End of PL/X Source                                               */ 00447000
* %IF IEEZB834_LIST ^= 'NO' &                                           00448000
*    ZCBPRINT ^= 'NO' %THEN                                             00449000
*   %GOTO IEEZB834_4;                                                   00450000
*   @LIST POP NOECHO;                                                   00451000
* %IEEZB834_4:;                                                         00452000
* %END;                                                                 00453000
