*                                                                       00001000
* %DCL IEFDELT_INCLUDED CHAR EXT;                                       00002000
* %DEACTIVATE IEFDELT_INCLUDED;                                         00003000
* %IF IEFDELT_INCLUDED = '' %THEN                                       00004000
* %DO;                                                                  00005000
*/* Macro made bi-lingual on 11340. CBGEN compile date 11090         */ 00006000
*% /*                                                                   00007000
         MACRO                                                          00008000
         IEFDELT &DSECT=YES,&LIST=YES,&TITLE=YES,&ELT=YES               00009000
         GBLC  &IEFDELT_INCLUDED                                        00010000
         GBLC  &ZCBPRINT                                                00011000
&IEFDELT_INCLUDED SETC 'YES'                                            00012000
         AIF   ('&LIST' EQ 'NONE').P0                                   00013000
         AIF   ('&TITLE' EQ 'NO').P5                                    00014000
 TITLE   'IEFDELT  - Eligible Device Table (EDT) Latch Table     '      00015000
.P5      ANOP                                                           00016000
**/ IEFDELT_1:;                                                         00017000
*/*START OF SPECIFICATIONS *******************************************/ 00018000
*/*                                                                  */ 00019000
*/*01*   MACRO NAME: IEFDELT                                         */ 00020000
*/*                                                                  */ 00021000
*/*01* DESCRIPTIVE NAME: Eligible Device Table (EDT) Latch Table     */ 00022000
*/*                                                                  */ 00023000
*/*02*   ACRONYM:  ELT                                               */ 00024000
*/*                                                                  */ 00025000
*/*01* DSECT-NAME: ELT                                               */ 00026000
*/*                                                                  */ 00027000
*/*01* PROPRIETARY STATEMENT=                                        */ 00028000
*/**PROPRIETARY_STATEMENT*********************************************/ 00029000
*/*                                                                  */ 00030000
*/*                                                                  */ 00031000
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00032000
*/* 5650-ZOS COPYRIGHT IBM CORP. 1997, 2013                          */ 00033000
*/*                                                                  */ 00034000
*/* STATUS= HBB7790                                                  */ 00035000
*/*                                                                  */ 00036000
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 00037000
*/*                                                                  */ 00038000
*/*01* COMPONENT: Allocation (SC1B4)                                 */ 00039000
*/*                                                                  */ 00040000
*/*01* DISTRIBUTION LIBRARY: AMACLIB                                 */ 00041000
*/*                                                                  */ 00042000
*/*01* EYE CATCHER: ELT                                              */ 00043000
*/*02*  OFFSET: 0                                                    */ 00044000
*/*02*  LENGTH: 4                                                    */ 00045000
*/*                                                                  */ 00046000
*/*01* FUNCTION = Maps the output areas for the EDTINFO RTNEDTLT     */ 00047000
*/*               service.                                           */ 00048000
*/*                                                                  */ 00049000
*/*01* CREATED BY: IEFEIS01                                          */ 00050000
*/*                                                                  */ 00051000
*/*01* DELETED BY: Callers of the EDTINFO RTNEDTLT service (under    */ 00052000
*/*                normal conditions) or IEFEIS02 (under exceptional */ 00053000
*/*                conditions).                                      */ 00054000
*/*                                                                  */ 00055000
*/*01* POINTED TO BY: BASED()                                        */ 00056000
*/*                                                                  */ 00057000
*/*01* STORAGE-ATTRIBUTES: Private high, pageable                    */ 00058000
*/*02*  SUBPOOL: 230                                                 */ 00059000
*/*02*  KEY: Caller key                                              */ 00060000
*/*02*  RESIDENCY: ANY                                               */ 00061000
*/*02*  MAIN STORAGE: YES                                            */ 00062000
*/*02*  AUXILIARY STORAGE: N/A                                       */ 00063000
*/*02*  VIRTUAL STORAGE: N/A                                         */ 00064000
*/*                                                                  */ 00065000
*/*01* SIZE:                                                         */ 00066000
*/*            ELT -- X'0040' bytes                                  */ 00067000
*/*                                                                  */ 00068000
*/*01* SERIALIZATION: None                                           */ 00069000
*/*                                                                  */ 00070000
*/*01* DEPENDENCIES: The EDT Latch Table must be freed by the caller */ 00071000
*/*                  of the EDTINFO RTNEDTLT service.  The length of */ 00072000
*/*                  the EDT Latch Table is located in field         */ 00073000
*/*                  ELT_LENGTH and the subpool number is located in */ 00074000
*/*                  field ELT_SUBPOOL.                              */ 00075000
*/*                                                                  */ 00076000
*/*01* RESTRICTIONS: Caller of EDTINFO RTNLATCH must be an           */ 00077000
*/*                  authorized caller (Supervisor state and Program */ 00078000
*/*                  Key Mask (PKM) 0).                              */ 00079000
*/*                                                                  */ 00080000
*/*01* MODULE TYPE = Bilingual macro                                 */ 00081000
*/*                                                                  */ 00082000
*/*01* PROCESSOR = PLX Compiler, Assembler H                         */ 00083000
*/*                                                                  */ 00084000
*/*01* METHOD OF ACCESS:                                             */ 00085000
*/*                                                                  */ 00086000
*/*02* ASM: IEFDELT                                                  */ 00087000
*/*           ,LIST=YES!NO  to control whether or not the macro      */ 00088000
*/*                         will appear in the assembler listing.    */ 00089000
*/*                                                                  */ 00090000
*/*02*  PL/X: %INCLUDE SYSLIB(IEFDELT)                               */ 00091000
*/*                                                                  */ 00092000
*/*     Printing of the macro expansion can be controlled by the     */ 00093000
*/*     IEFDELT_LIST global macro variable.  Any value other than    */ 00094000
*/*     'NO' will result in the macro expansion being printed.  The  */ 00095000
*/*     default is 'YES'.  The following examples illustrate how the */ 00096000
*/*     IEFDELT_LIST variable should be set.                         */ 00097000
*/*                                                                  */ 00098000
*/*       PL/X:  %IEFDELT_LIST='YES'  %IEFDELT_LIST='NO'             */ 00099000
*/*                                                                  */ 00100000
*/*01* EXTERNAL CLASSIFICATION: PI                               @P2C*/ 00101000
*/*                                                                  */ 00102000
*/*01* END OF EXTERNAL CLASSIFICATION:                               */ 00103000
*/*                                                                  */ 00104000
*/*01* NOTES =                                                       */ 00105000
*/*                                                                  */ 00106000
*/*   1.  A global variable IEFDELT_INCLUDED is set to YES the       */ 00107000
*/*       first time the macro is invoked.                           */ 00108000
*/*            ASM:  This variable can be checked by the caller, to  */ 00109000
*/*                  determine if the macro has already been invoked.*/ 00110000
*/*           PL/X:  This variable is checked in the macro code to   */ 00111000
*/*                  determine if the control block should be        */ 00112000
*/*                  included.                                       */ 00113000
*/*                                                                  */ 00114000
*/*01*   CHANGE ACTIVITY =                                           */ 00115000
*/*                                                                  */ 00116000
*/* $MAC(IEFDELT),COMP(SC1B4): Eligible Device Table Latch Table     */ 00117000
*/*                                                                  */ 00118000
*/* $L0=OW18119  HBB4430 960607 PDMC: Map out EDT Latch Table        */ 00119000
*/* $P1=ME09708  HBB7750 070531 PDTA: RTNEDTLT multiple BINDs        */ 00120000
*/* $P2=ME21371  HBB7790 111213 PDTA: Intermediate EDT display   @P2A*/ 00121000
*/*                                                                  */ 00122000
*/*END OF SPECIFICATIONS *********************************************/ 00123000
*% /*                                                                   00124000
.P0      ANOP                                                           00125000
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 00126000
         AIF   ('&LIST' EQ 'YES').P2                                    00127000
.P1      ANOP                                                           00128000
         PUSH  PRINT                                                    00129000
         PRINT OFF                                                      00130000
.P2      ANOP                                                           00131000
         AIF   ('&ELT' EQ 'NO').L0002                                   00132000
         AIF   ('&DSECT' EQ 'YES').L0003                                00133000
         AIF   ('&ELT' NE 'YES').L0002                                  00134000
.L0003   ANOP                                                           00135000
*                                                                       00136000
*   IEFDELT  - A - Add ELT_ORIGINAL, ELT_INTERMED, and ELT_FINAL        00137000
*                  flags.                                               00138000
*   IEFDELT  - A - Add ELT_BIND_COUNT, update ELT_BINDS description     00139000
*                                                                       00140000
*                                                                       00141000
*                                                                       00142000
         AIF   ('&DSECT' EQ 'YES').L0004                                00143000
ELT      DS    0D                                                       00144000
         AGO   .L0005                                                   00145000
.L0004   ANOP                                                           00146000
ELT      DSECT                                                          00147000
.L0005   ANOP                                                           00148000
ELT_HEADER DS  CL32      ELT header                                     00149000
         ORG   ELT_HEADER                                               00150000
ELT_ID   DS    CL4       Eye-catcher 'ELT '                             00151000
ELT_VERSION DS X         Version number                                 00152000
ELT_SUBPOOL DS X         Subpool where the ELT resides                  00153000
ELT_FLAGS DS   CL1       Flags                                          00154000
*  Bit definitions:                                                     00155000
ELT_EDTVAL EQU X'80'     EDT for this ELT exists                        00156000
*                                                                       00157000
*      ***************************************************************  00158000
*      *                                                             *  00159000
*      * The original/intermediate/final ELT flags are only set when *  00160000
*      * transitioning from one EDT to another. If no EDT transition *  00161000
*      * is occurring, none will be set.                                00162000
*      *                                                             *  00163000
*      ***************************************************************  00164000
*                                                                       00165000
*                                                                       00166000
ELT_ORIGINAL EQU X'40'   EDT for this ELT is the original EDT           00167000
ELT_INTERMED EQU X'20'   EDT for this ELT is the intermediate EDT       00168000
ELT_FINAL EQU  X'10'     EDT for this ELT is the final EDT              00169000
         DS    CL1       Reserved                                       00170000
ELT_LENGTH DS  F         Total length of ELT (ELT header + ELT         *00171000
                         entries)                                       00172000
ELT_COUNT DS   F         Count of valid latch entries                   00173000
ELT_BINDS DS   F         Total number of address spaces bound on the   *00174000
                         EDT                                            00175000
         DS    CL12      Reserved                                       00176000
ELT_ENTRY DS   CL32      ELT entry                                      00177000
         ORG   ELT_ENTRY                                                00178000
ELT_ASID DS    H         Asid where latch exists                        00179000
         DS    CL2       Reserved                                       00180000
ELT_JOBNAME DS CL8       Jobname holding latch                          00181000
ELT_BIND_COUNT DS F      Count of binds for this address space          00182000
         DS    CL16      Reserved                                       00183000
*                                                                       00184000
* ********************************************************************  00185000
* * Constants                                                        *  00186000
* ********************************************************************  00187000
*                                                                       00188000
*                                                                       00189000
ELT_ELT  EQU   C'ELT '   ELT control block ID                           00190000
ELT_VER  EQU   1         ELT control block version number               00191000
ELT_CUR_VER EQU 1        ELT current version number                     00192000
ELT_SPN  EQU   230       ELT subpool number                             00193000
ELT_MAX_ENT EQU 15       Maximum of 15 latch entries                    00194000
ELT_LEN  EQU   *-ELT                                                    00195000
.L0002   ANOP                                                           00196000
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 00197000
         AIF   ('&LIST' EQ 'YES').P4                                    00198000
.P3      ANOP                                                           00199000
         POP   PRINT                                                    00200000
.P4      ANOP                                                           00201000
.P_EXIT  ANOP                                                           00202000
         MEND                                                           00203000
**/ IEFDELT_2:;                                                         00204000
* %IEFDELT_INCLUDED = 'YES';                                            00205000
* %DCL ZCBPRINT CHAR EXT;                                               00206000
* %DEACTIVATE ZCBPRINT;                                                 00207000
* %DCL IEFDELT_LIST CHAR EXT;                                           00208000
* %DEACTIVATE IEFDELT_LIST;                                             00209000
* %IF IEFDELT_LIST ^= 'NO' &                                            00210000
*    ZCBPRINT ^= 'NO' %THEN                                             00211000
*   %GOTO IEFDELT_3;                                                    00212000
*   @LIST PUSH NOECHO;                                                  00213000
*   @LIST NOASSEMBLE NOECHO;                                            00214000
*   @LIST OFF C NOECHO;                                                 00215000
* %IEFDELT_3:;                                                          00216000
*/* Start of PL/X Source                                             */ 00217000
*/* IEFDELT  - A - Add ELT_ORIGINAL, ELT_INTERMED, and ELT_FINAL     */ 00218000
*/*                flags.                                        @P2A*/ 00219000
*/* IEFDELT  - A - Add ELT_BIND_COUNT, update ELT_BINDS description  */ 00220000
*/*                                                              @P1A*/ 00221000
*                                                                       00222000
*DECLARE                                                                00223000
* 1 ELT    BDY(DWORD) BASED,                                            00224000
*   3 ELT_HEADER   CHAR(32) BDY(DWORD),  /* ELT header               */ 00225000
*     5 ELT_ID       CHAR(4),    /* Eye-catcher 'ELT '               */ 00226000
*     5 ELT_VERSION  FIXED(8),   /* Version number                   */ 00227000
*     5 ELT_SUBPOOL  FIXED(8),   /* Subpool where the ELT resides    */ 00228000
*     5 ELT_FLAGS    CHAR(1),    /* Flags                            */ 00229000
*       7 ELT_EDTVAL   BIT(1),   /* EDT for this ELT exists          */ 00230000
*       /* The original/intermediate/final ELT flags are only set       00231000
*          when transitioning from one EDT to another.  If no EDT       00232000
*          transition is occurring, none will be set.            @P2A*/ 00233000
*       7 ELT_ORIGINAL BIT(1),   /* EDT for this ELT is the original    00234000
*                                   EDT                          @P2A*/ 00235000
*       7 ELT_INTERMED BIT(1),   /* EDT for this ELT is the             00236000
*                                   intermediate EDT             @P2A*/ 00237000
*       7 ELT_FINAL    BIT(1),   /* EDT for this ELT is the final       00238000
*                                   EDT                          @P2A*/ 00239000
*       7 *            BIT(4),   /* Reserved                         */ 00240000
*     5 *            CHAR(1),    /* Reserved                         */ 00241000
*     5 ELT_LENGTH   FIXED(31),  /* Total length of ELT (ELT header +   00242000
*                                   ELT entries)                     */ 00243000
*     5 ELT_COUNT    FIXED(31),  /* Count of valid latch entries     */ 00244000
*     5 ELT_BINDS    FIXED(31),  /* Total number of address spaces      00245000
*                                   bound on the EDT             @P1C*/ 00246000
*     5 *            CHAR(12),   /* Reserved                         */ 00247000
*   3 ELT_ENTRY(*) CHAR(32) BDY(DWORD),  /* ELT entry                */ 00248000
*     5 ELT_ASID     FIXED(16),  /* Asid where latch exists          */ 00249000
*     5 *            CHAR(2),    /* Reserved                         */ 00250000
*     5 ELT_JOBNAME  CHAR(8),    /* Jobname holding latch            */ 00251000
*     5 ELT_BIND_COUNT FIXED(31), /* Count of binds for this address    00252000
*                                   space                        @P1A*/ 00253000
*     5 *            CHAR(16);   /* Reserved                     @P1C*/ 00254000
*                                                                       00255000
*/********************************************************************/ 00256000
*/* Constants                                                        */ 00257000
*/********************************************************************/ 00258000
*DECLARE                                                                00259000
*  ELT_ELT CHAR(4)   CONSTANT('ELT '), /* ELT control block ID       */ 00260000
*  ELT_VER FIXED(8)  CONSTANT(1),      /* ELT control block version     00261000
*                                         number                     */ 00262000
*  ELT_CUR_VER FIXED(8)  CONSTANT(1),  /* ELT current version number */ 00263000
*  ELT_SPN FIXED(8)  CONSTANT(230),    /* ELT subpool number         */ 00264000
*  ELT_MAX_ENT FIXED(8)  CONSTANT(15); /* Maximum of 15 latch entries   00265000
*                                                                    */ 00266000
*@LOGIC;                                                                00267000
*#PRAGMA TOOL=CBGEN.                                                    00268000
*#USEORG.                                                               00269000
*#EPRAGMA.                                                              00270000
*@ENDLOGIC;                                                             00271000
*/* End of PL/X Source                                               */ 00272000
* %IF IEFDELT_LIST ^= 'NO' &                                            00273000
*    ZCBPRINT ^= 'NO' %THEN                                             00274000
*   %GOTO IEFDELT_4;                                                    00275000
*   @LIST POP NOECHO;                                                   00276000
* %IEFDELT_4:;                                                          00277000
* %END;                                                                 00278000
