*                                                                       00001000
* %DCL IEFDISXT_INCLUDED CHAR EXT;                                      00002000
* %DEACTIVATE IEFDISXT_INCLUDED;                                        00003000
* %IF IEFDISXT_INCLUDED = '' %THEN                                      00004000
* %DO;                                                                  00005000
*/* Macro made bi-lingual on 09320. CBGEN compile date 09235         */ 00006000
*% /*                                                                   00007000
         MACRO                                                          00008000
         IEFDISXT &DSECT=YES,&LIST=YES,&TITLE=YES,&DISXT_PARMLIST=YES   00009000
         GBLC  &IEFDISXT_INCLUDED                                       00010000
         GBLC  &ZCBPRINT                                                00011000
&IEFDISXT_INCLUDED SETC 'YES'                                           00012000
         AIF   ('&LIST' EQ 'NONE').P0                                   00013000
         AIF   ('&TITLE' EQ 'NO').P5                                    00014000
 TITLE   'IEFDISXT  - IEF_ALLC_MOD exit parameter list                '*00015000
                                                                        00016000
.P5      ANOP                                                           00017000
**/ IEFDISXT_1:;                                                        00018000
*/* START OF SPECIFICATIONS ******************************************* 00019000
*                                                                       00020000
*01* PROPRIETARY STATEMENT =                                            00021000
*                                                                       00022000
*    LICENSED MATERIALS - PROPERTY OF IBM                               00023000
*    5694-A01 COPYRIGHT IBM CORP. 2010                                  00024000
*                                                                       00025000
*01* STATUS = HBB7770                                                   00026000
*                                                                       00027000
*01* END OF PROPRIETARY STATEMENT                                       00028000
*                                                                       00029000
*01* EXTERNAL CLASSIFICATION: PI                                        00030000
*01* END OF EXTERNAL CLASSIFICATION:                                    00031000
*                                                                       00032000
*01* DESCRIPTIVE NAME: IEF_ALLC_MOD exit parameter list                 00033000
*02*  ACRONYM:  DISXT                                                   00034000
*                                                                       00035000
*01* MACRO NAME:  IEFDISXT                                              00036000
*                                                                       00037000
*01* DSECT NAME:                                                        00038000
*     DISXT_PARMLIST                                                    00039000
*                                                                       00040000
*01* COMPONENT:  Allocation (SC1B4)                                     00041000
*                                                                       00042000
*01* EYE-CATCHER:  DISXT                                                00043000
*02*  OFFSET:   0                                                       00044000
*02*  LENGTH:   6                                                       00045000
*                                                                       00046000
*01* STORAGE ATTRIBUTES:                                                00047000
*02*   VIRTUAL STORAGE: YES                                             00048000
*02*   SUBPOOL:  230                                                    00049000
*02*   KEY:  1                                                          00050000
*                                                                       00051000
*01* SIZE:  56 bytes                                                    00052000
*            DISXT_PARMLIST -- X'0038' bytes                            00053000
*                                                                       00054000
*01* CREATED BY:                                                        00055000
*     IEFADSMD                                                          00056000
*                                                                       00057000
*01* POINTED TO BY:                                                     00058000
*     Register 1 on entry                                               00059000
*                                                                       00060000
*01* SERIALIZATION:                                                     00061000
*     None.                                                             00062000
*                                                                       00063000
*01* FUNCTION:                                                          00064000
*02* Contains area for parmlist of IEF_ALLC_MOD                         00065000
*                                                                       00066000
*01* METHOD OF ACCESS:                                                  00067000
*02*  ASM:  N/A                                                         00068000
*02*  PL/AS:                                                            00069000
*      %INCLUDE SYSLIB(IEFDISXT)                                        00070000
*                                                                       00071000
*01* DELETED BY:                                                        00072000
*     IEFADSMD                                                          00073000
*                                                                       00074000
*01* FREQUENCY:                                                         00075000
*     1 per invocation of IEFDDSRV MODIFY ALLOCATION                    00076000
*                                                                       00077000
*01* DEPENDENCIES:                                                      00078000
*      None                                                             00079000
*                                                                       00080000
*01* DISTRIBUTION LIBRARY:  APLSLIB                                     00081000
*                                                                       00082000
*01* CHANGE ACTIVITY:                                                   00083000
*   $L0=ALLOPERF,HBB7770,090630,PDHV: Allocation Performance            00084000
*                                     IEFDDSRV MODIFY                   00085000
*   $P1=ME16649 ,HBB7770,091020,PDQV: Asset Protestion Errors           00086000
*                                                                       00087000
* END OF SPECIFICATIONS *********************************************/  00088000
*% /*                                                                   00089000
.P0      ANOP                                                           00090000
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 00091000
         AIF   ('&LIST' EQ 'YES').P2                                    00092000
.P1      ANOP                                                           00093000
         PUSH  PRINT                                                    00094000
         PRINT OFF                                                      00095000
.P2      ANOP                                                           00096000
         AIF   ('&DISXT_PARMLIST' EQ 'NO').L0002                        00097000
         AIF   ('&DSECT' EQ 'YES').L0003                                00098000
         AIF   ('&DISXT_PARMLIST' NE 'YES').L0002                       00099000
.L0003   ANOP                                                           00100000
*                                                                       00101000
*   Start of Detailed change history ********************************   00102000
*  IEFDISXT -C- Make module non-OCO & update copyright statement.       00103000
*   - Initial release                                                   00104000
*   End of detailed change history *********************************    00105000
*                                                                       00106000
*                                                                       00107000
         AIF   ('&DSECT' EQ 'YES').L0004                                00108000
DISXT_PARMLIST DS 0F                                                    00109000
         AGO   .L0005                                                   00110000
.L0004   ANOP                                                           00111000
DISXT_PARMLIST DSECT                                                    00112000
.L0005   ANOP                                                           00113000
DISXT_ID DS    CL6       Eyecatcher - 'DISXT '                          00114000
DISXT_VERSION DS H       Version of this parmlist                       00115000
DISXT_LEN DS   H         Length of the parmlist                         00116000
DISXT_FN DS    H         Modify function                                00117000
DISXT_JOBNAME DS CL8     Job name                                       00118000
DISXT_PROCSTEPNAME DS CL8 the name of the step in the procedure         00119000
DISXT_STEPNAME DS CL8    job step name                                  00120000
DISXT_PARMS DS CL20      modify parameters                              00121000
         ORG   DISXT_PARMS                                              00122000
DISXT_MODIFYALLOCATION DS CL20 For modify allocation                    00123000
         ORG   DISXT_MODIFYALLOCATION                                   00124000
DISXT_MOD_DSAB@ DS A     address of the DSAB of the affected DD         00125000
DISXT_OLD_DDNAME DS CL8  DD name before modify                          00126000
DISXT_NEW_DDNAME DS CL8  DD name after modify                           00127000
*                                                                       00128000
*    Modify function constants                                          00129000
*                                                                       00130000
*                                                                       00131000
KDISXT_VERSION_1 EQU 1                                                  00132000
*                                                                       00133000
*    DISXT_len (modify function) constants                              00134000
*                                                                       00135000
*                                                                       00136000
KDISXT_MODDDNAME EQU 1                                                  00137000
DISXT_PARMLIST_LEN EQU *-DISXT_PARMLIST                                 00138000
.L0002   ANOP                                                           00139000
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 00140000
         AIF   ('&LIST' EQ 'YES').P4                                    00141000
.P3      ANOP                                                           00142000
         POP   PRINT                                                    00143000
.P4      ANOP                                                           00144000
.P_EXIT  ANOP                                                           00145000
         MEND                                                           00146000
**/ IEFDISXT_2:;                                                        00147000
* %IEFDISXT_INCLUDED = 'YES';                                           00148000
* %DCL ZCBPRINT CHAR EXT;                                               00149000
* %DEACTIVATE ZCBPRINT;                                                 00150000
* %DCL IEFDISXT_LIST CHAR EXT;                                          00151000
* %DEACTIVATE IEFDISXT_LIST;                                            00152000
* %IF IEFDISXT_LIST ^= 'NO' &                                           00153000
*    ZCBPRINT ^= 'NO' %THEN                                             00154000
*   %GOTO IEFDISXT_3;                                                   00155000
*   @LIST PUSH NOECHO;                                                  00156000
*   @LIST NOASSEMBLE NOECHO;                                            00157000
*   @LIST OFF C NOECHO;                                                 00158000
* %IEFDISXT_3:;                                                         00159000
*/* Start of PL/X Source                                             */ 00160000
*                                                                       00161000
*/* Start of Detailed change history ********************************   00162000
*  IEFDISXT -C- Make module non-OCO & update copyright statement. @P1A  00163000
*   - Initial release                                                   00164000
*   End of detailed change history **********************************/  00165000
*                                                                       00166000
*%IF DISXT_BASE = '' %THEN                                              00167000
*  %DISXT_BASE = 'TYPE';                                                00168000
* Dcl 1 DISXT_parmlist        DISXT_BASE,                               00169000
*       3 DISXT_id            char(6),  /* Eyecatcher - 'DISXT '     */ 00170000
*       3 DISXT_version       fixed(16), /* Version of this parmlist */ 00171000
*       3 DISXT_len           fixed(16), /* Length of the parmlist   */ 00172000
*       3 DISXT_fn            fixed(16), /* Modify function          */ 00173000
*       3 DISXT_jobname       char(8),  /* Job name                  */ 00174000
*       3 DISXT_procstepname  char(8),  /* the name of the step in the  00175000
*                                          procedure                 */ 00176000
*       3 DISXT_stepname      char(8),  /* job step name             */ 00177000
*       3 DISXT_parms         UNION,    /* modify parameters         */ 00178000
*         5 DISXT_ModifyAllocation,     /* For modify allocation     */ 00179000
*           7 DISXT_Mod_dsab@   Ptr,    /* address of the DSAB of the   00180000
*                                          affected DD               */ 00181000
*           7 DISXT_old_ddname  char(8), /* DD name before modify    */ 00182000
*           7 DISXT_new_ddname  char(8); /* DD name after modify     */ 00183000
*                                                                       00184000
* Dcl kDISXT_eyecatcher char(6) constant('DISXT ');                     00185000
* /* Modify function constants */                                       00186000
* Dcl kDISXT_version_1 fixed(16) constant(1);                           00187000
* /* DISXT_len (modify function) constants */                           00188000
* Dcl kDISXT_ModDDname fixed(16) constant(1);                           00189000
*                                                                       00190000
* @LOGIC;                                                               00191000
* #PRAGMA TOOL=CBGEN.                                                   00192000
* #USEORG.                                                              00193000
* #DELETE.kDISXT_eyecatcher                                             00194000
* #EPRAGMA.                                                             00195000
* @ENDLOGIC;                                                            00196000
*/* End of PL/X Source                                               */ 00197000
* %IF IEFDISXT_LIST ^= 'NO' &                                           00198000
*    ZCBPRINT ^= 'NO' %THEN                                             00199000
*   %GOTO IEFDISXT_4;                                                   00200000
*   @LIST POP NOECHO;                                                   00201000
* %IEFDISXT_4:;                                                         00202000
* %END;                                                                 00203000
