*        % GOTO FPTPRO;   /*                                            00010000
         MACRO                                                          00020000
         IEFINFPT                                                       00030000
.*/      %FPTPRO: ;                                                     00040000
*/* START OF SPECIFICATIONS ******************************************/ 00050000
*/*                                                                  */ 00060000
*/* MODULE NAME = IEFINFPT                                           */ 00070000
*/*                                                                  */ 00080000
*/* DESCRIPTIVE NAME = Initiator Footprint Area                      */ 00090000
*/*                                                                  */ 00100000
*/*01* PROPRIETARY STATEMENT=                                        */ 00110000
*/***PROPRIETARY_STATEMENT********************************************/ 00120000
*/*                                                                  */ 00130000
*/*                                                                  */ 00140000
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00150000
*/* 5650-ZOS COPYRIGHT IBM CORP. 1990, 2013                      @L8C*/ 00160004
*/*                                                                  */ 00170000
*/* STATUS= HBB7790                                              @L8C*/ 00180004
*/*                                                                  */ 00190000
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 00200000
*/*                                                                  */ 00210000
*/*01* EXTERNAL CLASSIFICATION: NONE                                 */ 00220000
*/*01* END OF EXTERNAL CLASSIFICATION:                           @P2A*/ 00230000
*/*                                                                  */ 00231000
*/* MODULE TYPE = Bilingual macro                                    */ 00232000
*/*                                                                  */ 00233000
*/* FUNCTION = Maps the structure of the initiator footprint area    */ 00234000
*/*                                                                  */ 00235000
*/* ACRONYM:  INITFPNT                                               */ 00236000
*/*                                                                  */ 00237000
*/* MACRO NAME:  IEFINFPT                                            */ 00238000
*/*                                                                  */ 00239000
*/* DSECT NAME:  FPFPNT                                              */ 00240000
*/*                                                                  */ 00250000
*/* EYE-CATCHER:  INITFPNT                                           */ 00260000
*/*  OFFSET:   0                                                     */ 00270000
*/*  LENGTH:   8                                                     */ 00280000
*/*                                                                  */ 00290000
*/* SIZE = 64 bytes                                                  */ 00300000
*/*                                                                  */ 00310000
*/* NOTES =                                                          */ 00320000
*/*         The initiator footprint is divided into three areas.     */ 00330000
*/*         1) The footprint header contians the constant            */ 00340000
*/*            'INITFPNT' to aid in identifying and locating the     */ 00350000
*/*            initiator footprint area in dumps.                    */ 00360000
*/*         2) The main module flow bits trace the initiator's       */ 00370000
*/*            internal calls.  As each step is started the bits     */ 00380000
*/*            covering the step loop are reset to X'00's.  As each  */ 00390000
*/*            new job is started the bits covering the job and      */ 00400000
*/*            step loops are reset.  When a module is executed it   */ 00410000
*/*            sets the appropriate entry and exit bits in this      */ 00420000
*/*            area.                                                 */ 00430000
*/*         3) Each initiator module has an area in the footprint    */ 00440000
*/*            to trace the resources affected by that module and    */ 00450000
*/*            any external calls.  Upon entry, a module will clear  */ 00460000
*/*            it's module bits before tracing the current call.     */ 00470000
*/*            Since most initiator modules can be called many times */ 00480000
*/*            during the life of an initiator, the bits recorded    */ 00490000
*/*            for a particular module may be from execution of a    */ 00500000
*/*            previous job or step.  The main module flow bits      */ 00510000
*/*            should first be used to determine the current module  */ 00520000
*/*            execution path.  Only the modules in that path will   */ 00530000
*/*            have module bit areas that are current.               */ 00540000
*/*                                                                  */ 00550000
*/*   DEPENDENCIES = none                                            */ 00560000
*/*                                                                  */ 00570000
*/*   RESTRICTIONS = This data area is accessed in 24 bit mode and   */ 00580000
*/*                  must be loaded below the line.  The total       */ 00590000
*/*                  length of the structure can not exceed 256      */ 00600000
*/*                  bytes due to the method used to clear the       */ 00610000
*/*                  structure at initialization.                    */ 00620000
*/*                                                                  */ 00630000
*/********************************************************************/ 00640000
*/*                                                                  */ 00650000
*/* METHOD OF ACCESS =                                               */ 00660000
*/*                                                                  */ 00670000
*/*   PL/S - %INCLUDE SYSLIB(IEFINFPT)                               */ 00680000
*/*   PLAS - %INCLUDE SYSLIB(IEFINFPT)                               */ 00690000
*/*   ASM  - IEFINFPT (dsect version)                                */ 00700000
*/*                                                                  */ 00710000
*/* PARAMETER DESCRIPTION = none                                     */ 00720000
*/*                                                                  */ 00730000
*/********************************************************************/ 00740000
*/*                                                                  */ 00750000
*/* CREATED BY = IEFSD160                                            */ 00760000
*/*                                                                  */ 00770000
*/* POINTED TO BY = LCTFPNT in the LCT                               */ 00780000
*/*                                                                  */ 00790000
*/* DELETED BY = IEFSD161                                            */ 00800000
*/*                                                                  */ 00810000
*/* FREQUENCY = Once per initiator                                   */ 00820000
*/*                                                                  */ 00830000
*/* STORAGE ATTRIBUTES =                                             */ 00840000
*/*                                                                  */ 00850000
*/*   ALLOCATION METHOD = GETMAIN in module IEFSD160                 */ 00860000
*/*   SUBPOOL           = SWA subpool (JSCBSWSP from TCBJSCB)        */ 00870000
*/*   KEY               = 1                                          */ 00880000
*/*   RESIDENCY         = Below 16 MB in virtual storage             */ 00890000
*/*                                                                  */ 00900000
*/* SERIALIZATION = none                                             */ 00910000
*/*                                                                  */ 00920000
*/* COMPONENT = Initiator (SC1B6)                                    */ 00930000
*/*                                                                  */ 00940000
*/* DISTRIBUTION LIBRARY = APVTMACS                                  */ 00950000
*/*                                                                  */ 00960000
*/*                                                                  */ 00970000
*/* CHANGE ACTIVITY =                                                */ 00980000
*/*                                                                  */ 00990000
*/* $L0= SERVC    HBB4410 880111 PDB2: INITIATOR FOOTPRINTING    @L0A*/ 01000000
*/* $L1= SERVC    HBB4410 880411 PDB2: INITIATOR RAS             @L1A*/ 01010000
*/* $01= OY37085  HBB4410 901207 PDCC: Conditional JCL           @01A*/ 01020000
*/* $P1= PH30213  HBB4420 890909 PDCC: Transaction Initiator     @P1A*/ 01030000
*/* $D1= DH30070  HBB4420 900122 PDB3: INITID SYSEVENT           @D1A*/ 01040000
*/* $02= OY41490  HBB4410 910315 PDM1: IEFSD101 calls IEFSD102   @02A*/ 01050000
*/* $L2= APPC1    JBB4422 910510 PDH1: APPC Asynch call          @L2A*/ 01060000
*/* $03= OY44863  HBB4420 910723 PDBG: Second INITID SYSEVENT    @03A*/ 01070000
*/* $04= OY44344  HBB4410 910722 PDM1: Define bits for IEFINSWD  @04A*/ 01080000
*/* $05= OY47692  HBB4410 910930 PDBG: Remove OY41490 footprints @05A*/ 01090000
*/* $L3= POSIX    HBB4430 910731 PDCC: OPEN/MVS Support          @L3A*/ 01100000
*/* $L3= POSIX    HBB4430 910731 PDCC: SHOWHDR format complete   @L3A*/ 01110000
*/* $L4= POSIX    HBB4430 911028 PDCC: OPEN/MVS Support          @L4A*/ 01120000
*/* $L5= TCSAU    HBB4430 911104 PDBG: VSM support & SWA cleanup @L5A*/ 01130000
*/* $L6= POSIX    HBB4430 920108 PDBG: OPEN/MVS Support          @L6A*/ 01140000
*/* $D2= DKB0042  HBB4430 920318 PDBG: OPEN/MVS Support          @D2A*/ 01150000
*/* $P2= PKB0545  HBB4430 920429 PDBG: 10X Defect Elimination    @P2A*/ 01160000
*/* $D3= DCR0083  HBB5510 930517 PDBG: WLM support               @D3A*/ 01170000
*/* $L7= BATCHMOD HBB7780 100827 PDHV: Batch Modernization           */ 01180000
*/*                                    STEP END/EVICT support        */ 01190000
*/*                                    Feature ME19732           @L7A*/ 01200000
*/* $P2= ME19660  HBB7780 110111 PDTY: PropCheck errors          @P2A*/ 01210000
*/* $L8= PARMDD   HBB7790 121130 PDKK: Add PARMDD keyword spport @L8A*/ 01211000
*/*                                    Feature ME25427           @L8A*/ 01212005
*/*                                                                  */ 01220000
*/********************************************************************/ 01230000
*/* END OF SPECIFICATIONS ********************************************/ 01240000
*/*                                                                  */ 01250000
*/* A - 000000-999999                                            @L0A*/ 01260000
*/* C - Changed macro to match changes introduced by the             */ 01270000
*/*     Initiator RAS line item in SP410                         @L1A*/ 01280000
*/* C - Changed macro to match changes introduced by the             */ 01290000
*/*     Conditional JCL line item in SP410                       @01A*/ 01300000
*/* C - Changed macro to match changes introduced by APPC1       @P1A*/ 01310000
*/* A - Added footprints for SYSEVENT INITID in IEFSD160         @D1A*/ 01320000
*/* C - Defined footprints for entry & exit to IEFSD102 within       */ 01330000
*/*     IEFSD101.                                                @02A*/ 01340000
*/* A - Added footprints for call to ATBAMR1 in IEFSD164         @L2A*/ 01350000
*/* C - Changed names of footprints for first SYSEVENT               */ 01360000
*/*     INITID in IEFSD160.                                      @03A*/ 01370000
*/* A - Added footprints for second SYSEVENT INITID in IEFSD160  @03A*/ 01380000
*/* C - Defined footprints for entry & exit to IEFINSWD, and bits    */ 01390000
*/*     for internal processing within IEFINSWD.                 @04A*/ 01400000
*/* C - The footprints introduced for OY41490 were removed because   */ 01410000
*/*     IEFSD102 already contains footprints for entry and exit. @05A*/ 01420000
*/* D - Deleted footprints from IEFSD263 that moved to IEFINWTE  @L3A*/ 01430000
*/* A - Added footprints for IEFINWTE                            @L3A*/ 01440000
*/* C - Redefined footprint as FPWEOPEN, since OPEN/MVS can      @L4A*/ 01450000
*/*     request more than one function.                          @L4A*/ 01460000
*/* C - Removed footprints within IEFSD162 defined by OY37085    @L4A*/ 01470000
*/* A - Added footprints for invocations of IEFINSWD in modules      */ 01480000
*/*     IEFSD161, IEFSD166, IEFIB600 and IEFIB645.               @L5A*/ 01490000
*/* A - Added footprints for VSM invocation/return in modules        */ 01500000
*/*     IEFINSWD and IEFIB600.                                   @L5A*/ 01510000
*/* D - Removed footprints that were made superfluous as a result    */ 01520000
*/*     of the invocation of IEFINSWD in modules IEFSD161,           */ 01530000
*/*     IEFSD166, IEFIB600 and IEFIB645.                         @L5A*/ 01540000
*/* D - Removed SWA Manager invocation footprints from IEFSD161. @L5A*/ 01550000
*/* A - Added extra storage for footprints.                      @L5A*/ 01560000
*/* A - Added footprints for new module IEFINSTR.                @L6A*/ 01570000
*/* D - Removed ATBAMR1 invocation footprints from IEFSD164.     @L6A*/ 01580000
*/* A - Added footprints for IEFINSTR invocation/return in       @D2A*/ 01590000
*/*     modules IEFSD162 and IEFSD164.                           @D2A*/ 01600000
*/* A - Added footprints in the following modules:               @P2A*/ 01610000
*/*      IEFSD101 for IEFPPSCN invocation/return                 @P2A*/ 01620000
*/*      IEFSD161 for IEFPPSCN invocation/return,                @P2A*/ 01630000
*/*               and for ENQ & DEQ                              @P2A*/ 01640000
*/*      IEFSD166 for RACROUTE invocation/return                 @P2A*/ 01650000
*/*      IEFSD263 for GVRGN routine invocation/return            @P2A*/ 01660000
*/*      IEFIB600 for IEFSSREQ                                   @P2A*/ 01670000
*/*      IEFIB605 for IEFXBTDS invocation/return                 @P2A*/ 01680000
*/*      IEFIB621 for 2nd INITDET SYSEVENT                       @P2A*/ 01690000
*/* D - Deleted footprints from the following modules:           @P2A*/ 01700000
*/*      IEFIB605 for SWAREQ call                                @P2A*/ 01710000
*/*      IEFICATL for SWAREQ call and one of the IEFAB4F5 fp's.  @P2A*/ 01720000
*/* D - Deleted FP03PTY footprint for IEFSD103 because it no     @D3A*/ 01730000
*/*     longer sets the priority.                                @D3A*/ 01740000
*/* A - Added footprints for Step End SSI invocation/return in       */ 01750000
*/*     modules IEFSD164.                                        @L7A*/ 01760000
*/* A - SHOWHDR compliance                                       @P2A*/ 01770000
*/* A - Added FP62PMDO footprint to FP162B4 to indicate that the @L8A*/ 01771001
*/*     data set associated with the PARMDD DDname is OPEN and   @L8A*/ 01772001
*/*     added FP62PMDX footprint to FP162B4 to indicate that the @L8A*/ 01773001
*/*     data set associated with the PARMDD DDname is CLOSED.    @L8A*/ 01774001
*/*     Corrected FP64SSEE and FP64SSEX ASM equates to agree     @L8A*/ 01775002
*/*     with the PLX bit assignments.                            @L8A*/ 01776003
*/*     Added FP64PMDX footprint to FP164B4 to indicate that the @L8A*/ 01777002
*/*     data set associated with the PARMDD DDname is CLOSED.    @L8A*/ 01778002
*/*                                                                  */ 01780000
*/********************************************************************/ 01790000
*        % GOTO FPTBSL;   /*                                            01800000
FPFPNT   DSECT                                                          01810000
         DS    0F                                                       01820000
FPNAME   DS    CL8                     FOOTPRINT HEADER                 01830000
*                                       'INITFPNT'                      01840000
FPINIT   DS    0XL1                    INITIATOR BITS                   01850000
FPINITB1 DS    XL1                                                      01860000
FP160E   EQU    X'80'                   IEFSD160 ENTERED                01870000
FP160X   EQU    X'40'                   IEFSD160 EXITED                 01880000
*        EQU    *                       6 UNUSED                        01890000
*                                                                       01900000
FPJOB    DS    0XL4                    JOB BITS                    @L5C 01910000
FPJOBB1  DS    XL1                                                      01920000
FP161E   EQU    X'80'                   IEFSD161 ENTERED                01930000
FP161X   EQU    X'40'                   IEFSD161 EXITED                 01940000
FPTBLE   EQU    X'20'                   IEFDSTBL ENTERED                01950000
FPTBLX   EQU    X'10'                   IEFDSTBL EXITED                 01960000
FPLSTE   EQU    X'08'                   IEFDSLST ENTERED                01970000
FPLSTX   EQU    X'04'                   IEFDSLST EXITED                 01980000
FP166E   EQU    X'02'                   IEFSD166 ENTERED                01990000
FP166X   EQU    X'01'                   IEFSD166 EXITED                 02000000
FPJOBB2  DS    XL1                                                      02010000
FP620E   EQU    X'80'                   IEFIB620 ENTERED                02020000
FP620X   EQU    X'40'                   IEFIB620 EXITED                 02030000
FP621E   EQU    X'20'                   IEFIB621 ENTERED                02040000
FP621X   EQU    X'10'                   IEFIB621 EXITED                 02050000
FP922E   EQU    X'08'                   IEFI922B ENTERED                02060000
FP922X   EQU    X'04'                   IEFI922B EXITED                 02070000
*        EQU    *                       2 UNUSED                        02080000
FPJOBB3  DS    XL1                                                      02090000
FP600E   EQU    X'80'                   IEFIB600 ENTERED                02100000
FP600X   EQU    X'40'                   IEFIB600 EXITED                 02110000
FP605E   EQU    X'20'                   IEFIB605 ENTERED                02120000
FP605X   EQU    X'10'                   IEFIB605 EXITED                 02130000
FP645E   EQU    X'08'                   IEFIB645 ENTERED                02140000
FP645X   EQU    X'04'                   IEFIB645 EXITED                 02150000
*        EQU    *                       2 UNUSED                        02160000
FPJOBB4  DS    XL1                                                 @L5A 02170000
*        EQU    *                       8 unused                   @L5A 02180000
*                                                                       02190000
FPSTEP   DS    0XL3                    JOB STEP BITS               @L3C 02200000
FPSTEPB1 DS    XL1                                                      02210000
FP101E   EQU    X'80'                   IEFSD101 ENTERED                02220000
FP101X   EQU    X'40'                   IEFSD101 EXITED                 02230000
FP102E   EQU    X'20'                   IEFSD102 ENTERED                02240000
FP102X   EQU    X'10'                   IEFSD102 EXITED                 02250000
FP162E   EQU    X'08'                   IEFSD162 ENTERED                02260000
FP162X   EQU    X'04'                   IEFSD162 EXITED                 02270000
FPCATE   EQU    X'02'                   IEFICATL ENTERED                02280000
FPCATX   EQU    X'01'                   IEFICATL EXITED                 02290000
FPSTEPB2 DS    XL1                                                      02300000
FP103E   EQU    X'80'                   IEFSD103 ENTERED                02310000
FP103X   EQU    X'40'                   IEFSD103 EXITED                 02320000
FP263E   EQU    X'20'                   IEFSD263 ENTERED                02330000
FP263X   EQU    X'10'                   IEFSD263 EXITED                 02340000
FP164E   EQU    X'08'                   IEFSD164 ENTERED                02350000
FP164X   EQU    X'04'                   IEFSD164 EXITED                 02360000
FPCNDE   EQU    X'02'                   IEFINCND Entered           @01A 02370000
FPCNDX   EQU    X'01'                   IEFINCND Exited            @01A 02380000
FPSTEPB3 DS    XL1                                                 @L3A 02390000
FPWTEE   EQU    X'80'                   IEFINWTE Entered           @L3A 02400000
FPWTEX   EQU    X'40'                   IEFINWTE Exited            @L3A 02410000
FPSTRE   EQU    X'20'                   IEFINSTR Entered           @L6A 02420000
FPSTRX   EQU    X'10'                   IEFINSTR Exited            @L6A 02430000
*        EQU    *                       4 unused                   @L6C 02440000
*                                                                       02450000
*                                                                       02460000
FP160    DS    0XL2                    IEFSD160 FOOTPRINT BITS     @L5C 02470000
FP160B1  DS    XL1                                                      02480000
FP60LCT  EQU    X'80'                   LCT INITIALIZED                 02490000
FP60STA  EQU    X'40'                   ESTAE ESTABLISHED               02500000
FP60EVT  EQU    X'20'                   MEMORY FOR SYSEVENTS PARM LIST  02510000
FP60ID1E EQU    X'10'                   SRM called (INITID),       @03C 02520000
*                                       Initiator starting         @03A 02530000
FP60ID1X EQU    X'08'                   SRM returned,              @03C 02540000
*                                       Initiator starting         @03A 02550000
FP60ID2E EQU    X'04'                   SRM called (INITID),       @03A 02560000
*                                       Initiator terminating      @03A 02570000
FP60ID2X EQU    X'02'                   SRM returned,              @03A 02580000
*                                       Initiator terminating      @03A 02590000
*        EQU    *                       1 unused                   @L5C 02600000
FP160B2  DS    XL1                                                 @L5A 02610000
*        EQU    *                       8 unused                   @L5A 02620000
*                                                                       02630000
*                                                                       02640000
FP161    DS    0XL5                    IEFSD161 FOOTPRINT BITS     @L5C 02650000
FP161B1  DS    XL1                                                      02660000
*                                       STOP REQUESTED                  02670000
FP61SSO  EQU    X'80'                   -STOP SSOB FREED                02680000
FP61STA  EQU    X'40'                   -ESTAE CANCELED                 02690000
FP61TS1E EQU    X'20'                   TP SELECT SSREQ CALLED     @P1A 02700000
FP61TS1X EQU    X'10'                   TP SELECT SSREQ RETURNED   @P1A 02710000
FP61RQ1E EQU    X'08'                   SSREQ CALLED (SELECT)           02720000
FP61RQ1X EQU    X'04'                   SSREQ RETURNED                  02730000
FP61SEL  EQU    X'02'                   JOB SELECTED                    02740000
FP61ERR  EQU    X'01'                   ERROR FROM JOB SELECT           02750000
FP161B2  DS    XL1                                                      02760000
FP61TIM  EQU    X'80'                   JOB SELECT TIME SAVED           02770000
FP61SRME EQU    X'40'                   SRM CALLED (JOB SELECT)         02780000
FP61SRMX EQU    X'20'                   SRM RETURNED                    02790000
FP61WRM  EQU    X'10'                   WARM START REQUESTED            02800000
FP61PSCE EQU    X'08'                   IEFPPSCN invoked           @P2A 02810000
FP61PSCX EQU    X'04'                   IEFPPSCN returned          @P2A 02820000
*                                       2 unused                   @P2C 02830000
FP161B3  DS    XL1                                                      02840000
FP61KEY  EQU    X'80'                   PROTECT KEY ASSIGNED            02850000
FP61NKY  EQU    X'40'                   PROTECT KEY UNAVAILABLE         02860000
FP61CPUE EQU    X'20'                   IEFICPUA CALLED                 02870000
FP61CPUX EQU    X'10'                   IEFICPUA RETUNED                02880000
FP61AFF  EQU    X'08'                   CPU AFFINITY 1ST STEP           02890000
FP61NAF  EQU    X'04'                   CPU AFFINITY UNAVAILABLE        02900000
FP61MS1E EQU    X'02'                   IEFIMASK CALLED                 02910000
FP61MS1X EQU    X'01'                   IEFIMASK RETURNED               02920000
FP161B4  DS    XL1                                                      02930000
FP61MS2E EQU    X'80'                   IEFIMASK CALLED                 02940000
FP61MS2X EQU    X'40'                   IEFIMASK RETURNED               02950000
*                                       JOB RENEQ RTN CALLED            02960000
FP61RQ2E EQU    X'20'                   -SSREQ CALLED                   02970000
FP61RQ2X EQU    X'10'                   -SSREQ RETURNED                 02980000
FP61SWDE EQU    X'08'                   IEFINSWD called            @L5C 02990000
FP61SWDX EQU    X'04'                   IEFINSWD returned          @L5C 03000000
FP61ENQ  EQU    X'02'                   Protect key resource ENQd  @P2A 03010000
FP61DEQ  EQU    X'01'                   Protect key resource DEQd  @P2C 03020000
FP161B5  DS    XL1                                                 @L5A 03030000
*        EQU    *                       8 unused                   @L5A 03040000
*                                                                       03050000
*                                                                       03060000
FPTBL    DS    0XL4                    IEFDSTBL FOOTPRINT BITS          03070000
FPTBLB1  DS    XL1                                                      03080000
FPTBTRE  EQU    X'80'                   GOT FIRST TREE SEGMENT          03090000
*        EQU    *                       7 UNUSED                        03100000
FPTBSWAB DS    XL1                      INDICATORS PER SWA BLOCK        03110000
FPTBSRE  EQU    X'80'                     SWAREQ READ ENTERED           03120000
FPTBSRX  EQU    X'40'                     SWAREQ READ RETURNED          03130000
*        EQU    *                       6 UNUSED                        03140000
FPTBDSN  DS    XL1                      INDICATORS/DSNQ ENTRY           03150000
FPTBSRLE EQU    X'80'                    SWAREQ READ TO UPDATE          03160000
*                                        (SWA BLOCK ENTERED)            03170000
FPTBSRLX EQU    X'40'                   SWAREQ READ TO UPDATE           03180000
*                                        (SWA BLOCK RETURNED)           03190000
FPTBSWLE EQU    X'20'                   SWAREQ WRITE FOR UPDATED        03200000
*                                        (SWA BLOCK ENTERED)            03210000
FPTBSWLX EQU    X'10'                   SWAREQ WRITE FOR UPDATED        03220000
*                                        (SWA BLOCK RETURNED)           03230000
FPTBTRES EQU    X'08'                   GOT ANOTHER TREE SEGMEMT        03240000
*        EQU    *                       3 UNUSED                        03250000
FPTBSWAR DS    XL1                      SWAREQ READ/WRITE FLAGS         03260000
*                                        AT END OF MODULE               03270000
FPTBSRRE EQU    X'80'                     SWAREQ READ ENTERED           03280000
FPTBSRRX EQU    X'40'                     SWAREQ READ RETURNED          03290000
FPTBSRWE EQU    X'20'                     SWAREQ WRITE ENTERED          03300000
FPTBSRWX EQU    X'10'                     SWAREQ WRITE RETURNED         03310000
*        EQU    *                       4 UNUSED                        03320000
*                                                                       03330000
*                                                                       03340000
FPLST    DS    0XL1                    IEFDSLST FOOTPRINT BIT           03350000
FPLSTB1  DS    XL1                                                      03360000
FPLSEQB  EQU    X'80'                   DSENQ PARM LIST BUILT           03370000
FPLSTRF  EQU    X'40'                   DSNAME TREE FREED               03380000
*        EQU    *                       6 UNUSED                        03390000
*                                                                       03400000
*                                                                       03410000
FP166    DS    0XL3                    IEFSD166 FOOTPRINT BITS          03420000
FP166B1  DS    XL1                                                      03430000
FP66KEY  EQU    X'80'                   PROTECT KEY RELEASED            03440000
FP66RAC  EQU    X'40'                   RAC ENVIRONMENT DELETED         03450000
FP66TRM  EQU    X'20'                   GOT TERMINATION SSOB            03460000
FP66REN  EQU    X'10'                   GOT RE-ENQUE SSOB               03470000
FP66SSRE EQU    X'08'                   SSREQ CALLED                    03480000
*                                         ( TERM OR RE-ENQUEUE)         03490000
FP66SSRX EQU    X'04'                   SSREQ RETURNED                  03500000
FP66SSO  EQU    X'02'                   FUNCT SSOB HEADER FREED         03510000
*        EQU    *                       1 unused                   @L5C 03520000
FP166B2  DS    XL1                                                      03530000
FP66TSTE EQU    X'80'                   TRANSACTION TERMINATE      @L5M 03540000
*                                       SSREQ CALLED               @L5M 03550000
FP66TSTX EQU    X'40'                   TRANSACTION TERMINATE      @L5M 03560000
*                                       SSREQ RETURNED             @L5M 03570000
FP66TERE EQU    X'20'                   ILRJTERM CALLED                 03580000
FP66TERX EQU    X'10'                   ILRJTERM RETURNED               03590000
FP66EVTE EQU    X'08'                   SYSEVENT CALLED                 03600000
FP66EVTX EQU    X'04'                   SYSEVENT RETURNED               03610000
FP66SWDE EQU    X'02'                   IEFINSWD called            @L5C 03620000
FP66SWDX EQU    X'01'                   IEFINSWD returned          @L5C 03630000
FP166B3  DS    XL1                                                      03640000
FP66RCRE EQU    X'80'                   RACROUTE invoked           @P2A 03650000
FP66RCRX EQU    X'40'                   RACROUTE returned          @P2A 03660000
*        EQU    *                       6 unused                   @P2C 03670000
*                                                                       03680000
*                                                                       03690000
FP620    DS    0XL2                    IEFIB620 FOOTPRINT BITS     @L5C 03700000
FP620B1  DS    XL1                                                      03710000
FP20DET  EQU    X'80'                   DAUGHTER TASK DETACH            03720000
FP20DEQ  EQU    X'40'                   DEQ RESOURCES                   03730000
FP20RTC  EQU    X'20'                   RETURN CODE SET                 03740000
FP20RET  EQU    X'10'                   RETRY                           03750000
FP20NOR  EQU    X'08'                   NO RETRY                        03760000
*        EQU    *                       3 UNUSED                        03770000
FP620B2  DS    XL1                                                 @L5A 03780000
*        EQU    *                       8 unused                   @L5A 03790000
*                                                                       03800000
*                                                                       03810000
FP621    DS    0XL3                    IEFIB621 FOOTPRINT BITS          03820000
FP621B1  DS    XL1                                                      03830000
FP21ALN  EQU    X'80'                   ALLOCATION NOT COMPLETE         03840000
FP21SW1E EQU    X'40'                   SWA MANAGER CALLED              03850000
*                                         (LOCATE SCT)                  03860000
FP21SW1X EQU    X'20'                   SWA MANAGER RETURNED            03870000
FP21ALC  EQU    X'10'                   ALLOCATION COMPLETED            03880000
FP21GWTF EQU    X'08'                   -GWT FREED                      03890000
FP21EV1E EQU    X'04'                   -SYSEVENT CALLED                03900000
*                                         (INITATT)                     03910000
FP21EV1X EQU    X'02'                   -SYSEVENT RETURNED              03920000
FP21EV2E EQU    X'01'                   -SYSEVENT CALLED                03930000
*                                         (INITDET)                     03940000
FP621B2  DS    XL1                                                      03950000
FP21EV2X EQU    X'80'                   -SYSEVENT RETURNED              03960000
*                                         (INITDET)                     03970000
FP21SDW  EQU    X'40'                   SDWA FREED                      03980000
FP21EV3E EQU    X'20'                   SYSEVENT CALLED                 03990000
*                                         (INITATT)                     04000000
FP21EV3X EQU    X'10'                   SYSEVENT RETURNED               04010000
FP21RG1E EQU    X'08'                   GET REGION CALLED               04020000
*                                         (INITDET)                     04030000
FP21RG1X EQU    X'04'                   GET REGION RETURNED             04040000
FP21EV4E EQU    X'02'                   SYSEVENT CALLED                 04050000
FP21EV4X EQU    X'01'                   SYSEVENT RETURNED               04060000
FP621B3  DS    XL1                                                      04070000
FP21RG2E EQU    X'80'                   GET REGION CALLED               04080000
FP21RG2X EQU    X'40'                   GET REGION RETURNED             04090000
FP21TIM  EQU    X'20'                   TIMING FIELDS CLEARED           04100000
FP21EV5E EQU    X'10'                   SYSEVENT called            @P2A 04110000
*                                        (2nd INITDET)             @P2A 04120000
FP21EV5X EQU    X'08'                   SYSEVENT returned          @P2A 04130000
*        EQU    *                       3 UNUSED                   @P2C 04140000
*                                                                       04150000
*                                                                       04160000
FP600    DS    0XL5                    IEFIB600 FOOTPRINT BITS     @L5C 04170000
FP600B1  DS    XL1                                                      04180000
*                                     MAINLINE:                         04190000
FP00STA  EQU    X'80'                   ESTAE ESTABLISHED               04200000
FP00JSC  EQU    X'40'                   JSCB CHAINED                    04210000
FP00NEL  EQU    X'20'                   NEL INITAILIZED                 04220000
FP00AINE EQU    X'10'                   ALT INTERPRETER CALLED          04230000
FP00AINX EQU    X'08'                   ALT INTERPRETER RETURNED        04240000
FP00INTE EQU    X'04'                   INTERPRETER CALLED              04250000
FP00INTX EQU    X'02'                   INTERPRETER RETURNED            04260000
FP00NEF  EQU    X'01'                   NEL FREED                       04270000
FP600B2  DS    XL1                                                      04280000
FP00RF1E EQU    X'80'                   RACF CALLED                     04290000
*                                         (DELETE ACCESSOR ENV)         04300000
FP00RF1X EQU    X'40'                   RACF RETURNED                   04310000
FP00RF2E EQU    X'20'                   RACF CALLED                     04320000
*                                         (CREATE ACCESSOR ENV)         04330000
FP00RF2X EQU    X'10'                   RACF RETURNED                   04340000
FP00CSC  EQU    X'08'                   CSCB BUILT                      04350000
FP00EST  EQU    X'04'                   ESTAE CLEARED                   04360000
*        EQU    *                       2 unused                   @L5A 04370000
FP600B3  DS    XL1                                                      04380000
FP00SD1E EQU    X'80'                   IEFINSWD linked, error     @L5A 04390000
*                                         freeing NEL or in        @L5A 04400000
*                                         GETWORK routine          @L5A 04410000
FP00SD1X EQU    X'40'                   IEFINSWD returned, error   @L5A 04420000
*                                         freeing NEL or in        @L5A 04430000
*                                         GETWORK routine          @L5A 04440000
FP00SD2E EQU    X'20'                   IEFINSWD linked,           @L5A 04450000
*                                         RACF error               @L5A 04460000
FP00SD2X EQU    X'10'                   IEFINSWD returned,         @L5A 04470000
*                                         RACF error               @L5A 04480000
FP00SD3E EQU    X'08'                   IEFINSWD linked,           @L5A 04490000
*                                         error in reconstruction  @L5A 04500000
FP00SD3X EQU    X'04'                   IEFINSWD returned,         @L5A 04510000
*                                         error in reconstruction  @L5A 04520000
FP00VSME EQU    X'02'                   VSM invoked                @L5A 04530000
FP00VSMX EQU    X'01'                   VSM returned               @L5A 04540000
FP600B4  DS    XL1                                                 @L5A 04550000
FP00SMSE EQU    X'80'                   IEFSSREQ invoked           @P2A 04560000
*                                        (DFSMS IDAX)              @P2A 04570000
FP00SMSX EQU    X'40'                   IEFSSREQ returned          @P2A 04580000
*        EQU    *                       6 unused                   @P2C 04590000
*                                                                       04600000
FP600B5  DS    XL1                                                 @L5C 04610000
*                                                                11@L5D 04620000
*        EQU    *                       8 UNUSED                   @L5C 04630000
*                                                                       04640000
*                                                                       04650000
FP605    DS    0XL1                    IEFIB605 FOOTPRINT BITS          04660000
FP605B1  DS    XL1                                                      04670000
FP05601E EQU    X'80'                   IEFXB601 CALLED                 04680000
FP05601X EQU    X'40'                   IEFXB601 RETURNED               04690000
FP05609E EQU    X'20'                   IEFXB609 CALLED                 04700000
FP05609X EQU    X'10'                   IEFXB609 RETURNED               04710000
FP05TDSE EQU    X'08'                   IEFXBTDS called            @P2C 04720000
FP05TDSX EQU    X'04'                   IEFXBTDS returned          @P2C 04730000
*        EQU    *                       2 unused                   @P2C 04740000
*                                                                       04750000
*                                                                       04760000
FP645    DS    0XL1                    IEFIB645 FOOTPRINT BITS          04770000
FP645B1  DS    XL1                                                      04780000
FP45NEL  EQU    X'80'                   NEL FREED                       04790000
FP45SWDE EQU    X'40'                   IEFINSWD linked            @L5C 04800000
FP45SWDX EQU    X'20'                   IEFINSWD returned          @L5C 04810000
FP45LST  EQU    X'10'                   ESTAE LIST FREED                04820000
*        EQU    *                       4 unused                   @L5C 04830000
*                                                                       04840000
*                                                                       04850000
FP101    DS    0XL2                    IEFSD101 FOOTPRINT BITS          04860000
FP101B1  DS    XL1                                                      04870000
FP01SMFE EQU    X'80'                   SMF CALLED                      04880000
FP01SMFX EQU    X'40'                   SMF RETURNED                    04890000
FP01PPC  EQU    X'20'                   PPT FLAGS CLEARED               04900000
FP01CPUE EQU    X'10'                   IEFICPUA CALLED                 04910000
FP01CPUX EQU    X'08'                   IEFICPUA RETURNED               04920000
FP01MSKE EQU    X'04'                   IEFIMASK CALLED                 04930000
FP01MSKX EQU    X'02'                   IEFIMASK RETURNED               04940000
FP01RST  EQU    X'01'                   CKPT/RESTART DETECTED           04950000
FP101B2  DS    XL1                                                      04960000
FP01PPT  EQU    X'80'                   PPT FLAGS SET                   04970000
FP01PSCE EQU    X'40'                   IEFPPSCN invoked           @P2C 04980000
FP01PSCX EQU    X'20'                   IEFPPSCN returned          @P2A 04990000
*        EQU    *                       5 UNUSED                   @P2C 05000000
*                                                                       05010000
*                                                                       05020000
FP102    DS    0XL2                    IEFSD102 FOOTPRINT BITS     @L5C 05030000
FP102B1  DS    XL1                                                      05040000
FP02ELJ  EQU    X'80'                   DSENQ LIST FREED                05050000
*                                         (JOB FAILED)                  05060000
FP02ENQE EQU    X'40'                   ENQUEUE CALLED                  05070000
FP02ENQX EQU    X'20'                   ENQUEUE RETURNED                05080000
FP02ENF  EQU    X'10'                   ENQ FAILED                      05090000
FP02ELF  EQU    X'08'                   DSENQ LIST FREED                05100000
FP02WDS  EQU    X'04'                   WAITING ON DATA SETS            05110000
FP02CNL  EQU    X'02'                   CANCELED WHILE WAITING          05120000
*        EQU    *                       1 UNUSED                        05130000
FP102B2  DS    XL1                                                 @L5A 05140000
*        EQU    *                       8 unused                   @L5A 05150000
*                                                                       05160000
*                                                                       05170000
FP162    DS    0XL5                    IEFSD162 FOOTPRINT BITS     @L5C 05180000
FP162B1  DS    XL1                                                      05190000
FP62TIM  EQU    X'80'                   STEP TIME CALCULATED            05200000
FP62SW1E EQU    X'40'                   SWA MANAGER CALLED              05210000
*                                         (READ SIOT)                   05220000
FP62SW1X EQU    X'20'                   SWA MANAGER EXITED              05230000
FP62SSIE EQU    X'10'                   SSI CALLED (STEP INIT)          05240000
FP62SSIX EQU    X'08'                   SSI RETURNED                    05250000
FP62604E EQU    X'04'                   IEFXB604 CALLED                 05260000
FP62604X EQU    X'02'                   IEFXB604 RETURNED               05270000
FP62W21E EQU    X'01'                   IEFW21SD CALLED (ALLOC)         05280000
FP162B2  DS    XL1                                                      05290000
FP62W21X EQU    X'80'                   IEFW21SD RETURNED               05300000
FP62501E EQU    X'40'                   IEFXB501 CALLED (JRNL)          05310000
FP62501X EQU    X'20'                   IEFXB501 RETURNED               05320000
FP62ALF  EQU    X'10'                   ALLOC FAIL OR BYPASS            05330000
FP62RST  EQU    X'08'                   RESTART PARMS SET               05340000
FP62SW2E EQU    X'04'                   SWA MANAGER CALLED              05350000
*                                         (READ SCTX)              @L1C 05360000
FP62SW2X EQU    X'02'                   SWA MANAGER RETURNED            05370000
FP62SW3E EQU    X'01'                   SWA MANAGER CALLED              05380000
FP162B3  DS    XL1                        (WRITE JCTX)             @L1C 05390000
FP62SW3X EQU    X'80'                   SWA MANAGER RETURNED            05400000
FP62STRE EQU    X'40'                   IEFINSTR called            @D2C 05410000
FP62STRX EQU    X'20'                   IEFINSTR returned          @D2A 05420000
FP62ATP  EQU    X'10'                   GOT ATTACH PARM LIST            05430000
FP62660E EQU    X'08'                   IEFIB660 CALLED                 05440000
FP62660X EQU    X'04'                   IEFIB660 RETURNED               05450000
FP62JSL  EQU    X'02'                   JOBLIB, STEPLIB OPEN            05460000
FP62SFL  EQU    X'01'                   STEPLIB, FETCHLIB OPEN          05470000
FP162B4  DS    XL1                                                      05480000
FP62PPT  EQU    X'80'                   PROGRAM PROPERTIES SET          05490000
FP62OPE  EQU    X'40'                   OPEN ERROR                      05500000
FP62PMDO EQU    X'20'                   PARMDD DDname DS OPEN      @L8C 05510001
FP62PMDX EQU    X'10'                   PARMDD DDname DS CLOSED    @L8C 05520001
*        EQU    *                       4 Unused                   @01C 05530000
FP162B5  DS    XL1                                                 @L5A 05540000
*        EQU    *                       8 unused                   @L5A 05550000
*                                                                       05560000
*                                                                       05570000
FPCAT    DS    0XL1                    IEFICATL FOOTPRINT BITS          05580000
FPCATB1  DS    XL1                                                      05590000
*                                                                 3@P2D 05600000
FPCT4F5  EQU    X'80'                   IEFAB4F5 toggle            @P2C 05610000
*        EQU    *                       7 unused                   @P2C 05620000
*                                                                       05630000
*                                                                       05640000
FP103    DS    0XL1                    IEFSD103 FOOTPRINT BITS          05650000
FP103B1  DS    XL1                                                      05660000
FP03ATL  EQU    X'80'                   ATTACH LIST COMPLETED           05670000
*        EQU    X'40'                   Unused                     @D3C 05680000
FP03GRP  EQU    X'20'                   PERFORMANCE GROUP SET           05690000
*        EQU    *                       5 UNUSED                        05700000
*                                                                       05710000
*                                                                       05720000
FP263    DS    0XL7                    IEFSD263 FOOTPRINT BITS     @L5C 05730000
FP263B1  DS    XL1                                                      05740000
FP63EX1  EQU    X'80'                   FREEPART EXIT TAKEN             05750000
FP63RGWT EQU    X'40'                   REAL GWT INITIALIZED            05760000
FP63VGWT EQU    X'20'                   VIRTUAL GWT INITIALIZED         05770000
FP63VSME EQU    X'10'                   GET REGION CALLED               05780000
FP63VSMX EQU    X'08'                   GET REGION RETURNED             05790000
FP63EV1E EQU    X'04'                   SYSEVENT CALLED                 05800000
*                                         (TRANSWAP)                    05810000
FP63EV1X EQU    X'02'                   SYSEVENT RETURNED               05820000
FP63EV2E EQU    X'01'                   SYSEVENT CALLED                 05830000
FP263B2  DS    XL1                        (REQSWAP)                     05840000
FP63EV2X EQU    X'80'                   SYSEVENT RETURNED               05850000
FP63GRG  EQU    X'40'                   GOT REQUESTED REGION            05860000
FP63EX2  EQU    X'20'                   PRE-INVOCATION EXIT TAKEN       05870000
FP63SMFE EQU    X'10'                   IEFSMFAT CALLED                 05880000
FP63SMFX EQU    X'08'                   IEFSMFAT RETURNED               05890000
FP63ATC  EQU    X'04'                   JOB STEP ATTACHED               05900000
FP63TIM  EQU    X'02'                   TIME CALCULATION DONE           05910000
FP63SW1E EQU    X'01'                   SWA MANAGER CALLED              05920000
*                                         (READ ACT)                    05930000
FP263B3  DS    XL1                                                      05940000
FP63SW1X EQU    X'80'                   SWA MANAGER RETURNED            05950000
FP63EV3E EQU    X'40'                   SYSEVENT CALLED                 05960000
*                                         (INITATT)                     05970000
FP63EV3X EQU    X'20'                   SYSEVENT RETURNED               05980000
FP63VR0E EQU    X'10'                   Get Virtual Region called  @P2A 05990000
*                                         (Default request)        @P2A 06000000
FP63VR0X EQU    X'08'                   Get Virtual Region return  @P2A 06010000
*        EQU    *                       1 UNUSED                   @P2C 06020000
FP63STM  EQU    X'02'                   STEP TIME SAVED                 06030000
FP63EX3  EQU    X'01'                   POST-INVOCATN EXIT TAKEN        06040000
*                                                                       06050000
FP263B4  DS    XL1                                                      06060000
FP63VR1E EQU    X'80'                   GET VIRTUAL RGN CALLED          06070000
*                                         (V=R PROCESSING)              06080000
FP63VR1X EQU    X'40'                   GET VIRT RGN RETURNED           06090000
*        EQU    *                       6 UNUSED                        06100000
FP263B5  DS    XL1                                                      06110000
FP63EV4E EQU    X'80'                   SYSEVENT CALLED                 06120000
FP63EV4X EQU    X'40'                   SYSEVENT RETURNED               06130000
FP63EV5E EQU    X'20'                   SYSEVENT CALLED                 06140000
*                                         (INITDET)                     06150000
FP63EV5X EQU    X'10'                   SYSEVENT RETURNED               06160000
FP63VR2E EQU    X'08'                   GET VIRTUAL RGN CALLED          06170000
*                                         (V=V PROCESSING)              06180000
FP63VR2X EQU    X'04'                   GET VIRT RGN RETURNED           06190000
FP63DET  EQU    X'02'                   JOB STEP DETACHED               06200000
*        EQU    *                       1 UNUSED                        06210000
FP263B6  DS    XL1                                                      06220000
FP63BALE EQU    X'80'                   CALLED EXIT VIA BALR            06230000
FP63BALX EQU    X'40'                   RETURNED FROM EXIT              06240000
FP63LNKE EQU    X'20'                   CALLED EXIT VIA LINK            06250000
FP63LNKX EQU    X'10'                   RETURNED FROM EXIT              06260000
FP63XCTE EQU    X'08'                   CALLED EXIT VIA XCTL       @L1A 06270000
*        EQU    *                       3 UNUSED                   @L1C 06280000
FP263B7  DS    XL1                                                 @L5A 06290000
*        EQU    *                       8 unused                   @L5A 06300000
*                                                                       06310000
*                                                                       06320000
FP164    DS    0XL4                    IEFSD164 FOOTPRINT BITS          06330000
FP164B1  DS    XL1                                                      06340000
FP64WRM  EQU    X'80'                   PROCESSING WARMSTART            06350000
FP64ALO  EQU    X'40'                   ABEND FOR ALLOCATE ERROR        06360000
FP64FCL  EQU    X'20'                   FETCHLIB CLOSE & FREE           06370000
FP64GTP  EQU    X'10'                   GOT TERMINATE PARM LIST         06380000
FP64STC  EQU    X'08'                   JOB/STEPLIB CLOSE & FREE        06390000
FP64SW1E EQU    X'04'                   SWA MANAGER CALLED              06400000
*                                         (READ ACT)                    06410000
FP64SW1X EQU    X'02'                   SWA MANAGER RETURNED            06420000
FP64SW2E EQU    X'01'                   SWA MANAGER CALLED              06430000
*                                         (WRITE ACT)                   06440000
FP164B2  DS    XL1                                                      06450000
FP64SW2X EQU    X'80'                   SWA MANAGER RETURNED            06460000
FP64TIM  EQU    X'40'                   JOB/STEP TIMES COMPUTED         06470000
FP64DTC  EQU    X'20'                   GOT DUMMY TCB                   06480000
FP64SW3E EQU    X'10'                   SWA MANAGER CALLED              06490000
*                                         (JOURNAL CNTL BLOCKS)         06500000
FP64SW3X EQU    X'08'                   SWA MANAGER RETURNED            06510000
FP64UALE EQU    X'04'                   UNALLOCATION CALLED             06520000
FP64UALX EQU    X'02'                   UNALLOCATION RETURNED           06530000
FP64SW4E EQU    X'01'                   SWA MANAGER CALLED              06540000
*                                         (JOURNAL CNTL BLOCKS)         06550000
FP164B3  DS    XL1                                                      06560000
FP64SW4X EQU    X'80'                   SWA MANAGER RETURNED            06570000
FP64FTC  EQU    X'40'                   FREED DUMMY TCB                 06580000
FP64FTP  EQU    X'20'                   FREED TERM PARM LIST            06590000
FP64CLRE EQU    X'10'                   CLEAR JES MSGS CALLED           06600000
FP64CLRX EQU    X'08'                   CLEAR JES MSGS RETURNED         06610000
FP64SW5E EQU    X'04'                   SWA MANAGER CALLED              06620000
*                                         (READ NEXT STC)               06630000
FP64SW5X EQU    X'02'                   SWA MANAGER RETURNED            06640000
FP64STRE EQU    X'01'                   IEFINSTR called            @D2C 06650000
*                                                                       06660000
FP164B4  DS    XL1                                                      06670000
FP64STRX EQU    X'80'                   IEFINSTR returned          @D2C 06680000
FP64SSEE EQU    X'40'                   SSI CALLED (STEP END)      @L8C 06690002
FP64SSEX EQU    X'20'                   SSI RETURNED               @L8C 06691002
FP64PMDX EQU    X'10'                   PARMDD DDname DS CLOSED    @L8A 06691102
*        EQU    *                       4 unused                   @L8C 06692002
*                                                                       06693000
*                                                                       06694000
FPCPU    DS    0XL1                    IEFICPUA FOOTPRINT BITS          06695000
FPCPUB1  DS    XL1                                                      06696000
FPCPENQ  EQU    X'80'                   ENQ ON SYSZCSD                  06697000
FPCPDEQ  EQU    X'40'                   DEQ ON SYSZCSD                  06698000
*        EQU    *                       6 UNUSED                        06699000
*                                                                       06700000
*                                                                       06710000
FPMSK    DS    0XL1                    IEFIMASK FOOTPRINT BITS          06720000
FPMSKB1  DS    XL1                                                      06730000
FPMSSCN  EQU    X'80'                   BIT STRING SCANNED              06740000
*        EQU    *                       7 UNUSED                        06750000
*                                                                       06760000
FPCND    DS    0XL1                    IEFINCND Footprint bits     @01A 06770000
FPCNDB1  DS    XL1                                                 @01A 06780000
FPCNWIFB EQU    X'80'                   Indicate call for Write         06790000
*                                       modified IFB               @01A 06800000
FPCNPMSE EQU    X'40'                   Indicate call to IEFTB723       06810000
*                                       to issue message           @01A 06820000
FPCNPMSX EQU    X'20'                   Indicate return from IEFTB723   06830000
*                                       to issue message           @01A 06840000
*        EQU    *                       5 UNUSED                   @01A 06850000
*                                                                       06860000
FPSWD    DS    0XL2                    IEFINSWD Footprint bits     @L5C 06870000
FPSWDB1  DS    XL1                                                 @04C 06880000
FPSWDE   EQU    X'80'                   IEFINSWD entered           @04A 06890000
FPSDLCT  EQU    X'40'                   SWA pointers reset in LCT  @04A 06900000
FPSDSWME EQU    X'20'                   Called SWA Manager Subpool      06910000
*                                       Delete                     @04A 06920000
FPSDSWMX EQU    X'10'                   SWA Manager Subpool Delete      06930000
*                                       returned                   @04A 06940000
FPSDJSCB EQU    X'08'                   Completed JSCB processing  @04A 06950000
FPSDCIB  EQU    X'04'                   Completed CIB processing   @04A 06960000
FPSDCSCB EQU    X'02'                   Completed CSCB processing  @04A 06970000
FPSWDX   EQU    X'01'                   IEFINSWD exited            @04A 06980000
FPSWDB2  DS    XL1                                                 @L5A 06990000
FPSDVSME EQU    X'80'                   VSM invoked                @L5A 07000000
FPSDVSMX EQU    X'40'                   VSM returned               @L5A 07010000
FPSDVAT  EQU    X'20'                   VAT freed                  @L5A 07020000
*        EQU    *                       5 unused                   @L5A 07030000
*                                                                       07040000
FPWTE    DS    0XL2                    IEFINWTE Footprint bits     @L5C 07050000
FPWTEB1  DS    XL1                                                 @L3A 07060000
FPWEDSP  EQU    X'80'                   TASK Dispatchable          @L3A 07070000
FPWECNL  EQU    X'40'                   TASK Canceled              @L3A 07080000
FPWEEND  EQU    X'20'                   TASK Ended                 @L3A 07090000
FPWEOPEN EQU    X'10'                   OPEN/MVS function request  @L4A 07100000
FPWESWAC EQU    X'08'                   Call SWA Manager Assign    @L3A 07110000
FPWESWAE EQU    X'04'                   SWA Manager Assign exited  @L3A 07120000
FPWESWWC EQU    X'02'                   Call SWA Manager Write     @L3A 07130000
FPWESWWE EQU    X'01'                   SWA Manager Write exited   @L3A 07140000
FPWTEB2  DS    XL1                                                 @L5A 07150000
*        EQU    *                       8 unused                   @L5A 07160000
*                                                                       07170000
FPSTR    DS    0XL1                    IEFINSTR Footprint bits     @L6C 07180000
FPSTRB1  DS    XL1                                                 @L6A 07190000
FPSTRUNE EQU    X'80'                   ATBUNID called             @L6A 07200000
FPSTRUNX EQU    X'40'                   ATBUNID returned           @L6A 07210000
FPSTRAME EQU    X'20'                   ATBAMR1 called             @L6A 07220000
FPSTRAMX EQU    X'10'                   ATBAMR1 returned           @L6A 07230000
FPSTRMPE EQU    X'08'                   BPX1MPC called             @L6A 07240000
FPSTRMPX EQU    X'04'                   BPX1MPC returned           @L6A 07250000
*        EQU    *                       2 unused                   @L6A 07260000
*                                                                  @L6A 07270000
         DS    XL1                     Reserved                    @L3A 07280000
         DS    XL1                     Reserved                    @L3A 07290000
         DS    XL1                     Reserved                    @L5A 07300000
         DS    XL1                     Reserved                    @L5A 07310000
         DS    XL1                     Reserved                    @L5A 07320000
         DS    XL1                     Reserved                    @L5A 07330000
         DS    XL1                     Reserved                    @L5A 07340000
         DS    0F                      FORCE FULL WORD LENGTH           07350000
*                                                                       07360000
         MEND                                                           07370000
**/      %FPTBSL:;                                                      07380000
* %IF FPFPATTR = '' %THEN                                               07390000
*   %FPFPATTR = 'LCTFPNT';         /* ASSIGN DEFAULT BASE VARIABLE   */ 07400000
* DCL                                   /*                           */ 07410000
* 1 FPFPNT BASED(FPFPATTR)              /* INITIATOR FOOTPRINT AREA  */ 07420000
*          BOUNDARY(WORD),              /*                           */ 07430000
*                                       /*                           */ 07440000
*   3 FPNAME      CHAR(8),              /* FOOTPRINT HEADER          */ 07450000
*                                       /*   'INITFPNT'              */ 07460000
*                                       /*                           */ 07470000
*   3 FPINIT      BIT(8),               /* INITIATOR BITS            */ 07480000
*     5 FP160E     BIT(1),              /*   IEFSD160 ENTERED        */ 07490000
*     5 FP160X     BIT(1),              /*   IEFSD160 EXITED         */ 07500000
*     5 *            BIT(6),            /*                           */ 07510000
*                                       /*                           */ 07520000
*   3 FPJOB       BIT(32),              /* JOB BITS              @L5C*/ 07530000
*     5 FP161E       BIT(1),            /*   IEFSD161 ENTERED        */ 07540000
*     5 FP161X       BIT(1),            /*   IEFSD161 EXITED         */ 07550000
*     5 FPTBLE       BIT(1),            /*   IEFDSTBL ENTERED        */ 07560000
*     5 FPTBLX       BIT(1),            /*   IEFDSTBL EXITED         */ 07570000
*     5 FPLSTE       BIT(1),            /*   IEFDSLST ENTERED        */ 07580000
*     5 FPLSTX       BIT(1),            /*   IEFDSLST EXITED         */ 07590000
*     5 FP166E       BIT(1),            /*   IEFSD166 ENTERED        */ 07600000
*     5 FP166X       BIT(1),            /*   IEFSD166 EXITED         */ 07610000
*                                       /*                           */ 07620000
*     5 FP620E       BIT(1),            /*   IEFIB620 ENTERED        */ 07630000
*     5 FP620X       BIT(1),            /*   IEFIB620 EXITED         */ 07640000
*     5 FP621E       BIT(1),            /*   IEFIB621 ENTERED        */ 07650000
*     5 FP621X       BIT(1),            /*   IEFIB621 EXITED         */ 07660000
*     5 FP922E       BIT(1),            /*   IEFI922B ENTERED        */ 07670000
*     5 FP922X       BIT(1),            /*   IEFI922B EXITED         */ 07680000
*     5 *            BIT(2),            /*                           */ 07690000
*     5 FP600E       BIT(1),            /*   IEFIB600 ENTERED        */ 07700000
*     5 FP600X       BIT(1),            /*   IEFIB600 ENTERED        */ 07710000
*     5 FP605E       BIT(1),            /*   IEFIB605 ENTERED        */ 07720000
*     5 FP605X       BIT(1),            /*   IEFIB605 ENTERED        */ 07730000
*     5 FP645E       BIT(1),            /*   IEFIB645 ENTERED        */ 07740000
*     5 FP645X       BIT(1),            /*   IEFIB645 ENTERED        */ 07750000
*     5 *            BIT(10),           /*                       @L5C*/ 07760000
*                                       /*                           */ 07770000
*   3 FPSTEP      BIT(24),              /* JOB STEP BITS         @L3C*/ 07780000
*     5 FP101E       BIT(1),            /*   IEFSD101 ENTERED        */ 07790000
*     5 FP101X       BIT(1),            /*   IEFSD101 EXITED         */ 07800000
*     5 FP102E       BIT(1),            /*   IEFSD102 ENTERED        */ 07810000
*     5 FP102X       BIT(1),            /*   IEFSD102 EXITED         */ 07820000
*     5 FP162E       BIT(1),            /*   IEFSD162 ENTERED        */ 07830000
*     5 FP162X       BIT(1),            /*   IEFSD162 EXITED         */ 07840000
*     5 FPCATE       BIT(1),            /*   IEFICATL ENTERED        */ 07850000
*     5 FPCATX       BIT(1),            /*   IEFICATL EXITED         */ 07860000
*     5 FP103E       BIT(1),            /*   IEFSD103 ENTERED        */ 07870000
*     5 FP103X       BIT(1),            /*   IEFSD103 EXITED         */ 07880000
*     5 FP263E       BIT(1),            /*   IEFSD263 ENTERED        */ 07890000
*     5 FP263X       BIT(1),            /*   IEFSD263 EXITED         */ 07900000
*     5 FP164E       BIT(1),            /*   IEFSD164 ENTERED        */ 07910000
*     5 FP164X       BIT(1),            /*   IEFSD164 EXITED         */ 07920000
*     5 FPCNDE       BIT(1),            /*   IEFINCND Entered    @01C*/ 07930000
*     5 FPCNDX       BIT(1),            /*   IEFINCND Exited     @01A*/ 07940000
*     5 FPWTEE       BIT(1),            /*   IEFINWTE Entered    @L3A*/ 07950000
*     5 FPWTEX       BIT(1),            /*   IEFINWTE Exited     @L3A*/ 07960000
*     5 FPSTRE       BIT(1),            /*   IEFINSTR Entered    @L6A*/ 07970000
*     5 FPSTRX       BIT(1),            /*   IEFINSTR Exited     @L6A*/ 07980000
*     5 *            BIT(4),            /*                       @L6C*/ 07990000
*                                       /*                           */ 08000000
*                                       /*                           */ 08010000
*   3 FP160       BIT(16),              /* IEFSD160 Footprints   @L5C*/ 08020000
*     5 FP60LCT      BIT(1),            /*   LCT INITIALIZED         */ 08030000
*     5 FP60STA      BIT(1),            /*   ESTAE ESTABLISHED       */ 08040000
*     5 FP60EVT      BIT(1),            /*   MEMORY FOR SYSEVENTS    */ 08050000
*                                       /*     PARM LIST             */ 08060000
*     5 FP60ID1E     BIT(1),            /* SRM called (INITID),  @03C*/ 08070000
*                                       /* Initiator starting    @03A*/ 08080000
*     5 FP60ID1X     BIT(1),            /* SRM returned,         @03C*/ 08090000
*                                       /* Initiator starting    @03A*/ 08100000
*     5 FP60ID2E     BIT(1),            /* SRM called (INITID)   @03A*/ 08110000
*                                       /* Initiator terminating @03A*/ 08120000
*     5 FP60ID2X     BIT(1),            /* SRM returned,         @03A*/ 08130000
*                                       /* Initiator terminating @03A*/ 08140000
*     5 *            BIT(9),            /*                       @L5C*/ 08150000
*                                       /*                           */ 08160000
*                                       /*                           */ 08170000
*   3 FP161       BIT(40),              /* IEFSD161 Footprints   @L5C*/ 08180000
*                                       /*   STOP REQUESTED          */ 08190000
*     5 FP61SSO      BIT(1),            /*   -SSOB FREED             */ 08200000
*     5 FP61STA      BIT(1),            /*   -ESTAE CANCELED         */ 08210000
*     5 FP61TS1E     BIT(1),            /* TP SEL SSREQ CALLED   @P1A*/ 08220000
*     5 FP61TS1X     BIT(1),            /* TP SEL SSREQ RETURNED @P1A*/ 08230000
*     5 FP61RQ1E     BIT(1),            /*   SSREQ CALLED (SELECT)   */ 08240000
*     5 FP61RQ1X     BIT(1),            /*   SSREQ RETURNED          */ 08250000
*     5 FP61SEL      BIT(1),            /*   JOB SELECTED            */ 08260000
*     5 FP61ERR      BIT(1),            /*   ERROR FROM JOB SELECT   */ 08270000
*     5 FP61TIM      BIT(1),            /*   JOB SELECT TIME SAVED   */ 08280000
*     5 FP61SRME     BIT(1),            /*   SRM CALLED (JOB SELECT) */ 08290000
*     5 FP61SRMX     BIT(1),            /*   SRM RETURNED            */ 08300000
*     5 FP61WRM      BIT(1),            /*   WARM START REQUESTED    */ 08310000
*     5 FP61PSCE     BIT(1),            /*   IEFPPSCN invoked    @P2A*/ 08320000
*     5 FP61PSCX     BIT(1),            /*   IEFPPSCN returned   @P2A*/ 08330000
*     5 *            BIT(2),            /*                       @P2C*/ 08340000
*     5 FP61KEY      BIT(1),            /*   PROTECT KEY ASSIGNED    */ 08350000
*     5 FP61NKY      BIT(1),            /*   PROTECT KEY UNAVAILABLE */ 08360000
*     5 FP61CPUE     BIT(1),            /*   IEFICPUA CALLED         */ 08370000
*     5 FP61CPUX     BIT(1),            /*   IEFICPUA RETURNED       */ 08380000
*     5 FP61AFF      BIT(1),            /*   CPU AFFINITY 1ST STEP   */ 08390000
*     5 FP61NAF      BIT(1),            /*   CPU AFFINITY UNAVAIL    */ 08400000
*     5 FP61MS1E     BIT(1),            /*   IEFIMASK CALLED         */ 08410000
*     5 FP61MS1X     BIT(1),            /*   IEFIMASK RETURNED       */ 08420000
*     5 FP61MS2E     BIT(1),            /*   IEFIMASK CALLED         */ 08430000
*     5 FP61MS2X     BIT(1),            /*   IEFIMASK RETURNED       */ 08440000
*                                       /*   JOB RENEQ RTN CALLED    */ 08450000
*     5 FP61RQ2E     BIT(1),            /*   -SSREQ CALLED           */ 08460000
*     5 FP61RQ2X     BIT(1),            /*   -SSREQ RETUNED          */ 08470000
*     5 FP61SWDE     BIT(1),            /*   IEFINSWD called     @L5C*/ 08480000
*     5 FP61SWDX     BIT(1),            /*   IEFINSWD returned   @L5C*/ 08490000
*     5 FP61ENQ      BIT(1),            /*   Protect key         @P2A*/ 08500000
*                                       /*   resource ENQd       @P2A*/ 08510000
*     5 FP61DEQ      BIT(1),            /*   Protect key         @P2A*/ 08520000
*                                       /*   resource DEQd       @P2A*/ 08530000
*     5 *            BIT(8),            /*                       @P2C*/ 08540000
*                                       /*                           */ 08550000
*                                       /*                           */ 08560000
*   3 FPTBL   BIT(32) BDY(BYTE),        /* IEFDSTBL FOOTPRINT BITS   */ 08570000
*     5 FPTBTRE   BIT(1),               /*   GOT FIRST TREE SEGMENT  */ 08580000
*     5 *         BIT(7),               /*   UNUSED INDICATORS       */ 08590000
*     5 FPTBSWAB  BIT(16) BDY(BYTE),    /*  INDICATORS PER SWA BLOCK */ 08600000
*       7 FPTBSRE    BIT(1),            /*     SWAREQ READ ENTERED   */ 08610000
*       7 FPTBSRX    BIT(1),            /*     SWAREQ READ RETURNED  */ 08620000
*       7 *          BIT(6),            /*     UNUSED INDICATORS     */ 08630000
*       7 FPTBDSN    BIT(8) BDY(BYTE),  /* INDICATORS/DSNQ ENTRY     */ 08640000
*         9 FPTBSRLE    BIT(1),         /*  SWAREQ READ TO UPDATE    */ 08650000
*                                       /*   (SWA BLOCK ENTERED)     */ 08660000
*         9 FPTBSRLX    BIT(1),         /*  SWAREQ READ TO UPDATE    */ 08670000
*                                       /*   (SWA BLOCK RETURNED)    */ 08680000
*         9 FPTBTRES    BIT(1),         /*  GOT ANOTHER TREE SEGMEMT */ 08690000
*         9 *           BIT(5),         /*  UNUSED INDICATORS        */ 08700000
*     5 FPTBSWAR  BIT(8)  BDY(BYTE),    /*  SWAREQ READ/WRITE FLAGS  */ 08710000
*                                       /*    AT END OF MODULE       */ 08720000
*       7 FPTBSRRE   BIT(1),            /*     SWAREQ READ ENTERED   */ 08730000
*       7 FPTBSRRX   BIT(1),            /*     SWAREQ READ RETURNED  */ 08740000
*       7 FPTBSRWE   BIT(1),            /*     SWAREQ WRITE ENTERED  */ 08750000
*       7 FPTBSRWX   BIT(1),            /*     SWAREQ WRITE RETURNED */ 08760000
*       7 *          BIT(4),            /*     UNUSED INDICATORS     */ 08770000
*                                       /*                           */ 08780000
*                                       /*                           */ 08790000
*   3 FPLST       BIT(8),               /* IEFDSLST FOOTPRINT BITS   */ 08800000
*     5 FPLSEQB      BIT(1),            /*   DSENQ PARM LIST BUILT   */ 08810000
*     5 FPLSTRF      BIT(1),            /*   DSNAME TREE FREED       */ 08820000
*     5 *            BIT(6),            /*                           */ 08830000
*                                       /*                           */ 08840000
*                                       /*                           */ 08850000
*   3 FP166       BIT(24),              /* IEFSD166 FOOTPRINT BITS   */ 08860000
*     5 FP66KEY      BIT(1),            /*   PROTECT KEY RELEASED    */ 08870000
*     5 FP66RAC      BIT(1),            /*   RAC ENVIRONMENT DELETED */ 08880000
*     5 FP66TRM      BIT(1),            /*   GOT TERMINATION SSOB    */ 08890000
*     5 FP66REN      BIT(1),            /*   GOT RE-ENQUE SSOB       */ 08900000
*     5 FP66SSRE     BIT(1),            /*   SSREQ CALLED            */ 08910000
*                                       /*     ( TERM OR RE-ENQUEUE) */ 08920000
*     5 FP66SSRX     BIT(1),            /*   SSREQ RETURNED          */ 08930000
*     5 FP66SSO      BIT(1),            /*   FUNCT SSOB HEADER FREED */ 08940000
*     5 *            BIT(1),            /*                       @L5C*/ 08950000
*     5 FP66TSTE     BIT(1),            /* TRANSACTION TERMINATE @L5M*/ 08960000
*                                       /* SSREQ CALLED          @L5M*/ 08970000
*     5 FP66TSTX     BIT(1),            /* TRANSACTION TERMINATE @L5M*/ 08980000
*                                       /* SSREQ RETURNED        @L5M*/ 08990000
*     5 FP66TERE     BIT(1),            /*   ILRJTERM CALLED         */ 09000000
*     5 FP66TERX     BIT(1),            /*   ILRJTERM RETURNED       */ 09010000
*     5 FP66EVTE     BIT(1),            /*   SYSEVENT CALLED         */ 09020000
*     5 FP66EVTX     BIT(1),            /*   SYSEVENT RETURNED       */ 09030000
*     5 FP66SWDE     BIT(1),            /*   IEFINSWD called     @L5C*/ 09040000
*     5 FP66SWDX     BIT(1),            /*   IEFINSWD returned   @L5C*/ 09050000
*     5 FP66RCRE     BIT(1),            /*   RACROUTE invoked    @P2A*/ 09060000
*     5 FP66RCRX     BIT(1),            /*   RACROUTE returned   @P2A*/ 09070000
*     5 *            BIT(6),            /*                       @P2C*/ 09080000
*                                       /*                           */ 09090000
*                                       /*                           */ 09100000
*   3 FP620       BIT(16),              /* IEFIB620 Footprints   @L5C*/ 09110000
*     5 FP20DET      BIT(1),            /*   DAUGHTER TASK DETACH    */ 09120000
*     5 FP20DEQ      BIT(1),            /*   DEQ RESOURCES           */ 09130000
*     5 FP20RTC      BIT(1),            /*   RETURN CODE SET         */ 09140000
*     5 FP20RET      BIT(1),            /*   RETRY                   */ 09150000
*     5 FP20NOR      BIT(1),            /*   NO RETRY                */ 09160000
*     5 *            BIT(11),           /*                       @L5C*/ 09170000
*                                       /*                           */ 09180000
*                                       /*                           */ 09190000
*   3 FP621       BIT(24),              /* IEFIB621 FOOTPRINT BITS   */ 09200000
*     5 FP21ALN      BIT(1),            /*   ALLOCATION NOT COMPLETE */ 09210000
*     5 FP21SW1E     BIT(1),            /*   SWA MANAGER CALLED      */ 09220000
*                                       /*     (LOCATE SCT)          */ 09230000
*     5 FP21SW1X     BIT(1),            /*   SWA MANAGER RETURNED    */ 09240000
*     5 FP21ALC      BIT(1),            /*   ALLOCATION COMPLETED    */ 09250000
*     5 FP21GWTF     BIT(1),            /*   -GWT FREED              */ 09260000
*     5 FP21EV1E     BIT(1),            /*   -SYSEVENT CALLED        */ 09270000
*                                       /*     (INITATT)             */ 09280000
*     5 FP21EV1X     BIT(1),            /*   -SYSEVENT RETURNED      */ 09290000
*     5 FP21EV2E     BIT(1),            /*   -SYSEVENT CALLED        */ 09300000
*                                       /*     (INITDET)             */ 09310000
*     5 FP21EV2X     BIT(1),            /*   -SYSEVENT RETURNED      */ 09320000
*     5 FP21SDW      BIT(1),            /*   SDWA FREED              */ 09330000
*     5 FP21EV3E     BIT(1),            /*   SYSEVENT CALLED         */ 09340000
*                                       /*     (INITATT)             */ 09350000
*     5 FP21EV3X     BIT(1),            /*   SYSEVENT RETURNED       */ 09360000
*     5 FP21RG1E     BIT(1),            /*   GET REGION CALLED       */ 09370000
*     5 FP21RG1X     BIT(1),            /*   GET REGION RETURNED     */ 09380000
*     5 FP21EV4E     BIT(1),            /*   SYSEVENT CALLED         */ 09390000
*                                       /*     (INITDET)             */ 09400000
*     5 FP21EV4X     BIT(1),            /*   SYSEVENT RETURNED       */ 09410000
*     5 FP21RG2E     BIT(1),            /*   GET REGION CALLED       */ 09420000
*     5 FP21RG2X     BIT(1),            /*   GET REGION RETURNED     */ 09430000
*     5 FP21TIM      BIT(1),            /*   TIMING FIELDS CLEARED   */ 09440000
*     5 FP21EV5E     BIT(1),            /*   SYSEVENT called     @P2A*/ 09450000
*                                       /*    (2nd INITDET)      @P2A*/ 09460000
*     5 FP21EV5X     BIT(1),            /*   SYSEVENT returned   @P2A*/ 09470000
*     5 *            BIT(3),            /*                       @P2C*/ 09480000
*                                       /*                           */ 09490000
*                                       /*                           */ 09500000
*   3 FP600       BIT(40),              /* IEFIB600 Footprints   @L5C*/ 09510000
*                                       /*                           */ 09520000
*                                       /* MAINLINE:                 */ 09530000
*     5 FP00STA      BIT(1),            /*   ESTAE ESTABLISHED       */ 09540000
*     5 FP00JSC      BIT(1),            /*   JSCB CHAINED            */ 09550000
*     5 FP00NEL      BIT(1),            /*   NEL INITAILIZED         */ 09560000
*     5 FP00AINE     BIT(1),            /*   ALT INTERPRETER CALLED  */ 09570000
*     5 FP00AINX     BIT(1),            /*   ALT INTERPRETER RETURNED*/ 09580000
*     5 FP00INTE     BIT(1),            /*   INTERPRETER CALLED      */ 09590000
*     5 FP00INTX     BIT(1),            /*   INTERPRETER RETURNED    */ 09600000
*     5 FP00NEF      BIT(1),            /*   NEL FREED               */ 09610000
*     /*                                                        4@L5D*/ 09620000
*     5 FP00RF1E     BIT(1),            /*   RACF CALLED             */ 09630000
*                                       /*     (DELETE ACCESSOR ENV) */ 09640000
*     5 FP00RF1X     BIT(1),            /*   RACF RETURNED           */ 09650000
*     5 FP00RF2E     BIT(1),            /*   RACF CALLED             */ 09660000
*                                       /*     (CREATE ACCESSOR ENV) */ 09670000
*     5 FP00RF2X     BIT(1),            /*   RACF RETURNED           */ 09680000
*     5 FP00CSC      BIT(1),            /*   CSCB BUILT              */ 09690000
*     5 FP00EST      BIT(1),            /*   ESTAE CLEARED           */ 09700000
*     5 *            BIT(1),            /*   Unused              @L5A*/ 09710000
*     5 *            BIT(1),            /*   Unused              @L5A*/ 09720000
*     5 FP00SD1E     BIT(1),            /*   IEFINSWD linked,    @L5A*/ 09730000
*                                       /*     error freeing NEL @L5A*/ 09740000
*                                       /*     or in GETWORK rtn @L5A*/ 09750000
*     5 FP00SD1X     BIT(1),            /*   IEFINSWD returned,  @L5A*/ 09760000
*                                       /*     error freeing NEL @L5A*/ 09770000
*                                       /*     or in GETWORK rtn @L5A*/ 09780000
*     5 FP00SD2E     BIT(1),            /*   IEFINSWD linked,    @L5A*/ 09790000
*                                       /*     RACF error        @L5A*/ 09800000
*     5 FP00SD2X     BIT(1),            /*   IEFINSWD returned,  @L5A*/ 09810000
*                                       /*     RACF error        @L5A*/ 09820000
*     5 FP00SD3E     BIT(1),            /*   IEFINSWD linked,    @L5A*/ 09830000
*                                       /*     error in          @L5A*/ 09840000
*                                       /*     reconstruction    @L5A*/ 09850000
*     5 FP00SD3X     BIT(1),            /*   IEFINSWD returned,  @L5A*/ 09860000
*                                       /*     error in          @L5A*/ 09870000
*                                       /*     reconstruction    @L5A*/ 09880000
*     5 FP00VSME     BIT(1),            /*   VSM invoked         @L5A*/ 09890000
*     5 FP00VSMX     BIT(1),            /*   VSM returned        @L5A*/ 09900000
*     5 FP00SMSE     BIT(1),            /*   IEFSSREQ invoked    @P2A*/ 09910000
*                                       /*    (DFSMS IDAX)       @P2A*/ 09920000
*     5 FP00SMSX     BIT(1),            /*   IEFSSREQ returned   @P2A*/ 09930000
*     5 *            BIT(6),            /*                       @P2C*/ 09940000
*                                       /*                     11@L5D*/ 09950000
*     5 *            BIT(8),            /*                       @L5C*/ 09960000
*                                       /*                           */ 09970000
*                                       /*                           */ 09980000
*   3 FP605       BIT(8),               /* IEFIB605 FOOTPRINT BITS   */ 09990000
*     5 FP05601E     BIT(1),            /*   IEFXB601 CALLED         */ 10000000
*     5 FP05601X     BIT(1),            /*   IEFXB601 RETURNED       */ 10010000
*     5 FP05609E     BIT(1),            /*   IEFXB609 CALLED         */ 10020000
*     5 FP05609X     BIT(1),            /*   IEFXB609 RETURNED       */ 10030000
*     5 FP05TDSE     BIT(1),            /*   IEFXBTDS called     @P2C*/ 10040000
*     5 FP05TDSX     BIT(1),            /*   IEFXBTDS returned   @P2C*/ 10050000
*     5 *            BIT(2),            /*                       @P2C*/ 10060000
*                                       /*                           */ 10070000
*                                       /*                           */ 10080000
*   3 FP645       BIT(8),               /* IEFIB645 FOOTPRINT BITS   */ 10090000
*     5 FP45NEL      BIT(1),            /*   NEL FREED               */ 10100000
*     5 FP45SWDE     BIT(1),            /*   IEFINSWD linked     @L5C*/ 10110000
*     5 FP45SWDX     BIT(1),            /*   IEFINSWD returned   @L5C*/ 10120000
*     5 FP45LST      BIT(1),            /*   ESTAE LIST FREED        */ 10130000
*     5 *            BIT(4),            /*                       @L5C*/ 10140000
*                                       /*                           */ 10150000
*                                       /*                           */ 10160000
*   3 FP101       BIT(16),              /* IEFSD101 FOOTPRINT BITS   */ 10170000
*     5 FP01SMFE     BIT(1),            /*   SMF CALLED              */ 10180000
*     5 FP01SMFX     BIT(1),            /*   SMF RETURNED            */ 10190000
*     5 FP01PPC      BIT(1),            /*   PPT FLAGS CLEARED       */ 10200000
*     5 FP01CPUE     BIT(1),            /*   IEFICPUA CALLED         */ 10210000
*     5 FP01CPUX     BIT(1),            /*   IEFICPUA RETURNED       */ 10220000
*     5 FP01MSKE     BIT(1),            /*   IEFIMASK CALLED         */ 10230000
*     5 FP01MSKX     BIT(1),            /*   IEFIMASK RETURNED       */ 10240000
*     5 FP01RST      BIT(1),            /*   CKPT/RESTART DETECTED   */ 10250000
*     5 FP01PPT      BIT(1),            /*   PPT FLAGS SET           */ 10260000
*     5 FP01PSCE     BIT(1),            /*   IEFPPSCN invoked    @P2C*/ 10270000
*     5 FP01PSCX     BIT(1),            /*   IEFPPSCN returned   @P2A*/ 10280000
*     5 *            BIT(5),            /*                       @P2C*/ 10290000
*                                       /*                           */ 10300000
*                                       /*                           */ 10310000
*   3 FP102       BIT(16),              /* IEFSD102 Footprints   @L5C*/ 10320000
*     5 FP02ELJ      BIT(1),            /*   DSENQ LIST FREED        */ 10330000
*                                       /*     (JOB FAILED)          */ 10340000
*     5 FP02ENQE     BIT(1),            /*   ENQUEUE CALLED          */ 10350000
*     5 FP02ENQX     BIT(1),            /*   ENQUEUE RETURNED        */ 10360000
*     5 FP02ENF      BIT(1),            /*   ENQ FAILED              */ 10370000
*     5 FP02ELF      BIT(1),            /*   DSENQ LIST FREED        */ 10380000
*     5 FP02WDS      BIT(1),            /*   WAITING ON DATA SETS    */ 10390000
*     5 FP02CNL      BIT(1),            /*   CANCELED WHILE WAITING  */ 10400000
*     5 *            BIT(9),            /*                       @L5C*/ 10410000
*                                       /*                           */ 10420000
*                                       /*                           */ 10430000
*   3 FP162       BIT(40),              /* IEFSD162 Footprints   @L5C*/ 10440000
*     5 FP62TIM      BIT(1),            /*   STEP TIME CALCULATED    */ 10450000
*     5 FP62SW1E     BIT(1),            /*   SWA MANAGER CALLED      */ 10460000
*                                       /*     (READ SIOT)           */ 10470000
*     5 FP62SW1X     BIT(1),            /*   SWA MANAGER EXITED      */ 10480000
*     5 FP62SSIE     BIT(1),            /*   SSI CALLED (STEP INIT)  */ 10490000
*     5 FP62SSIX     BIT(1),            /*   SSI RETURNED            */ 10500000
*     5 FP62604E     BIT(1),            /*   IEFXB604 CALLED         */ 10510000
*     5 FP62604X     BIT(1),            /*   IEFXB604 RETURNED       */ 10520000
*     5 FP62W21E     BIT(1),            /*   IEFW21SD CALLED (ALLOC) */ 10530000
*     5 FP62W21X     BIT(1),            /*   IEFW21SD RETURNED       */ 10540000
*     5 FP62501E     BIT(1),            /*   IEFXB501 CALLED (JRNL)  */ 10550000
*     5 FP62501X     BIT(1),            /*   IEFXB501 RETURNED       */ 10560000
*     5 FP62ALF      BIT(1),            /*   ALLOC FAIL OR BYPASS    */ 10570000
*     5 FP62RST      BIT(1),            /*   RESTART PARMS SET       */ 10580000
*     5 FP62SW2E     BIT(1),            /*   SWA MANAGER CALLED      */ 10590000
*                                       /*     (READ SCTX)       @L1C*/ 10600000
*     5 FP62SW2X     BIT(1),            /*   SWA MANAGER RETURNED    */ 10610000
*     5 FP62SW3E     BIT(1),            /*   SWA MANAGER CALLED      */ 10620000
*                                       /*     (WRITE JCTX)      @L1C*/ 10630000
*     5 FP62SW3X     BIT(1),            /*   SWA MANAGER RETURNED    */ 10640000
*     5 FP62STRE     BIT(1),            /*   IEFINSTR called     @D2C*/ 10650000
*     5 FP62STRX     BIT(1),            /*   IEFINSTR returned   @D2A*/ 10660000
*     5 FP62ATP      BIT(1),            /*   GOT ATTACH PARM LIST    */ 10670000
*     5 FP62660E     BIT(1),            /*   IEFIB660 CALLED         */ 10680000
*     5 FP62660X     BIT(1),            /*   IEFIB660 RETURNED       */ 10690000
*     5 FP62JSL      BIT(1),            /*   JOBLIB, STEPLIB OPEN    */ 10700000
*     5 FP62SFL      BIT(1),            /*   STEPLIB, FETCHLIB OPEN  */ 10710000
*     5 FP62PPT      BIT(1),            /*   PROGRAM PROPERTIES SET  */ 10720000
*     5 FP62OPE      BIT(1),            /*   OPEN ERROR              */ 10730000
*     5 FP62PMDO     BIT(1),            /*   PARMDD DS OPEN      @L8A*/ 10740001
*     5 FP62PMDX     BIT(1),            /*   PARMDD DS CLOSED    @L8A*/ 10740101
*     5 *            BIT(12),           /*                       @L8C*/ 10741001
*                                       /*                           */ 10750000
*                                       /*                           */ 10760000
*   3 FPCAT       BIT(8),               /* IEFICATL FOOTPRINT BITS   */ 10770000
*                                       /*                      3@P2D*/ 10780000
*     5 FPCT4F5      BIT(1),            /*   IEFAB4F5 toggle     @P2C*/ 10790000
*     5 *            BIT(7),            /*                       @P2C*/ 10800000
*                                       /*                           */ 10810000
*                                       /*                           */ 10820000
*   3 FP103       BIT(8),               /* IEFSD103 FOOTPRINT BITS   */ 10830000
*     5 FP03ATL      BIT(1),            /*   ATTACH LIST COMPLETED   */ 10840000
*     5 *            BIT(1),            /*   Unused              @D3C*/ 10850000
*     5 FP03GRP      BIT(1),            /*   PERFORMANCE GROUP SET   */ 10860000
*     5 *            BIT(5),            /*                           */ 10870000
*                                       /*                           */ 10880000
*                                       /*                           */ 10890000
*   3 FP263       BIT(56),              /* IEFSD263 Footprints   @L5C*/ 10900000
*     5 FP63EX1      BIT(1),            /*   FREEPART EXIT TAKEN     */ 10910000
*     5 FP63RGWT     BIT(1),            /*   REAL GWT INITIALIZED    */ 10920000
*     5 FP63VGWT     BIT(1),            /*   VIRTUAL GWT INITIALIZED */ 10930000
*     5 FP63VSME     BIT(1),            /*   GET REGION CALLED       */ 10940000
*     5 FP63VSMX     BIT(1),            /*   GET REGION RETURNED     */ 10950000
*     5 FP63EV1E     BIT(1),            /*   SYSEVENT CALLED         */ 10960000
*                                       /*     (TRANSWAP)            */ 10970000
*     5 FP63EV1X     BIT(1),            /*   SYSEVENT RETURNED       */ 10980000
*     5 FP63EV2E     BIT(1),            /*   SYSEVENT CALLED         */ 10990000
*                                       /*     (REQSWAP)             */ 11000000
*     5 FP63EV2X     BIT(1),            /*   SYSEVENT RETURNED       */ 11010000
*     5 FP63GRG      BIT(1),            /*   GOT REQUESTED REGION    */ 11020000
*     5 FP63EX2      BIT(1),            /*   PRE-INVOCATN EXIT TAKEN */ 11030000
*     5 FP63SMFE     BIT(1),            /*   IEFSMFAT CALLED         */ 11040000
*     5 FP63SMFX     BIT(1),            /*   IEFSMFAT RETURNED       */ 11050000
*     5 FP63ATC      BIT(1),            /*   JOB STEP ATTACHED       */ 11060000
*     5 FP63TIM      BIT(1),            /*   TIME CALCULATION DONE   */ 11070000
*     5 FP63SW1E     BIT(1),            /*   SWA MANAGER CALLED      */ 11080000
*                                       /*     (READ ACT)            */ 11090000
*     5 FP63SW1X     BIT(1),            /*   SWA MANAGER RETURNED    */ 11100000
*     5 FP63EV3E     BIT(1),            /*   SYSEVENT CALLED         */ 11110000
*                                       /*     (INITATT)             */ 11120000
*     5 FP63EV3X     BIT(1),            /*   SYSEVENT RETURNED       */ 11130000
*     5 FP63VR0E     BIT(1),            /*   Get Virt Rgn called @P2A*/ 11140000
*                                       /*     (default request) @P2A*/ 11150000
*     5 FP63VR0X     BIT(1),            /*   Get Virtual Region  @P2A*/ 11160000
*                                       /*     returned          @P2A*/ 11170000
*     5 *            BIT(1),            /*   1 unused            @P2C*/ 11180000
*     5 FP63STM      BIT(1),            /*   STEP TIME SAVED         */ 11190000
*     5 FP63EX3      BIT(1),            /*   POST-INVOCATN EXIT TAKEN*/ 11200000
*     5 FP63VR1E     BIT(1),            /*   GET VIRTUAL RGN CALLED  */ 11210000
*                                       /*     (V=R PROCESSING)      */ 11220000
*     5 FP63VR1X     BIT(1),            /*   GET VIRT RGN RETURNED   */ 11230000
*     5 *            BIT(6),            /*                           */ 11240000
*     5 FP63EV4E     BIT(1),            /*   SYSEVENT CALLED         */ 11250000
*                                       /*     (INITDET)             */ 11260000
*     5 FP63EV4X     BIT(1),            /*   SYSEVENT RETURNED       */ 11270000
*     5 FP63EV5E     BIT(1),            /*   SYSEVENT CALLED         */ 11280000
*                                       /*     (INITDET)             */ 11290000
*     5 FP63EV5X     BIT(1),            /*   SYSEVENT RETURNED       */ 11300000
*     5 FP63VR2E     BIT(1),            /*   GET VIRTUAL RGN CALLED  */ 11310000
*                                       /*     (V=V PROCESSING)      */ 11320000
*     5 FP63VR2X     BIT(1),            /*   GET VIRT RGN RETURNED   */ 11330000
*     5 FP63DET      BIT(1),            /*   JOB STEP DETACHED       */ 11340000
*     5 *            BIT(1),            /*                           */ 11350000
*     5 FP63BALE     BIT(1),            /*   CALLED EXIT VIA BALR    */ 11360000
*     5 FP63BALX     BIT(1),            /*   RETURNED FROM EXIT      */ 11370000
*     5 FP63LNKE     BIT(1),            /*   CALLED EXIT VIA LINK    */ 11380000
*     5 FP63LNKX     BIT(1),            /*   RETURNED FROM EXIT      */ 11390000
*     5 FP63XCTE     BIT(1),            /*   CALL EXIT VIA XCTL  @L1A*/ 11400000
*     5 *            BIT(11),           /*                       @L5C*/ 11410000
*                                       /*                           */ 11420000
*                                       /*                           */ 11430000
*   3 FP164       BIT(32),              /* IEFSD164 FOOTPRINT BITS   */ 11440000
*     5 FP64WRM      BIT(1),            /*   PROCESSING WARMSTART    */ 11450000
*     5 FP64ALO      BIT(1),            /*   ABEND FOR ALLOCATE ERROR*/ 11460000
*     5 FP64FCL      BIT(1),            /*   FETCHLIB CLOSE & FREE   */ 11470000
*     5 FP64GTP      BIT(1),            /*   GOT TERMINATE PARM LIST */ 11480000
*     5 FP64STC      BIT(1),            /*   JOB/STEPLIB CLOSE & FREE*/ 11490000
*     5 FP64SW1E     BIT(1),            /*   SWA MANAGER CALLED      */ 11500000
*                                       /*     (READ ACT)            */ 11510000
*     5 FP64SW1X     BIT(1),            /*   SWA MANAGER RETURNED    */ 11520000
*     5 FP64SW2E     BIT(1),            /*   SWA MANAGER CALLED      */ 11530000
*                                       /*     (WRITE ACT)           */ 11540000
*     5 FP64SW2X     BIT(1),            /*   SWA MANAGER RETURNED    */ 11550000
*     5 FP64TIM      BIT(1),            /*   JOB/STEP TIMES COMPUTED */ 11560000
*     5 FP64DTC      BIT(1),            /*   GOT DUMMY TCB           */ 11570000
*     5 FP64SW3E     BIT(1),            /*   SWA MANAGER CALLED      */ 11580000
*                                       /*     (JOURNAL CNTL BLOCKS) */ 11590000
*     5 FP64SW3X     BIT(1),            /*   SWA MANAGER RETURNED    */ 11600000
*     5 FP64UALE     BIT(1),            /*   UNALLOCATION CALLED     */ 11610000
*     5 FP64UALX     BIT(1),            /*   UNALLOCATION RETURNED   */ 11620000
*     5 FP64SW4E     BIT(1),            /*   SWA MANAGER CALLED      */ 11630000
*                                       /*     (JOURNAL CNTL BLOCKS) */ 11640000
*     5 FP64SW4X     BIT(1),            /*   SWA MANAGER RETURNED    */ 11650000
*     5 FP64FTC      BIT(1),            /*   FREED DUMMY TCB         */ 11660000
*     5 FP64FTP      BIT(1),            /*   FREED TERM PARM LIST    */ 11670000
*     5 FP64CLRE     BIT(1),            /*   CLEAR JES MSGS CALLED   */ 11680000
*     5 FP64CLRX     BIT(1),            /*   CLEAR JES MSGS RETURNED */ 11690000
*     5 FP64SW5E     BIT(1),            /*   SWA MANAGER CALLED      */ 11700000
*                                       /*     (READ NEXT STC)       */ 11710000
*     5 FP64SW5X     BIT(1),            /*   SWA MANAGER RETURNED    */ 11720000
*     5 FP64STRE     BIT(1),            /*   IEFINSTR called     @D2C*/ 11730000
*     5 FP64STRX     BIT(1),            /*   IEFINSTR returned   @D2A*/ 11740000
*     5 FP64SSEE     BIT(1),            /* SSI CALLED (STEP END) @L7A*/ 11750000
*     5 FP64SSEX     BIT(1),            /* SSI RETURNED          @L7A*/ 11760000
*     5 FP64PMDX     BIT(1),            /* PARMDD DS CLOSED      @L8A*/ 11761002
*     5 *            BIT(4),            /*                       @L8C*/ 11770002
*                                       /*                           */ 11780000
*   3 FPCPU       BIT(8),               /* IEFICPUA FOOTPRINT BITS   */ 11790000
*     5 FPCPENQ      BIT(1),            /*   ENQ ON SYSZCSD          */ 11800000
*     5 FPCPDEQ      BIT(1),            /*   DEQ ON SYSZCSD          */ 11810000
*     5 *            BIT(6),            /*                           */ 11820000
*                                       /*                           */ 11830000
*   3 FPMSK       BIT(8),               /* IEFIMASK FOOTPRINT BITS   */ 11840000
*     5 FPMSSCN      BIT(1),            /*   BIT STRING SCANNED      */ 11850000
*     5 *            BIT(7),            /*                           */ 11860000
*                                       /*                           */ 11870000
*   3 FPCND       BIT(8),               /* IEFINCND Footprints   @01A*/ 11880000
*     5 FPCNWIFB     BIT(1),            /* Indicate call for Write      11890000
*                                          modified IFB          @01A*/ 11900000
*     5 FPCNPMSE     BIT(1),            /* Indicate call to IEFTB723    11910000
*                                          to issue message      @01A*/ 11920000
*     5 FPCNPMSX     BIT(1),            /* Indicate return from         11930000
*                                          IEFTB723 to issue message    11940000
*                                                                @01A*/ 11950000
*     5 *            BIT(5),            /*                       @01A*/ 11960000
*                                       /*                           */ 11970000
*   3 FPSWD       BIT(16),              /* IEFINSWD Footprints   @L5C*/ 11980000
*     5 FPSWDE       BIT(1),            /* IEFINSWD entered      @04A*/ 11990000
*     5 FPSDLCT      BIT(1),            /* SWA pointers reset in LCT    12000000
*                                                                @04A*/ 12010000
*     5 FPSDSWME     BIT(1),            /* Called SWA Manager Subpool   12020000
*                                          Delete                @04A*/ 12030000
*     5 FPSDSWMX     BIT(1),            /* SWA Manager Subpool Delete   12040000
*                                          returned              @04A*/ 12050000
*     5 FPSDJSCB     BIT(1),            /* JSCB processing done  @04A*/ 12060000
*     5 FPSDCIB      BIT(1),            /* CIB processing done   @04A*/ 12070000
*     5 FPSDCSCB     BIT(1),            /* CSCB processing done  @04A*/ 12080000
*     5 FPSWDX       BIT(1),            /* IEFINSWD exited       @04A*/ 12090000
*     5 FPSDVSME     BIT(1),            /* VSM invoked           @L5A*/ 12100000
*     5 FPSDVSMX     BIT(1),            /* VSM returned          @L5A*/ 12110000
*     5 FPSDVAT      BIT(1),            /* VAT freed             @L5A*/ 12120000
*     5 *            BIT(5),            /*                       @L5A*/ 12130000
*                                       /*                           */ 12140000
*   3 FPWTE       BIT(16),              /* IEFINWTE Footprints   @L5C*/ 12150000
*     5 FPWEDSP      BIT(1),            /* Task dispatchable     @L3A*/ 12160000
*     5 FPWECNL      BIT(1),            /* Task canceled         @L3A*/ 12170000
*     5 FPWEEND      BIT(1),            /* Task ended            @L3A*/ 12180000
*     5 FPWEOPEN     BIT(1),            /* OPEN/MVS function request    12190000
*                                                                @L4C*/ 12200000
*     5 FPWESWAC     BIT(1),            /* Call SWA Manager Assign      12210000
*                                                                @L3A*/ 12220000
*     5 FPWESWAE     BIT(1),            /* SWA Manager Assign exited    12230000
*                                                                @L3A*/ 12240000
*     5 FPWESWWC     BIT(1),            /* Call SWA Manager Write       12250000
*                                                                @L3A*/ 12260000
*     5 FPWESWWE     BIT(1),            /* SWA Manager Write exited     12270000
*                                                                @L3A*/ 12280000
*     5 *            BIT(8),            /*                       @L5A*/ 12290000
*                                       /*                           */ 12300000
*   3 FPSTR       BIT(8),               /* IEFINSTR Footprints   @L6C*/ 12310000
*     5 FPSTRUNE     BIT(1),            /* ATBUNID called        @L6A*/ 12320000
*     5 FPSTRUNX     BIT(1),            /* ATBUNID returned      @L6A*/ 12330000
*     5 FPSTRAME     BIT(1),            /* ATBAMR1 called        @L6A*/ 12340000
*     5 FPSTRAMX     BIT(1),            /* ATBAMR1 returned      @L6A*/ 12350000
*     5 FPSTRMPE     BIT(1),            /* BPX1MPC called        @L6A*/ 12360000
*     5 FPSTRMPX     BIT(1),            /* BPX1MPC returned      @L6A*/ 12370000
*     5 *            BIT(2),            /*                       @L6A*/ 12380000
*                                       /*                           */ 12390000
*   3 *           BIT(8),               /* Reserved              @L3A*/ 12400000
*   3 *           BIT(8),               /* Reserved              @L3A*/ 12410000
*   3 *           BIT(8),               /* Reserved              @L5A*/ 12420000
*   3 *           BIT(8),               /* Reserved              @L5A*/ 12430000
*   3 *           BIT(8),               /* Reserved              @L5A*/ 12440000
*   3 *           BIT(8),               /* Reserved              @L5A*/ 12450000
*   3 *           BIT(8),               /* Reserved              @L5A*/ 12460000
*   3 *           CHAR(0)  BDY(WORD);   /* FORCE FULL WORD LENGTH    */ 12470000
*                                       /*                           */ 12480000
* DCL                                   /*                           */ 12490000
*   FPHDR CHAR(8) CONSTANT('INITFPNT'); /* FOOTPRINT HEADER          */ 12500000
