*  %GOTO JQRYPRO;                         /*                            00010000
        MACRO                                                           00020000
        IEFJSQRY                                                        00030000
.*/ %JQRYPRO:;                                                          00040000
*/* START OF SPECIFICATIONS ******************************************/ 00050000
*/*                                                                  */ 00060000
*/*01* MACRO NAME: IEFJSQRY                                          */ 00070000
*/*                                                                  */ 00080000
*/*01* DESCRIPTIVE NAME:  IEFSSI QUERY Output Mapping                */ 00090000
*/*                                                                  */ 00100000
*/*02*  ACRONYM:  IEFJSQRY                                           */ 00110000
*/*                                                                  */ 00120000
*/*01* PROPRIETARY STATEMENT=                                        */ 00130000
*/***PROPRIETARY_STATEMENT********************************************/ 00140000
*/*                                                                  */ 00150000
*/*                                                                  */ 00160000
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00170000
*/* 5650-ZOS COPYRIGHT IBM CORP. 1997, 2021                          */ 00180003
*/*                                                                  */ 00190000
*/* STATUS= HBB77D0                                                  */ 00200003
*/*                                                                  */ 00210000
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 00220000
*/*                                                                  */ 00230000
*/*01* FUNCTION:  Maps the output of an IEFSSI QUERY request         */ 00240000
*/*                                                                  */ 00250000
*/*01* EXTERNAL CLASSIFICATION: GUPI                                 */ 00260000
*/*01* END OF EXTERNAL CLASSIFICATION:                               */ 00270000
*/*                                                                  */ 00280000
*/*01* DSECT NAME:                                                   */ 00290000
*/*      JQRY_HEADER         -  Output header data                   */ 00300000
*/*      JQRY_SUBSYS_ENTRY   -  Data for one subsystem               */ 00310000
*/*      JQRY_VT_ENTRY       -  Data for one vector table            */ 00320000
*/*                                                                  */ 00330000
*/*01* COMPONENT:  Subsystem Interface (SC1B6)                       */ 00340000
*/*                                                                  */ 00350000
*/*01* EYE-CATCHER:  JQRY                                            */ 00360000
*/*02*  OFFSET:  0                                                   */ 00370000
*/*02*  LENGTH:  4 bytes                                             */ 00380000
*/*                                                                  */ 00390000
*/*01* STORAGE ATTRIBUTES:                                           */ 00400000
*/*02*  SUBPOOL:  Determined by caller of IEFSSI REQUEST=QUERY       */ 00410000
*/*02*  KEY:  Key of IEFSSI caller (if subpool is variable key)      */ 00420000
*/*02*  RESIDENCY:  ABOVE if permitted by subpool, otherwise BELOW   */ 00430000
*/*02*  MAIN STORAGE:  No                                            */ 00440000
*/*02*  AUXILIARY STORAGE:  Yes                                      */ 00450000
*/*02*  VIRTUAL STORAGE:  Yes                                        */ 00460000
*/*02*  DATA SPACE:  No                                              */ 00470000
*/*                                                                  */ 00480000
*/*01* SIZE: JQRY_HEADER_LEN + (number subsystems * JQRY_SUBSYS_LEN) */ 00490000
*/*                                                                  */ 00500000
*/*01* CREATED BY:  Subsystem Interface                              */ 00510000
*/*                                                                  */ 00520000
*/*01* POINTED TO BY:                                                */ 00530000
*/*    User pointer identified by the WORKAREA keyword in the        */ 00540000
*/*      IEFSSI invocation                                           */ 00550000
*/*                                                                  */ 00560000
*/*01* SERIALIZATION:  None                                          */ 00570000
*/*                                                                  */ 00580000
*/**INVOCATION********************************************************/ 00590000
*/*                                                                  */ 00600000
*/*01* METHOD OF ACCESS:                                             */ 00610000
*/*                                                                  */ 00620000
*/*    The output of the QUERY request is organized as follows:      */ 00630000
*/*                                                                  */ 00640000
*/*           +------------------------------------------+           */ 00650000
*/*           !JQRY_HEADER                               !           */ 00660000
*/*           +------------------------------------------+           */ 00670000
*/*           !  JQRY_SUBSYS_ENTRY                       !           */ 00680000
*/*           +------------------------------------------+           */ 00690000
*/*           !    JQRY_VT_ENTRY                         !           */ 00700000
*/*           +------------------------------------------+           */ 00710000
*/*           !    JQRY_VT_ENTRY                         !           */ 00720000
*/*           +------------------------------------------+           */ 00730000
*/*           !  JQRY_SUBSYS_ENTRY                       !           */ 00740000
*/*           +------------------------------------------+           */ 00750000
*/*           !                                          !           */ 00760000
*/*          ---  Variable number of subsystem entries  ---          */ 00770000
*/*           !                                          !           */ 00780000
*/*           +------------------------------------------+           */ 00790000
*/*           !  JQRY_SUBSYS_ENTRY                       !           */ 00800000
*/*           +------------------------------------------+           */ 00810000
*/*           !    JQRY_VT_ENTRY                         !           */ 00820000
*/*           +------------------------------------------+           */ 00830000
*/*           !    JQRY_VT_ENTRY                         !           */ 00840000
*/*           +------------------------------------------+           */ 00850000
*/*                                                                  */ 00860000
*/*           The number of subsystems for which data is             */ 00870000
*/*           returned is given by the JQRY_NUM_SUBSYS field         */ 00880000
*/*           of the JQRY_HEADER area.                               */ 00890000
*/*                                                                  */ 00900000
*/*           The data for each subsystem consists of a              */ 00910000
*/*           subsystem entry followed by two vector table           */ 00920000
*/*           entries.  The number of vector tables for which        */ 00930000
*/*           data is actually returned is given by the              */ 00940000
*/*           JQRY_NUM_VT field of the JQRY_SUBSYS_ENTRY area.       */ 00950000
*/*                                                                  */ 00960000
*/*           If set, the JQRY_INCOMPLETE flag indicates that        */ 00970000
*/*           the information returned for a dynamic subsystem       */ 00980000
*/*           may be incomplete.  The following information will     */ 00990000
*/*           not be available:                                      */ 01000000
*/*                                                                  */ 01010000
*/*           - Data that is valid only when JQRY_DYNAMIC is set     */ 01020000
*/*           - Data for associated SSI-managed vector tables.       */ 01030000
*/*                                                                  */ 01040000
*/*           This condition may occur for certain system errors     */ 01050000
*/*           that do not prevent the completion of the QUERY        */ 01060000
*/*           request.                                               */ 01070000
*/*                                                                  */ 01080000
*/*02*   BAL:                                                        */ 01090000
*/*        IEFJSQRY                                                  */ 01100000
*/*                                                                  */ 01110000
*/*02*   PL/X:                                                       */ 01120000
*/*        %INCLUDE SYSLIB(IEFJSQRY)                                 */ 01130000
*/*                                                                  */ 01140000
*/********************************************************************/ 01150000
*/*01* DELETED BY:  User of IEFSSI QUERY service                     */ 01160000
*/*                                                                  */ 01170000
*/*01* NOTES:  None                                                  */ 01180000
*/*                                                                  */ 01190000
*/*02*   RESTRICTIONS:                                               */ 01200000
*/*                                                                  */ 01210000
*/*      - If a subsystem has both SSI-managed and               @P1A*/ 01220000
*/*        non-SSI-managed vector tables, the data for that      @P1A*/ 01230000
*/*        subsystem will reflect only the SSI-managed vector    @P1A*/ 01240000
*/*        tables                                                @P1A*/ 01250000
*/*                                                                  */ 01260000
*/*02*   DEPENDENCIES:  None                                         */ 01270000
*/*                                                                  */ 01280000
*/*01* DISTRIBUTION LIBRARY:  AMACLIB                                */ 01290000
*/*                                                                  */ 01300000
*/*01* CHANGE ACTIVITY:                                              */ 01310000
*/*                                                                  */ 01320000
*/*  $L0=SSIDP    HBB5520 940106 PDBN:  Dynamic SSI                  */ 01330000
*/*  $D1=DN70025  HBB5520 940414 PDBN:  Dynamic SSI                  */ 01340000
*/*  $P1=PN70317  HBB5520 940414 PDBN:  Dynamic SSI                  */ 01350000
*/*  $01=OW15398  HBB5520 950926 PDLS:  Fix for assembler mapping    */ 01360000
*/*  $P2=PQC0757  HBB6603 960201 PDBN:  1-byte assembler flags       */ 01370000
*/*  $P3=PYN0558  HBB7708 020815 PDXB:  SSID, SSVT^=0                */ 01380000
*/*  $L1=SSIDEL   HBB77A0 140601 PDTA:  SSI DELETE support           */ 01390000
*/*                                     Feature ME27621              */ 01391000
*/*  $P4=W385484  HBB77D0 200901 PDTA:  Create C header          @P4A*/ 01391103
*/*                                                                  */ 01392000
*/* END OF SPECIFICATIONS ********************************************/ 01400000
*/*                                                                  */ 01410000
*/* A - Created for Dynamic SSI                                      */ 01420000
*/* C - Remove support for vector table usage monitoring         @D1A*/ 01430000
*/* A - Document restriction on information returned for             */ 01440000
*/*     subsystems having both SSI-managed and non-SSI-managed       */ 01450000
*/*     vector tables.                                           @P1A*/ 01460000
*/* C - Correct assembler mapping for bit fields                 @01A*/ 01470000
*/* C - Provide 1-byte assembler mappings of flag fields.        @P2A*/ 01480000
*/* A - Provide JQRY_SSID                                        @P3A*/ 01490000
*/* A - Add JQRY_EVENTRTN_LOADED.                                @L1A*/ 01491000
*/* A - Add CBGENC macro logic to support C header file          @P4A*/ 01493004
*/********************************************************************/ 01500000
*%GOTO JQRY_PLX;                                                        01510000
JQRY_HEADER       DSECT ,           IEFSSI QUERY output area            01520000
                  DS  0F                                                01530000
JQRYID            DS  CL4           Control block identifier (JQRYCID)  01540000
JQRYVERS          DS  H             Version number.  Current version   +01550000
                                      is JQRYCVER.                      01560000
                  DS  H             Reserved                            01570000
JQRYLEN           DS  F             Length of data returned by the     +01580000
                                      QUERY request                     01590000
JQRY_NUM_SUBSYS   DS  F             Number of subsystems for which     +01600000
                                      data is returned                  01610000
JQRY_SUBSYS_DATA  EQU *             Subsystem data                      01620000
*---------------------------------------------------------------------  01630000
JQRY_SUBSYS_ENTRY DSECT ,           Data for one subsystem              01640000
JQRY_SUBSYS_NAME  DS  CL4           Name of the subsystem               01650000
JQRY_SSID         DS  X             Subsystem ID                   @P3A 01660000
JQRY_SSID_UNKNOWN EQU X'00'         SSID value when unknown        @P3A 01670000
JQRY_SSID_JES2    EQU X'02'         SSID value when JES2           @P3A 01680000
JQRY_SSID_JES3    EQU X'03'         SSID value when JES3           @P3A 01690000
                  DS  CL7           Reserved                            01700000
*********************************************************************** 01710000
* Any future subsystem status flags will be defined only in the    @P2A 01720000
* 1-byte fields JQRY_STATUS1 and JQRY_STATUS2.  The existing       @P2A 01730000
* 2-byte flag fields are left for compatibility, but new flags     @P2A 01740000
* will be defined as 1-byte values.                                @P2A 01750000
*********************************************************************** 01760000
JQRY_STATUS       DS  0CL2          Subsystem flags                @P2C 01770000
JQRY_PRIMARY         EQU X'8000'    Subsystem is the primary subsystem  01780000
JQRY_DYNAMIC         EQU X'4000'    Subsystem is dynamic                01790000
JQRY_DYNSSI_COMMANDS EQU X'2000'    Subsystem responds to the SETSSI   +01800000
                                      command.  Valid only if          +01810000
                                      JQRY_DYNAMIC set.                 01820000
JQRY_ACTIVE          EQU X'1000'    Subsystem is active                 01830000
JQRY_INCOMPLETE      EQU X'0001'    Data for this subsystem may be     +01840000
                                      incomplete                        01850000
JQRY_STATUS1      DS  CL1           Subsystem flags - byte 1       @P2A 01860000
JQRY_PRIMARY1        EQU X'80'      Subsystem is the primary           +01870000
                                      subsystem                    @P2A 01880000
JQRY_DYNAMIC1        EQU X'40'      Subsystem is dynamic           @P2A 01890000
JQRY_DYNSSI_COMMANDS1 EQU X'20'     Subsystem responds to the SETSSI   +01900000
                                      command.  Valid only if          +01910000
                                      JQRY_DYNAMIC1 set.           @P2A 01920000
JQRY_ACTIVE1         EQU X'10'      Subsystem is active            @P2A 01930000
JQRY_EVENTRTN_LOADED EQU X'08'      Subsystem has a subsystem event    +01931000
                                    routine loaded and available   @L1A 01932000
JQRY_STATUS2      DS  CL1           Subsystem flags - byte 2       @P2A 01940000
JQRY_INCOMPLETE2     EQU X'01'      Data for this subsystem may be     +01950000
                                      incomplete                   @P2A 01960000
JQRY_NUM_VT       DS  H             Number of vector tables associated +01970000
                                      with this subsystem               01980000
JQRY_VT_LIST      EQU *             List of associated vector tables   +01990000
                                      (space for description of two    +02000000
                                      vector tables)                    02010000
*---------------------------------------------------------------------  02020000
JQRY_VT_ENTRY     DSECT ,           Data for one vector table           02030000
JQRY_VT_LOC       DS  F             Vector table locator.  This is a   +02040000
                                      token if JQRY_VT_SSI_MANAGED     +02050000
                                      is set, and the vector table     +02060000
                                      address if the flag is not set.   02070000
JQRY_VT_FLAGS     DS  BL.8          Vector table flags             @01C 02080000
JQRY_VT_ACTIVE       EQU X'80'      This vector table is being used    +02090000
                                      to route function requests        02100000
JQRY_VT_SSI_MANAGED  EQU X'40'      Vector table is SSI-managed        +02110000
                                      (created via IEFSSVT)             02120000
                  DS  CL3           Reserved                            02130000
                  DS  CL4           Reserved                       @D1C 02140000
JQRY_VT_FUNC_LIST DS  0BL.256       Function code list             @01C 02150000
JQRY_VT_FUNC_CODES  DS BL.255       Bit mask indicating support    @01C+02160000
                                      function codes                   +02170000
                                      ('1'B = supported).  Valid if    +02180000
                                      JQRY_VT_SSI_MANAGED or           +02190000
                                      JQRY_VT_ACTIVE set.               02200000
*                                                                  @01D 02210000
                  DS  CL8           Reserved                            02220000
JQRY_VT_END       EQU *             End of vector table entry           02230000
*********************************************************************** 02240000
* Constant values                                                       02250000
*********************************************************************** 02260000
JQRYCID  EQU   C'JQRY'              Control block ID value              02270000
JQRYVER1 EQU   1                    First version of IEFJSQRY           02280000
JQRYCVER EQU   JQRYVER1             Current version of IEFJSQRY         02290000
*                                                                       02300000
JQRY_VT_LEN   EQU JQRY_VT_END-JQRY_VT_ENTRY   Length of data for       +02310000
                                      one vector table                  02320000
JQRY_SUBSYS_LEN   EQU JQRY_VT_LIST-JQRY_SUBSYS_ENTRY+(2*JQRY_VT_LEN)   +02330000
                                    Length of data for one subsystem    02340000
JQRY_HEADER_LEN   EQU JQRY_SUBSYS_DATA-JQRY_HEADER    Length of        +02350000
                                      JQRY_HEADER section               02360000
         MEND                                                           02370000
*%JQRY_PLX:;                                                            02380000
*/********************************************************************/ 02390000
*DCL 1 JQRY BASED,                  /* IEFSSI QUERY output area      */ 02400000
*      3 JQRY_HEADER,               /* Header information            */ 02410000
*        5 JQRYID CHAR(4),          /* Control block identifier         02420000
*                                      (JQRYCID)                     */ 02430000
*        5 JQRYVERS FIXED(15),      /* Version number.  Current         02440000
*                                      version is JQRYCVER.          */ 02450000
*        5 *              FIXED(15),  /* Reserved                    */ 02460000
*        5 JQRYLEN  FIXED(31),      /* Length of data returned by       02470000
*                                      the QUERY request             */ 02480000
*        5 JQRY_NUM_SUBSYS FIXED(31), /* Number of subsystems for       02490000
*                                      which data is returned        */ 02500000
*      3 JQRY_SUBSYS_DATA(*),       /* Subsystem data                */ 02510000
*        5 JQRY_SUBSYS_ENTRY,       /* Data for one subsystem        */ 02520000
*          7 JQRY_SUBSYS_NAME CHAR(4), /* Name of the subsystem      */ 02530000
*          7 JQRY_SSID FIXED(8),    /* Subsystem ID. See constants      02540000
*                                      beginning JQRY_SSID_ for         02550000
*                                      useful values             @P3A*/ 02560000
*          7 *          CHAR(7),    /* Reserved                  @P3C*/ 02570000
*          7 JQRY_STATUS BIT(16),   /* Subsystem flags               */ 02580000
*            9 JQRY_PRIMARY BIT(1), /* Subsystem is the primary         02590000
*                                      subsytem                      */ 02600000
*            9 JQRY_DYNAMIC BIT(1), /* Subsystem is dynamic          */ 02610000
*            9 JQRY_DYNSSI_COMMANDS BIT(1), /* Subsystem responds to    02620000
*                                      the SETSSI command.  Valid       02630000
*                                      only if JQRY_DYNAMIC set.     */ 02640000
*            9 JQRY_ACTIVE BIT(1),  /* Subsystem is active           */ 02650000
*            9 JQRY_EVENTRTN_LOADED Bit(1), /* Subsystem has a          02660000
*                                      subsystem event routine          02661000
*                                      loaded and available      @L1A*/ 02661100
*            9 * Bit(10),           /* Reserved                  @L1C*/ 02662000
*            9 JQRY_INCOMPLETE BIT(1),  /* Data for this subsystem      02670000
*                                      may be incomplete             */ 02680000
*          7 JQRY_NUM_VT FIXED(15), /* Number of vector tables          02690000
*                                      associated with this             02700000
*                                      subsystem                     */ 02710000
*          7 JQRY_VT_LIST(2),       /* List of associated               02720000
*                                      vector tables                 */ 02730000
*            9 JQRY_VT_ENTRY,       /* Data for one vector table     */ 02740000
*              11 JQRY_VT_LOC CHAR(4), /* Vector table locator. This is 02750000
*                                      a token if JQRY_VT_SSI_MANAGED   02760000
*                                      is set, and the vector table     02770000
*                                      address if the flag is not       02780000
*                                      set.                          */ 02790000
*              11 JQRY_VT_FLAGS BIT(8), /* Vector table flags        */ 02800000
*                13 JQRY_VT_ACTIVE BIT(1), /* This vector table is      02810000
*                                      being used to route function     02820000
*                                      requests                      */ 02830000
*                13 JQRY_VT_SSI_MANAGED BIT(1), /* Vector table is      02840000
*                                      SSI-managed (created via         02850000
*                                      IEFSSVT)                      */ 02860000
*                13 *   BIT(6),     /* Reserved                      */ 02870000
*              11 *     CHAR(3),    /* Reserved                      */ 02880000
*              11 *     CHAR(4),    /* Reserved                  @D1C*/ 02890000
*              11 JQRY_VT_FUNC_LIST BIT(256),  /* Function code list */ 02900000
* %If IBM_CBGENC = '' %Then         /* Normal PLX include?       @P4A*/ 02901004
* %Do;                                                                  02902002
*                13 JQRY_VT_FUNC_CODES BIT(255), /* Bit mask indicating 02910000
*                                      supported function codes         02920000
*                                      ('1'B = supported).  Valid       02930000
*                                      if JQRY_VT_SSI_MANAGED or        02940000
*                                      JQRY_VT_ACTIVE set.           */ 02950000
*                13 *   BIT(1),     /* Reserved                      */ 02960000
* %End;                                                                 02961000
* %Else %Do;                        /* C header                  @P4A*/ 02962004
*                13 JQRY_VT_FUNC_CODES BIT(256), /* Bit mask indicating 02962102
*                                      supported function codes         02962301
*                                      ('1'B = supported).  Valid       02962401
*                                      if JQRY_VT_SSI_MANAGED or        02962501
*                                      JQRY_VT_ACTIVE set.  Last bit    02962605
*                                      (function code 256) is not       02962705
*                                      used.                     @P4A*/ 02962805
* %End;                                                                 02963001
*              11 *     CHAR(8);    /* Reserved                      */ 02970000
*                                                                       02980000
*/********************************************************************/ 02990000
*/* Constant values                                                  */ 03000000
*/********************************************************************/ 03010000
*DCL JQRYCID CHAR(4) CONSTANT('JQRY');  /* Control block ID value    */ 03020000
*                                                                       03030000
*DCL JQRYVER1 FIXED(15) CONSTANT(1);  /* First version of JSQRY      */ 03040000
*DCL JQRYCVER FIXED(15) CONSTANT(JQRYVER1);  /* Current version         03050000
*                                      of JSQRY                      */ 03060000
*DCL JQRY_SSID_UNKNOWN FIXED(8) Constant(00);  /* Unknown        @P3A*/ 03070000
*DCL JQRY_SSID_JES2    FIXED(8) Constant(02);  /* JES2           @P3A*/ 03080000
*DCL JQRY_SSID_JES3    FIXED(8) Constant(03);  /* JES2           @P3A*/ 03090000
*                                                                       03100000
*DCL JQRY_HEADER_LEN FIXED(31)                                          03110000
*    CONSTANT(LENGTH(JQRY_HEADER)); /* Length of header data         */ 03120000
*                                                                       03130000
*DCL JQRY_SUBSYS_LEN FIXED(31)                                          03140000
*    CONSTANT(LENGTH(JQRY_SUBSYS_ENTRY));  /* Length of data for one    03150000
*                                      subsystem                     */ 03160000
*DCL JQRY_VT_LEN FIXED(31)                                              03170000
*    CONSTANT(LENGTH(JQRY_VT_ENTRY));  /* Length of data for one        03180000
*                                      vector table                  */ 03190000
