*        %GOTO JFCBPRO;  /*                                             00010000
         MACRO                                                          00020000
         IEFJFCBX                                                       00030000
.*/      %JFCBPRO: ;                                                    00031000
*/**** START OF SPECIFICATIONS ***************************************/ 00032000
*/*                                                                  */ 00032100
*/*01*  MACRO NAME = IEFJFCBX                                    @P1C*/ 00032209
*/*                                                                  */ 00032300
*/*01*   ACRONYM = JFCBX                                         @P1A*/ 00032409
*/*                                                                  */ 00032500
*/*01*  DESCRIPTIVE NAME =  JOB FILE CONTROL BLOCK EXTENSION         */ 00032609
*/*                                                                  */ 00032700
*/*01* PROPRIETARY STATEMENT=                                        */ 00032808
*/***PROPRIETARY_STATEMENT********************************************/ 00032900
*/*                                                                  */ 00033000
*/*                                                                  */ 00034000
*/*     LICENSED MATERIALS - PROPERTY OF IBM                         */ 00035000
*/*     5694-A01 COPYRIGHT IBM CORP. 1973, 2019                      */ 00036003
*/*                                                                  */ 00037000
*/* STATUS= HBB77C0                                                  */ 00038003
*/*                                                                  */ 00039000
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 00040000
*/*                                                                  */ 00041000
*/*  FUNCTION   = This macro maps the Job File Control Block     @P1C*/ 00042000
*/*               Extension.  It is used to record volume        @P1C*/ 00043000
*/*               serial numbers in excess of the five recorded  @P1A*/ 00044000
*/*               in the JFCBVOLS field of the JFCB.             @P1A*/ 00045000
*/*                                                                  */ 00046000
*/*01* EXTERNAL CLASSIFICATION:                                  @P1A*/ 00047000
*/*02*   NOTPI:  BASE                                            @L2C*/ 00048000
*/*02*   PI:  FIELDS                                             @L2C*/ 00049000
*/*                    JFCBXTTR                                  @P2A*/ 00050000
*/*                    JFCBXVOL                                  @P2A*/ 00050100
*/*                    JFCBXNXT                                  @P2A*/ 00050200
*/*                    JFCXVD                                    @01A*/ 00050300
*/*                    JFCXVD1                                   @01A*/ 00050400
*/*                    JFCXVD2                                   @01A*/ 00050500
*/*                    JFCXVD3                                   @01A*/ 00050600
*/*                    JFCXVD4                                   @01A*/ 00050700
*/*                    JFCXVD5                                   @01A*/ 00050800
*/*                    JFCXVD6                                   @01A*/ 00050900
*/*                    JFCXVD7                                   @01A*/ 00051000
*/*                    JFCXVD8                                   @01A*/ 00051100
*/*                    JFCXVD9                                   @01A*/ 00051200
*/*                    JFCXVD10                                  @01A*/ 00051300
*/*                    JFCXVD11                                  @01A*/ 00051400
*/*                    JFCXVD12                                  @01A*/ 00051500
*/*                    JFCXVD13                                  @01A*/ 00051600
*/*                    JFCXVD14                                  @01A*/ 00051700
*/*                    JFCXVD15                                  @01A*/ 00051800
*/*01* END OF EXTERNAL CLASSIFICATION:                           @P1A*/ 00051900
*/*                                                                  */ 00052000
*/*  NOTES =                                                     @P1A*/ 00052100
*/*                                                                  */ 00052200
*/*      Bilingual Mapping Macro (PL/S and BAL)                  @P1A*/ 00052300
*/*                                                                  */ 00052400
*/*      Also pointed to by SIOTJFX field of the SIOT data       @P1A*/ 00052500
*/*      area.                                                   @P1A*/ 00052600
*/*                                                                  */ 00052700
*/*      Field JSCBSWSP of the JSCB pointed to by the jobstep    @P1A*/ 00052800
*/*      TCB indicates which subpool the control block resides.  @P1A*/ 00052900
*/*                                                                  */ 00053000
*/*    DEPENDENCY = CHANGES TO THIS MACRO SHOULD BE REFLECTED    @L1A*/ 00053100
*/*               IN IPCS MODEL IEFMJFCX                         @L1A*/ 00053200
*/*                                                              @P1C*/ 00053300
*/*01* INVOCATION:                                               *****/ 00053410
*/*01*  Method of Access =                                       @P1A*/ 00053509
*/*      BAL  - JFCBX   DSECT                                    @P1C*/ 00053600
*/*                     IEFJFCBX                                 @P1C*/ 00053700
*/*      PL/X - %INCLUDE SYSLIB(IEFJFCBX)                        @R1A*/ 00053805
*/*             DCL JFCBXPTR PTR(31)                             @R1A*/ 00053900
*/*                                                              @L2A*/ 00054000
*/*        If constants are desired, include the following       @L2A*/ 00054100
*/*        statements:                                           @L2A*/ 00054200
*/*                                                              @L2A*/ 00054300
*/*          %DCL JFCBXCNS CHAR EXTERNAL                         @L2A*/ 00054400
*/*          %JFCBXCNS = 'YES'                                   @L2A*/ 00054500
*/*                                                              @L2A*/ 00054600
*/********************************************************************/ 00054700
*/*                                                                  */ 00054800
*/*01* DSECT NAME = JFCBX (defined by invoker)                   @P1A*/ 00054909
*/*                                                                  */ 00055000
*/*01* COMPONENT = Interpreter (SC1B9)                           @P1A*/ 00055109
*/*                                                                  */ 00055200
*/*01* EYE CATCHER = None                                        @P1A*/ 00055309
*/*     OFFSET = N/A                                             @P1A*/ 00055400
*/*     LENGTH = N/A                                             @P1A*/ 00055500
*/*                                                                  */ 00055600
*/*01* CREATED BY =  Interpreter and Dynamic Allocation          @P1A*/ 00055710
*/*01* CREATED BY (IBM use only) =                                   */ 00055900
*/*     Interpreter Modules (IEFVDA, IEFVEA)                         */ 00056000
*/*     Dynamic Allocation Module (IEFDB414)                         */ 00056100
*/*     Allocation Control Block Update service (IEFAB4CE)       @L2A*/ 00056200
*/*                                                                  */ 00056300
*/*01* POINTED TO BY =                                               */ 00056504
*/*   - JFCBEXAD field (SVA) of the JFCB data area               @P2A*/ 00056600
*/*   - JFCBXNXT field (pointer) of the JFCBX data area          @P2A*/ 00056700
*/*   - SWBUFPTR field in IEFZB506 upon return from IEFQMREQ         */ 00056800
*/*      macro (Preferred method of SVA translation)             @P1A*/ 00056900
*/*   - SWBLKPTR field in IEFZB505 upon return from SWAREQ           */ 00057000
*/*      macro                                                   @P1A*/ 00057100
*/*                                                                  */ 00057300
*/*01* DELETED BY = SWA Manager, SWA Subpool Delete (IEFQB551)   @P1A*/ 00057409
*/*                                                                  */ 00057500
*/*01* SERIALIZATION = None for Interpreter, SVC 99 processing   @P1A*/ 00057609
*/*                    for Dynamic Allocation and Unallocation   @P1A*/ 00057700
*/*                                                                  */ 00057800
*/*01* STORAGE ATTRIBUTES =                                      @P1A*/ 00057909
*/*                                                                  */ 00058000
*/*02*   ALLOCATION METHOD = via SWA Manager call (assign)       @P1A*/ 00058109
*/*02*   SUBPOOL           = 236 or 237 (SWA), or 241 (MSTR)     @P1A*/ 00058209
*/*02*   KEY               = 1                                   @P1A*/ 00058309
*/*02*   RESIDENCY         = Above or Below                      @P1A*/ 00058409
*/*02*   SIZE              = 176 decimal                         @P1A*/ 00058509
*/*02*   FREQUENCY         = One or more per DD with more than   @P1A*/ 00058609
*/*                          five volume serial numbers          @P1A*/ 00058700
*/*                          specified.  Each JFCBX holds up to  @P1A*/ 00058800
*/*                          15 volume serial numbers.           @P1A*/ 00058900
*/*                                                                  */ 00059000
*/*01* DISTRIBUTION LIBRARY = AMACLIB                            @P1A*/ 00059109
*/*                                                                  */ 00059200
*/*  CHANGE ACTIVITY   =  R1,L1,P1,P2                            @P2C*/ 00059300
*/*                                                                  */ 00059400
*/*  $R1 = PA20586 JBB2220 851014 PDD7: PA20586                  @R1A*/ 00059500
*/*  $L1 = DDPERF  HBB4420 900406 PDDS: DDLPERFIPCS DD LIMIT         */ 00059600
*/*                                                 PERFORMANCE  @L1A*/ 00059700
*/*  $P1 = PKB3464 HBB4430 920901 PDDZ: SP430 CLEANUP            @P1A*/ 00059800
*/*  $P2 = PIG1422 HBB5510 930715 PDBN: SHOWHDR/PLASMAP update   @P2A*/ 00059900
*/*  $01 = OW25369 HBB4430 970630 PDRR: JFCDQDSP Support Change  @01A*/ 00060000
*/*  $02 = OW27438 HBB4430 970630 PDRR: Reship to supersede      @02A*/ 00060100
*/*                                     PE APAR OW25369          @02A*/ 00060200
*/*  $L2 = SMSR13D HBB7780 100715 PDTA: SMS Dependencies         @L2A*/ 00060300
*/*                                     Add JFCBX function       @L2A*/ 00060400
*/*                                     Feature ME19471          @L2A*/ 00060500
*/*        W184141 HBB77C0 190103 PDOO: SHOWHDR compliance           */ 00060606
*/********************************************************************/ 00060700
*/* A - PROLOGUE                                                 @R1A*/ 00060800
*/* A - ADD DEPENDENCY NOTE FOR IPCS CONTROL BLOCK MODEL         @L1A*/ 00060900
*/* A - ADDED SWAREQ REFERENCE IN PROLOGUE                       @P1A*/ 00061000
*/* C - Corrected prologue and comments for data areas pub       @P2A*/ 00061100
*/* A - Defined JFCXVDx to provide volser dequeue indicators.    @01A*/ 00061200
*/* A - Added JFCBXCNS macro variable processing.                @L2A*/ 00061300
*/*------------------------------------------------------------------*/ 00061400
*/**** END OF SPECIFICATIONS *****************************************/ 00061500
*%GOTO JFCBXBSL;        /*                                              00061600
*                                                                       00061700
JFCBXTTR DS    CL3 -    SVA FOR NEXT EXTENSION BLOCK                    00061800
         DS    CL1 -    RESERVED                                        00061900
JFCBXVOL DS    15CL6 -  MAXIMUM NO. OF 15-SIX BYTE VOL. SER. NUMBERS    00062000
         DS    CL2 -    RESERVED                                        00062100
JFCBXNAM DS    CL44 -   ALIAS NAME FOR DSNAME IN THE JFCB  (MDC002)     00062200
*                                                                YM3584 00063000
JFCBXDEV DS    CL4 -    DEVICE TYPE RETRIEVED FROM CATALOG FOR          00064000
*                       RECATALOG  (MDC003)                      YM3584 00065000
JFCXVD   DS    XL2 -    Volser dequeue indicators (bit placement   @01A 00066000
*                       corresponds to volser placement within     @01A 00067000
*                       JFCBXVOL, i.e., 1-15)                      @01A 00068000
JFCXVD1  EQU   X'8000'  First volser in JFCBXVOL was dequeued      @01A 00069000
JFCXVD2  EQU   X'4000'  Second volser in JFCBXVOL was dequeued     @01A 00070000
JFCXVD3  EQU   X'2000'  Third volser in JFCBXVOL was dequeued      @01A 00080000
JFCXVD4  EQU   X'1000'  Fourth volser in JFCBXVOL was dequeued     @01A 00090000
JFCXVD5  EQU   X'0800'  Fifth volser in JFCBXVOL was dequeued      @01A 00100000
JFCXVD6  EQU   X'0400'  Sixth volser in JFCBXVOL was dequeued      @01A 00101000
JFCXVD7  EQU   X'0200'  Seventh volser in JFCBXVOL was dequeued    @01A 00102000
JFCXVD8  EQU   X'0100'  Eighth volser in JFCBXVOL was dequeued     @01A 00102100
JFCXVD9  EQU   X'0080'  Ninth volser in JFCBXVOL was dequeued      @01A 00102200
JFCXVD10 EQU   X'0040'  Tenth volser in JFCBXVOL was dequeued      @01A 00102300
JFCXVD11 EQU   X'0020'  Eleventh volser in JFCBXVOL was dequeued   @01A 00102400
JFCXVD12 EQU   X'0010'  Twelfth volser in JFCBXVOL was dequeued    @01A 00102500
JFCXVD13 EQU   X'0008'  Thirteenth volser in JFCBXVOL was dequeued @01A 00102600
JFCXVD14 EQU   X'0004'  Fourteenth volser in JFCBXVOL was dequeued @01A 00102700
JFCXVD15 EQU   X'0002'  Fifteenth volser in JFCBXVOL was dequeued  @01A 00102800
*                                                                       00102900
         DS    CL26 -   RESERVED                                   @01C 00103000
JFCBXNXT DS    A -      ADDRESS OF NEXT JFCB EXTENSION           MDC001 00104000
         MEND  , -    */                                                00105000
*%JFCBXBSL : ;                                                          00106000
*                                                                       00107000
* DECLARE                                                               00108000
* 1 JFCBX BASED (JFCBXPTR) BDY(DWORD) ,                                 00109000
*      5 JFCBXTTR CHAR(3),            /* SVA FOR NEXT EXTENSION         00110000
*                                        BLOCK                       */ 00120000
*      5 *    CHAR(1),                /* RESERVED                    */ 00130000
*      5 JFCBXVOL (15) CHAR(6),       /* MAXIMUM NO. OF 15-SIX BYTE     00140000
*                                        VOL. SER. NUMBERS           */ 00150000
*      5 *             CHAR(2),       /* RESERVED                    */ 00160000
*      5 JFCBXNAM      CHAR(44),      /* ALIAS NAME FOR DSNAME IN       00170000
*                                        THE JFCB  (MDC002)   @YM3584*/ 00180000
*      5 JFCBXDEV      CHAR(4),       /* DEVICE TYPE RETRIEVED FROM     00190000
*                                        CATALOG FOR RECATALOG          00200000
*                                        (MDC003)             @YM3584*/ 00210000
*      5 JFCXVD        BIT(16),       /* Volser dequeue indicators      00220000
*                                        (bit placement corresponds     00230000
*                                        to volser placement within     00240000
*                                        JFCBXVOL, i.e., 1-15)   @01A*/ 00250000
*        7 JFCXVD1     BIT(1),        /* First volser dequeued   @01A*/ 00260000
*        7 JFCXVD2     BIT(1),        /* Second volser dequeued  @01A*/ 00270000
*        7 JFCXVD3     BIT(1),        /* Third volser dequeued   @01A*/ 00280000
*        7 JFCXVD4     BIT(1),        /* Fourth volser dequeued  @01A*/ 00290000
*        7 JFCXVD5     BIT(1),        /* Fifth volser dequeued   @01A*/ 00300000
*        7 JFCXVD6     BIT(1),        /* Sixth volser dequeued   @01A*/ 00310000
*        7 JFCXVD7     BIT(1),        /* Seventh volser dequeued @01A*/ 00320000
*        7 JFCXVD8     BIT(1),        /* Eighth volser dequeued  @01A*/ 00330000
*        7 JFCXVD9     BIT(1),        /* Ninth volser dequeued   @01A*/ 00340000
*        7 JFCXVD10    BIT(1),        /* Tenth volser dequeued   @01A*/ 00350000
*        7 JFCXVD11    BIT(1),        /* Eleventh volser dequeued@01A*/ 00360000
*        7 JFCXVD12    BIT(1),        /* Twelfth volser dequeued @01A*/ 00370000
*        7 JFCXVD13    BIT(1),        /* Thirteenth volser dequeued     00380000
*                                                                @01A*/ 00390000
*        7 JFCXVD14    BIT(1),        /* Fourteenth volser dequeued     00400000
*                                                                @01A*/ 00410000
*        7 JFCXVD15    BIT(1),        /* Fifteenth volser dequeued      00420000
*                                                                @01A*/ 00430000
*        7 *           BIT(1),        /* Reserved                @01A*/ 00440000
*      5 *             CHAR(26),      /* RESERVED                @01C*/ 00450000
*      5 JFCBXNXT      PTR(31);       /* ADDRESS OF NEXT JFCB           00460000
*                                        EXTENSION            @MDC001*/ 00470000
*%IF JFCBXCNS='' %THEN                                                  00480000
*    %GOTO JFCBXL1;                                                     00490000
* Dcl JFCBXID CHAR(1) CONSTANT('1D'X);  /*SWA BLOCK ID OF JFCBX  @L2A*/ 00500000
*%JFCBXL1: ;                                                            00510000
