*                                                                       00001000
* %DCL IEFJSEPL_INCLUDED CHAR EXT;                                      00002000
* %DEACTIVATE IEFJSEPL_INCLUDED;                                        00003000
* %IF IEFJSEPL_INCLUDED = '' %THEN                                      00004000
* %DO;                                                                  00005000
*/* Macro made bi-lingual on 14160. CBGEN compile date 12258         */ 00006000
*% /*                                                                   00007000
         MACRO                                                          00008000
         IEFJSEPL &DSECT=YES,&LIST=YES,&TITLE=YES,&JSEPL=YES            00009000
         GBLC  &IEFJSEPL_INCLUDED                                       00010000
         GBLC  &ZCBPRINT                                                00011000
&IEFJSEPL_INCLUDED SETC 'YES'                                           00012000
         AIF   ('&LIST' EQ 'NONE').P0                                   00013000
         AIF   ('&TITLE' EQ 'NO').P5                                    00014000
 TITLE   'IEFJSEPL  - Subsystem event routine parameter list     '      00015000
.P5      ANOP                                                           00016000
**/ IEFJSEPL_1:;                                                        00017000
*/********START OF SPECIFICATIONS*************************************/ 00018000
*/*                                                                  */ 00019000
*/*01* MACRO NAME: IEFJSEPL                                          */ 00020000
*/*                                                                  */ 00021000
*/*01* DESCRIPTIVE NAME = Subsystem event routine parameter list     */ 00022000
*/*                                                                  */ 00023000
*/*02*   ACRONYM = JSEPL                                             */ 00024000
*/*                                                                  */ 00025000
*/*01* PROPRIETARY STATEMENT=                                        */ 00026000
*/***PROPRIETARY_STATEMENT********************************************/ 00027000
*/*                                                                  */ 00028000
*/*                                                                  */ 00029000
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00030000
*/* 5650-ZOS COPYRIGHT IBM CORP. 2015                                */ 00031000
*/*                                                                  */ 00032000
*/* STATUS= HBB77A0                                                  */ 00033000
*/*                                                                  */ 00034000
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 00035000
*/*                                                                  */ 00036000
*/*01* FUNCTION = Defines the subsystem event routine parameter      */ 00037000
*/*            list, enabled using the                               */ 00038000
*/*            IEFSSI REQUEST=OPTIONS,EVENTRTN= service.             */ 00039000
*/*                                                                  */ 00040000
*/*01* EXTERNAL CLASSIFICATION: PI                                   */ 00041000
*/*01* END OF EXTERNAL CLASSIFICATION:                               */ 00042000
*/*                                                                  */ 00043000
*/*01* NOTES = None                                                  */ 00044000
*/*                                                                  */ 00045000
*/*01* INVOCATION =                                                  */ 00046000
*/*02*   ASM:                                                        */ 00047000
*/*        Specify:                                                  */ 00048000
*/*          IEFJSEPL                                                */ 00049000
*/*                                                                  */ 00050000
*/*        A DSECT is produced unless DSECT=NO is specified.         */ 00051000
*/*        To suppress listing, specify LIST=NO.                     */ 00052000
*/*                                                                  */ 00053000
*/*02*   PL/X:                                                       */ 00054000
*/*        Specify:                                                  */ 00055000
*/*          %INCLUDE SYSLIB(IEFJSEPL)                               */ 00056000
*/*        To get:                                                   */ 00057000
*/*          DCL 1 JSEPL BASED,                                      */ 00058000
*/*                                                                  */ 00059000
*/*        Specify:                                                  */ 00060000
*/*          %JSEPL_ATTR = 'YOUR ATTRIBUTES'                         */ 00061000
*/*          %INCLUDE SYSLIB(IEFJSEPL)                               */ 00062000
*/*        To get:                                                   */ 00063000
*/*          DCL 1 JSEPL YOUR ATTRIBUTES,                            */ 00064000
*/*                                                                  */ 00065000
*/*        Specify %IEFJSEPL_LIST = 'NO' before %INCLUDE to          */ 00066000
*/*        suppress listing.                                         */ 00067000
*/*                                                                  */ 00068000
*/*01* DSECT NAME = JSEPL                                            */ 00069000
*/*                                                                  */ 00070000
*/*01* COMPONENT = Subsystem Interface (SC1B6)                       */ 00071000
*/*                                                                  */ 00072000
*/*01* EYE-CATCHER = JSEPL                                           */ 00073000
*/*02*  OFFSET = 0                                                   */ 00074000
*/*02*  LENGTH = 5                                                   */ 00075000
*/*                                                                  */ 00076000
*/*01* CREATED BY = IEFJPACT                                         */ 00077000
*/*                                                                  */ 00078000
*/*01* POINTED TO BY = On entry to the event notification exit       */ 00079000
*/*                 routine, register 1 points to the IEFJSEPL       */ 00080000
*/*                 parameter list.                                  */ 00081000
*/*                                                                  */ 00082000
*/*01* SERIALIZATION = None                                          */ 00083000
*/*                                                                  */ 00084000
*/*01* STORAGE ATTRIBUTES =                                          */ 00085000
*/*                                                                  */ 00086000
*/*02*   SUBPOOL           = Caller-specified                        */ 00087000
*/*02*   KEY               = 0                                       */ 00088000
*/*02*   SIZE              = X'20' bytes                             */ 00089000
*/*                                                                  */ 00090000
*/*01* CHANGE ACTIVITY =                                             */ 00091000
*/*    $L0=SSIDEL   HBB77A0 140120 PDTA:  SSI DELETE support         */ 00092000
*/*                                       Feature ME26721            */ 00093000
*/*                                                                  */ 00094000
*/********END OF SPECIFICATIONS***************************************/ 00095000
*% /*                                                                   00096000
.P0      ANOP                                                           00097000
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 00098000
         AIF   ('&LIST' EQ 'YES').P2                                    00099000
.P1      ANOP                                                           00100000
         PUSH  PRINT                                                    00101000
         PRINT OFF                                                      00102000
.P2      ANOP                                                           00103000
         AIF   ('&JSEPL' EQ 'NO').L0002                                 00104000
         AIF   ('&DSECT' EQ 'YES').L0003                                00105000
         AIF   ('&JSEPL' NE 'YES').L0002                                00106000
.L0003   ANOP                                                           00107000
*                                                                       00108000
*   A - New mapping for subsystem event notification exit               00109000
*       parameter list.                                                 00110000
* ********************************************************************  00111000
*                                                                       00112000
*                                                                       00113000
         AIF   ('&DSECT' EQ 'YES').L0004                                00114000
JSEPL    DS    0F        Subsystem event parameter list                 00115000
         AGO   .L0005                                                   00116000
.L0004   ANOP                                                           00117000
JSEPL    DSECT           Subsystem event parameter list                 00118000
.L0005   ANOP                                                           00119000
JSEEYEC  DS    CL5       Eyecatcher - 'JSEPL'                           00120000
JSEVER   DS    X         Version of the parameter list                  00121000
JSELGTH  DS    H         Length of the parameter list                   00122000
JSEEVENT DS    X         Event type - see JSEEvent_xxx constants below  00123000
         DS    CL3       Reserved for alignment                         00124000
JSESSNAME DS   CL4       Subsystem name                                 00125000
JSESSCVT DS    A         Pointer to SSCVT                               00126000
         DS    CL12      Reserved for future use                        00127000
JSECVER  EQU   1         Current version number                         00128000
JSEVER1  EQU   1         Version 1                                      00129000
JSEEVENT_DELETE EQU 1    Delete event                                   00130000
JSEPL_LEN EQU  *-JSEPL                                                  00131000
.L0002   ANOP                                                           00132000
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 00133000
         AIF   ('&LIST' EQ 'YES').P4                                    00134000
.P3      ANOP                                                           00135000
         POP   PRINT                                                    00136000
.P4      ANOP                                                           00137000
.P_EXIT  ANOP                                                           00138000
         MEND                                                           00139000
**/ IEFJSEPL_2:;                                                        00140000
* %IEFJSEPL_INCLUDED = 'YES';                                           00141000
* %DCL ZCBPRINT CHAR EXT;                                               00142000
* %DEACTIVATE ZCBPRINT;                                                 00143000
* %DCL IEFJSEPL_LIST CHAR EXT;                                          00144000
* %DEACTIVATE IEFJSEPL_LIST;                                            00145000
* %IF IEFJSEPL_LIST ^= 'NO' &                                           00146000
*    ZCBPRINT ^= 'NO' %THEN                                             00147000
*   %GOTO IEFJSEPL_3;                                                   00148000
*   @LIST PUSH NOECHO;                                                  00149000
*   @LIST NOASSEMBLE NOECHO;                                            00150000
*   @LIST OFF C NOECHO;                                                 00151000
* %IEFJSEPL_3:;                                                         00152000
*/* Start of PL/X Source                                             */ 00153000
*/* A - New mapping for subsystem event notification exit            */ 00154000
*/*     parameter list.                                          @L0A*/ 00155000
*/********************************************************************/ 00156000
* %IF JSEPL_ATTR = '' %THEN %JSEPL_ATTR='BASED';                        00157000
* DCL 1 JSEPL JSEPL_ATTR,     /* Subsystem event parameter list      */ 00158000
*       3 JSEEyeC Char(5),    /* Eyecatcher - 'JSEPL'                */ 00159000
*       3 JSEVer FIXED(8),    /* Version of the parameter list       */ 00160000
*       3 JSELgth FIXED(16),  /* Length of the parameter list        */ 00161000
*       3 JSEEvent FIXED(8),  /* Event type - see JSEEvent_xxx          00162000
*                                constants below                     */ 00163000
*       3 * Char(3),          /* Reserved for alignment              */ 00164000
*       3 JSESSName Char(4),  /* Subsystem name                      */ 00165000
*       3 JSESSCVT Ptr(31),   /* Pointer to SSCVT                    */ 00166000
*       3 * Char(12);         /* Reserved for future use             */ 00167000
*                                                                       00168000
* DCL JSECVer FIXED(8) CONSTANT(JSEVer1); /* Current version number  */ 00169000
* DCL JSEVer1 FIXED(8) CONSTANT(1); /* Version 1                     */ 00170000
* Dcl JSEEyeCV Char(5) Constant('JSEPL'); /* Eyecatcher value        */ 00171000
* Dcl JSEEvent_Delete Fixed(8) Constant(1); /* Delete event          */ 00172000
*@LOGIC;                                                                00173000
*#PRAGMA TOOL=CBGEN.                                                    00174000
*#USEORG.                                                               00175000
*#DELETE.JSEEyeCV                                                       00176000
*#EPRAGMA.                                                              00177000
*@ENDLOGIC;                                                             00178000
*/* End of PL/X Source                                               */ 00179000
* %IF IEFJSEPL_LIST ^= 'NO' &                                           00180000
*    ZCBPRINT ^= 'NO' %THEN                                             00181000
*   %GOTO IEFJSEPL_4;                                                   00182000
*   @LIST POP NOECHO;                                                   00183000
* %IEFJSEPL_4:;                                                         00184000
* %END;                                                                 00185000
