*  %GOTO SSCTPRO;                 /*                         @G385P2M   00010000
         MACRO                                               @G385P2M   00020000
         IEFJSCVT ,                                          @G385P2M   00030000
.*/  %SSCTPRO: ;                  /*                         @G385P2M*/ 00040000
*/**** START OF SPECIFICATIONS ***************************************/ 00050000
*/*                                                                  */ 00060000
*/*01* MACRO NAME:  IEFJSCVT                                         */ 00070000
*/*                                                                  */ 00080000
*/*01* DESCRIPTIVE NAME:  Subsystem Communications Vector Table      */ 00090000
*/*                                                                  */ 00100000
*/*02*   ACRONYM:  SSCVT                                             */ 00110000
*/*                                                                  */ 00120000
*/*01* PROPRIETARY STATEMENT=                                        */ 00130000
*/***PROPRIETARY_STATEMENT********************************************/ 00140000
*/*                                                                  */ 00150000
*/*                                                                  */ 00160000
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00170000
*/* 5650-ZOS COPYRIGHT IBM CORP. 1980, 2015                          */ 00180000
*/*                                                                  */ 00190000
*/* STATUS= HBB77A0                                                  */ 00200000
*/*                                                                  */ 00210000
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 00211000
*/*                                                                  */ 00212000
*/*01* FUNCTION:  Maps information defining a subsystem              */ 00213000
*/*                                                                  */ 00214000
*/*01* EXTERNAL CLASSIFICATION:                                  @P1C*/ 00215000
*/*02* NOTPI: BASE                                               @L4C*/ 00216000
*/*02* PI:    FIELDS                                             @L4C*/ 00216100
*/*           SSCTSNAM  SSCTSSID  SSCTLDEL                       @L4A*/ 00216200
*/*01* END OF EXTERNAL CLASSIFICATION:                           @L3A*/ 00216300
*/*                                                                  */ 00216400
*/*01* DSECT NAME:  SSCT                                             */ 00216500
*/*                                                                  */ 00216600
*/*01* COMPONENT:  Subsystem Interface (SC1B6)                       */ 00216700
*/*                                                                  */ 00216800
*/*01* EYE-CATCHER:  SSCT                                            */ 00216900
*/*02*  OFFSET:  0                                                   */ 00217000
*/*02*  LENGTH:  4 bytes                                             */ 00218000
*/*                                                                  */ 00219000
*/*01* STORAGE ATTRIBUTES:                                           */ 00220000
*/*02*  SUBPOOL:  241                                                */ 00221000
*/*02*  KEY:  0                                                      */ 00222000
*/*02*  RESIDENCY:  BELOW                                            */ 00223000
*/*02*  MAIN STORAGE:  No                                            */ 00224000
*/*02*  AUXILIARY STORAGE:  Yes                                      */ 00225000
*/*02*  VIRTUAL STORAGE:  Yes                                        */ 00226000
*/*02*  DATA SPACE:  No                                              */ 00227000
*/*02*  FREQUENCY:  1 per subsystem                                  */ 00228000
*/*                                                                  */ 00229000
*/*01* SIZE:  36 bytes (decimal)                                     */ 00230000
*/*                                                                  */ 00231000
*/*01* CREATED BY:  Subsystem Interface                          @L3C*/ 00232000
*/*                                                                  */ 00232100
*/*01* POINTED TO BY:                                                */ 00232200
*/*    - JESSSCT field of the JESCT data area                        */ 00232300
*/*    - SSCTSCTA field of the SSCVT data area                       */ 00232400
*/*                                                                  */ 00232500
*/*01* SERIALIZATION:  The SSCVT should be accessed only through @L3C*/ 00232600
*/*      the services provided by the IEFSSI macro.              @L3A*/ 00232700
*/*                                                                  */ 00232800
*/****INVOCATION******************************************************/ 00232900
*/*                                                                  */ 00233000
*/*01* METHOD OF ACCESS:                                             */ 00234000
*/*                                                                  */ 00235000
*/*02*   BAL:                                                        */ 00236000
*/*        IEFJSCVT                                                  */ 00237000
*/*                                                                  */ 00238000
*/*02*   PL/X:                                                   @L4C*/ 00239000
*/*        Specify:                                              @L4A*/ 00240000
*/*          %INCLUDE SYSLIB(IEFJSCVT)                           @L4A*/ 00241000
*/*        To get:                                               @L4A*/ 00242000
*/*          DCL 1 SSCT BASED(SSCTPTR),                          @L4A*/ 00243000
*/*                                                              @L4A*/ 00244000
*/*        Specify:                                              @L4A*/ 00244100
*/*          %SSCTATTR = 'YOUR ATTRIBUTES'                       @L4A*/ 00244200
*/*          %INCLUDE SYSLIB(IEFJSCVT)                           @L4A*/ 00244300
*/*        To get:                                               @L4A*/ 00244400
*/*          DCL 1 SSCT YOUR ATTRIBUTES,                         @L4A*/ 00244500
*/*                                                                  */ 00244600
*/********************************************************************/ 00244700
*/*                                                                  */ 00244800
*/*01* DELETED BY:  N/A                                              */ 00244900
*/*                                                                  */ 00245000
*/*01* NOTES:                                                        */ 00246000
*/*                                                                  */ 00247000
*/*    - BILINGUAL MAPPING MACRO (PL/AS AND BAL)                     */ 00248000
*/*                                                                  */ 00249000
*/*02*   DEPENDENCIES:                                               */ 00250000
*/*        - ANY CHANGES TO THIS MACRO SHOULD BE REFLECTED IN        */ 00260000
*/*          THE IPCS MODEL IEFMSSCT.                                */ 00270000
*/*                                                                  */ 00280000
*/*01* RESTRICTIONS:  NONE                                           */ 00290000
*/*                                                                  */ 00300000
*/*01* DISTRIBUTION LIBRARY:  AMACLIB                                */ 00310000
*/*                                                                  */ 00320000
*/*01* CHANGE ACTIVITY:  G29AN2F,G16APPK,G385P2M,L1,OY01974,L2,      */ 00330000
*/*                      D1,L3,P1                                @P1A*/ 00340000
*/*                                                                  */ 00350000
*/* $L1= SSVT    JBB2110 820702 PD2N: SS VECTOR TABLE SUPPORT    @L1A*/ 00360000
*/* $L2= EMVS2   HBB4410 880725 PDZ1: SERVICEABILITY / IPCS      @L2A*/ 00370000
*/* $D1= DH30067 HBB4420 900529 PDCC: Special Internal Reader    @D1A*/ 00380000
*/* $L3= SSIDP   HBB5520 940414 PDBN: Dynamic SSI                @L3A*/ 00390000
*/* $P1= PN70891 HBB5520 940728 PDBN: Dynamic SSI                @P1A*/ 00400000
*/* $L4= SSIDEL  HBB77A0 140515 PDTA: SSI DELETE support         @L4A*/ 00410000
*/*                                   Feature ME27124            @L4A*/ 00420000
*/* $P2= ME27713 HBB77A0 140801 PDTA: SETSSI DELETE              @P2A*/ 00421001
*/*                                                                  */ 00430000
*/**** END OF SPECIFICATIONS *****************************************/ 00440000
*/* C  VS2 SU16 - SU 16 SUPPORTS                             @G16APPK*/ 00450000
*/* C  VPSS SUPPORT (SU 29 - @G29AN2F).                      @G16APPK*/ 00460000
*/* C  SUBSYSTEM DEFINITION FACILITY SUPPORT                 @G385P2M*/ 00470000
*/* C  SSCTRSV2 TO SUBSYSTEM USAGE FIELD, SSCTSUS2               @L1A*/ 00480000
*/* A  ADDED SUBSYSTEM IDENTIFICATION FIELD                  @YA01974*/ 00490000
*/* A  ADDED DEPENDENCY ON IEFMSSCT BEING UPDATED IF THIS        @L2A*/ 00500000
*/*    MACRO IS UPDATED.                                         @L2A*/ 00510000
*/* A Added bit to indicate support of a special internal reader @D1A*/ 00520000
*/* C Changed CDPI classification to DMTI.                       @L3A*/ 00530000
*/* C SHOWHDR format complete.                                   @L3A*/ 00540000
*/* C Changed CDPI classification of SSCTSNAM and SSCTSSID           */ 00550000
*/*   fields back to GUPI.                                       @P1A*/ 00560000
*/* C Add PL/X macro logic, update prolog, add SSCTLDEL.         @L4A*/ 00570000
*/* C Add SSCTSSCX.                                              @P2A*/ 00571001
*/********************************************************************/ 00580000
*  %GOTO SSCTDCL;                 /*                         @G385P2M   00590000
SSCT     DSECT                                                          00600000
SSCTBEGN EQU   *                                                        00610000
SSCTID   DC    CL4'SSCT'          CONTROL BLOCK IDENTIFIER              00620000
SSCTSCTA DS    A                  PTR TO NEXT SSCVT OR ZERO             00630000
SSCTSNAM DS    CL4                SUBSYSTEM NAME                        00640000
SSCTFLG1 DS    B                  FLAGS                                 00650000
SSCTSFOR EQU   X'80'              SERIAL FIB OPERATIONS REQUIRED       *00660000
                                                               @Z40EPSS 00670000
SSCTUPSS EQU   X'40'              USE PRIMARY SUBSYSTEM'S      @G29AN2F 00680000
*                                 SERVICES FOR THIS SUBSYSTEM  @G29AN2F 00690000
*                                 (E.G. SYSOUT)                @G29AN2F 00700000
SSCTARDR EQU   X'20'              Subsystem supports Dynamic       @D1A 00710000
*                                 Allocation of a special internal @D1A 00720000
*                                 reader.                          @D1A 00730000
SSCTLDEL EQU   X'10'              Subsystem is logically deleted.       00731000
*                                 When this flag is set, subsystem      00732000
*                                 is removed from the SSCVT chain  @L4A 00733000
SSCTSSID DS    XL1                SUBSYSTEM IDENTIFIER. SET BY @YA01974 00734000
*                                 SUBSYSTEM FIRST TIME IT IS            00735000
*                                 INVOKED AFTER IPL                     00736000
SSCTUNKN EQU   X'00'              UNKNOWN SUBSYSTEM ID         @YA01974 00737000
SSCTJES2 EQU   X'02'              JES2 SUBSYSTEM ID            @YA01974 00738000
SSCTJES3 EQU   X'03'              JES3 SUBSYSTEM ID            @YA01974 00739000
SSCTRSV1 DS    2X                 RESERVED                     @YC01974 00740000
SSCTSSVT DS    A                  SUBSYSTEM VECTOR TABLE POINTER        00750000
SSCTSUSE DS    F                  RESERVED FOR SUBSYSTEM USAGE          00760000
SSCTSYN  DS    A                  HASH TABLE SYNONYM POINTER   @G385P2M 00770000
SSCTSUS2 DS    F                  RESERVED FOR SUBSYSTEM USAGE     @L1C 00780000
SSCTSCTX DS    F                  Address of SSCX.  Zero if subsystem   00790001
*                                 does not have a SSCX.            @P2A 00791001
SSCTSIZE EQU   *-SSCTBEGN         SSCVT LENGTH                          00800000
         MEND                     */                                    00810000
   %SSCTDCL: ;                    /*                         @G385P2M*/ 00820000
*  %IF SSCTATTR = '' %THEN %SSCTATTR='BASED(SSCTPTR)';        /* @L4A*/ 00830000
*  DCL 1 SSCT SSCTATTR,           /* SSCVT                       @L4C*/ 00840000
*        2     SSCTID   CHAR(4),  /* CONTROL BLOCK ID='SSCT'         */ 00850000
*        2     SSCTSCTA PTR(31),  /* PTR TO NEXT SSCVT OR ZERO       */ 00860000
*        2     SSCTSNAM CHAR(4),  /* SUBSYSTEM NAME                  */ 00870000
*        2     SSCTFLG1 BIT(8),   /* FLAGS                           */ 00880000
*              3 SSCTSFOR BIT(1), /* SERIAL FIB OPERATIONS REQUIRED     00890000
*                                                            @Z40EPSS*/ 00900000
*              3 SSCTUPSS BIT(1), /*USE PRIMARY SUBSYSTEM'S             00910000
*                                   SERVICES FOR THIS SUBSYSTEM         00920000
*                                   (E.G. SYSOUT)            @G29AN2F*/ 00930000
*              3 SSCTARDR BIT(1), /* Subsystem supports Dynamic         00940000
*                                    Allocation of a special            00950000
*                                    internal reader.            @D1A*/ 00960000
*              3 SSCTLDEL BIT(1), /* Subsystem is logically deleted.    00970000
*                                    When this flag is set, subsystem   00980000
*                                    is removed from the SSCVT chain    00990000
*                                                                @L4A*/ 01000000
*              3 *        BIT(4), /* RESERVED                @G29AN2F*/ 01010000
*        2     SSCTSSID BIT(8),   /* SUBSYSTEM IDENTIFIER. SET BY       01020000
*                                    SUBSYSTEM FIRST TIME IT IS         01030000
*                                    INVOKED AFTER IPL.      @YA01974*/ 01040000
*        2     SSCTRSV1 FIXED(15),/* RESERVED                @YC01974*/ 01050000
*        2     SSCTSSVT PTR(31),  /* SUBSYSTEM VECTOR TABLE POINTER  */ 01060000
*        2     SSCTSUSE PTR(31),  /* RESERVED FOR SUBSYSTEM USAGE       01070000
*                                                            @G385P2M*/ 01080000
*        2     SSCTSYN  PTR(31),  /* HASH TABLE SYNONYM POINTER         01090000
*                                                            @G385P2M*/ 01100000
*        2     SSCTSUS2 FIXED(31),/* RESERVED FOR SUBSYSTEM USAGE       01110000
*                                                                @L1C*/ 01120000
*        2     SSCTSCTX PTR(31);  /* Address of SSCX.  Zero if          01130001
*                                    subsystem does not have a SSCX.    01131001
*                                                                @P2C*/ 01132000
*        /* Note: Do not expand the SSCVT.  Any new fields that will    01133002
*           not fit in reserved space should go in the SSCX instead.    01134002
*                                                                @P2A*/ 01135002
*  DCL SSCTUNKN BIT(8) CONSTANT('00'X); /* UNKNOWN SUBSYSTEM @YA01974*/ 01140000
*  DCL SSCTJES2 BIT(8) CONSTANT('02'X); /* JES2 SUBSYSTEM ID @YA01974*/ 01150000
*  DCL SSCTJES3 BIT(8) CONSTANT('03'X); /* JES3 SUBSYSTEM ID @YA01974*/ 01160000
