*        %GOTO SJPUPRO;            /*                                           
         MACRO                                                                  
         IEFSJPUP  &DSECT=YES                                                   
.*/ %SJPUPRO: ;                                                                 
*/****START OF SPECIFICATIONS ****************************************/         
*/*                                                                  */         
*/*01* MACRO NAME = IEFSJPUP                                     @P1C*/         
*/*                                                                  */         
*/*01* DESCRIPTIVE NAME = SJF PUT SWB PARAMETER LIST             @P1C*/         
*/*                                                                  */         
*/*01* Proprietary Statement=                                    @P1C*/         
*/*01* Copyright=                                                @P1A*/         
*/*    LICENSED MATERIALS - PROPERTY OF IBM                          */         
*/*    5650-ZOS COPYRIGHT IBM CORP. 1982, 2021                       */         
*/*                                                                  */         
*/*01* STATUS=HBB77D0                                            @P1C*/         
*/*01* End Of Proprietary Statement=                             @P1C*/         
*/*                                                                  */         
*/*01* FUNCTION = Mapping for the Scheduler JCL Facility         @P1C*/         
*/*               Put SWB Service Parameter List                 @P1C*/         
*/*                                                                  */         
*/*01* EXTERNAL CLASSIFICATION: NOTPI                            @01C*/         
*/*01* END OF EXTERNAL CLASSIFICATION:                           @01C*/         
*/*                                                                  */         
*/*01* METHOD OF ACCESS =                                        @P1C*/         
*/*                                                                  */         
*/*      BAL  - IEFSJPUP DSECT=YES OR NO                             */         
*/*             DSECT=YES IS THE DEFAULT                             */         
*/*             DEFINE A CONSTANT EQUAL TO                           */         
*/*             'SJPU' TO STORE IN SJPUID.                           */         
*/*                                                                  */         
*/*      PL/S - %DCL SJPUATRB CHAR                                   */         
*/*             %SJPUATRB = 'BASED' OR 'BDY(WORD)' OR ''             */         
*/*             %INCLUDE SYSLIB(IEFSJPUP)                            */         
*/*                                                                  */         
*/*02* NOTES =                                                   @P1C*/         
*/*     THE FIRST 16 BYTES (UP TO AND INCLUDING SJPUREAS) ARE        */         
*/*     COMMON MAPPING AREAS FOR ALL SCHEDULER JCL FUNCTIONS.        */         
*/*                                                                  */         
*/*01* DSECT NAME:                                               @P1A*/         
*/*     SJPUP                                                    @P1A*/         
*/*                                                              @P1A*/         
*/*01* COMPONENT:  Scheduler JCL Facility (BB131)                @P1A*/         
*/*                                                              @P1A*/         
*/*01* EYE-CATCHER:  SJPU                                        @P1A*/         
*/*02* OFFSET: 0                                                 @P1A*/         
*/*02* LENGTH: 4                                                 @P1A*/         
*/*                                                              @P1A*/         
*/*01* STORAGE ATTRIBUTES:                                       @P1A*/         
*/*02*  Subpool:  Any                                            @P1A*/         
*/*02*  Key:      Caller's key                                   @P1A*/         
*/*                                                              @P1A*/         
*/*01* SIZE:                                                     @P1A*/         
*/*       56 bytes                                               @P1A*/         
*/*                                                              @P1A*/         
*/*01* CREATED BY:                                               @P1A*/         
*/*      Caller of SJFREQ REQUEST=PUTSWB                         @P1A*/         
*/*                                                              @P1A*/         
*/*01* POINTED TO BY:                                            @P1A*/         
*/*      On entry to SJF, register 1 points to a word that       @P1A*/         
*/*      points to SJPUP                                         @P1A*/         
*/*                                                              @P1A*/         
*/*01* SERIALIZATION:                                            @P1A*/         
*/*      None                                                    @P1A*/         
*/*                                                                  */         
*/* CHANGE ACTIVITY = H0,D1,L1,L2,L3                             @L3C*/         
*/*                                                                  */         
*/* $H0= EXTJCL JBB2110 820702 PDC6: SUPPORT OF EXTENDED JCL         */         
*/* $D1= DCR89  JBB2125 830928 PDJ2: REWORK OF AFP SPE           @D1A*/         
*/* $L1= SWABOVE JBB2220 850805 PDT3: SWA ABOVE THE LINE         @L1A*/         
*/* $L2= EMVS2   HBB4410 881111 PDD1: SERIALIZATION SUPPORT      @L2A*/         
*/* $L3= APPC1   HBB4420 890310 PDB3: SWA RELOCATION SUPPORT     @L3A*/         
*/* $01= OA58657 HBB77B0 200110 PDOO: ABEND054-25 on evict with      */         
*/*                                   EXPORT                     @01A*/         
*/* $P1= W402167 HBB77D0 210205 PDMMK: SHOWHDR Compliance        @P1A*/         
*/*                                                                  */         
*/****END OF SPECIFICATIONS ******************************************/         
*/* A 000000-999999                                              @H0A*/         
*/* A WARNING FLAG INDICATING TO CONTINUE PROCESSING AFTER AN    @D1A*/         
*/*   ERROR WHICH IS DUE TO CHANGES IN THE JDTS FROM RELEASE TO  @D1A*/         
*/*   RELEASE IS ENCOUNTERED                                     @D1A*/         
*/* A UPDATE DESCRIPTION OF TOKEN FIELDS                         @L1A*/         
*/* A ADD NO SERIALIZATION BIT TO BYPASS SERIALIZATION ON SWB    @L2A*/         
*/*   USE COUNT                                                  @L2A*/         
*/* A ADD OPTIONAL SVA TO BE REASSIGNED TO THE SWB               @L3A*/         
*/* A Defined SJPU_Clear_SJCNTLB                                 @01A*/         
*/* A Prolog updates                                             @P1A*/         
*        %GOTO SJPUPLS;  /*                                                     
         AIF ('&DSECT' EQ 'NO').NODSECT                                         
SJPUP    DSECT                                                                  
         AGO  .SJPDSCT                                                          
.NODSECT ANOP                                                                   
SJPUP    DS    0F                                                               
.SJPDSCT ANOP                                                                   
SJPUID   DS    CL4                   IDENTIFIER                                 
SJPUVERS DS    XL1                   VERSION NUMBER                             
SJPUFLAG DS    XL1                   CONTROL FLAGS                              
SJPUNREC EQU   X'80'                 NO RECOVERY                                
SJPUNOCU EQU   X'40'                 NO CLEANUP                                 
SJPULEN  DS    H                     LENGTH OF PARAMETER LIST                   
SJPUSTOR DS    F                     LOCAL STORAGE POINTER                      
SJPUREAS DS    F                     RESULT REASON CODE (RETURNED)              
SJPUTOKN DS    0XL8                                                             
SJPUANBK DS    F                     ADDRESS OF CONTROL BLOCK FOR A             
*                                    JCL STATEMENT (JCT, SCT, SIOT              
*                                    OR SWB) OR THE ADDRESS OF A                
*                                    SWB CHAIN                                  
SJPUANCA DS    F                     ADDRESS OF WORD POINTING TO A              
*                                    SWB CHAIN OR ZERO                          
SJPUSWBA DS    F                     ADDRESS OF AREA CONTAINING KEYWORD         
*                                    DATA                                       
SJPUALEN DS    H                     LENGTH OF AREA CONTAINING KEYWORD          
*                                    DATA                                       
SJPUFLG2 DS    XL1                   FLAGS                                      
SJPUNSWA EQU   X'80'                 SWBS TO BE BUILT IN A NON-SWA              
*                                    SUBPOOL                                    
SJPUWARN EQU   X'40'                 CONTINUE PROCESSING AFTER AN  @D1A         
*                                    ERROR WHICH IS DUE TO CHANGES @D1A         
*                                    IN THE JDTS FROM RELEASE TO   @D1A         
*                                    RELEASE IS ENCOUNTERED        @D1A         
SJPUOSER EQU   X'20'                 SERIALIZATION ON SWB USE COUNT             
*                                    IS NOT REQUIRED               @L2A         
SJPU_Clear_SJCNTLB EQU X'10'         Set by the caller to request               
*                                    that the look-aside table is               
*                                    cleared prior to searching for a           
*                                    matching SWB during SWB write              
*                                    processing.                   @01A         
SJPURSV2 DS    XL1                   RESERVED                                   
SJPUJDVT DS    CL8                   JDVT NAME                                  
SJPUV1ND EQU   *-SJPUP               VERSION 1 - PARMLIST LENGTH   @L3A         
SJPUSVA  DS    XL3                   SVA TO BE REASSIGNED TO THE   @L3A         
*                                    SWB (USED BY SWA RELOCATOR)   @L3A         
SJPURSV3 DS    CL13                  RESERVED                      @L3A         
SJPULGTH EQU   *-SJPUP               LENGTH OF PUT PARAMETER LIST               
**********************************************************************          
*                                                                    *          
* ADDITIONAL DATA NEEDED FOR THE PUT SWB PARAMETER LIST              *          
*                                                                    *          
**********************************************************************          
SJPUCVER EQU   2                     CURRENT VERSION NUMBER        @L3C         
         MEND                                                                   
.*/ %SJPUPLS: ;                                                                 
*DECLARE 1 SJPUP SJPUATRB,                                                      
*          2 SJPUID   CHAR(4),     /* IDENTIFIER                     */         
*          2 SJPUVERS FIXED(8),    /* VERSION NUMBER                 */         
*          2 SJPUFLAG BIT(8),      /* CONTROL FLAGS                  */         
*            3 SJPUNREC BIT(1),    /* NO RECOVERY                    */         
*            3 SJPUNOCU BIT(1),    /* NO CLEANUP                     */         
*            3 *        BIT(6),    /* RESERVED                       */         
*          2 SJPULEN FIXED(15),    /* LENGTH OF PARAMETER LIST       */         
*          2 SJPUSTOR PTR(31),     /* LOCAL STORAGE POINTER          */         
*          2 SJPUREAS FIXED(31),   /* RESULT REASON CODE (RETURNED)  */         
*          2 SJPUTOKN,                                                          
*            3 SJPUANBK PTR(31),   /* ADDRESS OF CONTROL BLOCK FOR A            
*                                     JCL STATEMENT (JCT, SCT, SIOT             
*                                     OR SWB) OR THE ADDRESS OF A               
*                                     SWB CHAIN                      */         
*            3 SJPUANCA PTR(31),   /* ADDRESS OF WORD POINTING TO A             
*                                     A SWB CHAIN OR ZERO            */         
*          2 SJPUSWBA PTR(31),     /* ADDRESS OF AREA CONTAINING                
*                                     KEYWORD DATA                   */         
*          2 SJPUALEN FIXED(16),   /* LENGTH OF AREA CONTAINING                 
*                                     KEYWORD DATA                   */         
*          2 SJPUFLG2 BIT(8),      /* FLAGS                          */         
*            3 SJPUNSWA BIT(1),    /* SWBS TO BE BUILT IN NON-SWA               
*                                     SUBPOOL                        */         
*            3 SJPUWARN BIT(1),    /* CONTINUE PROCESSING AFTER AN              
*                                     ERROR WHICH IS DUE TO CHANGES             
*                                     IN THE JDTS FROM RELEASE TO               
*                                     RELEASE IS ENCOUNTERED     @D1A*/         
*            3 SJPUOSER BIT(1),    /* SERIALIZATION ON SWB USE COUNT            
*                                     IS NOT REQUIRED            @L2A*/         
*            3 SJPU_Clear_SJCNTLB BIT(1), /*  Set by the caller to              
*                                     request that the look-aside               
*                                     table is cleared prior to                 
*                                     searching for a matching SWB              
*                                     during SWB write processing.              
*                                                                @01A*/         
*            3 *        BIT(4),    /* RESERVED                   @01C*/         
*          2 SJPURSV2 BIT(8),      /* RESERVED                       */         
*          2 SJPUJDVT CHAR(8),     /* JDVT NAME                  @L3C*/         
*          2 SJPUV1ND CHAR(0),     /* END OF VERSION 1 PARMLIST  @L3A*/         
*          2 SJPUSVA  CHAR(3),     /* SVA TO BE REASSIGNED TO SWB               
*                                     (USED BY SWA RELOCATOR)    @L3A*/         
*          2 SJPURSV3 CHAR(13);    /* RESERVED                   @L3A*/         
*/********************************************************************/         
*/*                                                                  */         
*/*  ADDITIONAL DATA NEEDED FOR THE PUT SWB PARAMETER LIST           */         
*/*                                                                  */         
*/********************************************************************/         
*DECLARE SJPUCID  CHAR(4) CONSTANT('SJPU'), /* IDENTIFIER            */         
*        SJPUCVER FIXED(8) CONSTANT(2);     /* CURRENT VERSION NUMBER           
*                                                                @L3C*/         
*/***********************END OF IEFSJPUP******************************/         
