*  %GOTO SJRUPRO;                         /*                                    
       MACRO                                                                    
       IEFSJRUP &DSECT=YES                                                      
.*/ %SJRUPRO: ;                                                                 
*/***START OF SPECIFICATIONS******************************************/         
*/*                                                                  */         
*/*01* MACRO NAME = IEFSJRUP                                         */         
*/*                                                                  */         
*/*01* ACRONYM = SJRU                                                */         
*/*                                                                  */         
*/*01* DESCRIPTIVE NAME = Scheduler JCL Facility Update              */         
*/*                       Parameter List                             */         
*/*                                                                  */         
*/*01* PROPRIETARY STATEMENT=                                        */         
*/***PROPRIETARY_STATEMENT********************************************/         
*/*                                                                  */         
*/*                                                                  */         
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */         
*/* 5650-ZOS COPYRIGHT IBM CORP. 1983, 2021                          */         
*/*                                                                  */         
*/* STATUS= HBB77D0                                                  */         
*/*                                                                  */         
*/***END_OF_PROPRIETARY_STATEMENT*************************************/         
*/*                                                                  */         
*/*01* FUNCTION =                                                    */         
*/*      Maps the input to the Scheduler JCL Facility Update         */         
*/*      routine.                                                    */         
*/*                                                                  */         
*/*01* EXTERNAL CLASSIFICATION: NOTPI                                */         
*/*01* END OF EXTERNAL CLASSIFICATION:                               */         
*/*                                                                  */         
*/*01* NOTES =                                                       */         
*/*      Bilingual mapping macro (PL/AS and BAL)                     */         
*/*                                                                  */         
*/*  02* DEPENDENCIES = None                                         */         
*/*                                                                  */         
*/*  02* RESTRICTIONS = None                                         */         
*/*                                                                  */         
*/***INVOCATION*******************************************************/         
*/*                                                                  */         
*/*01* METHOD OF ACCESS =                                            */         
*/*                                                                  */         
*/*  02* PL/AS INVOCATION =                                          */         
*/*                                                                  */         
*/*        %DCL SJRUATRB CHAR                                        */         
*/*        %SJRUATRB = 'BASED' OR 'BDY(WORD)' OR ''                  */         
*/*        %INCLUDE SYSLIB(IEFSJRUP)                                 */         
*/*                                                                  */         
*/*  02* BAL INVOCATION =                                            */         
*/*        IEFSJRUP DSECT=YES or NO                                  */         
*/*        DSECT=YES is the default                                  */         
*/*        Declare a constant equal to 'SJRU' to store in SJRUID     */         
*/*                                                                  */         
*/********************************************************************/         
*/*                                                                  */         
*/*01* DSECT NAME = SJRUP                                            */         
*/*                                                                  */         
*/*01* COMPONENT = Scheduler JCL Facility (BB131)                    */         
*/*                                                                  */         
*/*01* EYE CATCHER = SJRU                                            */         
*/*                                                                  */         
*/*02*  OFFSET = 0                                                   */         
*/*                                                                  */         
*/*02*  LENGTH = 4                                                   */         
*/*                                                                  */         
*/*01* CREATED BY = Caller                                           */         
*/*                                                                  */         
*/*01* POINTED TO BY =                                               */         
*/*     Caller sets up Register 1 pointing to a word which           */         
*/*     points to SJRUP.                                             */         
*/*                                                                  */         
*/*01* DELETED BY = Caller                                           */         
*/*                                                                  */         
*/*01* SERIALIZATION = None                                          */         
*/*                                                                  */         
*/*01* STORAGE ATTRIBUTES =                                          */         
*/*                                                                  */         
*/*  02* SUBPOOL = Caller's                                          */         
*/*                                                                  */         
*/*  02* KEY = Caller's                                              */         
*/*                                                                  */         
*/*01* SIZE = 60 bytes                                               */         
*/*                                                                  */         
*/* CHANGE ACTIVITY = H0,R1,D1,L1,D2,L2,L3,L4,L5                 @L5C*/         
*/*                                                                  */         
*/* $H0= EXTJCL  JBB2110 821015 PD2Q: SUPPORT FOR EXTENDED JCL       */         
*/* $R1= PAB0177 JBB2110 821117 PDD7: SP 1.3.3 REWORK                */         
*/* $D1= DCR89   JBB2125 830928 PDJ2: REWORK OF AFP SPE          @D1A*/         
*/* $L1= SWABOVE JBB2220 850805 PDT3: SWA ABOVE THE LINE         @L1A*/         
*/* $D2= DCR0023 JBB2223 861117 PDT4: DYNAMIC OUTPUT SUPPORT     @D2A*/         
*/* $T0= OY22236 HBB3310 890403 PDY1: ONE USE SUPPORT            @T0A*/         
*/* $L2= EMVS2   HBB4410 881111 PDD1: SERIALIZATION SUPPORT      @L2A*/         
*/* $L3= EMVS2   HBB4410 900604 PDCL: SERIALIZATION SUPPORT      @L3A*/         
*/* $L4= APPC1   HBB4420 890310 PDB3: SWA RELOCATION SUPPORT     @L4A*/         
*/* $L5= POSIX   HBB4430 911028 PDCL: OPEN/MVS Support           @L5A*/         
*/* $01= OW44540 HBB7705 000501 PDOH: BLKSZLIM Support           @01A*/         
*/* $P0= PX01454 HBB7705 010413 PDOH: SHOWHDR Compliance         @P0A*/         
*/* $L6= SWBNATB HBB77D0 210104 PDOO: SWBNext ATB                @L6A*/         
*/*                                                                  */         
*/***END OF SPECIFICATIONS********************************************/         
*/* A 000000-999999                                              @H0A*/         
*/* A SUPPORT FOR PPP8031 REWORKED FROM SP 1.3.3.                @R1A*/         
*/* A SJRUP - ADDED A WARNING FLAG INDICATING TO CONTINUE PROCESSING */         
*/*           AFTER AN ERROR WHICH IS DUE TO CHANGES IN THE JDTS FROM*/         
*/*           RELEASE TO RELEASE IS ENCOUNTERED                  @D1A*/         
*/* A UPDATE DESCRIPTION OF TOKEN FIELDS                         @L1A*/         
*/* A FIELD TO INDICATE A DYNAMIC CALL IS BEING MADE, THIS WILL  @D2A*/         
*/*   RESULT IN A SWB CHAIN THAT HAS THE DYNAMICALLY CREATED BIT @D2A*/         
*/*   ON                                                         @D2A*/         
*/* A DEFINED BIT FOR CREATION OF ONE USE SWB CHAINS             @T0A*/         
*/* A DEFINED BIT FOR REUSE OF LOGICALLY DELETED ONE USE SWB     @T0A*/         
*/*   CHAINS                                                     @T0A*/         
*/* A ADD NO SERIALIZATION BIT TO BYPASS SERIALIZATION ON SWB    @L2A*/         
*/*   USE COUNT                                                  @L2A*/         
*/* D DELETED BIT SJRUREUS                                       @L3A*/         
*/* A ADD OPTIONAL SVA TO BE REASSIGNED TO THE SWB               @L4A*/         
*/* A Added input field SJRUMODT for caller requests input       @L5A*/         
*/*   text units to be modified                                  @L5A*/         
*/* A Added output field SJRUMODI for caller's data was modified @L5A*/         
*/* A Added input field SJRUCONV to indicate that the caller's   @01A*/         
*/*   data should be converted (EBCDIC to hex).                  @01A*/         
*/* C Change the prolog to make SHOWHDR compliant.               @P0A*/         
*/* A Defined SJRU_ATB_SWB.                                      @L6A*/         
*/********************************************************************/         
*  %GOTO SJRUPLS;                 /*                                            
          AIF   ('&DSECT' EQ 'NO').SJRU01                                       
SJRUP     DSECT                                                                 
          AGO  .SJRU02                                                          
.SJRU01   ANOP                                                                  
SJRUP     DS  0F                     SJF UPDATE PARAMETER LIST                  
.SJRU02   ANOP                                                                  
SJRUID    DS  CL4                    IDENTIFIER 'SJRU'                          
SJRUVERS  DS  XL1                    VERSION NUMBER                             
SJRUFLAG  DS  XL1                    CONTROL FLAGS                              
SJRUNREC  EQU X'80'                  NO RECOVERY                                
SJRUNOCU  EQU X'40'                  NO CLEANUP                                 
SJRULEN   DS  H                      LENGTH OF PARAMETER LIST                   
SJRUSTOR  DS  F                      LOCAL STORAGE POINTER OR ZERO              
SJRUREAS  DS  F                      REASON CODE                                
SJRUINPT  DS  F                      POINTER TO THE LIST OF TEXT                
*                                    POINTERS                                   
SJRUJDVT  DS  CL8                    NAME OF JDVT OR ZEROES                     
SJRUVERB  DS  CL8                    VERB                                       
SJRULABL  DS  CL8                    LABEL                                      
SJRUTOKN  DS  0CL8                   SWB CHAIN TOKEN                            
SJRUANBK  DS  CL4                    ADDRESS OF CONTROL BLOCK FOR A             
*                                    JCL STATEMENT (JCT, SCT, SIOT              
*                                    OR SWB) OR THE ADDRESS OF A                
*                                    SWB CHAIN                                  
SJRUANCA  DS  F                      ADDRESS OF A WORD POINTING TO              
*                                    A SWB CHAIN OR ZERO                        
SJRUFUNC  DS  XL1                    FLAG FIELD                                 
SJRUSYST  EQU X'80'                  SYSTEM INPUT                               
SJRUNSWA  EQU X'40'                  REQUEST FOR A NON SWA SWB                  
SJRUVERF  EQU X'20'                  VERIFICATION ONLY                          
SJRUNREF  EQU X'10'                  DO NOT CHECK REFERENCES                    
SJRUCONT  EQU X'08'                  CONTINUATION TEXT UNIT                     
SJRUJRNL  EQU X'04'                  JOURNALING REQUESTED          @R1A         
SJRUWARN  EQU X'02'                  CONTINUE PROCESSING AFTER AN  @D1A         
*                                    ERROR WHICH IS DUE TO         @D1A         
*                                    CHANGES IN JDTS FROM RELEASE  @D1A         
*                                    TO RELEASE IS ENCOUNTERED     @D1A         
SJRUDYNS  EQU X'01'                  DYNAMIC SWB TO BE CREATED.    @D2A         
*                                    THIS BIT INDICATES THAT IF    @D2A         
*                                    SWBS ARE BUILT THEY SHOULD BE @D2A         
*                                    MARKED DYNAMICALLY CREATED    @D2A         
SJRUPARM  DS  XL1                    NUMBER OF PARAMETERS ALREADY               
*                                    PROCESSED IN THE FIRST                     
*                                    TEXT UNIT                                  
SJRUERRK  DS  CL2                    KEY IN ERROR                               
SJRUV1ND  EQU *-SJRUP                END OF VERSION 1 PARMLIST     @L3A         
SJRUFNC2  DS  XL1                    FLAG FIELD                    @T0A         
SJRUOSER  EQU X'80'                  SERIALIZATION ON SWB USE COUNT IS          
*                                    NOT REQUIRED                  @L2A         
SJRUONEU  EQU X'40'                  A ONE USE SWB CHAIN IS TO BE               
*                                    CREATED                       @T0A         
SJRUMODI  EQU X'20'                  Caller requests that text units            
*                                    be updated if parameter validation         
*                                    results in modification of                 
*                                    parameter data                @L5A         
SJRUCONV  EQU X'10'                  Caller requests that text unit             
*                                    value be converted            @01A         
SJRU_ATB_SWB EQU X'08'               Caller requests an above the               
*                                    bar SWB chain                 @L6A         
SJRUMODT  EQU X'01'                  Caller's data was modified as              
*                                    part of parameter validation  @L5A         
*                                    (output)                      @L5A         
*                                                                  @L4D         
SJRUSVA   DS  XL3                    SVA TO BE REASSIGNED TO SWB   @L4A         
*                                    (USED BY SWA RELOCATOR)       @L4C         
SJRUEND   DS  0F                     END OF THE SJF UPDATE                      
*                                    PARAMETER LIST                             
SJRULGTH  EQU SJRUEND-SJRUP          LENGTH OF THE SJF UPDATE                   
*                                    PARAMETER LIST                             
SJRUCVER  EQU 02                     CURRENT VERSION NUMBER        @L2C         
          MEND                                                                  
.*/ %SJRUPLS: ;                                                                 
* DCL 1 SJRUP SJRUATRB,            /* SJF UPDATE PARAMETER LIST      */         
*      2 SJRUID     CHAR(4),       /* IDENTIFIER 'SJRU'              */         
*      2 SJRUVERS   FIXED(8),      /* VERSION NUMBER                 */         
*      2 SJRUFLAG   BIT(8),        /* CONTROL FLAGS                  */         
*       3 SJRUNREC BIT(1),         /* NO RECOVERY                    */         
*       3 SJRUNOCU BIT(1),         /* NO CLEANUP                     */         
*       3 *        BIT(6),         /* RESERVED                       */         
*      2 SJRULEN  FIXED(15),       /* LENGTH OF PARAMETER LIST       */         
*      2 SJRUSTOR PTR(31),         /* LOCAL STORAGE POINTER OR ZERO  */         
*      2 SJRUREAS FIXED(31),       /* REASON CODE                    */         
*      2 SJRUINPT FIXED(31),       /* POINTER TO THE LIST OF TEXT               
*                                     POINTERS                       */         
*      2 SJRUJDVT   CHAR(8),       /* NAME OF JDVT OR ZEROES         */         
*      2 SJRUVERB   CHAR(8),       /* VERB                           */         
*      2 SJRULABL   CHAR(8),       /* LABEL                          */         
*      2 SJRUTOKN,                 /* SWB CHAIN TOKEN                */         
*        3 SJRUANBK CHAR(4),       /* ADDRESS OF CONTROL BLOCK FOR A            
*                                     JCL STATEMENT (JCT, SCT, SIOT             
*                                     OR SWB) OR THE ADDRESS OF A               
*                                     SWB CHAIN                      */         
*        3 SJRUANCA PTR(31),       /* ADDRESS OF A WORD POINTING TO             
*                                     A SWB CHAIN OR ZERO            */         
*      2 SJRUFUNC   BIT(8),        /* FLAG FIELD                     */         
*       3 SJRUSYST  BIT(1),        /* SYSTEM INPUT                   */         
*       3 SJRUNSWA  BIT(1),        /* REQUEST FOR A NON SWA SWB      */         
*       3 SJRUVERF  BIT(1),        /* VERIFICATION ONLY              */         
*       3 SJRUNREF  BIT(1),        /* DO NOT CHECK REFERENCES        */         
*       3 SJRUCONT  BIT(1),        /* CONTINUATION TEXT UNIT         */         
*       3 SJRUJRNL  BIT(1),        /* JOURNALING REQUESTED       @R1A*/         
*       3 SJRUWARN  BIT(1),        /* CONTINUE PROCESSING AFTER AN              
*                                     ERROR WHICH IS DUE TO CHANGES             
*                                     IN THE JDTS FROM RELEASE TO               
*                                     RELEASE IS ENCOUNTERED     @D1A*/         
*       3 SJRUDYNS  BIT(1),        /* DYNAMIC SWB TO BE CREATED.  THIS          
*                                     BIT INDICATES THAT IF SWBS ARE            
*                                     BUILT THEY SHOULD BE MARKED               
*                                     DYNAMICALLY CREATED        @D2A*/         
*      2 SJRUPARM   FIXED(8),      /* NUMBER OF PARAMETERS ALREADY              
*                                     PROCESSED IN THE FIRST                    
*                                     TEXT UNIT                      */         
*      2 SJRUERRK   CHAR(2),       /* KEY IN ERROR                   */         
*      2 SJRUV1ND   CHAR(0),       /* END OF VERSION 1 PARMLIST  @L3A*/         
*      2 SJRUFNC2   BIT(8),        /* FLAG FIELD                 @T0A*/         
*       3 SJRUOSER  BIT(1),        /* SERIALIZATION ON SWB USE COUNT            
*                                     IS NOT REQUIRED            @L2A*/         
*       3 SJRUONEU  BIT(1),        /* A ONE USE SWB CHAIN IS TO BE              
*                                     CREATED                    @T0A*/         
*                                  /*                            @L4D*/         
*       3 SJRUMODI  BIT(1),        /* Caller requests that text units           
*                                     be updated if parameter                   
*                                     validation results in                     
*                                     in modification of parameter              
*                                     data                       @L5A*/         
*       3 SJRUCONV  BIT(1),        /* Caller requests that text unit            
*                                     value be converted         @01A*/         
*       3 SJRU_ATB_SWB BIT(1),     /* Caller requests an above the              
*                                     bar SWB chain              @L6A*/         
*       3 *         BIT(2),        /* Reserved                   @L6C*/         
*       3 SJRUMODT  BIT(1),        /* Caller's data was modified as             
*                                     part of validation (output)@L5A*/         
*      2 SJRUSVA    CHAR(3);       /* SVA TO BE REASSIGNED TO                   
*                                     SWB (FOR SWA RELOCATOR)    @L4A*/         
*  DCL SJRUCID CHAR(4) CONSTANT('SJRU');/* IDENTIFIER                */         
*  DCL SJRUCVER FIXED(8) CONSTANT(2);/* CURRENT VERSION NUMBER   @L2C*/         
