*%GOTO SJERPRO;                      /*                                         
       MACRO                                                                    
       IEFSJERP &DSECT=YES                                                      
.*/%SJERPRO: ;                                                                  
*/* START OF SPECIFICATIONS ******************************************/         
*/*                                                                  */         
*/*01* DESCRIPTIVE NAME: SJF Erase SWB parameter list                */         
*/*                                                                  */         
*/*01* MACRO NAME:  IEFSJERP                                         */         
*/*                                                                  */         
*/*01* PROPRIETARY STATEMENT=                                        */         
*/***PROPRIETARY_STATEMENT********************************************/         
*/*                                                                  */         
*/*                                                                  */         
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */         
*/* 5650-ZOS COPYRIGHT IBM CORP. 1986, 2021                          */         
*/*                                                                  */         
*/* STATUS= HBB77D0                                                  */         
*/*                                                                  */         
*/***END_OF_PROPRIETARY_STATEMENT*************************************/         
*/*                                                                  */         
*/*01* FUNCTION: The parameter list identifies a SWB chain (via      */         
*/*            the token) containing the field to be erased,         */         
*/*            as well as the JDVT/VERB/ KEYWORD/PARAMETER or        */         
*/*            JDVT/VERB/KEY/PARAMETER to be erased.                 */         
*/*                                                                  */         
*/*01* EXTERNAL CLASSIFICATION: NOTPI                                */         
*/*01* END OF EXTERNAL CLASSIFICATION:                               */         
*/*                                                                  */         
*/*01* DSECT NAME:                                                   */         
*/*     SJERP                                                        */         
*/*                                                                  */         
*/*01* METHOD OF ACCESS:                                             */         
*/*02*    BAL:   IEFSJDLP DSECT=YES or NO                            */         
*/*02*           DSECT=YES is the default                            */         
*/*02*    PL/X:  %SJERATRB = ''   or %SJACATRB = 'BASED'             */         
*/*02*           %INCLUDE SYSLIB(IEFSJERP)                           */         
*/*                                                                  */         
*/*01* COMPONENT:  Scheduler JCL Facility (BB131)                    */         
*/*                                                                  */         
*/*01* EYE-CATCHER:  SJER                                            */         
*/*02* OFFSET: 0                                                     */         
*/*02* LENGTH: 4                                                     */         
*/*                                                                  */         
*/*01* STORAGE ATTRIBUTES:                                           */         
*/*02*  Subpool:   Any                                               */         
*/*02*  Key:       Caller's key                                      */         
*/*02*  Residency: Any                                               */         
*/*                                                                  */         
*/*01* SIZE:                                                         */         
*/*      58 bytes                                                    */         
*/*                                                                  */         
*/*01* CREATED BY:                                                   */         
*/*   Caller of SJFREQ REQUEST=ERASE                                 */         
*/*                                                                  */         
*/*01* POINTED TO BY:                                                */         
*/*   On entry to SJF, register 1 points to a word that points       */         
*/*   to SJERP                                                       */         
*/*                                                                  */         
*/*01* SERIALIZATION:                                                */         
*/*   None                                                           */         
*/*                                                                  */         
*/*  Notes:                                                          */         
*/*  The parameter list identifies a SWB chain (via the token)       */         
*/*  containing the field to be erased, as well as the JDVT/VERB/    */         
*/*  KEYWORD/PARAMETER or JDVT/VERB/KEY/PARAMETER to be erased.      */         
*/*                                                                  */         
*/*  Valid request combinations for SJF erase is as follows :    @L1A*/         
*/*                                                                  */         
*/*  . SJERJDVT/SJERVERB/SJERKEYW/SJERPARM/SJERSUBL only valid   @L1A*/         
*/*                                    if there are sublist data @L1A*/         
*/*  . SJERJDVT/SJERVERB/SJERKEYW/SJERPARM/SJERSUB only valid if @L1A*/         
*/*                                       there are sublist data @L1A*/         
*/*  . SJERJDVT/SJERVERB/SJERKEYW/SJERPARM  valid only if there  @L1A*/         
*/*                                         are no sublist data  @L1A*/         
*/*  . SJERJDVT/SJERVERB/SJERKEYW/SJERALL                        @L1A*/         
*/*  . SJERJDVT/SJERVERB/SJERKEY/SJERPARM                        @L1A*/         
*/*  . SJERJDVT/SJERVERB/SJERKEY/SJERALL                         @L1A*/         
*/*                                                                  */         
*/*                                                                  */         
*/* CHANGE ACTIVITY = D0,L1,P1                                   @P1C*/         
*/*                                                                  */         
*/* $D0= DCR55   JBB2223 870923 PDN4: DCR 55                     @D0A*/         
*/* $L1= EMVS2   HBB4410 880811 PDD1: EMVS2 Support              @L1A*/         
*/* $P1= PEO1500 HBB4410 890206 PDZ1: EMVS2 Support              @P1A*/         
*/*      W184141 HBB77C0 190103 PDOO: SHOWHDR compliance            */          
*/* $L2= SWBNATB HBB77D0 210104 PDOO: SWBNext ATB                @L2A*/         
*/*                                                                  */         
*/********************************************************************/         
*/* A 000000-999999                                              @D0A*/         
*/* A Added fields for erase all parameters support              @L1A*/         
*/* C Changed comment line flagging in BAL version so column 72  @P1A*/         
*/*   remained clear.                                            @P1A*/         
*/* D Removed semi-colon from the prologue                       @L2A*/         
*/* END OF SPECIFICATIONS ********************************************/         
*/*                                                                  */         
*   %GOTO SJERPLS;               /*                                             
          AIF   ('&DSECT' EQ 'NO').SJER01                                       
SJERP     DSECT                    ERASE SWB PARAMETER LIST                     
          AGO .SJER02                                                           
.SJER01   ANOP                                                                  
SJERP     DS  0F                   ERASE SWB PARAMETER LIST                     
.SJER02   ANOP                                                                  
SJERID    DS  CL4                  IDENTIFIER 'SJER'                            
SJERVERS  DS  X                    VERSION NUMBER                               
SJERFLAG  DS  X                    CONTROL FLAGS                                
SJERNREC  EQU X'80'                NO RECOVERY                                  
SJERNOCU  EQU X'40'                NO CLEANUP                                   
SJERLEN   DS  H                    LENGTH OF PARAMETER LIST                     
SJERSTOR  DS  A                    LOCAL STORAGE POINTER OR ZERO                
SJERREAS  DS  F                    REASON CODE                                  
SJERTOKN  DS  0CL8                 SWB STRUCTURE TOKEN                          
SJERANBK  DS  A                    ADDRESS OF CONTROL BLOCK FOR A               
*                                  JCL STATEMENT (JCT, SCT, SIOT                
*                                  OR SWB) OR THE ADDRESS OF A                  
*                                  SWB CHAIN                                    
SJERANCA  DS  A                    ADDRESS OF A WORD POINTING TO A              
*                                  SWB CHAIN OR ZERO                            
SJERFUNC  DS  X                    FUNCTION BYTE                                
SJERJOUR  EQU X'80'                JOURNALLING REQUESTED                        
SJERALL   EQU X'40'                Erase all parameters            @P1C         
SJERSUB   EQU X'20'                Erase parameter's sublist data  @P1C         
SJERRSV1  DS  XL3                  RESERVED                                     
SJERJDVT  DS  CL8                  JDVT NAME                                    
SJERVERB  DS  CL8                  VERB                                         
SJERKEYW  DS  CL8                  KEYWORD                                      
SJERPARM  DS  AL2                  PARAMETER NUMBER                             
SJERSUBL  DS  AL2                  SUBLIST ELEMENT NUMBER                       
SJERKEY   DS  AL2                  KEY                                          
*                                                                               
SJERLGTH  EQU *-SJERP              LENGTH OF SJERP                              
*                                                                               
*     ADDITIONAL DATA NEEDED FOR ERASE SWB PARAMETER LIST                       
*                                                                               
SJERCVER  EQU 01                   CURRENT VERSION NUMBER                       
          MEND                                                                  
.*/ %SJERPLS: ;                                                                 
*DECLARE                                                                        
* 1  SJERP SJERATRB,             /* Parameter list                   */         
*   2  SJERID    CHAR(4),        /* Identifier 'SJER'                */         
*   2  SJERVERS  FIXED(8),       /* Version number                   */         
*   2  SJERFLAG  BIT(8),         /* Control flags                    */         
*      3 SJERNREC BIT(1),        /* No recovery                      */         
*      3 SJERNOCU BIT(1),        /* No cleanup                       */         
*      3 *        BIT(6),        /* Reserved                         */         
*   2  SJERLEN   FIXED(15),      /* Length of parameter list         */         
*   2  SJERSTOR  FIXED(31),      /* Local storage pointer            */         
*   2  SJERREAS  FIXED(31),      /* Reason code (returned)           */         
*   2  SJERTOKN,                 /* Token identifying SWB chain      */         
*     3  SJERANBK  PTR(31),      /*                                  */         
*     3  SJERANCA  PTR(31),      /*                                  */         
*   2  SJERFUNC  BIT(8),         /* Function byte                    */         
*     3 SJERJOUR BIT(1),         /* Journalling requested            */         
*     3  SJERALL BIT(1),         /* Erase all subparameters      @L1A*/         
*     3  SJERSUB BIT(1),         /* Erase all sublist data       @L1A*/         
*     3 *        BIT(5),         /* Reserved                     @L1C*/         
*   2  SJERRSV1  CHAR(3),        /* Reserved                         */         
*   2  SJERJDVT  CHAR(8),        /* JDVT name for keyword to erase   */         
*   2  SJERVERB  CHAR(8),        /* Verb of keyword to be erased     */         
*   2  SJERKEYW  CHAR(8),        /* Keyword to be erased             */         
*   2  SJERPARM  FIXED(16),      /* Parameter to be erased           */         
*   2  SJERSUBL  FIXED(16),      /* Sublist element to be erased     */         
*   2  SJERKEY   FIXED(16);      /* Key to be erased                 */         
*/********************************************************************/         
*/*                                                                  */         
*/*  Additional data needed for the Erase parameter list             */         
*/*                                                                  */         
*/********************************************************************/         
*DECLARE SJERCID CHAR(4) CONSTANT('SJER'); /* Parameter list acronym */         
*DECLARE SJERCVER FIXED(8) CONSTANT(1);    /* Parameter list         */         
*                                          /* version                */         
