* %GOTO SSALCMT;           /*                                  @ZA34144 00010000
         MACRO                                                 @ZA34144 00020000
         IEFSSAL                                                        00030000
.*/ %SSALCMT:;             /*                                @ZA34144*/ 00040000
*/**** START OF SPECIFICATIONS ***************************************/ 00050000
*/*                                                              @L6M*/ 00060000
*/*01* MACRO-NAME = IEFSSAL                                      @L6C*/ 00070000
*/*                                                              @L6M*/ 00080000
*/*01*  ACRONYM = SSAL                                           @L6C*/ 00090000
*/*                                                              @L6M*/ 00100000
*/*01* DESCRIPTIVE NAME = Allocation/Unallocation of SYSOUT      @L6C*/ 00110000
*/*                       function                               @L6C*/ 00120000
*/*                                                              @L6M*/ 00130000
*/*01* PROPRIETARY STATEMENT=                                        */ 00140000
*/***PROPRIETARY_STATEMENT********************************************/ 00150000
*/*                                                                  */ 00160000
*/*                                                                  */ 00170000
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00180000
*/* 5694-A01 COPYRIGHT IBM CORP. 1983, 2011                          */ 00200000
*/*                                                                  */ 00210000
*/* STATUS= HBB7780                                                  */ 00220000
*/*                                                                  */ 00230000
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 00240000
*/*                                                              @P1A*/ 00250000
*/*01* DSECT NAME = SSAL  (OPTIONAL)                             @P2C*/ 00260000
*/*                                                              @P1A*/ 00270000
*/*01* COMPONENT = Allocation (SC1B4)                            @L6C*/ 00280000
*/*                                                              @P1A*/ 00290000
*/*01* EYE-CATCHER = None                                        @L6C*/ 00300000
*/*02*  OFFSET = N/A                                             @L6A*/ 00310000
*/*02*  LENGTH = N/A                                             @L6A*/ 00320000
*/*                                                              @P1A*/ 00330000
*/*01* STORAGE ATTRIBUTES =                                      @L6C*/ 00340000
*/*                                                              @L6A*/ 00350000
*/*02*   ALLOCATION METHOD = Dynamic storage of IEFAB4SF         @L6A*/ 00360000
*/*02*   SUBPOOL           = Subpool 230                         @L6A*/ 00370000
*/*02*   KEY               = Scheduler key                       @L6C*/ 00380000
*/*02*   RESIDENCY         = Any                                 @L6C*/ 00390000
*/*02*   SIZE              = LENGTH(SSAL)                        @L6C*/ 00400000
*/*02*   FREQUENCY         = 1 per allocation or unallocation    @L6A*/ 00410000
*/*                          request for a subsystem data set.   @L6A*/ 00420000
*/*                                                              @P1A*/ 00430000
*/*01* CREATED BY = IEFAB4SF                                     @P2C*/ 00440000
*/*                                                              @P1A*/ 00450000
*/*01* POINTED TO BY =                                           @L6C*/ 00460000
*/*     SSOBINDV field of the SSOB control block (SSOBSOBH)      @P1A*/ 00470000
*/*                                                              @P1A*/ 00480000
*/*01* SERIALIZATION = None                                      @L6C*/ 00490000
*/*                                                              @P1A*/ 00500000
*/*01* FUNCTION =                                                @L6C*/ 00510000
*/*                                                              @L6A*/ 00520000
*/*02*  Used by allocation modules to interface with subsystems  @P1A*/ 00530000
*/*     to allocate/unallocate SYSOUT data sets or functions.    @P1A*/ 00540000
*/*                                                              @P1A*/ 00550000
*/*01* INVOCATION ****************************************************/ 00560000
*/*                                                              @L6A*/ 00570000
*/*01* METHOD OF ACCESS:                                         @P1C*/ 00580000
*/*02*  ASM:                                                     @P1A*/ 00590000
*/*           THE MACRO HAS TWO CALLING SEQUENCES:               @P1C*/ 00600000
*/*03*        1) IEFJSSOB (AL,...),CONTIG=YES/NO                 @L6C*/ 00610000
*/*                                                              @L1A*/ 00620000
*/*04*                WHERE THE VALUES WITHIN THE PARENTHESES    @L6C*/ 00630000
*/*                   ARE THE FUNCTION ID'S OF THE INDIVIDUAL    @L1A*/ 00640000
*/*                   SSI EXTENSIONS REQUESTED.  AL IS THE       @L1A*/ 00650000
*/*                   FUNCTION ID FOR THE ALLOCATION OR THE      @L1A*/ 00660000
*/*                   UNALLOCATION OF SYSIN/SYSOUT DATA SETS.    @L1A*/ 00670000
*/*                   ALSO PRODUCED IS THE SSOB HEADER.          @L1A*/ 00680000
*/*                                                              @L1A*/ 00690000
*/*04*                CONTIG=NO  RESULTS IN A DSECT BEING        @L6C*/ 00700000
*/*                   GENERATED BETWEEN THE SSOB HEADER AND THE  @L1A*/ 00710000
*/*                   EXTENSION.                                 @L1A*/ 00720000
*/*                                                              @L1A*/ 00730000
*/*04*                CONTIG=YES  RESULTS IN THE EXTENSION BEING @L6C*/ 00740000
*/*                   CONTIGUOUS WITH THE SSOB HEADER. (THIS IS  @L1A*/ 00750000
*/*                   THE DEFAULT)                               @L1A*/ 00760000
*/*                                                              @L1A*/ 00770000
*/*03*        2) SSAL DSECT   (OPTIONAL)                         @L6C*/ 00780000
*/*04*                IEFSSAL                                    @L6C*/ 00790000
*/*                                                              @L1A*/ 00800000
*/*04*                THIS WILL PRODUCE THE AL EXTENSION.        @L6C*/ 00810000
*/*                                                              @L1A*/ 00820000
*/*04*   NOTES ON THE ASSEMBLER INVOCATION:                      @L6C*/ 00830000
*/*05*    - AN 'ORG SSOBGN' APPEARS AT THE BEGINNING OF IEFSSAL. @L6C*/ 00840000
*/*         IEFJSSOB GENERATES THE DEFINITION OF SSOBGN ONLY     @L1A*/ 00850000
*/*         WHEN AN EXTENSION IS SPECIFIED.  IF IEFJSSOB IS NOT  @L1A*/ 00860000
*/*         INVOKED, THE CALLER MUST DEFINE THIS SYMBOL.         @L1A*/ 00870000
*/*05*    - THE SAME RULE APPLIES FOR 'SSOBHSIZ', A VARIABLE     @L6C*/ 00880000
*/*         USED TO CALCULATE THE SIZE OF THE HEADER PLUS THE    @L1A*/ 00890000
*/*         EXTENSION.                                           @L1A*/ 00900000
*/*                                                              @L1A*/ 00910000
*/*02*  PL/AS:                                                   @P1A*/ 00920000
*/*03*        %DCL SSOBAL CHAR                                   @L6C*/ 00930000
*/*03*        %SSOBAL='VALUE'                                    @L6C*/ 00940000
*/*                                                              @L1A*/ 00950000
*/*04*                WHERE 'VALUE'='BASED' OR                   @L6C*/ 00960000
*/*04*                      'VALUE'='BDY(WORD)'.                 @L6C*/ 00970000
*/*03*                THEN CODE EITHER ONE OF THE FOLLOWING:     @L6C*/ 00980000
*/*04*                     %INCLUDE SYSLIB(IEFJSSOB)             @L6C*/ 00990000
*/*05*                       NOTE: INCLUDING IEFJSSOB WILL ALSO  @L6C*/ 01000000
*/*                          GENERATE THE SSOB HEADER IF A MACRO @L1A*/ 01010000
*/*                          VARIABLE CALLED SSOBSSOB IS SET     @L1A*/ 01020000
*/*                          TO A NON NULL/BLANK VALUE.          @L1A*/ 01030000
*/*04*                     %INCLUDE SYSLIB(IEFSSAL)              @L6C*/ 01040000
*/*                                                              @L1A*/ 01050000
*/********************************************************************/ 01060000
*/*                                                              @L6A*/ 01070000
*/*01* DELETED BY = IEFAB4SF                                     @P2A*/ 01080000
*/*                                                              @P2A*/ 01090000
*/*01* NOTES = The IEFSSAL mapping is also INCLUDED by modules   @02C*/ 01100000
*/*            IEFAB427 and IEFAB4A2 to reference constants,     @02C*/ 01110000
*/*            but is neither created nor deleted there.         @02A*/ 01120000
*/*                                                              @L6A*/ 01130000
*/*01* DEPENDENCIES = None                                       @L6C*/ 01140000
*/*                                                              @P1A*/ 01150000
*/*01* RESTRICTIONS = None                                       @L6A*/ 01160000
*/*                                                              @L6A*/ 01170000
*/*01* DISTRIBUTION LIBRARY = AMACLIB                            @L6C*/ 01180000
*/*                                                              @P1A*/ 01190000
*/*01* EXTERNAL CLASSIFICATION: PI                               @L9A*/ 01191000
*/*01* END OF EXTERNAL CLASSIFICATION:                           @L6A*/ 01210000
*/*                                                                  */ 01220000
*/*01* CHANGE ACTIVITY =                                         @L6C*/ 01230000
*/*      OZ34144,R1,OZ75043,L2,L3,L4,L5,D1,D2,P1,L6,P2           @P2C*/ 01240000
*/*                                                              @P1A*/ 01250000
*/*   The above change activity is no longer being updated.      @P2C*/ 01260000
*/*                                                              @P1A*/ 01270000
*/*   $L1= EXTJCL  JBB2110 821015 PDC5: SUPPORT FOR EXTENDED JCL @L1A*/ 01280000
*/*   $L2= SWABOVE JBB2220 850612 PDN2: SWA ABOVE THE LINE       @L2A*/ 01290000
*/*   $L3= SP313   JBB3313 880301 PDV6: MVS/SP 3.1.3             @L3A*/ 01300000
*/*   $L4= JUP03   JBB3330 870520 PDM9: JES2 SP320 SSI SUPPORT   @L4A*/ 01310000
*/*   $L5= EMVS2   HBB4410 881205 PDEU: ENHANCED SYSOUT SUPPORT  @L5A*/ 01320000
*/*   $D1= DEO0284 HBB4410 891127 PDDU: New text unit support for    */ 01330000
*/*                                     browse token             @D1A*/ 01340000
*/*   $D2= DH30067 HBB4420 900430 PDAZ: Support of multiple      @D2A*/ 01350000
*/*                                     TSO/STC internal readers @D2A*/ 01360000
*/*   $P1= PKB2193 HBB4430 920731 PDG5: 10X Defect Elimination   @P1A*/ 01370000
*/*   $L6= ARM     HBB5520 940215 PDG5: ARM Support              @L6A*/ 01380000
*/*   $P2= PN70820 HBB5520 920728 PDG5: Fix SHOWHDR information  @P2A*/ 01390000
*/*   $L7= BCPOP   HBB6605 970516 PDG5: Support for JES Open     @L7A*/ 01400000
*/*                                     Print Interface          @L7A*/ 01410000
*/*   $01= OA02753 HBB7703 030630 PDFM: Fail allocation of           */ 01420000
*/*                                     uninitialized spool dataset. */ 01430000
*/*                                     In support of OW57577.   @01A*/ 01440000
*/*   $L8= UASSR   HBB7740 060930 PDHV: Unauthorized SSI request @L8A*/ 01441000
*/*   $P3= ME08921 HBB7740 070115 PDHV: User key for JES UASSReq @P3A*/ 01442000
*/*   $L9= SMSR13D HBB7780 091130 PDHV: Support XTIOT/DSAB above     */ 01442100
*/*                                     for subsystem data sets  @L9A*/ 01442200
*/*   $P4= ME10921 HBB7780 100331 PDQV: JES Spool Allocate failure   */ 01443000
*/*                                     needs more info          @P4A*/ 01450000
*/*                                                                  */ 01451000
*/**** END OF SPECIFICATIONS *****************************************/ 01460000
*/********************************************************************/ 01470000
*/********************************************************************/ 01480000
*/* C - Added new JES Spool Allocate failure reason field SSALJSFR.  */ 01480100
*/*     This is set by IEFAB4SF so that it may be passed back via    */ 01480200
*/*     S99Info.                                                 @P4A*/ 01480300
*/* A - Add support for subsystem to pass back an indication of its  */ 01480400
*/*     support for XTIOTs, DSABs above the line and uncaptured      */ 01480500
*/*     (31-bit) UCBs.  The flag will be copied to the DSAB and      */ 01480600
*/*     used by OPEN to ensure that subsystem DDs using the above    */ 01480700
*/*     functions are not opened unless they explicitly support      */ 01480800
*/*     them.                                                    @L9A*/ 01480900
*/* C - Add user's execution key to pass to JES for SSI SSOBALCU     */ 01481300
*/*     request.  Their "browse token" includes a pointer to storage */ 01482000
*/*     that we do not access, so they must verify it themselves and */ 01483000
*/*     they need the execution key of the user's storage to do it.  */ 01484000
*/*                                                              @P3A*/ 01485100
*/* C - Added new SSOBALCU function for 'unauthorized allocate'.     */ 01490000
*/*     This is supported by JES2, to allow unauthorized programs    */ 01490100
*/*     to do subsystem allocation of a spool dataset.  All other    */ 01490200
*/*     parameters for the request are the same as for SSOBALOC. @L8A*/ 01490300
*/* C - Added new SSOBRETN return code SSALUNSP. This will be set by */ 01491000
*/*     JES2 if they determine that an allocation is being attempted */ 01500000
*/*     against an uninitialized spool dataset.                  @01A*/ 01510000
*/* C - Support Dynamic Allocation new text unit key X'0071' -       */ 01520000
*/*     DALRTCTK "return Allocation Sysout Client Token (CTOKEN)"    */ 01530000
*/*     added in support of JES Open Print Interface. Fields added   */ 01540000
*/*     to the SSAL to communicate the request to return the CTOKEN  */ 01550000
*/*     to JES, and receive the returned token back from JES.        */ 01560000
*/*     The contents of the token area will be initialized by        */ 01570000
*/*     Allocation to zeros prior to the SSI call. It will remain    */ 01580000
*/*     zeros if JES did not return the CTOKEN.                  @L7A*/ 01590000
*/* C - Changed DSECT IEFSSAL back to DSECT SSAL as per PN70820.     */ 01600000
*/*     It was changed from SSAL to IEFSSAL incorrectly during ARM   */ 01610000
*/*     5.2.0 development. The classification was also changed       */ 01620000
*/*     from DMTI to PSPI intentionally, and this is correct, since  */ 01630000
*/*     this macro is used as part of a subsystem interface and NOT  */ 01640000
*/*     for diagnosis or tuning. The "created-by" statement has been */ 01650000
*/*     corrected to show only IEFAB4SF as none of the other modules */ 01660000
*/*     shown (IEFAB4A2, IEFAB427) do more than INCLUDE the          */ 01670000
*/*     mapping to reference reason code constants. A "deleted-by"   */ 01680000
*/*     statement was also added to indicate IEFAB4SF also deletes   */ 01690000
*/*     the control block.                                       @P2A*/ 01700000
*/* C - Added a BIT(1) flag field which, when on, will indicate to   */ 01710000
*/*     JES that all jobs submitted via the dynamically-allocated    */ 01720000
*/*     internal reader, must run on the same system they were       */ 01730000
*/*     submitted on, overriding any system affinities.              */ 01740000
*/*     Made prolog SHOWHDR compliant and classified block as        */ 01750000
*/*     PSPI. Changed DISTLIB here, and in CLEAR IDS from            */ 01760000
*/*     AMODGEN to AMACLIB (with SYSLIB of MACLIB), as per           */ 01770000
*/*     distribution library guidelines in effect for this           */ 01780000
*/*     release.                                                 @L6A*/ 01790000
*/* C - Added a FIXED(32) field for the data set concatenation       */ 01800000
*/*     number. Updated prolog to SHOWHDR format.                @P1A*/ 01810000
*/* C - Added a pointer to the internal reader name and an indicator */ 01820000
*/*     that the caller is authorized                            @D2A*/ 01830000
*/* C - Added pointer to the first length field in the browse        */ 01840000
*/*     token.                                                   @D1A*/ 01850000
*/* C - Added one flag bit, SSALBROW, in SSALFLG2 to indicate that   */ 01860000
*/*     user has supplied a browse token.                        @D1A*/ 01870000
*/* C - ADDED JOB STATUS INDICATORS (SSALJBAB,SSALJFAL,SSALJECC) TO  */ 01880000
*/*     SSALFLG2, THAT ARE NEEDED FOR DISPOSITION PROCESSING OF      */ 01890000
*/*     SYSOUT DATA SETS.                                        @L5A*/ 01900000
*/* C - CHANGED THE RESERVED BYTE TO SSALFLG2 AND ADDED SSALWTRN     */ 01910000
*/*     FLAG TO INDICATE THE PASSED PGM NAME IS A WRITER NAME    @L4A*/ 01920000
*/* C - ADDED FIELD SSALTDSN WHICH POINTS TO A EIGHT BYTE FIELD  @L3A*/ 01930000
*/*     CONTAINING THE TEMPORARY DATA SET NAME FOR SYSIN/SYSOUT  @L3A*/ 01940000
*/* C - ADDED THE RETURN CODE SSALRESV                           @L3A*/ 01950000
*/* C - CHANGED THE COPYRIGHT                                    @L3A*/ 01960000
*/* C - ADDED FIELD SSALJFCE WHICH POINTS TO A JFCBE             @L2A*/ 01970000
*/* C - ADDED FIELD SSALTKNP WHICH POINTS TO A SJF TOKEN     @ZA75043*/ 01980000
*/*     THAT IS USED TO ASSOCIATE A SWB WITH AN OUTPUT       @ZA75043*/ 01990000
*/*     DATASET ON ALLOCATION.                               @ZA75043*/ 02000000
*/* C - SIOT FIELD SIOTBYT5 CONTAINS FLAGS TO INDICATE DEFAULT BITS  */ 02010000
*/*     FOR COPIES AND SYSOUT.                                   @L1A*/ 02020000
*/* C - SPLITOUT FROM IEFJSSOB                               @ZA34144*/ 02030000
*/*------------------------------------------------------------------*/ 02040000
* %GOTO SSALPLS;              /*                               @ZA34144 02050000
*                                                                       02060000
SSOBALOC EQU   6                  ALLOCATION FUNCTION ID (SSOBFUNC)     02070000
SSOBUNAL EQU   7                  UNALLOCATION FUNCTION ID (SSOBFUNC)   02080000
SSOBALCU EQU   81                 ALLOCATION FUNCTION ID (SSOBFUNC)     02081000
*                                 BY UNAUTHORIZED PROGRAM       @L8A    02090000
*                                                                       02091000
*  ALLOCATION/UNALLOCATION RETURN CODES (SSOBRETN)                      02100000
*                                                                       02110000
SSALRTOK EQU   0                  ALLOCATION/UNALLOCATION SUCCESSFUL    02120000
SSALWTFL EQU   4                  ALLOCATION WAIT FAILED        YM04976 02130000
SSALCREQ EQU   8                  CANCEL REQUESTED                      02140000
SSALIDST EQU   12                 INVALID DESTINATION                   02150000
SSALNAUT EQU   16                 USER UNAUTHORIZED TO ALLOCATE         02160000
*                                 THIS DATA SET                         02170000
SSALUNAL EQU   20                 UNABLE TO ALLOCATE            YM04976 02180000
SSALRESV EQU   24                 SYSIN/SYSOUT TEMPORARY DATA SET       02190000
*                                 NAME IS A RESERVED NAME          @L3A 02200000
SSALNCTK EQU   28                 Requested Allocation Sysout Client    02210000
*                                 Token (CTOKEN) not returned by        02220000
*                                 JES                              @L7A 02230000
SSALUNSP EQU   32                 Unable to allocate uninitialized      02240000
*                                 spool dataset (JES2)             @01A 02250000
*                                                                       02260000
         ORG   SSOBGN                                                   02270000
SSALBGN  EQU   *                                                        02280000
SSALLEN  DC    AL2(SSALSIZE)      ALLOC/UNALLOC EXTENSION LENGTH        02290000
SSALFLG1 DS    B                  ALLOCATION/UNALLOCATION FLAGS         02300000
SSALDELT EQU   X'80'              DELETE AT UNALLOCATION                02310000
SSALHOLD EQU   X'40'              HOLD AT UNALLOCATION                  02320000
SSALNHLD EQU   X'20'              NOHOLD OPTION SPECIFIED      @ZA08725 02330000
SSALWAIT EQU   X'10'              WAIT FOR ALLOCATION                   02340000
SSALTRKM EQU   X'08'              ASSIGN A SEPARATE TRACK GROUP MAP     02350000
SSALSPIN EQU   X'04'              SPIN OFF DATA SET                     02360000
SSALASNM EQU   X'02'              DATA SET REQUIRES A DATA SET NAME     02370000
SSALKEEP EQU   X'01'              SUBSYSTEM SHOULD KEEP THE DS @ZA06466 02380000
*                                                                       02390000
SSALFLG2 DS    B                  FLAG BYTE                        @L4A 02400000
SSALWTRN EQU   X'80'              PASSED PGM NAME IS A WRITER NAME @L4A 02410000
SSALJBAB EQU   X'40'              JOB ABENDED                      @L5A 02420000
SSALJFAL EQU   X'20'              JOB ENDED DUE TO ALLOCATION ERR  @L5A 02430000
SSALJECC EQU   X'10'              JOB ENDED DUE TO JOB COND CODES  @L5A 02440000
SSALBROW EQU   X'08'              Browse token supplied            @D1A 02450000
SSALAUTH EQU   X'04'              Caller is authorized             @D2A 02460000
SSALOVAF EQU   X'02'              Override system affinity for job @L6A 02470000
*                                  submitted via dynamically-allocated  02480000
*                                  internal reader                 @L6A 02490000
*-rsvd-* EQU   X'01'              Reserved - available             @L6A 02500000
*                                                                       02510000
*  FOLLOWING FIELDS CONTAIN POINTERS TO THE INDICATED DATA -            02520000
*    (NUMBERS IN PARENTHESES INDICATE LENGTH OF AREA POINTED TO)        02530000
*  OR ELSE THE ACTUAL DATA ITSELF.                                 @P1A 02540000
*                                                                       02550000
SSALDDNM DS    A                  DDNAME (8)                            02560000
SSALDEST DS    A                  REMOTE DESTINATION ID OR BLANK (8)    02570000
SSALDISP DS    A                  DATA SET DISPOSITION (1)              02580000
SSALDUMY DS    A                  DUMMY/SYSIN FLAGS (1)                 02590000
SSALSOUT DS    A                  SYSOUT FLAGS (1)                      02600000
SSALUNIT DS    A                  UNIT TYPE (8)                         02610000
SSALPGMN DS    A                  USER WRITER PROGRAM NAME (8)          02620000
SSALFORM DS    A                  FORMS NUMBER (4)                      02630000
SSALCLAS DS    A                  CLASS (1)                             02640000
SSALADSP DS    A                  ALTERNATE DISPOSITION FLAGS (1)       02650000
SSALCOPY DS    A                  NUMBER OF COPIES TO BE PRINTED (1)    02660000
SSALSSNM DS    A                  SUBSYSTEM NAME (4)                    02670000
SSALJFCB DS    A                  JFCB (176)                            02680000
SSALSSCM DS    A                  SUBSYSTEM INFORMATION (LENGTH IS      02690000
*                                 DEPENDENT ON SUBSYSTEM)               02700000
SSALCNCL DS    A                  CANCEL ECB (ALLOCATION) (4)           02710000
SSALSDEF DS    A                  COPIES/SYSOUT DEFAULT FLAGS (1)  @L1A 02720000
SSALTKNP DS    A                  SJF TOKEN (8)                @ZA75043 02730000
SSALJFCE DS    A                  VIRTUAL ADDRESS OF JFCBE (176)   @L2A 02740000
SSALTDSN DS    A                  SYSIN/SYSOUT TEMPORARY DATA           02750000
*                                 SET NAME (8)                     @L3A 02760000
SSALBTKN DS    A                  Pointer to the first length      @D1A 02770000
*                                 field of a browse token          @D1A 02780000
SSALRDRN DS    A                  Pointer to the program name      @D2A 02790000
*                                                                       02800000
SSALCCNO DS    FL4                Data set concatenation number    @P1A 02810000
*                                                                  @L7A 02820000
*  Additional FLAG fields                                          @L7A 02830000
*                                                                  @L7A 02840000
SSALFLG3 DS    B                  FLAG BYTE #3                     @L7A 02850000
SSALRCTK EQU   X'80'              Ask JES to return the Allocation @L7A 02860000
*                                 Sysout Client Token associated   @L7A 02870000
*                                 with a SYSOUT allocation request @L7A 02880000
SSALXTIO EQU   X'40'              Subsystem supports XTIOT,        @L9A 02881000
*                                 uncaptured UCBs, and DSABs above @L9A 02882000
*                                 above the line. (Set by          @L9A 02883000
*                                 subsystem, used during OPEN.)    @L9A 02884000
*-rsvd-* EQU   X'20'              Reserved - available             @L7A 02900000
*-rsvd-* EQU   X'10'              Reserved - available             @L7A 02910000
*-rsvd-* EQU   X'08'              Reserved - available             @L7A 02920000
*-rsvd-* EQU   X'04'              Reserved - available             @L7A 02930000
*-rsvd-* EQU   X'02'              Reserved - available             @L7A 02940000
*-rsvd-* EQU   X'01'              Reserved - available             @L7A 02950000
SSALEXKY DS    B                  Execution key of Dynamic Allocation   02951000
*                                 user, set only for JES unauthorized   02953000
*                                 SUB= requests (SSOBALCU).  The key is 02954000
*                                 in the high order nibble.        @P3A 02955000
SSALJSFR DS   2B                  JES Spool Allocate failure reason     02960000
*                                 NOTE: This field is only supported    02961000
*                                 for Allocation requests.         @P4A 02962000
*                                                                  @L7A 02970000
*  Following fields contain additional pointers to the indicated   @L7A 02980000
*  area -                                                          @L7A 02990000
*    (Numbers in parentheses indicate length of area pointed to)   @L7A 03000000
*  or else the actual data itself.                                 @L7A 03010000
*                                                                  @L7A 03020000
SSALCTOK DS    A                  Ptr to CTOKEN area (80)          @L7A 03030000
         DS   4F                  Reserved 4 words - available     @L7A 03040000
*                                                                       03050000
SSALSIZE EQU   *-SSALBGN          ALLOC/UNALLOC EXTENSION LENGTH        03060000
SSOBLEN4 EQU   SSOBHSIZ+SSALSIZE  TOTAL SSOB LENGTH                     03070000
         MEND                                                @ZA34144*/ 03080000
* %SSALPLS:;                              /*                 @ZA34144*/ 03090000
*   /*    ALLOCATION/UNALLOCATION FUNCTION IDS (SSOBFUNC)            */ 03100000
*   DCL SSOBALOC  FIXED(15) CONSTANT(06); /* ALLOCATION FUNCTION ID  */ 03110000
*   DCL SSOBUNAL  FIXED(15) CONSTANT(07); /* UNALLOCATION FUNCTION ID*/ 03120000
*   DCL SSOBALCU  FIXED(15) CONSTANT(81); /* ALLOCATION BY              03121000
*                                            UNAUTHORIZED PROGRAM       03122000
*                                            FUNCTION ID         @L8A*/ 03123000
*   /*                                                               */ 03130000
*   /*  ALLOCATION/UNALLOCATION RETURN CODES (SSOBRETN)              */ 03140000
*   /*                                                               */ 03150000
*   DCL SSALRTOK  FIXED(31) CONSTANT(0); /* ALLOC/UNALLOC SUCCESSFUL */ 03160000
*   DCL SSALWTFL  FIXED(31) CONSTANT(4); /* ALLOCATION WAIT FAILED      03170000
*                                                             YM04976*/ 03180000
*   DCL SSALCREQ  FIXED(31) CONSTANT(8); /* CANCEL REQUESTED         */ 03190000
*   DCL SSALIDST  FIXED(31) CONSTANT(12);/* INVALID DESTINATION      */ 03200000
*   DCL SSALNAUT  FIXED(31) CONSTANT(16);/* USER UNAUTHORIZED TO        03210000
*                                           ALLOCATE THIS DATA SET   */ 03220000
*   DCL SSALUNAL  FIXED(31) CONSTANT(20);/* UNABLE TO ALLOCATE          03230000
*                                                             YM04976*/ 03240000
*   DCL SSALRESV  FIXED(31) CONSTANT(24);/* SYSIN/SYSOUT TEMPORARY      03250000
*                                           DATA SET NAME IS A          03260000
*                                           RESERVED NAME        @L3A*/ 03270000
*   DCL SSALNCTK  FIXED(31) CONSTANT(28);/* Requested Allocation Sysout 03280000
*                                           Client Token (CTOKEN) not   03290000
*                                           returned by JES (usually    03300000
*                                           due to a downlevel version  03310000
*                                           of JES)              @L7A*/ 03320000
*   DCL SSALUNSP  FIXED(31) CONSTANT(32);/* Unable to allocate unini-   03330000
*                                           tialized spool dataset      03340000
*                                           (JES2)               @01A*/ 03350000
*   /*   S S A L                                                     */ 03360000
*  DECLARE                                                              03370000
*   1       SSAL          SSOBAL,                                       03380000
*     2       SSALLEN     FIXED(15),/* LENGTH OF SSAL                */ 03390000
*     2       SSALFLG1    BIT(8),   /* ALLOCATION/UNALLOCATION FLAGS */ 03400000
*       3       SSALDELT  BIT(1),   /* DELETE AT UNALLOCATION        */ 03410000
*       3       SSALHOLD  BIT(1),   /* HOLD AT UNALLOCATION          */ 03420000
*       3       SSALNHLD  BIT(1),   /* NOHOLD OPTION OV'RIDE @ZA08725*/ 03430000
*       3       SSALWAIT  BIT(1),   /* WAIT                          */ 03440000
*       3       SSALTRKM  BIT(1),   /* ASSIGN A SEPARATE TRACK GROUP */ 03450000
*       3       SSALSPIN  BIT(1),   /* SPIN OFF DATA SET             */ 03460000
*       3       SSALASNM  BIT(1),   /* DATA SET REQUIRES DS NAME     */ 03470000
*       3       SSALKEEP  BIT(1),   /* THE SUBSYSTEM SHOULD KEEP THIS   03480000
*                                      DATASET EVEN IF EMPTY @ZA06466*/ 03490000
*     2       SSALFLG2    BIT(8),   /* FLAG BYTE                 @L4C*/ 03500000
*       3       SSALWTRN  BIT(1),   /* THE PASSED PROGRAM NAME IS A     03510000
*                                      WRITER NAME               @L4A*/ 03520000
*       3       SSALJBAB  BIT(1),   /* JOB/STEP ABENDED          @L5A*/ 03530000
*       3       SSALJFAL  BIT(1),   /* JOB ENDED DUE TO ERROR IN        03540000
*                                       ALLOCATION               @L5A*/ 03550000
*       3       SSALJECC  BIT(1),   /* JOB ENDED DUE TO JOB CONDITION   03560000
*                                       CODES                    @L5A*/ 03570000
*       3       SSALBROW  BIT(1),   /* Browse token supplied     @D1A*/ 03580000
*       3       SSALAUTH  BIT(1),   /* Caller is authorized      @D2A*/ 03590000
*       3       SSALOVAF  BIT(1),   /* Override system affinity         03600000
*                                      for job submitted via            03610000
*                                      dynamically-allocated            03620000
*                                      internal reader           @L6A*/ 03630000
*       3       *         BIT(1),   /* Reserved - available      @L6A*/ 03640000
*     /*                                                             */ 03650000
*     /*  FOLLOWING FIELDS CONTAIN POINTERS TO THE INDICATED DATA -  */ 03660000
*     /*    (NUMBERS IN PARENTHESES INDICATE LENGTH OF AREA          */ 03670000
*     /*     POINTED TO) OR ELSE THE ACTUAL DATA ITSELF.             */ 03680000
*     /*                                                             */ 03690000
*     2       SSALDDNM    PTR(31),  /* DDNAME (8)                    */ 03700000
*     2       SSALDEST    PTR(31),  /* REMOTE DEST ID OR BLANK (8)   */ 03710000
*     2       SSALDISP    PTR(31),  /* DATA SET DISPOSITION (1)      */ 03720000
*     2       SSALDUMY    PTR(31),  /* DUMMY/SYSIN FLAGS (1)         */ 03730000
*     2       SSALSOUT    PTR(31),  /* SYSOUT FLAGS (1)              */ 03740000
*     2       SSALUNIT    PTR(31),  /* UNIT TYPE (8)                 */ 03750000
*     2       SSALPGMN    PTR(31),  /* USER WRITER PROGRAM NAME (8)  */ 03760000
*     2       SSALFORM    PTR(31),  /* FORMS NUMBER (4)              */ 03770000
*     2       SSALCLAS    PTR(31),  /* CLASS (1)                     */ 03780000
*     2       SSALADSP    PTR(31),  /* ALTERNATE DISPOSITION FLAGS(1)*/ 03790000
*     2       SSALCOPY    PTR(31),  /* NUMBER OF COPIES TO BE           03800000
*                                      PRINTED (1)                   */ 03810000
*     2       SSALSSNM    PTR(31),  /* SUBSYSTEM NAME (4)            */ 03820000
*     2       SSALJFCB    PTR(31),  /* JFCB (176)                    */ 03830000
*     2       SSALSSCM    PTR(31),  /* SUBSYSTEM INFORMATION (LENGTH    03840000
*                                      IS DEPENDENT ON SUBSYSTEM)    */ 03850000
*     2       SSALCNCL    PTR(31),  /* CANCEL ECB (ALLOCATION) (4)   */ 03860000
*     2       SSALSDEF    PTR(31),  /* COPIES/SYSOUT DEFAULT FLAGS (1)  03870000
*                                                                @L1A*/ 03880000
*     2       SSALTKNP    PTR(31),  /* SJF TOKEN (8)             @L2C*/ 03890000
*     2       SSALJFCE    PTR(31),  /* VIRT ADDR OF JFCBE (176)  @L2A*/ 03900000
*     2       SSALTDSN    PTR(31),  /* ADDRESS OF TEMPORARY             03910000
*                                      DATA SET NAME FOR SYSIN/         03920000
*                                      SYSOUT ALLOCATIONS (8)    @L3A*/ 03930000
*     2       SSALBTKN    PTR(31),  /* Pointer to the first length      03940000
*                                      field of a browse token   @D1A*/ 03950000
*     2       SSALRDRN    PTR(31),  /* Pointer to the program name      03960000
*                                                                @D2A*/ 03970000
*     2       SSALCCNO    FIXED(32),/* Concatenation number of current  03980000
*                                      SYSIN/SYSOUT data set     @L7C*/ 03990000
*     /*                                                         @L7A*/ 04000000
*     /* Additional Flag Byte fields                             @L7A*/ 04010000
*     /*                                                         @L7A*/ 04020000
*     2       SSALFLG3    BIT(8),   /* FLAG BYTE #3              @L7A*/ 04030000
*       3       SSALRCTK  BIT(1),   /* Ask JES to return the            04040000
*                                      Allocation Sysout Client         04050000
*                                      Token (CTOKEN) associated        04060000
*                                      with a SYSOUT allocation         04070000
*                                      request                   @L7A*/ 04080000
*       3       SSALXTIO  BIT(1),   /* Subsystem supports XTIOT,        04081000
*                                      uncaptured UCBs, and DSABs       04082000
*                                      above the line. (Set by          04083000
*                                      subsystem, used during OPEN.)    04084000
*                                                                @L9A*/ 04085000
*       3       *         BIT(6),   /* Reserved - available      @L9C*/ 04086000
*     2       SSALEXKY    CHAR(1),  /* Execution key of Dynamic         04100000
*                                      Allocation user, set only for    04100100
*                                      JES unauthorized SUB= requests   04100300
*                                      (SSOBALCU).  The key is in the   04100400
*                                      high order nibble.        @P3A*/ 04100500
*     2       SSALJSFR    CHAR(2),  /* JES Spool Allocate failure       04101000
*                                      reason.                          04102000
*                                      NOTE: This field is only         04103000
*                                      supported for Allocation         04104000
*                                      requests.                 @P4A*/ 04105000
*     /*                                                         @L7A*/ 04110000
*     /*  Following fields contain additional pointers to the    @L7A*/ 04120000
*     /*  indicated data -                                       @L7A*/ 04130000
*     /*    (Numbers in parenthesis indicate length of area      @L7A*/ 04140000
*     /*     pointed to) or else the actual data itself.         @L7A*/ 04150000
*     /*                                                         @L7A*/ 04160000
*     2       SSALCTOK    PTR(31),  /* Ptr to CTOKEN area (80)   @L7A*/ 04170000
*     2       *           PTR(31),  /* Reserved - available      @L7A*/ 04180000
*     2       *           PTR(31),  /* Reserved - available      @L7A*/ 04190000
*     2       *           PTR(31),  /* Reserved - available      @L7A*/ 04200000
*     2       *           PTR(31),  /* Reserved - available      @L7A*/ 04210000
*     /*        -- End pointer fields --                         @L7A*/ 04220000
*     2       SSALEND     CHAR(0) BDY(WORD); /* End of IEFSSAL   @L7A*/ 04230000
