*        %GOTO ZB505PRO; /*                                                     
         MACRO                                                                  
         IEFZB505 &LOCEPAX=NO                                    @R1C           
.*/      %ZB505PRO: ;    /*                                      @L1A*/         
*/************* START OF SPECIFICATIONS ******************************/         
*/*                                                              @L1A*/         
*/*01* MACRO NAME = IEFZB505                                     @L2C*/         
*/*                                                              @L1A*/         
*/*01* DESCRIPTIVE NAME = EPA MAPPING FOR LOCATE MODE SWA        @L1A*/         
*/*                       MANAGER                                @L1A*/         
*/*                                                              @L1A*/         
*/*01* PROPRIETARY STATEMENT=                                    @L2A*/         
*/*01* COPYRIGHT=                                                @L1A*/         
*/*             LICENSED MATERIALS - PROPERTY OF IBM             @L1A*/         
*/*             COPYRIGHT IBM CORPORATION 1986, 2021             @L2C*/         
*/*             5650-ZOS                                         @L1A*/         
*/*                                                              @L2C*/         
*/*01* STATUS = HBB77D0                                          @L2C*/         
*/*01* END OF PROPRIETARY STATEMENT=                             @L2A*/         
*/*                                                              @L1A*/         
*/*01* FUNCTION = PROVIDES EPA MAPPING FOR LOCATE MODE SWA       @L1A*/         
*/*               MANAGER                                        @L1A*/         
*/*                                                              @L1A*/         
*/*01* METHOD OF ACCESS =                                        @L2C*/         
*/*                                                              @L1A*/         
*/*      BAL - IEFZB505 LOCEPAX=YES/VR2/NO                       @L2C*/         
*/*                                                              @L1A*/         
*/*            ADDRESSABILITY IS ESTABLISHED BY DOING A USING    @L1A*/         
*/*            ON ZB505.                                         @L1A*/         
*/*                                                              @L1A*/         
*/*            LOCEPAX=YES-GENERATE EXTENDED EPA                 @R1A*/         
*/*                                                              @L1A*/         
*/*            LOCEPAX=VR2-Generate version 2 of the extended    @L2A*/         
*/*                        EPA                                   @L2A*/         
*/*                                                              @L2A*/         
*/*            LOCEPAX=NO (DEFAULT)-GENERATE STANDARD EPA        @R1A*/         
*/*                                                              @L1A*/         
*/*      PLS - %DCL LOCEPAX CHAR                                 @R1A*/         
*/*            %LOCEPAX='YES/VR2/NO'                             @L2C*/         
*/*            %INCLUDE SYSLIB(IEFZB505)                         @L1A*/         
*/*            DECLARE SWEPAPTR AS PTR(31).                      @L1A*/         
*/*                                                              @L1A*/         
*/*            GENERATES MAPPING BASED ON SWEPAPTR               @L1A*/         
*/*                                                              @L1A*/         
*/*            LOCEPAX=YES-GENERATE EXTENDED EPA                 @R1A*/         
*/*                                                              @R1A*/         
*/*            LOCEPAX=VR2-Generate version 2 of the extended    @L2A*/         
*/*                        EPA                                   @L2A*/         
*/*                                                              @L2A*/         
*/*            LOCEPAX=NO (DEFAULT)-GENERATE STANDARD EPA        @R1A*/         
*/*                                                              @L1A*/         
*/*02*   NOTES =                                                 @L1A*/         
*/*                                                              @L1A*/         
*/*        EPA SIZE: . 16 BYTES FOR ASSIGNS, READS, WRITES       @L1A*/         
*/*                    OR DELETES (STANDARD)                     @L1A*/         
*/*                  . 28 BYTES FOR LOCATE/ALL (EXTENDED)        @L1A*/         
*/*                  . 64 BYTES for extended version 2           @L2A*/         
*/*        EXTERNAL VARIABLE EPAEXTND DEFINED AND SET.           @D1A*/         
*/*                                                              @L1A*/         
*/* DSECT NAME = ZB505                                           @L2C*/         
*/*                                                                  */         
*/* EXTERNAL CLASSIFICATION: PI                                  @L2A*/         
*/* END OF EXTERNAL CLASSIFICATION                               @L2A*/         
*/*                                                                  */         
*/* COMPONENT: SWA manager (SC1B5)                               @L2A*/         
*/*                                                                  */         
*/* EYE-CATCHER:  None                                           @L2A*/         
*/* OFFSET: 0                                                    @L2A*/         
*/* LENGTH: 4                                                    @L2A*/         
*/*                                                                  */         
*/* STORAGE ATTRIBUTES:                                          @L2A*/         
*/*  Subpool:  Any                                               @L2A*/         
*/*  Key:      Any                                               @L2A*/         
*/*                                                                  */         
*/* SIZE:                                                            */         
*/*   LOCEPAX=NO   16 bytes                                      @L2A*/         
*/*   LOCEPAX=YES  28 bytes                                      @L2A*/         
*/*   LOCEPAX=VR2  56 bytes                                      @L2A*/         
*/*                                                                  */         
*/* CREATED BY:                                                  @L2A*/         
*/*  Caller                                                      @L2A*/         
*/*                                                                  */         
*/* POINTED TO BY:                                               @L2A*/         
*/*  N/A                                                         @L2A*/         
*/*                                                                  */         
*/* SERIALIZATION: None                                          @L2A*/         
*/*                                                                  */         
*/*                                                              @L1A*/         
*/*01* CHANGE ACTIVITY = L1, R1, D1                              @D1C*/         
*/*                                                              @L1A*/         
*/*    $L1=SWABOVE JBB2220 850408 PDR6: SWA ABOVE THE LINE       @L1A*/         
*/*    $R1=PA20241 JBB2220 850408 PDR6: COMPATIBILITY CHANGE     @R1A*/         
*/*    $D1=DEO0265 HBB4410 890918 PDCC: COMPILE ERROR CHECKING   @D1A*/         
*/*    $L2=SWBNATB HBB77D0 210104 PDOO: SWBNext ATB              @L2A*/         
*/*                                                              @L1A*/         
*/*************** END OF SPECIFICATIONS ******************************/         
*/* A PROLOGUE                                                   @L1A*/         
*/* A ADDITION OF THE FOLLOWING FIELDS TO THE MACRO:             @L1A*/         
*/*     . SWQMPA                                                 @L1A*/         
*/*     . SWPFXPTR                                               @L1A*/         
*/*     . SWPFXLTH                                               @L1A*/         
*/*     . SWLVERS                                                @L1A*/         
*/* A UPDATED BECAUSE OF AN INCOMPATIBLE CHANGE                  @R1A*/         
*/* A SET A VARIABLE TO INDICATE WHETHER AN EXTENDED EPA WAS     @D1A*/         
*/* A SELECTED.  THIS IS USED FOR ERROR CHECKING IN SWAREQ.      @D1A*/         
*/* A Defined SWAEPAX version 2                                  @L2A*/         
*/********************************************************************/         
*   %GOTO ZB505PLS;                                                  /*         
ZB505    DSECT                                                                  
         AIF   ('&LOCEPAX' NE 'YES' AND '&LOCEPAX' NE 'VR2').ZB505ST   +        
                                                                 @L2C           
         AIF   ('&LOCEPAX' EQ 'YES').ZB505Y1                     @L2A           
SWAEPAV2 DS    0CL64               EPA Version 2                 @L2A           
.ZB505Y1 ANOP                                                    @R1A           
SWAEPAX  DS    0CL28               MAPPING OF EXTENDED EPA FOR                  
*                                  LOCATE/ALL                    @L1A           
.ZB505ST ANOP                                                    @R1A           
SWAEPA   DS    0CL16               MAPPING OF STANDARD EPA       @L1A           
SWBLKPTR DS    F                   POINTER TO BLOCK                             
SWVAFW   DS    0F                  4 BYTE SWA VIRTUAL ADDRESS                   
SWVA     DS    CL3                 3 BYTE SWA VIRTUAL ADDRESS                   
SWBLKID  DS    CL1                 BLOCK ID OR ZERO                             
SWLNGTH  DS    F                   LENGTH OF SWA BLOCK (NOT INCLUDING           
*                                  SWA PREFIX)                                  
SWCHNPTR DS    F                   CHAIN POINTER OR ZERO                        
         AIF   ('&LOCEPAX' NE 'YES' AND '&LOCEPAX' NE 'VR2').ZB505ND   +        
                                   Extended EPA?                 @L2C           
SWQMPA   DS    F                   POINTER TO QMPA OR ZERO       @L1A           
SWPFXPTR DS    F                   POINTER TO SWA PREFIX         @L1A           
SWPFXLTH DS    H                   LENGTH OF SWA PREFIX          @L1A           
SWLVERS  DS    CL2                 VERSION NUMBER                @L1A           
SWLVRS2  EQU   X'0002'             Version 2                     @L2A           
         AIF   ('&LOCEPAX' NE 'VR2').ZB505ND   Extended EPA            +        
                                   version 2?                    @L2A           
SWEPV2Start  DS 0x                 Start of extended version 2   @L2A           
SWEPV2_Length  DS FL1              Length of this section        @L2A           
SWEPFLAG1  DS  CL1                 Flag byte                     @L2A           
SWEPATB    EQU X'80'               When on, an above the bar block is           
*                                  requested                     @L2A           
SWEPV2RSV01 DS CL2                 Reserved                      @L2A           
SWPfxPtr64 DS  0D                  SWA block prefix pointer 64-bit              
*                                                                @L2A           
SWPfxP64H  DS  F                   SWA block prefix pointer High half           
*                                                                @L2A           
SWPfxP64L  DS  F                   SWA block prefix pointer low half            
*                                                                @L2A           
SWBlkPtr64 DS  0D                  SWA block pointer 64-bit      @L2A           
SWBlkP64H  DS  F                   SWA block pointer high half   @L2A           
SWBlkP64L  DS  F                   SWA block pointer low half    @L2A           
SWEPV2Rsv2 DS  CL16                Reserved                      @L2A           
SWEPV2End  DS  0X                  End of Extended version 2     @L2A           
SWEPV2_Area_Length EQU SWEPV2End-SWEPV2Start   Version 2 length  @L2A           
.ZB505ND ANOP                                                    @R1A           
         MEND                                                        */         
*%ZB505PLS:;                                                                    
* %DECLARE EPAEXTND CHARACTER EXTERNAL;          /*              @D1A*/         
* %EPAEXTND = LOCEPAX;       /* MAKE A COPY FOR THE SWAREQ MACRO @D1A*/         
*%IF LOCEPAX = 'YES' ! LOCEPAX = 'VR2'  %THEN %GOTO ZB505EXT;  /*@L2C*/         
*   DCL                                                                         
*         1 SWAEPA BASED(SWEPAPTR),  /* MAPPING OF STANDARD EPA      */         
*%GOTO ZB505COM;                                               /*@R1A*/         
*%ZB505EXT:;                                                   /*@R1A*/         
*%IF LOCEPAX = 'VR2' %THEN %GOTO ZB505VR2;                     /*@L2C*/         
*   DCL                                                                         
*       1 SWAEPAX BASED(SWEPAPTR),   /* MAPPING OF EXTENDED EPA FOR             
*                                       LOCATE/ALL               @L1A*/         
*           5 SWAEPA,                /* MAPPING OF STANDARD EPA                 
*                                       LOCATE/ALL               @L1A*/         
*%GOTO ZB505COM; ;                                             /*@R1A*/         
*%ZB505VR2:;                                                   /*@R1A*/         
*   DCL                                                                         
*       1 SWAEPAV2 BASED(SWEPAPTR),  /*                          @L2A*/         
*         3 SWAEPAX,                 /* MAPPING OF EXTENDED EPA FOR             
*                                       LOCATE/ALL               @L1A*/         
*           5 SWAEPA,                /* MAPPING OF STANDARD EPA  @L1A*/         
*%ZB505COM:;                                                   /*@R1A*/         
*             7 SWBLKPTR  PTR(31), /* POINTER TO BLOCK           @L1C*/         
*             7 SWVAFW    PTR(32), /* 4 BYTE SWA VIRTUAL ADDRESS @L1C*/         
*               9 SWVA    PTR(24) BDY(WORD), /* 3 BYTE SVA       @L1C*/         
*               9 SWBLKID CHAR(1), /* BLOCK ID OR ZERO           @L1C*/         
*             7 SWLNGTH  FIXED(31),/* LENGTH OF SWA BLOCK (NOT                  
*                                     INCLUDING SWA PREFIX)      @L1C*/         
*%IF LOCEPAX = 'YES' ! LOCEPAX = 'VR2' %THEN %GOTO ZB505V01;   /*@L2C*/         
*%GOTO ZB505STD;                                              /* @R1A*/         
*%ZB505V01:;                                                  /* @R1A*/         
*             7 SWCHNPTR PTR(31),  /* CHAIN POINTER OR ZERO      @L1C*/         
*           5 SWQMPA PTR(31),      /* POINTER TO QMPA OR ZERO    @L1A*/         
*           5 SWPFXPTR PTR(31),    /* POINTER TO SWA PREFIX      @L1A*/         
*           5 SWPFXLTH FIXED(16),  /* LENGTH OF SWA PREFIX       @L1A*/         
*           5 SWLVERS  CHAR(2)     /* VERSION NUMBER             @L2C*/         
*%IF LOCEPAX = 'YES' %THEN %GOTO ZB505VND;                     /*@L2C*/         
*        ,3 SWEPV2_Length FIXED(8) /* Length of Version 2 area   @L2A*/         
*        ,3 SWEPFLAG1   CHAR(1)    /* Flag bytes                 @L2A*/         
*          ,5 SWEPATB   BIT(1)     /* When on, an above the bar                 
*                                     block is requested.        @L2A*/         
*        ,3 SWEPV2RSV01 CHAR(2)    /* Reserved                   @L2A*/         
*        ,3 SWPfxPtr64  PTR(64)    /* SWA block prefix pointer                  
*                                      64-bit                    @L2A*/         
*          ,5 SWPfxP64H FIXED(31)  /* SWA block prefix pointer                  
*                                      high half                 @L2A*/         
*          ,5 SWPfxP64L FIXED(31)  /* SWA block prefix pointer                  
*                                      low half                  @L2A*/         
*        ,3 SWBlkPtr64  PTR(64)    /* SWA block pointer 64-bit   @L2A*/         
*          ,5 SWBlkP64H FIXED(31)  /* SWA block pointer high half               
*                                                                @L2A*/         
*          ,5 SWBlkP64L FIXED(31)  /* SWA block pointer low half                
*                                                                @L2A*/         
*        ,3 SWEPV2Rsv2  CHAR(16)   /* Reserved                   @L2A*/         
*        ;                         /*                            @L2A*/         
*DCL SWLVRS2     FIXED(16) CONSTANT(2);        /* Version 2      @L2A*/         
*DCL SWEPV2Start FIXED(8) CONSTANT(OFFSET(SWAEPAV2.SWEPV2_Length)); /*          
*                                    Offset to the start of                     
*                                    extended version 2          @L2A*/         
*DCL SWEPV2End   FIXED(8) CONSTANT(OFFSET(SWAEPAV2.SWEPV2Rsv2) +                
*                                  Length(SWAEPAV2.SWEPV2Rsv2));  /*            
*                                    Offset to the end of                       
*                                    extended version 2          @L2A*/         
*DCL SWEPV2_Area_Length FIXED(8)  Constant(SWEPV2End-SWEPV2Start);  /*          
*                                    Length of extended version 2               
*                                                                @L2A*/         
*%GOTO ZB505END;                                               /*@R1A*/         
*%ZB505VND:;                                                   /*@R1A*/         
*             ;                   /* End of all extended                        
*                                    versions                    @L2A*/         
*%GOTO ZB505END;                                               /*@R1A*/         
*%ZB505STD:;                                                   /*@R1A*/         
*             7 SWCHNPTR PTR(31);  /* CHAIN POINTER OR ZERO      @L1C*/         
*%ZB505END:;                                                   /*@R1A*/         
