*      %GOTO EMPLS1;           /*                                       00050000
       MACRO                                                            00100000
       IEFZB476 &EMDSEC1=NO,&EMDSEC2=NO,&EMDSEC4=NO              @01C   00169901
**/                                                                     00200000
*%EMPLS1: ;                                                             00250000
*/**START OF SPECIFICATIONS*******************************************/ 00283300
*/*                                                                  */ 00316600
*/* MACRO NAME:  IEFZB476                                        @P1C*/ 00349900
*/*                                                                  */ 00383200
*/* DESCRIPTIVE NAME:  Dynamic Allocation Error Message Processor    */ 00416500
*/*                     Parameter List                               */ 00450000
*/*                                                                  */ 00472500
*/*01* PROPRIETARY STATEMENT=                                        */ 00495000
*/***PROPRIETARY_STATEMENT********************************************/ 00517500
*/*                                                                  */ 00540000
*/*                                                                  */ 00562500
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00585000
*/* THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                      */ 00607500
*/* 5694-A01 (C) COPYRIGHT IBM CORP. 1987, 2006                      */ 00630001
*/*                                                                  */ 00675000
*/* STATUS= HBB7730                                                  */ 00697501
*/*                                                                  */ 00720000
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 00742500
*/*                                                              @P1C*/ 00765000
*/* DSECT NAME:  EMPARMS, EMBUFS, EMABUFFS, EMWTDERT             @01C*/ 00797401
*/*                                                                  */ 00810000
*/* COMPONENT:  Allocation (SC1B4)                               @P1A*/ 00832500
*/*                                                                  */ 00855000
*/* FUNCTION:  Parameter list for the Dynamic Allocation Error       */ 00877500
*/*            Message Processor (IEFDB476).                         */ 00900000
*/*                                                                  */ 00930000
*/* MODULE TYPE:  MACRO                                              */ 00960000
*/*                                                                  */ 00990000
*/* METHOD OF ACCESS:                                            @P1C*/ 01020000
*/*   PL/S - %DCL EMPPLXXX CHAR                                      */ 01050000
*/*          %EMPPLXXX = 'BASED' OR 'BDY(WORD)' OR ''                */ 01100000
*/*          %INCLUDE SYSLIB(IEFZB476)                               */ 01150000
*/*   ASM  - IEFZB476 EMDSEC1=X,EMDSEC2=Y,EMDSEC4=Z              @01C*/ 01229901
*/*          Where X, Y and Z = YES or NO.  X, Y and Z determine     */ 01259901
*/*          whether the DSECT statements are generated for the      */ 01300000
*/*          sections of this mapping.                               */ 01350000
*/*           - EMDSEC1=YES   If definition of storage for the       */ 01400000
*/*                           parameter list is not desired.         */ 01450000
*/*                           Code as follows:                       */ 01500000
*/*                                LA    REG,MYEMSTG1                */ 01550000
*/*                                USING EMDSECT1,REG                */ 01600000
*/*             EMDSEC1=NO is the default                            */ 01650000
*/*           - EMDSEC2=YES   If definition of storage for the       */ 01700000
*/*                           buffer area is not desired.            */ 01750000
*/*                           Code as follows:                       */ 01800000
*/*                                LA    REG,MYEMSTG2                */ 01850000
*/*                                USING EMDSECT2,REG            @D1C*/ 01900000
*/*             EMDSEC2=NO is the default                            */ 01950000
*/*           - EMDSEC4=YES   Generate the DSECT. Access to the area */ 02000000
*/*                           that maps what EMWTPCDP points to is   */ 02050000
*/*                           as follows:                            */ 02100000
*/*                                LA    REG,MYEMSTG3                */ 02150000
*/*                                USING EMDSECT4,REG            @01A*/ 02200000
*/*             EMDSEC4=NO    is the default.                    @01A*/ 02250000
*/*                                                                  */ 02300000
*/* STORAGE ATTRIBUTES:                                          @P1A*/ 02302000
*/*                                                                  */ 02304000
*/*   SUBPOOL:  Caller's subpool                                 @P1A*/ 02306000
*/*   KEY:  Caller's key                                         @P1A*/ 02308000
*/*   SIZE:  24 bytes                                            @P1A*/ 02310000
*/*   RESIDENCY:  Any                                            @P1A*/ 02312000
*/*                                                                  */ 02314000
*/* EYE CATCHER: None                                            @P2A*/ 02316000
*/*   OFFSET: N/A                                                @P1A*/ 02318000
*/*   LENGTH: N/A                                                @P1A*/ 02320000
*/*                                                                  */ 02322000
*/* CREATED BY: IEFDB400                                         @P1A*/ 02324000
*/*             User program invoking Dynamic Allocation         @P1A*/ 02326000
*/*               Error Message Routine                          @P1A*/ 02328000
*/*                                                                  */ 02330000
*/* POINTED TO BY: Passed as a parameter.  On entry to IEFDB476, @P1A*/ 02332000
*/*                register 1 contains the address of a pointer  @P1A*/ 02334000
*/*                to it.                                        @P1A*/ 02336000
*/*                                                                  */ 02338000
*/* SERIALIZATION: None                                          @P1A*/ 02340000
*/*                                                                  */ 02342000
*/* EXTERNAL CLASSIFICATION: GUPI                                @P1A*/ 02344000
*/* END OF EXTERNAL CLASSIFICATION:                              @P1A*/ 02346000
*/*                                                                  */ 02348000
*/* CHANGE ACTIVITY = L0, D1, D2                                 @D2C*/ 02350000
*/*                                                                  */ 02362500
*/* The above area of the change activity is no longer updated   @P1A*/ 02375000
*/*                                                                  */ 02387500
*/* $L0= SMSSTG2 JBB2223 860820 PDV6  Stor Mgmt Subsys Stg2 Supt     */ 02400000
*/* $D1= DC20018 JBB2223 861007 PDV6  Stor Mgmt Subsys Stg2 Supt @D1A*/ 02416600
*/* $D2= DC20061 JBB2223 871218 PDV6  New message buffer array   @D2A*/ 02433200
*/* $P1= PIG4142 HBB5510 930910 PDEM  Add dynamic allocation         */ 02449800
*/*                                   indicator                  @P1A*/ 02466400
*/* $P2= PN70109 HBB5520 940210 PDNN  Updated Prolog for SHOWHDR @P2A*/ 02474700
*/* $P3= PN70763 HBB5520 940728 PDEM  Updated prolog for SHOWHDR @P3A*/ 02478800
*/* $01= OA13894 HBB7709 051115 PDKV  Support DESC & ROUTCDE     @01A*/ 02480800
*/*                                                                  */ 02483000
*/**END OF SPECIFICATIONS*********************************************/ 02499600
*/* IEFZB476 - A - Add fields to allow an authorized SVC99 caller to */ 02503101
*/*                override the default DESC(7) ROUTCDE(11) codes    */ 02504001
*/*                for WTO (EMWTP) requests                      @01A*/ 02504901
*/* IEFZB476 - C - Updated Prolog for SHOWHDR - add DSECT EMABUFFS   */ 02505801
*/*                                                              @P3A*/ 02506701
*/* IEFZB476 - C - Updated Prolog for Showhdr                    @P2A*/ 02507900
*/* IEFZB476 - A - Add an identifier to indicate Dynamic Allocation  */ 02516200
*/*                is the caller. Put prolog in SHOWHDR format.  @P1A*/ 02532800
* %GOTO EMPLS2;          /*                                             02550000
         AIF   ('&EMDSEC1' EQ 'NO').EMBAL1                              02600000
EMDSECT1 DSECT                          Parameter list to IEFDB476      02650000
.EMBAL1  ANOP                                                           02700000
         DS    0F                                                       02750000
EMPARMS  EQU   *                        Parameter list to IEFDB476      02800000
EMFUNCT  DS    XL1                      Function indicator flags        02803800
EMPUTLIN EQU   B'10000000'              ON for message output via      X02807600
                                        PUTLINE                   @D1C  02811400
EMWTP    EQU   B'01000000'              ON if the caller wants a Write X02815200
                                        To Programmer (WTO)       @D1C  02819000
EMRETURN EQU   B'00100000'              ON if the caller wants message X02822800
                                        text returned in buffers  @D1C  02826600
EMKEEP   EQU   B'00010000'              ON if caller wants to keep     X02830400
                                        message blocks anchored to the X02834200
                                        SVC 99 RB extension       @D1C  02838000
EMWTPCDE EQU   B'00001000'              DESC & ROUTCDE codes are       X02839000
                                        included                  @01A  02840000
EMIDNUM  DS    XL1                      Caller identifier number  @D1C  02841800
EMNMSGBK DS    XL1                      Number of messages to be       X02843800
                                        extracted                 @D2A  02845800
EMRSV02  DS    XL1                      Reserved                  @01C  02848701
EMS99RBP DS    A                        Address of the failing SVC 99  X02850000
                                        request block for SVC 99       X02900000
                                        errors                    @D1C  02950000
EMDAPLP  EQU   EMS99RBP                 Address of the failing DAIR    X03000000
                                        parameter list for DAIR errors  03050000
EMRETCOD DS    F                        The SVC 99 or the DAIR reg 15  X03100000
                                        return code               @D1A  03150000
EMCPPLP  DS    A                        Address of the CPPL This is    X03400000
                                        needed only when IEFDB476 is   X03450000
                                        called with an SVC 99 error    X03500000
                                        and message output via a       X03550000
                                        PUTLINE is requested      @D1C  03585700
EMBUFP   DS    A                        Address of message buffers if  X03621400
                                        message buffers are to be      X03657100
                                        returned                  @D1C  03692800
EMRSV03  DS    XL4                      Reserved                  @01C  03733401
EMWTPCDP DS    A                        When EmWtpCde is set, this is  X03738401
                                        the address of the descriptor &X03743401
                                        route codes mapped by EMWTDERT X03748401
                                                                  @01C  03753401
EMLEN1   EQU   *-EMPARMS                                                03764200
*********************************************************************** 03767200
*      Map of the descriptor and route codes                          * 03770200
*********************************************************************** 03773200
         AIF   ('&EMDSEC4' EQ 'NO').EMBAL4                        @01A  03776200
EMDSECT4 DSECT                          Pointed to by EMWTPCDP    @01A  03779200
.EMBAL4  ANOP                                                     @01A  03782200
EMWTDERT DS   0XL18                     Descriptor & route codes of    X03785200
                                        caller                    @01A  03788200
EMWTDESC DS    XL2                      WTO Descriptor codes      @01A  03791200
EMWTRTCD DS    XL16                     WTO Routing codes         @01A  03794200
*********************************************************************** 03800000
*      Map of the return message buffer area                          * 04950000
*********************************************************************** 05000000
         AIF   ('&EMDSEC2' EQ 'NO').EMBAL2                       @D1C   05050000
EMDSECT2 DSECT                                                   @D1C   05100000
.EMBAL2  ANOP                                                    @D1C   05150000
EMBUFS   DS    0F                       (Need not initialize)           05200000
EMBUF1   EQU   *                        First extract buffer            05250000
EMBUFL1  DS    XL2                      Length of area used in EMBUF1   05300000
EMBUFO1  DS    XL2                      Offset is zero on return        05350000
EMBUFT1  DS    CL251                    Text of first level message     05400000
EMBUF2   DS    0H                       Second extract buffer           05450000
EMBUFL2  DS    XL2                      Length of area used in EMBUF2   05500000
EMBUFO2  DS    XL2                      Offset is zero on return        05550000
EMBUFT2  DS    CL251                    Text of second level message    05600000
EMLEN2   EQU   *-EMBUFS                 Length of buffer parameters     05650000
**************************************************************** @D2A   05653800
*      Map of the return message buffer area array               @D2A   05657600
**************************************************************** @D2A   05661400
EMDSECT3 DSECT                                                   @D2A   05665200
EMABUFFS DS    0CL256                                            @D2A   05669000
EMABUFF  DS    CL255                                             @D2A   05672800
         ORG   EMABUFFS                                          @D2A   05676600
EMABUFLN DS    XL2                                               @D2A   05680400
EMABUFOF DS    XL2                                               @D2A   05684200
EMABUFTX DS    CL251                                             @D2A   05688000
         DS    CL1                                               @D2A   05691800
EMLEN3   EQU   *-EMABUFFS               Length of array element  @D2A   05695600
*********************************************************************** 05700000
*      Valid Caller Identification Numbers                       @D1C * 05750000
*********************************************************************** 05800000
EMSVC99  EQU   50                       General caller with an SVC 99  X05850000
                                        error                           05900000
EMFREE   EQU   51                       Free command with an SVC 99    X05950000
                                        error                           06000000
EMDAIR   EQU   1                        General caller with a DAIR     X06050000
                                        error                           06100000
EMDYNALC EQU   99                       Call is Dynamic Allocation @P1A 06125000
*                                                                       06150000
         MEND                                                      , */ 06200000
*%EMPLS2: ;                                                             06250000
   %IF EMPPLXXX = '' %THEN %EMPPLXXX = ' ';                             06300000
    DCL 1 EMPARMS EMPPLXXX,            /* Parameter list to IEFDB476 */ 06350000
          3  EMFUNCT  BIT(8),          /* Function indicators    @D1C*/ 06360800
             5  EMPUTLIN  BIT(1),      /* ON for message output via     06371600
                                          a PUTLINE              @D1C*/ 06382400
             5  EMWTP     BIT(1),      /* ON for message output via     06393200
                                          a WTO                  @D1C*/ 06404000
             5  EMRETURN  BIT(1),      /* ON if the caller wants the    06414800
                                          message text returned in      06425600
                                          the user supplied message     06436400
                                          buffers                @D1C*/ 06447200
             5  EMKEEP    BIT(1),      /* On if the caller does not     06458000
                                          want the message blocks that  06468800
                                          are anchored to the SVC 99    06479600
                                          request block extension to    06490400
                                          be freed               @D1C*/ 06501200
             5  EMWTPCDE  BIT(1),      /* DESC & ROUTCDE codes are      06513901
                                          included               @01A*/ 06515901
             5  EMRSV01   BIT(3),      /* Reserved               @01C*/ 06517901
          3  EMIDNUM  FIXED(8),        /* Caller identification         06522800
                                          number                 @D1C*/ 06533600
          3  EMNMSGBK FIXED(8),        /* Number of messages to be      06539000
                                          extracted              @D2A*/ 06544400
          3  EMRSV02  FIXED(8),        /* Reserved               @D2C*/ 06549800
          3  EMS99RBP  PTR(31),        /* Address of the failing        06555200
                                          SVC 99 request block for      06566000
                                          SVC 99 errors              */ 06576800
             5  EMDAPLP  PTR(31),      /* Address of the failing DAIR   06587600
                                          parameter list for DAIR       06600000
                                          errors                     */ 06650000
          3  EMRETCOD  FIXED(31),      /* The SVC 99 or the DAIR        06700000
                                         register 15 return code @D1C*/ 06750000
          3  EMCPPLP  PTR(31),         /* Address of the CPPL - This    06800000
                                          is needed only when IEFDB476  07050000
                                          is called with an SVC 99      07100000
                                          error and message output      07150000
                                          via a PUTLINE is requested */ 07200000
          3  EMBUFP  PTR(31),          /* Address of the message        07250000
                                          buffers if messages are       07300000
                                          to be returned             */ 07350000
          3  EMRSV03  CHAR(4),         /* Reserved               @01C*/ 07403901
          3  EMWTPCDP Ptr(31),         /* When EmWtpCde is set, this is 07407901
                                        the address of the descriptor & 07411901
                                        route codes mapped by EMWTDERT  07415901
                                                                 @01A*/ 07419901
         2 EMPARMSEND CHAR(0);         /* 1st byte after EMPARMS @01A*/ 07423901
    /*   Map of the descriptor and route codes                   @01A*/ 07427901
    DCL 1 EMWTDERT Char(18) BASED(EMWTPCDP), /* Descriptor & route      07431901
                                                codes of caller  @01A*/ 07435901
          3  EMWTDESC BIT(16),      /* WTO Descriptor codes      @01A*/ 07439900
          3  EMWTRTCD BIT(128);     /* WTO Routing codes         @01A*/ 07443801
 %IF EMTYPE2='' %THEN               /*                               */ 07450000
 %EMTYPE2='BASED(EMBUFP)';          /*                               */ 07500000
    /*  Map of caller-supplied message buffers                       */ 07550000
    DCL 1 EMBUFS EMTYPE2,           /* (Need not initialize)         */ 07600000
         2 EMBUF1,                  /* First extract buffer          */ 07650000
          3 EMBUFL1 FIXED(15),      /* Length of area used in           07700000
                                       EMBUF1 (Includes                 07750000
                                       EMBUFL1 and EMBUFO1              07800000
                                       lengths)                      */ 07850000
          3 EMBUFO1 FIXED(15),      /* Offset is zero on                07900000
                                       return                        */ 07950000
          3 EMBUFT1 CHAR(251),      /* Text of first level              08000000
                                       message                       */ 08050000
         2 *       CHAR(1),         /* Alignment factor              */ 08100000
         2 EMBUF2 BDY(HWORD),       /* Second extract buffer         */ 08150000
          3 EMBUFL2 FIXED(15),      /* Length (Includes LLOO            08200000
                                       fields)                       */ 08250000
          3 EMBUFO2 FIXED(15),      /* Offset                        */ 08300000
          3 EMBUFT2 CHAR(251);      /* Text of second level             08350000
                                       message                       */ 08400000
    /*  Map of caller-supplied message buffers (array structure) @D2A*/ 08404100
    DCL 1 EMABUFFS(*) BASED(EMBUFP), /* Message buffer mapping   @D2A*/ 08408200
         2 EMABUFF,                 /* Extract buffer            @D2A*/ 08412300
          3 EMABUFLN FIXED(15),     /* Length of area used in           08416400
                                       EMABUFF (Includes                08420500
                                       EMABUFLN and EMABUFOF            08424600
                                       lengths)                  @D2A*/ 08428700
          3 EMABUFOF FIXED(15),     /* Offset is zero on                08432800
                                       return                    @D2A*/ 08436900
          3 EMABUFTX CHAR(251),     /* Text of message           @D2A*/ 08441000
         2 *       CHAR(1);         /* Alignment factor          @D2A*/ 08445100
    /* Valid caller identification numbers                       @D1C*/ 08450000
    DCL EMSVC99 FIXED(8) CONSTANT(50); /* General caller with an        08800000
                                          SVC 99 error               */ 08850000
    DCL EMFREE FIXED(8) CONSTANT(51);  /* Free command with an          08900000
                                          SVC 99 error               */ 08950000
    DCL EMDAIR FIXED(8) CONSTANT(1);   /* General caller with a         09000000
                                          DAIR error                 */ 09050000
    DCL EMDYNALC FIXED(8) CONSTANT(99); /* Caller is Dynamic            09100000
                                           Allocation            @P1A*/ 09150000
 /********************************************************************/ 10100000
 /* End of IEFZB476 mapping macro                                    */ 10150000
 /********************************************************************/ 10200000
