*         %GOTO VMVPLS1;  /*                                            00010000
         MACRO                                                          00020000
         IEFZB431                                                       00030000
**/                                                                     00040000
*%VMVPLS1: ;                                                            00050000
*/****START OF SPECIFICATIONS*****************************************/ 00060000
*/*                                                                  */ 00070000
*/* MACRO NAME:  IEFZB431                                            */ 00080000
*/*                                                                  */ 00090000
*/* DESCRIPTIVE NAME:  Volume Mount and Verify Request Block         */ 00100000
*/*                                                                  */ 00110000
*/* ACRONYM:  None                                               @L2A*/ 00120000
*/*                                                                  */ 00130000
*/* DSECT NAME:  VMVRQBLK                                        @L2A*/ 00140000
*/*                                                                  */ 00150000
*/*                                                                  */ 00160000
*/*01* PROPRIETARY STATEMENT:                                        */ 00170000
*/*                                                                  */ 00180000
*/****PROPRIETARY_STATEMENT*******************************************/ 00190000
*/*                                                                  */ 00200000
*/*   LICENSED MATERIALS - PROPERTY OF IBM                           */ 00210000
*/*   5694-A01 COPYRIGHT IBM CORP. 1983,2009                         */ 00220000
*/*                                                                  */ 00230000
*/*01* STATUS =  HBB7760                                             */ 00240000
*/*                                                                  */ 00250000
*/****END_OF_PROPRIETARY_STATEMENT************************************/ 00260000
*/*                                                                  */ 00270000
*/* FUNCTION:                                                        */ 00280000
*/*       This request block is used as input to the Volume          */ 00290000
*/*       Mount and Verify routine when requesting the mounting,     */ 00300000
*/*       unloading or the verification of volumes.                  */ 00310000
*/*                                                                  */ 00320000
*/* COMPONENT:  Allocation (SC1B4)                               @L2A*/ 00330000
*/*                                                                  */ 00340000
*/* EYE-CATCHER:  None                                           @L2A*/ 00350000
*/*                                                                  */ 00360000
*/* STORAGE ATTRIBUTES:                                          @L2A*/ 00370000
*/*   SUBPOOOL: Caller defined (230 for Allocation)              @L2A*/ 00380000
*/*   KEY: Caller's Key (Key 1 for Allocation)                   @L2A*/ 00390000
*/*   RESIDENCY:  Any                                            @L2A*/ 00400000
*/*   MAIN STORAGE: No                                           @L2A*/ 00410000
*/*   AUXILIARY STORAGE:  Yes                                    @L2A*/ 00420000
*/*   VIRTUAL STORAGE:  Yes                                      @L2A*/ 00430000
*/*   DATA SPACE:  No                                            @L2A*/ 00440000
*/*                                                                  */ 00450000
*/* SIZE: Original Version - 34 Bytes, Version 1 - 48 Bytes      @L2A*/ 00460000
*/*                                                                  */ 00470000
*/*01* CREATED BY: Allocation (IEFAB4A4, IEFAB429, IEFAB441,     @L2A*/ 00480000
*/*                IEFAB473, IEFAB477, IEAFB49B, IEFAB491,       @L2A*/ 00490000
*/*                IEFAUINT, IEFBB416, IEFAB435, IEFAB49C),      @L2A*/ 00500000
*/*                Consoles, IOS and JES3                        @L2A*/ 00510000
*/*                                                                  */ 00520000
*/* POINTED TO BY:  SIOTVMVP, VMVNREQP or the first parameter    @L2A*/ 00530000
*/*                 passed to the Non-Allocation Interface to    @L2A*/ 00540000
*/*                 Unload (IEFAB49C)                            @L2A*/ 00550000
*/*                                                                  */ 00560000
*/* DELETED BY: Creators                                         @L2A*/ 00570000
*/*                                                                  */ 00580000
*/* SERIALIZATION:  None                                         @L2A*/ 00590000
*/*                                                                  */ 00600000
*/* METHOD OF ACCESS:                                                */ 00610000
*/*   PL/AS - DCL VMVREQBP PTR(31)                               @L2A*/ 00620000
*/*           %INCLUDE SYSLIB(IEFZB431)                          @L2A*/ 00630000
*/*                                                                  */ 00640000
*/*   BAL - IEFZB431                                             @L2A*/ 00650000
*/*                                                                  */ 00660000
*/*     If the control block lengths are desired, set:               */ 00670000
*/*         %ZB431LEN = 'YES'                                        */ 00680000
*/*                                                                  */ 00690000
*/* NOTE: BAL form of macro added for JES3                   @Y30QPPA*/ 00700000
*/*                                                                  */ 00710000
*/* DISTRIBUTION LIBRARY:  AMODGEN                               @L2A*/ 00720000
*/*                                                                  */ 00730000
*/* EXTERNAL CLASSIFICATION:  None                               @L2A*/ 00740000
*/* END OF EXTERNAL CLASSIFICATION:                              @L2A*/ 00750000
*/*                                                                  */ 00760000
*/* CHANGE ACTIVITY - Y02670, G38BP2J                                */ 00770000
*/*                                                                  */ 00780000
*/* $H1= 3480    JBB2125 830420 PDFB: TAPE DISPLAY SUPPORT       @H1A*/ 00790000
*/* $L1= ATLIB   HBB4430 911007 PDEU: Tape Library Support       @L1A*/ 00800000
*/* $L2= UCBVP   HBB5520 940310 PDNN: UCBVS Support              @L2A*/ 00810000
*/* $P1= PN70370 HBB5520 940414 PDNN: New Version Number         @P1A*/ 00820000
*/* $L3= SHRTP   HBB5520 940728 PDNN: Sysplex Shared Tape        @L3A*/ 00830000
*/* $P2= PWK0546 HBB6608 990120 PDON: IEFAUTOS ENQ Indicator     @P2A*/ 00840000
*/* $P3= PRR0236 HBB7705 010812 PDNN: Don't turn on UCBALOC when     */ 00850000
*/*                                   unloading a device during      */ 00860000
*/*                                   vary offline processing    @P3A*/ 00870000
*/* $01= OW55935 HBB7703 021031 PDHB: Ensure we are holding the      */ 00880000
*/*                                   Generic and Device Type ENQs   */ 00890000
*/*                                   before we attempt an Unload.   */ 00900000
*/*                                                              @01A*/ 00910000
*/* $02= OA24367 HBB7720 080425 PDTA: IEFAB49C/ACTIVATE deadlock @02A*/ 00920002
*/* $P3= ME13334 HBB7760 090131 PDTY: Misc Checker Failures      @P3A*/ 00930000
*/*                                                                  */ 00940000
*/****END OF SPECIFICATIONS*******************************************/ 00950000
*/* IEFZB431 D - Update copyright.                               @P3A*/ 00960002
*/* IEFZB431 C - Added VMVOPTB4 flag byte and VMVJ3SER bit to indicate  00970002
*                that JES3 holds serialization on the device to be      00980002
*                unloaded so that IEFAB49C does not need to serialize   00990002
*                the device.                                     @02A*/ 01000002
*/* IEFZB431 C - Added new bit VMVDGDNQ to the VMVOPTB3 flag byte       01010000
*                so IEFAB482 can tell IEFAB494 "Don't Get the Device    01020000
*                ENqueue".                                       @01A*/ 01030000
*/* IEFZB431 C - Added new bit to direct to IEFAB494 to enqueue         01040000
*                on the IEFAUTOS resource with an ECB and set an error  01050000
*                return code and dequeue if not obtained after waiting  01060000
*                one second.                                     @P2A*/ 01070000
*/* IEFZB431 C - Added new return code VMVNASGN to indicate a           01080000
*                device which was to be unloaded cannot be              01090000
*                unloaded because it is not assigned to this            01100000
*                system.                                                01110000
*              - Added new indicator flag VMVCLEAN to request           01120000
*                only the UCB be cleaned - don't do the unload          01130000
*                because the assign would fail.                         01140000
*              - Added new indicator flag VMVASGN to indicate the       01150000
*                device to be unloaded needs to be assigned by          01160000
*                IEFAB494 prior to the unload.                   @L3A*/ 01170000
*/* IEFZB431 C - Changed version number to 2 since change from          01180000
*                24-bit to 31-bit UCB Pointer causes a problem for      01190000
*                lower levels of JES3.  VMVUCBP was redefined to        01200000
*                allow use of a 31-bit UCB address while still          01210000
*                allowing lower levels of JES3 to function with         01220000
*                VMVUCBP as a 3-byte field.                      @P1A*/ 01230000
*/* IEFZB431 C - Changed the PTR(24) UCB address to PTR(31) to          01240000
*                allow for both actual 31-bit UCBs and CAPTUREd         01250000
*                UCBs.                                           @L2A*/ 01260000
*/* IEFZB431 C - Made the following changes for tape library support:   01270000
*                                                                       01280000
*                - Added fields for LACS return and reason codes on     01290000
*                  MOUNT and DEMOUNT errors                             01300000
*                                                                       01310000
*                - Added VMVVOLER for the volume error status code      01320000
*                                                                       01330000
*                - Added VMVLTYP for the tape volume label type         01340000
*                                                                       01350000
*                - Deleted tape label flags since they were replaced    01360000
*                  with character values                                01370000
*                                                                       01380000
*                - Deleted VMVMTMSG as it served no purpose             01390000
*                                                                       01400000
*                - Replaced VMVOPTB4 with VMVVERS to create a           01410000
*                  version number for the extended control block and    01420000
*                  added constants for control block versions and their 01430000
*                  corresponding lengths.                               01440000
*                                                                       01450000
*                  This will avoid causing users to recompile           01460000
*                  unless they need to use the new fields.       @L1A*/ 01470000
*/* IEFZB431 A - DECLARATION FOR VMVNODSP                        @H1A*/ 01480000
*/* IEFZB431 A - DECLARATION FOR VMVUCBNG                    @G38BP2J*/ 01490000
*%GOTO VMVPLS2;  /*                                                     01500000
VMVRQBLK DSECT                                                          01510000
VMVFNMAP DS    0CL4                    FUNCTION MAP                     01520000
VMVOPTB1 DS    CL1                     OPTIONS BYTE 1                   01530000
VMVUNLOD EQU   X'80'                   UNLOAD VOLUME                    01540000
VMVUCB   EQU   X'40'                   UNLOAD VOLSER IN UCB             01550000
VMVREWND EQU   X'20'                   DO REWIND ONLY                   01560000
VMVMOUNT EQU   X'10'                   PERFORM MOUNT                    01570000
*        EQU   X'08'                   Reserved                  @L1C   01580000
VMVDWTOR EQU   X'04'                   ALLOW OP CANCEL - DO WTOR        01590000
VMVVRLBL EQU   X'02'                   VERIFY LABEL                     01600000
VMVVDEND EQU   X'01'                   VERIFY DEVICE END                01610000
VMVOPTB2 DS    CL1                     OPTIONS BYTE 2                   01620000
*                                      THE FOLLOWING THREE VOLUME       01630000
*                                      ATTRIBUTES NEED NOT BE SET IF    01640000
*                                      VMVUCB IS ON                     01650000
VMVPRIVT EQU   X'80'                   VOL TO UNLOAD IS PRIVATE         01660000
VMVPUBLC EQU   X'40'                   VOL TO UNLOAD IS PUBLIC          01670000
VMVSTRG  EQU   X'20'                   VOL TO UNLOAD IS STORAGE         01680000
*                                      Deleted options for tape volume  01690000
*                                      types                    4@L1D   01700000
VMVNSPVT EQU   X'01'                   NON-SPECIFIC PVT FOR MOUNT       01710000
VMVOPTB3 DS    CL1                     OPTIONS BYTE 3                   01720000
VMVDUPVL EQU   X'80'                   VOLID APPEARS IN ANOTHER VMVRB   01730000
VMVCUVOL EQU   X'40'                   CLEAR UCB VOLSER                 01740000
VMVNUMSG EQU   X'20'                   DO NOT ISSUE DISMOUNT   @Y30QPPA 01750000
*                                      MESSAGE                 @Y30QPPA 01760000
VMVNODSP EQU   X'10'                   DO NOT ISSUE DISPLAY        @H1A 01770000
*                                      SERVICE REQUEST             @H1A 01780000
VMVASGN  EQU   X'08'                   Device must be assigned     @L3A 01790000
VMVCLEAN EQU   X'04'                   Clean UCB only - don't           01800000
*                                      do unload                   @L4A 01810000
VMVNINUS EQU   X'02'                   IEFAB494 is not to mark the      01820000
*                                      device as in use by system       01830000
*                                      function while it's doing        01840000
*                                      an unload.  Set by IEFAB429.     01850000
*                                      Used by IEFAB494            @P3C 01860000
*                                                                       01870000
VMVDGDNQ EQU   X'01'                   Don't Get the Device ENqueue.    01880000
*                                      Set by IEFAB482 and used by      01890000
*                                      IEFAB494.                   @01A 01900000
*                                                                       01910000
VMVVERS  DS    XL1                     Control block version       @L1C 01920000
*/********************************************************************/ 01930000
*/* The following are the version numbers for the control block.   @L1A 01940000
*/* ***                                                            @L1A 01950000
*/* ***VMVVERSC must be updated whenever a new version is added.   @L1A 01960000
*/* ***                                                            @L1A 01970000
*/********************************************************************/ 01980000
VMVVERS0 EQU   0                       Original control block      @L1A 01990000
VMVVERS1 EQU   1                       Control block extended for tape  02000000
*                                      library                     @L1A 02010000
VMVVERS2 EQU   2                       VMVUCBP changed from 24 to 31-   02020000
*                                      bit for UCBVS Support       @P1A 02030000
VMVVERSC EQU   2                       Current control block version    02040000
*                                                                  @P1C 02050000
VMVNREQP DS    A                       POINTER TO NEXT REQUEST          02060000
VMVUCBP4 DS    0AL4                    Pointer to 31-bit UCB       @P1A 02070000
         DS    AL1                                                 @P1A 02080000
VMVUCBP  DS    AL3                     Pointer to 24-bit UCB       @P1C 02090000
VMVUVLSR DS    CL6                     UNLOAD VOLUME SERIAL             02100000
VMVMVLSR DS    CL6                     MOUNT VOLUME SERIAL              02110000
VMVJBNMP DS    A                       POINTER TO JOB NAME              02120000
VMVDSNMP DS    A                       POINTER TO DATA SET NAME         02130000
VMVJSNMP DS    A                       POINTER TO JOB STEP NAME         02140000
VMVRETCD DS    A                       VM&V RETURN CODE AREA            02150000
VMVMINFO DS    0CL4                    MESSAGE INFORMATION              02160000
VMVACTON DS    CL1                     MESSAGE ACTION CODE              02170000
VMVKEEP  EQU   X'80'                   REQUEST KEEP MESSAGE             02180000
VMVDSMT  EQU   X'40'                   REQUEST DISMOUNT MESSAGE         02190000
VMVRTAIN EQU   X'20'                   REQUEST RETAIN MESSAGE           02200000
*                                      DISMOUNT AND RETAIN INDICATORS   02210000
*                                      NEED NOT BE SET IF VMVUCB IS     02220000
*                                      ON                               02230000
         DS    CL3                     RESERVED                         02240000
VMVVUNTP DS    A                       POINTER TO VOLUNIT ENTRY         02250000
VMVUSER  DS    CL4                     USER WORK AREA                   02260000
VMVPROCD EQU   X'80'                   THIS VMVRB HAS BEEN PROCESSED    02270000
VMVULRC  DS    F                       LACS DEMOUNT error return   @L1A 02280000
*                                      code                        @L1A 02290000
VMVULRSN DS    F                       LACS DEMOUNT error reason   @L1A 02300000
*                                      code                        @L1A 02310000
VMVMLRC  DS    F                       LACS MOUNT error return     @L1A 02320000
*                                      code                        @L1A 02330000
VMVMLRSN DS    F                       LACS MOUNT error reason     @L1A 02340000
*                                      code                        @L1A 02350000
VMVVOLER DS    H                       Volume error status code    @L1A 02360000
VMVLTYPE DS    CL1                     Tape volume label type      @L1A 02370000
VMVOPTB4 DS    CL1                     OPTIONS BYTE 4              @02C 02380002
VMVJ3SER EQU   X'80'                   Indicates the device to be       02390002
*                                      processed is serialized by       02400002
*                                      the caller.  For control         02410002
*                                      program and JES use only    @02A 02420002
*                                                                       02430000
*     VOLUME MOUNT AND VERIFY RETURN CODE DEFINITIONS (FOR VMVRETCD)    02440000
*                                                                       02450000
VMVUCBNG EQU   4                       UCB POINTER IS INVALID  @G38BP2J 02460000
VMVNASGN EQU   8                       AS device can't be unloaded      02470000
*                                      because it's not assigned to     02480000
*                                      this system                 @L3A 02490000
VMVRETRY EQU   12                      IEFAUTOS enqueue not             02500000
*                                      obtained so IEFAB429 should      02510000
*                                      retry later                 @P2A 02520000
*                                                                       02530000
*     The following tape label types are to used for VMVLTYPE.     @L1A 02540000
*     They need only be set for tape mounts.                       @L1A 02550000
*                                                                       02560000
VMVALTAP EQU  C'A'                     ANSI label type             @L1A 02570000
VMVNLTAP EQU  C'N'                     Non-label type              @L1A 02580000
VMVSLTAP EQU  C'S'                     Standard label type         @L1A 02590000
VMVNSLTP EQU  C'X'                     Non-standard label type     @L1A 02600000
         MEND , */                                                      02610000
*%VMVPLS2: ;                                                            02620000
*DCL                                                                    02630000
*  1 VMVRQBLK BASED(VMVREQBP),                                          02640000
*   2 VMVV0,                           /*Start of original version      02650000
*                                        fields                  @L1A*/ 02660000
*    4 VMVFNMAP,                       /*FUNCTION MAP                */ 02670000
*      6 VMVOPTB1  BIT(8),             /*OPTIONS BYTE ONE            */ 02680000
*        8 VMVUNLOD BIT(1),            /*UNLOAD VOLUME               */ 02690000
*        8 VMVUCB BIT(1),              /*UNLOAD VOLSER IN UCB        */ 02700000
*        8 VMVREWND BIT(1),            /*DO REWIND ONLY              */ 02710000
*        8 VMVMOUNT BIT(1),            /*PERFORM MOUNT               */ 02720000
*        8 *        BIT(1),            /*Reserved                @L1C*/ 02730000
*        8 VMVDWTOR BIT(1),            /*ALLOW OP CANCEL - DO WTOR   */ 02740000
*        8 VMVVRLBL BIT(1),            /*VERIFY LABEL                */ 02750000
*        8 VMVVDEND BIT(1),            /*VERIFY DEVICE END           */ 02760000
*      6 VMVOPTB2  BIT(8),             /*OPTIONS BYTE TWO            */ 02770000
*                                      /*THE FOLLOWING THREE VOLUME     02780000
*                                        ATTRIBUTES NEED NOT BE SET     02790000
*                                        IF VMVUCB IS ON             */ 02800000
*        8 VMVPRIVT BIT(1),            /*VOL TO UNLOAD IS PRIVATE    */ 02810000
*        8 VMVPUBLC BIT(1),            /*VOL TO UNLOAD IS PUBLIC     */ 02820000
*        8 VMVSTRG  BIT(1),            /* VOL TO UNLOAD IS STORAGE   */ 02830000
*        8 *        BIT(4),            /*Deleted options for tape       02840000
*                                        volume types           4@L1C*/ 02850000
*        8 VMVNSPVT BIT(1),            /*NON-SPECIFIC PVT FOR MOUNT  */ 02860000
*      6 VMVOPTB3  BIT(8),             /*OPTIONS BYTE THREE          */ 02870000
*        8 VMVDUPVL BIT(1),            /*VOLID APPEARS IN ANOTHER       02880000
*                                        VMVRB                       */ 02890000
*        8 VMVCUVOL BIT(1),            /*CLEAR UCB VOLSER            */ 02900000
*        8 VMVNUMSG BIT(1),            /*DO NOT ISSUE DISMOUNT          02910000
*                                        MESSAGE             @Y30QPPA*/ 02920000
*        8 VMVNODSP BIT(1),            /*DO NOT ISSUE DISPLAY           02930000
*                                        SERVICE REQUEST         @H1A*/ 02940000
*        8 VMVASGN  BIT(1),            /*Device must be assigned @L3A*/ 02950000
*        8 VMVCLEAN BIT(1),            /*Clean UCB only - don't         02960000
*                                        do unload               @L4A*/ 02970000
*        8 VMVNINUS BIT(1),            /*IEFAB494 is not to mark the    02980000
*                                        device as in use by system     02990000
*                                        function while it's doing      03000000
*                                        an unload.  Set by IEFAB429.   03010000
*                                        Used by IEFAB494        @P3C*/ 03020000
*                                                                       03030000
*        8 VMVDGDNQ BIT(1),       /* Don't Get the Device ENqueue.      03040000
*                                    Set by IEFAB482 and used by        03050000
*                                    IEFAB494.                   @01A*/ 03060000
*                                                                       03070000
*      6 VMVVERS   FIXED(8),           /*Control block version   @L1C*/ 03080000
*    4 VMVNREQP PTR(31),               /*POINTER TO NEXT REQUEST     */ 03090000
*    4 VMVUCBP4 PTR(31),               /*Pointer to UCB          @P1A*/ 03100000
*      6 *        PTR(8),              /*                        @P1A*/ 03110000
*      6 VMVUCBP  PTR(24),             /*Pointer to UCB          @P1C*/ 03120000
*    4 VMVUVLSR CHAR(6),               /*UNLOAD VOLUME SERIAL        */ 03130000
*    4 VMVMVLSR CHAR(6),               /*MOUNT  VOLUME SERIAL        */ 03140000
*    4 VMVJBNMP PTR(31),               /*POINTER TO JOB NAME         */ 03150000
*    4 VMVDSNMP PTR(31),               /*POINTER TO DATA SET NAME    */ 03160000
*    4 VMVJSNMP PTR(31),               /*POINTER TO JOB STEP NAME    */ 03170000
*    4 VMVRETCD FIXED(31),             /*VM&V RETURN CODE AREA       */ 03180000
*    4 VMVMINFO CHAR(4),               /*MESSAGE INFORMATION         */ 03190000
*      6 VMVACTON CHAR(1),             /*MESSAGE ACTION CODE         */ 03200000
*        8 VMVKEEP BIT(1),             /*REQUEST KEEP MESSAGE        */ 03210000
*        8 VMVDSMT BIT(1),             /*REQUEST DISMOUNT MESSAGE    */ 03220000
*        8 VMVRTAIN BIT(1),            /*REQUEST RETAIN MESSAGE      */ 03230000
*                                      /*DISMOUNT AND RETAIN INDIC-     03240000
*                                        ATORS NEED NOT BE SET IF       03250000
*                                        VMVUCB IS ON                */ 03260000
*        8 *      BIT(5),              /*RESERVED                    */ 03270000
*      6 *    CHAR(3),                 /*RESERVED                    */ 03280000
*    4 VMVVUNTP PTR(31),               /*POINTER TO VOLUNIT ENTRY    */ 03290000
*    4 VMVUSER BIT(32),                /*USER WORK AREA              */ 03300000
*      6 VMVPROCD BIT(1),              /*THIS VMVRB HAS BEEN PROC'D  */ 03310000
*      6 *        BIT(31),             /*RESERVED                    */ 03320000
*   2 VMVV1,                           /*Start of version 1 fields      03330000
*                                                                @L1A*/ 03340000
*    4 VMVULRC  FIXED(31),             /*LACS DEMOUNT error return      03350000
*                                        code                    @L1A*/ 03360000
*    4 VMVULRSN FIXED(31),             /*LACS DEMOUNT error reason      03370000
*                                        code                    @L1A*/ 03380000
*    4 VMVMLRC  FIXED(31),             /*LACS MOUNT error return        03390000
*                                        code                    @L1A*/ 03400000
*    4 VMVMLRSN FIXED(31),             /*LACS MOUNT error reason        03410000
*                                        code                    @L1A*/ 03420000
*    4 VMVVOLER FIXED(15),             /*Volume error status code       03430000
*                                                                @L1A*/ 03440000
*    4 VMVLTYPE CHAR (1),              /*Tape volume label type  @L1A*/ 03450000
*    4 VMVOPTB4 BIT(8),                /*Options byte four       @02C*/ 03460002
*      6 VMVJ3SER BIT(1);              /*Indicates the device to be     03470002
*                                        processed is serialized by     03480002
*                                        the caller.  For control       03490002
*                                        program and JES use only       03500002
*                                                                @02A*/ 03510002
*    /* VOLUME MOUNT AND VERIFY RETURN CODE DEFINITIONS              */ 03520000
*    /* (FOR VMVRETCD)                                               */ 03530000
*DCL                                                                    03540000
*  VMVUCBNG FIXED(31) CONSTANT(4),     /*UCB pointer is invalid  @L3C*/ 03550000
*  VMVNASGN FIXED(31) CONSTANT(8),     /*Device can't be unloaded       03560000
*                                        because it's not assigned      03570000
*                                        to this system          @P2C*/ 03580000
*  VMVRETRY FIXED(31) CONSTANT(12);    /*IEFAUTOS enqueue not           03590000
*                                        obtained so IEFAB429 should    03600000
*                                        retry later             @P2A*/ 03610000
*    /* The following tape label types are to used for VMVLTYPE.        03620000
*       They need only be set for tape mounts.                   @L1A*/ 03630000
*DCL                                                                    03640000
*  VMVALTAP CHAR(1)   CONSTANT('A'),   /*ANSI label type         @L1A*/ 03650000
*  VMVNLTAP CHAR(1)   CONSTANT('N'),   /*Non-label type          @L1A*/ 03660000
*  VMVSLTAP CHAR(1)   CONSTANT('S'),   /*Standard label type     @L1A*/ 03670000
*  VMVNSLTP CHAR(1)   CONSTANT('X');   /*Non-standard label type @L1A*/ 03680000
*/********************************************************************/ 03690000
*/* The following are the version numbers for the control block. @L1A*/ 03700000
*/* ***                                                          @L1A*/ 03710000
*/* ***VMVVERSC must be updated whenever a new version is added. @L1A*/ 03720000
*/* ***                                                          @L1A*/ 03730000
*/********************************************************************/ 03740000
*DCL                                                                    03750000
*  VMVVERS0 FIXED(8)  CONSTANT(0),     /*Original control block  @L1A*/ 03760000
*  VMVVERS1 FIXED(8)  CONSTANT(1),     /*Control block extended         03770000
*                                        for tape library        @L1A*/ 03780000
*  VMVVERS2 FIXED(8)  CONSTANT(2),     /*VMVUCBP changed from 24 to     03790000
*                                        31-bit for UCBVS Support       03800000
*                                                                @P1A*/ 03810000
*  VMVVERSC FIXED(8)  CONSTANT(2);     /*Current control block version  03820000
*                                                                @P1C*/ 03830000
*%IF ZB431LEN ^= 'YES' %THEN           /* If lengths not needed, @L1A*/ 03840000
*  %GOTO VMVEND;                       /* Skip to end            @L1A*/ 03850000
*    /* The following are the lengths for each version of the control   03860000
*       block.  Add one to version number to index into lengths.        03870000
*       Note:  Lengths for Version 1 and Version 2 are the same.        03880000
*       The repetition is required in order for IEFAB49C to             03890000
*       properly handle version 2.                               @P1C*/ 03900000
*DCL VMVLEN(3) FIXED(15) INIT(LENGTH(VMVV0),                            03910000
*                             LENGTH(VMVV1)+LENGTH(VMVV0),              03920000
*                             LENGTH(VMVV1)+LENGTH(VMVV0));             03930000
*                                      /*Lengths of VMVREQBK for each   03940000
*                                        version                 @P1C*/ 03950000
*                                                                       03960000
*%VMVEND: ;                                                             03970000
