*/********************************************************************/         
*/*                                                                  */         
*/*  $MAC(IEWBMMP)  COMP(PMB01):                                     */         
*/*                                                                  */         
*/*  INCLUDE NAME: IEWBMMP                                           */         
*/*                                                                  */         
*/*  DESCRIPTIVE NAME:  Binder Module Map                            */         
*/*                                                                  */         
*/*  STATUS: HPM7750                                                 */         
*/*                                                                  */         
*/*PROPRIETARY V3 STATEMENT                                          */         
*/*LICENSED MATERIALS - PROPERTY OF IBM                              */         
*/*5694-A01                                                          */         
*/*COPYRIGHT IBM CORP. 2007, 2008                                    */         
*/*END PROPRIETARY V3 STATEMENT                                      */         
*/*                                                                  */         
*/*                                                                  */         
*/* FUNCTION:  PROVIDES THE MAPPING FOR A BINDER-GENERATED           */         
*/*           MODULE MAP                                             */         
*/*                                                                  */         
*/* NOTES:                                                           */         
*/*                                                                  */         
*/*   The module map described by this mapping is a                  */         
*/*   binder-generated section that may be stored in a               */         
*/*   program object or load module, and is optional.                */         
*/*                                                                  */         
*/*   It may be loaded with the initial segment of the               */         
*/*   program, or, for program objects, may be in a                  */         
*/*   separately-loadable binder class.                              */         
*/*                                                                  */         
*/*   If it is loaded with the initial segment, it can be            */         
*/*   addressed by means of an external reference to the             */         
*/*   section IEWBMMP, and can also be found at the end of           */         
*/*   the loaded program.                                            */         
*/*                                                                  */         
*/*   If it is in a separately-loadable class, it can be             */         
*/*   obtained by means of the binder API GETD call or the           */         
*/*   Fastdata GD call for section IEWBPMM and class                 */         
*/*   B_MODMAP, using a text buffer.                                 */         
*/*                                                                  */         
*/*   See the description of the Binder option MODMAP.               */         
*/*                                                                  */         
*/*                                                                  */         
*/* MACRO TYPE: MAPPING                                              */         
*/*                                                                  */         
*/*   PROCESSOR:  Bilingual, Assembler and PL/X                      */         
*/*   DISTRIBUTION LIBRARY:  SYS1.MACLIB                             */         
*/*                                                                  */         
*/* INVOCATION, Assembler:                                           */         
*/*         IEWBMMP ,                                                */         
*/*   Three DSECTs will be generated, one named IEWBBMMP which       */         
*/*   maps the overall module map, another named BMMP_ENTRY          */         
*/*   which maps an entry in the map, and a third named BMMP_CUENTRY */         
*/*   which maps a Compile Unit Info entry.                          */         
*/*   The previous DSECT/CSECT environment will not be resumed.      */         
*/*                                                                  */         
*/* INVOCATION, PL/X:                                                */         
*/*  INCLUDE SYSLIB(IEWBMMP):                                        */         
*/*   Three structures will be generated, one named IEWBBMMP         */         
*/*   which maps the overall module map, another named               */         
*/*   BMMP_ENTRY which maps an entry in the map, and a third         */         
*/*   named BMMP_CUENTRY which maps the Compile Unit Info entry.     */         
*/*   The structures are based, and no base pointers are generated.  */         
*/*                                                                  */         
*/*                                                                  */         
*/* CHANGE ACTIVITY:                                                 */         
*/*                                                                  */         
*/*   $L9=DA89300, HPM7740,060719,PMBAD: Base code                   */         
*/*   $P0=MG08136,HPM7740,061005,PMBAD:                          @P0A*/         
*/*   $P1=MG08292,HPM7740,061026,PMBLB: CUINFO etc changes       @P1A*/         
*/*   $P2=MG08300,HPM7740,061027,PMBLB: clarify BMMP_LENGTH      @P2A*/         
*/*   $LA=DB22901,HPM7750,070523,PMBLB: support IDRL timestamp   @LAA*/         
*/********************************************************************/         
*%/*                                                                            
         MACRO                                                                  
      IEWBMMP  ,                                                                
*****************************                                                   
* Mapping of the module map *                                                   
*****************************                                                   
IEWBMMP            DSECT ,                                                      
BMMP_HEADER        DS  0C                                                       
BMMP_HDR1          DS  0C                                                       
BMMP_EYE_CATCHER   DS  CL8         Eyecatcher 'IEWBMMP'                         
BMMP_LENGTH        DS  F           Length including header                      
BMMP_VERSION       DS  XL1         Version Identifier                           
                   DS  XL3         Reserved - must be zero                      
BMMP_HEADER_LENGTH DS  H           Length of BMMP_HEADER                        
BMMP_ENTRY_LENGTH  DS  H           Length of one  entry                         
BMMP_ENTRY_COUNT   DS  F           Number of entries                            
BMMP_HDR1_LEN      EQU *-BMMP_HDR1                                              
BMMP_HEADER_LEN    EQU *-BMMP_HEADER                                            
BMMP_ENTRIES       DS  0CL(BMMP_ENTRY_LEN)                                      
*                                                                               
***********************************                                             
* Mapping of the module map entry *                                             
***********************************                                             
BMMP_ENTRY         DSECT ,                                                      
BMMP_TYPE          DS  CL1         Type of map entry (G/S/C/E/P)                
BMMP_FLAGS         DS  XL1                                                      
BMMP_XPLINK        EQU X'80'       XPLINK types E/P only                        
BMMP_DATA          EQU X'40'       DATA (0=CODE) types E/P only                 
BMMP_TIME          EQU X'20'       cuinfo has timestamp. version>1 only         
BMMP_AMODE         DS  XL1         amode types E/P only                         
                   ORG BMMP_AMODE                                               
BMMP_RMODE         DS  XL1         rmode type G/C only                          
                   DS  XL1         Reserved                                     
BMMP_SEGNUM        DS  H           segment number                               
BMMP_NAME_LEN      DS  H           length of name                               
BMMP_NAME_OFF      DS  F           offset of name from start                    
*                                         of map                                
BMMP_OFF           DS  F           offset of the class/element                  
BMMP_CU_INFO_OFF   DS  F           offset to compile unit info                  
*                                    from start of map. Zero if none            
BMMP_NEXT          DS  F           offset (from start of map) to                
*                                      next entry of same type                  
BMMP_ENTRY_LEN     EQU *-BMMP_ENTRY                                             
*                                                                               
***************************                                                     
* Values for BMMP_TYPE    *                                                     
***************************                                                     
BMMP_TYPE_SEGMENT  EQU C'G'                                                     
BMMP_TYPE_CLASS    EQU C'C'                                                     
BMMP_TYPE_SECTION  EQU C'S'                                                     
BMMP_TYPE_ENTRY    EQU C'E'                                                     
BMMP_TYPE_PART     EQU C'P'                                                     
*                                                                               
******************************************                                      
* Mapping of the compile unit info entry *                                      
******************************************                                      
BMMP_CU_INFO       DSECT ,                                                      
BMMP_ORIG_NAME_LEN DS  H           Length of data set name or path              
BMMP_ORIG_MEM_LEN  DS  H           Length of member name                        
BMMP_ORIG_NAME_OFF DS  F           Offset to dataset name or                    
*                                   path name from start of map                 
BMMP_ORIG_MEM_OFF  DS  F           Offset to member name                        
BMMP_TS_DATE       DS  CL7         Compile date yyyyddd                         
BMMP_FILL          DS  CL1         Reserved (if BMMP_TIME not on)  @LAA         
                   ORG BMMP_FILL                                   @LAA         
BMMP_CULEN_NOTIME  EQU *-BMMP_CU_INFO                              @LAA         
BMMP_TS_TIME       DS  CL9         Compile time hhmmssttt          @LAA         
*                                  Version >1 only                              
BMMP_END           DS  0C                                                       
BMMP_CULEN_TIME    EQU *-BMMP_CU_INFO                                           
*                                                                               
         MEND                                                                   
*********************************************************************/;         
 /*****************************/                                                
 /* Mapping of the module map */                                                
 /*****************************/                                                
                                                                                
 DECLARE                                                                        
  1 IEWBMMP BASED,                                                              
   3 BMMP_HEADER,                                                               
    5 BMMP_HDR1,                                                                
     7 BMMP_EYE_CATCHER     CHAR(8),   /* Eyecatcher 'IEWBMMP'       */         
     7 BMMP_LENGTH          FIXED(31), /* Length including header    */         
     7 BMMP_VERSION         FIXED(8),  /* Version Identifier         */         
     7 *                    CHAR(3),   /* Reserved - must be zero    */         
     7 BMMP_HEADER_LENGTH FIXED(15),   /* length of BMMP_HEADER      */         
     7 BMMP_ENTRY_LENGTH FIXED(15),    /* Length of one  entry       */         
     7 BMMP_ENTRY_COUNT    FIXED(31),  /* Number of entries          */         
   3 BMMP_ENTRIES(*)      CHAR(LENGTH(BMMP_ENTRY));                             
                                                                                
 /***********************************/                                          
 /* Mapping of the module map entry */                                          
 /***********************************/                                          
 DECLARE                                                                        
  1 BMMP_ENTRY BASED,                                                           
   3 BMMP_TYPE          CHAR(1),    /* type of map entry (G/S/C/E/P) */         
   3 BMMP_FLAGS         BIT(8),                                                 
    5 BMMP_XPLINK       BIT(1),     /* 1=XPLINK types E/P only       */         
    5 BMMP_DATA         BIT(1),     /* 1=DATA, 0=CODE types E/P only */         
    5 BMMP_TIME         BIT(1),     /* 0=no timestamp in cuinfo.                
                                       1=timestamp in cuinfo                    
                                       only valid for version>1  @LAA*/         
   3 * UNION,                                                                   
    5     BMMP_AMODE    BIT(8),     /* amode types E/P only          */         
    5     BMMP_RMODE    BIT(8),     /* rmode type G/C only           */         
   3 *                  Bit(8),     /* Reserved                      */         
   3 BMMP_SEGNUM        FIXED(15),  /* segment number                */         
   3 BMMP_NAME_LEN      FIXED(15),  /* length of name                */         
   3 BMMP_NAME_OFF      FIXED(31),  /* offset of name from start                
                                       of map                        */         
   3 BMMP_OFF           FIXED(31),  /* offset of the class/element   */         
   3 BMMP_CU_INFO_OFF   FIXED(31),  /* offset to compile unit info              
                                     from start of map. Zero if none */         
   3 BMMP_NEXT          FIXED(31);  /* offset (from start of map) to            
                                       next  entry of same type      */         
                                                                                
 /************************/                                                     
 /* Values for BMMP_TYPE */                                                     
 /************************/                                                     
    DECLARE                                                                     
        BMMP_TYPE_SEGMENT Constant('G'),                                        
        BMMP_TYPE_CLASS   Constant('C'),                                        
        BMMP_TYPE_SECTION Constant('S'),                                        
        BMMP_TYPE_ENTRY   Constant('E'),                                        
        BMMP_TYPE_PART    Constant('P');                                        
                                                                                
 /******************************************/                                   
 /* Mapping of the compile unit info entry */                                   
 /******************************************/                                   
 DECLARE                                                                        
  1 BMMP_CU_INFO BASED,                                                         
   3 BMMP_CU_INFO_NOTIME,                                         ]@LAA         
    5 BMMP_ORIG_NAME_LEN Fixed(15), /* length of data set name or path          
                                       name */                   ]@LAC          
    5 BMMP_ORIG_MEM_LEN Fixed(15),  /* length of                                
                                      member name */              ]@LAC         
    5 BMMP_ORIG_NAME_OFF Fixed(31),  /* offset to dataset name or               
                                     path name from map start    @LAC*/         
    5 BMMP_ORIG_MEM_OFF Fixed(31),   /* offset to member name    @LAC*/         
    5 BMMP_TS_DATE     Char(7),      /* Compile date yyyyddd     @LAC*/         
   3 BMMP_TS_TIME     Char(9);      /* compile time hhmmssttt    @LAA*/         
                                                                                
 DECLARE BMMP_CULEN_NOTIME  FIXED(31)                                           
                          CONSTANT(LENGTH(BMMP_CU_INFO_NOTIME));  ]@LAA         
 DECLARE BMMP_CULEN_TIME  FIXED(31)                                             
                          CONSTANT(LENGTH(BMMP_CU_INFO));         ]@LAA         
