*/********************************************************************          
* BILINGUAL MACRO IEWBFZP                                            *          
*                                                                    *          
* $MAC(IEWBFZP) COMP(PMB01):                                         *          
*                                                                    *          
* INCLUDE NAME: IEWBFZP                                              *          
*                                                                    *          
* DESCRIPTIVE-NAME: FAST DATA ACCESS UTILITY ENTRY POINT DEFINITION  *          
*                   AND EXTERNAL REASON CODES                        *          
*                                                                    *          
* STATUS: HPM7790                                                    *          
*                                                                    *          
*PROPRIETARY V3 STATEMENT                                            *          
*LICENSED MATERIALS - PROPERTY OF IBM                                *          
*5650-ZOS                                                            *          
*COPYRIGHT IBM CORP. 1995, 2013                                      *          
*END PROPRIETARY V3 STATEMENT                                        *          
*                                                                    *          
* FUNCTION:  PROVIDES ENTRY POINT DECLARATION AND REASON CODES       *          
*            USED BY THE FAST DATA ACCESS UTILITY MODULE             *          
*                                                                    *          
* NOTES:                                                             *          
*   DEPENDENCIES: NONE                                               *          
*   RESTRICTIONS: NONE                                               *          
*                                                                    *          
* MACRO TYPE: MAPPING                                                *          
*                                                                    *          
*   PROCESSOR:  PL/X                                                 *          
*   DISTRIBUTION LIBRARY:                                            *          
*                                                                    *          
* CHANGE ACTIVITY:                                                   *          
*                                                                    *          
*   $L0=PMBINDER,HDZ11C0,931015,SJSPSL:  BASE CODE                   *          
*   $01=OW30712,HDZ11D0,980115,SJSPEA:  ADD SYSTEMDCB           @01A *          
*   $P0=K160769,HDZ11F0,991116,STLMD :  UPDATE PROLOG           @P0A *          
*   $L1=PM4ITER2,HPMB110,000906,SJPLPFB: 32K NAME SUPPORT       @L1A *          
*   $L2=PM4ITER3,HPMB110,010328,SVLNW: HFS SUPPORT              @L2A *          
*   $P1=K6401133,HPMB110,010516,SVLNW: DUPLICATE MESSAGE(3B)    @P1A *          
*   $L3=DCRA598,HPM7709,020415,SVLEA: SUPPORT CDA               @L3A *          
*   $02=OW54319,HPM7709,021030,SJSPEA:  ADD DESERV RELEASE RSNS @02A *          
*   $03=OA13150,HPM7730,050110,PMBLB:   BAD CURSOR PARTINIT     @03A *          
*   $L4=DB04200,HPM7740,060522,PMBRT: REWRITE                   @L4A *          
*   $P2=MG07766,HPM7740,060829,PMBRT: SHOW CODES ACTUALLY       @P2A *          
*                                     ISSUED AS OF ZOS 1.9      @P2A *          
*   $P3=OA40086,HPM7790,121121,PMBST: ADD NOT-EDITABLE RSNCODE  @P3A *          
*                                                                    *          
*****END OF SPECIFICATIONS *******************************************          
******************************************************************              
* RETURN CODE 0                                                  *              
******************************************************************              
FDAT_RSNC_OK                  DC   X'00000000'                                  
FDXT_RSNC_OK                  DC   X'00000000'                                  
******************************************************************              
* RETURN CODE 4                                                  *              
******************************************************************              
FDAT_BUFFER_IS_FULL           DC   X'10800001'                                  
FDAT_END_OF_DATA              DC   X'10800002'                                  
*DAT_RELEASE_DCB_NOT_OPEN  CANNOT OCCUR AS OF Z/OS 1.9         @P2D             
*DXT_BUFFER_FULL           NEVER SEEN EXTERNALLY               @P2D             
******************************************************************              
* RETURN CODE 8                                                  *              
******************************************************************              
FDAT_NO_DATA_OF_SUCH_CLASS    DC   X'10800010'                                  
FDAT_INCORRECT_SECTION_NAME   DC   X'10800011'                                  
FDAT_INVALID_NTYPE_VALUE      DC   X'10800061' ]@L3A                            
FDAT_NO_SECTION_NAMES         DC   X'10800062' ]@L3A                            
FDAT_INVALID_CULIST_REQUESTED DC   X'10800064'                @P2M              
******************************************************************              
* RETURN CODE 12                                                 *              
******************************************************************              
FDAT_EPTOKEN_NOT_FOUND        DC   X'10800020'                                  
FDAT_MEMBER_NOT_FOUND         DC   X'10800021'                                  
FDAT_BUFFER_TOO_SMALL         DC   X'10800022'                                  
FDAT_INCORRECT_PARM_ADDR      DC   X'10800023'                                  
FDAT_INCORRECT_MTOKEN         DC   X'10800024'                                  
FDAT_INCORRECT_BUFFER_LENGTH  DC   X'10800025'                                  
FDAT_INCORRECT_CLASS_NAME     DC   X'10800026'                                  
FDAT_INCORRECT_CURSOR_VALUE   DC   X'10800027'                                  
FDAT_INCORRECT_HOLD_VALUE     DC   X'10800028'                                  
FDAT_INCORRECT_SDCB_VALUE     DC   X'1080003B'                ]@01A             
FDAT_INCORRECT_PROGOBJ_FMT    DC   X'10800029'                                  
FDAT_INCORRECT_MODULE_VERSION DC   X'1080002A'                                  
FDAT_MEMBER_NOT_DFP_FETCHED   DC   X'1080002B'                                  
FDAT_DSET_NOT_ALLOCATED       DC   X'1080002C'                                  
FDAT_DSET_NOT_POLIB           DC   X'1080002D'                                  
FDAT_OPEN_ERROR               DC   X'1080002E'                                  
FDAT_STORAGE_ERROR            DC   X'1080002F'                                  
FDAT_CSVQUERY_ERROR           DC   X'10800030'                                  
FDAT_IEWBXILO_ERROR           DC   X'10800031'                                  
FDAT_DESERV_ERROR             DC   X'10800032'                                  
FDAT_DCB_NOT_YET_OPEN         DC   X'10800036'                                  
FDAT_INCORRECT_DCB_PARMS      DC   X'10800037'                                  
FDAT_SMDE_NOT_FOR_PROGOBJ     DC   X'10800038'                                  
FDAT_INCORRECT_BUFF_VERSION   DC   X'10800039'                                  
FDAT_INCORRECT_BUFF_CLASS     DC   X'1080003A'                                  
*DAT_CLOSE_ERROR           CANNOT OCCUR AS OF Z/OS 1.9        @P2D              
FDAT_INVALID_DIRECTORY        DC   X'1080003D'               ]@P1C              
FDAT_INVALID_FILE             DC   X'1080003E'               ]@P1C              
FDAT_INVALID_PATH             DC   X'1080003F'               ]@P1C              
FDAT_PATH_TOO_LONG            DC   X'10800040'               ]@P1C              
FDAT_READ_ACCESS_DENIED       DC   X'10800041'               ]@P1C              
FDAT_READ_ERROR               DC   X'10800042'               ]@P1C              
FDAT_NOT_EDITABLE_ERROR       DC   X'10800043'               ]@P3A              
*DAT_DESERV_RELEASE_ERROR  CANNOT OCCUR AS OF Z/OS 1.9        @P2D              
FDAT_INVALID_INTERFACE_VALUE  DC   X'10800063'               ]@L3A              
*                                                             @P2D              
FDAT_BAD_CURSOR_PARTINIT      DC   X'10800065'                @P2A              
*DXT_BAD_CURSOR_PARTINIT   RENAMED TO ENTRY JUST ABOVE        @P2D              
FDAT_LOGIC_ERROR              DC   X'10800066'                @L4A              
********************************************************************            
* OBSOLETE - NO LONGER RETURNED                               @L4C *            
********************************************************************            
FDAT_DSPSERV_ERROR            DC   X'10800033'                @L4M              
FDAT_ALESERV_ERROR            DC   X'10800034'                @L4M              
FDAT_DCB_NOT_FOR_POLIB        DC   X'10800035'                @L4M              
FDAT_CLOSE_ERROR              DC   X'1080003C'                @P2M              
FDAT_RELEASE_DCB_NOT_OPEN     DC   X'10800050'                @P2M              
FDAT_DESERV_RELEASE_ERROR     DC   X'10800052'                @P2M              
FDAT_CULIST_NOT_SPECIFIED     DC   X'10800060'                @L4M              
FDXT_BAD_CURSOR_PARTINIT      DC   X'10800065' RENAMED, FDAT_ @P2M              
FDXT_BUFFER_FULL              DC   X'10820001'                @P2M              
FDXT_STORAGE_FAILED           DC   X'10820002'                @L4M              
FDXT_INVALID_CLASS_NAME       DC   X'10820003'                @L4M              
**/                                                          ]@L4C              
*                                                                               
*/*******************************************************************/          
*/*                                                                 */          
*/*   IEWBFDAT EXTERNAL REASON CODES                                */          
*/*                                                                 */          
*/*******************************************************************/          
* DCL                                                                           
*  /*****************************************************************/          
*  /* RETURN CODE 0                                                 */          
*  /*****************************************************************/          
*  FDAT_RSNC_OK                          BIT(32) CONSTANT('00000000'X),         
*  FDXT_RSNC_OK                          BIT(32) CONSTANT('00000000'X),         
*  /*****************************************************************/          
*  /* RETURN CODE 4                                                 */          
*  /*****************************************************************/          
*  FDAT_BUFFER_IS_FULL                   BIT(32) CONSTANT('10800001'X),         
*  FDAT_END_OF_DATA                      BIT(32) CONSTANT('10800002'X),         
*                                                                ]2@P2D         
*  /*****************************************************************/          
*  /* RETURN CODE 8                                                 */          
*  /*****************************************************************/          
*  FDAT_NO_DATA_OF_SUCH_CLASS            BIT(32) CONSTANT('10800010'X),         
*  FDAT_INCORRECT_SECTION_NAME           BIT(32) CONSTANT('10800011'X),         
*  FDAT_NO_SECTION_NAMES           BIT(32) CONSTANT('10800062'X), ]@P2M         
*  FDAT_INVALID_INTERFACE_VALUE    BIT(32) CONSTANT('10800063'X), ]@P2M         
*  FDAT_INVALID_CULIST_REQUESTED   BIT(32) CONSTANT('10800064'X), ]@P2M         
*  /*****************************************************************/          
*  /* RETURN CODE 12                                                */          
*  /*****************************************************************/          
*  FDAT_EPTOKEN_NOT_FOUND                BIT(32) CONSTANT('10800020'X),         
*  FDAT_MEMBER_NOT_FOUND                 BIT(32) CONSTANT('10800021'X),         
*  FDAT_BUFFER_TOO_SMALL                 BIT(32) CONSTANT('10800022'X),         
*  FDAT_INCORRECT_PARM_ADDR              BIT(32) CONSTANT('10800023'X),         
*  FDAT_INCORRECT_MTOKEN                 BIT(32) CONSTANT('10800024'X),         
*  FDAT_INCORRECT_BUFFER_LENGTH          BIT(32) CONSTANT('10800025'X),         
*  FDAT_INCORRECT_CLASS_NAME             BIT(32) CONSTANT('10800026'X),         
*  FDAT_INCORRECT_CURSOR_VALUE           BIT(32) CONSTANT('10800027'X),         
*  FDAT_INCORRECT_HOLD_VALUE             BIT(32) CONSTANT('10800028'X),         
*  FDAT_INCORRECT_SDCB_VALUE             BIT(32) CONSTANT('1080003B'X),         
*  FDAT_INCORRECT_PROGOBJ_FMT            BIT(32) CONSTANT('10800029'X),         
*  FDAT_INCORRECT_MODULE_VERSION         BIT(32) CONSTANT('1080002A'X),         
*  FDAT_MEMBER_NOT_DFP_FETCHED           BIT(32) CONSTANT('1080002B'X),         
*  FDAT_DSET_NOT_ALLOCATED               BIT(32) CONSTANT('1080002C'X),         
*  FDAT_DSET_NOT_POLIB                   BIT(32) CONSTANT('1080002D'X),         
*  FDAT_OPEN_ERROR                       BIT(32) CONSTANT('1080002E'X),         
*  FDAT_STORAGE_ERROR                    BIT(32) CONSTANT('1080002F'X),         
*  FDAT_CSVQUERY_ERROR                   BIT(32) CONSTANT('10800030'X),         
*  FDAT_IEWBXILO_ERROR                   BIT(32) CONSTANT('10800031'X),         
*  FDAT_DESERV_ERROR                     BIT(32) CONSTANT('10800032'X),         
*                                                              ]3@L4D           
*  FDAT_DCB_NOT_YET_OPEN                 BIT(32) CONSTANT('10800036'X),         
*  FDAT_INCORRECT_DCB_PARMS              BIT(32) CONSTANT('10800037'X),         
*  FDAT_SMDE_NOT_FOR_PROGOBJ             BIT(32) CONSTANT('10800038'X),         
*  FDAT_INCORRECT_BUFF_VERSION           BIT(32) CONSTANT('10800039'X),         
*  FDAT_INCORRECT_BUFF_CLASS             BIT(32) CONSTANT('1080003A'X),         
*                                                               ]@P2D           
*  FDAT_INVALID_DIRECTORY                BIT(32) CONSTANT('1080003D'X),         
*  FDAT_INVALID_FILE                     BIT(32) CONSTANT('1080003E'X),         
*  FDAT_INVALID_PATH                     BIT(32) CONSTANT('1080003F'X),         
*  FDAT_PATH_TOO_LONG                    BIT(32) CONSTANT('10800040'X),         
*  FDAT_READ_ACCESS_DENIED               BIT(32) CONSTANT('10800041'X),         
*  FDAT_READ_ERROR                       BIT(32) CONSTANT('10800042'X),         
*  FDAT_NOT_EDITABLE_ERROR       BIT(32) CONSTANT('10800043'X), ]@P3A           
*                                                               ]@P2D           
*                                                               ]@L4D           
*  FDAT_INVALID_NTYPE_VALUE              BIT(32) CONSTANT('10800061'X),         
*                                                              ]3@P2D           
*  FDAT_BAD_CURSOR_PARTINIT      BIT(32) CONSTANT('10800065'X), ]@P2C           
*  FDAT_LOGIC_ERROR              BIT(32) CONSTANT('10800066'X), ]@L4A           
*  /******************************************************************/         
*  /* QDXT - INTERNAL ONLY                                       @L4C*/         
*  /******************************************************************/         
*  FDXT_BAD_CURSOR_PARTINIT      BIT(32) CONSTANT('10800065'X), ]@P2M           
*  FDXT_BUFFER_FULL              BIT(32) CONSTANT('10820001'X), ]@P2M           
*  FDXT_STORAGE_FAILED                   BIT(32) CONSTANT('10820002'X),         
*  FDXT_INVALID_CLASS_NAME               BIT(32) CONSTANT('10820003'X);         
