*/********************************************************************/         
*/*                                                                  */         
*/*  $MAC(IEWBLIT)  COMP(PMB01):                                     */         
*/*                                                                  */         
*/*  INCLUDE NAME: IEWBLIT                                           */         
*/*                                                                  */         
*/*  DESCRIPTIVE NAME:  Loader Information Table                     */         
*/*                                                                  */         
*/*  STATUS: HPM77B0                                                 */         
*/*                                                                  */         
*/*PROPRIETARY V3 STATEMENT                                          */         
*/*LICENSED MATERIALS - PROPERTY OF IBM                              */         
*/*5650-ZOS                                                          */         
*/*COPYRIGHT IBM CORP. 1996, 2017                                    */         
*/*END PROPRIETARY V3 STATEMENT                                      */         
*/*                                                                  */         
*/*                                                                  */         
*/* FUNCTION:  PROVIDES THE MAPPING FOR A BINDER-GENERATED           */         
*/*           LOADER INFORMATION TABLE.                              */         
*/*                                                                  */         
*/* NOTES:                                                           */         
*/*                                                                  */         
*/*   BLITs are only stored in program objects, and are present  @P5A*/         
*/*   only when multiple text classes exist.                     @P5A*/         
*/*                                                                  */         
*/*   The offset of the BLIT within the loaded segment is        @P5A*/         
*/*   available in PMARL_IEWBLITO if PMARL_IEWBLITP is set.      @P5A*/         
*/*   Both of these fields are in the PMAR at the beginning of   @P5A*/         
*/*   every program object, and are mapped by IEWPMAR.           @P5A*/         
*/*                                                                  */         
*/*   This mapping is used by LE (language Environment) which is     */         
*/*   dependent on compatible changes to the mapping.                */         
*/*                                                                  */         
*/*   Add BLIT_HEADER_LENGTH to the address of BLIT_HEADER to        */         
*/*   determine the address of the first entry.                      */         
*/*   If you used to use BLIT_CTABLE to locate the first entry,      */         
*/*   please use the approach above.                                 */         
*/*                                                                  */         
*/*   Add BLIT_CENTRY_LENGTH to the address of an entry to get the   */         
*/*   address of the next entry.                                     */         
*/*   If you used to use BLIT_CTABLE_ENTRY_LEN to locate the next    */         
*/*   entry, please use the approach above.                          */         
*/*                                                                  */         
*/* MACRO TYPE: MAPPING                                              */         
*/*                                                                  */         
*/*   PROCESSOR:  Bilingual, Assembler and PL/X                  @P5C*/         
*/*   DISTRIBUTION LIBRARY:  SYS1.MACLIB                         @P5C*/         
*/*                                                                  */         
*/* INVOCATION, Assembler:                                       @P5A*/         
*/*         IEWBLIT ,                                            @P5A*/         
*/*   Two DSECTs will always be generated, one named IEWBLIT     @P5A*/         
*/*   and the other BLIT_CTABLE_ENTRY.                           @P5A*/         
*/*   The previous DSECT/CSECT environment will not be resumed.  @P5A*/         
*/*                                                                  */         
*/* INVOCATION, PL/X:                                            @P5C*/         
*/*  %BLITBASE='':                                                   */         
*/*  %BLITENTBASE='':                                                */         
*/*  INCLUDE SYSLIB(IEWBLIT):                                        */         
*/*                                                                  */         
*/*   By default, the IEWBLIT header is based on BLIT_PTR and        */         
*/*   the BLIT_CTABLE_ENTRY is based on BLIT_ENTRY_PTR with          */         
*/*   both pointers declared.                                        */         
*/*   If other basing is desired, use %BLITBASE='BASED(XXXXXX)'      */         
*/*   and %BLITENTBASE='BASED(YYYYYY)'                               */         
*/*   If %BLITBASE='BASED(BLIT_ptr)' is coded, a Declare for         */         
*/*   BLIT_PTR is also generated.                                    */         
*/*   If %BLITENTBASE='BASED(BLIT_ENTRY-ptr)' is coded, a Declare    */         
*/*   for BLIT_ENTRY_PTR is also generated.                          */         
*/*                                                                  */         
*/* CHANGE ACTIVITY:                                                 */         
*/*                                                                  */         
*/*   $L0=PM3ITER1,HDZ11C0,960110,SJSPSL:  BASE CODE                 */         
*/*   $L1=PM3ITER2,HDZ11C0,961002,SJPCLB:  BLIT_NOLOAD               */         
*/*   $L2=XPLINK ,HDZ11F0,980708,SJPCLB:  HPLINK                     */         
*/*   $P0=XPLINK ,HDZ11F0,990826,STLLB: change HPLINK to XPLINK      */         
*/*   $P1=K160769,HDZ11F0,991117,STLMD: UPDATE PROLOG            @P1A*/         
*/*   $P2=K161091,HDZ11F0,000202,STLLB: CMVC defect 149881       @P2A*/         
*/*                                     WSA eyecatcher           @P2A*/         
*/*   $L3=PM4ITER2,HPMB110,000622,STLLB: PM4 driver 2            @L3A*/         
*/*   $L4=PM4ITER3,HPMB110,010414,STLLB: PM4 driver 3            @L4A*/         
*/*   $L5=DCRA599 ,HPM7709,020718,SVLLB: rmode 64                @L5A*/         
*/*   $P4=MG01131 ,HPM7709,020827,SVLLB: prolog cleanup          @P4A*/         
*/*   $P5=MG01825 ,HPM7708,030228,SVLRT: Make macro bilingual    @P5A*/         
*/*   $P6=MG05772 ,HPM7730,050504,PMBRT: Correct RMODE EQUates   @P6A*/         
*/*   $P7=MG07027 ,HPM7740,060526,PMBRT: Add eyecatchr macro var @P7A*/         
*/*   $L6=DB22900 ,HPM7750,070418,PMBNW: loadable C classes      @L6A*/         
*/*   $P8=MG10782 ,HPM7760,080523,PMBLB: fix @L6                 @P8A*/         
*/*   $L7=DC07504 ,HPM7790,110215,PMBLB: update alignments       @L7A*/         
*/*   $P9=WI157747,HPM77B0,170209,PMBIY:  SEVERAL RMODE64 FIXES  @P9A*/         
*/********************************************************************/         
*%/*                                                                            
.*            Entire assembler expansion added by                @P5A           
         MACRO                                                                  
      IEWBLIT  ,                                                                
         GBLC  BLIT_EYE_CATCH_ID                                                
IEWBLIT  DSECT ,                                                                
BLIT_HEADER         DS  0C                                                      
*                                                                               
BLIT_HDR1           DS  0C                                                      
BLIT_EYE_CATCHER    DS  CL8    Eyecatcher 'IEWBLIT '                            
&BLIT_EYE_CATCH_ID SETC 'IEWBLIT'                                @P7A           
BLIT_LENGTH         DS  F      Length including header and all                  
*                                class entries                                  
BLIT_VERSION        DS  X      Version Identifier                               
BLIT_VERSION_NUM    EQU X'01'                                                   
                    DS  CL3    Reserved - must be zero                          
BLIT_HEADER_LENGTH  DS  F      Length of BLIT_HEADER                            
BLIT_CENTRY_LENGTH  DS  F      Length of one class entry in the                 
*                                class entry table                              
BLIT_CENTRY_COUNT   DS  F      Number of entries in class entry table           
BLIT_DEFER_COUNT    DS  F      Number of entries for deferred                   
*                              classes in class entry table                     
BLIT_HDR1_LEN       EQU *-BLIT_HDR1                                             
*                                                                               
BLIT_HDR2           DS  0C                                                      
                    DS  CL8    reserved                                         
BLIT_LOADER_TOKEN   DS  CL8    The Loader token                                 
BLIT_CIE_ADDR       DS  A      Address of B_IMPEXP                              
BLIT_MOD_ATTR       DS  0BL4   Program attributes                               
BLIT_MOD_ATTR1      DS  B                                                       
BLIT_XPLINK         EQU X'80'    Module has XPLink contents                     
BLIT_LIGHTWEIGHT_LE EQU X'40'    Lightweight LE environment                     
BLIT_SYSTEM_LE      EQU X'20'    System LE environment                          
BLIT_LC_CLASSES     EQU X'18'     Loadable C_classes             @P8A           
                    DS  3B                                                      
                    DS  CL8    Reserved                                         
BLIT_HDR2_LEN       EQU *-BLIT_HDR2                                             
BLIT_HEADER_LEN     EQU *-BLIT_HEADER                                           
*                                                                               
*BLIT_CTABLE was removed. Add BLIT_HEADER_LENGTH to the address of              
*BLIT_HEADER to determine the address of the first entry.        @P9D           
*******************************************************************             
*                                                                 *             
*   TABLE ENTRY MAPPING                                           *             
*                                                                 *             
*******************************************************************             
BLIT_CTABLE_ENTRY  DSECT ,                                                      
BLIT_COMMON          DS  0D    All versions                     @P9A            
BLIT_CLASS_NAME      DS  CL16  Name of the class                                
BLIT_CLASS_LENGTH    DS  F     Length of class (after load)                     
BLIT_CLASS_ADDR      DS  A     Address of class in storage                      
*                              (zero for deferred classes).                     
*                              If BLIT_V2_CLASS_ADDR64_HIGH                     
*                              is not zero then                                 
*                              BLIT_V2_CLASS_ADDR64 must                        
*                              be used instead.                 @P9A            
BLIT_CLASS_ATTR      DS  0CL8  Class attributes                                 
BLIT_RMODE           DS  X       Residence mode of class                        
BLIT_RMODE_UNSPEC    EQU X'00'                                                  
BLIT_RMODE_24        EQU X'01'                                                  
BLIT_RMODE_ANY       EQU X'03'                                 @P6C             
BLIT_RMODE_64        EQU X'04'                                 @P6C             
BLIT_ALIGN           DS  X       Class alignment in storage                     
BLIT_DOUBLE_WORD     EQU X'03'                                                  
BLIT_QUAD_WORD       EQU X'04'                                                  
BLIT_PAGE            EQU X'0C'                                                  
BLIT_LOAD_ATTR       DS  B       Class load attributes                          
BLIT_RO              EQU X'80'     Read Only                                    
BLIT_TLOAD           EQU X'60'     Time of load                                 
*                                    Both bits off: Initial Load                
BLIT_NOLOAD          EQU X'40'       Do not load with module                    
BLIT_DEFER           EQU X'20'       Deferred load                              
BLIT_LOAD_ON_REQUEST EQU X'60'       Not currently supported                    
*                                                                               
BLIT_LANG_ATTR       DS  B       Class language attributes                      
BLIT_PADDING         EQU X'80'     16 bytes reserved at start of                
*                                    class                                      
*                                                                  @P8D         
                     DS  XL4     Reserved -- must be zero                       
BLIT_V2_EXT          DS  0D    Version 2+ extensions               @P9A         
BLIT_V2_CLASS_ADDR64 DS  AD    Address of class in storage.        @P9A         
                     ORG BLIT_V2_CLASS_ADDR64                      @P9A         
BLIT_V2_CLASS_ADDR64_HIGH DS CL4                                   @P9A         
BLIT_V2_CLASS_ADDR64_LOW  DS CL4                                   @P9A         
*                                                                               
*BLIT_CTABLE_ENTRY_LEN was removed. Use BLIT_CENTRY_LENGTH instead.@P9D         
         MEND                                                                   
*********************************************************************/;         
 %DCL BLITBASE CHAR EXTERNAL;                                                   
 %DCL BLITENTBASE CHAR EXTERNAL;                                                
                                                                                
 %IF BLITBASE='' %THEN                                                          
     %BLITBASE='BASED(BLIT_PTR)';                                               
 %IF TRANSLATE(BLITBASE) ='BASED(BLIT_PTR)' %THEN                               
     %DO;                                                                       
     DCL BLIT_PTR  PTR(31);                                                     
     %END;                                                                      
 %IF BLITENTBASE='' %THEN                                                       
     %BLITENTBASE='BASED(BLIT_ENTRY_PTR)';                                      
 %IF TRANSLATE(BLITENTBASE) ='BASED(BLIT_ENTRY_PTR)' %THEN                      
     %DO;                                                                       
     DCL BLIT_ENTRY_PTR  PTR(31);                                               
     %END;                                                                      
 /*******************************************************************/          
 /*                                                                 */          
 /*   LOADER INFORMATION MAPPING                                    */          
 /*                                                                 */          
 /*******************************************************************/          
  DECLARE                                                                       
  1 IEWBLIT BLITBASE,                                                           
     3 BLIT_HEADER,                                                             
      5 BLIT_HDR1,                                                              
       7 BLIT_EYE_CATCHER   CHAR(8),   /* Eyecatcher 'IEWBLIT '     */          
       7 BLIT_LENGTH        FIXED(31), /* Length including header               
                                          and all class entries     */          
       7 BLIT_VERSION       FIXED(8),  /* Version Identifier        */          
       7 *                  CHAR(3),   /* Reserved - must be zero   */          
       7 BLIT_HEADER_LENGTH FIXED(31), /* length of BLIT_HEADER     */          
       7 BLIT_CENTRY_LENGTH FIXED(31), /* Length of one class entry             
                                          in the class entry table  */          
       7 BLIT_CENTRY_COUNT  FIXED(31), /* Number of entries in the              
                                          class entry table         */          
       7 BLIT_DEFER_COUNT   FIXED(31), /* Number of entries for                 
                                          deferred classes in                   
                                          class entry table         */          
      5 BLIT_HDR2,                                                              
       7 *                  CHAR(8),    /* reserved                 */          
       7 BLIT_LOADER_TOKEN  CHAR(8),   /* The Loader token          */          
       7 BLIT_CIE_ADDR      PTR,       /* address of B_IMPEXP       */          
       7 BLIT_MOD_ATTR      BIT(32),   /*                       @L2A*/          
         9 BLIT_XPLINK      BIT(1),    /* module has XPLink contents            
                                                                @P0C*/          
         9 BLIT_LIGHTWEIGHT_LE BIT(1), /* lightweight LE environ@L3A*/          
         9 BLIT_SYSTEM_LE BIT(1),      /* system LE environment @L3A*/          
         9 BLIT_LC_CLASSES BIT(2),   /* Loadable C_classes      @P8A*/          
       7 *                  CHAR(8);   /* reserved              @L2C*/          
 /*BLIT_CTABLE was removed. Add BLIT_HEADER_LENGTH to the address of            
   BLIT_HEADER to determine the address of the first entry.     @P9D*/          
 /*******************************************************************/          
 /*                                                                 */          
 /*   TABLE ENTRY MAPPING                                           */          
 /*                                                                 */          
 /*******************************************************************/          
  DECLARE                                                                       
   1 BLIT_CTABLE_ENTRY BLITENTBASE,                                             
    2 BLIT_COMMON,                   /* All versions.          @P9A */          
     3 BLIT_CLASS_NAME     CHAR(16), /* Name of the class           */          
     3 BLIT_CLASS_LENGTH   FIXED(31),/* Length of class (after load)*/          
     3 BLIT_CLASS_ADDR     PTR(31),  /* Address of class in storage             
                                        (zero for deferred classes).            
                                        If BLIT_V2_CLASS_ADDR64_HIGH            
                                        is not zero then                        
                                        BLIT_V2_CLASS_ADDR64 must               
                                        be used instead.       @P9A */          
     3 BLIT_CLASS_ATTR     CHAR(8),  /* Class attributes            */          
       5 BLIT_RMODE        FIXED(8), /* Residence mode of class     */          
       5 BLIT_ALIGN        FIXED(8), /* Class alignment in storage  */          
       5 BLIT_LOAD_ATTR    BIT(8),   /* Class load attributes       */          
         7 BLIT_RO         BIT(1),   /* Read Only                   */          
         7 BLIT_TLOAD      BIT(2),   /* Time of load                */          
                                     /* '00'B - Initial Load        */          
                                     /* '01'B - Deferred Load       */          
                                     /* '10'B - No Load             */          
           9 BLIT_NOLOAD     BIT(1), /* Do not load with module     */          
           9 BLIT_DEFER      BIT(1), /* Deferred load               */          
         7 *               BIT(5),   /* Reserved -- must be zero    */          
       5 BLIT_LANG_ATTR    CHAR(1),  /*                         @P6C*/          
         7 BLIT_PADDING    BIT(1),   /* padding (eyecatche) at start            
                                        of class                @P2A*/          
                                                                  ]@P8D         
       5 *                 CHAR(4),  /* Reserved -- must be zero@P3C*/          
    2 BLIT_V2_EXT,                   /* Version 2+ extensions   @P9A */         
     3 BLIT_V2_CLASS_ADDR64 PTR(64), /* Address of class in storage.            
                                        This is zero for deferred               
                                        classes.                @P9A */         
       5 BLIT_V2_CLASS_ADDR64_HIGH CHAR(4),                    ]@P9A            
       5 BLIT_V2_CLASS_ADDR64_LOW  CHAR(4);                    ]@P9A            
                                                                                
  /******************************************************************/          
  /* Definitions for constants                                      */          
  /******************************************************************/          
  /*  Header constants                                              */          
  DECLARE BLIT_EYE_CATCH_ID CHAR(8)  CONSTANT('IEWBLIT ');                      
  DECLARE BLIT_VERSION1_NUM  FIXED(8) CONSTANT(1);             ]@P9C            
  DECLARE BLIT_VERSION2_NUM  FIXED(8) CONSTANT(2);             ]@P9A            
                                                                                
  /* Residence Mode constants                                        */         
  DECLARE BLIT_RMODE_UNSPEC    FIXED(8) CONSTANT(0);                            
  DECLARE BLIT_RMODE_24        FIXED(8) CONSTANT(1);                            
  DECLARE BLIT_RMODE_ANY       FIXED(8) CONSTANT(3);                            
  DECLARE BLIT_RMODE_64        FIXED(8) CONSTANT(4);              ]@L5A         
                                                                                
  /* Alignment constants                                             */         
  DECLARE BLIT_BYTE  FIXED(8) CONSTANT(0);                        ]@L7A         
  DECLARE BLIT_HALF_WORD FIXED(8) CONSTANT(1);                    ]@L7A         
  DECLARE BLIT_FULL_WORD FIXED(8) CONSTANT(2);                    ]@L7A         
  DECLARE BLIT_DOUBLE_WORD  FIXED(8) CONSTANT(3);                               
  DECLARE BLIT_QUAD_WORD  FIXED(8) CONSTANT(4);                   ]@L4A         
  DECLARE BLIT_32        FIXED(8) CONSTANT(5);                    ]@L7A         
  DECLARE BLIT_64        FIXED(8) CONSTANT(6);                    ]@L7A         
  DECLARE BLIT_128       FIXED(8) CONSTANT(7);                    ]@L7A         
  DECLARE BLIT_256       FIXED(8) CONSTANT(8);                    ]@L7A         
  DECLARE BLIT_512       FIXED(8) CONSTANT(9);                    ]@L7A         
  DECLARE BLIT_1024      FIXED(8) CONSTANT(10);                   ]@L7A         
  DECLARE BLIT_2048      FIXED(8) CONSTANT(11);                   ]@L7A         
  DECLARE BLIT_PAGE         FIXED(8) CONSTANT(12);                              
                                                                                
  /* Time of load (BLIT_TLOAD)                                       */         
  DECLARE BLIT_INITIAL_LOAD BIT(2) CONSTANT('00'B);                             
  DECLARE BLIT_DEFERRED_LOAD BIT(2) CONSTANT('01'B);                            
  DECLARE BLIT_NEVER_LOAD BIT(2) CONSTANT('10'B);              /*@L1A*/         
  /* load on request is not supported by the loader in this release  */         
  DECLARE BLIT_LOAD_ON_REQUEST BIT(2) CONSTANT('11'B);                          
                                                                                
  /* Class names                                                     */         
  DECLARE BLIT_WSA CHAR(16) CONSTANT('C_WSA           ');                       
                                                                                
  /* Loadable C classes (BLIT_LC_CLASSES)                        @L6A*/         
  DECLARE BLIT_UNK_C_CLASS BIT(2) CONSTANT('00'B);             /*@L6A*/         
  DECLARE BLIT_NO_C_CLASS BIT(2) CONSTANT('10'B);              /*@L6A*/         
  DECLARE BLIT_C_CLASS BIT(2) CONSTANT('11'B);                 /*@L6A*/         
                                                                                
