*%DCL IEWPMAR_INCLUDE CHAR EXTERNAL;                                    00010000
*%IF IEWPMAR_INCLUDE ^= 'DONE' %THEN %DO;                               00020000
*%IEWPMAR_INCLUDE = 'DONE';                                             00030000
*                                                                       00040000
*%GOTO IEWPMAR_1;                                                       00050000
         MACRO                                                          00060000
         IEWPMAR &DSECT=YES                                             00070000
*%IEWPMAR_1:;                                                           00071000
*/* START OF SPECIFICATIONS ******************************************* 00080000
**01* PROPRIETARY_STATEMENT******************************************** 00090000
**                                                                    * 00100000
** LICENSED MATERIALS - PROPERTY OF IBM                               * 00110000
** 5650-ZOS COPYRIGHT IBM CORP. 1991, 2019                            * 00120000
**                                                                    * 00130000
** STATUS= HBB77C0                                                    * 00140000
**                                                                    * 00150000
****END_OF_PROPRIETARY_STATEMENT*************************************** 00160000
**                                                                    * 00170000
**01* EXTERNAL CLASSIFICATION:                                        * 00180000
**01* PI:    BASE                                                     * 00190000
**01* NOTPI: FIELDS                                                   * 00200000
**           PMARL_MPGS PMARL_MDAT PMARL_TXTL PMARL_TXTO              * 00210000
**           PMARL_BDRL PMARL_BDRO PMARL_RDTL PMARL_RDTO              * 00220000
**           PMARL_RATL PMARL_RATO PMARL_NVSPGS PMAR_XATTR1           * 00230000
**           PMARL_LMDL PMARL_LMDO PMARL_NSEG PMARL_NGAS              * 00240000
**           PMARL_1STOR PMARL_2STOR PMARL_2TXTO                      * 00250000
**           PMARL_PM3 PMARL_CMS PMARL_NDEFER                         * 00260000
**           PMARL_DTEMPL PMARL_1DTXTO PMARL_IEWBLITO                 * 00270000
**           PMARL_PM4                                                * 00280000
**01* END OF EXTERNAL CLASSIFICATION:                                 * 00290000
**                                                                    * 00300000
**01* MACRO NAME: IEWPMAR                                             * 00310000
**                                                                    * 00320000
**01* DESCRIPTIVE NAME: Program Management Attribute Record           * 00330000
**02* ACRONYM: PMAR                                                   * 00340000
**                                                                    * 00350000
**01* DSECT NAME:                                                     * 00360000
**      PMAR_RS                                                       * 00370000
**                                                                    * 00380000
**01* COMPONENT: Loader (SCLDR)                                       * 00390000
**                                                                    * 00400000
**01* EYE-CATCHER: None                                               * 00410000
**                                                                    * 00420000
**01* STORAGE ATTRIBUTES:                                             * 00430000
**02* SUBPOOL: variable                                               * 00440000
**02* KEY:     variable                                               * 00450000
**                                                                    * 00460000
**01* SIZE: variable                                                  * 00470000
**                                                                    * 00480000
**01* CREATED BY: user                                                * 00490000
**                                                                    * 00500000
**01* DELETED BY: user                                                * 00510000
**                                                                    * 00520000
**01* POINTED TO BY: N/A                                              * 00530000
**                                                                    * 00540000
**01* SERIALIZATION: None                                             * 00550000
**                                                                    * 00560000
**01* FUNCTION:                                                       * 00570000
**     IEWPMAR maps a program's user data in an SMDE and declares     * 00580000
**     constants and mappings for use by routines which manipulate    * 00590000
**     program user data.                                             * 00600000
**                                                                    * 00610000
**     The PMAR mappping is for program attributes which are          * 00620000
**     common to all types of program.  The PMARL and PMARR           * 00630000
**     mappings are for attributes which are unique to specific       * 00640000
**     types of program.  For program objects (PMAR_LFMT is on),      * 00650000
**     the program's user data is mapped by PMAR followed by          * 00660000
**     PMARL. For load modules (PMAR_LFMT is off), the program's      * 00670000
**     user data is mapped by PMAR followed by PMARR.                 * 00680000
**                                                                    * 00690000
**     The PMARA mapping does not map any data in the SMDE. It is     * 00700000
**     used internally by Program Management routines when            * 00710000
**     manipulating program directory entries.                        * 00720000
**                                                                    * 00730000
**                                                                    * 00740000
**01* METHOD OF ACCESS:                                               * 00750000
**02* ASM:                                                            * 00760000
**         IEWPMAR                                                    * 00770000
**02* PL/X:                                                           * 00780000
**         %DCL PMAR__BASE CHAR EXT                                   * 00790000
**         %PMAR__BASE = <'BASING_EXPRESSION'!'BASED'>                * 00800000
**                                            -----                   * 00810000
**         %DCL PMARA__BASE CHAR EXT                                  * 00820000
**         %PMARA__BASE = <'BASING_EXPRESSION'!'BASED'>               * 00830000
**                                            -----                   * 00840000
**         %INCLUDE SYSLIB(IEWPMAR)                                   * 00850000
**                                                                    * 00860000
**         IEWPMAR is included by mapping macro IGWSMDE which maps    * 00870000
**         the SMDE fields.  A program's user data in an SMDE is      * 00880000
**         addressed by adding SMDE_PMAR_OFF to the address of the    * 00890000
**         SMDE.                                                      * 00900000
**                                                                    * 00910000
**01* DEPENDENCIES: None                                              * 00920000
**                                                                    * 00930000
**01* DISTRIBUTION LIBRARY: AMACLIB                                   * 00940000
**                                                                    * 00950000
**01* NOTES: None                                                     * 00960000
**   CHANGE ACTIVITY:                                                 * 00970000
**                                                                    * 00980000
**  $L0=PGMMGMT,JDZ1110,870714,STLSAM:                                * 00990000
**  $L1=PMBINDER,JDZ1110,910628,SJPLPCC: PMAR EXTRACT SUPPORT         * 01000000
**  $P1=KMM1133 ,JDZ1110,911018,SJPLPCC: POSIX SUPPORT                * 01010000
**  $P2=KMM2162 ,JDZ1110,920428,SJPLLTH: PMAR FORMAT CHANGES          * 01020000
**  $01=OW02551,HDZ11B0,940510,SJPLGIN: CONVERT TO BILINGUAL      @01A* 01030000
**  $L2=PM2    ,HDZ11C0,940626,SJPLRK: PM2-Level program object   @L2A* 01040000
**  $02=OW09009,HDZ11B0,941020,SJPLREB: AE OW02551                @02A* 01050000
**  $L3=PM3    ,JSPE002,951205,SJPLRK: PM3-Level program object   @L3A* 01060000
**  $L4=XPLINK .HDZ11E0,980729,SJPLLB: XPLINK support             @L4A* 01070000
**  $L5=PXDxxxx HBB7703 991130 PD00XB: AMODE 64                       * 01080000
**  $L6=PXDxxxx HBB7703 991130 PD00XB: binder on CMS                  * 01090000
**  $L7=xxxxxxx HBB7706 000901 PD00XB: AMODE 64                       * 01100000
**  $L8=RM64    HBB7709 020218 PD00XB: RMODE 64                       * 01110000
**  $L9=RM64    HBB7720 031114 PD00XB: Sublevel 3                     * 01120000
**  $D1=DCRA596 HBB7709 040106 PD00XB: line item DCH                  * 01130000
**  $LA=PO5     HBB7730 041201 PD00XB: PO5                            * 01140000
**  $LB=ME08806 HBB7750 061101 PD00XB: PO5 subplevel for R10          * 01150000
**  $LC=SIGVER  HBB7750 080301 PD00XB: PMAR_SIGNED                    * 01160000
**  $LD=ME17629 HBB7780 091001 PD00XB: P05 sublevel for R13           * 01170000
**  $P3=ME19156 HBB7780 110119 PD00KD: Add warning about the SMDE     * 01170100
**                                     length fields (below)          * 01171000
**  $LE=ME21327 HBB7790 110314 PD00XB: P05 sublevel for V2R1          * 01171100
** $LF=LONGPARM HBB7790 120115 PD00XB: PMAR_LongParm                  * 01171200
** $LG=RMODE64  HBB77B0 150901 PD00XB: RMODE 64                       * 01171300
**                                                                    * 01171400
**  Warning: The PMAR is included by IGWSMDE.  If the length of       * 01172000
**           the PMAR changes it will be necessary to recompile       * 01173000
**           modules who use SMDE length fields SMDE_MAXLEN,          * 01174000
**           SMDE_HFS_MAXLEN, SMDE_PO2_MAXLEN, SMDE_ALL_MAXLEN,       * 01175000
**           and SMDE_PDS_MAXLEN.                                     * 01176000
** END OF SPECIFICATIONS *********************************************/ 01180000
* %GOTO PMARPLS;                                                        01190000
.* TEST FOR THIS DSECT ALREADY INVOKED, IF SO EXIT                      01200000
.*                                                                      01210000
         GBLB  &SYSIEWPMAR                                              01220000
.*                                                                      01230000
         AIF   (&SYSIEWPMAR EQ 1).ENDMAC                                01240000
&SYSIEWPMAR  SETB 1                                                     01250000
.*                                                                      01260000
**********************************************************************  01270000
**  Attributes common to all types of program. The PMAR data is         01280000
**  always present at offset SMDE_PMAR_OFF in an SMDE.                  01290000
**********************************************************************  01300000
PMAR               DSECT             Basic section of program user data 01310000
PMAR_ENTRY         DS   0CL30    Alternative name for the PMAR section  01320000
PMAR_SLEN          DS   H              Section length.                  01330000
PMAR_LVL           DS   B              PMAR format level                01340000
PMAR_PM1_VAL       EQU  X'01'          level constant for PO1      @L2A 01350000
PMAR_PM2_VAL       EQU  X'02'          level constant for PO2      @L2A 01360000
PMAR_PM3_VAL       EQU  X'03'          level constant for PO3      @L3A 01370000
PMAR_PM4_VAL       EQU  X'04'          level constant for PO4      @L7A 01380000
PMAR_PM5_VAL       EQU  X'05'          level constant for PO5      @LAA 01390000
PMAR_LVL_VAL       EQU  X'05'          level constant              @LAC 01400000
PMAR_PLVL          DS   AL1            Bind processor creating object   01410000
PMAR_PLVL_E_VAL    EQU  X'01'          E-level constant                 01420000
PMAR_PLVL_F_VAL    EQU  X'02'          F-level constant                 01430000
PMAR_PLVL_AOS_VAL  EQU  X'03'          AOS-level constant               01440000
PMAR_PLVL_XA_VAL   EQU  X'04'          XA-level constant                01450000
PMAR_PLVL_B1_VAL   EQU  X'05'          Binder version 1                 01460000
PMAR_PLVL_B2_VAL   EQU  X'06'          Binder version 2            @L2A 01470000
PMAR_PLVL_B3_VAL   EQU  X'07'          Binder version 3            @L3A 01480000
PMAR_PLVL_B4_VAL   EQU  X'08'          Binder version 4            @L7A 01490000
PMAR_PLVL_B5_VAL   EQU  X'09'          Binder version 5            @L8A 01500000
*                                        1 - E-level linkage editor     01510000
*                                        2 - F-level linkage editor     01520000
*                                        3 - AOS (VS1/VS2)              01530000
*                                            linkage editor             01540000
*                                        4 - XA linkage editor          01550000
*                                        5 - binder version 1           01560000
*                                        6 - binder version 2      @L2A 01570000
*                                        7 - binder version 3      @L3A 01580000
*                                        8 - binder version 4      @L7A 01590000
*                                        9 - binder version 5      @L8A 01600000
PMAR_ATR           DS   0CL4           Attribute bytes.                 01610000
PMAR_ATR1          DS   B              First attribute byte.            01620000
*                                      These flags must be at the same  01630000
*                                      offsets as the corresponding     01640000
*                                      flags in PDS2ATR1 declared by    01650000
*                                      macro IHAPDS.                    01660000
PMAR_RENT          EQU  X'80'          Reenterable                      01670000
PMAR_REUS          EQU  X'40'          Reusable                         01680000
PMAR_OVLY          EQU  X'20'          Overlay structure                01690000
PMAR_TEST          EQU  X'10'          Module to be tested - TESTRAN    01700000
PMAR_LOAD          EQU  X'08'          Only loadable                    01710000
PMAR_SCTR          EQU  X'04'          Scatter format                   01720000
PMAR_EXEC          EQU  X'02'          Executable                       01730000
PMAR_1BLK          EQU  X'01'          Load module contains only one    01740000
*                                      block of text data and has no    01750000
*                                      rld data.                        01760000
PMAR_ATR2          DS   B              Second attribute byte.           01770000
*                                      These flags must be at the same  01780000
*                                      offsets as the corresponding     01790000
*                                      flags in PDS2ATR2 declared by    01800000
*                                      macro IHAPDS.                    01810000
PMAR_FLVL          EQU  X'80'          If on, the program cannot be     01820000
*                                      processed by the e level         01830000
*                                      linkage editor.                  01840000
*                                      If off, the program can be       01850000
*                                      processed by any level of the    01860000
*                                      linkage editor or the Binder.    01870000
PMAR_ORG0          EQU  X'40'          Linkage editor assigned origin   01880000
*                                      of first block of text is        01890000
*                                      zero.                            01900000
*                  EQU  X'20'          RESERVED                         01910000
PMAR_NRLD          EQU  X'10'          Program contains no RLD items    01920000
PMAR_NREP          EQU  X'08'          Module cannot be reprocessed     01930000
*                                      by the linkage editor            01940000
PMAR_TSTN          EQU  X'04'          Module contains TESTRAN symbol   01950000
*                                      cards                            01960000
*                  EQU  X'02'          RESERVED                         01970000
PMAR_REFR          EQU  X'01'          Refreshable program              01980000
PMAR_ATR3          DS   0B             Third attribute byte.            01990000
PMAR_FTB1          DS   B              Alternative name for flags byte  02000000
*                                      These flags must be at the same  02010000
*                                      offsets as the corresponding     02020000
*                                      flags in PDS2FTB1 declared by    02030000
*                                      macro IHAPDS.                    02040000
*                  EQU  X'80'          RESERVED                         02050000
PMAR_BIG           EQU  X'40'          This program requires 16M bytes  02060000
*                                      or more of virtual storage       02070000
PMAR_PAGA          EQU  X'20'          Page alignment is required       02080000
PMAR_XSSI          EQU  X'10'          SSI information present          02090000
PMAR_XAPF          EQU  X'08'          APF information present          02100000
PMAR_LFMT          EQU  X'04'          PMARL follows PMAR.              02110000
PMAR_SIGNED        EQU  X'02'          Program is signed. Verified on   02120000
*                                      LOAD if directed by security     02130000
*                                      product                     @LCA 02140000
*                  EQU  X'01'          Do not use. Used in PDS DE       02150000
PMAR_ATR4          DS   0B             Fourth attribute byte            02160000
PMAR_FTB2          DS   B              Alternative name for flags byte  02170000
*                                      These flags must be at the same  02180000
*                                      offsets as the corresponding     02190000
*                                      flags in PDS2FTB2 declared by    02200000
*                                      macro IHAPDS.                    02210000
PMAR_ALTP          EQU  X'80'          Alternate primary flag. If on    02220000
*                                      for a primary name, indicates    02230000
*                                      primary name was generated by    02240000
*                                      the Binder. If on for an alias   02250000
*                                      name, indicates the long alias   02260000
*                                      name was specified as the        02270000
*                                      primary name on the bind.   @L2A 02280000
*                                                                       02280100
PMAR_RMODE64       EQU  X'20'          RMODE 64                    @LGC 02281000
PMAR_RMOD          EQU  X'10'          RMODE is 31 or 64                02290000
PMAR_AAMD          EQU  X'0C'          Alias entry point addressing     02300000
*                                      mode.                            02310000
*                                      If B'00', AMODE is 24.           02320000
*                                      If B'10', AMODE is 31.           02330000
*                                      If B'11', AMODE is ANY.          02340000
*                                      If B'01', AMODE is 64.      @L5A 02350000
PMAR_AAMD_MASKOFF  EQU  X'F3'          Mask for AMODE flags             02360000
*                                      in xxxFTB2 flag bytes.           02370000
PMAR_MAMD          EQU  X'03'          Main entry point addressing      02380000
*                                      mode.                            02390000
*                                      If B'00', AMODE is 24.           02400000
*                                      If B'10', AMODE is 31.           02410000
*                                      If B'11', AMODE is ANY.          02420000
*                                      If B'01', AMODE is 64.      @L5A 02430000
PMAR_ATR5          DS   X              Fifth attribute byte        @L8A 02440000
* PMAR_RMOD64 was removed and renamed (so at least any            1@LGD 02441000
* unexpected user would no longer assemble)                       1@LGD 02442000
PMAR_LONGPARM      EQU  X'01'          Parm >100 chars allowed     @LFA 02451000
PMAR_AC            DS   X              APF authorization code           02460000
PMAR_STOR          DS   XL4            Virtual storage required         02470000
PMAR_EPM           DS   XL4            Main entry point offset          02480000
PMAR_EPA           DS   XL4            This entry point offset          02490000
PMAR_SSI           DS   0XL4           SSI information                  02500000
PMAR_CHLV          DS   X              Change level of member           02510000
PMAR_SSFB          DS   B              SSI flag byte                    02520000
PMAR_MSER          DS   CL2            Member serial number             02530000
PMAR_XATTR1        DS   XL2            Extended Attributes         @L7A 02540000
PMAR_SYSTEM_LE     EQU  X'80'                                      @L7A 02550000
PMAR_LIGHTWEIGHT_LE EQU X'40'                                      @L7A 02560000
                   DS   XL2            Reserved                    @L7A 02570000
PMAR_END           DS   0C             END OF BASIC SECTION             02580000
*                                                                       02590000
*********************************************************************** 02600000
**  LSLoader attributes which are unique to program objects.            02610000
**  IfPMAR_LFMT=ON this section follows the PMAR basic section.         02620000
*********************************************************************** 02630000
*                                                                       02640000
PMARL              DSECT                              LSLoader          02650000
*                                      section for program objects      02660000
PMARL_SLEN         DS   H              Section length                   02670000
PMARL_DATA         DS   0CL48          Section Data                     02680000
PMARL_ATR          DS   0CL4           Attribute bytes                  02690000
PMARL_ATR1         DS   B              6th attribute byte               02700000
PMARL_NMIG         EQU  X'80'          This program object cannot be    02710000
*                                      converted directly to PDS load   02720000
*                                      module format.                   02730000
PMARL_PRIM         EQU  X'40'          FETCHOPT PRIME option            02740000
PMARL_PACK         EQU  X'20'          FETCHOPT PACK option             02750000
PMARL_XPL          EQU  X'10'          Module requires XPLINK      @L4A 02760000
PMARL_HPL          EQU  X'10'          Module requires XPLINK      @L4A 02770000
PMARL_ATR2         DS   B              7th attribute byte               02780000
PMARL_CMPR         EQU  X'80'          Compressed format module         02790000
PMARL_1RMOD        EQU  X'40'          1st segment is RMODE 31,    @L2A 02800000
*                                       set for PM2-level PO only  @L2A 02810000
PMARL_2RMOD        EQU  X'20'          2nd segment is RMODE 31,    @L2A 02820000
*                                       set for PM2-level PO if    @L2A 02830000
*                                       there are at least two     @L2A 02840000
*                                       segments.                  @L2A 02850000
PMARL_1ALIN        EQU  X'08'          1st segment is page-aligned,@L2A 02860000
*                                       set for PM2-level PO only  @L2A 02870000
PMARL_2ALIN        EQU  X'04'          2nd segment is page-aligned,@L2A 02880000
*                                       set for PM2-level PO if    @L2A 02890000
*                                       there are at least 2       @L2A 02900000
*                                       segments.                  @L2A 02910000
PMARL_FILL         EQU  X'02'          FILL option specified       @L2A 02920000
*                                       set for PM2-level PO only  @L2A 02930000
PMARL_FILLVAL      DS   CL1            FILL character value        @L2A 02940000
*                                       set for PM2-level PO only  @L2A 02950000
PMARL_PO_SUBLVL    DS   X              Program object sublevel     @L7A 02960000
PMARL_PO_SUBLVL_ZOSV1R3 EQU 1          Value for z/OS V1 R3 / PO4  @L7A 02970000
PMARL_PO_SUBLVL_ZOSV1R5 EQU 2          Value for z/OS V1 R5 / PO4  @L8A 02980000
PMARL_PO_SUBLVL_ZOSV1R7 EQU 3          Value for z/OS V1 R7 / PO4  @L9A 02990000
PMARL_PO_SUBLVL_ZOSV1R8 EQU 1          Value for z/OS V1 R8 / PO5  @LAA 03000000
PMARL_PO_SUBLVL_ZOSV1R10 EQU 2         Value for z/OS V1 R10 / PO5 @LBA 03010000
PMARL_PO_SUBLVL_ZOSV1R13 EQU 3         Value for z/OS V1 R13 / PO5 @LDA 03020000
PMARL_PO_SUBLVL_ZOSV2R1  EQU 4         Value for z/OS V2 R1 / PO5  @LEA 03021000
PMARL_MPGS         DS   XL4            Total length of program on       03030000
*                                       DASD in pages (excluding gas)   03040000
*                                       in its current (compressed or   03050000
*                                       uncompressed) form         @D1C 03060000
PMARL_MDAT         DS   0CL40          DASD program descriptors         03070000
PMARL_TXTL         DS   XL4            Length of initial load text on   03080000
*                                       DASD including gas.             03090000
PMARL_TXTO         DS   AL4            Offset to text                   03100000
PMARL_BDRL         DS   XL4            Length of Binder index           03110000
PMARL_BDRO         DS   AL4            Offset to Binder index           03120000
PMARL_RDTL         DS   XL4            Length of PRDT                   03130000
PMARL_RDTO         DS   AL4            Offset to PRDT                   03140000
PMARL_RATL         DS   XL4            Length of PRAT                   03150000
PMARL_RATO         DS   AL4            Offset to PRAT                   03160000
PMARL_NVSPGS       DS   0XL4           Number of virtual storage   @L2A 03170000
*                                       pages to contain program   @L2A 03180000
*                                       object, for PM2-level PO   @L2A 03190000
PMARL_LMDL         DS   XL4            Length of LSLoader data,         03200000
*                                       for PM1-level PO           @L2C 03210000
PMARL_LMDO         DS   AL4            Offset to LSLoader data          03220000
PMARL_PM2          DS   0CL24          New fields for PM2-Level    @L2A 03230000
*                                       object                     @L2A 03240000
PMARL_NSEG         DS   XL2            Number of loadable segments @L2A 03250000
PMARL_NGAS         DS   XL2            Count of entries in Gas     @L2A 03260000
*                                       Table                      @L2A 03270000
PMARL_1STOR        DS   XL4            Virtual storage required    @L2A 03280000
*                                       for first loadable segment,@L2A 03290000
*                                       valid for all PM2-level    @L2A 03300000
*                                       program objects            @L2A 03301000
PMARL_2STOR        DS   XL4            Virtual storage required    @L2A 03310000
*                                      for second loadable segment,@L2A 03320000
*                                       valid when PMARL_NSEG > 1. @L2A 03330000
PMARL_2TXTO        DS   XL4            Offset to second txt segment@L2A 03340000
*                                       including gas, valid when  @L2A 03350000
*                                       PMARL_NSEG > 1.            @L2A 03360000
PMARL_TRACE        DS   0CL16          Audit trace data            @L2A 03370000
PMARL_DATE         DS   XL4            Date saved                  @L2A 03380000
*                                      This is in packed-decimal        03381001
*                                      format, yyyydddF where           03382001
*                                      yyyy is the year,                03383001
*                                      ddd is the Julian date,          03384001
*                                      and the last 4 bits are x'F'     03385001
PMARL_TIME         DS   XL4            Time saved                  @L2A 03390000
*                                      This is in packed-decimal        03391001
*                                      format, 0hhmmssF where           03392001
*                                      hh is hours 00-23,               03393001
*                                      mm is minutes 00-59,             03394001
*                                      ss is seconds 00-59,             03395001
*                                      and the last 4 bits are x'F'     03396001
PMARL_USER         DS   CL8            User or job identification  @L2A 03400000
PMARL_PM3          DS   0CL16          New fields for PM3-Level    @L3A 03410000
*                                        object                    @L3A 03420000
PMARL_PM3FL1       DS   B              Flag byte                   @L3A 03430000
PMARL_HIDE         EQU  X'80'          Name is an alias that can   @L3A 03440000
*                                        be hidden                 @L3A 03450000
PMARL_DLLENA       EQU  X'40'          PO is DLL-enabled           @L3A 03460000
PMARL_MUSTDELET    EQU  X'20'          If on and directed LOAD     @L3A 03470000
*                                        invoked for this module,  @L3A 03480000
*                                        Module_Delete function    @L3A 03490000
*                                        must be issued before     @L3A 03500000
*                                        freeing or reusing module @L3A 03510000
*                                        storage                   @L3A 03520000
PMARL_IEWBLITP     EQU  X'10'          If on, PMARL_IEWBLITO is    @L3A 03530000
*                                        valid.                    @L3A 03540000
PMARL_MANGLED      EQU  X'08'          If on, name is mangled.     @L3A 03550000
PMARL_CMS          DS   XL1            CMS flags                   @L6A 03560000
PMARL_CMS_SYSTEM   EQU  X'80' SYSTEM module bit                    @L6A 03570000
PMARL_CMS_NOCLEAN  EQU  X'40' Do not cleanup at end of service     @L6A 03580000
PMARL_CMS_STRINIT  EQU  X'20' STRINIT bit                          @L6A 03590000
PMARL_CMS_MODDOS   EQU  X'10' Gen'd with DOS                       @L6A 03600000
PMARL_CMS_MODALL   EQU  X'08' Gen'd with ALL                       @L6A 03610000
PMARL_CMS_INVALXA  EQU  X'04' XA-mode invalid                      @L6A 03620000
PMARL_CMS_INVALXC  EQU  X'02' XC-mode invalid                      @L6A 03630000
PMARL_NDEFER       DS   XL2            Number of deferred classes  @L3A 03640000
PMARL_DTEMPL       DS   XL4            Total length of deferred    @L3A 03650000
*                                        text classes on DASD      @L3A 03660000
*                                        (excludes gas).           @L3A 03670000
PMARL_1DTXTO       DS   XL4            Offset of 1st deferred      @L3A 03680000
*                                        class on DASD (includes   @L3A 03690000
*                                        gas).                     @L3A 03700000
PMARL_IEWBLITO     DS   XL4            Byte offset of IEWBLIT      @L3A 03710000
*                                        structure from module     @L3A 03720000
*                                        load point                @L3A 03730000
PMARL_PM4          DS   0CL8           New fields for PM4-Level    @L7A 03740000
PMARL_ATR3         DS   X              8th attribute byte          @L8A 03750000
PMARL_1RMOD64      EQU  X'80'          1st segment is RMODE 64     @L8A 03760000
PMARL_2RMOD64      EQU  X'40'          2nd segment is RMODE 64     @L8A 03770000
                   DS   CL7            Reserved                    @L7A 03780000
PMARL_PM5          DS   0C             New fields for PM5-Level    @LAA 03790000
PMARL_END          DS   0C             END OF LSLOADER SECTION          03800000
*                                                                       03810000
*                                                                       03820000
*********************************************************************** 03830000
**  Attributes unique to load modules (PDS only).                       03840000
**  IfPMAR_LFMT=OFF this section follows the PMAR basic section.        03850000
*********************************************************************** 03860000
*                                                                       03870000
PMARR              DSECT                              Load module       03880000
*                                      (PDS) attributes section         03890000
PMARR_SLEN         DS   H              Section length                   03900000
PMARR_DATA         DS   0CL21          Section data                     03910000
PMARR_TTRS         DS   0CL8           TTR fields                       03920000
PMARR_TTRT         DS   CL3            TTR of first block of text       03930000
PMARR_ZERO         DS   CL1            Zero                             03940000
PMARR_TTRN         DS   CL3            TTR of note list or scatter      03950000
*                                      translation table. Used for      03960000
*                                      modules in scatter load format   03970000
*                                      or overlay structure only.       03980000
PMARR_NL           DS   AL1            Number of entries in note list   03990000
*                                      for scatter format modules and   04000000
*                                      modules in overlay structure,    04010000
*                                      Otherwise zero.                  04020000
PMARR_FTBL         DS   XL2            Length of first block of text.   04030000
*                                                                       04040000
PMARR_ORG          DS   0XL3           Load module origin if ^0         04050000
                   DS   CL2            Reserved                         04060000
PMARR_RLDS         DS   X              Number of RLD/CTL records which  04070000
*                                      follow the first text record     04080000
PMARR_SCAT         DS   0CL8           Scatter load information         04090000
PMARR_SLSZ         DS   XL2            Scatter list length              04100000
PMARR_TTSZ         DS   XL2            Translation table length         04110000
PMARR_ESDT         DS   CL2            ESDID of first text block        04120000
PMARR_ESDC         DS   CL2            ESDID of EP control section      04130000
PMARR_END          DS   0C             END OF LOAD MODULE ATTRIBUTES    04140000
*                                                                       04150000
*********************************************************************** 04160000
**  Alias section in unformatted form. This section is used only        04170000
**  by programs which manipulate program user data.                     04180000
*********************************************************************** 04190000
*                                                                       04200000
PMARA              DSECT               PMAR alias entry section         04210000
PMARA_LEN          DS   H              Section length                   04220000
PMARA_DATA         DS   0B             Section data                     04230000
PMARA_EPA          DS   XL4            Entry point offset               04240000
PMARA_ATR          DS   0CL1           Attribute bytes                  04250000
PMARA_ATR1         DS   0B             First attribute byte             04260000
PMARA_FTB2         DS   B              Alternative name for flags byte  04270000
*                                      These flags must be at the same  04280000
*                                      offsets as the corresponding     04290000
*                                      flags in PDS2FTB2 declared by    04300000
*                                      macro IHAPDS.                    04310000
PMARA_ALTP         EQU  X'80'          Alternate Primary flag.          04320000
*                                       If on, this long alias name     04330000
*                                       was specified as the primary    04340000
*                                       on the bind and a Binder        04350000
*                                       generated 8 byte primary        04360000
*                                       name exists.               @L2C 04370000
PMARA_HIDE         EQU  X'40'          Alias name can be hidden    @L3A 04380000
PMARA_NEXEC        EQU  X'20'          Entry point is non-executable    04390000
*                                                                  @L3A 04400000
PMARA_MANGLED      EQU  X'10'          Alias is a mangled name     @L3A 04410000
PMARA_AMD          EQU  X'0C'          Alias entry addressing mode      04420000
*                                      If B'00', AMODE is 24.           04430000
*                                      If B'10', AMODE is 31.           04440000
*                                      If B'11', AMODE is ANY.          04450000
*                                      If B'01', AMODE is 64.      @L5A 04460000
PMARA_END          DS   0C             END OF ALIAS ENTRY SECTION       04470000
*                                                                       04480000
*                                                                       04490000
*********************************************************************** 04500000
**  Constants used by programs which manipulate program user data.      04510000
*********************************************************************** 04520000
*                                                                       04530000
* Maximum length PMAR                                                   04540000
*  Basic section length                                                 04550000
*  LSLoader section length                                              04560000
*                                                                       04570000
PMAR_MAXLEN        EQU  PMAR_END-PMAR+PMARL_END-PMARL                   04580000
*                                                                       04590000
* Largest PMAR length for program objects                               04600000
*  Basic section length                                                 04610000
*  Program object section length                                        04620000
*                                                                       04630000
PMAR_MAXLEN_PROGOBJ EQU PMAR_END-PMAR+PMARL_END-PMARL                   04640000
*                                                                       04650000
* Largest PMAR length for PO1 format program object                     04660000
*  Basic section length                                                 04670000
*  PO1 format Program object section length                             04680000
*                                                                       04690000
PMAR_MAXLEN_PO1 EQU PMAR_END-PMAR+PMARL_PM2-PMARL                       04700000
*                                                                       04710000
* Largest PMAR length for program objects                               04720000
*  Basic section length                                                 04730000
*  Program object section length for PO2                                04740000
*                                                                       04750000
PMAR_MAXLEN_PO2 EQU PMAR_END-PMAR+PMARL_PM3-PMARL                 @L3C  04760000
*                                                                 @L3A  04770000
* Largest PMAR length for program objects                         @L3A  04780000
*  Basic section length                                           @L3A  04790000
*  Program object section length for PO3                          @L3A  04800000
*                                                                 @L3A  04810000
PMAR_MAXLEN_PO3 EQU PMAR_END-PMAR+PMARL_PM4-PMARL                 @L7C  04820000
*                                                                 @L7A  04830000
* Largest PMAR length for program objects                         @L7A  04840000
*  Basic section length                                           @L7A  04850000
*  Program object section length for PO4                          @L7A  04860000
*                                                                 @L7A  04870000
PMAR_MAXLEN_PO4 EQU PMAR_END-PMAR+PMARL_PM5-PMARL                  @LAC 04880000
*                                                                  @LAA 04890000
* Largest PMAR length for program objects                          @LAA 04900000
*  Basic section length                                            @LAA 04910000
*  Program object section length for PO5                           @LAA 04920000
*                                                                  @LAA 04930000
PMAR_MAXLEN_PO5 EQU PMAR_END-PMAR+PMARL_END-PMARL                  @LAA 04940000
*                                                                       04950000
* Largest PMAR length for PDS load modules                              04960000
*  Load module section length                                           04970000
*                                                                       04980000
PMAR_MAXLEN_LOADMOD EQU PMAR_END-PMAR+PMARR_END-PMARR                   04990000
*                                                                       05000000
* Largest PMARL length for PO1 format program objects                   05010000
*  PO1 format Program object section length                             05020000
*                                                                       05030000
PMARL_LVL1LEN       EQU PMARL_PM2-PMARL                            @L2A 05040000
*                                                                  @L3A 05050000
* Largest PMARL length for PO2 format program objects              @L3A 05060000
*  PO2 format Program object section length                        @L3A 05070000
*                                                                  @L3A 05080000
PMARL_LVL2LEN       EQU PMARL_PM3-PMARL                            @L3A 05090000
PMARL_LVL3LEN       EQU PMARL_PM4-PMARL                            @L7A 05100000
PMARL_LVL4LEN       EQU PMARL_PM5-PMARL                            @LAA 05110000
PMARL_LVL5LEN       EQU PMARL_END-PMARL                            @LAA 05120000
.ENDMAC  ANOP                                                           05130000
         MEND                                                           05140000
*%PMARPLS:;                                                             05150000
*                                                                       05160000
*%DCL PMAR__BASE CHAR EXTERNAL;                                         05170000
*%IF PMAR__BASE = '' %THEN                                              05180000
*   %PMAR__BASE = 'BASED';                                              05190000
*%DCL PMARA__BASE CHAR EXTERNAL;                                        05200000
*%IF PMARA__BASE = '' %THEN                                             05210000
*   %PMARA__BASE = 'BASED';                                             05220000
*/********************************************************************/ 05230000
*/* Attributes common to all types of program. The PMAR data is      */ 05240000
*/* always present at offset SMDE_PMAR_OFF in an SMDE.               */ 05250000
*/********************************************************************/ 05260000
*                                                                       05270000
* DECLARE                                                               05280000
*   1 PMAR  BDY(BYTE)PMAR__BASE,   /* Basic section of program user     05290000
*                                      data.                         */ 05300000
*    3 PMAR_ENTRY,                 /* Alternative name for the PMAR     05310000
*                                      section.                      */ 05320000
*     5 PMAR_SLEN FIXED(16) BDY(BYTE),/* Section length.             */ 05330000
*     5 PMAR_LVL FIXED(8),          /* PMAR format level         @P2A*/ 05340000
*     5 PMAR_PLVL FIXED(8),         /* Bind processor creating object   05350000
*                                        1 - E-level linkage editor     05360000
*                                        2 - F-level linkage editor     05370000
*                                        3 - AOS (VS1/VS2)              05380000
*                                            linkage editor             05390000
*                                        4 - XA linkage editor          05400000
*                                        5 - binder version 1           05410000
*                                        6 - binder version 2           05420000
*                                        7 - binder version 3           05430000
*                                        8 - binder version 4           05440000
*                                        9 - binder version 5           05450000
*                                                                    */ 05460000
*     5 PMAR_ATR ,                  /* Attribute bytes.              */ 05470000
*      7 PMAR_ATR1 BIT(8),          /* First attribute byte.            05480000
*                                      These flags must be at the same  05490000
*                                      offsets as the corresponding     05500000
*                                      flags in PDS2ATR1 declared by    05510000
*                                      macro IHAPDS.                 */ 05520000
*       9 PMAR_RENT BIT(1),         /* Reenterable                   */ 05530000
*       9 PMAR_REUS BIT(1),         /* Reusable                      */ 05540000
*       9 PMAR_OVLY BIT(1),         /* Overlay structure             */ 05550000
*       9 PMAR_TEST BIT(1),         /* Module to be tested - TESTRAN */ 05560000
*       9 PMAR_LOAD BIT(1),         /* Only loadable                 */ 05570000
*       9 PMAR_SCTR BIT(1),         /* Scatter format                */ 05580000
*       9 PMAR_EXEC BIT(1),         /* Executable                    */ 05590000
*       9 PMAR_1BLK BIT(1),         /* Load module contains only one    05600000
*                                      block of text data and has no    05610000
*                                      rld data.                     */ 05620000
*      7 PMAR_ATR2 BIT(8),          /* Second attribute byte.           05630000
*                                      These flags must be at the same  05640000
*                                      offsets as the corresponding     05650000
*                                      flags in PDS2ATR2 declared by    05660000
*                                      macro IHAPDS.                 */ 05670000
*       9 PMAR_FLVL BIT(1),         /* If on, the program cannot be     05680000
*                                      processed by the E level         05690000
*                                      linkage editor.                  05700000
*                                      If off, the program can be       05710000
*                                      processed by any level of the    05720000
*                                      linkage editor or the Binder. */ 05730000
*       9 PMAR_ORG0 BIT(1),         /* Linkage editor assigned origin   05740000
*                                      of first block of text is        05750000
*                                      zero.                         */ 05760000
*       9 *         BIT(1),         /* Reserved                  @P2C*/ 05770000
*       9 PMAR_NRLD BIT(1),         /* Program contains no RLD items */ 05780000
*       9 PMAR_NREP BIT(1),         /* Module cannot be reprocessed     05790000
*                                      by the linkage editor         */ 05800000
*       9 PMAR_TSTN BIT(1),         /* Module contains TESTRAN symbol   05810000
*                                      cards                         */ 05820000
*       9 *        BIT(1),          /* Reserved                  @P2C*/ 05830000
*       9 PMAR_REFR BIT(1),         /* Refreshable program           */ 05840000
*      7 PMAR_ATR3 BIT(8),          /* Third attribute byte.         */ 05850000
*       8 PMAR_FTB1 BIT(8),         /* Alternative name for flags byte. 05860000
*                                      These flags must be at the same  05870000
*                                      offsets as the corresponding     05880000
*                                      flags in PDS2FTB1 declared by    05890000
*                                      macro IHAPDS.             @P1C*/ 05900000
*        9 *        BIT(1),         /* Reserved. Do not use.            05910000
*                                      Used in PDS DE            @P2C*/ 05920000
*        9 PMAR_BIG BIT(1),         /* This program requires 16M bytes  05930000
*                                      or more of virtual storage    */ 05940000
*        9 PMAR_PAGA BIT(1),        /* Page alignment is required    */ 05950000
*        9 PMAR_XSSI BIT(1),        /* SSI information present       */ 05960000
*        9 PMAR_XAPF BIT(1),        /* APF information present       */ 05970000
*        9 PMAR_LFMT BIT(1),        /* PMARL follows PMAR.           */ 05980000
*        9 PMAR_SIGNED BIT(1),      /* Program is signed. Verified on   05990000
*                                      LOAD if directed by security     06000000
*                                      product                   @LCA*/ 06010000
*        9 *         BIT(1),        /* Do not use. Used in PDS2 DE   */ 06020000
*      7 PMAR_ATR4 BIT(8),          /* Fourth attribute byte         */ 06030000
*       8 PMAR_FTB2 BIT(8),         /* Alternative name for flags byte. 06040000
*                                      These flags must be at the same  06050000
*                                      offsets as the corresponding     06060000
*                                      flags in PDS2FTB2 declared by    06070000
*                                      macro IHAPDS.             @P1C*/ 06080000
*        9 PMAR_ALTP BIT(1),        /* Alternate primary flag. If on    06090000
*                                      for a primary name, indicates    06100000
*                                      primary name was generated by    06110000
*                                      the Binder. If on for an alias   06120000
*                                      name, indicates the long alias   06130000
*                                      name was specified as the        06140000
*                                      primary name on the bind. @L2A*/ 06150000
*        9 * BIT(1),                /* Reserved                  @LGC*/ 06160000
*        9 PMAR_RMODE64 BIT(1),     /* RMODE 64                  @LGA*/ 06161000
*        9 PMAR_RMOD BIT(1),        /* RMODE is 31 or 64             */ 06170000
*        9 PMAR_AAMD BIT(2),        /* Alias entry point AMODE.         06180000
*                                      If B'00', AMODE is 24.           06190000
*                                      If B'10', AMODE is 31. If        06200000
*                                      If B'11', AMODE is ANY.          06210000
*                                      If B'01', AMODE is 64.    @L5C*/ 06220000
*        9 PMAR_MAMD BIT(2),        /* Main entry point AMODE.          06230000
*                                      If B'00', AMODE is 24.           06240000
*                                      If B'10', AMODE is 31. If        06250000
*                                      If B'11', AMODE is ANY.          06260000
*                                      If B'01', AMODE is 64.    @L5C*/ 06270000
*     5 PMAR_ATR5 BIT(8),           /* Fifth attribute byte      @L8A*/ 06280000
* /* PMAR_RMOD64 was moved and renamed                           @LGA*/ 06290000
*       7 * BIT(7),                 /* Reserved                  @LGC*/ 06300000
*       7 PMAR_LONGPARM BIT(1),     /* Parm >100 chars allowed   @LFA*/ 06301000
*     5 PMAR_AC   FIXED(8),         /* APF authorization code        */ 06310000
*     5 PMAR_STOR FIXED(32) BDY(BYTE),/* Virtual storage required    */ 06320000
*     5 PMAR_EPM  FIXED(32) BDY(BYTE),/* Main entry point offset     */ 06330000
*     5 PMAR_EPA  FIXED(32) BDY(BYTE),/* This entry point offset     */ 06340000
*     5 PMAR_SSI BIT(32),           /* SSI information               */ 06350000
*      7 PMAR_CHLV FIXED(8),        /* Change level of member        */ 06360000
*      7 PMAR_SSFB BIT(8),          /* SSI flag byte                 */ 06370000
*      7 PMAR_MSER CHAR(2),         /* Member serial number          */ 06380000
*     5 PMAR_XATTR1 CHAR(2),        /* Extended attributes           */ 06390000
*       7 PMAR_SYSTEM_LE BIT(1),    /*                               */ 06400000
*       7 PMAR_LIGHTWEIGHT_LE BIT(1),  /*                            */ 06410000
*     5 * CHAR(2),                  /* Reserved                      */ 06420000
*    3 PMAR_END CHAR(0);            /* End of basic section          */ 06430000
*                                                                       06440000
*/********************************************************************/ 06450000
*/* LSLoader attributes which are unique to program objects.         */ 06460000
*/* If PMAR_LFMT=ON this section follows the PMAR basic section.     */ 06470000
*/********************************************************************/ 06480000
*                                                                       06490000
* DECLARE                                                               06500000
*   1 PMARL BASED(ADDR(PMAR_ENTRY)+PMAR_SLEN) BDY(BYTE), /* LSLoader    06510000
*                                      section for program objects   */ 06520000
*    3 PMARL_SLEN FIXED(16) BDY(BYTE),/* Section length              */ 06530000
*    3 PMARL_DATA ,                 /* Section data                  */ 06540000
*     5 PMARL_ATR,                  /* Attribute bytes               */ 06550000
*      7 PMARL_ATR1 BIT(8),         /* 6th attribute byte            */ 06560000
*       9 PMARL_NMIG BIT(1),        /* This program object cannot be    06570000
*                                      converted directly to PDS load   06580000
*                                      module format.                */ 06590000
*       9 PMARL_PRIM BIT(1),        /* FETCHOPT PRIME option         */ 06600000
*       9 PMARL_PACK BIT(1),        /* FETCHOPT PACK option          */ 06610000
*       9 PMARL_XPL  BIT(1),        /* Module requires XPLINK    @L4A*/ 06620000
*         11 PMARL_HPL BIT(1),      /* Module requires XPLINK    @L4A*/ 06630000
*       9 *          BIT(4),        /* Reserved                  @L4C*/ 06640000
*      7 PMARL_ATR2 BIT(8),         /* 7th attribute byte            */ 06650000
*       9 PMARL_CMPR BIT(1),        /* Compressed format module      */ 06660000
*       9 PMARL_1RMOD BIT(1),       /* 1st segment is RMODE 31,         06670000
*                                      set for PM2-level PO only @L2A*/ 06680000
*       9 PMARL_2RMOD BIT(1),       /* 2nd segment is RMODE 31,         06690000
*                                      set for PM2-level PO if there    06700000
*                                      are at least 2 loadable          06710000
*                                      segments.                 @L2A*/ 06720000
*       9  *         BIT(1),        /* Reserved                  @L3C*/ 06730000
*       9 PMARL_1ALIN BIT(1),       /* 1st segment is page-aligned,     06740000
*                                      set for PM2-level PO only @L2A*/ 06750000
*       9 PMARL_2ALIN BIT(1),       /* 2nd segment is page-aligned,     06760000
*                                      set for PM2-level PO only if     06770000
*                                      >1 loadable segment       @L2A*/ 06780000
*       9 PMARL_FILL BIT(1),        /* FILL option specified            06790000
*                                      set for PM2-level PO only @L2A*/ 06800000
*       9 *          BIT(1),        /* Reserved                  @L2C*/ 06810000
*      7 PMARL_FILLVAL CHAR(1),     /* FILL character value             06820000
*                                      set for PM2-level PO only if     06830000
*                                      PMARL_FILL is on.         @L2A*/ 06840000
*      7 PMARL_PO_SUBLVL FIXED(8),  /* Program object sublevel,         06850000
*                                      applicable for PO4 and later.    06860000
*                                      See constants beginning with     06870000
*                                      PMARL_PO_SUBLVL_                 06880000
*                                                                @L7A*/ 06890000
*     5 PMARL_MPGS FIXED(32) BDY(BYTE),/* Total length of program on    06900000
*                                      DASD (excluding gas) in pages    06910000
*                                      in its current (compressed or    06920000
*                                      uncompressed) form        @D1C*/ 06930000
*     5 PMARL_MDAT ,                /* DASD program descriptors      */ 06940000
*          /* Note:  Although the offsets that follow are described  */ 06950000
*          /* independently, the Loader is dependent on the PRAT     */ 06960000
*          /* preceding the PRDT, and LSLoader data following it.    */ 06970000
*          /* LSLoader length should include everything between its  */ 06980000
*          /* start and the beginning of the first text segment.     */ 06990000
*      7 PMARL_TXTL FIXED(32) BDY(BYTE), /* Length of initial load      07000000
*                                            text on DASD including     07010000
*                                            gas.                    */ 07020000
*      7 PMARL_TXTO PTR(32) BDY(BYTE), /* Offset to first text segment  07030000
*                                            on DASD                 */ 07040000
*      7 PMARL_BDRL FIXED(32) BDY(BYTE), /* Length of Binder index   */ 07050000
*      7 PMARL_BDRO PTR(32) BDY(BYTE), /* Offset to Binder index     */ 07060000
*      7 PMARL_RDTL FIXED(32) BDY(BYTE), /* Length of PRDT           */ 07070000
*      7 PMARL_RDTO PTR(32) BDY(BYTE), /* Offset to PRDT             */ 07080000
*      7 PMARL_RATL FIXED(32) BDY(BYTE), /* Length of PRAT           */ 07090000
*      7 PMARL_RATO PTR(32) BDY(BYTE), /* Offset to PRAT             */ 07100000
*      7 PMARL_LMDL FIXED(32) BDY(BYTE), /* Length of LSLoader data,    07110000
*                                 for PM1-level program objects  @L2C*/ 07120000
*        9 PMARL_NVSPGS FIXED(32) BDY(BYTE), /* Number of pages of      07130000
*                                 virtual storage needed to contain     07140000
*                                 entire program object (including      07150000
*                                 gas)                           @L2A*/ 07160000
*      7 PMARL_LMDO PTR(32) BDY(BYTE), /* Offset to LSLoader data    */ 07170000
*     5 PMARL_PM2,            /* New fields for PM2-Level object @L2A*/ 07180000
*      7 PMARL_NSEG FIXED(16) BDY(BYTE), /* Number of loadable segments 07190000
*                                                                @L2A*/ 07200000
*      7 PMARL_NGAS FIXED(16) BDY(BYTE), /* Count of entries in Gas     07210000
*                                            Table               @L2A*/ 07220000
*      7 PMARL_1STOR FIXED(32) BDY(BYTE), /* Virtual storage required   07230000
*                                for first loadable segment, valid      07240000
*                                for all PM2-level program objs  @L2A*/ 07250000
*      7 PMARL_2STOR FIXED(32) BDY(BYTE), /* Virtual storage required   07260000
*                                for second loadable segment, valid     07270000
*                                valid when PMARL_NSEG > 1.      @L2A*/ 07280000
*      7 PMARL_2TXTO PTR(32) BDY(BYTE), /* Offset to second txt segment 07290000
*                                including gas, valid when              07300000
*                                PMARL_NSEG > 1                  @L2A*/ 07310000
*      7 PMARL_TRACE,         /* Audit trace data                @L2A*/ 07320000
*        9 PMARL_DATE BIT(32) BDY(BYTE), /* Date saved.                 07330001
*                                      This is in packed-decimal        07330101
*                                      format, yyyydddF where           07330201
*                                      yyyy is the year,                07330301
*                                      ddd is the Julian date,          07330401
*                                      and the last 4 bits are x'F'     07330501
*                                                                @L2A*/ 07331001
*        9 PMARL_TIME BIT(32) BDY(BYTE), /* Time saved.                 07340001
*                                      This is in packed-decimal        07340101
*                                      format, 0hhmmssF where           07340201
*                                      hh is hours 00-23,               07340301
*                                      mm is minutes 00-59,             07340401
*                                      ss is seconds 00-59,             07340501
*                                      and the last 4 bits are x'F'     07340601
*                                                                @L2A*/ 07341001
*        9 PMARL_USER CHAR(8), /* User or job identification     @L2A*/ 07350000
*      5 PMARL_PM3,          /* New fields for PM3-Level object  @L3A*/ 07360000
*       7 PMARL_PM3FL1 BIT(8), /* Flag byte                      @L3A*/ 07370000
*        9 PMARL_HIDE BIT(1),  /* Name is an alias that can be hidden   07380000
*                                                                @L3A*/ 07390000
*        9 PMARL_DLLENA BIT(1), /* PO is DLL-enabled             @L3A*/ 07400000
*        9 PMARL_MUSTDELET BIT(1), /* If on and directed LOAD invoked   07410000
*                                  for this module, Module_Delete       07420000
*                                  function must be issued before       07430000
*                                  freeing or reusing module storage    07440000
*                                                                @L3A*/ 07450000
*        9 PMARL_IEWBLITP BIT(1), /* If on, PMARL_IEWBLITO is valid     07460000
*                                                                @L3A*/ 07470000
*        9 PMARL_MANGLED BIT(1), /* Name is mangled              @L3A*/ 07480000
*        9  * BIT(3),          /* Reserved                       @L3A*/ 07490000
*       7 PMARL_CMS  BIT(8),        /* CMS flags                 @L6A*/ 07500000
*         9 PMARL_CMS_SYSTEM BIT(1), /* SYSTEM module bit        @L6A*/ 07510000
*         9 PMARL_CMS_NOCLEAN BIT(1), /* Do not cleanup at end of       07520000
*                                        service                 @L6A*/ 07530000
*         9 PMARL_CMS_STRINIT BIT(1), /* STRINIT bit             @L6A*/ 07540000
*         9 PMARL_CMS_MODDOS BIT(1), /* Gen'd with DOS           @L6A*/ 07550000
*         9 PMARL_CMS_MODALL BIT(1), /* Gen'd with ALL           @L6A*/ 07560000
*         9 PMARL_CMS_INVALXA BIT(1), /* XA-mode invalid         @L6A*/ 07570000
*         9 PMARL_CMS_INVALXC BIT(1), /* XC-mode invalid         @L6A*/ 07580000
*         9 * BIT(1),                 /* Reserved                @L6A*/ 07590000
*       7 PMARL_NDEFER FIXED(16) BDY(BYTE), /* Number of deferred       07600000
*                                              segments          @L3A*/ 07610000
*       7 PMARL_DTEMPL FIXED(31) BDY(BYTE), /* Total length of deferred 07620000
*                            text classes on DASD (excludes gas) @L3A*/ 07630000
*       7 PMARL_1DTXTO FIXED(31) BDY(BYTE), /* Offset of 1st deferred   07640000
*                                   class on DASD (includes gas) @L3A*/ 07650000
*       7 PMARL_IEWBLITO FIXED(31) BDY(BYTE), /* Byte offset of         07660000
*                            IEWBLIT structure from module load point   07670000
*                                                                @L3A*/ 07680000
*      5 PMARL_PM4 CHAR(8),  /* New fields for PM4-Level object  @L7A*/ 07690000
*        7 PMARL_ATR3 BIT(8),       /* 8th attribute byte        @L8A*/ 07700000
*          9 PMARL_1RMOD64 BIT(1),  /* 1st segment is RMODE 64   @L8A*/ 07710000
*          9 PMARL_2RMOD64 BIT(1),  /* 2nd segment is RMODE 64   @L8A*/ 07720000
*        7 * CHAR(7),               /* Reserved                  @L8A*/ 07730000
*      5 PMARL_PM5 CHAR(0),  /* New fields for PM5-Level object  @LAA*/ 07740000
*    3 PMARL_END CHAR(0) BDY(BYTE); /* End of LSLoader section       */ 07750000
*                                                                       07760000
* DCL PMARL_PO_SUBLVL_ZOSV1R3 FIXED(8) Constant(1); /* Value for        07770000
*                                      z/OS V1 R3 with PO4       @L8A*/ 07780000
* DCL PMARL_PO_SUBLVL_ZOSV1R5 FIXED(8) Constant(2); /* Value for        07790000
*                                      z/OS V1 R5 with PO4       @L8A*/ 07800000
* DCL PMARL_PO_SUBLVL_ZOSV1R7 FIXED(8) Constant(3); /* Value for        07810000
*                                      z/OS V1 R7 with PO4       @L9A*/ 07820000
* DCL PMARL_PO_SUBLVL_ZOSV1R8 FIXED(8) Constant(1); /* Value for        07830000
*                                      z/OS V1 R8 with PO5       @LAC*/ 07840000
* DCL PMARL_PO_SUBLVL_ZOSV1R10 FIXED(8) Constant(2); /* Value for       07850000
*                                      z/OS V1 R10 with PO5      @LBA*/ 07860000
* DCL PMARL_PO_SUBLVL_ZOSV1R13 FIXED(8) Constant(3); /* Value for       07870000
*                                      z/OS V1 R13 with PO5      @LDA*/ 07880000
* DCL PMARL_PO_SUBLVL_ZOSV2R1 FIXED(8) Constant(4); /* Value for        07881000
*                                      z/OS V2 R1 with PO5       @LEA*/ 07882000
*                                                                       07890000
*/********************************************************************/ 07900000
*/* Attributes unique to load modules (PDS only).                    */ 07910000
*/* If PMAR_LFMT=OFF this section follows the PMAR basic section.    */ 07920000
*/********************************************************************/ 07930000
*                                                                       07940000
* DECLARE                                                               07950000
*   1 PMARR BASED(ADDR(PMAR_ENTRY)+PMAR_SLEN) BDY(BYTE), /* Load module 07960000
*                                      (PDS) attributes section      */ 07970000
*    3 PMARR_SLEN FIXED(16) BDY(BYTE),/* Section length              */ 07980000
*    3 PMARR_DATA ,                 /* Section data                  */ 07990000
*     5 PMARR_TTRS CHAR(8),         /* TTR fields                    */ 08000000
*      7 PMARR_TTRT CHAR(3),        /* TTR of first block of text    */ 08010000
*      7 PMARR_ZERO CHAR(1),        /* Zero                          */ 08020000
*      7 PMARR_TTRN CHAR(3),        /* TTR of note list or scatter      08030000
*                                      translation table. Used for      08040000
*                                      modules in scatter load format   08050000
*                                      or overlay structure only.    */ 08060000
*      7 PMARR_NL PTR(8),           /* Number of entries in note list   08070000
*                                      for scatter format modules and   08080000
*                                      modules in overlay structure,    08090000
*                                      Otherwise zero.               */ 08100000
*     5 PMARR_FTBL FIXED(15) BDY(BYTE),/* Length of first block of      08110000
*                                      text.                         */ 08120000
*     5 PMARR_ORG  FIXED(24) BDY(BYTE),/* Load module origin if ^0   */ 08130000
*      7 *          CHAR(2),        /* Reserved                      */ 08140000
*      7 PMARR_RLDS FIXED(8),       /* Number of RLD/CTL records which  08150000
*                                      follow the first text record  */ 08160000
*     5 PMARR_SCAT CHAR(8),         /* Scatter load information      */ 08170000
*      7 PMARR_SLSZ FIXED(16) BDY(BYTE),/* Scatter list length       */ 08180000
*      7 PMARR_TTSZ FIXED(16) BDY(BYTE),/* Translation table length  */ 08190000
*      7 PMARR_ESDT CHAR(2),        /* ESDID of first text block     */ 08200000
*      7 PMARR_ESDC CHAR(2),        /* ESDID of EP control section   */ 08210000
*    3 PMARR_END CHAR(0);           /* End of load module attributes */ 08220000
*                                                                       08230000
*/********************************************************************/ 08240000
*/* Alias section in unformatted form. This section is used only     */ 08250000
*/* by programs which manipulate program user data.                  */ 08260000
*/********************************************************************/ 08270000
*                                                                       08280000
* DECLARE                                                               08290000
*   1 PMARA BDY(BYTE) PMARA__BASE,  /* PMAR alias entry section      */ 08300000
*    3 PMARA_LEN  FIXED(16) BDY(BYTE),/* Section length              */ 08310000
*    3 PMARA_DATA ,                 /* Section data                  */ 08320000
*     5 PMARA_EPA FIXED(32) BDY(BYTE),/* Entry point offset          */ 08330000
*     5 PMARA_ATR CHAR(1),          /* Attribute bytes               */ 08340000
*      7 PMARA_ATR1 BIT(8),         /* First attribute byte          */ 08350000
*       8 PMARA_FTB2 BIT(8),        /* Alternative name for flags byte. 08360000
*                                      These flags must be at the same  08370000
*                                      offsets as the corresponding     08380000
*                                      flags in PDS2FTB2 declared by    08390000
*                                      macro IHAPDS.             @P1A*/ 08400000
*        9 PMARA_ALTP BIT(1),       /* Alternate Primary flag           08410000
*                                       If on, this long alias name     08420000
*                                       was specified as the primary    08430000
*                                       on the bind and a Binder        08440000
*                                       generated 8 byte primary        08450000
*                                       name exists.             @L2C*/ 08460000
*        9 PMARA_HIDE BIT(1),       /* Alias name can be hidden  @L3A*/ 08470000
*        9 PMARA_NEXEC BIT(1),      /* Entry point is not executable    08480000
*                                                                @L3A*/ 08490000
*        9 PMARA_MANGLED BIT(1),    /* Alias is a mangled name   @L3A*/ 08500000
*        9 PMARA_AMD  BIT(2),       /* Alias entry addressing mode.     08510000
*                                      If B'00', AMODE is 24.           08520000
*                                      If B'10', AMODE is 31. If        08530000
*                                      If B'11', AMODE is ANY.          08540000
*                                      If B'01', AMODE is 64.    @L5C*/ 08550000
*        9 *          BIT(2),       /* Reserved                      */ 08560000
*    3 PMARA_END CHAR(0);           /* End of alias entry section    */ 08570000
*                                                                       08580000
*                                                                       08590000
*/********************************************************************/ 08600000
*/* Constants used by programs which manipulate program user data.   */ 08610000
*/********************************************************************/ 08620000
*                                                                       08630000
* DECLARE                                                               08640000
*  PMAR_PM1_VAL FIXED(8) CONSTANT(1),  /* level constant for PO1 @L2A*/ 08650000
*  PMAR_PM2_VAL FIXED(8) CONSTANT(2),  /* level constant for PO2 @L2A*/ 08660000
*  PMAR_PM3_VAL FIXED(8) CONSTANT(3),  /* level constant for PO3 @L3A*/ 08670000
*  PMAR_PM4_VAL FIXED(8) CONSTANT(4),  /* level constant for PO4 @L7A*/ 08680000
*  PMAR_PM5_VAL FIXED(8) CONSTANT(5),  /* level constant for PO5 @LAA*/ 08690000
*  PMAR_LVL_VAL FIXED(8) CONSTANT(5),  /* level constant         @LAC*/ 08700000
*  PMAR_PLVL_E_VAL FIXED(8) CONSTANT(1), /* E-level constant     @P2A*/ 08710000
*  PMAR_PLVL_F_VAL FIXED(8) CONSTANT(2), /* F-level constant     @P2A*/ 08720000
*  PMAR_PLVL_AOS_VAL FIXED(8) CONSTANT(3), /* AOS-level constant @P2A*/ 08730000
*  PMAR_PLVL_XA_VAL FIXED(8) CONSTANT(4), /* XA-level constant   @P2A*/ 08740000
*  PMAR_PLVL_B1_VAL FIXED(8) CONSTANT(5), /* Binder version 1    @P2A*/ 08750000
*  PMAR_PLVL_B2_VAL FIXED(8) CONSTANT(6), /* Binder version 2    @L2A*/ 08760000
*  PMAR_PLVL_B3_VAL FIXED(8) CONSTANT(7), /* Binder version 3    @L3A*/ 08770000
*  PMAR_PLVL_B4_VAL FIXED(8) CONSTANT(8), /* Binder version 4    @L7A*/ 08780000
*  PMAR_PLVL_B5_VAL FIXED(8) CONSTANT(9), /* Binder version 5    @L8A*/ 08790000
*  PMAR_MAXLEN FIXED CONSTANT(      /* Maximum length of program user   08800000
*                                      data in an SMDE               */ 08810000
*            LENGTH(PMAR)+          /* Basic section length          */ 08820000
*            LENGTH(PMARL)          /* LSLoader section length       */ 08830000
*            );                     /*                           @P1D*/ 08840000
*DCL PMAR_MAXLEN_PROGOBJ FIXED(31)  /* Largest SMDE user data length    08850000
*                                      for program objects       @P1C*/ 08860000
*   CONSTANT(LENGTH(PMAR)+          /* Basic section length      @P1C*/ 08870000
*            LENGTH(PMARL));        /* Program object section length    08880000
*                                                                @P1C*/ 08890000
*DCL PMAR_MAXLEN_PO1     FIXED(31)  /* Largest SMDE user data length    08900000
*                                      for PO1                   @L2A*/ 08910000
*   CONSTANT(LENGTH(PMAR)+          /* Basic section length      @L2A*/ 08920000
*            OFFSET(PMARL.PMARL_PM2)); /* PO1 Section length     @L3C*/ 08930000
*DCL PMAR_MAXLEN_PO2     FIXED(31)  /* Largest SMDE user data length    08940000
*                                      for PM2-level PO          @L2A*/ 08950000
*   CONSTANT(LENGTH(PMAR)+          /* Basic section length      @L2A*/ 08960000
*            OFFSET(PMARL.PMARL_PM3));/* Program object section length  08970000
*                                                                @L3C*/ 08980000
*DCL PMAR_MAXLEN_PO3     FIXED(31)  /* Largest SMDE user data length    08990000
*                                      for PM3-level PO          @L3A*/ 09000000
*   CONSTANT(LENGTH(PMAR)+          /* Basic section length      @L3A*/ 09010000
*            OFFSET(PMARL.PMARL_PM4));/* Program object section length  09020000
*                                                                @L7C*/ 09030000
*DCL PMAR_MAXLEN_PO4     FIXED(31)  /* Largest SMDE user data length    09040000
*                                      for PM4-level PO          @L7A*/ 09050000
*   CONSTANT(LENGTH(PMAR)+          /* Basic section length      @L7A*/ 09060000
*            OFFSET(PMARL.PMARL_PM5));/* Program object section length  09070000
*                                                                @LAC*/ 09080000
*DCL PMAR_MAXLEN_PO5     FIXED(31)  /* Largest SMDE user data length    09090000
*                                      for PM5-level PO          @LAA*/ 09100000
*   CONSTANT(LENGTH(PMAR)+          /* Basic section length      @LAA*/ 09110000
*            LENGTH(PMARL));        /* Program object section length    09120000
*                                                                @LAA*/ 09130000
*DCL PMAR_MAXLEN_LOADMOD FIXED(31)  /* Largest SMDE user data length    09140000
*                                      for PDS load modules      @P1A*/ 09150000
*   CONSTANT(LENGTH(PMAR)+          /* Basic section length      @P1A*/ 09160000
*            LENGTH(PMARR));        /* Load module section length       09170000
*                                                                @P1A*/ 09180000
*DCL PMARL_LVL1LEN FIXED(31)        /* Length of PM1-Level PMARL @L2A*/ 09190000
*   CONSTANT(OFFSET(PMARL.PMARL_PM2));                         /*@L3C*/ 09200000
*DCL PMARL_LVL2LEN FIXED(31)        /* Length of PM2-Level PMARL @L3A*/ 09210000
*   CONSTANT(OFFSET(PMARL.PMARL_PM3));                         /*@L3A*/ 09220000
*DCL PMARL_LVL3LEN FIXED(31)        /* Length of PM3-Level PMARL @L7A*/ 09230000
*   CONSTANT(OFFSET(PMARL.PMARL_PM4));                         /*@L7A*/ 09240000
*DCL PMARL_LVL4LEN FIXED(31)        /* Length of PM4-Level PMARL @LAA*/ 09250000
*   CONSTANT(OFFSET(PMARL.PMARL_PM5));                         /*@LAA*/ 09260000
*DCL PMARL_LVL5LEN FIXED(31)        /* Length of PM5-Level PMARL @LAA*/ 09270000
*   CONSTANT(LENGTH(PMARL));                                   /*@LAA*/ 09280000
*%DEACT PMAR__BASE,PMARA__BASE;                                         09290000
*%END;                                                                  09300000
