*        %GOTO CIBL1;  /* BILINGUAL MAPPING                             00010000
         MACRO                                                          00020000
&CIBNAME IEZCIB  ,    */                                                00030000
*%CIBL1 : ;                                                             00040000
*/* ****START OF SPECIFICATIONS**********************************@01C*/ 00050000
*/*                                                                  */ 00060000
*/*01* MACRO NAME:  IEZCIB                                       @L4C*/ 00070000
*/*                                                              @01A*/ 00080000
*/*01* DSECT NAME:  CIBNAME, CIBX                                @P1C*/ 00090000
*/*                                                              @01A*/ 00100000
*/*01* DESCRIPTIVE NAME:  COMMAND INPUT BUFFER MAPPING MACRO     @L4C*/ 00110000
*/*01* ACRONYM: CIB                                              @L4C*/ 00120000
*/*                                                                  */ 00130000
*/*01* EXTERNAL CLASSIFICATION: GUPI                             @L4A*/ 00140000
*/*01*  END OF EXTERNAL CLASSIFICATION:                          @L4A*/ 00150000
*/*                                                              @01A*/ 00160000
*/*01* PROPRIETARY STATEMENT:                                    @L4C*/ 00170000
*/***PROPRIETARY_STATEMENT********************************************/ 00180000
*/*                                                                  */ 00190000
*/*                                                                  */ 00200000
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00210000
*/* 5694-A01 (C) COPYRIGHT IBM CORP. 1981, 2006                      */ 00230000
*/*                                                                  */ 00240000
*/* STATUS= HBB7730                                                  */ 00250000
*/*                                                                  */ 00260000
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 00270000
*/*                                                                  */ 00280000
*/*01* FUNCTION: BUFFER FOR START, STOP, MODIFY AND MOUNT        @L4C*/ 00290000
*/*    COMMANDS FROM CONSOLE OR TSO TERMINALS.                   @L4C*/ 00300000
*/*                                                              @01A*/ 00310000
*/*01* COMPONENT:  MASTER SCHEDULER (SC1B8)                      @L4C*/ 00320000
*/*                                                              @01A*/ 00330000
*/*01* EYE-CATCHER:  NONE.                                       @L4C*/ 00340000
*/*                                                              @01A*/ 00350000
*/*01* STORAGE ATTRIBUTES:                                       @L6C*/ 00360000
*/*02*   MAIN STORAGE: YES                                       @L4C*/ 00370000
*/*02*   VIRTUAL STORAGE: NO                                     @L4C*/ 00380000
*/*02*   AUXILIARY STORAGE: NO                                   @L4C*/ 00390000
*/*02*   DATA SPACE: NO                                          @L4C*/ 00400000
*/*02*   SUBPOOL:  245                                           @L4C*/ 00410000
*/*02*   KEY:  0                                                 @L4C*/ 00420000
*/*02*   RESIDENCY:  BELOW 16M                                   @L4C*/ 00430000
*/*                                                              @01A*/ 00440000
*/*01* SIZE: VARIABLE LENGTH BUT AT LEAST 16 BYTES               @L4A*/ 00450000
*/*            CIBNAME -- X'0018' bytes                              */ 00460000
*/*            CIBX    -- X'0030' bytes                              */ 00470000
*/*                                                              @01A*/ 00480000
*/*01* CREATED BY: IEEVSTAR, IEE0703D, IEEVMNT1                  @L4C*/ 00490000
*/*                                                              @01A*/ 00500000
*/*01* POINTED TO BY: COMCIBPT FIELD OF THE COM DATA AREA        @L4C*/ 00510000
*/*                 CHCIBP FIELD OF THE CSCB DATA AREA           @01A*/ 00520000
*/*                                                              @01A*/ 00530000
*/*01* SERIALIZATION: ENQ ON MAJOR SYSIEFSD MINOR Q10            @L4C*/ 00540000
*/*                                                                  */ 00550000
*/*01* METHOD OF ACCESS:                                         @L4C*/ 00560000
*/*      BAL  - A DSECT CARD SHOULD PRECEDE MACRO CALL. USING ON @01C*/ 00570000
*/*             CIBNEXT GIVES ADDRESSABILITY FOR ALL SYMBOLS.    @01M*/ 00580000
*/*      PL/S - DCL CIBPTR PTR                                   @01M*/ 00590000
*/*                                                                  */ 00600000
*/*  CHANGE ACTIVITY - G860P2G                               @G860P2G*/ 00610000
*/*    $L1=SP3133CS  JBB3313, 880610, PDCS: B1 SECURITY SUPPORT      */ 00620000
*/*    $L2=SP3134CR  JBB3313, 880729, PDCR: B1 SECURITY SUPPORT      */ 00630000
*/*    $01=OY45087   JBB3313, 910708, PDCM: LABEL NAME CORRECTIONS   */ 00640000
*/*    $02=OY46552   JBB3313, 910905, PDCR: RESERVED POINTER         */ 00650000
*/*    $L3=TSOOP,    HBB4410, 870916, PDBT: TSO OPERATOR             */ 00660000
*/*    $03=OW15497   HBB5510, 960222, PDED: Original console id      */ 00670000
*/*    $L4=CLONE7HD, HBB5520, 940310, PDHD: SYSCLONE SUPPORT         */ 00680000
*/*    $P1=PN70756,  HBB5520, 940615, PDZH: UPDATE DSECT NAME        */ 00690000
*/*    $P2=PQC0109,  HBB6603, 950815, PDHD: DEFINE CIBDATAS          */ 00700000
*/*    $L5=CNZ2A,    HBB7730, 040524, PDF9: 1-Byte Console Id        */ 00710000
*/*                                           Removal Part 2         */ 00720000
*/*    $L6=CNZ2A,    HBB7730, 040524, PDF9: Master Console & Switch  */ 00730000
*/*                                           Removal                */ 00740000
*/*    $04=OA12778,  JBB7727, 060123, PDED: TJID indicator           */ 00750000
*/*                                                                  */ 00760000
*/* ******************************************************************/ 00761000
*/*A (CIBSTCOM)   COMMAND CODE FOR 'STC COMMUNICATION'       @G860P2G*/ 00762000
*/*A (CIBX)       CIB EXTENSION                                  @L1A*/ 00763000
*/*A (CIBXDISC,CIBXDISR)  COMMAND DISPOSITION FLAGS              @L2A*/ 00764000
*/*C (CIBXAUT1,CIBXAUT2,CIBXAUT3) CORRECT INCONSISTENT LABELS    @01A*/ 00765000
*/*C (CIBXPTRC)   ADD RESERVED POINTER                           @02A*/ 00766000
*/*A (CIBXOCID)   ADD ORIGINAL CONSOLE ID                        @03A*/ 00767000
*/*A (CIBXDISE)   ADD BIT CIBXDISE FOR ARM                       @L4A*/ 00768000
*/*ADDED CIBX TO DSECT NAME                                      @P1C*/ 00769000
*/*C (CIBDATA) IN PLS, DEFINE CIBDATAS ON CIBDATA                @P2A*/ 00770000
*/*A (CIBCONID)   CHANGE CIBCONID TO BE RESERVED                 @L5A*/ 00780000
*/*A (CIBXDISM)   CHANGE COMMENT TO MATCH THAT OF CIBXDISA       @L6A*/ 00781000
*/*               (BOTH BITS ARE NEEDED)                         @L6A*/ 00782000
*/*A (CIBXFLG,CIBXTJY) Add bit indicating CIBASID contains a tjid@04A*/ 00783000
*/* ****END OF SPECIFICATIONS************************************@01C*/ 00784000
*%GOTO CIBL2;   /*                                                      00785000
*                                                                       00786000
&CIBNAME DS    0D -     CIBPTR                                          00787000
*                                                                       00788000
CIBNEXT  DS    A -      ADDRESS OF NEXT CIB IN QUEUE (ZERO FOR LAST)    00789000
CIBVERB  DS    C -      COMMAND VERB CODE                               00790000
CIBSTART EQU   X'04' -  COMMAND CODE FOR START                          00800000
CIBSTCOM EQU   X'08' -  COMMAND CODE FOR STC COMMUNICATION     @G860P2G 00810000
CIBMODFY EQU   X'44' -  COMMAND CODE FOR MODIFY                         00820000
CIBSTOP  EQU   X'40' -  COMMAND CODE FOR STOP                           00830000
CIBMOUNT EQU   X'0C' -  COMMAND CODE FOR MOUNT                          00840000
CIBLEN   DS    FL1 -    LENGTH IN DOUBLEWORDS OF CIB INCLUDING CIBDATA  00850000
CIBXOFF  DS    H   -    OFFSET TO CIB EXTENSION                    @L1C 00860000
         DS    XL2 -    RESERVED FOR CSCB COMPATIBILITY            @L1C 00870000
CIBASID  DS    0H -     ADDRESS SPACE ID (OS/VS2)                MDC001 00880000
CIBTJID  DS    CL2 -    TSO TERMINAL JOB IDENTIFIER (OS/VS1)     MDC001 00890000
CIBRSV01 DS    CL1      Reserved - was CIBCONID                    @L5C 00900000
CIBRSV1  DC    AL1(CIBVRSN)  -  VERSION LEVEL                      @L3C 00910000
CIBS313  EQU   1        VERSION LEVEL FOR MVS SP3.1.3              @02A 00920000
CIBS410  EQU   2        VERSION LEVEL FOR MVS SP41.0               @02C 00930000
CIB15497 EQU   3        VERSION LEVEL WITH OW15497 INSTALLED       @03A 00940000
CIBVRSN  EQU   CIB15497 VERSION LEVEL                              @03C 00950000
CIBDATLN DS    H -      LENGTH IN BYTES OF DATA IN CIBDATA              00960000
CIBDATA  DS    CL8 -    DATA FROM COMMAND OPERAND                       00970000
*        (LENGTH OF CIBDATA IS A MULTIPLE OF EIGHT BYTES                00980000
*        DEPENDING ON THE VALUE CONTAINED IN CIBLEN)                    00990000
*              START -  FOURTH POSITIONAL PARAMETER (PARMVALUE)         01000000
*              MODIFY - RESIDUAL OPERAND IMAGE FOLLOWING COMMA          01010000
*                       TERMINATING FIRST POSITIONAL PARAMETER          01020000
*              STOP -   NONE (CIB GENERATED ONLY TO GIVE CONSOLE ID)    01030000
*              STC COMMUNICATION - KEYWORD AND VALUE OF STC    @G860P2G 01040000
*                                  COMMUNICATION PARAMETER ON  @G860P2G 01050000
*                                  OPERATOR COMMAND            @G860P2G 01060000
*                                                                       01070000
CIBX     DSECT      -   CIB EXTENSION                              @L3A 01080000
*                                                                       01090000
CIBXUTOK DS    F    -   POINTER TO UTOKEN                          @L1A 01100000
CIBXAUTH DS    0CL2 -   COMMAND AUTHORITY CODE                     @L1A 01110000
CIBXAUTA DS    B        BYTE ONE                                   @L1A 01120000
CIBXAUT1 EQU   X'80'    COMMAND HAS SYS AUTHORITY                  @L1A 01130000
CIBXAUT2 EQU   X'40'    COMMAND HAS I/O AUTHORITY                  @L1A 01140000
CIBXAUT3 EQU   X'20'    COMMAND HAS CONS AUTHORITY                 @L1A 01150000
*              X'1F'    RESERVED                                   @L1A 01160000
CIBXAUTB DS    B        BYTE TWO, RESERVED                         @L1A 01170000
CIBXDISP DS    CL1  -   AUTHORITY OF COMMAND                       @L1A 01180000
CIBXDISA EQU   X'80'    COMMAND HAS MASTER AUTHORITY (IT IS            *01190000
                        SUGGESTED THAT CIBXDISM BE USED INSTEAD)   @L6C 01200000
CIBXDISM EQU   X'40'    COMMAND HAS MASTER AUTHORITY               @L6C 01210000
CIBXDISC EQU   X'20'    COMMAND ISSUED FROM AN MCS CONSOLE         @L2A 01220000
CIBXDISR EQU   X'10'    COMMAND ISSUED BEFORE RACF ACTIVE          @L2A 01230000
CIBXDISE EQU   X'08'    COMMAND WAS ISSUED BY ARM                  @L4A 01240000
*              X'07'    RESERVED                                   @L4C 01250000
CIBXFLG  DS    B        Flag byte                                  @04C 01260000
CIBXTJY  EQU   X'80'    CIBASID contains a tjid                    @04A 01270000
CIBXCNNM DS    CL8  -   CONSOLE NAME                               @L3A 01280000
CIBXCART DS    CL8  -   COMMAND & RESPONSE TOKEN                   @L3A 01290000
CIBXCNID DS    F    -   CONSOLE ID                                 @L3A 01300000
CIBXPTRC DS    F        RESERVED FOR IBM USE                       @02A 01310000
CIBXOCID DS    F        ORIGINATING CONSOLE ID (USED FOR AUTHORITY     *01320000
                        CHECKING)                                  @03A 01330000
CIBXRSVD DS    CL12     RESERVED                                   @03A 01340000
CIBXEND  EQU   *    -   END OF THE CIB EXTENSION                   @L3A 01350000
CIBXLEN  EQU   CIBXEND-CIBX     LENGTH OF THE CIB EXTENSION        @L3A 01360000
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * 01370000
*                                                                       01380000
         MEND  , */                                                     01390000
* %CIBL2  :  ;                                                          01400000
* DECLARE                                                               01410000
*   1 CIBNAME  BASED(CIBPTR) BDY(WORD),                                 01420000
*                                                                       01430000
*    2 CIBNEXT  PTR(31),             /* ADDRESS OF NEXT CIB IN QUEUE    01440000
*                                       (ZERO FOR LAST)              */ 01450000
*    2 CIBVERB  CHAR(1),             /* COMMAND VERB CODE            */ 01460000
*    2 CIBLEN   PTR(8),              /* LENGTH IN DOUBLEWORDS OF CIB    01470000
*                                       INCLUDING CIBDATA            */ 01480000
*    2 CIBXOFF  FIXED(15),           /* OFFSET TO CIB EXTENSION  @L1C*/ 01490000
*    2 *        CHAR(2) BDY(HWORD),  /* RESERVED FOR CSCB               01500000
*                                       COMPATIBILITY            @L1C*/ 01510000
*    2 CIBASID  FIXED(15),           /* ADDRESS SPACE ID (OS/VS2)       01520000
*                                                              MDC001*/ 01530000
*     3 CIBTJID  CHAR(2),            /* TSO TERMINAL JOB IDENTIFIER     01540000
*                                       (OS/VS1)               MDC001*/ 01550000
*    2 CIBRSV01 CHAR(1),             /* RESERVED - WAS CIBCONID  @L5C*/ 01560000
*    2 CIBRSV1  FIXED(8),            /* VERSION LEVEL            @L3C*/ 01570000
*    2 CIBDATLN FIXED(15),           /* LENGTH IN BYTES OF DATA IN      01580000
*                                       CIBDATA                      */ 01590000
*    2 CIBDATA  CHAR(8) BDY(WORD);   /* DATA FROM COMMAND OPERAND    */ 01600000
* DECLARE CIBDATAS CHAR(*) DEFINED(CIBDATA); /* FIELD FOR REFERRING     01610000
*                                       TO CIBDATA USING THE            01620000
*                                       SUBSTRING NOTATION       @P2A*/ 01630000
*                                                                       01640000
* /*     (LENGTH OF CIBDATA IS A MULTIPLE OF EIGHT BYTES             */ 01650000
* /*     DEPENDING ON THE VALUE CONTAINED IN CIBLEN)                 */ 01660000
* /*           START -  FOURTH POSITIONAL PARAMETER (PARMVALUE)      */ 01670000
* /*           MODIFY - RESIDUAL OPERAND IMAGE FOLLOWING COMMA       */ 01680000
* /*                    TERMINATING FIRST POSITIONAL PARAMETER       */ 01690000
* /*           STOP -   NONE (CIB GENERATED ONLY TO GIVE CONSOLE ID) */ 01700000
* /*           STC COMMUNICATION - KEYWORD AND VALUE OF STC  @G860P2G*/ 01710000
* /*                               COMMUNICATION PARAMETER   @G860P2G*/ 01720000
* /*                               ON OPERATOR COMMAND       @G860P2G*/ 01730000
* DECLARE                                                               01740000
*   1 CIBX BASED(ADDR(CIBNAME)+CIBXOFF)                                 01750000
*                       BDY(WORD),   /* CIB EXTENSION            @L3A*/ 01760000
*                                                                       01770000
*     3  CIBXUTOK PTR(31),           /* POINTER TO UTOKEN        @L1A*/ 01780000
*     3  CIBXAUTH CHAR(2),           /* COMMAND AUTHORITY CODE   @L1A*/ 01790000
*        5  CIBXAUTA BIT(8),         /* THIS FIELD CONTAINS COMMAND     01800000
*                                       AUTHORITY (SYS, I/O, OR CONS)   01810000
*                                                                @L1A*/ 01820000
*           7 CIBXAUT1 BIT(1),       /* COMMAND HAS SYS AUTHORITY       01830000
*                                                                @01C*/ 01840000
*           7 CIBXAUT2 BIT(1),       /* COMMAND HAS I/O AUTHORITY       01850000
*                                                                @01C*/ 01860000
*           7 CIBXAUT3 BIT(1),       /* COMMAND HAS CONS AUTHORITY      01870000
*                                                                @01C*/ 01880000
*           7 *       BIT(5),        /* RESERVED                 @L1A*/ 01890000
*        5  CIBXAUTB BIT(8),         /* RESERVED                 @L1A*/ 01900000
*     3  CIBXDISP  CHAR(1),          /* AUTHORITY OF COMMAND     @L1A*/ 01910000
*        5  CIBXDISA  BIT(1),        /* COMMAND HAS MASTER AUTHORITY    01920000
*                                       (IT IS SUGGESTED THAT CIBXDISM  01930000
*                                       BE USED INSTEAD)         @L6C*/ 01940000
*        5  CIBXDISM  BIT(1),        /* COMMAND HAS MASTER AUTHORITY    01950000
*                                                                @L6C*/ 01960000
*        5  CIBXDISC  BIT(1),        /* COMMAND ISSUED FROM MCS         01970000
*                                       CONSOLE                  @L2A*/ 01980000
*        5  CIBXDISR  BIT(1),        /* COMMAND ISSUED BEFORE RACF      01990000
*                                       ACTIVE                   @L2A*/ 02000000
*        5  CIBXDISE  BIT(1),        /* COMMAND ISSUED BY ARM    @L4A*/ 02010000
*        5  *         BIT(3),        /* RESERVED                 @L4C*/ 02020000
*     3  CIBXFLG  BIT(8),            /* Flag Byte                @04C*/ 02030000
*        5  CIBXTJY   BIT(1),        /* On indicates CIBASID contains   02040000
*                                       a tjid                   @04A*/ 02050000
*        5  *         BIT(7),        /* Reserved                 @04A*/ 02060000
*     3  CIBXCNNM CHAR(8),           /* CONSOLE NAME             @L3A*/ 02070000
*     3  CIBXCART CHAR(8),           /* COMMAND & RESPONSE TOKEN @L3A*/ 02080000
*     3  CIBXCNID FIXED(32),         /* CONSOLE ID               @L5C*/ 02090000
*     3  CIBXPTRC FIXED(31),         /* RESERVED FOR IBM USE     @03C*/ 02100000
*     3  CIBXOCID FIXED(32),         /* ORIGINATING CONSOLE ID (USED    02110000
*                                       FOR AUTHORITY CHECKING   @L5C*/ 02120000
*     3  CIBXRSVD CHAR(12);          /* RESERVED                 @03A*/ 02130000
*                                                                       02140000
* /*  * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *  */ 02150000
*                                                                       02160000
* DCL CIBSTART BIT(8) CONSTANT('04'X), /* COMMAND CODE FOR START        02170000
*                                                            @G860P2G*/ 02180000
*     CIBSTCOM BIT(8) CONSTANT('08'X), /* COMMAND CODE FOR STC          02190000
*                                         COMMUNICATION      @G860P2G*/ 02200000
*     CIBMOUNT BIT(8) CONSTANT('0C'X), /* COMMAND CODE FOR MOUNT        02210000
*                                                            @G860P2G*/ 02220000
*     CIBSTOP  BIT(8) CONSTANT('40'X), /* COMMAND CODE FOR STOP         02230000
*                                                            @G860P2G*/ 02240000
*     CIBMODFY BIT(8) CONSTANT('44'X), /* COMMAND CODE FOR MODIFY       02250000
*                                                            @G860P2G*/ 02260000
*     CIBVRSN FIXED(8) CONSTANT(CIB15497),/* VERSION LEVEL VALUE        02270000
*                                           FOR MVS SP41.0       @03C*/ 02280000
*     CIBS313  FIXED(8) CONSTANT(1),   /* VERSION LEVEL VALUE           02290000
*                                         FOR MVS SP3.1.3        @02A*/ 02300000
*     CIBS410  FIXED(8) CONSTANT(2),   /* VERSION LEVEL VALUE           02310000
*                                         FOR MVS SP41.0         @02C*/ 02320000
*     CIB15497 FIXED(8) CONSTANT(3),   /* VERSION LEVEL VALUE           02330000
*                                         WITH OW15497 INSTALLED @03A*/ 02340000
*     CIBXLEN  FIXED(31) CONSTANT(LENGTH(CIBX)); /* LENGTH OF THE       02350000
*                                         CIB EXTENSION          @L3A*/ 02360000
