*        % GOTO DEBL1;   /*                                             00000100
         MACRO                                                          00000200
         IEZDEB &LIST=NO                                                00000300
DEB      DSECT  ,   */                                                  00000400
*%DEBL1 : ;                                                             00000500
*                                                                       00000600
*/* **************************************************************** */ 00000700
*/*                                                                  */ 00000800
*/* $MAC(IEZDEB):    DEB MAPPING MACRO - BILINGUAL                   */ 00000900
*/*                                                                  */ 00001000
*/* DESCRIPTIVE-NAME = DATA EXTENT BLOCK                             */ 00001100
*/*                                                                  */ 00001200
*/* STATUS - Z/OS DFSMS V2R05                                    @MXC*/ 00001300
*/*                                                                  */ 00001400
*/*PROPRIETARY V3 STATEMENT                                          */ 00001500
*/*LICENSED MATERIALS - PROPERTY OF IBM                              */ 00001600
*/*"RESTRICTED MATERIALS OF IBM"                                     */ 00001700
*/*5650-ZOS                                                          */ 00001800
*/*COPYRIGHT IBM CORP. 1982, 2017                                    */ 00001900
*/*END PROPRIETARY V3 STATEMENT                                      */ 00002000
*/*                                                                  */ 00002100
*/* FUNCTION = MAPPING MACRO                                         */ 00002200
*/*      THE DATA EXTENT BLOCK (DEB) CONTAINS AN EXTENSION OF        */ 00002300
*/*      INFORMATION IN THE DCB OR ACB. EACH DEB IS ASSOCIATED WITH  */ 00002400
*/*      A DCB OR ACB, AND THE TWO POINT TO EACH OTHER.  THE DEB     */ 00002500
*/*      TYPICALLY CONTAINS INFORMATION CONCERNING THE PHYSICAL      */ 00002600
*/*      CHARACTERISTICS OF THE DATA SET AND OTHER INFORMATION THAT  */ 00002700
*/*      IS USED BY THE CONTROL PROGRAM.                             */ 00002800
*/*    METHOD OF ACCESS                                              */ 00002900
*/*      PL/X - DCL (DEBPTR,DEBDAPTR,DEBEXPTR,DEBSBPTR) PTR      @MXC*/ 00003000
*/*      BAL  - FIVE DSECTS ARE PRODUCED.  USING ON A DSECT NAME     */ 00003100
*/*             GIVES ADDRESSABILITY FOR ALL SYMBOLS WITHIN THAT     */ 00003200
*/*             DSECT.  THE DSECT NAMES AND THE SECTIONS WITHIN EACH */ 00003300
*/*             DSECT ARE                                            */ 00003400
*/*                                                                  */ 00003500
*/*             DEB ***  APPENDAGE VECTOR TABLE SECTION              */ 00003600
*/*                      PREFIX TABLE                                */ 00003700
*/*                      BASIC SECTION                               */ 00003800
*/*                      UNIT RECORD, MAGNETIC TAPE AND              */ 00003900
*/*                        TELECOMMUNICATIONS DEVICES SECTION        */ 00004000
*/*                      3540 ACCESS METHOD DEPENDENT SECTION@X04AA9A*/ 00004100
*/*                      ISAM DEPENDENT SECTION                      */ 00004200
*/*                      *** POINTERS TO THE DEB IN OTHER CONTROL    */ 00004300
*/*                          BLOCKS SUCH AS DCB POINT TO THE BASIC   */ 00004400
*/*                          SECTION.  USING ON DEBBASIC GIVES       */ 00004500
*/*                          ADDRESSABILITY FOR BASIC SECTION AND    */ 00004600
*/*                          NEXT TWO SECTIONS.  DEBAPPAD IN BASIC   */ 00004700
*/*                          SECTION CONTAINS ADDRESS OF APPENDAGE   */ 00004800
*/*                          VECTOR TABLE (AVT) SECTION.  PREFIX     */ 00004900
*/*                          FOLLOWS AVT SECTION IN THE MAPPING BUT  */ 00005000
*/*                          NOT NECESSARILY IN THE REAL DEB.        */ 00005100
*/*             DEBDASD  DIRECT ACCESS STORAGE DEVICE SECTION        */ 00005200
*/*             DEBACSMD EXCP, BSAM AND QSAM DEPENDENT SECTION       */ 00005300
*/*                      BPAM DEPENDENT SECTION                      */ 00005400
*/*                      BDAM DEPENDENT SECTION                      */ 00005500
*/*                      BTAM DEPENDENT SECTION                      */ 00005600
*/*                      GAM DEPENDENT SECTION                       */ 00005700
*/*                      ISAM LOAD MODE EXTENSION **                 */ 00005800
*/*                      ISAM SCAN MODE EXTENSION **                 */ 00005900
*/*                      BISAM MODE EXTENSION **                     */ 00006000
*/*                      ** FOR THESE 3 EXTENSIONS, LOAD REGISTER    */ 00006100
*/*                         FROM DEBEXPT IN ISAM DEPENDENT SECTION   */ 00006200
*/*                         TO SET REGISTER FOR USING.               */ 00006300
*/*             DEBSUBNM SUBROUTINE NAME SECTION                     */ 00006400
*/*             DEBXTN   DEB EXTENSION                           @MXC*/ 00006500
*/*                                                                  */ 00006600
*/*             WHEN LISTING IS SUPPRESSED, YOU CAN DETERMINE WHICH  */ 00006700
*/*             DSECT A SYMBOL IS IN BY USING THE STATEMENT NUMBER   */ 00006800
*/*             IN THE DEFN COLUMN IN THE CROSS REFERENCE LISTING.   */ 00006900
*/*             FOR EXAMPLE, ANY SYMBOL DEFINED BETWEEN THE          */ 00007000
*/*             STATEMENT NUMBERS FOR DEBDASD AND DEBACSMD IS IN     */ 00007100
*/*             THE DIRECT ACCESS STORAGE DEVICE SECTION.            */ 00007200
*/*   HOW TO CALL                                                    */ 00007300
*/*                                                                  */ 00007400
*/*      ASSEMBLER  - SPECIFY LIST=YES ON MACRO CALL                 */ 00007500
*/*      PL/X - SPECIFY %IHALIST='YES' BEFORE INCLUDE                */ 00007600
*/*      PL/X DEBPREFX - SPECIFY %DEBPRES='YES' BEFORE INCLUDE IF    */ 00007700
*/*                      THE DEB PREFIX IS NOT CONTIGUOUS WITH THE   */ 00007800
*/*                      APPENDAGE VECTOR TABLE.                     */ 00007900
*/*                    - SPECIFY %RLSPRES='YES' BEFORE INCLUDE IF    */ 00008000
*/*                      THE DEB PREFIX IN FRONT OF AND CONTIGUOUS   */ 00008100
*/*                      TO DEBBASIC iS ACCESSED IN CROSS-MEMORY     */ 00008200
*/*                      MODE.                                   @PAA*/ 00008300
*/*                                                                  */ 00008400
*/*      FOR INTEGRATION, A LISTING SHOULD NOT BE REQUESTED.         */ 00008500
*/*                                                                  */ 00008600
*/*                                                                  */ 00008700
*/* **************************************************************** */ 00008800
*/*                                                                  */ 00008900
*/*  CHANGE-ACTIVITY                                                 */ 00009000
*/*                                                                  */ 00009100
*/*       OS/VS2 RELEASE 3.0 AND 3.7 PTF, 12/20/77, LEVEL=2          */ 00009200
*/*                                                          @ZA34098*/ 00009300
*/*       OS/VS2 RELEASE 3.8   CHANGES, DELETIONS, ADDITIONS         */ 00009400
*/* A046250,A046500,A046750                                  @ZA51573*/ 00009500
*/*                                                                  */ 00009600
*/*$H2=CALYPSO,JDM1136,T800475,STLBGB: DEVICE SUPPORT            @H2A*/ 00009700
*/*$01=SAMELBP,JDM1138,OZ55553,SLTRRB:                           @01A*/ 00009800
*/*$L1=DFP,HDP1102,,STLDAN: BASE AVT ON 3-BYTE ADDRESS           @L1A*/ 00009900
*/*$L2=DFP,HDP1102,,STLDAN: MINOR ENHANCEMENTS                   @L2A*/ 00010000
*/*$L3=DFP,HDP1102,,STLDHC: BASE ISAM ON 3-BYTEADDRESS           @L3A*/ 00010100
*/*$L4=3380M13,JDP1110,T820757,STLHGM: 3380 MODEL 13 DASD SUPPORT@L4A*/ 00010200
*/*$L5=HARP,HDP1202,STLOCE:PREVENT I/O                           @L5A*/ 00010300
*/*$L6=BLOCKID,HDP1202,STLRJM:3480 BLOCKID CHECK                 @L6A*/ 00010400
*/*$L7=DFP,HDP2210,STLPD:CORRECT CACH EQUATES                    @L7A*/ 00010500
*/*$05=OZ83382,JDP1111,,FEGHA: INCORRECT EQUATES IN IEZDEB       @05A*/ 00010600
*/*$06=OY01921,HDP2210,,ISGGHA: ADD FLAGBYTE FOR VOL SER CHKING  @06A*/ 00010700
*/*$L8=DFP,HDP3310,86174,STLDJP: SYSTEM DETERMINED BLOCKSIZE     @L8A*/ 00010800
*/*$08=OY03994,HDP2230,STLRDB: NRD,FASTWRITE SUPPORT             @08A*/ 00010900
*/*$L9=RACF18,HDP3310,,STLMV: PROGRAM LIBRARY EXEC ONLY PROTECT  @L9A*/ 00011000
*/*$LA=DFP,HDP3310,87027,STLCMS: CACHE ATTRIBUTE SELECTION       @LAA*/ 00011100
*/*$LB=OY07704,HDP2230,STLJAH: BYPASS EXCP PREFIX                @LBA*/ 00011200
*/*$LC=OY07766,HDP2230,871116,STLCMS: PDS INTEGRITY              @LCA*/ 00011300
*/*$LD=PDSEIND,HDP3320,,STLJRM: PDSE SUPPORT                     @LDA*/ 00011400
*/*$09=OY14726,HDP3300,NSDGAE: DEFINE DEBXIMSC FOR IMS           @09A*/ 00011500
*/*                                                                  */ 00011600
*/*         MVS/XA DFP 3.1 CHANGES AND DELETIONS                     */ 00011700
*/*$H3=3480X,JDP3311,88281,STLFAO: 3480 COMPACTION SUPPORT       @H3A*/ 00011800
*/*$10=OY23442,JDP3311,89173,STLCMS: MOVE DEBCASFT TO DEBX       @10A*/ 00011900
*/*$11=OY44413,HDP3330,073091,SJPLJAL: SMS GUAR SPACE DATA SET   @11A*/ 00012000
*/*                                    DOESN'T EXTEND ON VOL2    @11A*/ 00012100
*/*$JB=STATS,HDP4410,101791,SJPLJAB:  I/O STATS                  @JBA*/ 00012200
*/*$LE=STRIPES,JDZ1110,920212,SJPLREB: STRIPING SUPPORT          @LEA*/ 00012300
*/*$12=OY57730,JDZ1110,092992,SJPLGEC: "ATTRIBUTE EXTENSION"     @12A*/ 00012400
*/*                                    DATASET SUPPORT           @12A*/ 00012500
*/*$13=OY58424,JDZ1110,920713,SJPLMV: ATL BIG3 SUPPORT           @13A*/ 00012600
*/*$14=OW00739,HDZ11B0,920721,SJPLGEC: CHECKPOINTED D/S SUPPORT  @14A*/ 00012700
*/*$15=OW03748,HDZ11B0,940221,SJPLGEC: MULTIVOLUME SINGLE STRIPE @15A*/ 00012800
*/*                                    SUPPORT                   @15A*/ 00012900
*/*$P1=KRL0290,HDZ11C0,940207,SJPLGEC: VSAM RLS SUPPORT          @P1A*/ 00013000
*/*$16=OW08707,HDZ11B0,931013,SJPLMV: ENFORCE ATL/SPECIFIC MEDIA @16A*/ 00013100
*/*$P2=K130995,HDZ11C0,950112,SJPLGEC: DEBOPTAB OPTIONS UPDATE   @P2A*/ 00013200
*/*$LF=K130891,HDZ11C0,950224,SJPLJAL: EXCP DCB XTIOT SUPPORT    @LFA*/ 00013300
*/*$17=K131665,HDZ11C0,950314,SJPLJAL: DEB2XUOF LENGTH IN PLX    @17A*/ 00013400
*/*$P3=K132667,HDZ11C0,960615,SJPLGEC: DEFINE EXTENT AREA CLNUP  @P3A*/ 00013500
*/*$P4=XSAM,HDZ11C0.950504,SJPLGEC: HFS/REMOTE FILE SUPPRT       @P4A*/ 00013600
*/*$LG=OW15640,HDZ11C0,951015,SJPLJAL: DETECT MISSING TAPE VOLS  @LGA*/ 00013700
*/*$P5=VSAMXSAM,HDZ11C0,960422,SJPLGEC: VSAM HFS SUPPORT         @P5A*/ 00013800
*/*$LH=DSSCPOIT,HDZ11D0,960917,SJPLGEC: REMOVE DEBXCKPT          @LHA*/ 00013900
*/*$18=OW20923,HDZ11C0,960611,SJPLMV:  DCME ENHANCEMENT          @18A*/ 00014000
*/*$P6=TVS,HDZ11E0,970709,SJPLGEC: TRANSACTIONAL VSAM SUPPORT    @P6A*/ 00014100
*/*$LI=DEBTBL,HDZ11E0.971030,SJPLGEC: DEB TABLE SIZE INCREASE    @LIA*/ 00014200
*/*$LJ=ANSIV4,HDZ11E0,981231,SJPLJAL: ANSI VERSION 4 SUPPORT     @LJA*/ 00014300
*/*$19=OW36487,HDZ11E0,981130,SJPLGEC: TVS RLS CHANGES           @19A*/ 00014400
*/*$LK=GT32K,HDZ11F0,980727,SJPLRK:  >32K TAPE BLOCK SIZES       @LKA*/ 00014500
*/*$LL=OW38717,HDZ11E0,990630,SJPLJAL: BLYTHE2 SUPPORT           @LLA*/ 00014600
*/*$LM=OW45309,HDZ11F0,000730,SJPLJAL: MTL SUPPORT               @LMA*/ 00014700
*/*$LO=KFI0220,HDZ11G0,010730,SJPLJAL: IEC708I FOR DASD          @LOA*/ 00014800
*/*$LP=KFI0204,HDZ11G0,010830,SJPLJAL: INVALID TEPEPARP TO FILEE @LPA*/ 00014900
*/*                                    TAPE INSTALLATION EXIT    @LPA*/ 00015000
*/*$LQ=OW49828,HDZ11F0,010730,SJPLJAL: CUPE                      @LQA*/ 00015100
*/*$LR=LGEVOL,HDZ11F0,010828,SJPLGEC: LARGE VOLUME SUPPORT       @LRA*/ 00015200
*/*$LN=USSPO,HDZ11H0,001011,SJPLGEC: BPAM USS DIRECTORY SUPPORT  @LNA*/ 00015300
*/*$LS=MLSL,HDZ11H0,011128,SJPLMV: MULI-LEVEL SECURITY (MLS)     @LSA*/ 00015400
*/*$20=OW53224,HDZ11G0,020230,SJPLJAL: 0C4 IFG0552F              @20A*/ 00015500
*/*$LT=EDI,HDZ11H0,020501,SJPLMV: ENHANCED DATA INTEGRITY        @LTA*/ 00015600
*/*$P7=K1H0451,HDZ11H0,020624,SJPLMV: EDI USE CNT NOT DECREMENT  @P7A*/ 00015700
*/*$LU=OA02201,HDZ11H0,030530,SJPLJAL: VENTANA SUPPORT           @LUA*/ 00015800
*/*$21=OA04810,HDZ11H0,031030,SJPLJAL: PASS EXTEND BLOCKS TO RMM @21A*/ 00015900
*/*$LV=GT64KT,HDZ11K0,031113,SJPLGECD: LARGE SEQUENTIAL D/S      @LVA*/ 00016000
*/*                                      SUPPORT                 @LVA*/ 00016100
*/*$LW=RMMTDSA,HDZ1180,050630,SJPLJAL: RMM TAPE DS AUTHORIZATION @LWA*/ 00016200
*/*$22=OA13458,HDZ11K0,051030,SJPLJAL: ABEND130 WRONG SCOPE      @22A*/ 00016300
*/*$LX=OA13100,HDZ11K0,050630,SJPLJAL: JAG2 SUPPORT              @LXA*/ 00016400
*/*$LY=K190028,HDZ1190,060404,SJPLJAL/SJPLGEC: DEB INTEG SUPPORT @LYA*/ 00016500
*/*$23=OA15618,HDZ1180,060330,SJPLJAL: IEC205I BLKCNT WRONG      @23A*/ 00016600
*/*$24=OA17102,HDZ1180,060627,SJPLGEC: ICKDSF SUPPORT            @24A*/ 00016700
*/*$LZ=BSMPERF,HDZ1190,060623,SJPLGEC: BSAM PGFIX PERFORMANCE SPT@LZA*/ 00016800
*/*$L11=EAV,HDZ1A10,060726,SJPLGEC: EXTENDED ADDRESS VOLUME SPT @L11A*/ 00016900
*/*$LY=OA17569,HDZ1180,060830,SJPLJAL: TAPE ENCRYPTION           @LYA*/ 00017000
*/*$P8=K1A1087,HDZ1A10,070724,SJPLGEC: UPDATE COMMENTS           @P8A*/ 00017100
*/*$25=OA19502,HDZ1190,070230,SJPLJAL: KEY EXCH TIME TO SMF14/15 @25A*/ 00017200
*/*$P9=K1A1586,HDZ1A10,071030,SJPLJAL: CORRECT COMMENTS          @P9A*/ 00017300
*/*$L10=EAVDCR,HDZ1A10,071018,SJPLGEC: BAM EXCP SMF CHANGES     @L10A*/ 00017400
*/*$L12=OCERAS,HDZ1A10,071022,SJPLGEC: ADD BACKPOINTER TO DEBX  @L12A*/ 00017500
*/*                                    K1A1682                  @L12A*/ 00017600
*/*$MX=BAMXTIOT,HDZ1C10,090430,SJPLJAL:  BAM XTIOT NOCAPT SUPPORT@MXA*/ 00017700
*/*$LZ=OA22131,HDZ1B10,071029,SJPLJAL: JAG3 SUPPORT              @LZA*/ 00017800
*/*$26=OA29647,HDZ1B10,090730,SJPLJAL: 937 RC28                  @26A*/ 00017900
*/*$L13=DCBERAS,HDZ1D10,100218,SJPLGEC: DCBE INVALID RAS SMF    @L13A*/ 00018000
*/*$L14=MSDN,HDZ1D10,100222,SJPLGEC: MULTSDN CONCATENATION SPT  @L14A*/ 00018100
*/*$L15=DCBERAS,HDZ1D10,100505,SJPLGEC: RENAME FLAG BITS        @L15A*/ 00018200
*/*$L16=SAMTRACE,HDZ1D10,100722,SVLTM: SAM Internal trace flag  @L16A*/ 00018300
*/*$M4=FREEEOV,HDZ1D10,100330,SJPLJAL: FREE=EOV JCL SUPPORT      @M4A*/ 00018400
*/*$PA=K1D0590,HDZ1D10,101007,SJPLLLL: ADD VIAPTR TO DEBPREFX    @PAA*/ 00018500
*/*$PB=K1D0698,HDZ1D10,101103,SJPLGEC: DEFINE DEBACSMDE          @PBA*/ 00018600
*/*$PC=K1D0972,HDZ1D10,110303,SJPLJAL: DEFINE DEB2XFG7           @PCA*/ 00018700
*/*$L17=EF2,HDZ2210,110208,SJPLGEC: EXTEND FORMAT TYPE 2 SUPPORT@L17A*/ 00018800
*/*$PD=K210209,HDZ2210,110620,SJPLGEC: MOVE DEB2XDSV AND         @PDA*/ 00018900
*/*                                 EXTEND DEB2X                 @PDA*/ 00019000
*/*$27=OA32359,HDZ1D10,101031,SJPLJAL: INCREASE MAXIMUM BLOCKS   @27A*/ 00019100
*/*$M9=OA33954,HDZ1D10,100930,SJPLJAL: JAG4 SUPPORT              @M9A*/ 00019200
*/*$28=OA37022,HDZ1D10,110730,SJPLJAL: DEVICE TYPE NOT CORRECT   @28A*/ 00019300
*/*$29=K210516,HDZ2210,110907,SJPLJAL: IEZDEB COMPATIBILITY W/PLS@29A*/ 00019400
*/*$MC=K210607,HDZ2210,111002,SJPLJAL: TAPE INPUT PERFORMANCE    @MCA*/ 00019500
*/*$30=OA37977,HDZ1D10,111231,SJPLJAL: NO IEC988I WHEN CONCAT    @30A*/ 00019600
*/*$30=OA38582,HDZ1D10,120238,SJPLJAL: AE OA37977                @30A*/ 00019700
*/*$31=SM01044,HDZ2210,121031,SJPLJAL: PART RLSE SUBSEQUENT VOLS @31A*/ 00019800
*/*$MD=OA41664,HDZ2220,130430,SJPLJAL: COMPRESSION BITS          @MDA*/ 00019900
*/*$ME=OA42197,HDZ2210,130530,SJPLJAL: ZEDC                      @MEA*/ 00020000
*/*$32=OA43930,HDZ2210,140128,SJPLJAL: TP RDBACK MISPOSITIONING  @32A*/ 00020100
*/*$MF=SM02969,HDZ2220,140930,SJPLJAL: NEW BIT IN DEB2X          @MFA*/ 00020200
*/*$MG=SM03272,HDZ2220,140930,SJPLJAL:                           @MGA*/ 00020300
*/*$33=OA46716,HDZ2220,141208,RSTLAY:  DEFINE DEBXIMG BIT        @33A*/ 00020400
*/*$34=OA47942,HDZ2220,160208,SVLMDC:  SECURITY CHANGES          @34A*/ 00020500
*/*$35=OA50023,HDZ2220,160331,MDCASAD: SPIN LOOPS ON BPAM BUT DS @35A*/ 00020600
*/*                                    ISN'T PDS, PDSE, OR UNIX  @35A*/ 00020700
*/*                                    DIRECTORY                 @35A*/ 00020800
*/*$L18=W212074,HDZ2230,170714,MDCASAD: DEB SECURITY & INTEGRITY@L18A*/ 00020900
*/*$36=OA51657,HDZ2240,170729,SJPLAPM: DADSM FAILED TO EXTEND TO @36A*/ 00021000
*/*                                    NEW VOL DUE TO ABEND X37  @36A*/ 00021100
*/*    W239278,HDZ2240,MAR2018,SVLTHN: Restored OA51657 changes 1@36A*/ 00021200
*/*$L18=W237858,HDZ2240,FEB2018,SVLTHN: Redefined DEBXDEBLOCKX  1L18A*/ 00021300
*/*$L19=ENCRYPT,HDZ2240,190911,TUCJRB: Basic/large format data  @L19A*/ 00021400
*/*                                    set encryption support   @L19A*/ 00021500
*/*$L20=ENCRYPT,HDZ2250,200811,ALBERTM:                         @L20A*/         
*/*     1. Define new DEB2XFLG8 bit as an indicator to update   @L20A*/         
*/*        SMF14/15 records. If flag is set on, the application @L20A*/         
*/*        program is enabled for basic and large format data   @L20A*/         
*/*        encryption with EXCP (DSENCRYPT=OK).                 @L20A*/         
*/* **************************************************************** */ 00021600
*                                                                       00021700
*%GOTO DEBL2;  /*                                                       00021800
         PUSH  PRINT                                                    00021900
         AIF   ('&LIST' EQ 'YES').DEB1                                  00022000
         PRINT OFF                                                      00022100
.DEB1    ANOP                                                           00022200
         SPACE 1                                                        00022300
**********************************************************************  00022400
*    APPENDAGE VECTOR TABLE SECTION OF THE DEB.  Pointed to by    @MXC* 00022500
*    DEBAPPAD.  Contiguous with DEB prefix if built by OPEN.      @MXC* 00022600
**********************************************************************  00022700
         SPACE 1                                                        00022800
DEBAVT   DS    0D        APPENDAGE VECTOR TABLE                         00022900
DEBEOEA  DS    0A        ADDRESS OF END-OF-EXTENT APPENDAGE ROUTINE     00023000
*                                                                ICB280 00023100
DEBEOEAB DS    B         FLAG BYTE                               ICB280 00023200
DEBTCAMQ EQU   DEBEOEA   TCAM USES AS WORK AREA (BITS 0-3)     @ZA34098 00023300
DEBEOENP EQU   X'0F'     NUMBER OF 2K PAGES TO BE FIXED FOR THE         00023400
*                        END-OF-EXTENT APPENDAGE                 ICB280 00023500
DEBEOEAD DS    AL3       ADDRESS OF END-OF-EXTENT APPENDAGE ROUTINE     00023600
*                                                                ICB280 00023700
DEBSIOA  DS    0A        ADDRESS OF START I/O APPENDAGE ROUTINE  ICB280 00023800
DEBSIOAB DS    B         FLAG BYTE                               ICB280 00023900
DEBPGFX  EQU   X'80'     ADDRESS IN DEBSIOAD CAN BE USED TO DETERMINE   00024000
*                        THE ENTRY POINT TO THE PAGE FIX (PGFX)         00024100
*                        APPENDAGE ROUTINE BY ADDING 4 TO THE ADDRESS   00024200
*                        IN DEBSIOAD                             ICB280 00024300
DEBSIOX  EQU   X'40'     IF ZERO, DO NOT ENTER SIO APPENDAGE WHEN ERP   00024400
*                        IS ACTIVE.  IF ONE, ENTER SIO APPENDAGE EVEN   00024500
*                        WHEN ERP IS ACTIVE.                     ICB372 00024600
DEBIOVR  EQU   X'20'     IF ONE, EXCPVR REQUEST IS VALID.  IF ZERO,     00024700
*                        EXCPVR REQUEST IS INVALID AND WILL NOT BE      00024800
*                        EXECUTED. CURRENTLY HAS NO EFFECT.      ICB401 00024900
DEBFIX   EQU   X'10'     INDICATION THAT DEB HAS BEEN FIXED (OS/VS2)    00025000
*                        (MDC032)                                YM5929 00025100
DEBSIONP EQU   X'0F'     NUMBER OF 2K PAGES TO BE FIXED FOR THE         00025200
*                        SIO APPENDAGE                           ICB280 00025300
DEBSIOAD DS    AL3       ADDRESS OF START I/O APPENDAGE ROUTINE  ICB280 00025400
DEBPCIA  DS    0A        ADDRESS OF PCI APPENDAGE ROUTINE        ICB280 00025500
DEBPCIAB DS    B         FLAG BYTE                               ICB280 00025600
DEBRSV24 EQU   X'80',,C'X' RESERVED                                     00025700
DEBRSV25 EQU   X'40',,C'X' RESERVED                                     00025800
DEBRSV26 EQU   X'20',,C'X' RESERVED                                     00025900
DEBRSV27 EQU   X'10',,C'X' RESERVED                                     00026000
DEBPCINP EQU   X'0F'     NUMBER OF 2K PAGES TO BE FIXED FOR THE         00026100
*                        PCI APPENDAGE                           ICB280 00026200
DEBPCIAD DS    AL3       ADDRESS OF PROGRAM-CONTROLLED-INTERRUPTION     00026300
*                        (PCI) APPENDAGE ROUTINE                 ICB280 00026400
DEBCEA   DS    0A        ADDRESS OF CHANNEL-END APPENDAGE ROUTINE       00026500
*                                                                ICB280 00026600
DEBCEAB  DS    B         FLAG BYTE                               ICB280 00026700
DEBESMVR EQU   X'80',,C'X' VALIDITY CHECK FOR EXCPVR CALLER    @ZA34098 00026800
DEBRSV29 EQU   X'40',,C'X' RESERVED                                     00026900
DEBRSV30 EQU   X'20',,C'X' RESERVED                                     00027000
DEBRSV31 EQU   X'10',,C'X' RESERVED                                     00027100
DEBCENP  EQU   X'0F'     NUMBER OF 2K PAGES TO BE FIXED FOR THE         00027200
*                        CHANNEL-END APPENDAGE                   ICB280 00027300
DEBCEAD  DS    AL3       ADDRESS OF CHANNEL-END APPENDAGE ROUTINE       00027400
*                                                                ICB280 00027500
DEBXCEA  DS    0A        ADDRESS OF ABNORMAL-END APPENDAGE ROUTINE      00027600
*                                                                ICB280 00027700
DEBXCEAB DS    B         FLAG BYTE                               ICB280 00027800
DEBRSV32 EQU   X'80',,C'X' RESERVED                                     00027900
DEBRSV33 EQU   X'40',,C'X' RESERVED                                     00028000
DEBRSV34 EQU   X'20',,C'X' RESERVED                                     00028100
DEBRSV35 EQU   X'10',,C'X' RESERVED                                     00028200
DEBXCENP EQU   X'0F'     NUMBER OF 2K PAGES TO BE FIXED FOR THE         00028300
*                        ABNORMAL-END APPENDAGE                  ICB280 00028400
DEBXCEAD DS    AL3       ADDRESS OF ABNORMAL-END APPENDAGE ROUTINE      00028500
*                                                                ICB280 00028600
DEBAVTE  EQU   *                  END OF APPENDAGE VECTOR TABLE    @L2A 00028700
         SPACE 1                                                        00028800
**********************************************************************  00028900
*                    DEB PREFIX TABLE                                *  00029000
**********************************************************************  00029100
         SPACE 1                                                        00029200
DEBPREFX DS    0A        DEB PREFIX TABLE                               00029300
DEBWKARA DS    XL1       O/C/E WORK AREA (DIRECT ACCESS)                00029400
DEBDSCBA DS    XL7       DSCB ADDRESS (BBCCHHR) USED BY O/C/E           00029500
*                        (DIRECT ACCESS)                                00029600
DEBXTNP  DS    0A        POINTER TO DEB EXTENSION (OS/VS2)       MDC008 00029700
DEBDCBMK DS    XL4       DCB MODIFICATION MASK USED BY O/C/E            00029800
*                        OBSOLETE                                MDC009 00029900
DEBLNGTH DS    BL1       LENGTH OF DEB IN DOUBLE WORDS.  If it     @MXC*00030000
                         exceeds 2040 bytes (X'FF' doublewords),   @MXA*00030100
                         the excess bits are ignored               @MXA 00030200
DEBAMTYP DS    C         ACCESS METHOD TYPE                      ICB380 00030300
DEBAMNON EQU   0         ACCESS METHOD TYPE NOT KNOWN              @L2A 00030400
DEBAMVSM EQU   1                  VSAM ACCESS METHOD TYPE          @L2A 00030500
DEBAMXCP EQU   2                  EXCP ACCESS METHOD TYPE          @L2A 00030600
DEBAMTCM EQU   4                  TCAM ACCESS METHOD TYPE          @L2A 00030700
DEBAMGAM EQU   8                  GRAPHICS ACCESS METHOD TYPE      @L2A 00030800
DEBAMTAM EQU   16                 BTAM ACCESS METHOD TYPE          @L2A 00030900
DEBAMBPM EQU   32                 BPAM ACCESS METHOD TYPE          @L2A 00031000
DEBAMSAM EQU   32                 SEQUENTIAL ACCESS METHOD TYPE    @L2A 00031100
DEBAMBDM EQU   64                 DIRECT ACCESS METHOD TYPE        @L2A 00031200
DEBAMISM EQU   128                ISAM ACCESS METHOD TYPE          @L2A 00031300
DEBAMSUB EQU   129                SUBSYSTEM ACCESS METHOD TYPE     @L2A 00031400
DEBAMVTM EQU   130                VTAM ACCESS METHOD TYPE          @L2A 00031500
DEBAMTAP EQU   132                TCAM APPLICATION ACC METHOD TYPE @L2A 00031600
DEBTBLOF DS    H         Identifier in DEB table for the entry     @MXC 00031700
*                        for this DEB                              @MXC 00031800
DEBPREFE EQU   *         END OF DEB PREFIX TABLE                   @L2A 00031900
         SPACE 1                                                        00032000
*********************************************************************** 00032100
*                     DEB BASIC SECTION                               * 00032200
*********************************************************************** 00032300
         SPACE 1                                                        00032400
DEBBASIC EQU   *                                                        00032500
DEBTCBAD DS    0A        ADDRESS OF TCB FOR THIS DEB                    00032600
DEBAMID  DS    0BL1      VTAM/TCAM DEB ID FLAG                 @ZA51573 00032700
DEBTAMID EQU   X'00'     TCAM DEB ID                           @ZA51573 00032800
DEBVAMID EQU   X'0F'     VTAM DEB ID                           @ZA51573 00032900
DEBNMSUB DS    BL1       NUMBER OF SUBROUTINES LOADED BY OPEN           00033000
*                        EXECUTOR ROUTINES                              00033100
DEBTCBB  DS    AL3       ADDRESS OF TCB FOR THIS DEB                    00033200
DEBDEBAD DS    0A        ADDRESS OF THE NEXT DEB IN THE SAME TASK       00033300
DEBAMLNG DS    BL1       NUMBER OF BYTES IN THE ACCESS METHOD DEPENDENT 00033400
*                        SECTION.  FOR BDAM THIS FIELD CONTAINS THE     00033500
*                        LENGTH EXPRESSED IN NUMBER OF WORDS.           00033600
DEBDEBB  DS    AL3       ADDRESS OF THE NEXT DEB IN THE SAME TASK       00033700
DEBIRBAD DS    0A        IRB STORAGE ADDRESS USED FOR APPENDAGE         00033800
*                        ASYNCHRONOUS EXITS                             00033900
DEBOFLGS DS    B         DATA SET STATUS FLAGS                          00034000
DEBDISP  EQU   X'C0'     DATA SET DISPOSITION FLAGS                     00034100
*                         BIT SETTING  DISPOSITION                      00034200
*              DEBDSOLD     01             OLD DATA SET                 00034300
*              DEBDSMOD     10             MOD DATA SET                 00034400
*              DEBDSNEW     11             NEW DATA SET                 00034500
DEBDSOLD EQU   X'40'              OLD DATA SET                     @L2A 00034600
DEBDSMOD EQU   X'80'              MOD DATA SET                     @L2A 00034700
DEBDSNEW EQU   X'C0'              NEW DATA SET                     @L2A 00034800
DEBEOF   EQU   X'20'     END-OF-FILE (EOF) ENCOUNTERED (TAPE INPUT)     00034900
*                        FORMAT 1 DSCB BIT 93.0 INDICATES THAT THE      00035000
*                        CURRENT VOLUME IS THE LAST VOLUME OF THE DATA  00035100
*                        SET (DASD INPUT)                               00035200
DEBRLSE  EQU   X'10'     RELEASE UNUSED EXTERNAL STORAGE (DASD)         00035300
*                        EMULATOR TAPE WITH SECOND GENERATION FORMAT.   00035400
*                        TAPE MAY CONTAIN BLOCKS SHORTER THAN 12        00035500
*                        CHARACTERS. (TAPE)                             00035600
DEBDCB   EQU   X'08'     DCB MODIFICATION                               00035700
DEBSPLIT EQU   X'04'     SPLIT CYLINDER (DASD). NO LONGER SUPPORTED.    00035800
*                        7-TRACK EMULATOR TAPE WITH POSSIBLE MIXED      00035900
*                        PARITY RECORDS (TAPE)                          00036000
DEBLABEL EQU   X'02'     NONSTANDARD LABELS                             00036100
DEBRERR  EQU   X'01'     USE REDUCED ERROR RECOVERY PROCEDURE (TAPE)    00036200
*                        CONCATENATED PARTITIONED ORGANIZATION DATA     00036300
*                        SETS PROCESSED USING BPAM (DASD)               00036400
DEBIRBB  DS    AL3       IRB STORAGE ADDRESS USED FOR APPENDAGE         00036500
*                        ASYNCHRONOUS EXITS                             00036600
DEBOPATB DS    B         FLAGS INDICATING BOTH THE METHOD OF I/O        00036700
*                        PROCESSING AND THE DISPOSITION THAT IS TO BE   00036800
*                        PERFORMED WHEN AN END-OF-VOLUME (EOV)          00036900
*                        CONDITION OCCURS                               00037000
DEBABEND EQU   X'80'     SET BY ABEND INDICATING A SYSABEND OR          00037100
*                        SYSUDUMP DATA SET                              00037200
DEBZERO  EQU   X'40'     ALWAYS ZERO                                    00037300
DEBPOSIT EQU   X'30'     DATA SET POSITIONING FLAGS                     00037400
*                         BIT SETTING    POSITIONING                    00037500
*              DEBRERED     01             REREAD                       00037600
*              DEBLEAVE     11             LEAVE                        00037700
DEBRERED EQU   X'10'              REREAD                           @L2A 00037800
DEBLEAVE EQU   X'30'              LEAVE                            @L2A 00037900
DEBACCS  EQU   X'0F'     TYPE OF I/O ACCESSING BEING DONE               00038000
*    THE LOW ORDER FOUR BITS CORRESPOND TO FOUR BITS IN THE OPEN   @P8A 00038100
*    PARAMETER LIST EXCEPT THAT DEBXTEND AND DEBOTINX ARE INVALID  @P8A 00038200
*    IN A DEB BECAUSE OPEN CHANGES EXTEND TO OUTPUT AND OUTINX TO  @P8A 00038300
*    OUTIN.                                                        @P8A 00038400
*                                                                13@P8D 00038500
DEBINPUT EQU   0                  INPUT                            @L2A 00038600
DEBOUTPT EQU   X'0F'              OUTPUT (OPEN PARAMETER LIST      @P8C 00038700
*                                   OR DEB) OR EXTEND (DEB ONLY)   @P8A 00038800
DEBXTEND EQU   X'0E'              EXTEND (OPEN PARAMETER LIST ONLY)@P8C 00038900
DEBINOUT EQU   X'03'              INOUT                            @L2A 00039000
DEBOUTIN EQU   X'07'              OUTIN (OPEN PARAMETER LIST       @P8C 00039100
*                                   OR DEB) OR OUTINX (DEB ONLY)   @P8A 00039200
DEBOTINX EQU   X'06'              OUTINX (OPEN PARAMETER LIST ONLY)@P8C 00039300
DEBRDBCK EQU   X'01'              RDBACK                           @L2A 00039400
DEBUPDAT EQU   X'04'              UPDAT                            @L2A 00039500
DEBQSCNT DS    BL1       PURGE (SVC 16) - QUIESCE COUNT.  NUMBER OF     00039600
*                        DEVICES EXECUTING USER'S CHANNEL PROGRAMS,     00039700
*                        AS SHOWN BY BITS 5 AND 6 OF UCBFL1 FIELDS.     00039800
DEBFLGS1 DS    BL1       FLAG FIELD                                     00039900
DEBPWCKD EQU   X'80'     PASSWORD WAS SUPPLIED DURING OPEN.  EOV WILL   00040000
*                        NOT REQUEST A PASSWORD FOR EACH ADDITIONAL     00040100
*                        VOLUME OF A MULTIVOLUME DATA SET.              00040200
DEBEOFDF EQU   X'40'     SET BY EOV TO INFORM CLOSE THAT AN END-OF-FILE 00040300
*                        HAS BEEN ENCOUNTERED AND, THEREFORE, DEFERRED  00040400
*                        USER LABEL PROCESSING IS ALLOWED.              00040500
DEBRSIOA EQU   X'20'     SIO APPENDAGE RE-ENTRY AUTHORIZATION BIT       00040600
*                        (OS/VS1)  (MDC331)                    @XM06077 00040700
DEBEXCPA EQU   X'10'     EXCP IS AUTHORIZED FOR THIS DEB       @ZA20762 00040800
DEBCINDI EQU   X'08'     DCB ASSOCIATED WITH THIS DEB IS BEING          00040900
*                        PROCESSED BY THE COMPATIBILITY INTERFACE       00041000
*                        ROUTINES (VSAM OR SAM)                  ICB462 00041100
DEBF1CEV EQU   X'04'     EOV PROCESSING OCCURRED DURING CLOSE           00041200
*                        PROCESSING.  TESTED AND SET TO ZERO BY CLOSE,  00041300
*                        SET TO ONE BY EOV.  (ICB353)            A42228 00041400
DEBAPFIN EQU   X'02'     IF ON, AUTHORIZED PROGRAMS CAN BE LOADED       00041500
*                                                                MDC001 00041600
DEBXTNIN EQU   X'01'     IF ONE, DEB EXTENSION EXISTS            MDC007 00041700
DEBFLGS2 DS    XL1       FLAG FIELD TWO                            @L5C 00041800
DEBIOPAV EQU   X'80'     THE I/O PREVENTION IDENTIFIER (IOPID)     @L5A 00041900
*                        IN THE DEB EXTENSION IS VALID AND         @L5A 00042000
*                        DEBXTNIN IS ON                            @L5A 00042100
*                                                             2D   @10A 00042200
DEBVCR   EQU   X'40'     RLS=CR JCL OPTION                         @19C 00042300
DEBVNRI  EQU   X'20'     RLS=NRI JCL OPTION                        @19C 00042400
DEBVCRE  EQU   X'10'     RLS=CRE JCL OPTION                        @19C 00042500
DEBVRLS  EQU   X'08'          VSAM RLS ACCESS(VSAM ONLY)           @P5M 00042600
*                                                                  @H3A 00042700
*                        THE FOLLOWING TWO TAPE BITS ARE USED BY   @H3A 00042800
*                        O/C/EOV TO MAINTAIN AN UNIFORM RECORDING  @H3A 00042900
*                        MODE (COMPACTION OR NON-COMPACTION) ON    @H3A 00043000
*                        TAPE DATA SETS THAT SPAN OVER MORE THAN   @H3A 00043100
*                        ONE VOLUME.                               @H3A 00043200
*                                                                  @H3A 00043300
DEBDSCMP EQU   X'08'          TAPE DATA SET COMPACTION MODE        @H3A 00043400
DEBDSNCP EQU   X'04'          TAPE DATA SET NON-COMPACTION MODE    @H3A 00043500
*                                                                  @H3A 00043600
*                                                                  @H3A 00043700
DEB31UCB EQU   X'02'    UCB address field is 4 bytes. Use DEBSUCBA @MXC 00043800
*                       DEBUCBAD, DEBSDVMX or DEBDVMOD31 instead   @MXC 00043900
*                       of DEBSUCBB, DEBUCBA, DEBSDVM or DEBDVMOD  @MXC 00044000
DEBTVS   EQU   X'01'     TRANSACTIONAL VSAM                        @P6C 00044100
DEBUSRPG DS    0A        ADDRESS OF FIRST IOB IN THE USER PURGE CHAIN   00044200
*                        (OS/VS1)                                       00044300
*                        ADDRESS OF PURGED I/O RESTORE LIST (PIRL)      00044400
*                        (OS/VS2)  (MDC029)                      YM3158 00044500
DEBNMEXT DS    BL1       NUMBER OF EXTENT DESCRIPTIONS STARTING         00044600
*                         AT DEBBASND.  ONE EXTENT PER UNIT FOR         00044700
*                         EXTENDED FORMAT OR PDSE DATA SETS.       @LEA 00044800
DEBUSRPB DS    AL3       ADDRESS OF FIRST IOB IN THE USER PURGE CHAIN   00044900
*                        (OS/VS1)                                       00045000
*                        ADDRESS OF PURGED I/O RESTORE LIST (PIRL)      00045100
*                        (OS/VS2)  (MDC030)                      YM3158 00045200
DEBRRQ   DS    0A        POINTER TO RELATED REQUEST QUEUE (OS/VS2)      00045300
*                                                                MDC026 00045400
DEBECBAD DS    0A        ADDRESS OF A PARAMETER LIST USED TO LOCATE     00045500
*                        THE PURGE ECB FOR AN SVC PURGE REQUEST         00045600
*                        (OS/VS1)                                MDC025 00045700
DEBPRIOR DS    BL1       PRIORITY OF THE TASK OWNING DEB                00045800
DEBECBB  DS    AL3       ADDRESS OF A PARAMETER LIST USED TO LOCATE     00045900
*                        THE PURGE ECB FOR AN SVC PURGE REQUEST         00046000
*                        (OS/VS1)                                MDC025 00046100
DEBDCBAD DS    0A        ADDRESS OF DCB OR ACB ASSOCIATED WITH THIS DEB 00046200
DEBPROTG DS    0BL1      TASK PROTECTION KEY IN HIGH-ORDER 4 BITS       00046300
DEBDEBID DS    BL1       A HEX F IN LOW-ORDER 4 BITS TO IDENTIFY        00046400
*                        THIS BLOCK AS A DEB                            00046500
DEBDCBB  DS    AL3       ADDRESS OF DCB OR ACB ASSOCIATED WITH THIS DEB 00046600
DEBAPPAD DS    0A        ADDRESS OF THE I/O APPENDAGE VECTOR TABLE      00046700
DEBEXSCL DS    AL1       THIS FIELD IS USED TO DETERMINE THE SIZE OF    00046800
*                        THE DEVICE DEPENDENT SECTION. TWO TO THIS      00046900
*                        POWER GIVES THE LENGTH OF THE DEVICE-          00047000
*                        DEPENDENT SECTION AT DEBBASND. EXTENT SCALE -  00047100
*                        4 (16 BYTES) FOR DIRECT ACCESS DEVICE AND      00047200
*                        3525 CARD PUNCH WITH DEVICE-ASSOCIATED DATA    00047300
*                        SET SUPPORT AND 2 (4 BYTES) FOR NONDIRECT      00047400
*                        ACCESS DEVICE AND COMMUNICATION DEVICE.        00047500
DEBAPPB  DS    AL3       ADDRESS OF THE I/O APPENDAGE VECTOR TABLE      00047600
DEBBASND EQU   *         END OF BASIC SECTION                           00047700
         SPACE 1                                                        00047800
*********************************************************************** 00047900
*      UNIT RECORD, MAGNETIC TAPE, TELECOMMUNICATIONS DEVICES SECTION * 00048000
*                                                                     * 00048100
*        NOTE  FOR TELECOMMUNICATIONS DEVICES, THE UCB ADDRESS IS     * 00048200
*              REPEATED FOR EACH LINE ASSIGNED                        * 00048300
*********************************************************************** 00048400
         SPACE 1                                                        00048500
DEBDDS1  EQU   *                                                        00048600
DEBSUCBA DS    0A        Address of a UCB. If DEB31UCB is off, the @MXC 00048700
*                        high order byte is not valid.             @MXC 00048800
DEBSDVM  DS    B         DEVICE MODIFIER.  FOR MAGNETIC TAPE, MODESET   00048900
*                        OPERATION CODE OR MODE SET FUNCTION BYTE. @H3C 00049000
*                        FOR UNIT RECORD, NOT USED.  Valid only if @MXC 00049100
*                        DEB31UCB is off.                          @MXA 00049200
*                        9-TRACK TAPE MODESET OPERATION CODES      @H3A 00049300
DEBMTDN4 EQU   X'D3'     9-TRACK MODESET CCW CODE DENSITY=6250BPI  @H3A 00049400
DEBMTDN3 EQU   X'C3'     9-TRACK MODESET CCW CODE DENSITY=1600BPI  @H3A 00049500
DEBMTDN2 EQU   X'CB'     9-TRACK MODESET CCW CODE DENSITY= 800BPI  @H3A 00049600
*                        7-TRACK TAPE MODESET SKELETON CODES       @H3A 00049700
*                        (MUST BE COMPLETED WITH PARITY,           @H3A 00049800
*                                 TRANSLATION AND/OR CONVERSION)   @H3A 00049900
DEBM7DN0 EQU   X'03'     7-TRACK MODESET SKELETON DENSITY=200BPI   @H3A 00050000
DEBM7DN1 EQU   X'43'     7-TRACK MODESET SKELETON DENSITY=556BPI   @H3A 00050100
DEBM7DN2 EQU   X'83'     7-TRACK MODESET SKELETON DENSITY=800BPI   @H3A 00050200
*                        3480 TAPE OPERATION CODE                  @H3A 00050300
DEBMSTWI EQU   X'C3'     3480 SET TAPE WRITE IMMEDIATE CCW CODE    @H3A 00050400
*                        TAPE MODE SET FUNCTION BYTE               @H3A 00050500
DEBMTRF0 EQU   X'80'     TAPE RECORDING FORMAT BIT 0               @H3A 00050600
DEBMTRF1 EQU   X'40'     TAPE RECORDING FORMAT BIT 1               @H3A 00050700
DEBMTWI  EQU   X'20'     TAPE WRITE IMMEDIATE (NON-BUFFERED WRITE) @H3A 00050800
DEBMINHS EQU   X'10'     INHIBIT SUPERVISOR COMMANDS               @H3A 00050900
DEBMCOMP EQU   X'08'     COMPACTED RECORDING MODE                  @H3A 00051000
DEBCMPAC EQU   DEBMCOMP  COMPACTED RECORDING MODE                  @H3A 00051100
DEBM3424 EQU   X'02'     3424 MODE SET FLAG                        @H3A 00051200
DEBM9348 EQU   X'02'     RESERVED(WILL BE DELETED)                 @H3A 00051300
DEBMINHE EQU   X'01'     INHIBIT CONTROL UNIT ERP                  @H3A 00051400
*                                                                  @H3A 00051500
DEBM6250 EQU   DEBMTRF0+DEBMTRF1+DEBM3424 SET 3424 DENSITY=6250BPI @H3A 00051600
DEBM1600 EQU   DEBMTRF1+DEBM3424          SET 3424 DENSITY=1600BPI @H3A 00051700
*                                                                  @H3A 00051800
DEBM4TRK EQU   DEBMTRF0+DEBMTRF1+DEBM9348 RESERVED(WILL BE DELETED)@H3A 00051900
DEBM2TRK EQU   DEBMTRF0+DEBM9348          RESERVED(WILL BE DELETED)@H3A 00052000
DEBM1TRK EQU   DEBMTRF1+DEBM9348          RESERVED(WILL BE DELETED)@H3A 00052100
*                                                                  @H3A 00052200
DEBSUCBB DS    AL3       ADDRESS OF A UCB ASSOCIATED WITH A GIVEN       00052300
*                        DATA SET (invalid if DEB31UCB is on)      @MXC 00052400
DEBDEVED DS    0A        End of common tape and unit record fields     *00052500
                         when DEB31UCB is off.                     @MXC 00052600
*      Next four bytes exist only if DEB31UCB is on.               @MXA 00052700
DEBSDVMX DS    B         Device modifier.  Mag tape: modeset op code   *00052800
                         or modeset function byte.  Unit rcd: rsvd @MXA 00052900
         DS    XL3       Reserved                                  @MXA 00053000
DEBDVEDX DS    0A        End of section if DEB31UCB is on.         @MXA 00053100
*        THE FOLLOWING FIELDS ARE PRESENT ONLY FOR THE 3525 WITH        00053200
*        DEVICE-ASSOCIATED DATA SET SUPPORT                             00053300
         ORG   DEBDEVED  Remap fields                              @MXC 00053400
DEBRDCB  DS    0A        ADDRESS OF DCB FOR THE READ ASSOCIATED DATA    00053500
*                        SET                                     ICB394 00053600
DEBRSV06 DS    X         RESERVED                                ICB394 00053700
DEBRDCBA DS    AL3       ADDRESS OF DCB FOR THE READ ASSOCIATED DATA    00053800
*                        SET                                     ICB394 00053900
DEBPDCB  DS    0A        ADDRESS OF DCB FOR THE PUNCH ASSOCIATED DATA   00054000
*                        SET                                     ICB394 00054100
DEBRSV07 DS    X         RESERVED                                ICB394 00054200
DEBPDCBA DS    AL3       ADDRESS OF DCB FOR THE PUNCH ASSOCIATED DATA   00054300
*                        SET                                     ICB394 00054400
DEBWDCB  DS    0A        ADDRESS OF DCB FOR THE PRINT ASSOCIATED DATA   00054500
*                        SET                                     ICB394 00054600
DEBRSV08 DS    X         RESERVED                                ICB394 00054700
DEBWDCBA DS    AL3       ADDRESS OF DCB FOR THE PRINT ASSOCIATED DATA   00054800
*                        SET                                     ICB394 00054900
DEBASDSE EQU   *                  END OF DEVICE-ASSOCIATED DS SEC. @L2A 00055000
         SPACE 2                                                        00055100
*********************************************************************** 00055200
*                   3540 ACCESS METHOD DEPENDENT SECTION      @X04AA9A* 00055300
*                   (OS/VS1 ONLY)                             @X04AA9A* 00055400
*                                                                     * 00055500
*        NOTE  THIS SECTION FOLLOWS DEBSUCBA IN UNIT RECORD, MAGNETIC * 00055600
*              TAPE, TELECOMMUNICATIONS DEVICES SECTION IF DEB IS     * 00055700
*              FOR 3540 DEVICE.                               @X04AA9A* 00055800
*********************************************************************** 00055900
         SPACE 2                                                        00056000
         ORG   DEBDEVED                                        @X04AA9A 00056100
         SPACE 1                                                        00056200
DEBASC09 DS    0CL16     3540 ACCESS METHOD DEPENDENT SECTION           00056300
*                        (MDC317)                              @X04AA9A 00056400
DEBVOLAC DS    CL1       VOLUME ACCESSIBILITY INDICATOR  (MDC327)       00056500
*                                                              @X04AA9A 00056600
DEBDSSQL DS    CL1       DATA SET SECURITY QUALIFIER (MDC328)  @X04AA9A 00056700
DEBVSEQU DS    FL1       VOLUME SEQUENCE NUMBER  (MDC318)      @X04AA9A 00056800
DEBEAMFG DS    B         FLAG BYTE  (MDC319)                   @X04AA9A 00056900
DEBMULTI EQU   X'80'     MULTI-VOLUME INDICATOR  (MDC320)      @X04AA9A 00057000
DEBDSOPN EQU   X'40'     DATA SET IS OPEN  (MDC321)            @X04AA9A 00057100
DEBVAMSG EQU   X'20'     VOLUME ACCESSIBILITY MESSAGE HAS BEEN ISSUED   00057200
*                        (MDC329)                              @X04AA9A 00057300
DEBSECVL EQU   X'10'     SECURE VOLUME  (MDC332)               @X04AA9A 00057400
DEBRV004 EQU   X'08',,C'X'   RESERVED                          @X04AA9A 00057500
DEBRV005 EQU   X'04',,C'X'   RESERVED                          @X04AA9A 00057600
DEBRV006 EQU   X'02',,C'X'   RESERVED                          @X04AA9A 00057700
DEBRV007 EQU   X'01',,C'X'   RESERVED                          @X04AA9A 00057800
DEBDSID  DS    0CL8      DATA SET IDENTIFIER (DSID) (INPUT)  (MDC305)   00057900
*                                                              @X04AA9A 00058000
DEBEXDTE DS    CL6       EXPIRATION DATE (OUTPUT)  (MDC333)    @X04AA9A 00058100
DEBWTPTI DS    CL1       WRITE PROTECT INDICATOR (OUTPUT)  (MDC334)     00058200
*                                                              @X04AA9A 00058300
DEBRV008 DS    CL1       RESERVED (OUTPUT)  (MDC335)           @X04AA9A 00058400
DEBEOD   DS    0CL4      END OF DATA (EOD) ADDRESS (INPUT)  (MDC306)    00058500
*                                                              @X04AA9A 00058600
DEBBOE   DS    0CL4      BEGINNING OF EXTENT (BOE) ADDRESS (OUTPUT)     00058700
*                        (MDC322)                              @X04AA9A 00058800
DEBEODRV DS    0XL1      RESERVED  (MDC307)                    @X04AA9A 00058900
DEBBOERV DS    XL1       RESERVED  (MDC323)                    @X04AA9A 00059000
DEBEODTT DS    0XL1      EOD TRACK NUMBER  (MDC308)            @X04AA9A 00059100
DEBBOETT DS    XL1       BOE TRACK NUMBER  (MDC324)            @X04AA9A 00059200
DEBEOD0  DS    0XL1      MUST BE ZERO  (MDC309)                @X04AA9A 00059300
DEBBOE0  DS    XL1       MUST BE ZERO  (MDC325)                @X04AA9A 00059400
DEBEODSS DS    0XL1      EOD SECTOR NUMBER  (MDC310)           @X04AA9A 00059500
DEBBOESS DS    XL1       BOE SECTOR NUMBER  (MDC326)           @X04AA9A 00059600
DEBASC9E EQU   *                  END OF 3540 DEPENDENT SECTION    @L2A 00059700
         SPACE 2                                                        00059800
*********************************************************************** 00059900
*                DEB ISAM DEPENDENT SECTION                           * 00060000
*                                                                     * 00060100
*        NOTE  PRESENT ONLY IF ISAM IS USED.  FOLLOWS THE BASIC       * 00060200
*              SECTION AND PRECEDES THE DIRECT ACCESS STORAGE DEVICE  * 00060300
*              SECTION.  COUNTED AS ONE EXTENT IN DEBNMEXT.           * 00060400
*********************************************************************** 00060500
         SPACE 1                                                        00060600
         ORG   DEBBASND                                                 00060700
         SPACE 1                                                        00060800
DEBISAM  EQU   *                                                        00060900
DEBFIEAD DS    0A        ADDRESS OF FIRST INDEX EXTENT                  00061000
DEBNIEE  DS    BL1       NUMBER OF EXTENTS OF INDEPENDENT INDEX AREA    00061100
DEBFIEB  DS    AL3       ADDRESS OF FIRST INDEX EXTENT                  00061200
DEBFPEAD DS    0A        ADDRESS OF THE FIRST PRIME DATA EXTENT         00061300
DEBNPEE  DS    BL1       NUMBER OF EXTENTS OF PRIME DATA AREA           00061400
*                        (M=0 EXTENT)                                   00061500
DEBFPEB  DS    AL3       ADDRESS OF THE FIRST PRIME DATA EXTENT         00061600
DEBFOEAD DS    0A        ADDRESS OF THE FIRST OVERFLOW EXTENT           00061700
DEBNOEE  DS    BL1       NUMBER OF EXTENTS OF INDEPENDENT OVERFLOW AREA 00061800
DEBFOEB  DS    AL3       ADDRESS OF THE FIRST OVERFLOW EXTENT           00061900
DEBEXPT  DS    0A        ADDRESS OF ISAM DEB EXTENSION           ICB379 00062000
DEBRPSID DS    BL1       ROTATIONAL POSITION SENSING (RPS) DEVICE       00062100
*                        INDICATORS                                     00062200
DEBRPSP  EQU   X'80'     PRIME DATA AREA IS ON RPS DEVICE               00062300
DEBRPSI  EQU   X'40'     INDEPENDENT INDEX AREA IS ON RPS DEVICE        00062400
DEBRPSO  EQU   X'20'     INDEPENDENT OVERFLOW AREA IS ON RPS DEVICE     00062500
DEBRPSAP EQU   X'10'     RPS SIO APPENDAGE HAS BEEN LOADED              00062600
DEBRSV09 EQU   X'08',,C'X' RESERVED                                     00062700
DEBRSV10 EQU   X'04',,C'X' RESERVED                                     00062800
DEBRSV11 EQU   X'02',,C'X' RESERVED                                     00062900
DEBRSV12 EQU   X'01',,C'X' RESERVED                                     00063000
DEBEXPTA DS    AL3       ADDRESS OF ISAM DEB EXTENSION           ICB379 00063100
DEBISAME EQU   *                  END OF ISAM DEPENDENT SECTION    @L2A 00063200
         SPACE 2                                                        00063300
*********************************************************************** 00063400
*             DIRECT-ACCESS STORAGE DEVICE SECTION                    * 00063500
*                                                                     * 00063600
*        NOTE  IF ISAM IS BEING USED, THIS SECTION FOLLOWS THE ISAM   * 00063700
*              DEVICE DEPENDENT SECTION.  OTHERWISE, IT FOLLOWS THE   * 00063800
*              BASIC SECTION.                                         * 00063900
*                                                                     * 00064000
*              THERE IS ONE OF THESE SECTIONS FOR EACH EXTENT.        * 00064100
*********************************************************************** 00064200
         SPACE 1                                                        00064300
DEBDASD  DSECT                                                          00064400
DEBUCBAD DS    0A        Address of UCB associated with this data       00064500
*                        extent for 24-bit programs if DEB31UCB is off  00064600
*                        or for all programs if DEB31UCB is on.    @MXA 00064700
*  Next two fields are valid only if DEB31UCB is off.              @MXA 00064800
DEBDVMOD DS    B         DEVICE MODIFIER - FILE MASK                    00064900
DEBUCBA  DS    AL3       Address of UCB associated with this data       00065000
*                        extent if DEB31UCB is off                 @MXC 00065100
DEBBINUM DS    0CL2      Bin number (Obsolete use)                 @MXC 00065200
DEBDVMOD31 DS  XL1       File mask.  Valid only if DEB31UCB is on  @MXC 00065300
DEBNMTRKHI DS  CL1       HIGH ORDER BYTE OF NUMBER OF TRACKS IN    @LVA 00065400
*                         EXTENT. LOW ORDER TWO BYTES IN DEBNMTRK  @LVA 00065500
*                         DEBNMTRKHI COMBINED WITH DEBNMTRK GIVES  @LVA 00065600
*                         TOTAL NUMBER OF TRACKS FOR A GIVEN       @LVA 00065700
*                         EXTENT. DEBNMTRKHI WILL BE 0 FOR BASIC   @LVA 00065800
*                         DATA SET, NONZERO FOR LARGE DATA SET     @LVA 00065900
*********************************************************************** 00066000
*        FOR A NON-EAV VOLUME, THE FOLLOWING IS OF THE FORMAT    @L11A* 00066100
*        cccchhhh. FOR AN EAV VOLUME THE FORMAT IS CCCCccch.     @L11A* 00066200
*********************************************************************** 00066300
DEBSTRCC DS    CL2       CYLINDER ADDRESS FOR THE START OF AN EXTENT.   00066400
*                                                                 2@LRD 00066500
DEBSTRHH DS    CL2       TRACK ADDRESS FOR THE START OF AN EXTENT.      00066600
DEBENDCC DS    CL2       CYLINDER ADDRESS FOR THE END OF AN EXTENT.     00066700
*                        FOR A PDSE THIS FIELD IS RESERVED.             00066800
*                        FOR AN EXTENDED FORMAT DATA SET THIS FIELD     00066900
*                        CONTAINS THE CYLINDER NUMBER OF THE FORMAT-1   00067000
*                        DSCB ADDRESS.                                  00067100
DEBENDHH DS    CL2       TRACK ADDRESS FOR THE END OF AN EXTENT.        00067200
*                        FOR A PDSE THIS FIELD IS RESERVED.             00067300
*                        FOR AN EXTENDED FORMAT DATA SET THIS FIELD     00067400
*                        CONTAINS THE TRACK NUMBER OF THE FORMAT-1      00067500
*                        DSCB ADDRESS.                                  00067600
DEBNMTRK DS    CL2       LOW ORDER TWO BYTES OF NUMBER OF TRACKS   @LVC 00067700
*                        ALLOCATED TO CURRENT EXTENT. HIGH         @LVC 00067800
*                        ORDER BYTE OF COUNT IN DEBNMTRKHI         @LVA 00067900
DEBDASDE EQU   *                  END OF DASD DEVICE SECTION       @L2A 00068000
         SPACE 2                                                        00068100
*********************************************************************** 00068200
*        EXCP ACCESS METHOD, BSAM AND QSAM DEPENDENT SECTION          * 00068300
*********************************************************************** 00068400
         SPACE 1                                                        00068500
DEBACSMD DSECT                                                          00068600
         SPACE 1                                                        00068700
DEBVOLSQ DS    0CL2      VOLUME SEQUENCE NUMBER FOR MULTIVOLUME         00068800
*                        SEQUENTIAL DATA SETS                           00068900
DEBVOLBT DS    B         FIRST BYTE OF DEBVOLSQ (MDC016)        YA00318 00069000
DEBEXFUL EQU   X'80'     SET BY EOV WHEN REWRITING AN OLD DIRECT ACCESS 00069100
*                        DATA SET TO INDICATE THAT ALL PREVIOUS         00069200
*                        EXISTING EXTENTS HAVE BEEN FILLED              00069300
*                        (MDC017)                               YA00318 00069400
DEBRSV36 EQU   X'40',,C'X'   RESERVED                            MDC018 00069500
DEBRSV37 EQU   X'20',,C'X'   RESERVED                            MDC018 00069600
DEBRSV38 EQU   X'10',,C'X'   RESERVED                            MDC018 00069700
DEBRSV39 EQU   X'08',,C'X'   RESERVED                            MDC018 00069800
DEBRSV40 EQU   X'04',,C'X'   RESERVED                            MDC018 00069900
DEBRSV41 EQU   X'02',,C'X'   RESERVED                            MDC018 00070000
DEBRSV42 EQU   X'01',,C'X'   RESERVED                            MDC018 00070100
DEBVLSEQ DS    FL1       FOR DIRECT ACCESS, SEQUENCE NUMBER OF THE      00070200
*                        VOLUME OF THE DATA SET RELATIVE TO THE FIRST   00070300
*                        VOLUME OF THE DATA SET.  FOR TAPE, SEQUENCE    00070400
*                        NUMBER OF THE VOLUME OF THE DATA SET RELATIVE  00070500
*                        TO THE FIRST VOLUME PROCESSED.(MDC019) YA00318 00070600
DEBVOLNM DS    CL2       TOTAL NUMBER OF VOLUMES IN A MULTIVOLUME       00070700
*                        SEQUENTIAL DATA SET.                           00070800
DEBDSNM  DS    0CL8      MEMBER NAME.  THIS FIELD APPEARS ONLY WHEN AN  00070900
*                        OUTPUT DATA SET HAS BEEN OPENED FOR A MEMBER   00071000
*                        NAME AND THE DSCB SPECIFIES A PARTITIONED      00071100
*                        DATA SET.                                      00071200
DEBUTSAA DS    0A        ADDRESS OF THE USER TOTALING SAVE AREA         00071300
DEBRSV13 DS    X         RESERVED                                       00071400
DEBUTSAB DS    AL3       ADDRESS OF THE USER TOTALING SAVE AREA         00071500
DEBRSV14 DS    XL4       RESERVED (IF USER TOTALING WAS SPECIFIED)      00071600
DEBBLKSI DS    H         MAXIMUM BLOCK SIZE  (MDC346)          @ZA03699 00071700
DEBLRECL DS    H         LOGICAL RECORD LENGTH  (MDC347)       @ZA03699 00071800
DEBACSMDE EQU  *         END OF EXCP, BSAM AND QSAM DEPENDENT      @PBA 00071900
*                            SECTION                               @PBA 00072000
         SPACE 2                                                        00072100
*********************************************************************** 00072200
*                  BPAM DEPENDENT SECTION                             * 00072300
*********************************************************************** 00072400
         SPACE 2                                                        00072500
         ORG   DEBACSMD                                                 00072600
         SPACE 1                                                        00072700
DEBEXTNM DS    0C        FOR A PARTITIONED DATA SET OPENED FOR INPUT,   00072800
*                        EACH ONE-BYTE FIELD CONTAINS THE EXTENT NUMBER 00072900
*                        OF THE FIRST EXTENT ENTRY FOR EACH DATA SET    00073000
*                        EXCEPT THE FIRST, IF TWO OR MORE DATA SETS ARE 00073100
*                        CONCATENATED.  THE NUMBER OF BYTES IN THE      00073200
*                        FIELD IS EQUAL TO ONE LESS THAN THE NUMBER OF  00073300
*                        DATA SETS CONCATENATED.                        00073400
DEBDSNAM DS    CL8       FOR A PARTITIONED DATA SET OPENED FOR          00073500
*                        OUTPUT FOR A MEMBER NAME, THIS FIELD IS THE    00073600
*                        MEMBER NAME.                                   00073700
         SPACE 2                                                        00073800
*********************************************************************** 00073900
*                  BDAM DEPENDENT SECTION                             * 00074000
*********************************************************************** 00074100
         SPACE 2                                                        00074200
         ORG   DEBACSMD                                                 00074300
         SPACE 1                                                        00074400
*                         *****************************************     00074500
*                         * FOR FIXED LENGTH RECORDS WITH THE     *     00074600
*                         * OPTION OF RELATIVE BLOCK ADDRESSING   *     00074700
*                         * (BUT NOT TRACK OVERFLOW)              *     00074800
*                         *****************************************     00074900
         SPACE 1                                                        00075000
DEBDBLK  DS    0F        ONE FOUR-BYTE FIELD FOR EACH EXTENT            00075100
*                        DESCRIBED IN THE DEVICE DEPENDENT SECTION      00075200
DEBDBPT  DS    AL1       NUMBER OF BLOCKS PER TRACK                     00075300
DEBDBPE  DS    CL3       NUMBER OF BLOCKS PER EXTENT                    00075400
         SPACE 2                                                        00075500
         ORG   DEBACSMD                                                 00075600
         SPACE 1                                                        00075700
*                         *****************************************     00075800
*                         * FOR FIXED LENGTH RECORDS WITH THE     *     00075900
*                         * OPTION OF RELATIVE BLOCK ADDRESSING   *     00076000
*                         * AND TRACK OVERFLOW.                   *     00076100
*                         *****************************************     00076200
         SPACE 1                                                        00076300
DEBDTPP  DS    FL4       NUMBER OF TRACKS PER PERIOD                    00076400
DEBDBPP  DS    FL4       NUMBER OF BLOCKS PER PERIOD                    00076500
         SPACE 1                                                        00076600
*                         THE FOLLOWING FIELD OCCURS ONCE FOR           00076700
*                         EACH EXTENT.                                  00076800
         SPACE 1                                                        00076900
DEBDBPEF DS    FL4       NUMBER OF BLOCKS PER EXTENT                    00077000
         SPACE 2                                                        00077100
*********************************************************************** 00077200
*                 BTAM DEPENDENT SECTION                              * 00077300
*                                                                     * 00077400
*        NOTE  THIS SEGMENT IS ALWAYS PRESENT FOR BTAM.  IT IS USED   * 00077500
*              WHEN A BUFFER POOL OR DYNAMIC BUFFERING IS USED.       * 00077600
*              OTHERWISE, THE FIELDS ARE ZERO.                        * 00077700
*********************************************************************** 00077800
         SPACE 2                                                        00077900
         ORG   DEBACSMD                                                 00078000
         SPACE 1                                                        00078100
DEBTBFRA DS    0A        ADDRESS OF THE BUFFER ROUTINE                  00078200
DEBRSV15 DS    X         RESERVED                                       00078300
DEBTBFRB DS    AL3       ADDRESS OF THE BUFFER ROUTINE                  00078400
         SPACE 1                                                        00078500
*                         THE FOLLOWING FIELD IS REPEATED FOR EACH      00078600
*                         CCW ON THE CHANNEL PROGRAM QUEUE              00078700
         SPACE 1                                                        00078800
DEBTCCWA DS    0A        ADDRESS OF THE FIRST (OR FOLLOWING) CCW ON     00078900
*                        THE QUEUE                                      00079000
DEBRSV16 DS    X         RESERVED                                       00079100
DEBTCCWB DS    AL3       ADDRESS OF THE FIRST (OR FOLLOWING) CCW ON     00079200
*                        THE QUEUE                                      00079300
         SPACE 2                                                        00079400
*********************************************************************** 00079500
*                   GAM DEPENDENT SECTION                             * 00079600
*********************************************************************** 00079700
         SPACE 2                                                        00079800
         ORG   DEBACSMD                                                 00079900
         SPACE 1                                                        00080000
DEBFUCBA DS    0A        ADDRESS OF FIRST UCB                           00080100
DEBRSV17 DS    X         RESERVED                                       00080200
DEBFUCBB DS    AL3       ADDRESS OF FIRST UCB                           00080300
DEBLUCBA DS    0A        ADDRESS OF LAST UCB                            00080400
DEBRSV18 DS    X         RESERVED                                       00080500
DEBLUCBB DS    AL3       ADDRESS OF LAST UCB                            00080600
         SPACE 2                                                        00080700
*********************************************************************** 00080800
*                 ISAM LOAD MODE EXTENSION                            * 00080900
*                 POINTED TO BY DEBEXPT                               * 00081000
*********************************************************************** 00081100
         SPACE 2                                                        00081200
         ORG   DEBACSMD                                                 00081300
         SPACE 1                                                        00081400
DEBDCBFA DS    A         ADDRESS OF DCB FIELD AREA               MDC013 00081500
DEBPUT   DS    A         ADDRESS OF PUT MODULE                   ICB379 00081600
         SPACE 2                                                        00081700
*********************************************************************** 00081800
*                 ISAM SCAN MODE EXTENSION                            * 00081900
*                 POINTED TO BY DEBEXPT                               * 00082000
*********************************************************************** 00082100
         SPACE 2                                                        00082200
         ORG   DEBACSMD                                                 00082300
         SPACE 1                                                        00082400
         DS    A         DEBDCBFA - ADDRESS OF DCB FIELD AREA    MDC014 00082500
DEBGET   DS    A         ADDRESS OF GET OR PUT MODULE - THIS FIELD      00082600
*                        IS ALSO CALLED DEBPUT                   ICB379 00082700
DEBWKPT4 DS    A         SAME AS DCBWKPT4 - ADDRESS OF UCB       ICB379 00082800
DEBWKPT5 DS    A         SAME AS DCBWKPT5 - ADDRESS OF GET APPENDAGE    00082900
*                        MODULE                                  ICB379 00083000
DEBCREAD DS    A         ADDRESS OF CHANNEL-END APPENDAGE FOR           00083100
*                        READ                                    ICB379 00083200
DEBCSETL DS    A         ADDRESS OF CHANNEL-END APPENDAGE FOR           00083300
*                        SETL                                    ICB379 00083400
DEBCWRIT DS    A         ADDRESS OF CHANNEL-END APPENDAGE FOR           00083500
*                        WRITE                                   ICB379 00083600
DEBCCHK  DS    A         ADDRESS OF CHANNEL-END APPENDAGE FOR           00083700
*                        WRITE VALIDITY CHECK                    ICB379 00083800
DEBCREWT DS    A         ADDRESS OF CHANNEL-END APPENDAGE FOR           00083900
*                        RE-WRITE                                ICB379 00084000
DEBCRECK DS    A         ADDRESS OF CHANNEL-END APPENDAGE FOR           00084100
*                        RE-CHECK                                ICB379 00084200
DEBAREAD DS    A         ADDRESS OF ABNORMAL-END APPENDAGE FOR          00084300
*                        READ                                    ICB379 00084400
DEBASETL DS    A         ADDRESS OF ABNORMAL-END APPENDAGE FOR          00084500
*                        SETL                                    ICB379 00084600
DEBAWRIT DS    A         ADDRESS OF ABNORMAL-END APPENDAGE FOR          00084700
*                        WRITE                                   ICB379 00084800
DEBACHK  DS    A         ADDRESS OF ABNORMAL-END APPENDAGE FOR          00084900
*                        WRITE VALIDITY CHECK                    ICB379 00085000
DEBAREWT DS    A         ADDRESS OF ABNORMAL-END APPENDAGE FOR          00085100
*                        RE-WRITE                                ICB379 00085200
DEBARECK DS    A         ADDRESS OF ABNORMAL-END APPENDAGE FOR          00085300
*                        RE-CHECK                                ICB379 00085400
DEBRPSST DS    A         ADDRESS OF RPS SIO APPENDAGE IF ADDRSPC=REAL   00085500
*                        WAS NOT SPECIFIED                       ICB379 00085600
         SPACE 2                                                        00085700
*********************************************************************** 00085800
*                 BISAM MODE EXTENSION                                * 00085900
*                 POINTED TO BY DEBEXPT                               * 00086000
*********************************************************************** 00086100
         SPACE 2                                                        00086200
         ORG   DEBACSMD                                                 00086300
         SPACE 1                                                        00086400
         DS    A         DEBDCBFA - ADDRESS OF DCB FIELD AREA    MDC015 00086500
DEBDISAD DS    A         ADDRESS OF PRIVILEGED MODULE ENTERED WHEN A    00086600
*                        BISAM MACRO INSTRUCTION IS EXECUTED     ICB379 00086700
         DS    A         DEBWKPT4 - SAME AS DCBWKPT4 - ADDRESS OF THE   00086800
*                        PART 1 APPENDAGE MODULE (ABNORMAL AND          00086900
*                        CHANNEL-END APPENDAGES)                 ICB379 00087000
         DS    A         DEBWKPT5 - SAME AS DCBWKPT5 - ADDRESS OF THE   00087100
*                        PART 2 APPENDAGE MODULE (ABNORMAL AND          00087200
*                        CHANNEL-END APPENDAGES)                 ICB379 00087300
DEBFREED DS    A         ADDRESS OF DYNAMIC BUFFERING MODULE     ICB379 00087400
DEBRPSIO DS    A         ADDRESS OF RPS SIO APPENDAGE MODULE IF         00087500
*                        ADDRSPC=REAL WAS NOT SPECIFIED AND IF DYNAMIC  00087600
*                        BUFFERING IS USED                       ICB379 00087700
DEBSIOA2 DS    A         ADDRESS OF DYNAMIC BUFFERING APPENDAGE MODULE  00087800
*                        DISPLACED BY PAGE FIX (PGFX) APPENDAGE IF      00087900
*                        ADDRSPC=REAL WAS NOT SPECIFIED          ICB379 00088000
         SPACE 2                                                        00088100
*********************************************************************** 00088200
*                 SUBROUTINE NAME SECTION                             * 00088300
*                                                                     * 00088400
*        NOTE  FOLLOWS THE ACCESS METHOD DEPENDENT SECTION, OR THE    * 00088500
*              DEVICE DEPENDENT SECTION IF THERE IS NO ACCESS         * 00088600
*              METHOD SECTION                                         * 00088700
*********************************************************************** 00088800
         SPACE 1                                                        00088900
DEBSUBNM DSECT                                                          00089000
DEBSUBID DS    CL2       SUBROUTINE IDENTIFICATION.  EACH ACCESS METHOD 00089100
*                        SUBROUTINE, APPENDAGE SUBROUTINE, AND IRB      00089200
*                        ROUTINE WILL HAVE A UNIQUE EIGHT-BYTE NAME.    00089300
*                        THE LOW-ORDER TWO BYTES OF EACH ROUTINE NAME   00089400
*                        WILL BE IN THIS FIELD IF THE SUBROUTINE IS     00089500
*                        LOADED BY THE OPEN ROUTINES.                   00089600
         SPACE 2                                                        00089700
*********************************************************************** 00089800
*                 DEB EXTENSION (BELOW 31 MB LINE)                    * 00089900
*                 POINTED TO BY DEBXTNP                               * 00090000
*********************************************************************** 00090100
         SPACE 1                                                        00090200
DEBXTN   DSECT                                                          00090300
DEBXLNGH DS    H         LENGTH OF DEB EXTENSION                 MDC002 00090400
DEBXFLG1 DS    B         FLAG BYTE  (MDC027)                     YM1272 00090500
DEBXCDCB EQU   X'80'     DEBDCBAD FIELD CONTAINS THE ADDRESS OF A       00090600
*                        COPIED DCB.  USED BY END-OF-VOLUME, TCLOSE AND 00090700
*                        TASK CLOSE.  (MDC028)                   YM1272 00090800
DEBXTSKC EQU   X'40'     TASK CLOSE IS CLOSING THE RELATED DCB.  SET BY 00090900
*                        TASK CLOSE AND INTERROGATED BY END-OF-VOLUME,  00091000
*                        FEOV AND TCLOSE FOR DEB'S NOT ON THE CURRENT   00091100
*                        TCB DEB CHAIN.  (MDC031)                YM2869 00091200
DEBXDSSI EQU   X'20'     DATA SET SECURITY INDICATOR.  SET BY OPEN AND  00091300
*                        CHECKPOINT.  INTERROGATED BY EOV.              00091400
*                        (MDC348)                              @Z40RP9A 00091500
DEBXWIND EQU   X'10'     MSS WINDOW PROCESSING INDICATOR.      @ZA37313 00091600
*                        SET BY OPEN.  INTERROGATED BY EOV,    @ZA37313 00091700
*                        SAM EOB AND CLOSE.                    @ZA37313 00091800
DEBXACIS EQU   X'08'     ACQUIRE ISSUED WITH INHIBIT STAGE     @ZA37313 00091900
*                        INDICATED DURING OPEN OR EOV.         @ZA37313 00092000
*                        SET BY OPEN AND EOV.                  @ZA37313 00092100
*                        INTERROGATED BY SVC 126.              @ZA37313 00092200
DEBXNFLS EQU   X'04'     DO NOT FLUSH QSAM BUFFERS IN CLOSE BECAUSE    *00092300
                         AN OPEN/CLOSE/EOV ABEND OCCURRED. SET BY      *00092400
                         IFG0RR0B. TESTED BY IGG0201Z.             @01A 00092500
*                                                                  @L1D 00092600
DEBXSYSB EQU   X'02'     SYSTEM DETERMINED BLOCKSIZE               @L8C 00092700
DEBXRACE EQU   X'01'     RACF EXECUTE ONLY AUTHORITY OF A PROGRAM  @L9A 00092800
*                        LIBRARY. SET BY OPEN AND INTERROGATED BY  @L9A 00092900
*                        OPEN AFTER FINAL DCB MERGE AND BY A SAM   @L9A 00093000
*                        EXECUTOR.                                 @L9A 00093100
DEBXFLG2 DS    B         FLAG BYTE                                 @06C 00093200
DEBXRSAP EQU   X'80'     USED BY RESTART TO INDICATE THAT RESTART  @06A 00093300
*                        HAS INCREASED THE LENGTH OF THE DEB       @06A 00093400
*                        EXTENSION TO INCLUDE A CHKPT/RST APPENDAGE@06A 00093500
*                        TO THE DEB EXTENSION. THE APPENDAGE IS    @06A 00093600
*                        FREEMAINED AND THIS BIT IS TURNED OFF     @06A 00093700
*                        BEFORE RESTART PROCESSING IS COMPLETED.   @06A 00093800
*                        DEBXLNTH INCLUDES THE LENGTH OF THE       @06A 00093900
*                        APPENDAGE WHILE THIS BIT IS ON.           @06A 00094000
DEBBYP   EQU   X'40'     WHEN ON EXCP SCAN ROUTINE WILL SET        @LBC 00094100
*                        IOSBYP ON AND BYPASS BUILDING A PREFIX    @LBA 00094200
DEBCHCMP EQU   X'20'     WHEN ON EXCP SCAN ROUTINE WILL SET        @LBC 00094300
*                        IOSCHCMP ON AND BYPASS BUILDING A PREFIX  @LBA 00094400
DEBXENQA EQU   X'10'     ENQUEUED ON PDS, DISP=SHARE, OUTPUT       @LCC 00094500
DEBXENQS EQU   X'08'     ENQUEUED ON DSCB,DISP=SHR                 @LCC 00094600
DEBXIMSC EQU   X'04',,C'X'   IMS CLOSE IN PROGRESS                 @09C 00094700
DEBXCASV EQU   X'02'     THE CACHE ATTRIBUTE TOKEN IS VALID        @10A 00094800
DEBXMVLF EQU   X'01'     TAPE MULTIVOL & 1ST VOL READ              @LGC 00094900
DEBXDSAB DS    A         POINTER TO DSAB                         MDC004 00095000
DEBXDCBM DS    XL4       DCB MODIFICATION MASK USED BY O/C/EOV          00095100
DEBXDBPR DS    A         POINTER TO DEB                          MDC006 00095200
DEBXDSO1 DS    B         SAME AS DCBDSORG BYTE 1                 MDC020 00095300
DEBXDSO2 DS    B         SAME AS DCBDSORG BYTE 2                 MDC021 00095400
DEBXMCF1 DS    B         SAME AS DCBMACRF BYTE 1                 MDC022 00095500
DEBXMCF2 DS    B         SAME AS DCBMACRF BYTE 2                 MDC023 00095600
DEBXXARG DS    A         ADDRESS OF BDAM READ EXCLUSIVE LIST     MDC024 00095700
DEBXOPNJ DS    A         POINTER TO DSAB (SEPARATE FROM DEBXDSAB)       00095800
*                        DYNAMICALLY ALLOCATED BY OPEN TYPE=J.  THIS    00095900
*                        POINTER WILL EXIST FOR NON-AUTHORIZED CALLERS  00096000
*                        OF OPEN TYPE=J FOR A DIRECT ACCESS DATA SET    00096100
*                        WHERE THE DATA SET NAME BEING OPENED IS        00096200
*                        DIFFERENT FROM THE DATA SET DESCRIBED BY THE   00096300
*                        DDNAME IN DCB AND THE JFCNWRIT BIT IS ON IN    00096400
*                        JFCB.  THE POINTER WILL BE USED BY CLOSE TO    00096500
*                        DYNAMICALLY UNALLOCATE THE DATA SET.           00096600
*                        (MDC352)                              @ZA02193 00096700
DEBXSAMB DS    A         ADDRESS OF SAM BLOCK (SAMB)  (MDC351) @Z40FP9A 00096800
DEBXOPET DS    XL8       DATASET OPEN TIME SET BY OPEN INITIAL @ZA39299 00096900
*****************************************************************  @P3A 00097000
*  THE FOLLOWING MAPPING REPRESENTS THE FIRST 8 BYTES OF        *  @P3A 00097100
*  DEFINE EXTENT DATA WHICH IS PASSED, VIA THE DEFINE           *  @P3A 00097200
*  EXTENT CCW, TO A DASD STORAGE SUBSYSTEM WHICH SUPPORTS       *  @P3A 00097300
*  THE ECKD DEFINE EXTENT CCW.                                  *  @P3A 00097400
*                                                               *  @P3A 00097500
*  THIS INFORMATION WILL BE COPIED FROM THE DEB EXTENSION TO    *  @P3A 00097600
*  THE SYSTEM BUILT DEFINE EXTENT DATA AREA, AND WILL BE SENT   *  @P3A 00097700
*  TO THE STORAGE SUBSYSTEM WITH EACH I/O REQUEST RELATED TO    *  @P3A 00097800
*  THIS DEB.                                                    *  @P3A 00097900
*                                                               *  @P3A 00098000
*  REFER TO THE APPROPRIATE STORAGE CONTROL REFERENCE           *  @P3A 00098100
*  PUBLICATION FOR A DETAILED DESCRIPTION OF THESE FIELDS.      *  @P3A 00098200
*                                                               *  @P3A 00098300
*****************************************************************  @P3A 00098400
DEBXDEF  DS    0XL8      DEFINE EXTENT DATA AREA                   @H2A 00098500
DEBDEFG1 DS    X         FLAG BYTE                                 @H2A 00098600
DEBNSHED EQU   X'80'     NO SEEK HEAD PERMITTED                    @H2A 00098700
DEBXVDEF EQU   X'40'     DEB DEF EXT DATA PARMS VALID. MUST BE ON  @P3C 00098800
*                        FOR DX DATA TO BE USED                    @P3A 00098900
DEBGATTR DS    XL1       GLOBAL ATTRIBUTES                         @H2A 00099000
DEBECKD  EQU   X'C0'     EXTENT DEFINITION                         @H2A 00099100
*                        B'XX......' EXTENT DEFINITION             @H2A 00099200
DEBGAEX1 EQU   X'80'     EXTENT DEFINITION  1                      @H2A 00099300
DEBGAEX2 EQU   X'40'     EXTENT DEFINITION  2                      @H2A 00099400
*                        B'00......' DEFINE EXTENT OPERATES        @H2A 00099500
*                        AS DEFINED FOR FIXED BLOCK ARCH           @H2A 00099600
*                        B'11......' DEFINE EXTENT OPERATES        @H2A 00099700
*                        AS DEFINED FOR CKD EXT-CCHH EXTENTS       @H2A 00099800
DEBSTRTP EQU   X'20'     CKD CONVERSION MODE - FOR SYSTEM USE      @P3C 00099900
*                        B'..1.....' CKD CONVERSION MODE REQD      @P3C 00100000
*                        B'..0.....' CDK CONVERSION MODE NOT REQD  @P3C 00100100
DEBGA345 EQU   X'1C'     ATTRIBUTES BITS  3,4,5                    @H2A 00100200
*                        B'...XXX..' ATTRIBUTE BITS 3,4,5          @H2A 00100300
DEBGA1   EQU   X'10'     ATTRIBUTE  1                              @H2A 00100400
DEBGA2   EQU   X'08'     ATTRIBUTE  2                              @05C 00100500
DEBGA3   EQU   X'04'     ATTRIBUTE  3                              @05C 00100600
*                        B'...000..' NORMAL CACHE ACCESS           @L4C 00100700
*                        B'...001..' BYPASS CACHE LOAD             @L4C 00100800
*                        B'...010..' INHIBIT CACHE LOAD            @L4C 00100900
*                        B'...011..' SEQUENTIAL ACCESS             @L4C 00101000
*                        B'...100..' SEQUENTIAL STAGING MODE       @P3C 00101100
*                        B'...101..' RECORD ACCESS MODE            @P3C 00101200
*                        B'...110..' RESERVED                      @P3A 00101300
*                        B'...111..' RESERVED                      @H2A 00101400
DEBNCACH EQU   X'00'     NORMAL CACHE ACCESS                       @L4A 00101500
DEBBCACH EQU   X'04'     BYPASS CACHE LOAD                         @L7C 00101600
DEBICACH EQU   X'08'     INHIBIT CACHE LOAD                        @L7C 00101700
DEBSCACH EQU   X'0C'     SEQUENTIAL ACCESS                         @L7C 00101800
DEBXRFLG EQU   X'10'     SEQUENTIAL PRESTAGE MODE                  @P3A 00101900
DEBRLC   EQU   X'14'     RECORD ACCESS MODE                        @P3A 00102000
DEBNRD   EQU   X'02'     NON RETENTIVE DATA ACCESS                 @08A 00102100
DEBINHFW EQU   X'01'     INHIBIT FAST WRITE                        @08A 00102200
*                        B'......10' USE NON-RETENTIVE DATA        @P3C 00102300
*                        B'......11' INHIBIT DASD FAST WRITE       @P3A 00102400
DEBBLKSZ DS    XL2       BLOCKSIZE IN BYTES                        @H2A 00102500
DEBEXTOK DS    0CL4      ZERO,EXTENT LOCATOR OR TOKEN              @H2A 00102600
         SPACE 1                                                   @08A 00102700
DEBNRDID DS    CL2       SUBSYSTEM FUNCTION ID: NON-RETENTIVE DATA @P3C 00102800
*                        OR CONCURRENT COPY / XRC SESSION ID       @P3A 00102900
         DS    XL1       RESERVED FOR SYSTEM USE                   @P3C 00103000
DEBGATTX DS    XL1       GLOBAL ATTRIB EXTENDED 2                  @P3A 00103100
*                                   B'00......' NO SPECIAL MODE    @P3A 00103200
*                                   B'01......' REGULAR DATA FMT   @P3A 00103300
*                                   B'10......' SPECIAL KEY SEARCH @P3A 00103400
*                                   B'11......' RESERVED           @P3A 00103500
*                                   B'..111...' RESERVED FOR SYS   @P3A 00103600
*                                   B'.....1..' R0 DATA NOT REQD   @P3A 00103700
*                                   B'......11' RESERVED FOR SYS   @P3A 00103800
DEBRMODE EQU   X'00'    NO SPECIAL MODE                            @P3A 00103900
DEBRDATA EQU   X'40'    REGULAR DATA FORMAT                        @P3A 00104000
DEBSKEY  EQU   X'80'    SPECIAL KEY SEARCH MODE                    @P3A 00104100
DEBDFTR0 EQU   X'04'    R0 DATA NOT REQUIRED                       @P3A 00104200
*****************************************************************  @P3A 00104300
*        END OF DEFINE EXTENT DATA AREA MAPPING                 *  @P3A 00104400
*****************************************************************  @P3A 00104500
DEBIOPID DS    CL4       I/O PREVENTION IDENTIFIER                 @L5A 00104600
DEBBLKID DS    CL4      BLOCK ID VALUE USED TO CALCULATE NUMBER OF @L6A 00104700
*                       BLOCKS IN THIS VOLUME FOR EXTENDED         @L6A 00104800
*                       BLOCK COUNT CHECKING                       @L6A 00104900
DEBXCASF DS    CL4      CACHE ATTRIBUTE SELECTION TOKEN            @LAA 00105000
DEBXFLG3 DS    B        FLAG BYTE                                  @LDA 00105100
DEBXTRNC EQU   X'80'      QSAM TRUNC MACRO HAS BEEN ISSUED FOR A   @P3C 00105200
*                           PDSE - IT WAS IGNORED.                 @P3A 00105300
DEBXNSEG EQU   X'40'      NULL SEGMENT ENCOUNTERED IN PDSE         @P3C 00105400
DEBXSMSG EQU   X'20'      SMS GUARANTEED SPACE DISP NEW OR MOD     @11A 00105500
DEBXDUDA EQU   X'10'      IEC708I DUP VOL ISSUED FOR DASD          @LOA 00105600
DEBXCAP  EQU   X'08'      UCB ADDRESS IN DEB CAPTURED BY OCE       @LFA 00105700
DEBXVTOC EQU   X'04'      NOT AUTHORIZED TO READ VTOC              @LSA 00105800
DEBXENQE EQU   X'02'      ENQUEUED ON PS, DISP=SHARE, OUTPUT       @LTA 00105900
DEBXUCNT EQU   X'01'      DECREMENT EDI USE COUNT IN ESTAE         @P7A 00106000
*                                                                  @LTC 00106100
DEBXAMBF DS    XL1      DEFINES THE USE OF DEBXAMB                 @LEA 00106200
DEBXABSS EQU   X'80'      DEBXAMB DEFINES A SSCB PTR...DEBXSSCB IS @LEA 00106300
*                         VALID                                    @LEA 00106400
DEBXARBA EQU   X'40'      DEBXAMB DEFINES AN RBA VALUE..DEBXRBA IS @15A 00106500
*                         THE RBA OF THE CONTROL INTERVAL IN THE   @15A 00106600
*                         VVDS WHICH CONTAINS THE NVR FOR A        @15A 00106700
*                         COMPRESSED FORMAT DATA SET. ONLY VALID   @15A 00106800
*                         UNTIL OPEN EXECUTORS STORE SSCB PTR IN   @15A 00106900
*                         DEBXSSCB.                                @15A 00107000
DEBXAOEF EQU   X'20'      DEBXAMB DEFINES AN IGGSXCB PTR...        @P5C 00107100
*                                                                  @P5D 00107200
DEBXAIB  EQU   X'10'      DEBXAMB DEFINES AN INTERMEDIATE BUFFER   @LKA 00107300
*                         USED FOR READ PREVIOUS TAPE PROCESSING   @LKA 00107400
DEBXAENCCB EQU X'08'      DEBXAMB DEFINES AN ENCCB PTR            @L19A 00107500
DEBXSCNT DS    XL2      NUMBER OF STRIPES FOR STRIPED DATA SET     @15C 00107600
DEBXSACB DS    A        POINTER TO SACB CONTROL BLOCK              @LDA 00107700
DEBXAFLG DS    B        FLAG BYTE                                  @LVC 00107800
DEBXADS  EQU   X'80'      ATTRIBUTE EXTENSION DATA SET             @12A 00107900
DEBXAINP EQU   X'40'      INPUT PROCESSING PERFORMED FOR           @12A 00108000
*                         "ATTRIBUTE EXTENSION" DATA SET           @12A 00108100
DEBXAOUT EQU   X'20'      OUTPUT PROCESSING PERFORMED FOR          @12A 00108200
*                         "ATTRIBUTE EXTENSION" DATA SET           @12A 00108300
DEBXAOFO EQU   X'10'      "ATTRIBUTE EXTENSION" D/S OPENED FOR     @12A 00108400
*                         OUTPUT PROCESSING                        @12A 00108500
DEBXLGDS EQU   X'08'      LARGE SEQUENTIAL DATA SET BEING PROCESSED@LVA 00108600
*                         USING EXCP, READ POINT OR WRITE POINT    @LVA 00108700
DEBXDEBLOCKX EQU X'04'  DEB HAS BEEN LOCKED EXCLUSIVELY BY DEBCHK @L18A 00108800
DEBXDEBLOCK  EQU X'04'  DEB HAS BEEN LOCKED EXCLUSIVELY BY DEBCHK1@L18A 00108900
DEBXIMG  EQU   X'02'    THIS IS SYS1.IMAGELIB                      @33A 00109000
DEBXEXP  EQU   X'01'    SET TO REQUEST SPECIAL SETTING OF IOSEXP   @24A 00109100
DEBXRSV1 DS    B        RESERVED                                   @LGA 00109200
DEBXVLSQ DS    BL2      EXPECTED TAPE VOL SEQ                      @LGA 00109300
DEBXDSSB DS    A        POINTER TO DSSB                            @JBC 00109400
DEBXAMB  DS    0A       ACCESS METHOD BLOCK...THE USE OF THIS PTR  @LEA 00109500
*                        IS DEFINED BY THE FIELD DEBXAMBF          @LEA 00109600
DEBXSSCB DS    0A       ADDRESS OF STRIPED SAM CONTROL BLOCK (SSCB)@LEA 00109700
DEBXRDBK DS    0A       ADDRESS OF INTERMEDIATE BUFFER USED WITH   @LKA 00109800
*                        READ PREVIOUS PROCESSING                  @LKA 00109900
DEBXENCCB DS   0A       ADDR OF ENCRYPTION CONTROL BLOCK (ENCCB)  @L19A 00110000
DEBXRBA  DS    A        RBA OF VVDS CI CONTAINING NVR              @P5C 00110100
*                                                                  @P5D 00110200
*                                                                  @P4A 00110300
DEBXDEBX DS    A        POINTER TO SECOND DEB EXTENSION            @13A 00110400
DEBXEND  EQU   *        END OF EXTENSION                           @H2A 00110500
DEBXLEN  EQU   DEBXEND-DEBXTN LENGTH OF DEB EXTENSION              @H2A 00110600
         SPACE 2                                                        00110700
*********************************************************************** 00110800
*                 SECOND DEB EXTENSION (ABOVE 31 MB LINE)             * 00110900
*                 POINTED TO BY DEBXDEBX IN THE 1ST DEB EXTENSION     * 00111000
*********************************************************************** 00111100
         SPACE 1                                                        00111200
DEB2XTN  DSECT                                                     @13A 00111300
         DS    0D                                                  @27A 00111400
DEB2XTNN DS    CL8       SECOND DEB EXTENSION EYE CATCHER          @13A 00111500
DEB2XLGH DS    H         LENGTH OF SECOND DEB EXTENSION            @13A 00111600
DEB2XRSG DS    0CL32                                               @13A 00111700
DEB2XSGL DS    XL2       STORAGE GROUP NAME LENGTH                 @13A 00111800
DEB2XSGN DS    CL30      STORAGE GROUP NAME                        @13A 00111900
DEB2XRMC DS    0CL32                                               @13A 00112000
DEB2XMCL DS    XL2       MANAGEMENT CLASS NAME LENGTH              @13A 00112100
DEB2XMCN DS    CL30      MANAGEMENT CLASS NAME                     @13A 00112200
DEB2XRSC DS    0CL32                                               @13A 00112300
DEB2XSCL DS    XL2       STORAGE CLASS LENGTH                      @13A 00112400
DEB2XSCN DS    CL30      STORAGE CLASS NAME                        @13A 00112500
DEB2XRDC DS    0CL32                                               @13A 00112600
DEB2XDCL DS    XL2       DATA CLASS LENGTH                         @13A 00112700
DEB2XDCN DS    CL30      DATA CLASS NAME                           @13A 00112800
DEB2XFG1 DS    B         FIRST FLAG BYTE                           @16A 00112900
DEB2XOSM EQU   X'80'     JFCMEDIA TYPE SET BY OPEN                 @16A 00113000
DEB2XNLM EQU   X'40'     NL TAPE DATASET OPENED FOR MOD            @LLA 00113100
DEB2XTCO EQU   X'20'     TCLOSE TAPE OUTPUT                        @LLA 00113200
DEB2XIBC EQU   X'10'     INACCURATE BLOCK COUNT                    @LLA 00113300
DEB2XNL1 EQU   X'08'     NL TAPE FILE SEQ 1                        @LLA 00113400
DEB2XVLL EQU   X'04'     DEB2X INCLUDES DATASET VOLUME LIST        @LQA 00113500
DEB2XABC EQU   X'02'     ACCURATE TOTAL BLOCK COUNT                @LQA 00113600
DEB2XECU EQU   X'01'     3490EMULATION EXT CAPACITY WRITTEN TO     @LQA 00113700
DEB2XUOF DS    XL1       TIOT DD OFFSET OF UNIT SELECTED BY OCE    @LFA 00113800
DEB2XLSQ DS    BL2       TAPE VOL SEQ FROM LABEL                   @LGA 00113900
DEB2XALV DS    CL1       ANSI VERSION DURING OUTPUT                @LJA 00114000
DEB2XFG2 DS    B         SECOND FLAG BYTE                          @LQC 00114100
DEB2X32M EQU   X'80'     OCE ISSUED 32BIT MODESET                  @LQA 00114200
DEB2XBTM EQU   X'40'     BUFFERED TM REQUESTED                     @LQA 00114300
DEB2XUSS EQU   X'20'     USS DIRECTORY OPENED USING BPAM OR PART   @LNA 00114400
*                         OF BPAM CONCATENATION                    @LNA 00114500
DEB2XEXV EQU   X'10'     DEB2XMXV EXCEEDED                         @20A 00114600
DEB2XSCA EQU   X'08'     TP MEDIA SCALED OPT PERFORMANCE           @LUA 00114700
DEB2BTMS EQU   X'04'     SYSTEM DEFAULTED BUFFERED TAPE MARKS      @LUA 00114800
DEB2XEMV EQU   X'02'     EXTEND MULTIVOL TAPE FILE                 @21A 00114900
DEB2X8WN EQU   X'01'     RACF RC8 CHANGED TO RC0                   @LWA 00115000
DEB2XTIM DS    A         PTR TO TIME STAMP                         @18A 00115100
DEB2XEXC DS    BL1       DEB2XMXV EXCEED COUNT                     @20A 00115200
DEB2XEDI DS    BL1                      EDI SMF INDICATORS         @LTA 00115300
DEB2XEXT EQU   X'80'                    DSN FOUND IN EXCLUDE TABLE @LTA 00115400
DEB2XOPO EQU   X'40'                    O/P AND ALREADY OPEN O/P   @LTA 00115500
DEB2XINO EQU   X'20'                    I/P AND ALREADY OPEN O/P   @LTA 00115600
DEB2XEPS EQU   X'10'                    DCBE, SCT OR DSAB EXCLUDED @LTA 00115700
DEB2XFG3 DS    BL1       THIRD FLAG BYTE                           @22C 00115800
DEB2XSCS EQU   X'80'     SYSZEDI SCOPE SYSTEM(S)                   @22A 00115900
DEB2XPSC EQU   X'40'     PERFORMANCE SEGMENTED                     @LXA 00116000
DEB2XEF1 EQU   X'20'     3592-E05 WRITING IN EFMT1 RECTECH         @LXA 00116100
DEB2XUPF EQU   X'10'     USER BSAM PGFIX IN USE                    @LZA 00116200
DEB2XEXCP EQU  X'08'     EAV BAM DETECTED ONE OR MORE EXCP        @L10A 00116300
*                         OR XDAP ISSUANCES                       @L10A 00116400
DEB2XMSDN EQU  X'04'     OPEN USED MULTSDN                        @L14A 00116500
DEB2XTRCE EQU  X'02'     DIAGNS=TRACE SPECIFIED                   @L16A 00116600
DEB2XSBS EQU   X'01'     START BLOCK ZERO STORED IN DEBBLKID       @23A 00116700
DEB2XCFG DS    B         ANSI V4 CCSID FLAGS(NOTE THAT ANY         @LJA 00116800
*                         TO THIS FLAG BYTE REQUIRES THE SAME      @LJA 00116900
*                         CHANGE BE DONE IN MACRO IFGSMF14 FIELD   @LJA 00117000
*                         SMF14CFG                                 @LJA 00117100
DEB2XIBM EQU   X'80'     IBM VERSION 4 CREATED TAPE                @LJA 00117200
DEB2XOUT EQU   X'40'     VERSION 4 TAPE OPENED FOR OUTPUT DISP NOT @LJA 00117300
*                        MOD                                       @LJA 00117400
DEB2XMOD EQU   X'20'     VERSION 4 TAPE OPENED FOR OUTPUT DISP MOD @LJA 00117500
DEB2XUDF EQU   X'10'     USER APPLICATION CCSID WAS DEFAULTED      @LJA 00117600
DEB2XTDF EQU   X'08'     TAPE CCSID WAS DEFAULTED                  @LJA 00117700
DEB2XIGN EQU   X'04'     TAPE CCSID SPECIFIED BUT NO CONVERSION    @LJA 00117800
*                        DONE - CCSID WAS IGNORED                  @LJA 00117900
DEB2XUSR DS    FL4       CCSID OF USER APPLICATION                 @LJA 00118000
DEB2XTPE DS    FL4       CCSID OF TAPE                             @LJA 00118100
DEB2XLBL DS    FL4       CCSID IN EXISTING TAPE LABEL              @LJA 00118200
DEB2XSDC DS    A         PTR TO SAM DATA CONVERSION BLOCK          @LJA 00118300
DEB2XTBL DS    F         ACCUMULATIVE BLOCKCNT ACROSS VOLUMES      @LLA 00118400
DEB2XTCB DS    F         DCB BLKCOUNT AT TCLOSE OUTPUT             @LLA 00118500
DEB2XSGT DS    B         STORAGE GROUP TYPE (GENERAL OR SPECIFIC)  @LMA 00118600
DEB2XPAR DS    X         STARTING PARTITION OF TAPE FILE           @LPA 00118700
DEB2XFG4 DS    B         FOURTH FLAG BYTE                          @LYA 00118800
DEB2XEEF EQU   X'20'     3592-E05/E06 WRITING IN EEFMT2 RECTECH    @LZC 00118900
DEB2XE1M EQU   X'10'     KEKLS 1 METHOD HASH                       @LYA 00119000
DEB2XE1I EQU   X'08'     KEKLS 1 INPUT HASH                        @LYA 00119100
DEB2XE2M EQU   X'04'     KEKLS 2 METHOD HASH                       @LYA 00119200
DEB2XE2I EQU   X'02'     KEKLS 2 INPUT HASH                        @LYA 00119300
DEB2XEE3 EQU   X'01'     3592-E06 WRITING IN EEFMT3 RECTECH        @LZA 00119400
DEB2XFG5 DS    B         FIFTH FLAG BYTE                           @LZA 00119500
DEB2XEF2 EQU   X'80'     3592-E06 WRITING IN EFMT2 RECTECH         @LZA 00119600
DEB2XENC EQU   X'40'     TAPE CARTRIDGE ENCRYPTED                  @LZA 00119700
DEB2XMNW EQU   X'20'     OPEN ENTERED WITH MOD CHANGED TO NEW      @26A 00119800
DEB2XDEQ EQU   X'10'     TAPE INPUT FREE=EOV HONORED               @M4A 00119900
DEB2XEF3 EQU   X'08'     3592-E07 WRITING IN EFMT3 RECTECH         @M9A 00120000
DEB2XEE4 EQU   X'04'     3592-E07 WRITING IN EEFMT4 RECTECH        @M9A 00120100
DEB2XEEG EQU   X'02'     3592-E06/E07 WRITING IN EEFMT3 RECTECH    @M9A 00120200
DEB2XCDT EQU   X'01'     FORCE EOV TO CHECK DEVICE TYPE            @28A 00120300
DEB2XSBL DS    F         START BLOCK NUMBER AFTER POSITIONING TP   @21A 00120400
DEB2XSTV DS    A         ADDRESS OF FIRST VOLSER ENTRY             @LQA 00120500
DEB2XNXV DS    A         ADDRESS NEXT VOLSER ENTRY                 @LQA 00120600
DEB2XVLN DS    F         NUMBER OF VOLS IN DATASET VOLUME LIST     @LQA 00120700
DEB2XMXV DS    F         MAXIMUM NUMBER OF VOLUME ENTRIES          @LQA 00120800
DEB2XDID DS    XL8       TIMESTAMP ID FOR THE DEB                  @LYA 00120900
DEB2XLK1 DS    B         LENGTH OF KEYLABEL1                       @LYA 00121000
DEB2XLK2 DS    B         LENGTH OF KEYLABEL2                       @LYA 00121100
DEB2XFG6 DS    BL1       SIXTH FLAG BYTE                          @L13A 00121200
DEB2XEEX      EQU   X'80' DCBE INVALIDATED BECAUSE EXCP AND NO     @29C 00121300
*                         FOUNDATION EXTENSION PRESENT            @L13A 00121400
DEB2XDSO      EQU   X'40' DCBE INVALIDATED BECAUSE DSORG IS NOT    @29C 00121500
*                         PS, PO OR DA                            @L13A 00121600
DEB2XFRE      EQU   X'20' DCBE INVALIDATED BECAUSE DCBE STORAGE IS @29C 00121700
*                         NOT ADDRESSABLE                         @L13A 00121800
DEB2XKEY      EQU   X'10' DCBE INVALIDATED BECAUSE DCBE STORAGE    @29C 00121900
*                         IS NOT IN KEY OF CALLER                 @L13A 00122000
DEB2XEID      EQU   X'08' DCBE INVALIDATED BECAUSE DCBEID IS NOT   @29C 00122100
*                         'DCBE'                                  @L13A 00122200
DEB2XMIN      EQU   X'04' DCBE INVALIDATED BECAUSE DCBE IS NOT AT  @29C 00122300
*                         LEAST THE MINIMUM REQUIRED LENGTH       @L13A 00122400
DEB2XNDE      EQU   X'02' DCBE INVALIDATED BECAUSE THE DCBHIARCHY  @29C 00122500
*                         FLAGS(X'84') ARE ON BUT DCBDCBE IS 0    @L13A 00122600
*                         OR VER1, 2-EF VER2)                     @L17A 00122700
DEB2XRBL      EQU   X'01' TAPE READBACK LAST VOLUME                @32A 00122800
DEB2XFG7 DS   BL1         7TH FLAG BYTE                            @PCC 00122900
DEB2XVLC      EQU   X'80' IEC716I ISSUED                           @PCA 00123000
DEB2XPLR      EQU   X'40' TAPE INPUT PASS LEAVE OR RETAIN          @MCA 00123100
DEB2XFCC      EQU   X'20' FREE=CLOSE IN A CONCATENATION            @30A 00123200
DEB2XLVL      EQU   X'10' DASD LAST VOLUME DETECTED                @31A 00123300
              ORG   DEB2XFG7                                       @MDA 00123400
DEB2XCMPTYPE DS  BL1                                               @MDA 00123500
*             COMPRESSION ATTRIBUTE BITS 4,5,6,7  B'....XXXX'      @MDA 00123600
DEB2XCMPNA    EQU   B'0000'           NOT COMPRESSED               @MDA 00123700
DEB2XCMPGEN   EQU   B'0001'           GENERIC COMPRESSION          @MDA 00123800
DEB2XCMPTLRD  EQU   B'0010'           TAILORED COMPRESSION         @MDA 00123900
DEB2XCMPZEDC  EQU   B'0011'           ZEDC COMPRESSION             @MEA 00124000
DEB2XKET DS   F           TAPE ENCRYPTION KEY EXCHANGE TIME        @25A 00124100
DEB2XDXP DS   A           POINTER TO DEB EXTENSION                @L12A 00124200
DEB2XDSV DS   B           DATA SET VERSION(0-PS(NOT EF), 1-EF VER0 @29C 00124300
DEB2XFG8 DS   BL1         8TH FLAG BYTE                            @34A 00124400
DEB2XDBYP     EQU   X'80' DCBE_BYPASS_AUTH WAS SET ON              @34A 00124500
DEB2XJBYP     EQU   X'40' JSCBPASS WAS SET ON                      @34A 00124600
DEB2XAUTH     EQU   X'20' CALLER OF OPEN WAS AUTHORIZED TO         @34A 00124700
*                         SUPERVISOR STATE, SYSTEM KEY, OR APF     @34A 00124800
DEB2XBYP      EQU   X'10' OPEN BYPASSED SAF/RACF CHECKS            @34A 00124900
DEB2XBPNOTPDS EQU   X'08' BPAM USED BUT DATA SET IS NOT PDS, PDSE, @35A 00125000
*                          OR UNIX DIRECTORY.                      @35A 00125100
DEB2XEXTDFAIL EQU   X'04' DADSM FAILED TO EXTEND TO NEW VOLUME DUE @36A 00125200
*                          TO INSUFFICIENT SPACE. SSR ON/OFF      1@36A 00125300
DEB2XDSENCRYPTOK EQU X'02' THE DCBE HAS DSENCRYPT=OK              @L20A         
         DS   XL2         RESERVED                                 @35C 00125400
DEB2XTBX DS   D           TOTAL BLOCKS ACROSS TAPE VOLUMES         @27A 00125500
******** THIS LAST SECTION IS OF VARIABLE LENGTH. SO ALL ********  @LQA 00125600
******** NEW FIELDS MUST BE ADDED BEFORE THIS SECTION    ********  @LQA 00125700
DEB2XVEN DS   CL7        VOLUME ENTRY (INCLUDES ',' AFTER VOLSER   @LQA 00125800
DEB2XEND EQU  *          END OF EXTENSION                          @13A 00125900
DEB2XLEN EQU  DEB2XEND-DEB2XTN LENGTH OF 2ND DEB EXTENSION         @13A 00126000
         POP   PRINT                                                    00126100
         MEND  , */                                                     00126200
*%DEBL2 : ;                                                             00126300
*%IF IKEPLS=''  %THEN                                                   00126400
*    %GOTO DEBL3;                                                       00126500
*%IHALPUSH='@LISTPUSH';                                                 00126600
*%IHALPOP='@LISTPOP';                                                   00126700
*%IHALOFF='@LISTOFF';                                                   00126800
*IHALPUSH;                                                              00126900
*%IF IHALIST='YES'  %THEN                                               00127000
*    %GOTO DEBL3;                                                       00127100
*IHALOFF;                                                               00127200
*%DEBL3 : ;                                                             00127300
* /* *************************************************************** */ 00127400
* /*                  DEB BASIC SECTION                              */ 00127500
* /* *************************************************************** */ 00127600
*                                                                       00127700
* DECLARE                                                               00127800
* 1 DEBBASIC BASED(DEBPTR) BDY(WORD),                                   00127900
*     3 DEBTCBAD PTR(31),            /* ADDRESS OF TCB FOR THIS DEB  */ 00128000
*      4 DEBNMSUB CHAR(1),           /* NUMBER OF SUBROUTINES LOADED    00128100
*                                       BY OPEN EXECUTOR ROUTINES    */ 00128200
*      4 DEBTCBB  PTR(24),           /* ADDRESS OF TCB FOR THIS DEB  */ 00128300
*     3 DEBDEBAD PTR(31),            /* ADDRESS OF THE NEXT DEB IN      00128400
*                                       THE SAME TASK                */ 00128500
*      4 DEBAMLNG CHAR(1),           /* NUMBER OF BYTES IN THE ACCESS   00128600
*                                       METHOD DEPENDENT SECTION.       00128700
*                                       FOR BDAM THIS FIELD CONTAINS    00128800
*                                       THE LENGTH EXPRESSED IN         00128900
*                                       NUMBER OF WORDS              */ 00129000
*      4 DEBDEBB  PTR(24),           /* *** SAME AS DEBDEBAD ABOVE   */ 00129100
*     3 DEBIRBAD PTR(31),            /* IRB STORAGE ADDRESS USED FOR    00129200
*                                       APPENDAGE ASYNCHRONOUS EXITS */ 00129300
*      4 DEBOFLGS CHAR(1),           /* DATA SET STATUS FLAGS        */ 00129400
*       5 DEBDISP  BIT(2),           /* DATA SET DISPOSITION FLAGS   */ 00129500
* %DCL DEBDSOLD CHAR;                                                   00129600
* %DEBDSOLD='''01''B';               /* OLD                          */ 00129700
* %DCL DEBDSMOD CHAR;                                                   00129800
* %DEBDSMOD='''10''B';               /* MOD                          */ 00129900
* %DCL DEBDSNEW CHAR;                                                   00130000
* %DEBDSNEW='''11''B';               /* NEW                          */ 00130100
*       5 DEBEOF   BIT(1),           /* END-OF-FILE (EOF) ENCOUNTERED   00130200
*                                       (TAPE INPUT)                    00130300
*                                       FORMAT 1 DSCB BIT 93.0          00130400
*                                       INDICATES THAT THE CURRENT      00130500
*                                       VOLUME IS THE LAST VOLUME OF    00130600
*                                       THE DATA SET (DASD INPUT)    */ 00130700
*       5 DEBRLSE  BIT(1),           /* RELEASE UNUSED EXTERNAL         00130800
*                                       STORAGE (DASD)                  00130900
*                                       EMULATOR TAPE WITH SECOND       00131000
*                                       GENERATION FORMAT.  TAPE MAY    00131100
*                                       CONTAIN BLOCKS SHORTER THAN     00131200
*                                       12 CHARACTERS (TAPE)         */ 00131300
*       5 DEBDCB   BIT(1),           /* DCB MODIFICATION             */ 00131400
*       5 DEBSPLIT BIT(1),           /* SPLIT CYLINDER (DASD). NO       00131500
*                                       LONGER SUPPORTED.               00131600
*                                       7-TRACK EMULATOR TAPE WITH      00131700
*                                       POSSIBLE MIXED PARITY RECORDS   00131800
*                                       (TAPE)                       */ 00131900
*       5 DEBLABEL BIT(1),           /* NONSTANDARD LABELS           */ 00132000
*       5 DEBRERR  BIT(1),           /* USE REDUCED ERROR RECOVERY      00132100
*                                       PROCEDURE (TAPE)                00132200
*                                       CONCATENATED PARTITIONED        00132300
*                                       ORGANIZATION DATA SETS          00132400
*                                       PROCESSED USING BPAM (DASD)  */ 00132500
*      4 DEBIRBB  PTR(24),           /* *** SAME AS DEBIRBAD ABOVE   */ 00132600
*     3 DEBOPATB CHAR(1),            /* FLAGS INDICATING BOTH THE       00132700
*                                       METHOD OF I/O PROCESSING AND    00132800
*                                       THE DISPOSITION THAT IS TO BE   00132900
*                                       PERFORMED WHEN AN END-OF-VOLUME 00133000
*                                       (EOV) CONDITION OCCURS       */ 00133100
*      4 DEBABEND BIT(1),            /* SET BY ABEND INDICATING A       00133200
*                                       SYSABEND OR SYSUDUMP DATA       00133300
*                                       SET (OS/VS2)                 */ 00133400
*      4 DEBZERO  BIT(1),            /* ALWAYS ZERO                  */ 00133500
*      4 DEBPOSIT BIT(2),            /* DATA SET POSITIONING FLAGS   */ 00133600
* %DCL DEBRERED CHAR;                                                   00133700
* %DEBRERED='''01''B';               /* REREAD                       */ 00133800
* %DCL DEBLEAVE CHAR;                                                   00133900
* %DEBLEAVE='''11''B';               /* LEAVE                        */ 00134000
*      4 DEBACCS  BIT(4),            /* TYPE OF I/O ACCESSING BEING     00134100
*                                       DONE                         */ 00134200
* %DCL DEBINPUT CHAR;                                                   00134300
* %DEBINPUT='''0000''B';             /* INPUT                        */ 00134400
* %DCL DEBOUTPT CHAR;                                                   00134500
* %DEBOUTPT='''1111''B';             /* OUTPUT                       */ 00134600
* %DCL DEBINOUT CHAR;                                                   00134700
* %DEBINOUT='''0011''B';             /* INOUT                        */ 00134800
* %DCL DEBOUTIN CHAR;                                                   00134900
* %DEBOUTIN='''0111''B';             /* OUTIN                        */ 00135000
* %DCL DEBRDBCK CHAR;                                                   00135100
* %DEBRDBCK='''0001''B';             /* RDBACK                       */ 00135200
* %DCL DEBUPDAT CHAR;                                                   00135300
* %DEBUPDAT='''0100''B';             /* UPDAT                        */ 00135400
*     3 DEBQSCNT CHAR(1),            /* PURGE (SVC 16) - QUIESCE        00135500
*                                       COUNT.  NUMBER OF DEVICES       00135600
*                                       EXECUTING USER'S CHANNEL        00135700
*                                       PROGRAMS, AS SHOWN BY BITS 5    00135800
*                                       AND 6 OF UCBFL1 FIELDS       */ 00135900
*     3 DEBFLGS1 CHAR(1),            /* FLAG FIELD                   */ 00136000
*      4 DEBPWCKD BIT(1),            /* PASSWORD WAS SUPPLIED DURING    00136100
*                                       OPEN.  EOV WILL NOT REQUEST A   00136200
*                                       PASSWORD FOR EACH ADDITIONAL    00136300
*                                       VOLUME OF A MULTIVOLUME DATA    00136400
*                                       SET                          */ 00136500
*      4 DEBEOFDF BIT(1),            /* SET BY EOV TO INFORM CLOSE      00136600
*                                       THAT AN END-OF-FILE HAS BEEN    00136700
*                                       ENCOUNTERED AND, THEREFORE,     00136800
*                                       DEFERRED LABEL PROCESSING IS    00136900
*                                       ALLOWED                      */ 00137000
*      4 DEBRSIOA BIT(1),            /* SIO APPENDAGE RE-ENTRY          00137100
*                                       AUTHORIZATION BIT (OS/VS1)      00137200
*                                       (MDC331)             @XM06077*/ 00137300
*      4 DEBEXCPA BIT(1),            /* EXCP IS AUTHORIZED   @ZA40332   00137400
*                                       FOR THIS DEB         @ZA40332*/ 00137500
*      4 DEBCINDI BIT(1),            /* DCB ASSOCIATED WITH THIS DEB    00137600
*                                       IS BEING PROCESSED BY THE       00137700
*                                       COMPATIBILITY INTERFACE         00137800
*                                       ROUTINES (VSAM, SAM)   ICB462*/ 00137900
*      4 DEBF1CEV BIT(1),            /* EOV PROCESSING OCCURRED         00138000
*                                       DURING CLOSE PROCESSING.        00138100
*                                       TESTED AND SET TO ZERO BY       00138200
*                                       CLOSE, SET TO ONE BY EOV.       00138300
*                                       (ICB353)               A42228*/ 00138400
*      4 DEBAPFIN BIT(1),            /* IF ON, AUTHORIZED PROGRAMS      00138500
*                                       CAN BE LOADED          MDC001*/ 00138600
*      4 DEBXTNIN BIT(1),            /* IF ONE, DEB EXTENSION EXISTS    00138700
*                                       (OS/VS2)               MDC007*/ 00138800
*     3 DEBFLGS2 CHAR(1),            /* FLAGE FIELD TWO         @L5C */ 00138900
*      4 DEBIOPAV BIT (1),          /* IF ONE THE PREVENTION      @L5A  00139000
*                                      IDENTIFIER IN THE DEB      @L5A  00139100
*                                      EXTENSION IS VALID        @L5A*/ 00139200
*      4 DEBVCR   BIT (1),          /* RLS=CR JCL OPTION         @19C*/ 00139300
*      4 DEBVNRI  BIT (1),          /* RLS=NRI JCL OPTION        @19C*/ 00139400
*      4 DEBVCRE  BIT (1),          /* RLS=CRE JCL OPTION        @19C*/ 00139500
*                                                              /*@H3A*/ 00139600
*      4 DEBVRLS  BIT (1),          /* VSAM RLS ACCESS (VSAM ONLY)      00139700
*                                                                @P5M*/ 00139800
*                                   /* USED BY O/C/EOV TO MAINTAIN      00139900
*                                      AN UNIFORM RECORDING MODE IN     00140000
*                                      TAPE DATA SETS THAT SPAN OVER    00140100
*                                      MORE THAN ONE VOLUME      @H3A*/ 00140200
*        5 DEBDSRM0 BIT (1),        /* TAPE DATA SET RECORDING          00140300
*                                                    MODE FLAG 0 @P5C*/ 00140400
*      4 DEBDSRM1 BIT (1),          /* TAPE DATA SET RECORDING          00140500
*                                                    MODE FLAG 1 @H3C*/ 00140600
*      4 DEB31UCB BIT (1),          /* UCB address field is 4           00140700
                                       bytes. Use DEBSUCBA,             00140800
                                       DEBUCBAD,DEBSDVMX OR             00140900
                                       DEBDVMOD31 instead of            00141000
                                       DEBSUCBB,DEBUCBA,DEBSDVM         00141100
                                       OR DEBDVMOD               @MXA*/ 00141200
*      4 DEBTVS   BIT (1),          /* TRANSACTIONAL VSAM        @P6C*/ 00141300
*     3 DEBUSRPG PTR(31),            /* ADDRESS OF FIRST IOB IN THE     00141400
*                                       USER PURGE CHAIN  (OS/VS1)      00141500
*                                       ADDRESS OF PURGED I/O RESTORE   00141600
*                                       LIST (PIRL)  (OS/VS2)           00141700
*                                       (MDC029)               YM3158*/ 00141800
*      4 DEBNMEXT CHAR(1),           /* NUMBER OF EXTENT DESCRIPTIONS   00141900
*                                       STARTING AT DEBBASND. ONE       00142000
*                                       EXTENT PER UNIT FOR EXTENDED    00142100
*                                       FORMAT OR PDSE DATA SETS     */ 00142200
*      4 DEBUSRPB PTR(24),           /* *** SAME AS DEBUSRPG ABOVE   */ 00142300
*     3 DEBRRQ   PTR(31),            /* POINTER TO RELATED REQUEST      00142400
*                                       QUEUE (OS/VS2)         MDC026*/ 00142500
*      4 DEBECBAD PTR(31),           /* ADDRESS OF A PARAMETER LIST     00142600
*                                       USED TO LOCATE THE PURGE ECB    00142700
*                                       FOR AN SVC PURGE REQUEST        00142800
*                                       (OS/VS1)               MDC025*/ 00142900
*       5 DEBPRIOR CHAR(1),          /* PRIORITY OF THE TASK OWNING     00143000
*                                       DEB                          */ 00143100
*       5 DEBECBB  PTR(24),          /* *** SAME AS DEBECBAD ABOVE   */ 00143200
*     3 DEBDCBAD PTR(31),            /* ADDRESS OF DCB OR ACB           00143300
*                                       ASSOCIATED WITH THIS DEB     */ 00143400
*      4 DEBPROTG CHAR(1),           /* TASK PROTECTION KEY IN HIGH-    00143500
*                                       ORDER 4 BITS                 */ 00143600
*       5 DEBDEBID CHAR(1),          /* A HEX F IN LOW-ORDER 4 BITS     00143700
*                                       TO IDENTIFY THIS BLOCK AS A     00143800
*                                       DEB                          */ 00143900
*      4 DEBDCBB PTR(24),            /* *** SAME AS DEBDCBAD ABOVE   */ 00144000
*     3 DEBAPPAD PTR(31),            /* ADDRESS OF THE I/O APPENDAGE    00144100
*                                       VECTOR TABLE                 */ 00144200
*      4 DEBEXSCL CHAR(1),  /*  THIS FIELD DETERMINES THE SIZE OF       00144300
*                        THE DEVICE DEPENDENT SECTION. TWO TO THIS      00144400
*                        POWER GIVES THE LENGTH OF THE DEVICE-          00144500
*                        DEPENDENT SECTION AT DEBBASND. EXTENT SCALE -  00144600
*                        4 (16 BYTES) FOR DIRECT ACCESS DEVICE AND      00144700
*                        3525 CARD PUNCH WITH DEVICE-ASSOCIATED DATA    00144800
*                        SET SUPPORT AND 2 (4 BYTES) FOR NONDIRECT      00144900
*                        ACCESS DEVICE  AND COMMUNICATION DEVICE.*/     00145000
*      4 DEBAPPB  PTR(24),           /* *** SAME AS DEBAPPAD ABOVE   */ 00145100
*     3 DEBBASND CHAR(0) BDY(WORD);                                     00145200
*                                                                       00145300
*                                                             /* @H3A*/ 00145400
*  DECLARE                 /* 3480 TAPE DATA SET RECORDING MODES @H3A*/ 00145500
*    DEBDSCMP BIT(8) CONSTANT('00001000'B), /* COMPACTION MODE   @H3A*/ 00145600
*    DEBDSNCP BIT(8) CONSTANT('00000100'B); /* NON-COMPACTION MODE      00145700
*                                                                @H3A*/ 00145800
* /* *************************************************************** */ 00145900
* /*   UNIT RECORD, MAGNETIC TAPE, TELECOMMUNICATIONS DEVICES SECTION*/ 00146000
* /*                                                                 */ 00146100
* /*     NOTE  FOR TELECOMMUNICATIONS DEVICES, THE UCB ADDRESS       */ 00146200
* /*           IS REPEATED FOR EACH LINE ASSIGNED                    */ 00146300
* /* *************************************************************** */ 00146400
*                                                                       00146500
*  DECLARE 1 DEBBAS02                                                   00146600
*%IF IKEPLS='2'  %THEN                                                  00146700
*    %GOTO DEBA3;                                                       00146800
*       BASED(ADDR(DEBBASND)) BDY(WORD),                                00146900
*%GOTO DEBA4;                                                           00147000
*%DEBA3 : ;                                                             00147100
*       DEF(DEBBASND) BDY(WORD),                                        00147200
*%DEBA4 : ;                                                             00147300
*     3 DEBDDS1 BDY(WORD),                                              00147400
*      4 DEBSUCBA PTR(31),       /* Address of UCB.  If DEB31UCB is off,00147500
*                                high order byte is not valid.   @MXC*/ 00147600
*       5 DEBSDVM CHAR(1),       /* DEVICE MODIFIER.  FOR MAGNETIC      00147700
*                                TAPE, MODE SET OPERATION CODE OR MODE  00147800
*                                SET FUNCTION BYTE.  For unit record,   00147900
*                                reserved.  Valid only if DEB31UCB      00148000
*                                is off.                         @MXA*/ 00148100
*                                 /* TAPE MODE SET FUNCTION BYTE @H3A*/ 00148200
*        6 DEBMTRF0 BIT(1),       /* TAPE RECORDING FORMAT BIT 0 @H3A*/ 00148300
*        6 DEBMTRF1 BIT(1),       /* TAPE RECORDING FORMAT BIT 1 @H3A*/ 00148400
*        6 DEBMTWI  BIT(1),       /* TAPE WRITE IMMEDIATE               00148500
*                                           (NON-BUFFERED WRITE) @H3A*/ 00148600
*        6 DEBMINHS BIT(1),       /* INHIBIT SUPERVISOR COMMANDS @H3A*/ 00148700
*        6 DEBMCOMP BIT(1),       /* COMPACTED RECORDING MODE    @H3A*/ 00148800
*         7 DEBCMPAC BIT(1),      /* COMPACTED RECORDING MODE    @H3A*/ 00148900
*        6    *     BIT(1),       /* RESERVED                    @H3A*/ 00149000
*        6 DEBM3424 BIT(1),       /* 3424 MODE SET FLAG          @H3A*/ 00149100
*         7 DEBM9348 BIT(1),      /* RESERVED(WILL BE DELETED)   @H3A*/ 00149200
*        6 DEBMINHE BIT(1),       /* INHIBIT CONTROL UNIT ERP    @H3A*/ 00149300
*       5 DEBSUCBB PTR(24),          /* *** SAME AS DEBSUCBA ABOVE   */ 00149400
*      4 DEBDEVED CHAR(0) BDY(WORD), /*End of common tape & unit rcd    00149500
*                                 fields when DEB31UCB is off    @MXC*/ 00149600
*                                                                       00149700
* /* The following fields are present only if DEB31UCB is on or         00149800
*    with 3525 device-related data set support.                  @MXC*/ 00149900
*                                                                       00150000
*      4 DEBRDCB    PTR(31),         /* ADDR OF DCB FOR 3525 READ  @MXC 00150100
*                                       ASSOCIATED DATA SET    ICB394*/ 00150200
*       5 DEBSDVMX  BIT(8),      /* Device modifier.  For magnetic      00150300
*                                tape, mode set operation code or mode  00150400
*                                set function byte.  For unit record,   00150500
*                                reserved.  Valid only if DEB31UCB      00150600
*                                is on.                          @MXA*/ 00150700
*       5 DEBRDCBA  PTR(24),     /* Same as DEBRDCB above or            00150800
*                                reserved if DEB31UCB is on      @MXA*/ 00150900
*      4 DEBDVEDX   CHAR(0),     /*End of section if DEB31UCB on @MXA*/ 00151000
* /* The following fields are present only with 3525 device-     @MXA*/ 00151100
* /* related data set support.                                   @MXA*/ 00151200
*      4 DEBPDCB    PTR(31),         /* ADDRESS OF DCB FOR THE PUNCH    00151300
*                                       ASSOCIATED DATA SET    ICB394*/ 00151400
*       5 DEBRSV07   CHAR(1),        /* RESERVED               ICB394*/ 00151500
*       5 DEBPDCBA   PTR(24),        /* SAME AS DEBPDCB ABOVE  ICB394*/ 00151600
*      4 DEBWDCB    PTR(31),         /* ADDRESS OF DCB FOR THE PRINT    00151700
*                                       ASSOCIATED DATA SET    ICB394*/ 00151800
*       5 DEBRSV08   CHAR(1),        /* RESERVED               ICB394*/ 00151900
*       5 DEBWDCBA   PTR(24);        /* SAME AS DEBWDCB ABOVE  ICB394*/ 00152000
*                                                                       00152100
*                                                             /* @H3A*/ 00152200
*  DECLARE               /* 9-TRACK TAPE MODESET OPERATION CODES @H3A*/ 00152300
*    DEBMTDN4 BIT(8) CONSTANT('11010011'B),    /* 6250 BPI       @H3A*/ 00152400
*    DEBMTDN3 BIT(8) CONSTANT('11000011'B),    /* 1600 BPI       @H3A*/ 00152500
*    DEBMTDN2 BIT(8) CONSTANT('11001011'B);    /*  800 BPI       @H3A*/ 00152600
*  DECLARE                /* 7-TRACK TAPE MODESET SKELETON CODES        00152700
*                            (MUST BE COMPLETED WITH PARITY,            00152800
*                                 TRANSLATION AND/OR CONVERSION) @H3A*/ 00152900
*    DEBM7DN0 BIT(8) CONSTANT('00000011'B),    /*  200 BPI       @H3A*/ 00153000
*    DEBM7DN1 BIT(8) CONSTANT('01000011'B),    /*  556 BPI       @H3A*/ 00153100
*    DEBM7DN2 BIT(8) CONSTANT('10000011'B);    /*  800 BPI       @H3A*/ 00153200
*  DECLARE                        /* 3480 TAPE OPERATION CODE    @H3A*/ 00153300
*    DEBMSTWI BIT(8) CONSTANT('11000011'B);    /* SET TAPE WRITE @H3A*/ 00153400
*                                              /* IMMEDIATE CODE @H3A*/ 00153500
*  DECLARE                        /* 3424 MODE SET DENSITY CODES @H3A*/ 00153600
*    DEBM6250 BIT(8) CONSTANT('11000010'B),    /* 6250 BPI       @H3A*/ 00153700
*    DEBM1600 BIT(8) CONSTANT('01000010'B);    /* 1600 BPI       @H3A*/ 00153800
*  DECLARE                        /* RESERVED(WILL BE DELETED)   @H3A*/ 00153900
*    DEBM4TRK BIT(8) CONSTANT('11000010'B),    /* 4-TRACK        @H3A*/ 00154000
*    DEBM2TRK BIT(8) CONSTANT('10000010'B),    /* 2-TRACK        @H3A*/ 00154100
*    DEBM1TRK BIT(8) CONSTANT('01000010'B);    /* 1-TRACK        @H3A*/ 00154200
*                                                             /* @H3A*/ 00154300
*                                                                       00154400
* /* *************************************************************** */ 00154500
* /*                3540 ACCESS METHOD DEPENDENT SECTION     @X04AA9A*/ 00154600
* /*                (OS/VS1 ONLY)                            @X04AA9A*/ 00154700
* /*                                                                 */ 00154800
* /*     NOTE  THIS SECTION FOLLOWS DEBSUCBA IN UNIT RECORD,         */ 00154900
* /*           MAGNETIC TAPE, TELECOMMUNICATIONS DEVICES SECTION     */ 00155000
* /*           IF DEB IS FOR 3540 DEVICE.                    @X04AA9A*/ 00155100
* /* *************************************************************** */ 00155200
*                                                                       00155300
* DECLARE 1 DEBACS09                                                    00155400
*%IF IKEPLS='2'  %THEN                                                  00155500
*    %GOTO DEBA5;                                                       00155600
*       BASED(ADDR(DEBDEVED)) BDY(WORD),   /*                @X04AA9A*/ 00155700
*%GOTO DEBA6;                                                           00155800
*%DEBA5 : ;                                                             00155900
*       DEF(DEBDEVED) BDY(WORD),     /*                      @X04AA9A*/ 00156000
*%DEBA6 : ;                                                             00156100
*    2 DEBASC09 CHAR(16) BDY(WORD),  /* 3540 ACCESS METHOD DEPENDENT    00156200
*                                       SECTION  (MDC317)    @X04AA9A*/ 00156300
*     3 DEBVOLAC CHAR(1),            /* VOLUME ACCESSIBILITY            00156400
*                                       INDICATOR  (MDC327)  @X04AA9A*/ 00156500
*     3 DEBDSSQL CHAR(1),            /* DATA SET SECURITY QUALIFIER     00156600
*                                       (MDC328)             @X04AA9A*/ 00156700
*     3 DEBVSEQU PTR(8),             /* VOLUME SEQUENCE NUMBER          00156800
*                                       (MDC318)             @X04AA9A*/ 00156900
*     3 DEBEAMFG BIT(8),             /* FLAG BYTE  (MDC319)  @X04AA9A*/ 00157000
*      4 DEBMULTI BIT(1),            /* MULTI-VOLUME INDICATOR          00157100
*                                       (MDC320)             @X04AA9A*/ 00157200
*      4 DEBDSOPN BIT(1),            /* DATA SET IS OPEN                00157300
*                                       (MDC321)             @X04AA9A*/ 00157400
*      4 DEBVAMSG BIT(1),            /* VOLUME ACCESSIBILITY MESSAGE    00157500
*                                       HAS BEEN ISSUED  (MDC329)       00157600
*                                                            @X04AA9A*/ 00157700
*      4 DEBSECVL BIT(1),            /* SECURE VOLUME  (MDC332)         00157800
*                                                            @X04AA9A*/ 00157900
*      4 DEBRV004 BIT(1),            /* RESERVED             @X04AA9A*/ 00158000
*      4 DEBRV005 BIT(1),            /* RESERVED             @X04AA9A*/ 00158100
*      4 DEBRV006 BIT(1),            /* RESERVED             @X04AA9A*/ 00158200
*      4 DEBRV007 BIT(1),            /* RESERVED             @X04AA9A*/ 00158300
*     3 DEBDSID  CHAR(8),            /* DATA SET IDENTIFIER (DSID)      00158400
*                                       (INPUT)  (MDC305)    @X04AA9A*/ 00158500
*      4 DEBEXDTE CHAR(6),           /* EXPIRATION DATE (OUTPUT)        00158600
*                                       (MDC333)             @X04AA9A*/ 00158700
*      4 DEBWTPTI CHAR(1),           /* WRITE PROTECT INDICATOR         00158800
*                                       (OUTPUT)  (MDC334)   @X04AA9A*/ 00158900
*      4 DEBRV008 CHAR(1),           /* RESERVED (OUTPUT)  (MDC335)     00159000
*                                                            @X04AA9A*/ 00159100
*     3 DEBEOD   CHAR(4) BDY(WORD),  /* END OF DATA (EOD) ADDRESS       00159200
*                                       (INPUT)  (MDC306)    @X04AA9A*/ 00159300
*      4 DEBBOE   CHAR(4) BDY(WORD), /* BEGINNING OF EXTENT (BOE)       00159400
*                                       ADDRESS (OUTPUT)  (MDC322)      00159500
*                                                            @X04AA9A*/ 00159600
*       5 DEBEODRV PTR(8),           /* RESERVED (MDC307)    @X04AA9A*/ 00159700
*        6 DEBBOERV PTR(8),          /* RESERVED  (MDC323)   @X04AA9A*/ 00159800
*       5 DEBEODTT PTR(8),           /* EOD TRACK NUMBER                00159900
*                                       (MDC308)             @X04AA9A*/ 00160000
*        6 DEBBOETT PTR(8),          /* BOE TRACK NUMBER                00160100
*                                       (MDC324)             @X04AA9A*/ 00160200
*       5 DEBEOD0  PTR(8),           /* MUST BE ZERO                    00160300
*                                       (MDC309)             @X04AA9A*/ 00160400
*        6 DEBBOE0  PTR(8),          /* MUST BE ZERO                    00160500
*                                       (MDC325)             @X04AA9A*/ 00160600
*       5 DEBEODSS PTR(8),           /* EOD SECTOR NUMBER               00160700
*                                       (MDC310)             @X04AA9A*/ 00160800
*        6 DEBBOESS PTR(8);          /* BOE SECTOR NUMBER               00160900
*                                       (MDC326)             @X04AA9A*/ 00161000
*                                                                       00161100
*                                                                       00161200
* /* *************************************************************** */ 00161300
* /*             DEB ISAM DEPENDENT SECTION                          */ 00161400
* /*                                                                 */ 00161500
* /*     NOTE  PRESENT ONLY IF ISAM IS USED.  FOLLOWS THE BASIC      */ 00161600
* /*           SECTION AND PRECEDES THE DIRECT ACCESS STORAGE        */ 00161700
* /*           DEVICE SECTION.  COUNTED AS ONE EXTENT IN DEBNMEXT.   */ 00161800
* /* *************************************************************** */ 00161900
*                                                                       00162000
*  DECLARE 1 DEBBAS01                                                   00162100
*%IF IKEPLS='2'  %THEN                                                  00162200
*    %GOTO DEBA1;                                                       00162300
*       BASED(ADDR(DEBBASND)) BDY(WORD),                                00162400
*%GOTO DEBA2;                                                           00162500
*%DEBA1 : ;                                                             00162600
*       DEF(DEBBASND) BDY(WORD),                                        00162700
*%DEBA2 : ;                                                             00162800
*    2 DEBISAM BDY(WORD),                                               00162900
*     3 DEBFIEAD PTR(31),            /* ADDRESS OF FIRST INDEX          00163000
*                                       EXTENT                       */ 00163100
*       4 DEBNIEE  CHAR(1),          /* NUMBER OF EXTENTS OF            00163200
*                                       INDEPENDENT INDEX AREA       */ 00163300
*       4 DEBFIEB  PTR(24),          /* *** SAME AS DEBFIEAD ABOVE   */ 00163400
*     3 DEBFPEAD PTR(31),            /* ADDRESS OF THE FIRST PRIME      00163500
*                                       DATA EXTENT                  */ 00163600
*      4 DEBNPEE  CHAR(1),           /* NUMBER OF EXTENTS OF PRIME      00163700
*                                       DATA AREA (M=0 EXTENT)       */ 00163800
*      4 DEBFPEB  PTR(24),           /* *** SAME AS DEBFPEAD ABOVE   */ 00163900
*     3 DEBFOEAD PTR(31),            /* ADDRESS OF THE FIRST            00164000
*                                       OVERFLOW EXTENT              */ 00164100
*      4 DEBNOEE  CHAR(1),           /* NUMBER OF EXTENTS OF            00164200
*                                       INDEPENDENT OVERFLOW AREA    */ 00164300
*      4 DEBFOEB  PTR(24),           /* *** SAME AS DEBFOEAD ABOVE   */ 00164400
*     3 DEBEXPT  PTR(31),            /* ADDRESS OF ISAM DEB             00164500
*                                       EXTENSION              ICB379*/ 00164600
*      4 DEBRPSID BIT(8),            /* ROTATIONAL POSITION SENSING     00164700
*                                       (RPS) DEVICE INDICATORS      */ 00164800
*       5 DEBRPSP  BIT(1),           /* PRIME DATA AREA IS ON RPS       00164900
*                                       DEVICE                       */ 00165000
*       5 DEBRPSI  BIT(1),           /* INDEPENDENT INDEX AREA IS ON    00165100
*                                       RPS DEVICE                   */ 00165200
*       5 DEBRPSO  BIT(1),           /* INDEPENDENT OVERFLOW AREA IS    00165300
*                                       ON RPS DEVICE                */ 00165400
*       5 DEBRPSAP BIT(1),           /* RPS SIO APPENDAGE HAS BEEN      00165500
*                                       LOADED                       */ 00165600
*       5 DEBRSV09 BIT(1),           /* RESERVED                     */ 00165700
*       5 DEBRSV10 BIT(1),           /* RESERVED                     */ 00165800
*       5 DEBRSV11 BIT(1),           /* RESERVED                     */ 00165900
*       5 DEBRSV12 BIT(1),           /* RESERVED                     */ 00166000
*      4 DEBEXPTA PTR(24);           /* SAME AS DEBEXPT ABOVE  ICB379*/ 00166100
*                                                                       00166200
* /* *************************************************************** */ 00166300
* /*          DIRECT ACCESS STORAGE DEVICE SECTION                   */ 00166400
* /*                                                                 */ 00166500
* /*     NOTE  IF ISAM IS BEING USED, THIS SECTION FOLLOWS THE       */ 00166600
* /*           ISAM DEVICE DEPENDENT SECTION.  OTHERWISE, IT         */ 00166700
* /*           FOLLOWS THE BASIC SECTION.                            */ 00166800
* /*                                                                 */ 00166900
* /*           THERE IS ONE OF THESE SECTIONS FOR EACH EXTENT.       */ 00167000
* /* *************************************************************** */ 00167100
*                                                                       00167200
* DECLARE                                                               00167300
*   1 DEBDASD BASED(DEBDAPTR) BDY(WORD),                                00167400
*     3 DEBUCBAD PTR(31),       /* Address of UCB associated with this  00167500
*                                  data extent.  Valid for 24-bit pgms  00167600
*                                  if DEB31UCB is off or for any        00167700
*                                  program if DEB31UCB is on.    @MXA*/ 00167800
*      /* Next two fields valid only if DEB31UCB is off.         @MXA*/ 00167900
*      4 DEBDVMOD CHAR(1),           /* DEVICE MODIFIER - FILE MASK  */ 00168000
*      4 DEBUCBA  PTR(24),           /* UCB addr (DEB31UCB=off)  @MXC*/ 00168100
*     3 DEBBINUM CHAR(2),       /* Bin number (Obsolete use)     @MXC*/ 00168200
*       4 DEBDVMOD31 CHAR(1),   /* Device modifier - file mask. Valid   00168300
*                                  only if DEB31UCB is on        @MXA*/ 00168400
*       4 DEBNMTRKHI CHAR(1),        /* HIGH ORDER BYTE OF TRACK        00168500
*                                       COUNT. LOW ORDER TWO BYTES IN   00168600
*                                       DEBNMTRK                 @LVA*/ 00168700
* /*******************************************************************/ 00168800
* /*     For a non-EAV volume, the following is of the format   @L11A*/ 00168900
* /*     cccchhhh. For an EAV volume the format is CCCCccch.    @L11A*/ 00169000
* /*******************************************************************/ 00169100
*     3 DEBSTRCC CHAR(2),            /* CYLINDER ADDRESS FOR THE START  00169200
*                                       OF AN EXTENT.            @LRC*/ 00169300
*     3 DEBSTRHH CHAR(2),            /* TRACK ADDRESS FOR THE START OF  00169400
*                                       AN EXTENT.               @MXC*/ 00169500
*     3 DEBENDCC CHAR(2),            /* CYLINDER ADDRESS FOR THE END    00169600
*                                       OF AN EXTENT. FOR A PDSE THIS   00169700
*                                       FIELD IS RESERVED.  FOR AN      00169800
*                                       EXTENDED FORMAT DATA SET THIS   00169900
*                                       FIELD CONTAINS THE CYLINDER     00170000
*                                       NUMBER OF THE FORMAT-1 DSCB     00170100
*                                       ADDRESS.                     */ 00170200
*     3 DEBENDHH CHAR(2),            /* TRACK ADDRESS FOR THE END OF    00170300
*                                       AN EXTENT. FOR A PDSE THIS      00170400
*                                       FIELD IS RESERVED.  FOR AN      00170500
*                                       EXTENDED FORMAT DATA SET THIS   00170600
*                                       FIELD CONTAINS THE TRACK        00170700
*                                       NUMBER OF THE FORMAT-1 DSCB     00170800
*                                       ADDRESS.                     */ 00170900
*     3 DEBNMTRK CHAR(2);            /* LOW ORDER TWO BYTES OF NUMBER   00171000
*                                       OF TRACKS ALLOCATED TO CURRENT  00171100
*                                       EXTENT. HIGH ORDER BYTE OF      00171200
*                                       COUNT IN DEBNMTRKHI.     @LVC*/ 00171300
*                                                                       00171400
*                                                                       00171500
* /* *************************************************************** */ 00171600
* /*     EXCP ACCESS METHOD, BSAM AND QSAM DEPENDENT SECTION         */ 00171700
* /* *************************************************************** */ 00171800
*                                                                       00171900
* DECLARE                                                               00172000
*    1 DEBACSMD BASED(DEBEXPTR) BDY(WORD),                              00172100
*     3 DEBVOLSQ CHAR(2),            /* VOLUME SEQUENCE NUMBER FOR      00172200
*                                       MULTIVOLUME SEQUENTIAL DATA     00172300
*                                       SETS                         */ 00172400
*      4 DEBVOLBT BIT(8),            /* FIRST BYTE OF DEBVOLSQ          00172500
*                                       (MDC016)              YA00318*/ 00172600
*       5 DEBEXFUL BIT(1),           /* SET BY EOV WHEN REWRITING AN    00172700
*                                       OLD DIRECT ACCESS DATA SET TO   00172800
*                                       INDICATE THAT ALL PREVIOUS      00172900
*                                       EXISTING EXTENTS HAVE BEEN      00173000
*                                       FILLED (MDC017)       YA00318*/ 00173100
*       5 DEBRSV36 BIT(1),           /* RESERVED               MDC018*/ 00173200
*       5 DEBRSV37 BIT(1),           /* RESERVED               MDC018*/ 00173300
*       5 DEBRSV38 BIT(1),           /* RESERVED               MDC018*/ 00173400
*       5 DEBRSV39 BIT(1),           /* RESERVED               MDC018*/ 00173500
*       5 DEBRSV40 BIT(1),           /* RESERVED               MDC018*/ 00173600
*       5 DEBRSV41 BIT(1),           /* RESERVED               MDC018*/ 00173700
*       5 DEBRSV42 BIT(1),           /* RESERVED               MDC018*/ 00173800
*      4 DEBVLSEQ PTR(8),            /* FOR DIRECT ACCESS, SEQUENCE     00173900
*                                       NUMBER OF THE VOLUME OF THE     00174000
*                                       DATA SET RELATIVE TO THE        00174100
*                                       FIRST VOLUME OF THE DATA SET.   00174200
*                                       FOR TAPE, SEQUENCE NUMBER OF    00174300
*                                       THE VOLUME OF THE DATA SET      00174400
*                                       RELATIVE TO THE FIRST VOLUME    00174500
*                                       PROCESSED.  (MDC019)  YA00318*/ 00174600
*     3 DEBVOLNM CHAR(2),            /* TOTAL NUMBER OF VOLUMES IN A    00174700
*                                       MULTIVOLUME SEQUENTIAL DATA     00174800
*                                       SET.                         */ 00174900
*     3 DEBDSNM CHAR(8) BDY(WORD),   /* MEMBER NAME.  THIS FIELD        00175000
*                                       APPEARS ONLY WHEN AN OUTPUT     00175100
*                                       DATA SET HAS BEEN OPENED FOR    00175200
*                                       A MEMBER NAME AND THE DSCB      00175300
*                                       SPECIFIES A PARTITIONED         00175400
*                                       DATA SET.                    */ 00175500
*       5 DEBUTSAA PTR(31),          /* ADDRESS OF THE USER TOTALING    00175600
*                                       SAVE AREA                    */ 00175700
*        6 DEBRSV13 CHAR(1),         /* RESERVED                     */ 00175800
*        6 DEBUTSAB PTR(24),         /* *** SAME AS DEBUTSAA ABOVE   */ 00175900
*       5 DEBRSV14 CHAR(4) BDY(WORD),/* RESERVED (IF USER TOTALING      00176000
*                                       WAS SPECIFIED)               */ 00176100
*     3 DEBBLKSI FIXED(15),          /* MAXIMUM BLOCK SIZE              00176200
*                                       (MDC346)             @ZA03699*/ 00176300
*     3 DEBLRECL FIXED(15);          /* LOGICAL RECORD LENGTH           00176400
*                                       (MDC347)             @ZA03699*/ 00176500
*                                                                       00176600
*                                                                       00176700
* /* *************************************************************** */ 00176800
* /*               BPAM DEPENDENT SECTION                            */ 00176900
* /* *************************************************************** */ 00177000
*                                                                       00177100
*                                                                       00177200
* DECLARE 1 DEBACS01                                                    00177300
*       BASED(DEBEXPTR) BDY(WORD),                                      00177400
*     3 DEBDSNAM CHAR(8) BDY(WORD),  /* FOR A PARTITIONED DATA SET      00177500
*                                       OPENED FOR OUTPUT FOR A         00177600
*                                       MEMBER NAME, THIS FIELD IS      00177700
*                                       THE MEMBER NAME.             */ 00177800
*      4 DEBEXTNM CHAR(1);           /* FOR A PARTITIONED DATA SET      00177900
*                                       OPENED FOR INPUT, EACH ONE-     00178000
*                                       BYTE FIELD CONTAINS THE         00178100
*                                       EXTENT NUMBER OF THE FIRST      00178200
*                                       EXTENT ENTRY FOR EACH DATA      00178300
*                                       SET EXCEPT THE FIRST, IF TWO    00178400
*                                       OR MORE DATA SETS ARE           00178500
*                                       CONCATENATED. THE NUMBER OF     00178600
*                                       BYTES IN THE FIELD IS EQUAL     00178700
*                                       TO ONE LESS THAN THE NUMBER     00178800
*                                       OF DATA SETS CONCATENATED.   */ 00178900
*                                                                       00179000
* /* *************************************************************** */ 00179100
* /*               BDAM DEPENDENT SECTION                            */ 00179200
* /* *************************************************************** */ 00179300
*                                                                       00179400
* DECLARE 1 DEBACS02                                                    00179500
*       BASED(DEBEXPTR) BDY(WORD),                                      00179600
*                                                                       00179700
* /*                      *****************************************  */ 00179800
* /*                      * FOR FIXED LENGTH RECORDS WITH THE     *  */ 00179900
* /*                      * OPTION OF RELATIVE BLOCK ADDRESSING   *  */ 00180000
* /*                      * (BUT NOT TRACK OVERFLOW)              *  */ 00180100
* /*                      *****************************************  */ 00180200
*                                                                       00180300
*     3 DEBDBLK  FIXED(31),          /* ONE FOUR-BYTE FIELD FOR EACH    00180400
*                                       EXTENT DESCRIBED IN THE         00180500
*                                       DEVICE DEPENDENT SECTION.    */ 00180600
*      4 DEBDBPT  PTR(8),            /* NUMBER OF BLOCKS PER TRACK   */ 00180700
*      4 DEBDBPE  CHAR(3);           /* NUMBER OF BLOCKS PER EXTENT  */ 00180800
*                                                                       00180900
*                                                                       00181000
* DECLARE 1 DEBACS03                                                    00181100
*       BASED(DEBEXPTR) BDY(WORD),                                      00181200
*                                                                       00181300
* /*                      *****************************************  */ 00181400
* /*                      * FOR FIXED LENGTH RECORDS WITH THE     *  */ 00181500
* /*                      * OPTION OF RELATIVE BLOCK ADDRESSING   *  */ 00181600
* /*                      * AND TRACK OVERFLOW.                   *  */ 00181700
* /*                      *****************************************  */ 00181800
*                                                                       00181900
*     3 DEBDTPP FIXED(31),           /* NUMBER OF TRACKS PER PERIOD  */ 00182000
*     3 DEBDBPP FIXED(31),           /* NUMBER OF BLOCKS PER PERIOD  */ 00182100
* /*                      THE FOLLOWING FIELD OCCURS ONCE FOR        */ 00182200
* /*                      EACH EXTENT.                               */ 00182300
*     3 DEBDBPEF FIXED(31);          /* NUMBER OF BLOCKS PER EXTENT  */ 00182400
*                                                                       00182500
*                                                                       00182600
* /* *************************************************************** */ 00182700
* /*              BTAM DEPENDENT SECTION                             */ 00182800
* /*                                                                 */ 00182900
* /*     NOTE  THIS SEGMENT IS ALWAYS PRESENT FOR BTAM.  IT IS       */ 00183000
* /*           USED WHEN A BUFFER POOL OR DYNAMIC BUFFERING IS       */ 00183100
* /*           USED.  OTHERWISE, THE FIELDS ARE ZERO.                */ 00183200
* /* *************************************************************** */ 00183300
*                                                                       00183400
*                                                                       00183500
* DECLARE 1 DEBACS04                                                    00183600
*       BASED(DEBEXPTR) BDY(WORD),                                      00183700
*     3 DEBTBFRA PTR(31),            /* ADDRESS OF THE BUFFER ROUTINE*/ 00183800
*      4 DEBRSV15 CHAR(1),           /* RESERVED                     */ 00183900
*      4 DEBTBFRB PTR(24),           /* ADDRESS OF THE BUFFER ROUTINE*/ 00184000
* /*                      THE FOLLOWING FIELD IS REPEATED FOR EACH   */ 00184100
* /*                      CCW ON THE CHANNEL PROGRAM QUEUE           */ 00184200
*     3 DEBTCCWA PTR(31),            /* ADDRESS OF THE FIRST (OR        00184300
*                                       FOLLOWING) CCW ON THE QUEUE  */ 00184400
*      4 DEBRSV16 CHAR(1),           /* RESERVED                     */ 00184500
*      4 DEBTCCWB PTR(24);           /* *** SAME AS DEBCCWA ABOVE    */ 00184600
*                                                                       00184700
*                                                                       00184800
* /* *************************************************************** */ 00184900
* /*                GAM DEPENDENT SECTION                            */ 00185000
* /* *************************************************************** */ 00185100
*                                                                       00185200
*                                                                       00185300
* DECLARE 1 DEBACS05                                                    00185400
*       BASED(DEBEXPTR) BDY(WORD),                                      00185500
*     3 DEBFUCBA PTR(31),            /* ADDRESS OF FIRST UCB         */ 00185600
*      4 DEBRSV17 CHAR(1),           /* RESERVED                     */ 00185700
*      4 DEBFUCBB PTR(24),           /* ADDRESS OF FIRST UCB         */ 00185800
*     3 DEBLUCBA PTR(31),            /* ADDRESS OF LAST UCB          */ 00185900
*      4 DEBRSV18 CHAR(1),           /* RESERVED                     */ 00186000
*      4 DEBLUCBB PTR(24);           /* ADDRESS OF LAST UCB          */ 00186100
*                                                                       00186200
*                                                                       00186300
* /* *************************************************************** */ 00186400
* /*              ISAM LOAD MODE EXTENSION                           */ 00186500
* /* *************************************************************** */ 00186600
* DECLARE 1 DEBACS06                                                    00186700
*       BASED(DEBEXPTA) BDY(WORD),   /*                          @L3C*/ 00186800
*    2 DEBDCBFA PTR(31),             /* ADDRESS OF DCB FIELD AREA       00186900
*                                                              MDC013*/ 00187000
*    2 DEBPUT   PTR(31);             /* ADDRESS OF PUT MODULE  ICB379*/ 00187100
*                                                                       00187200
* /* *************************************************************** */ 00187300
* /*              ISAM SCAN MODE EXTENSION                           */ 00187400
* /* *************************************************************** */ 00187500
* DECLARE 1 DEBACS07                                                    00187600
*       BASED(DEBEXPTA) BDY(WORD),   /*                          @L3C*/ 00187700
*    2 *        PTR(31),             /* DEBDCBFA - ADDRESS OF DCB       00187800
*                                       FIELD AREA             MDC014*/ 00187900
*    2 DEBGET   PTR(31),             /* ADDRESS OF GET OR PUT MODULE    00188000
*                                       - THIS FIELD IS ALSO CALLED     00188100
*                                       DEBPUT                 ICB379*/ 00188200
*    2 DEBWKPT4 PTR(31),             /* SAME AS DCBWKPT4 - ADDRESS OF   00188300
*                                       UCB                    ICB379*/ 00188400
*    2 DEBWKPT5 PTR(31),             /* SAME AS DCBWKPT5 - ADDRESS OF   00188500
*                                       GET APPENDAGE MODULE   ICB379*/ 00188600
*    2 DEBCREAD PTR(31),             /* ADDRESS OF CHANNEL-END          00188700
*                                       APPENDAGE FOR READ     ICB379*/ 00188800
*    2 DEBCSETL PTR(31),             /* ADDRESS OF CHANNEL-END          00188900
*                                       APPENDAGE FOR SETL     ICB379*/ 00189000
*    2 DEBCWRIT PTR(31),             /* ADDRESS OF CHANNEL-END          00189100
*                                       APPENDAGE FOR WRITE    ICB379*/ 00189200
*    2 DEBCCHK  PTR(31),             /* ADDRESS OF CHANNEL-END          00189300
*                                       APPENDAGE FOR WRITE VALIDITY    00189400
*                                       CHECK                  ICB379*/ 00189500
*    2 DEBCREWT PTR(31),             /* ADDRESS OF CHANNEL-END          00189600
*                                       APPENDAGE FOR RE-WRITE ICB379*/ 00189700
*    2 DEBCRECK PTR(31),             /* ADDRESS OF CHANNEL-END          00189800
*                                       APPENDAGE FOR RE-CHECK ICB379*/ 00189900
*    2 DEBAREAD PTR(31),             /* ADDRESS OF ABNORMAL-END         00190000
*                                       APPENDAGE FOR READ     ICB379*/ 00190100
*    2 DEBASETL PTR(31),             /* ADDRESS OF ABNORMAL-END         00190200
*                                       APPENDAGE FOR SETL     ICB379*/ 00190300
*    2 DEBAWRIT PTR(31),             /* ADDRESS OF ABNORMAL-END         00190400
*                                       APPENDAGE FOR WRITE    ICB379*/ 00190500
*    2 DEBACHK  PTR(31),             /* ADDRESS OF ABNORMAL-END         00190600
*                                       APPENDAGE FOR WRITE VALIDITY    00190700
*                                       CHECK                  ICB379*/ 00190800
*    2 DEBAREWT PTR(31),             /* ADDRESS OF ABNORMAL-END         00190900
*                                       APPENDAGE FOR RE-WRITE ICB379*/ 00191000
*    2 DEBARECK PTR(31),             /* ADDRESS OF ABNORMAL-END         00191100
*                                       APPENDAGE FOR RE-CHECK ICB379*/ 00191200
*    2 DEBRPSST PTR(31);             /* ADDRESS OF RPS SIO APPENDAGE    00191300
*                                       IF ADDRSPC=REAL WAS NOT         00191400
*                                       SPECIFIED              ICB379*/ 00191500
*                                                                       00191600
* /* *************************************************************** */ 00191700
* /*              BISAM MODE EXTENSION                               */ 00191800
* /* *************************************************************** */ 00191900
* DECLARE 1 DEBACS08                                                    00192000
*       BASED(DEBEXPTA) BDY(WORD),   /*                          @L3C*/ 00192100
*    2 *        PTR(31),             /* DEBDCBFA - ADDRESS OF DCB       00192200
*                                       FIELD AREA             MDC015*/ 00192300
*    2 DEBDISAD PTR(31),             /* ADDRESS OF PRIVILEGED MODULE    00192400
*                                       ENTERED WHEN A BISAM MACRO      00192500
*                                       INSTRUCTION IS EXECUTED         00192600
*                                                              ICB379*/ 00192700
*    2 *        PTR(31),             /* DEBWKPT4 - SAME AS DCBWKPT4 -   00192800
*                                       ADDRESS OF THE PART 1           00192900
*                                       APPENDAGE MODULE (ABNORMAL      00193000
*                                       AND CHANNEL-END APPANDAGES)     00193100
*                                                              ICB379*/ 00193200
*    2 *        PTR(31),             /* DEBWKPT5 - SAME AS DCBWKPT5 -   00193300
*                                       ADDRESS OF THE PART 2           00193400
*                                       APPENDAGE MODULE (ABNORMAL      00193500
*                                       AND CHANNEL-END APPANDAGES)     00193600
*                                                              ICB379*/ 00193700
*    2 DEBFREED PTR(31),             /* ADDRESS OF DYNAMIC BUFFERING    00193800
*                                       MODULE                 ICB379*/ 00193900
*    2 DEBRPSIO PTR(31),             /* ADDRESS OF RPS SIO APPENDAGE    00194000
*                                       MODULE IF ADDRSPC=REAL WAS      00194100
*                                       NOT SPECIFIED AND IF DYNAMIC    00194200
*                                       BUFFERING IS USED      ICB379*/ 00194300
*    2 DEBSIOA2 PTR(31);             /* ADDRESS OF DYNAMIC BUFFERING    00194400
*                                       APPENDAGE MODULE DISPLACED BY   00194500
*                                       PAGE FIX (PGFX) APPENDAGE IF    00194600
*                                       ADDRSPC=REAL WAS NOT            00194700
*                                       SPECIFIED              ICB379*/ 00194800
* /* *************************************************************** */ 00194900
* /*              SUBROUTINE NAME SECTION                            */ 00195000
* /*                                                                 */ 00195100
* /*     NOTE  FOLLOWS THE ACCESS METHOD DEPENDENT SECTION, OR THE   */ 00195200
* /*           DEVICE DEPENDENT SECTION IF THERE IS NO ACCESS        */ 00195300
* /*           METHOD SECTION.                                       */ 00195400
* /* *************************************************************** */ 00195500
* DECLARE                                                               00195600
* 1 DEBSUBNM BASED(DEBSBPTR) BDY(WORD),                                 00195700
*      4 DEBSUBID CHAR(2);           /* SUBORUTINE IDENTIFICATION.      00195800
*                                       EACH ACCESS METHOD SUBROUTINE,  00195900
*                                       APPENDAGE SUBROUTINE, AND IRB   00196000
*                                       ROUTINE WILL HAVE A UNIQUE      00196100
*                                       EIGHT-BYTE NAME.  THE LOW-      00196200
*                                       ORDER TWO BYTES OF EACH         00196300
*                                       ROUTINE NAME WILL BE IN THIS    00196400
*                                       FIELD IF THE SUBROUTINE IS      00196500
*                                       LOADED BY THE OPEN ROUTINES. */ 00196600
*                                                                       00196700
* /******************************************************************** 00196800
*       APPENDAGE VECTOR TABLE SECTION OF THE DEB.  Pointed to by  @MXC 00196900
*       DEBAPPAD.  Contiguous with DEB prefix if built by OPEN.    @MXA 00197000
**********************************************************************/ 00197100
*                                                                       00197200
* DECLARE                                                               00197300
*   1 DEB BASED(DEBAPPB) BDY(WORD),  /* DEBAVT BASED DEBAPPAD+1  @L1C*/ 00197400
*    2 DEBAVT BDY(WORD),             /* APPENDAGE VECTOR TABLE       */ 00197500
*     3 DEBEOEA  PTR(31),            /* ADDRESS OF END-OF-EXTENT        00197600
*                                       APPENDAGE ROUTINE            */ 00197700
*      4 DEBEOEAB CHAR(1),           /* FLAG BYTE              ICB280*/ 00197800
*       5 DEBTCAMQ BIT(4),           /* TCAM WORK AREA       @ZA34098*/ 00197900
*       5 DEBEOENP BIT(4),           /* NUMBER OF 2K PAGES TO BE        00198000
*                                       FIXED FOR THE END-OF-EXTENT     00198100
*                                       APPENDAGE              ICB280*/ 00198200
*      4 DEBEOEAD PTR(24),           /* ADDRESS OF END-OF-EXTENT        00198300
*                                       APPENDAGE ROUTINE      ICB280*/ 00198400
*     3 DEBSIOA  PTR(31),            /* ADDRESS OF START I/O            00198500
*                                       APPENDAGE ROUTINE            */ 00198600
*      4 DEBSIOAB CHAR(1),           /* FLAG BYTE              ICB280*/ 00198700
*       5 DEBPGFX  BIT(1),           /* ADDRESS IN DEBSIOAD CAN BE      00198800
*                                       USED TO DETERMINE THE ENTRY     00198900
*                                       POINT TO THE PAGE FIX (PGFX)    00199000
*                                       APPENDAGE ROUTINE BY ADDING     00199100
*                                       4 TO ADDRESS IN DEBSIOAD        00199200
*                                                              ICB280*/ 00199300
*       5 DEBSIOX  BIT(1),           /* IF ZERO, DO NOT ENTER SIO       00199400
*                                       APPENDAGE WHEN ERP IS ACTIVE.   00199500
*                                       IF ONE, ENTER SIO APPENDAGE     00199600
*                                       EVEN WHEN ERP IS ACTIVE.        00199700
*                                                              ICB372*/ 00199800
*       5 DEBIOVR  BIT(1),           /* IF ONE, EXCPVR REQUEST IS       00199900
*                                       VALID.  IF ZERO, EXCPVR         00200000
*                                       REQUEST IS INVALID AND WILL     00200100
*                                       NOT BE EXECUTED. CURRENTLY HAS  00200200
*                                       NO EFFECT.             ICB401*/ 00200300
*       5 DEBFIX   BIT(1),           /* INDICATION THAT DEB HAS BEEN    00200400
*                                       FIXED (OS/VS2)  (MDC032)        00200500
*                                                              YM5929*/ 00200600
*       5 DEBSIONP BIT(4),           /* NUMBER OF 2K PAGES TO BE        00200700
*                                       FIXED FOR THE SIO               00200800
*                                       APPENDAGE              ICB280*/ 00200900
*      4 DEBSIOAD PTR(24),           /* ADDRESS OF START I/O            00201000
*                                       APPENDAGE ROUTINE      ICB280*/ 00201100
*     3 DEBPCIA  PTR(31),            /* ADDRESS OF PCI APPENDAGE        00201200
*                                       ROUTINE                      */ 00201300
*      4 DEBPCIAB CHAR(1),           /* FLAG BYTE              ICB280*/ 00201400
*       5 DEBRSV24 BIT(1),           /* RESERVED                     */ 00201500
*       5 DEBRSV25 BIT(1),           /* RESERVED                     */ 00201600
*       5 DEBRSV26 BIT(1),           /* RESERVED                     */ 00201700
*       5 DEBRSV27 BIT(1),           /* RESERVED                     */ 00201800
*       5 DEBPCINP BIT(4),           /* NUMBER OF 2K PAGES TO BE        00201900
*                                       FIXED FOR THE PCI APPENDAGE     00202000
*                                       ROUTINE                ICB280*/ 00202100
*      4 DEBPCIAD PTR(24),           /* ADDRESS OF PROGRAM-             00202200
*                                       CONTROLLED-INTERRUPTION (PCI)   00202300
*                                       APPENDAGE ROUTINE      ICB280*/ 00202400
*     3 DEBCEA   PTR(31),            /* ADDRESS OF CHANNEL-END          00202500
*                                       APPENDAGE ROUTINE            */ 00202600
*      4 DEBCEAB  CHAR(1),           /* FLAG BYTE              ICB280*/ 00202700
*       5 DEBESMVR BIT(1),           /* EXCPVR VALIDITY CHK  @ZA34098*/ 00202800
*       5 DEBRSV29 BIT(1),           /* RESERVED                     */ 00202900
*       5 DEBRSV30 BIT(1),           /* RESERVED                     */ 00203000
*       5 DEBRSV31 BIT(1),           /* RESERVED                     */ 00203100
*       5 DEBCENP  BIT(4),           /* NUMBER OF 2K PAGES TO BE        00203200
*                                       FIXED FOR THE CHANNEL-END       00203300
*                                       APPENDAGE              ICB280*/ 00203400
*      4 DEBCEAD  PTR(24),           /* ADDRESS OF CHANNEL END          00203500
*                                       APPENDAGE ROUTINE      ICB280*/ 00203600
*     3 DEBXCEA  PTR(31),            /* ADDRESS OF ABNORMAL-END         00203700
*                                       APPENDAGE ROUTINE            */ 00203800
*      4 DEBXCEAB CHAR(1),           /* FLAG BYTE              ICB280*/ 00203900
*       5 DEBRSV32 BIT(1),           /* RESERVED                     */ 00204000
*       5 DEBRSV33 BIT(1),           /* RESERVED                     */ 00204100
*       5 DEBRSV34 BIT(1),           /* RESERVED                     */ 00204200
*       5 DEBRSV35 BIT(1),           /* RESERVED                     */ 00204300
*       5 DEBXCENP BIT(4),           /* NUMBER OF 2K PAGES TO BE        00204400
*                                       FIXED FOR THE ABNORMAL-END      00204500
*                                       APPENDAGE              ICB280*/ 00204600
*      4 DEBXCEAD PTR(24)            /* ADDRESS OF ABNORMAL-END         00204700
*                                       APPENDAGE ROUTINE      ICB280*/ 00204800
*                                                                       00204900
* /* *************************************************************** */ 00205000
* /*                 DEB PREFIX TABLE                                */ 00205100
* /* *************************************************************** */ 00205200
* %IF  DEBPRES^='YES' %THEN %GOTO DEBL5;                                00205300
*       ;                                                               00205400
* DCL 1 DEBPREFX BDY(WORD) BASED(DEBPTR-(LENGTH(DEBPREFX))),            00205500
*                                    /* DEB PREFIX TABLE             */ 00205600
*                                    /*   (DIRECT ACCESS)            */ 00205700
* %GOTO DEBL6;                                                          00205800
* %DEBL5:;                                                              00205900
* %IF  RLSPRES^='YES' %THEN %GOTO DEBL7;  /*                     @PAA*/ 00206000
*      ;                             /*                          @PAA*/ 00206100
* DCL 1 DEBPREFX BDY(WORD) BASED(ACBDEB-(LENGTH(DEBPREFX)))             00206200
*       VIA(VRMC_HOME_ALET),         /* DEB PREFIX IS IN HOME ADDRESS   00206300
*                                       SPACE (ACCESSIBLE IN CROSS      00206400
*                                       MEMORY MODE)             @PAA*/ 00206500
* %GOTO DEBL6;                       /*                          @PAA*/ 00206600
* %DEBL7:;                           /*                          @PAA*/ 00206700
*      ,                                                                00206800
*    2 DEBPREFX BDY(WORD),           /* DEB PREFIX TABLE             */ 00206900
*                                    /*   (DIRECT ACCESS)            */ 00207000
* %DEBL6:;                                                              00207100
*     3 DEBWKARA CHAR(1) BDY(WORD),  /* O/C/E WORK AREA                 00207200
*                                       (DIRECT ACCESS)              */ 00207300
*     3 DEBDSCBA CHAR(7) BDY(WORD,2),/* DSCB ADDRESS (BBCCHHR) USED     00207400
*                                       BY O/C/EOV (DIRECT ACCESS)   */ 00207500
*     3 DEBXTNP  PTR(31),            /* POINTER TO DEB EXTENSION        00207600
*                                       (OS/VS2)               MDC008*/ 00207700
*      4 DEBDCBMK CHAR(4) BDY(WORD), /* DCB MODIFICATION MASK USED BY   00207800
*                                       O/C/EOV- OBSOLETE      MDC009*/ 00207900
*     3 DEBLNGTH FIXED(8),      /* LENGTH OF DEB IN DOUBLE WORDS.  If   00208000
*                                  >2040 bytes (X'FF' doublewords),     00208100
                                   the excess bits are ignored.  @MXA*/ 00208200
*     3 DEBAMTYP FIXED(8),           /* ACCESS METHOD TYPE       @L2C*/ 00208300
*     3 DEBTBLOF FIXED(16);     /*Identifier in DEB table for this      00208400
*                                 entry for this DEB             @MXC*/ 00208500
*                                                                       00208600
* /**************************************************************@L2A*/ 00208700
* /*   EQUATES FOR DEBAMTYP FIELD                                @L2A*/ 00208800
* /**************************************************************@L2A*/ 00208900
*                                                                       00209000
* DCL DEBAMNON FIXED(8) CONSTANT(0), /* ACCESS METHOD TYPE              00209100
*                                       UNKNOWN                  @L2A*/ 00209200
*    DEBAMVSM FIXED(8) CONSTANT(1),  /* VSAM ACCESS METHOD TYPE  @L2A*/ 00209300
*    DEBAMXCP FIXED(8) CONSTANT(2),  /* EXCP ACCESS METHOD TYPE  @L2A*/ 00209400
*    DEBAMTCM FIXED(8) CONSTANT(4),  /* TCAM ACCESS METHOD TYPE  @L2A*/ 00209500
*    DEBAMGAM FIXED(8) CONSTANT(8),  /* GRAPHICS ACC METHOD TYPE @L2A*/ 00209600
*    DEBAMTAM FIXED(8) CONSTANT(16),  /* BTAM ACCESS METHOD TYPE @L2A*/ 00209700
*    DEBAMBPM FIXED(8) CONSTANT(32),  /* BPAM ACCESS METHOD TYPE @L2A*/ 00209800
*    DEBAMSAM FIXED(8) CONSTANT(32),  /* SAM ACCESS METHOD TYPE  @L2A*/ 00209900
*    DEBAMBDM FIXED(8) CONSTANT(64),  /* DIRECT ACC METHOD TYPE  @L2A*/ 00210000
*    DEBAMISM FIXED(8) CONSTANT(128),  /*ISAM ACCESS METHOD TYPE @L2A*/ 00210100
*    DEBAMSUB FIXED(8) CONSTANT(129),  /* SUBSYSTEM ACCESS              00210200
*                                         METHOD TYPE            @L2A*/ 00210300
*    DEBAMVTM FIXED(8) CONSTANT(130),  /*VTAM ACCESS METHOD TYPE @L2A*/ 00210400
*    DEBAMTAP FIXED(8) CONSTANT(132);  /* TCAM APPLICATION PROGRAM      00210500
*                                         ACCESS METHOD TYPE     @L2A*/ 00210600
*                                                                       00210700
*                                                                       00210800
* /* *************************************************************** */ 00210900
* /*                 DEB EXTENSION (BELOW 31 MB LINE)                */ 00211000
* /* *************************************************************** */ 00211100
*                                                                       00211200
*%IF DEBDXAD^='YES' %THEN                                               00211300
*    %GOTO DEBL8;                                                       00211400
* DECLARE                                                               00211500
*   1 DEBXTN   BASED(DXDEBXAD) BDY(WORD),                               00211600
*%GOTO DEBL9;                                                           00211700
*%DEBL8 : ;                                                             00211800
* DECLARE                                                               00211900
*   1 DEBXTN   BASED(DEBXTNP)  BDY(WORD),                               00212000
*%DEBL9 : ;                                                             00212100
*    2 DEBXLNGH FIXED(15),           /* LENGTH OF DEB EXTENSION         00212200
*                                                              MDC002*/ 00212300
*    2 DEBXFLG1 BIT(8),              /* FLAG BYTE  (MDC027)    YM1272*/ 00212400
*     3 DEBXCDCB BIT(1),             /* DEBDCBAD FIELD CONTAINS THE     00212500
*                                       ADDRESS OF A COPIED DCB.        00212600
*                                       USED BY END-OF-VOLUME, TCLOSE   00212700
*                                       AND TASK CLOSE.  (MDC028)       00212800
*                                                              YM1272*/ 00212900
*     3 DEBXTSKC BIT(1),             /* TASK CLOSE IS CLOSING THE       00213000
*                                       RELATED DCB.  SET BY TASK       00213100
*                                       CLOSE AND INTERROGATED BY       00213200
*                                       END-OF-VOLUME, FEOV AND         00213300
*                                       TCLOSE FOR DEB'S NOT ON THE     00213400
*                                       CURRENT TCB DEB CHAIN.          00213500
*                                       (MDC031)               YM2869*/ 00213600
*     3 DEBXDSSI BIT(1),             /* DATA SET SECURITY INDICATOR.    00213700
*                                       SET BY OPEN AND CHECKPOINT.     00213800
*                                       INTERROGATED BY EOV.            00213900
*                                       (MDC348)             @Z40RP9A*/ 00214000
*     3 DEBXWIND BIT(1),             /* MSS WINDOW PROCESSING INDIC.    00214100
*                                       SET BY OPEN.  INTERROGATED      00214200
*                                       BY EOV, SAM EOB AND CLOSE.      00214300
*                                                            @ZA37313*/ 00214400
*     3 DEBXACIS BIT(1),             /* ACQUIRE ISSUED WITH INHIBIT     00214500
*                                       STAGE INDICATED DURING OPEN OR  00214600
*                                       EOV.  SET BY OPEN AND EOV.      00214700
*                                       INTERROGATED BY SVC 126.        00214800
*                                                            @ZA37313*/ 00214900
*     3 DEBXNFLS BIT(1),             /* DO NOT FLUSH QSAM BUFFERS IN    00215000
*                                       CLOSE BECAUSE AN OPEN/CLOSE/EOV 00215100
*                                      ABEND OCCURRED. SET BY IFG0RR0B. 00215200
*                                       TESTED BY IGG0201Z.      @01A*/ 00215300
*                                    /*                          @L1D*/ 00215400
*     3 DEBXSYSB BIT(1),             /* SYSTEM DETERMINED BLKSIZE@L8C*/ 00215500
*     3 DEBXRACE BIT(1),             /* RACF EXECUTE ONLY AUTHORITY OF  00215600
*                                       A PROGRAM LIBRARY. SET BY OPEN  00215700
*                                       AND INTERROGATED BY OPEN AFTER  00215800
*                                       FINAL DCB MERGE AND BY A SAM    00215900
*                                       EXECUTOR.                @L9A*/ 00216000
*    2 DEBXFLG2 BIT(8),              /* FLAGBYTE                 @06C*/ 00216100
*     3 DEBXRSAP BIT(1),             /* USED BY RESTART TO INDICATE     00216200
*                                       THAT RESTART HAS INCREASED THE  00216300
*                                       LENGTH OF THE DEB EXTENSION TO  00216400
*                                       INCLUDE A CHKPT/RST APPENDAGE   00216500
*                                       TO THE DEB EXTENSION. THE       00216600
*                                       APPENDAGE IS FREEMAINED AND     00216700
*                                       THIS BIT IS TURNED OFF BEFORE   00216800
*                                       RESTART PROCESSING IS COMPLETED 00216900
*                                       DEBXLNTH INCLUDES THE LENGTH OF 00217000
*                                       THE APPENDAGE WHILE THIS BIT    00217100
*                                       IS ON.                   @06A*/ 00217200
*     3 DEBBYP   BIT(1),             /* WHEN ON EXCP SCAN ROUTINE WILL  00217300
*                                       SET IOSBYP ON AND BYPASS        00217400
*                                       BUILDING A PREFIX        @LBA*/ 00217500
*     3 DEBCHCMP BIT(1),             /* WHEN ON EXCP SCAN ROUTINE WILL  00217600
*                                       SET IOSCHCMP ON AND BYPASS      00217700
*                                       BUILDING A PREFIX        @LBA*/ 00217800
*     3 DEBXENQA BIT(1),             /* PDS ENQ,DISP=SHR,OUTPUT  @LCC*/ 00217900
*     3 DEBXENQS BIT(1),             /* DSCB ENQ,DISP=SHR        @LCC*/ 00218000
*     3 DEBXIMSC BIT(1),             /* IMS CLOSE IN PROGRESS    @09C*/ 00218100
*     3 DEBXCASV BIT(1),             /* CACHE ATTR TOKEN VALID   @10A*/ 00218200
*     3 DEBXMVLF BIT(1),             /* TAPE MULTIVOL 1ST VOL RD @LGC*/ 00218300
*    2 DEBXDSAB PTR(31),             /* POINTER TO DSAB        MDC004*/ 00218400
*    2 DEBXDCBM CHAR(4) BDY(WORD),   /* DCB MODIFICATION MASK USED BY   00218500
*                                       I/O SUPPORT            MDC005*/ 00218600
*    2 DEBXDBPR PTR(31),             /* POINTER TO DEB         MDC006*/ 00218700
*    2 DEBXDSO1 BIT(8),              /* SAME AS DCBDSORG BYTE 1         00218800
*                                                              MDC020*/ 00218900
*    2 DEBXDSO2 BIT(8),              /* SAME AS DCBDSORG BYTE 2         00219000
*                                                              MDC021*/ 00219100
*    2 DEBXMCF1 BIT(8),              /* SAME AS DCBMACRF BYTE 1         00219200
*                                                              MDC022*/ 00219300
*    2 DEBXMCF2 BIT(8),              /* SAME AS DCBMACRF BYTE 2         00219400
*                                                              MDC023*/ 00219500
*    2 DEBXXARG PTR(31),             /* ADDRESS OF BDAM READ            00219600
*                                       EXCLUSIVE LIST         MDC024*/ 00219700
*    2 DEBXOPNJ PTR(31),             /* POINTER TO DSAB (SEPARATE       00219800
*                                       FROM DEBXDSAB) DYNAMICALLY      00219900
*                                       ALLOCATED BY OPEN TYPE=J.       00220000
*                                       THIS POINTER WILL EXIST FOR     00220100
*                                       NON-AUTHORIZED CALLERS OF       00220200
*                                       OPEN TYPE=J FOR A DIRECT        00220300
*                                       ACCESS DATA SET WHERE THE       00220400
*                                       DATA SET BEING OPENED IS        00220500
*                                       DIFFERENT FROM THE DATA SET     00220600
*                                       DESCRIBED BY THE DDNAME IN      00220700
*                                       DCB AND THE JFCNWRIT BIT IS     00220800
*                                       ON IN THE JFCB.  THE POINTER    00220900
*                                       WILL BE USED BY CLOSE TO        00221000
*                                       DYNAMICALLY UNALLOCATE THE      00221100
*                                       DATA SET.  (MDC352)  @ZA02193*/ 00221200
*    2 DEBXSAMB PTR(31),             /* ADDRESS OF SAM BLOCK (SAMB)     00221300
*                                       (MDC351)             @Z40FP9A*/ 00221400
*    2 DEBXOPET CHAR(8),             /* DATASET OPEN TIME SET BY OPEN   00221500
*                                       INITIALIZATION       @ZA39299*/ 00221600
* /************************************************************* @P3A*/ 00221700
* /* THE FOLLOWING MAPPING REPRESENTS THE FIRST 8 BYTES OF       @P3A*/ 00221800
* /* DEFINE EXTENT DATA WHICH IS PASSED, VIA THE DEFINE          @P3A*/ 00221900
* /* EXTENT CCW, TO A DASD STORAGE SUBSYSTEM WHICH SUPPORTS      @P3A*/ 00222000
* /* THE ECKD DEFINE EXTENT CCW.                                 @P3A*/ 00222100
* /*                                                             @P3A*/ 00222200
* /* THIS INFORMATION WILL BE COPIED FROM THE DEB EXTENSION TO   @P3A*/ 00222300
* /* THE SYSTEM BUILT DEFINE EXTENT DATA AREA, AND WILL BE SENT  @P3A*/ 00222400
* /* TO THE STORAGE SUBSYSTEM WITH EACH I/O REQUEST RELATED TO   @P3A*/ 00222500
* /* THIS DEB.                                                   @P3A*/ 00222600
* /*                                                             @P3A*/ 00222700
* /* REFER TO THE APPROPRIATE STORAGE CONTROL REFERENCE          @P3A*/ 00222800
* /* PUBLICATION FOR A DETAILED DESCRIPTION OF THESE FIELDS.     @P3A*/ 00222900
* /*                                                             @P3A*/ 00223000
* /************************************************************  @P3A*/ 00223100
*    2 DEBXDEF CHAR(8) BDY(WORD),    /* DEFINE EXTENT DATA AREA  @H2A*/ 00223200
*      3 DEBDEFG1 BIT(8),            /* FLAG BYTE                @H2A*/ 00223300
*        4 DEBNSHED BIT(1),          /* NO SEEK HEAD PERMITTED   @H2A*/ 00223400
*        4 DEBXVDEF BIT(1),          /* DEB DEF EXT DATA VALID -        00223500
*                                       MUST BE ON FOR DX DATA          00223600
*                                       TO BE USED               @P3C*/ 00223700
*      3 DEBGATTR BIT(8),            /* GLOBAL ATTRIBUTES        @H2A*/ 00223800
*        4 DEBECKD BIT(2),           /* DEFINE EXTENT DEFINITION @H2A*/ 00223900
*        4 DEBSTRTP BIT(1),          /* CKD CONVERSION MODE      @P3C*/ 00224000
*        4 DEBGA345 BIT(3),          /* ATTRIBUTE BITS 3,4,5     @H2A*/ 00224100
*        4 DEBNRD   BIT(1),          /* NON RETENTIVE DATA ACCESS@08A*/ 00224200
*        4 DEBINHFW BIT(1),          /* INHIBIT FAST WRITE       @08A*/ 00224300
*      3 DEBBLKSZ FIXED(16) BDY(WORD,3), /* BLOCKSIZE IN BYTES   @01M*/ 00224400
*      3 DEBEXTOK CHAR(4),           /* ZERO,EXTENT LOCATOR,TOKEN@H2A*/ 00224500
*        4 DEBNRDID CHAR(2),         /* NON RETENTIVE DATA ID    @08A*/ 00224600
*        4 *        CHAR(1),         /* RESERVED - MUST BE ZERO  @P3C*/ 00224700
*        4 DEBGATTX CHAR(1),         /* GLOBAL ATTRIB EXTENDED 2 @P3A*/ 00224800
*          5 DEBGAX12 BIT(2),        /* SPECIAL DX MODES         @P3A*/ 00224900
*          5 *        BIT(3),        /* RESERVED FOR SYTEM USE   @P3A*/ 00225000
*          5 DEBDFTR0 BIT(1),        /* CU MAY CLEAR R0 DATA     @P3A*/ 00225100
*          5 *        BIT(1),        /* RESERVED FOR SYSTEM USE  @P3A*/ 00225200
*          5 *        BIT(1),        /* RESERVED                 @P3A*/ 00225300
*    2 DEBIOPID  CHAR(4),         /* I/O PREVENTION  IDENTIFIER @L5A*/  00225400
*    2 DEBBLKID  CHAR(4),         /* BLOCK ID VALUE USED TO     @L6A    00225500
*                                    CALCULATE NUMBER OF BLOCKS         00225600
*                                    IN THIS VOLUME FOR EXTENDED        00225700
*                                    BLOCK COUNT CHECKING       @L6A*/  00225800
*    2 DEBXCASF  CHAR(4),         /* CACHE ATTRIBUTE                    00225900
*                                    SELECTION TOKEN            @LAA*/  00226000
*    2 DEBXFLG3 BIT(8),           /* FLAG BYTE                  @LDA*/  00226100
*      3 DEBXTRNC BIT(1),         /*  QSAM TRUNC MACRO HAS BEEN         00226200
*                                     ISSUED FOR A PDSE - IT WAS        00226300
*                                     IGNORED.                  @P3C*/  00226400
*      3 DEBXNSEG BIT(1),         /*  NULL SEGMENT ENCOUNTERED IN A     00226500
*                                     PDSE                      @P3C*/  00226600
*      3 DEBXSMSG BIT(1),         /*  SMS GUAR SP DISP NEW/MOD  @11A*/  00226700
*      3 DEBXDUDA BIT(1),         /*  IEC708I ISSUED FOR DASD   @LOC*/  00226800
*      3 DEBXCAP  BIT(1),         /*  UCB ADD IN DEB CAP BY OCE @LFA*/  00226900
*      3 DEBXVTOC BIT(1),         /*  NOT AUTHORIZED - READ VTOC@LSA*/  00227000
*      3 DEBXENQE BIT(1),         /*  ENQ'D ON PS,DISP=SHARE,O/P@LTA*/  00227100
*      3 DEBXUCNT BIT(1),         /*  DECREMENT EDI USE CNT     @P7C*/  00227200
*    2 DEBXAMBF BIT(8),           /* DEFINES THE USE OF DEBXAMB @LEA*/  00227300
*      3 DEBXABSS BIT(1),         /*  DEBXAMB DEFINES A SSCB PTR...     00227400
*                                     DEBXSSCB IS VALID         @LEA*/  00227500
*      3 DEBXARBA BIT(1),         /* DEBXAMB DEFINES AN RBA VALUE..     00227600
*                                    DEBXRBA IS VALID AND IS THE        00227700
*                                    RBA OF THE CI CONTAINING THE NVR   00227800
*                                    FOR A COMPRESSED FORMAT DATA SET.  00227900
*                                    IT IS ONLY VALID UNTIL THE         00228000
*                                    OPEN EXECUTORS STORE SSCB PTR IN   00228100
*                                    DEBXSSCB.                  @15A*/  00228200
*      3 DEBXAOEF BIT(1),         /* DEBXAMB DEFINES AN IGGSXCB PTR ... 00228300
*                                       PTR FOR HFS/REMOTE FILE @P5C*/  00228400
*      3 DEBXAIB  BIT(1),         /* DEBXAMB DEFINES AN INTERMEDIATE    00228500
*                                    BUFFER USED FOR READ PREVIOUS      00228600
*                                    PROCESSING                 @LKA*/  00228700
*      3 DEBXAENCCB BIT(1),       /* DEBXAMB DEFINES ENCCB PTR @L19A*/  00228800
*      3 *        BIT(3),         /*  RESERVED                 @L19C*/  00228900
*    2 DEBXSCNT FIXED(15),        /* NUMBER OF STRIPES FOR A STRIPED    00229000
*                                     DATASET                   @P3C*/  00229100
*    2 DEBXSACB PTR(31),          /* POINTER TO SACB CNTRL BLK  @LDA*/  00229200
*    2 DEBXAFLG BIT(8),           /* "ATTRIBUTE EXTENSION" FLGS @P3C*/  00229300
*      3 DEBXADS BIT(1),          /* "ATTRIBUTE EXTENSION" DATA         00229400
*                                    SET                        @12A*/  00229500
*      3 DEBXAINP BIT(1),         /* INPUT PROCESSING PERFORMED FOR     00229600
*                                    "ATTRIBUTE EXTENSION" D/S  @12A*/  00229700
*      3 DEBXAOUT BIT(1),         /* OUTPUT PROCESSING PERFORMED FOR    00229800
*                                    "ATTRIBUTE EXTENSION" D/S  @12A*/  00229900
*      3 DEBXAOFO BIT(1),         /* "ATTRIBUTE EXTENSION" D/S OPENED   00230000
*                                    FOR OUTPUT PROCESSING      @12A*/  00230100
*      3 DEBXLGDS BIT(1),         /* LARGE SEQUENTIAL DATA SET          00230200
*                                    BEING PROCESSED BY EXCP,           00230300
*                                    READ POINT OR WRITE POINT  @LVA*/  00230400
*      3 DEBXDEBLOCKX BIT(1),     /* DEB HAS BEEN LOCKED      1@L18A*/  00230500
*        4 DEBXDEBLOCK  BIT(1),   /* EXCLUSIVELY BY DEBCHK    1@L18A*/  00230600
*      3 DEBXIMG  BIT(1),         /* THIS IS SYS1.IMAGELIB      @33A*/  00230700
*      3 DEBXEXP  BIT(1),         /* SET TO REQUEST SPECIAL SETTING OF  00230800
*                                    IOSEXP                     @24A*/  00230900
*    2 *        CHAR(1),          /* RESERVED                   @LGA*/  00231000
*    2 DEBXVLSQ BIT(16),          /* EXPECTED TAPE VOL SEQ      @LGA*/  00231100
*    2 DEBXDSSB PTR(31),          /* POINTER TO DSSB            @JBC*/  00231200
*    2 DEBXAMB  PTR(31),          /* ACCESS METHOD BLOCK...THE USE OF   00231300
*                                    THIS POINTER IS DEFINED BY THE     00231400
*                                    FIELD DEBXAMBF.            @LEA*/  00231500
*      3 DEBXSSCB PTR(31),        /* ADDRESS OF STRIPED SAM CONTROL     00231600
*                                    BLOCK (SSCB)               @LEA*/  00231700
*        4 DEBXRBA PTR(31),       /* RBA OF VVDS CI OF NVR      @15A*/  00231800
*                                 /*                            @P5D*/  00231900
*          5 DEBXRDBK PTR(31),    /* ADDRESS OF INTERMEDIATE BUFFER     00232000
*                                    FOR READ BACK PROCESSING   @LKA*/  00232100
*            7 DEBXENCCB PTR(31), /* ADDRESS OF ENCRYPTION              00232200
*                                     CONTROL BLOCK (ENCCB)    @L19A*/  00232300
*    2 DEBXDEBX PTR(31),          /* POINTER TO 2ND DEB EXT.    @13A*/  00232400
*    2 DEBXEND CHAR(0);           /* END OF DEB EXTENSION       @H2A*/  00232500
* /* *************************************************************** */ 00232600
* /*  CONSTANTS RELATED TO DEBECKD.                              @P3A*/ 00232700
* /* *************************************************************** */ 00232800
* DCL DEBFBLK  BIT(2) CONSTANT('00'B),/* DEFINE EXTENT OPERATES AS      00232900
*                                        DEFINED FOR FIXED BLOCK @H2A*/ 00233000
*     DEBCKDCX BIT(2) CONSTANT('11'B),/* DEFINE EXTENT OPERATES AS FOR  00233100
*                                        CKD EXTENSIONS-CCHH EXTENTS    00233200
*                                                                @L4C*/ 00233300
* /* *************************************************************** */ 00233400
* /*  CONSTANTS RELATED TO DEBGA345.                             @P3A*/ 00233500
* /* *************************************************************** */ 00233600
*     DEBNCACH BIT(3) CONSTANT('000'B),/* NORMAL CACHE ACCESS    @L4A*/ 00233700
*     DEBBCACH BIT(3) CONSTANT('001'B),/* BYPASS CACHE LOAD      @L4A*/ 00233800
*     DEBICACH BIT(3) CONSTANT('010'B),/* INHIBIT CACHE LOAD     @L4A*/ 00233900
*     DEBSCACH BIT(3) CONSTANT('011'B),/* SEQUENTIAL ACCESS      @P3C*/ 00234000
*     DEBXRFLG BIT(3) CONSTANT('100'B),/* SEQUENTL PRESTAGE MODEE@P3A*/ 00234100
*     DEBRLC   BIT(3) CONSTANT('101'B),/* RECORD ACCESS MODE     @P3A*/ 00234200
* /* *************************************************************** */ 00234300
* /*  CONSTANTS RELATED TO DEBGAX12.                             @P3A*/ 00234400
* /* *************************************************************** */ 00234500
*     DEBRMODE BIT(2) CONSTANT('00'B), /* NO SPECIAL MODE        @P3A*/ 00234600
*     DEBRDATA BIT(2) CONSTANT('01'B), /* REGULAR DATA FORMAT    @P3A*/ 00234700
*     DEBSKEY  BIT(2) CONSTANT('10'B); /* SPECIAL KEY SEARCH MODE@P3A*/ 00234800
*                                                                       00234900
* /* *************************************************************** */ 00235000
* /*                 SECOND DEB EXTENSION (ABOVE 31 MB LINE)         */ 00235100
* /* *************************************************************** */ 00235200
*                                                                       00235300
* DECLARE                                                               00235400
*   1 DEB2XTN  BASED(DEBXDEBX)  BDY(DWORD), /*                   @27A*/ 00235500
*     2 DEB2XTNN    CHAR(8),        /* 2ND DEB EXTN EYE CATCHER  @13A*/ 00235600
*     2 DEB2XLGH    FIXED(15),      /* LENGTH OF 2ND DEB EXT     @13A*/ 00235700
*     2 DEB2XRSG,                   /* RETRIEVED SG INFO         @13A*/ 00235800
*       3 DEB2XSGL  FIXED(15),      /* STORAGE GROUP NAME LENGTH @13A*/ 00235900
*       3 DEB2XSGN  CHAR(30),       /* STORAGE GROUP NAME        @13A*/ 00236000
*     2 DEB2XRMC,                   /* RETRIEVED MC INFO         @13A*/ 00236100
*       3 DEB2XMCL  FIXED(15),      /* MANAGEMENT CLASS NAME LEN @13A*/ 00236200
*       3 DEB2XMCN  CHAR(30),       /* MANAGEMENT CLASS NAME     @13A*/ 00236300
*     2 DEB2XRSC,                   /* RETRIEVED SC INFO         @13A*/ 00236400
*       3 DEB2XSCL  FIXED(15),      /* STORAGE CLASS LENGTH      @13A*/ 00236500
*       3 DEB2XSCN  CHAR(30),       /* STORAGE CLASS NAME        @13A*/ 00236600
*     2 DEB2XRDC,                   /* RETRIEVED DC INFO         @13A*/ 00236700
*       3 DEB2XDCL  FIXED(15),      /* DATA CLASS LENGTH         @13A*/ 00236800
*       3 DEB2XDCN  CHAR(30),       /* DATA CLASS NAME           @13A*/ 00236900
*     2 DEB2XFG1 BIT(8),            /* FIRST FLAG BYTE           @16A*/ 00237000
*       3 DEB2XOSM  BIT(1),         /* JFCMEDIA SET BY OPEN      @16A*/ 00237100
*       3 DEB2XNLM  BIT(1),         /* NL TP DS OPENED FOR MOD   @LLA*/ 00237200
*       3 DEB2XTCO  BIT(1),         /* TCLOSE TAPE OUTPUT        @LLA*/ 00237300
*       3 DEB2XIBC  BIT(1),         /* INACCURATE BLOCK COUNT    @LLA*/ 00237400
*       3 DEB2XNL1  BIT(1),         /* NL TAPE FILE SEQ 1        @LLA*/ 00237500
*       3 DEB2XVLL  BIT(1),         /* DEB2X CONTAINS DS VOLIST  @LQA*/ 00237600
*       3 DEB2XABC  BIT(1),         /* ACCURATE TOTAL BLOCKCOUNT @LQA*/ 00237700
*       3 DEB2XECU  BIT(1),         /* 3490EM EXT CAP WRITTEN TO @LQC*/ 00237800
*     2 DEB2XUOF FIXED(8),          /* TIOT DD OFFSET OF UNIT    @17C*/ 00237900
*     2 DEB2XLSQ BIT(16),           /* TAPE VOL SEQ FROM LABEL   @LGC*/ 00238000
*     2 DEB2XALV CHAR(1),           /* AL VERSION DURING OUTPUT  @LJA*/ 00238100
*     2 DEB2XFG2 BIT(8),            /* SECOND FLAG BYTE          @LQC*/ 00238200
*       3 DEB2X32M  BIT(1),         /* OCE ISSUED 32BIT MODESET  @LQA*/ 00238300
*       3 DEB2XBTM  BIT(1),         /* BUFFERED TM REQUESTED     @LQA*/ 00238400
*       3 DEB2XUSS  BIT(1),         /* USS DIRECTORY OPENED USING       00238500
*                                       BPAM OR PART OF BPAM            00238600
*                                       CONCATENATION            @LNA*/ 00238700
*       3 DEB2XEXV  BIT(1),         /* DEB2XMXV EXCEEDED         @20A*/ 00238800
*       3 DEB2XSCA  BIT(1),         /* TP MEDIA SCALED OPT PERF  @LUA*/ 00238900
*       3 DEB2BTMS  BIT(1),         /* SYS DEFAULTED BUFFER TM'S @LUA*/ 00239000
*       3 DEB2XEMV  BIT(1),         /* EXTEND MULTIVOL TAPE      @21A*/ 00239100
*       3 DEB2X8WN  BIT(1),         /* RACF RC8 CHANGED TO RC0   @LWA*/ 00239200
*     2 DEB2XTIM PTR(31),           /* TIME STAMP POINTER        @18A*/ 00239300
*     2 DEB2XEXC FIXED(8),          /* DEB2XMXV EXCEED COUNT     @20A*/ 00239400
*     2 DEB2XEDI BIT(8),            /* EDI SMF FLAGS             @LTA*/ 00239500
*       3 DEB2XEXT BIT(1),          /* DSN FOUND EXCLUDE TBL     @LTA*/ 00239600
*       3 DEB2XOPO BIT(1),          /* O/P & ALREADY OPEN O/P    @LTA*/ 00239700
*       3 DEB2XINO BIT(1),          /* I/P & ALREADY OPEN O/P    @LTA*/ 00239800
*       3 DEB2XEPS BIT(1),          /* DCBE/SCT/DSAB EXCLUDED    @LTA*/ 00239900
*       3 *        BIT(4),          /* RESERVED                  @LTA*/ 00240000
*     2 DEB2XFG3 BIT(8),            /* THIRD FLAG BYTE           @22C*/ 00240100
*       3 DEB2XSCS  BIT(1),         /* SYSZEDI SCOPE SYSTEMS(S)  @22A*/ 00240200
*       3 DEB2XPSC  BIT(1),         /* PERFORMANCE SEGMENTED     @LXA*/ 00240300
*       3 DEB2XEF1  BIT(1),         /* 3592-E05 WRITE EFMT1 RECTK@LXA*/ 00240400
*       3 DEB2XUPF  BIT(1),         /* USER BSAM PGFIX IN USE    @LZA*/ 00240500
*       3 DEB2XEXCP BIT(1),         /* EAV BAM DETECTED ONE OR MORE     00240600
*                                      EXCP OR XDAP ISSUANCES   @L10A*/ 00240700
*       3 DEB2XMSDN BIT(1),         /* OPEN USED MULTSDN        @L14A*/ 00240800
*       3 DEB2XTRCE BIT(1),         /* DIAGNS=TRACE SPECIFIED   @L16A*/ 00240900
*       3 DEB2XSBS  BIT(1),         /* ST BLK 0 STORED DEBBLKID  @23C*/ 00241000
*     2 DEB2XCFG BIT(8),            /* ANSI V4 CCSID FLAGS       @LJA*/ 00241100
*       3 DEB2XIBM BIT(1),          /* IBM VERSION 4 CREATED TAPE@LJA*/ 00241200
*       3 DEB2XOUT BIT(1),          /* OPENED FOR OUTPUT NOT MOD @LJA*/ 00241300
*       3 DEB2XMOD BIT(1),          /* OPENED FOR OUTPUT DISP MOD@LJA*/ 00241400
*       3 DEB2XUDF BIT(1),          /* USER APPLICATION CCSID WAS       00241500
*                                      DEFAULTED                 @LJA*/ 00241600
*       3 DEB2XTDF BIT(1),          /* TAPE CCSID WAS DEFAULTED  @LJA*/ 00241700
*       3 DEB2XIGN BIT(1),          /* TAPE CCSID SPECIFIED BUT NO      00241800
*                                      CONVERSION DONE - CCSID WAS      00241900
*                                      IGNORED                   @LJA*/ 00242000
*     2 DEB2XUSR FIXED(32),         /* CCSID OF USER APPLICATION @LJA*/ 00242100
*     2 DEB2XTPE FIXED(32),         /* CCSID OF TAPE             @LJA*/ 00242200
*     2 DEB2XLBL FIXED(32),         /* CCSID IN EXISTING LABEL   @LJA*/ 00242300
*     2 DEB2XSDC PTR(31),           /* PTR TO SAM DATA CONVERSION       00242400
*                                       BLOCK                    @LJA*/ 00242500
*     2 DEB2XTBL FIXED(31),         /* ACCUMULATIVE BLKCNT ACROSS@LLA   00242600
*                                      VOLUMES                   @LLA*/ 00242700
*     2 DEB2XTCB FIXED(31),         /* DCB BLKCOUNT TCLOSE OUTPUT@LLA*/ 00242800
*     2 DEB2XSGT FIXED(8),          /* SG TYPE (GENERAL/SPECIFIC)@LMA*/ 00242900
*     2 DEB2XPAR FIXED(8),          /* START PART OF TAPE FILE   @LPA*/ 00243000
*     2 DEB2XFG4 BIT(8),            /* FOURTH FLAG BYTE          @LYA*/ 00243100
*       3 *         BIT(1),         /* RESERVED                  @LYA*/ 00243200
*       3 *         BIT(1),         /* RESERVED                  @LYA*/ 00243300
*       3 DEB2XEEF  BIT(1),         /* 3592-E05/E06 WRITE EEFMT2 @LZC*/ 00243400
*       3 DEB2XE1M  BIT(1),         /* KEKLS 1 METHOD HASH       @LYA*/ 00243500
*       3 DEB2XE1I  BIT(1),         /* KEKLS 1 INPUT HASH        @LYA*/ 00243600
*       3 DEB2XE2M  BIT(1),         /* KEKLS 2 METHOD HASH       @LYA*/ 00243700
*       3 DEB2XE2I  BIT(1),         /* KEKLS 2 INPUT HASH        @LYA*/ 00243800
*       3 DEB2XEE3  BIT(1),         /* 3592-E06 WRT EEFMT3 RECTEK@LZA*/ 00243900
*     2 DEB2XFG5    BIT(8),         /* FIFTH FLAG BYTE           @LZC*/ 00244000
*       3 DEB2XEF2   BIT(1),        /*3592-E06 WRITING IN EFMT2  @LZA*/ 00244100
*       3 DEB2XENC BIT(1),          /* TAPE CARTRIDGE ENCRYPTED  @LZA*/ 00244200
*       3 DEB2XMNW BIT(1),          /* OPEN ENTERED MOD TO NEW   @26A*/ 00244300
*       3 DEB2XDEQ BIT(1),          /* TP INPUT FREE=EOV HONORED @M4A*/ 00244400
*       3 DEB2XEF3 BIT(1),          /* 3592-E07 WRITING EFMT3    @M9A*/ 00244500
*       3 DEB2XEE4 BIT(1),          /* 3592-E07 WRITING EEFMT4   @M9A*/ 00244600
*       3 DEB2XEEG BIT(1),          /* 3592-E06/E07 WRTING EEFMT3@M9A*/ 00244700
*       3 DEB2XCDT   BIT(1),        /* FORCE EOV TO CHECK DEVTYP @28A*/ 00244800
*     2 DEB2XSBL FIXED(31),         /* START BLOCK AFTER         @21A   00244900
*                                      POSITIONING TAPE          @21A*/ 00245000
*     2 DEB2XSTV PTR(31),           /* ADDRESS 1ST VOLSER ENTRY  @LQA*/ 00245100
*     2 DEB2XNXV PTR(31),           /* PTR TO NEXT VOLSER ENTRY  @LQA*/ 00245200
*     2 DEB2XVLN FIXED(32),         /* VOL NUMBER IN DS VOL LIST @LQA*/ 00245300
*     2 DEB2XMXV FIXED(32),         /* MAX NUMBER OF VOL ENTRIES @LQA*/ 00245400
*     2 DEB2XDID CHAR(8),           /* TIMESTAMP ID FOR DEB      @LYA*/ 00245500
*     2 DEB2XLK1 FIXED(8),          /* LENGTH KEYLBL1            @LYA*/ 00245600
*     2 DEB2XLK2 FIXED(8),          /* LENGTH KEYLBL2            @LYA*/ 00245700
*     2 DEB2XFG6 CHAR(1),           /* FLAG BYTE 6              @L13A*/ 00245800
*       3 DEB2XEEX       BIT(1),    /* EXCP BUT NO FOUND. EXT.   @29C*/ 00245900
*       3 DEB2XDSO       BIT(1),    /* DSORG NOT PS,PO OR DA     @29C*/ 00246000
*       3 DEB2XFRE       BIT(1),    /* STORAGE NOT ADDRESSABLE   @29A*/ 00246100
*       3 DEB2XKEY       BIT(1),    /* NOT IN CALLER KEY         @29C*/ 00246200
*       3 DEB2XEID       BIT(1),    /* DCBEID NOT 'DCBE'         @29C*/ 00246300
*       3 DEB2XMIN       BIT(1),    /* NOT MINIMUM REQUIRED LEN  @29C*/ 00246400
*       3 DEB2XNDE       BIT(1),    /* DCBHIARCHY ON BUT NO DCBE @29C*/ 00246500
*       3 DEB2XRBL       BIT(1),    /* TAPE READBACK LAST VOLUME @32A*/ 00246600
*     2 DEB2XFG7 CHAR(1),           /* FLAG BYTE 7               @PCC*/ 00246700
*       3 DEB2XVLC BIT(1),          /* IEC716I ISSUED            @PCA*/ 00246800
*       3 DEB2XPLR BIT(1),          /* TP INPUT PASS,LEAVE,RETAIN@MCA*/ 00246900
*       3 DEB2XFCC BIT(1),          /* FREE=CLOSE IN A CONCAT    @30A*/ 00247000
*       3 DEB2XLVL BIT(1),          /* DASD LAST VOL DETECTED    @31A*/ 00247100
*       3 DEB2XCMPTYPE BIT(4),      /* COMP ATTR BITS 4,5,6,7    @MDA*/ 00247200
*     2 DEB2XKET FIXED(32),         /* TP ENCRYPT KEY EXCH TIME  @25A*/ 00247300
*     2 DEB2XDXP PTR(31),           /* POINTER TO DEB EXTENSION @L12A*/ 00247400
*     2 DEB2XDSV    FIXED(8),       /* DATA SET TYPE (0-PS(NOT EF),     00247500
*                                       1 EF VER0 OR VER1,              00247600
*                                       2 EF TYPE2)              @29C*/ 00247700
*     2 DEB2XFG8 CHAR(1),           /* FLAG BYTE 7               @34A*/ 00247800
*       3 DEB2XDBYP       BIT(1),   /* DCBE_BYPASS_AUTH WAS SET  @34A*/ 00247900
*                                   /* ON                        @34A*/ 00248000
*       3 DEB2XJBYP       BIT(1),   /* JSCBPASS WAS SET ON       @34A*/ 00248100
*       3 DEB2XAUTH       BIT(1),   /* CALLER OF OPEN WAS        @34A*/ 00248200
*                                   /* AUTHORIZED TO SUPERVISOR  @34A*/ 00248300
*                                   /* STATE, SYSTEM KEY, OR APF @34A*/ 00248400
*       3 DEB2XBYP        BIT(1),   /* OPEN BYPASSED SAF/RACF    @34A*/ 00248500
*                                   /* CHECKS                    @34A*/ 00248600
*       3 DEB2XBPNOTPDS   BIT(1),   /* BPAM USED BUT DATA SET    @35A*/ 00248700
*                                   /* IS NOT PDS, PDSE, OR UNIX @35A*/ 00248800
*       3 DEB2XEXTDFAIL   BIT(1),   /* DADSM FAILED TO EXTEND TO @36A*/ 00248900
*                                   /* NEW VOL DUE TO ABEND X37 1@36A*/ 00249000
*       3 DEB2XDSENCRYPTOK BIT(1),  /* DCBE HAS DSENCRYPT=OK    @L20A*/         
*       3 *               BIT(1),   /* RESERVED                 @L20C*/ 00249100
*                                   /* DIRECTORY.                @35A*/ 00249200
*     2 *        CHAR(2),           /* RESERVED                  @35C*/ 00249300
*     2 DEB2XTBX CHAR(8),           /* TOTAL BLOCKS ACROSS VOLS  @29C*/ 00249400
* /* *************************************************************** */ 00249500
* /* THIS LAST SECTION IS OF VARIABLE LENGTH. ALL NEW FIELDS     @LQA*/ 00249600
* /* MUST BE ADDED BEFORE THIS LAST SECTION                      @LQA*/ 00249700
* /* *************************************************************** */ 00249800
*     2 DEB2XVEN CHAR(7),           /* VOLUME ENTRY (INCLUDES ,) @LQA*/ 00249900
*     2 DEB2XEND CHAR(0);           /*                           @13A*/ 00250000
* /* *************************************************************** */ 00250100
* /*  CONSTANTS RELATED TO DEB2XCMPTYPE                          @MDA*/ 00250200
* /* *************************************************************** */ 00250300
* DCL                                      /*                    @MDA*/ 00250400
*     DEB2XCMPNA BIT(4) CONSTANT('0000'B), /* NOT COMPRESSED     @MDA*/ 00250500
*     DEB2XCMPGEN BIT(4) CONSTANT('0001'B), /* GENERIC COMPRESS  @MDA*/ 00250600
*     DEB2XCMPTLRD BIT(4) CONSTANT('0010'B),/* TAILORED COMPRESS @MDA*/ 00250700
*     DEB2XCMPZEDC BIT(4) CONSTANT('0011'B);/* ZEDC COMPRESS     @MEA*/ 00250800
*%IF IKEPLS=''  %THEN                                                   00250900
*    %GOTO DEBL4;                                                       00251000
*IHALPOP;                                                               00251100
*%DEBL4 : ;                                                             00251200
