*        %GOTO MGCRE;         /* BILINGUAL MAPPING MACRO                00010000
         MACRO                                                          00020000
         IEZMGCRE &DSECT=YES  */                                        00030000
*%MGCRE:;                                                               00040000
*/***START OF SPECIFICATIONS******************************************/ 00050000
*/*                                                                  */ 00060000
*/*01* MACRO NAME:  IEZMGCRE                                     @L6C*/ 00070000
*/*                                                                  */ 00080000
*/*01* DESCRIPTIVE NAME:  MGCRE parameter list                   @L6C*/ 00090000
*/*01* ACRONYM: MGCRE                                            @L6C*/ 00100000
*/*01* EXTERNAL CLASSIFICATION: NOTPI                            @LAC*/ 00110000
*/*01*  END OF EXTERNAL CLASSIFICATION:                          @L6A*/ 00120000
*/*                                                              @P3A*/ 00130000
*/*01* DSECT NAME:  MGCEPL                                       @L6C*/ 00140000
*/*                                                              @P3A*/ 00150000
*/*01* COMPONENT:  MASTER SCHEDULER (SC1B8)                      @L6C*/ 00160000
*/*                                                              @P3A*/ 00170000
*/*                                                                  */ 00180000
*/*01* PROPRIETARY STATEMENT:                                    @L6C*/ 00190000
*/***PROPRIETARY_STATEMENT********************************************/ 00200000
*/*                                                                  */ 00210000
*/*                                                                  */ 00220000
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00230000
*/* 5650-ZOS COPYRIGHT IBM CORP. 1990, 2013                          */ 00240000
*/*                                                                  */ 00250000
*/* STATUS= HBB7790                                                  */ 00260000
*/*                                                                  */ 00270000
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 00280000
*/*01* EYE-CATCHER:  MGCRE                                       @L6C*/ 00290000
*/*02*   OFFSET:  4                                              @L6C*/ 00300000
*/*02*   LENGTH:  5                                              @L6C*/ 00310000
*/*                                                              @P3A*/ 00320000
*/*01* FUNCTION:       Serves as a parameter list for the MGCRE  @L6C*/ 00330000
*/*                    macro for SVC 34 command processing.      @L6C*/ 00340000
*/*                                                                  */ 00350000
*/*01* METHOD OF ACCESS:  BAL   - SPECIFY IEZMGCRE               @L6C*/ 00360000
*/*                            Dsects are produced unless DSECT=NO   */ 00370000
*/*                            is specified.                         */ 00380000
*/*                                                                  */ 00390000
*/*                    PL/AS - SPECIFY %INCLUDE SYSLIB(IEZMGCRE)     */ 00400000
*/*                                    DCL MGCREPTR PTR(31)      @P1C*/ 00410000
*/*                            NOTE: SVC 34 requires register 1 to   */ 00420000
*/*                                  point to the parameter list.    */ 00430000
*/*                                                                  */ 00440000
*/* DEPENDENCIES     = The flag field MGCELFL (all 16 bits) must @L1A*/ 00450000
*/*                    be exactly mapped by the XACMFLGA field   @L1A*/ 00460000
*/*                    in the XSA.                               @L1A*/ 00470000
*/*                                                                  */ 00480000
*/*                    The authority and disposition bytes       @L1A*/ 00490000
*/*                    (MGCEAUTH and MGCEDISP) must be exactly   @L1A*/ 00500000
*/*                    mapped by the corresponding fields in the @L1A*/ 00510000
*/*                    XSA (XAAUTH and XADISP).                  @L1A*/ 00520000
*/*                                                                  */ 00530000
*/* USAGE NOTES      = This macro provides a mapping of the MGCRE    */ 00540000
*/*                    parameter list. This macro serves as an       */ 00550000
*/*                    interface block for MGCRE command issuers     */ 00560000
*/*                    to issue SVC 34.                              */ 00570000
*/*                                                                  */ 00580000
*/*                    Adding NEW KEYWORDS:  Remember that IEE0003D  */ 00590000
*/*                    has to be hit to validate the parameter list, */ 00600000
*/*                    for those users who hand build the parameter  */ 00610000
*/*                    list. If an error is found at execution time  */ 00620000
*/*                    in IEE0003D, then the user is abended with    */ 00630000
*/*                    a D22 abend.                                  */ 00640000
*/*                                                                  */ 00650000
*/*01* STORAGE ATTRIBUTES:                                       @L6C*/ 00660000
*/*02*   SUBPOOL:  ANY                                           @L6C*/ 00670000
*/*02*   KEY:  ANY                                               @L6C*/ 00680000
*/*02*   RESIDENCY:  ANY                                         @L6C*/ 00690000
*/*                                                              @P3A*/ 00700000
*/*01* SIZE:  60 bytes for V1 MGCRE, 96 bytes for V2 MGCRE       @06C*/ 00710000
*/*    128 bytes for MGCETEXT plus storage for optional UTOKEN   @06C*/ 00720000
*/*    and/or PTOKEN fields                                      @06C*/ 00730000
*/*                                                              @P3A*/ 00740000
*/*01* CREATED BY:  Issuers of MGCRE macro                       @L6C*/ 00750000
*/*                                                                  */ 00760000
*/*01* POINTED TO BY:  Register 1 (Set up by the MGCRE macro)    @L6C*/ 00770000
*/*                                                                  */ 00780000
*/*01* SUBPOOL AND KEY: Any                                      @L6C*/ 00790000
*/*                                                                  */ 00800000
*/*01* SERIALIZATION: None                                       @L6C*/ 00810000
*/*                                                                  */ 00820000
*/* CHANGE-ACTIVITY:                                             @L6C*/ 00830000
*/* $MAC(IEZMGCRE),COMP(SC1B8): MGCRE parameter list                 */ 00840000
*/* $L0= CNMG2MG, HBB4410,870424,PDU9: Console Merge Stage II        */ 00850000
*/* $L1= OPSSI,   HBB4410,870831,PDBD: Command Authorization         */ 00860000
*/* $L2= TSOOP,   HBB4410,870916,PDDI: TSO Operator                  */ 00870000
*/* $L3= OPSSI,   HBB4410,871031,PDBD: Multisystem K Command         */ 00880000
*/* $P1= PEO0062, HBB4410,871124,PDCS: %DCL MGCREPTR PTR(31) -       */ 00890000
*/* $L4= OPSSI7CY,HBB4410,880420,PDCY: OPSSI                         */ 00900000
*/*                                    results in error              */ 00910000
*/*                     YA15958 - IEEXSA COMPATIBILITY       @YA15958*/ 00920000
*/* $D1= DCR100,  HBB4410,890130,PDEC: Deferred command execution    */ 00930000
*/*                                    during NIP                    */ 00940000
*/* $D2= DCR238  ,HBB4410,890814,PDEC: BARLOW SUPPORT BYPASS CMDAUTH */ 00950000
*/* $D3= DCR238  ,HBB4410,890814,PDEF: SP410 BARLOW SUPPORT          */ 00960000
*/* $P2= PKB3271 ,HBB4430,920729,PDNK: Change the comment for        */ 00970000
*/*                                    reserved  bits in MGCEDSP     */ 00980000
*/* $P3= PKB0806, HBB4430,920729,PDCM: Prolog cleanup                */ 00990000
*/* $L5= SYSOPFDQ,HBB5510,930304,PDDQ: ROUTE *ALL support            */ 01000000
*/* $L6= SYSOP16, HBB5510,930520,PD3J: SHOWHDR updates               */ 01010000
*/* $01= OY63671, HBB4420,930426,PDCI: Fix spelling of MGCELF1       */ 01020000
*/*                                    in assembler macro            */ 01030000
*/* $L7= CLONE7HD, HBB5520,940310,PDHD: Sysclone support             */ 01040000
*/* $02= OW10605, HBB4430,950215,PDED: Add compressed ACEE bit       */ 01050000
*/* $03= OW15497, HBB5510,960222,PDED: Originating console id        */ 01060000
*/* $04= OW21413, HBB5520,960815,PDCI: Add MGCENOBY                  */ 01070000
*/* $05= OW31545, HBB6601,980320,PDKP: Add MGCEOCSP                  */ 01080000
*/* $L8= CSTAR,   JBB7727,030215,PDKP: Add MGCETSO                   */ 01090000
*/* $L9= CNZ2A,   HBB7730,040702,PDSS: MC/Switch Elimination         */ 01100000
*/* $P4= ME05792, HBB7730,060215,PDF9: Un-CBGEN for compatability    */ 01110000
*/* $LA= CNZ2B,   HBB7750,061031,PDD0: Userid ENQ Support            */ 01120000
*/* $06= OA35671, HBB7760,110911,PDED: Add ENVRIN                    */ 01130000
*/* $07= OA39686, HBB7790,120629,PDTA: Do not copy JSCBQMPI for      */ 01131000
*/*                                    Master SWA below              */ 01132000
*/* $08= OA55640, HBB77C0,200110,PDHB: Fix management of MGCRE       */ 01133005
*/*                                    CMDFLAG=(NOHCPY).         @08A*/ 01134000
*/*                                                                  */ 01135000
*/**END OF SPECIFICATIONS*********************************************/ 01140000
*%GOTO MGCREPLS;   /*                                                   01150000
.********************************************************************** 01160000
.* A MGCEAUSP, MGCEFAST, MGCENPFX                                  @L1A 01170000
.* C MGCELF2                                                       @L1A 01180000
.* A MGCECART                                                      @L2A 01190000
.* C MGCECART, MGCERES3                                            @L3A 01200000
.* A MGCECTSP                                                      @L3A 01210000
.* A MGCERTD                                                       @L4A 01220000
.* A MGCEENBY - APAR REWORK COMPATIBILITY                      @YA15958 01230000
.* A MGCEDFER                                                      @D1A 01240000
.* C MGCEFAST - Indicate if the CMDAUTH has been done by another   @D2A 01250000
.*              system                                             @D2A 01260000
.* A MGCEUTP, MGCEUTKN  (UTOKEN support for MGCRE)                 @D3A 01270000
.* C Prolog cleanup                                                @P3A 01280000
.* A MGCERTDM  for ROUTE *ALL support                              @L5A 01290000
.* C Update prolog fields for SHOWHDR                              @L6A 01300000
.* C Fix spelling of MGCELF1 in assembler macro                    @01A 01310000
.* A Add bit MGCEDSPE for Sysclone support of ARM.                 @L7A 01320000
.* A MGCECOAC - Indicate presence of compressed ACEE               @02A 01330000
.* A MGCEOCID - Originating console id                             @03A 01340000
.* A MGCENOBY - Indicate that RACROUTE should not be bypassed for  @04A 01350000
.*              requeued commands                                  @04A 01360000
.* A MGCEOCSP - Indicate that originating console id was specified @05A 01370000
.* A MGCETSO  - Indicate that command came from TSO user           @L8A 01380000
.* C MGCEDSPM & MGCEDSPA - Change comments                         @L9A 01390000
.* C For HBB7730, this part was updated using the CBGEN tool.      @P4A 01400000
.*   The tool caused an incompatability in the assembler section,  @P4A 01410000
.*   resulting in our reverting to coding the assembler updates    @P4A 01420000
.*   by hand. For clarity, development flagging (L9) is used for   @P4A 01430000
.*   the assembler changes instead of defect flagging (P4).        @P4A 01440000
.* A Added MGCERunSynch, MGCEDoNoXsys, MGCEDoXsysGetFree.          @LAA 01450000
.* A Add a new version, MGCE35671.                                 @06A 01460000
.* A Add ENVRIN pointer.                                           @06A 01470000
.* C Change MGCESZE3 boundary from DWORD to WORD.  The MGCRE       @07A 01471000
.*   macro defines the parameter list on a WORD boundary.          @07A 01472000
.* A Added MGCEHPY2.  Initialized by IEE9003D and copied into a CSCB    01473001
.*   by IEE0803D for final use by IEECB820.                        @08A 01474001
.*                                                                      01479001
.********************************************************************** 01480000
          SPACE                                                         01490000
          AIF ('&DSECT' EQ 'NO').NODSECT                                01500000
MGCEPL    DSECT ,                  MGCRE Parameter list                 01510000
          AGO   .DSECT                                                  01520000
.NODSECT  ANOP                                                          01530000
          DS   0F                                                       01540000
MGCEPL    EQU  *                   MGCRE Parameter list                 01550000
.DSECT    ANOP                                                          01560000
          SPACE                                                         01570000
MGCEFL1   DS   CL1                 Flag field '00'                      01580000
MGCELGH   DS   XL1                 Flag byte-Control pgm use only  @05C 01590000
MGCERTDM  EQU  X'80'               Routed by ROUTE *ALL command    @L5A 01600000
MGCEOCSP  EQU  X'40'               Original console id specified   @05A 01610000
MGCERunSynch  EQU  X'20'           Run the command synchronously   @LAA 01620000
MGCEDoNoXsys  EQU X'10'            Do no xsysmcs calls             @LAA 01630000
MGCEDoXsysGetFree EQU X'08'        Do the xsysmcs get and free     @LAA 01640000
*********************************************************************** 01650000
*         The MGCELFL field must be exactly mapped by the          @L1A 01660000
*         XACMFLGA field in the XSA.                               @L1A 01670000
*********************************************************************** 01680000
MGCELFL   DS   0XL2                Flag field                           01690000
MGCRELF1  DS   0XL1                Misspelling of MGCELF1 - kept for   X01700000
                                   compatability                   @01C 01710000
MGCELF1   DS   XL1                 First byte of flag field        @01A 01720000
MGCEEXT   EQU  X'80'               Extended form (MGCRE) parameter     X01730000
                                   list is being used                   01740000
MGCESSI   EQU  X'40'               Subsystem issued the command         01750000
MGCECMD   EQU  X'20'               Module IEAVC700 issued the command   01760000
MGCEHPY   EQU  X'10'               Suppress hardcopy                    01770000
MGCETOK   EQU  X'08'               TOKEN keyword specified              01780000
MGCEIDSP  EQU  X'04'               CONSID keyword specified             01790000
MGCENMSP  EQU  X'02'               CONSNAME keyword specified           01800000
MGCEAUSP  EQU  X'01'               Command authority specified     @L1C 01810000
MGCELF2   DS   XL1                 Second byte of flag field       @L1C 01820000
MGCEFAST  EQU  X'80'               Bypass SSI, command exits and        01830000
*                                  CMDAUTH                         @D2C 01840000
MGCENPFX  EQU  X'40'               No prefix processing            @L1A 01850000
MGCECTSP  EQU  X'20'               CART keyword specified          @L3A 01860000
MGCEPASS  EQU  X'10'               Reserved for sp313 compatibility     01870000
MGCEUTOK  EQU  X'08'               Reserved for sp313 compatibility     01880000
MGCERTD   EQU  X'04'               Command was routed                   01890000
MGCEENBY  EQU  X'02'               Reserved for APAR rework             01900000
*                                  compatibility               @YA15958 01910000
MGCEDFER  EQU  X'01'               Deferred command execution      @D1A 01920000
MGCEACM   DS   CL5                 Control block acronym 'MGCRE'        01930000
MGCEVRSN  DS   AL1(MGCEVRID)       Version level                        01940000
MGCESP41  EQU  1                   Version level for HBB4410            01950000
MGCEROAL  EQU  2                   Version level with OW15497      @03A 01960000
MGCE35671 EQU  3                   Version level with OA35671      @06A 01970000
MGCEVRID  EQU  MGCE35671           Current version level           @06C 01980000
MGCELF3   DS   XL1                 Third byte of flag field        @02A 01990000
MGCECOAC  EQU  X'80'               Compressed ACEE is present      @02A 02000000
MGCENOBY  EQU  X'40'               Do not bypass RACROUTE for requeued X02010000
                                   commands                        @04A 02020000
MGCETSO   EQU  X'20'               Command issued by TSO user      @L8A 02030000
MGCEENVR  EQU  X'10'               ENVRIN specified                @06A 02040000
*         EQU  X'0E'               See XSA for availability.       @08C 02041002
MGCEHPY2  EQU  X'01'               Mimics MGCEHPY (CMDFLAG=NOHCPY)      02042002
*                                  and communicated thru command        02043004
*                                  processing to be used with a         02044002
*                                  'routed' command.               @08A 02044103
MGCERES1  DS   CL1                 See XSA for availability.       @02C 02060002
MGCETXTP  DS   A                   Address of the command text          02070000
MGCETOKN  DS   XL4                 Token                                02080000
MGCECNNM  DS   CL8                 Console name                         02090000
MGCECNID  DS   XL4                 Console id                           02100000
*********************************************************************** 02110000
*        The MGCEDISP field must be exactly mapped by the XADISP   @L1A 02120000
*        field in the XSA (IEEXSA).                                @L1A 02130000
*********************************************************************** 02140000
MGCEDISP  DS   B                   Command disposition             @L1A 02150000
MGCEDSPA  EQU  X'80'               Command has MASTER authority. It is X02160000
                                   suggested that MGCEDSPM be used     X02170000
                                   instead                         @L9C 02180000
MGCEDSPM  EQU  X'40'               Command has Master authority    @L9C 02190000
MGCEDSPE  EQU  X'08'               Command was issued by ARM       @L7A 02200000
*         EQU  X'37'               Reserved for IBM use            @L7C 02210000
*********************************************************************** 02220000
*        The MGCEAUTH field must be exactly mapped by the XAAUTH   @L1A 02230000
*        field in the XSA (IEEXSA).                                @L1A 02240000
*********************************************************************** 02250000
MGCEAUTH  DS   0BL2                Command authority level         @L1A 02260000
MGCEATHA  DS   B                   Byte one                        @L1A 02270000
MGCEATH1  EQU  X'80'               Command has SYS authority       @L1A 02280000
MGCEATH2  EQU  X'40'               Command has I/O authority       @L1A 02290000
MGCEATH3  EQU  X'20'               Command has CONS authority      @L1A 02300000
*         EQU  X'1F'               Reserved                        @L1A 02310000
MGCEATHB  DS   BL1                 Byte two, reserved              @L2C 02320000
MGCERES2  DS   XL1                 Reserved                        @L2A 02330000
MGCECART  DS   CL8                 CART                            @L3C 02340000
MGCESYSN  DS   CL8                 Originating system name         @L3A 02350000
MGCEUTP   DS   A                   Utoken address                  @D3A 02360000
MGCEOCID  DS   F                   Originating console id (use for     X02370000
                                   authority checking              @03A 02380000
MGCEPLEN  EQU  *                                                        02390000
MGCESZE1  EQU  MGCEPLEN-MGCEPL     Size of version 1 & 2 plist without X02400000
                                   command text                    @06C 02410000
MGCEENVP  DS   A                   ENVRIN address                  @06A 02420000
MGCERESZ  DS   CL32                Reserved                        @06A 02430000
MGCEPLN3  EQU  *                                                        02440000
MGCESZE3  EQU  MGCEPLN3-MGCEPL     Size of version 3 plist without     X02450000
                                   command text                    @06A 02460000
          SPACE                                                         02470000
MGCETEXT  DSECT ,                  Command text length field            02480000
          DS   0F                                                       02490000
          SPACE                                                         02500000
MGCELEN   DS   H                   Command text length                  02510000
MGCETXT   DS   CL126               Command text                         02520000
MGCETLEN  EQU  *                                                        02530000
MGCESZE2  EQU  MGCETLEN-MGCETEXT   Size of command text and the length X02540000
                                   of the command text                  02550000
                                                                        02560000
MGCEUTKN  DSECT ,                  Utoken                         @D3A  02570000
          DS   0F                                                 @D3A  02580000
          MEND ,                                                    */  02590000
*%MGCREPLS:;                                                            02600000
*  @SPACE;                                                              02610000
*/*******************************************************************/  02620000
*/*                                                                 */  02630000
*/*         MGCRE PARAMETER LIST                                    */  02640000
*/*                                                                 */  02650000
*/*******************************************************************/  02660000
*DECLARE                                                                02670000
*  1 MGCEPL BASED(MGCREPTR),    /* MGCRE parameter list              */ 02680000
*    2 MGCEFL1    FIXED(8),     /* Flag field '00'                   */ 02690000
*    2 MGCELGH    FIXED(8),     /* Flag byte-Control pgm use only@05C*/ 02700000
*      3 MGCERTDM   BIT(1),     /* Command is routed by ROUTE *ALL      02710000
*                                  command                       @L5A*/ 02720000
*      3 MGCEOCSP   BIT(1),     /* Original console id specified @05A*/ 02730000
*      3 MGCERunSynch  Bit(1),  /* Run the command synchronously @LAA*/ 02740000
*      3 MGCEDoNoXsys Bit(1),   /* Do no xsysmcs calls           @LAA*/ 02750000
*      3 MGCEDoXsysGetFree Bit(1), /* Do the xsysmcs get and free       02760000
*                                                                @LAA*/ 02770000
*      3 *          BIT(3),     /* Reserved                      @LAC*/ 02780000
*/********************************************************************/ 02790000
*/*       The MGCELFL field must be exactly mapped by the        @L1A*/ 02800000
*/*       XACMFLGA field in the XSA.                             @L1A*/ 02810000
*/********************************************************************/ 02820000
*    2 MGCELFL    FIXED(16),    /* Flag field                        */ 02830000
*      3 MGCELF1    FIXED(8),   /* First byte of flag field          */ 02840000
*        4 MGCEEXT  BIT(1),     /* Extended form (MGCRE) parameter      02850000
*                                  list is being used                */ 02860000
*        4 MGCESSI  BIT(1),     /* Subsystem issued the command      */ 02870000
*        4 MGCECMD  BIT(1),     /* Module IEAVC700 issued the           02880000
*                                  command                           */ 02890000
*        4 MGCEHPY  BIT(1),     /* Suppress hardcopy                 */ 02900000
*        4 MGCETOK  BIT(1),     /* TOKEN keyword specified           */ 02910000
*        4 MGCEIDSP BIT(1),     /* CONSID keyword specified          */ 02920000
*        4 MGCENMSP BIT(1),     /* CONSNAME keyword specified        */ 02930000
*        4 MGCEAUSP BIT(1),     /* Command authority specified   @L1C*/ 02940000
*      3 MGCELF2    FIXED(8),   /* Second byte of flag field     @L1C*/ 02950000
*        4 MGCEFAST BIT(1),     /* Bypass SSI ,command exits and        02960000
*                                  CMDAUTH                       @D2C*/ 02970000
*        4 MGCENPFX BIT(1),     /* No prefix processing          @L1A*/ 02980000
*        4 MGCECTSP BIT(1),     /* CART keyword specified        @L3A*/ 02990000
*        4 MGCEPASS BIT(1),     /* RESERVED FOR SP313 COMPATIBILITY  */ 03000000
*        4 MGCEUTOK BIT(1),     /* RESERVED FOR SP313 COMPATIBILITY  */ 03010000
*        4 MGCERTD  BIT(1),     /* Command was routed            @L4A*/ 03020000
*        4 MGCEENBY BIT(1),     /* RESERVED for APAR rework             03030000
*                                  compatibility             @YA15958*/ 03040000
*        4 MGCEDFER BIT(1),     /* Deferred command execution    @D1A*/ 03050000
*    2 MGCEACM    CHAR(5),      /* Control block acronym 'MGCRE'     */ 03060000
*    2 MGCEVRSN   FIXED(8),     /* Version level                     */ 03070000
*    2 MGCELF3    FIXED(8),     /* Third byte of flags           @02A*/ 03080000
*      3 MGCECOAC   BIT(1),     /* Compressed ACEE is present    @02A*/ 03090000
*      3 MGCENOBY   BIT(1),     /* Do not bypass RACROUTE for requeued  03100000
*                                  commands                      @04A*/ 03110000
*      3 MGCETSO    BIT(1),     /* Command issued by TSO user    @L8A*/ 03120000
*      3 MGCEENVR   BIT(1),     /* ENVRIN specified              @06A*/ 03130000
*      3 *          BIT(3),     /* See XSA for availability.     @08C*/ 03131002
*      3 MGCEHPY2   BIT(1),     /* Mimics MGCEHPY (CMDFLAG=NOHCPY)      03132002
*                                  and communicated thru command        03133004
*                                  processing to be used with a         03134002
*                                  'routed' command.             @08A*/ 03135003
*    2 MGCERES1   CHAR(1),      /* See XSA for availability.     @02C*/ 03150002
*    2 MGCETXTP   PTR(31),      /* Address of the command text       */ 03160000
*    2 MGCETOKN   FIXED(32),    /* Token                             */ 03170000
*    2 MGCECNNM   CHAR(8),      /* Console name                      */ 03180000
*    2 MGCECNID   FIXED(32),    /* Console id                        */ 03190000
*/********************************************************************/ 03200000
*/*      The MGCEDISP field must be exactly mapped by the XADISP @L1A*/ 03210000
*/*      field in the XSA (IEEXSA).                              @L1A*/ 03220000
*/********************************************************************/ 03230000
*    2 MGCEDISP   BIT(8),       /* Command disposition           @L1A*/ 03240000
*      3 MGCEDSPA  BIT(1),      /* Command has MASTER authority. It is  03250000
*                                  suggested that MGCEDSPM be used      03260000
*                                  instead                       @L9C*/ 03270000
*      3 MGCEDSPM  BIT(1),      /* Command has Master authority  @L9C*/ 03280000
*      3 *         BIT(2),      /* Reserved for IBM use          @L7C*/ 03290000
*      3 MGCEDSPE  BIT(1),      /* Command issued by ARM         @L7A*/ 03300000
*      3 *         BIT(3),      /* Reserved for IBM use          @L7A*/ 03310000
*/********************************************************************/ 03320000
*/*      The MGCEAUTH field must be exactly mapped by the XAAUTH @L1A*/ 03330000
*/*      field in the XSA (IEEXSA).                              @L1A*/ 03340000
*/********************************************************************/ 03350000
*    2 MGCEAUTH   BIT(16),      /* Command authority level       @L1A*/ 03360000
*      3 MGCEATHA  BIT(8),      /* Byte one                      @L1A*/ 03370000
*        4 MGCEATH1  BIT(1),    /* Command has SYS authority     @L1A*/ 03380000
*        4 MGCEATH2  BIT(1),    /* Command has I/O authority     @L1A*/ 03390000
*        4 MGCEATH3  BIT(1),    /* Command has CONS authority    @L1A*/ 03400000
*        4 *         BIT(5),    /* Reserved                      @L1A*/ 03410000
*      3 MGCEATHB  BIT(8),      /* Reserved                      @L2C*/ 03420000
*    2 MGCERES2   BIT(8),       /* Reserved                      @L2A*/ 03430000
*    2 MGCECART   CHAR(8),      /* CART                          @L3C*/ 03440000
*    2 MGCESYSN   CHAR(8),      /* Originating system name       @L3A*/ 03450000
*    2 MGCEUTP    PTR(31),      /* Utoken address                @D3A*/ 03460000
*    2 MGCEOCID   FIXED(32),    /* Originating console id (use for      03470000
*                                  authority checking            @L9C*/ 03480000
*    2 MGCESZE1   CHAR(0) BDY(WORD),  /* Size of the MGCRE plist        03490000
*                                        up to version 2                03500000
*                                        without the command text@06C*/ 03510000
*    2 MGCEENVP   PTR(31),      /* ENVRIN address                @06A*/ 03520000
*    2 MGCERESZ   CHAR(32),     /* Reserved                      @06A*/ 03530000
*    2 MGCESZE3   CHAR(0) BDY(WORD);  /* Size of the MGCRE plist        03540000
*                                        up to version 3                03550000
*                                        without the command text@07C*/ 03560000
*DECLARE                                                                03570000
*  1 MGCETEXT BASED(MGCETXTP),                                          03580000
*    2  MGCELEN    FIXED(15),   /* Command text length               */ 03590000
*    2  MGCETXT    CHAR(126),   /* Command text                      */ 03600000
*    2  MGCESZE2   CHAR(0) BDY(WORD); /* Size of command text and       03610000
*                                        length of the command text  */ 03620000
*DECLARE                                                                03630000
*   MGCEUTKN CHAR(*) BASED(MGCEUTP);       /* UTOKEN             @D3A*/ 03640000
*                                                                       03650000
*DCL MGCENAME CHAR(5)  CONSTANT('MGCRE');  /* 'MGCRE' acronym        */ 03660000
*DCL MGCESP41 FIXED(8) CONSTANT(1);        /* Version level          */ 03670000
*DCL MGCEROAL FIXED(8) CONSTANT(2);        /* Version level with        03680000
*                                              OW15497           @03A*/ 03690000
*DCL MGCE35671 Fixed(8) Constant(3);       /* Version level with        03700000
*                                              OA35671           @06A*/ 03710000
*DCL MGCEVRID FIXED(8) CONSTANT(MGCE35671); /* Version level     @06C*/ 03720000
