*                                                                       00001000
* %DCL IEZMGCR_INCLUDED CHAR EXT;                                       00002000
* %DEACTIVATE IEZMGCR_INCLUDED;                                         00003000
* %IF IEZMGCR_INCLUDED = '' %THEN                                       00004000
* %DO;                                                                  00005000
*% /*                                                                   00006000
         MACRO                                                          00007000
         IEZMGCR &DSECT=YES                                             00008000
**/ IEZMGCR_1:;                                                         00009000
*/***START OF SPECIFICATIONS******************************************/ 00010000
*/*                                                                  */ 00011000
*/*  MACRO NAME:  IEZMGCR                                            */ 00012000
*/*                                                                  */ 00013000
*/*  DESCRIPTIVE NAME = MGCR PARAMETER LIST DEFINITION               */ 00014000
*/*    ACRONYM = MGCR                                            @P6A*/ 00015000
*/*                                                                  */ 00016000
*/*  EXTERNAL CLASSIFICATION:                                    @P9A*/ 00017000
*/*  GUPI: BASE                                                  @P9A*/ 00018000
*/*  DMTI: FIELDS  MGCRAUSP    MGCRCMD     MGCRCTSP              @P9A*/ 00019000
*/*                MGCRDFER    MGCRENBY    MGCRFAST              @P9A*/ 00020000
*/*                MGCRHCPY    MGCRIDSP    MGCRNMSP              @P9A*/ 00021000
*/*                MGCRNPFX    MGCRPASS    MGCRRTD               @P9A*/ 00022000
*/*                MGCRSSI                                       @P9A*/ 00023000
*/*  END OF EXTERNAL CLASSIFICATION:                             @P9A*/ 00024000
*/*                                                                  */ 00025000
*/*01* PROPRIETARY STATEMENT=                                        */ 00026000
*/***PROPRIETARY_STATEMENT********************************************/ 00027000
*/*                                                                  */ 00028000
*/*                                                                  */ 00029000
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00030000
*/* 5694-A01 (C) COPYRIGHT IBM CORP. 1980, 2006                      */ 00032000
*/*                                                                  */ 00033000
*/* STATUS= HBB7730                                                  */ 00034000
*/*                                                                  */ 00035000
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 00036000
*/*                                                                  */ 00037000
*/*  DSECT NAME = MGCRPL                                         @P6A*/ 00038000
*/*               MGCRPTOK                                       @P8A*/ 00039000
*/*               MGCRSTOK                                       @P8A*/ 00040000
*/*                                                              @P6A*/ 00041000
*/*  COMPONENT = MASTER SCHEDULER (SC1B8)                        @P6A*/ 00042000
*/*                                                              @P6A*/ 00043000
*/*  EYE-CATCHER = NONE                                          @P6A*/ 00044000
*/*                                                              @P6A*/ 00045000
*/*  STORAGE ATTRIBUTES =                                        @P6A*/ 00046000
*/*    SUBPOOL = ANY                                             @P6A*/ 00047000
*/*    KEY = ANY                                                 @P6A*/ 00048000
*/*    RESIDENCY = ANY                                           @P6A*/ 00049000
*/*                                                              @P6A*/ 00050000
*/*  SIZE = VARIABLE, 5 TO 214 BYTES, DEPENDING ON THE LENGTH    @P7C*/ 00051000
*/*    OF THE TEXT, PLUS THE PRESENCE OF THE OPTIONAL UTOKEN     @P6A*/ 00052000
*/*    AND/OR PTOKEN AREAS.                                      @P6A*/ 00053000
*/*                                                              @P6A*/ 00054000
*/*  CREATED BY = ISSUERS OF THE MGCR MACRO                      @P6A*/ 00055000
*/*                                                              @P6A*/ 00056000
*/*  POINTED TO BY = REGISTER 1 (SET UP BY MGCR MACRO)           @P6A*/ 00057000
*/*                                                              @P6A*/ 00058000
*/*  SERIALIZATION = NONE                                        @P6A*/ 00059000
*/*                                                              @P6A*/ 00060000
*/*  METHOD OF ACCESS =                                          @P6C*/ 00061000
*/*      BAL  - DSECT IS PRODUCED UNLESS DSECT=NO IS SPECIFIED       */ 00062000
*/*                                                                  */ 00063000
*/*      PL/S - %DCL MGCRATRB CHAR                                   */ 00064000
*/*             %MGCRATRB = 'VALUE'                                  */ 00065000
*/*                  VALUE = BDY(WORD) OR BASED                      */ 00066000
*/*                                                                  */ 00067000
*/*             SPECIFY %IEZMGCR_SIZCON='YES' TO GENERATE        @P7A*/ 00068000
*/*             FIELDS MGCRSIZA AND MGCRSIZB AS CONSTANTS        @P7A*/ 00069000
*/*             RATHER THAN AS STATIC INIT.                      @P7A*/ 00070000
*/*                                                                  */ 00071000
*/*  FUNCTION = PARAMETER LIST FOR THE MGCR MACRO.               @P6A*/ 00072000
*/*                                                              @P6A*/ 00073000
*/*01*                                                           @P8A*/ 00074000
*/*  USAGE NOTES =                                               @P6C*/ 00075000
*/*                                                              @P2A*/ 00076000
*/*    - ADDRESSABILITY TO THE MGCRPL, TOKEN AND UTOKEN PORTIONS @P2A*/ 00077000
*/*      OF THE MAPPING, MUST BE OBTAINED SEPARATELY.            @D1C*/ 00078000
*/*    - MGCRTEXT IS A VARIABLE LENGTH FIELD, WITH 126 BEING THE @P2A*/ 00079000
*/*      MAXIMUM LENGTH PERMITTED.                               @P2A*/ 00080000
*/*      NOTE:  THE IBM SUPPLIED BUFFER LENGTH IS ALWAYS 126 @YA33548*/ 00081000
*/*             CHARACTERS. HOWEVER, USERS MAY PROVIDE THEIR @YA33548*/ 00082000
*/*             OWN STORAGE FOR MGCRPL WITH A SMALLER SIZE   @YA33548*/ 00083000
*/*             BUFFER.                                      @YA33548*/ 00084000
*/*      USAGE: COMMAND IN BUFFER MUST BE:                   @YA33548*/ 00085000
*/*                     - LEFT JUSTIFIED                     @YA33548*/ 00086000
*/*                     - PADDED ON RIGHT WITH BLANKS        @YA33548*/ 00087000
*/*    - IF TOKEN IS SPECIFIED, STORAGE FOR IT MUST IMMEDIATELY  @P2A*/ 00088000
*/*      FOLLOW THE COMMAND BUFFER.                          @YA33548*/ 00089000
*/*    - IF TOKEN AND UTOKEN ARE SPECIFIED, STORAGE FOR THE      @P2A*/ 00090000
*/*      TOKEN MUST FOLLOW THE COMMAND BUFFER, AND STORAGE   @YA33548*/ 00091000
*/*      FOR THE UTOKEN MUST FOLLOW THE TOKEN.               @YA33548*/ 00092000
*/*    - IF UTOKEN IS SPECIFIED AND TOKEN IS NOT, STORAGE FOR    @P2A*/ 00093000
*/*      THE UTOKEN MUST IMMEDIATELY FOLLOW THE COMMAND TEXT.    @P2A*/ 00094000
*/*    - IF SPECIFIED, STORAGE FOR THE TOKEN MUST IMMEDIATELY    @P2A*/ 00095000
*/*      FOLLOW THE COMMAND BUFFER.                          @YA33548*/ 00096000
*/*    - MGCRLGTH IS THE LENGTH OF THE CONTROL PORTION PLUS      @P2A*/ 00097000
*/*      THE LENGTH OF THE COMMAND BUFFER.                   @YA33548*/ 00098000
*/*    - MGCRSIZE IS MGCRLGTH PLUS THE LENGTH OF A TOKEN (FOUR). @P2A*/ 00099000
*/*    - STORAGE FOR THE PARAMETER LIST SHOULD BE GETMAIN'D      @P2A*/ 00100000
*/*      AS FOLLOWS:                                             @P2A*/ 00101000
*/*                                                              @P2A*/ 00102000
*/*      ----------------------------------------------------    @P2A*/ 00103000
*/*      !                                                  !    @P2A*/ 00104000
*/*      ! CONTROL PORTION                         4 BYTES  !    @P2A*/ 00105000
*/*      !                                                  !    @P2A*/ 00106000
*/*      !                                                  !    @P2A*/ 00107000
*/*      !                                                  !    @P2A*/ 00108000
*/*      !                                                  !    @P2A*/ 00109000
*/*      ----------------------------------------------------    @P2A*/ 00110000
*/*      ! COMMAND BUFFER (VARIABLE LENGTH)  < = 126 BYTES  !@YA33548*/ 00111000
*/*      ----------------------------------------------------    @P2A*/ 00112000
*/*                                                              @P2A*/ 00113000
*/*                         OR                                   @P2A*/ 00114000
*/*                                                              @P2A*/ 00115000
*/*      ----------------------------------------------------    @P2A*/ 00116000
*/*      !                                                  !    @P2A*/ 00117000
*/*      ! CONTROL PORTION                         4 BYTES  !    @P2A*/ 00118000
*/*      !                                                  !    @P2A*/ 00119000
*/*      !                                                  !    @P2A*/ 00120000
*/*      !                                                  !    @P2A*/ 00121000
*/*      !                                                  !    @P2A*/ 00122000
*/*      ----------------------------------------------------    @P2A*/ 00123000
*/*      ! COMMAND BUFFER (VARIABLE LENGTH)  < = 126 BYTES  !@YA33548*/ 00124000
*/*      ----------------------------------------------------    @P2A*/ 00125000
*/*      ! TOKEN                                   4 BYTES  !    @P2A*/ 00126000
*/*      ----------------------------------------------------    @P2A*/ 00127000
*/*                                                              @P2A*/ 00128000
*/*                         OR                                   @P2A*/ 00129000
*/*                                                              @P2A*/ 00130000
*/*      ----------------------------------------------------    @P2A*/ 00131000
*/*      !                                                  !    @P2A*/ 00132000
*/*      ! CONTROL PORTION                         4 BYTES  !    @P2A*/ 00133000
*/*      !                                                  !    @P2A*/ 00134000
*/*      !                                                  !    @P2A*/ 00135000
*/*      !                                                  !    @P2A*/ 00136000
*/*      !                                                  !    @P2A*/ 00137000
*/*      ----------------------------------------------------    @P2A*/ 00138000
*/*      ! COMMAND BUFFER (VARIABLE LENGTH)  < = 126 BYTES  !@YA33548*/ 00139000
*/*      ----------------------------------------------------    @P2A*/ 00140000
*/*      ! TOKEN                                   4 BYTES  !    @P2A*/ 00141000
*/*      ----------------------------------------------------    @P2A*/ 00142000
*/*      !                                                  !    @P2A*/ 00143000
*/*      ! UTOKEN                                 80 BYTES  !    @P2A*/ 00144000
*/*      !                                                  !    @P2A*/ 00145000
*/*      ----------------------------------------------------    @P2A*/ 00146000
*/*                                                              @P2A*/ 00147000
*/*                         OR                                   @P2A*/ 00148000
*/*                                                              @P2A*/ 00149000
*/*      ----------------------------------------------------    @P2A*/ 00150000
*/*      !                                                  !    @P2A*/ 00151000
*/*      ! CONTROL PORTION                         4 BYTES  !    @P2A*/ 00152000
*/*      !                                                  !    @P2A*/ 00153000
*/*      !                                                  !    @P2A*/ 00154000
*/*      !                                                  !    @P2A*/ 00155000
*/*      !                                                  !    @P2A*/ 00156000
*/*      ----------------------------------------------------    @P2A*/ 00157000
*/*      ! COMMAND BUFFER (VARIABLE LENGTH)  < = 126 BYTES  !@YA33548*/ 00158000
*/*      ----------------------------------------------------    @P2A*/ 00159000
*/*      !                                                  !    @P2A*/ 00160000
*/*      ! UTOKEN                                 80 BYTES  !    @P2A*/ 00161000
*/*      !                                                  !    @P2A*/ 00162000
*/*      ----------------------------------------------------    @P2A*/ 00163000
*/*                                                              @P2A*/ 00164000
*/*                                                              @P2A*/ 00165000
*/*  CHANGE ACTIVITY = G380P2N, ZMB0867, YA07258            @ZMB0867 */ 00166000
*/*  $L1=SP313,    JBB3313, 880226,  PDCR: MVS B1 SECURITY SUPPORT   */ 00167000
*/*  $P1=PGP0056,  JBB3313, 881009,  PDCR: REMOVE MGCRUOFF           */ 00168000
*/*  $P2=PGP0417,  JBB3313, 890616,  PDCR: MAPPING INCONSISTENCIES   */ 00169000
*/*  $P3=PGP0462,  JBB3313, 890616,  PDDF: MAPPING INCONSISTENCIES   */ 00170000
*/*  $D1=DCRR0048, JBB3313, 890711,  PDDF: MAPPING INCONSISTENCIES   */ 00171000
*/*                YA15958 - IEEXSA COMPATIBILITY           @YA15958 */ 00172000
*/*                YA30805 - REPLACE CSECT WITH &SYSLOC     @YA30805 */ 00173000
*/*              YA33548 - REMOVE ORG STATEMENT              @YA33548*/ 00174000
*/*  $01=OY35812,  JBB3313, 901113,  PDCM: FIX MGCRTOKN REFERENCE    */ 00175000
*/*  $L2=OPSSI7CY, HBB4410, 880420,  PDCY: OPSSI                @L3A */ 00176000
*/*  $L3=OPSSI8CY, HBB4410, 880706,  PDCY: OPSSI                @L3A */ 00177000
*/*  $D2=DCR100,   HBB4410, 890130,  PDEC: DEFERRED COMMAND EXCUTION */ 00178000
*/*                                        DURING NIP                */ 00179000
*/*  $P4=PEO1364, HBB4410, 890403,  PDHG: FIX BASING FOR MGCRTOKN    */ 00180000
*/*  $P5=PEO2417, HBB4410, 890910,  PDCM: COMMENTARY IN MACRO        */ 00181000
*/*  $P6=PKB0806, HBB4430, 920725,  PDCM: PROLOG UPDATES             */ 00182000
*/*  $P7=PQC0075, HBB6603, 950210,  PDCM: COMPILER INFO MESSAGE      */ 00183000
*/*  $P8=PQC0396, HBB6603, 950818,  PDZH: UPDATE SHOWHDR SO IT WILL  */ 00184000
*/*                                       RUN CORRECTLY              */ 00185000
*/*  $P9=PQC0664, HBB6603, 960105,  PDZH: CORRECT EXTERNAL           */ 00186000
*/*                                       CLASSIFICATION             */ 00187000
*/*  $L4=CNZ2A,   HBB7730, 040702,  PDSS: 1-Byte Elimination Part 2  */ 00188000
*/*                                                                  */ 00189000
*/********************************************************************/ 00190000
*/*  A 000000-999999                                        @G380P2N */ 00191000
*/*  C COMMENTS TO CLARIFY USAGE OF MGCRSSI, MGCRCMD, AND   @ZMB0867 */ 00192000
*/*    MGCRHCPY                                             @ZMB0867 */ 00193000
*/*  C ADD ORG STATEMENT TO RE-SET INSTRUCTION COUNTER      @YA07258 */ 00194000
*/*    TO END OF MACRO.                                     @YA07258 */ 00195000
*/*  C ADD MGCRPASS                                             @L1A */ 00196000
*/*  C ADD SUPPORT FOR UTOKEN TO BE SPECIFIED ON MGCR           @L1A */ 00197000
*/*  C REMOVE MGCRUOFF                                          @P1A */ 00198000
*/*  C FIX INCOMPATABILITIES IN MAPPINGS                        @P2A */ 00199000
*/*  C FIX INCOMPATABILITIES IN MAPPINGS                        @P3A */ 00200000
*/*  C FIX INCOMPATABILITIES IN MAPPINGS                        @D1A */ 00201000
*/*  C RESERVE FIELD FOR APAR REWORK                        @YA15958 */ 00202000
*/*  C REPLACE CSECT STATEMENT WITH &SYSLOC                 @YA30805 */ 00203000
*/*  C REMOVE ORG STATEMENT AFTER .MGCR003                  @YA33548 */ 00204000
*/*  C CORRECT OY33548 AND CORRECT REFERENCE TO MGCRTOKN        @01A */ 00205000
*/*  A ADDED BIT FIELDS TO FLAG BYTE MGCRFLGB                   @L2A */ 00206000
*/*  C CHANGED COMMENTS FOR MGCRE RELATED BITS TO INDICATE THAT      */ 00207000
*/*    THESE BITS ARE RESERVED FOR COMPATIBILITY WITH MGCRE.    @L3A */ 00208000
*/*  A ADDED BIT FIELD TO FLAG BYTE MGCRFLGB FOR DEFERRED       @D2A */ 00209000
*/*    COMMAND EXECUTION DURING NIP                             @D2A */ 00210000
*/*  C FIX BASING FOR MGCRTOKN (ROLLUP)                         @P4A */ 00211000
*/*  C CORRECT COMMENTS IN MACRO PROLOG                         @P5A */ 00212000
*/*  A PROLOG UPDATES                                           @P6A */ 00213000
*/*  C REMOVE SEMICOLON FROM PROLOG WHICH CAUSES UNNECESSARY    @P7A */ 00214000
*/*    COMPILER MESSAGES                                        @P7A */ 00215000
*/*  C ADDED INTERNAL IEZMGCR_SIZCON VARIABLE TO GENERATE       @P7A */ 00216000
*/*    MGCRSIZA AND MGCRSIZB AS CONSTANT WHEN REQUESTED, TO     @P7A */ 00217000
*/*    ELIMINATE UNNECESSARY COMPILER MESSAGES.                 @P7A */ 00218000
*/*  A SHOWHDR UPDATES                                          @P8A */ 00219000
*/*  A UPDATE EXTERNAL CLASSIFICATION                           @P9A */ 00220000
*/*  C Allow MGCRSIZ be a constant                              @L4A */ 00230000
*/***END OF SPECIFICATIONS********************************************/ 00231000
*% /*                                                                   00232000
         SPACE                                                          00233000
         IEZBITS             SYMBOLIC BIT DEFINITIONS                   00234000
         SPACE                                                          00235000
         AIF    ('&DSECT' EQ 'NO').MGCR001                              00236000
MGCRPL   DSECT                                                          00237000
         AGO    .MGCR002                                                00238000
.MGCR001 ANOP                                                           00239000
MGCRPL   DS     0D                                                      00240000
.MGCR002 ANOP                                                           00250000
         SPACE                                                          00260000
MGCRFLG1 DS     B             FLAGS FIELD                               00270000
MGCRFI   EQU    BIT0          MGCRFLG2 IS VALID                         00280000
MGCRLGTH DS     B             LENGTH OF BUFFER EXCLUDING TOKENS    @D1C 00290000
MGCRFLG2 DS     0BL2          FLAGS FIELD                               00291000
MGCRFLGA DS     B                                                       00292000
MGCRSV00 EQU    BIT0          RESERVED                                  00293000
MGCRSSI  EQU    BIT1          SUBSYSTEM ISSUED COMMAND, FOR CONTROL     00294000
*                             PROGRAM USAGE ONLY               @ZMB0867 00294100
MGCRCMD  EQU    BIT2          IEAVC700 ISSUED COMMAND, FOR CONTROL      00294200
*                             PROGRAM USAGE ONLY               @ZMB0867 00294300
MGCRHCPY EQU    BIT3          SUPPRESS HARDCOPY, FOR CONTROL            00294400
*                             PROGRAM USAGE ONLY               @ZMB0867 00294500
MGCRTOK  EQU    BIT4          INDICATES MGCRPTKN CONTAINS A PROGRAM    +00294600
                              TOKEN                                @D1C 00294700
MGCRIDSP EQU    BIT5          RESERVED FOR COMPATIBILITY W/ MGCRE  @L3C 00294800
MGCRNMSP EQU    BIT6          RESERVED FOR COMPATIBILITY W/ MGCRE  @L3C 00294900
MGCRAUSP EQU    BIT7          RESERVED FOR COMPATILIBITY W/ MGCRE  @L3C 00295000
MGCRFLGB DS     B             FLAGS FIELD                               00295100
MGCRFAST EQU    BIT0          RESERVED FOR COMPATIBILITY W/ MGCRE  @L3C 00295200
MGCRNPFX EQU    BIT1          RESERVED FOR COMPATIBILITY W/ MGCRE  @L3C 00295300
MGCRCTSP EQU    BIT2          RESERVED FOR COMPATIBILITY W/ MGCRE  @L3C 00295400
MGCRPASS EQU    BIT3          COMMAND QUEUED FROM CONSOLXX         @L1A 00295500
MGCRUTOK EQU    BIT4          MGCRUTKN CONTAINS A UTOKEN           @L1A 00295600
MGCRRTD  EQU    BIT5          RESERVED FOR COMPATIBILITY W/ MGCRE  @L3C 00295700
MGCRENBY EQU    BIT6          RESERVED FOR APAR REWORK         @YA15958 00295800
MGCRDFER EQU    BIT7          DEFERRED COMMAND EXECUTION DURING NIP     00295900
*                                                                  @D2C 00296000
MGCRTEXT DS     CL126         MAXIMUM SIZE OF COMMAND TEXT         @D1C 00296100
MGCRLTH  EQU    *-MGCRPL      LENGTH OF COMMAND BUFFER EXCLUDING       +00296200
                              TOKENS                               @D1C 00296300
MGCREND  EQU    *             END OF COMMAND BUFFER BEFORE TOKENS  @D1C 00296400
         AIF    ('&DSECT' NE 'NO').MGCR003                         @D1A 00296500
         DS     CL4           SPACE FOR PROGRAM TOKEN              @01A 00296600
         DS     CL80          SPACE FOR SECURITY TOKEN (UTOKEN)    @D1A 00296700
.MGCR003 ANOP                                                      @D1A 00296800
MGCRTOKN EQU    MGCRPL,4,C'C' COMPATABILITY WITH PRE-SP3.1.3   *** @01C 00296900
MGCRPTOK DSECT                TO MAP THE PROGRAM TOKEN             @D1A 00297000
MGCRPTKN DS     CL4           PROGRAM TOKEN                        @D1A 00297100
MGCRSTOK DSECT                TO MAP THE SECURITY TOKEN            @D1A 00297200
MGCRUTKN DS     CL80          SECURITY TOKEN (UTOKEN)              @D1A 00297300
         AIF    ('&DSECT' NE 'NO').MGCR004                         @D1A 00297400
&SYSLOC  LOCTR                                                 @YA30805 00297500
         AGO    .MGCR005                                                00297600
.MGCR004 ANOP                                                      @D1A 00297700
MGCRPL   DSECT                                                          00297800
.MGCR005 ANOP                                                      @D1A 00297900
MGCRSIZ  EQU    MGCRLTH+L'MGCRPTKN  MAXIMUM LENGTH OF COMMAND BUFFER   +00298000
                             EXCLUDING SECURITY TOKEN (UTOKEN)     @D1A 00298100
MGCRSIZA EQU    MGCRLTH+L'MGCRUTKN  MAXIMUM LENGTH OF COMMAND BUFFER   +00298200
                             EXCLUDING PROGRAM TOKEN               @D1A 00298300
MGCRSIZB EQU    MGCRLTH+L'MGCRPTKN+L'MGCRUTKN  MAXIMUM LENGTH OF       +00298400
                             COMMAND BUFFER INCLUDING BOTH TOKENS  @D1A 00298500
         MEND                                                           00298600
**/ IEZMGCR_2:;                                                         00298700
* %IEZMGCR_INCLUDED = 'YES';                                            00298800
* %DCL ZCBPRINT CHAR EXT;                                               00298900
* %DEACTIVATE ZCBPRINT;                                                 00299000
* %DCL IEZMGCR_LIST CHAR EXT;                                           00300000
* %DEACTIVATE IEZMGCR_LIST;                                             00301000
* %IF IEZMGCR_LIST ^= 'NO' &                                            00302000
*    ZCBPRINT ^= 'NO' %THEN                                             00303000
*   %GOTO IEZMGCR_3;                                                    00304000
*   @LIST PUSH NOECHO;                                                  00305000
*   @LIST NOASSEMBLE NOECHO;                                            00306000
*   @LIST OFF C NOECHO;                                                 00307000
* %IEZMGCR_3:;                                                          00308000
*/* Start of PL/X Source                                             */ 00309000
* %If MGCRATRB = '' %THEN %MGCRATRB = 'BASED';                  ] @L4A  00310000
* DCL                                                                   00311000
* 1 MGCRPL    MGCRATRB,       /* COMMAND BUFFER (EXCLUDING TOKENS)   */ 00312000
*   2 MGCRFLG1 FIXED(8),      /* FLAGS FIELD                         */ 00313000
*     3 MGCRFI BIT(1),        /* MGCRFLG2 IS VALID                   */ 00314000
*   2 MGCRLGTH FIXED(8),      /* LENGTH OF BUFFER EXCLUDING TOKENS      00315000
*                                                                @D1C*/ 00316000
*   2 MGCRFLG2 FIXED(16),                                               00317000
*     3 MGCRFLGA FIXED(8),    /* FLAGS FIELD                         */ 00318000
*       4 MGCRSV00 BIT(1),    /* RESERVED                            */ 00319000
*       4 MGCRSSI BIT(1),     /* SUBSYSTEM ISSUED COMMAND, FOR CONTROL  00320000
*                               PROGRAM USAGE ONLY           @ZMB0867*/ 00321000
*       4 MGCRCMD BIT(1),     /* IEAVC700 ISSUED COMMAND, FOR CONTROL   00322000
*                               PROGRAM USAGE ONLY           @ZMB0867*/ 00323000
*       4 MGCRHCPY BIT(1),    /* SUPPRESS HARDCOPY, FOR CONTROL         00324000
*                               PROGRAM USAGE ONLY           @ZMB0867*/ 00325000
*       4 MGCRTOK BIT(1),     /* MGCRTOKN CONTAINS A TOKEN           */ 00326000
*       4 MGCRIDSP BIT(1),    /* RESERVED FOR COMPATIBILITY WITH        00327000
*                                MGCRE                           @L3C*/ 00328000
*       4 MGCRNMSP BIT(1),    /* RESERVED FOR COMPATIBILITY WITH        00329000
*                                MGCRE                           @L3C*/ 00330000
*       4 MGCRAUSP BIT(1),    /* RESERVED FOR COMPATIBILITY WITH        00331000
*                                MGCRE                           @L3C*/ 00332000
*     3 MGCRFLGB FIXED(8),    /* FLAGS FIELD                         */ 00333000
*       4 MGCRFAST BIT(1),    /* RESERVED FOR COMPATIBILTY WITH         00334000
*                               MGCRE                            @L3C*/ 00335000
*       4 MGCRNPFX BIT(1),    /* RESERVED FOR COMPATIBILTY WITH         00336000
*                               MGCRE                            @L3C*/ 00337000
*       4 MGCRCTSP BIT(1),    /* RESERVED FOR COMPATIBILITY WITH        00338000
*                               MGCRE                            @L3C*/ 00339000
*       4 MGCRPASS BIT(1),    /* COMMAND QUEUED FROM CONSOLXX    @L1A*/ 00340000
*       4 MGCRUTOK BIT(1),    /* MGCRUTKN CONTAINS A UTOKEN      @L1A*/ 00341000
*       4 MGCRRTD  BIT(1),    /*RESERVED FOR COMPATIBILITY WITH         00342000
*                               MGCRE.                           @L3C*/ 00343000
*       4 MGCRENBY BIT(1),    /* RESERVED FOR APAR REWORK    @YA15958*/ 00344000
*       4 MGCRDFER BIT(1),    /* DEFERRED COMMAND EXECUTION             00345000
*                                DURING NIP                      @D2A*/ 00346000
*   2 MGCRTEXT CHAR(126);     /* MAXIMUM SIZE OF COMMAND TEXT    @D1C*/ 00347000
* DCL MGCRTOKN CHAR(4) MGCRATRB;  /* PROGRAM TOKEN -- COMPATIBILITY     00348000
*                               WITH RELEASES PRIOR TO SP 3.1.3  @P4C*/ 00349000
*                                                                       00350000
* DCL MGCRPTKN CHAR(4) BASED; /* PROGRAM TOKEN                   @D1C*/ 00351000
* DCL MGCRUTKN CHAR(80) BASED, /* UTOKEN                         @P2C*/ 00352000
*%IF IEZMGCR_SIZCON = 'YES' %THEN %GOTO IEZMGCR1;                       00353000
*                                       /* GENERATE AS CONST?  @P7A*/   00354000
*     MGCRSIZ FIXED(8) STATIC                                           00355000
*        INIT(LENGTH(MGCRPL)+LENGTH(MGCRPTKN)), /*MAXIMUM SIZE OF       00356000
*                                           COMMAND BUFFER WITH         00357000
*                                           PROGRAM TOKEN        @L4M*/ 00358000
*     MGCRSIZA FIXED(8) STATIC                                          00359000
*       INIT(LENGTH(MGCRPL)+LENGTH(MGCRUTKN)); /* MAXIMUM SIZE OF       00360000
*                                                COMMAND BUFFER WITH    00370000
*                                                SECURITY TOKEN  @D1A*/ 00380000
* DCL MGCRSIZB FIXED(8) STATIC                                          00390000
*       INIT(LENGTH(MGCRPL)+LENGTH(MGCRPTKN)+LENGTH(MGCRUTKN)); /*      00400000
*                                                MAXIMUM SIZE OF        00400100
*                                                COMMAND BUFFER WITH    00400200
*                                                BOTH TOKENS     @D1A*/ 00400300
*%GOTO IEZMGCR2;                         /*                      @P7A*/ 00400400
*%IEZMGCR1:;                             /*                      @P7A*/ 00400500
*     MGCRSIZ FIXED(8)                                                  00400600
*        Constant(LENGTH(MGCRPL)+LENGTH(MGCRPTKN)), /*MAXIMUM SIZE OF   00400700
*                                           COMMAND BUFFER WITH         00400800
*                                           PROGRAM TOKEN        @L4A*/ 00400900
*     MGCRSIZA FIXED(8) CONSTANT(LENGTH(MGCRPL)+LENGTH(MGCRUTKN));      00401000
*                                              /* MAXIMUM SIZE OF       00401100
*                                                COMMAND BUFFER WITH    00401200
*                                                SECURITY TOKEN  @P7C*/ 00401300
* DCL MGCRSIZB FIXED(8)                                                 00401400
*      CONSTANT(LENGTH(MGCRPL)+LENGTH(MGCRPTKN)+LENGTH(MGCRUTKN)); /*   00401500
*                                                MAXIMUM SIZE OF        00401600
*                                                COMMAND BUFFER WITH    00401700
*                                                BOTH TOKENS     @D1A*/ 00401800
*%IEZMGCR2:;                             /*                      @P7A*/ 00401900
*/* End of PL/X Source                                               */ 00402000
* %IF IEZMGCR_LIST ^= 'NO' &                                            00402100
*    ZCBPRINT ^= 'NO' %THEN                                             00402200
*   %GOTO IEZMGCR_4;                                                    00402300
*   @LIST POP NOECHO;                                                   00402400
* %IEZMGCR_4:;                                                          00402500
* %END;                                                                 00402600
