*                                                                       00001000
* %DCL IFAQUAA_INCLUDED CHAR EXT;                                       00002000
* %DEACTIVATE IFAQUAA_INCLUDED;                                         00003000
* %IF IFAQUAA_INCLUDED = '' %THEN                                       00004000
* %DO;                                                                  00005000
*/* Macro made bi-lingual on 19337. CBGEN compile date 19044         */ 00006000
*% /*                                                                   00007000
         MACRO                                                          00008000
         IFAQUAA &DSECT=YES,&LIST=YES,&TITLE=YES,&PREFIX=,             *00009000
               &QUAHDRTYPE=YES,&QUALSTYPE=COND,&QUALSEXTRECTYPE=COND,  *00010000
               &QUAFSTYPE=COND,&QUAPSTYPE=COND                          00011000
         GBLC  &IFAQUAA_INCLUDED                                        00012000
         GBLC  &ZCBPRINT                                                00013000
&IFAQUAA_INCLUDED SETC 'YES'                                            00014000
         AIF   ('&LIST' EQ 'NONE').P0                                   00015000
         AIF   ('&TITLE' EQ 'NO').P5                                    00016000
 TITLE   'IFAQUAA  - SMF Query Answer Area                          '   00017000
.P5      ANOP                                                           00018000
**/ IFAQUAA_1:;                                                         00019000
*/* START OF SPECIFICATIONS ******************************************* 00020000
*                                                                       00021000
**01* PROPRIETARY STATEMENT=                                         */ 00022000
*/***PROPRIETARY_STATEMENT********************************************/ 00023000
*/*                                                                  */ 00024000
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00025000
*/* 5650-ZOS                                                         */ 00026000
*/* COPYRIGHT IBM CORP. 2007, 2019                                   */ 00027000
*/*                                                                  */ 00028000
*/* STATUS = HBB77C0                                                 */ 00029000
*/*                                                                  */ 00030000
*/***END_OF_PROPRIETARY_STATEMENT*************************************  00031000
*                                                                       00032000
*01* DESCRIPTIVE NAME:  SMF Query Answer Area                           00033000
*02*  ACRONYM:  QUAA                                                    00034000
*                                                                       00035000
*01* MACRO NAME:  IFAQUAA                                               00036000
*                                                                       00037000
*01* EXTERNAL CLASSIFICATION: GUPI                                      00038000
*01* END OF EXTERNAL CLASSIFICATION:                                    00039000
*                                                                       00040000
*01* DSECT NAME:                                                        00041000
*     QUAHDR                                                            00042000
*     QUALS                                                             00043000
*     QUAPS                                                             00044000
*     QUAFS                                                             00045000
*                                                                       00046000
*01* COMPONENT:  System Management Facility (SC100)                     00047000
*                                                                       00048000
*01* EYE-CATCHER:  NONE                                                 00049000
*                                                                       00050000
*01* STORAGE ATTRIBUTES:                                                00051000
*02*  SUBPOOL:  Caller-supplied                                         00052000
*02*  KEY:  Caller-supplied                                             00053000
*02*  RESIDENCY:  Caller-supplied                                       00054000
*                                                                       00055000
*01* SIZE:  Variable                                                    00056000
*            QUALSEXTRECTYPE -- X'0100' bytes                           00057000
*            QUAFSTYPE       -- X'0021' bytes                           00058000
*            QUAPSTYPE       -- X'0030' bytes                           00059000
*            QUAHDRTYPE      -- X'0010' bytes                           00060000
*            QUALSTYPE       -- X'00D1' bytes                           00061000
*                                                                       00062000
*01* CONTROL BLOCK CHANGES:                                             00063000
*02*  IFAU29LM                                                          00064000
*02*   5.3                                                              00065000
*03*    New                                                             00066000
*03*    Migration Considerations: NONE                                  00067000
*01* END CONTROL BLOCK CHANGES                                          00068000
*                                                                       00069000
*01* CREATED BY:                                                        00070000
*     Caller and passed as parameter on ANSAREA keyword                 00071000
*      on IFAQUERY invocation                                           00072000
*                                                                       00073000
*01* POINTED TO BY:                                                     00074000
*     IFAQUERY parameter list                                           00075000
*                                                                       00076000
*01* SERIALIZATION:                                                     00077000
*     None required                                                     00078000
*                                                                       00079000
*01* FUNCTION:                                                          00080000
*02* Maps the data returned by the IFAQUERY macro request.              00081000
*                                                                       00082000
*                                                                       00083000
*01* METHOD OF ACCESS:                                                  00084000
*02*  ASM:                                                              00085000
*      IFAQUERY                                                         00086000
*           DSECT=YES!NO  -- Request DSECT definition                   00087000
*           QUALS=YES!NO!COND -- Request QUALS record mapping           00088000
*     Default: DSECT=YES                                                00089000
*     Notes: name=YES  => expand                                        00090000
*            name=NO   => do not expand                                 00091000
*            name=COND => expand only if DSECT=YES                      00092000
*                                                                       00093000
*02*  PL/AS:                                                            00094000
*                                                                       00095000
*                                                                       00096000
*01* DELETED BY:  Caller                                                00097000
*                                                                       00098000
*01* FREQUENCY:  Created by caller                                      00099000
*                                                                       00100000
*01* DEPENDENCIES:  None                                                00101000
*                                                                       00102000
*01* DISTRIBUTION LIBRARY:  AMACLIB                                     00103000
*                                                                       00104000
*01* CHANGE ACTIVITY:                                                   00105000
*                                                                       00106000
*  $L0=SMFDV   ,HBB7740,061212,PDHV: SMF DATA VOLUME             @L0A   00107000
*  $L1=RELDAT  ,HBB7760,080630,PDHV: Add PREFIXing for compatibility    00108000
*                                    between macros              @L1A   00109000
*  $L2=SMFFLOOD,HBB7770,090430,PDAS: SMF Flood Automation        @L2A   00110000
*  $P1=ME16523 ,HBB7770,090730,PDAS: Additional fields           @P1A   00111000
*  $01=OA35175 ,HBB7770,110630,PDAS: DSPSIZMAX Static Support    @01A   00112000
*  $L3=SMFZEDC ,HBB7790,130218,PDNJ: Compression Support                00113000
*                                    (ME25773)                   @L3A   00114000
*  $02=OA47770 ,HBB77A0,150821,PDQV: Various SMFTAMP fixes (TRSQ)@02A   00115000
*  $L4=SMFTYPEX HBB77B0 160930 PDHV: SMF Extended Type support   @L4A   00116000
*  $03=OA57371  HBB77C0 191010 PDTA: SMF Quantum                 @03A   00117000
*                                                                       00118000
* Change activity details:                                              00119000
*  A - Created                                                   @L0A   00120000
*  A - Added new areas for return information from the SMF Flood @L2A   00121000
*      facility                                                  @L2A   00122000
*  A - Added new fields for records lost per logstream and time  @P1A   00123000
*      which a logstream stopped recording                       @P1A   00124000
*  A - Added new fields for the logstream buffer size            @01A   00125000
*  A - Added Compression info into log stream section            @L3A   00126000
*  A - Added Crypto options info into the logstream section      @02A   00127000
*  A - Changes to accommodate up to 2048 record types.           @L4A   00128000
*  A - Changes to support ARECSIGN signatures.                   @03A   00129000
*                                                                       00130000
* END OF SPECIFICATIONS **********************************************/ 00131000
*% /*                                                                   00132000
.P0      ANOP                                                           00133000
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 00134000
         AIF   ('&LIST' EQ 'YES').P2                                    00135000
.P1      ANOP                                                           00136000
         PUSH  PRINT                                                    00137000
         PRINT OFF                                                      00138000
.P2      ANOP                                                           00139000
         AIF   ('&QUAHDRTYPE' EQ 'NO').L0002                            00140000
         AIF   ('&DSECT' EQ 'YES').L0003                                00141000
         AIF   ('&QUAHDRTYPE' NE 'YES').L0002                           00142000
&PREFIX.QUAHDRTYPE DS 0F Header section                                 00143000
         AGO   .L0004                                                   00144000
.L0003   ANOP                                                           00145000
&PREFIX.QUAHDRTYPE DSECT   Header section                               00146000
.L0004   ANOP                                                           00147000
&PREFIX.QUAH#REC DS F    Number of QUALS or QUADS records which        *00148000
                         follow. Note: this field is zero with zero    *00149000
                         return code, when the service could not find  *00150000
                         any records and SMF is recording               00151000
&PREFIX.QUAH#REM DS F    Number of QUALS or QUADS records which were   *00152000
                         not returned because of insufficient space     00153000
&PREFIX.QUAHTLEN DS F    Total length of answer area needed to contain *00154000
                         all the requested information. This includes  *00155000
                         the area for the records that were returned   *00156000
                         on this call.                                  00157000
&PREFIX.QUAHDOFF DS F    Offset from QUAHDR to the first data record.   00158000
&PREFIX.QUAHDRTYPE_LEN EQU *-&PREFIX.QUAHDRTYPE                         00159000
.L0002   ANOP                                                           00160000
         AIF   ('&QUALSTYPE' EQ 'NO').L0005                             00161000
         AIF   ('&DSECT' EQ 'YES').L0006                                00162000
         AIF   ('&QUALSTYPE' NE 'YES').L0005                            00163000
.L0006   ANOP                                                           00164000
*                                                                       00165000
*    *****************************************************************  00166000
*    *                                                               *  00167000
*    * QUAA Logstream Data WARNING] You must use the QUALSLEN to     *  00168000
*    * determine the size of QUALS that is presented. This size can  *  00169000
*    * change at any time due to new SMF support or service.         *  00170000
*    *                                                               *  00171000
*    *****************************************************************  00172000
*                                                                       00173000
*                                                                       00174000
         AIF   ('&DSECT' EQ 'YES').L0007                                00175000
&PREFIX.QUALSTYPE DS 0F  Logstream Record data format                   00176000
         AGO   .L0008                                                   00177000
.L0007   ANOP                                                           00178000
&PREFIX.QUALSTYPE DSECT   Logstream Record data format                  00179000
.L0008   ANOP                                                           00180000
&PREFIX.QUALSTYP DS B    X'02' Logstream record, X'82' last Logstream  *00181000
                         record                                         00182000
         DS    B         Reserved X'00'                                 00183000
&PREFIX.QUALSLEN DS H    Length of Logstream record, including the     *00184000
                         QuaLSExtRecType extension, if requested        00185000
&PREFIX.QUALSNAME DS CL26 Logstream name                                00186000
&PREFIX.QUALSXTOFF DS H  Offset from beginning of QUALSType to         *00187000
                         extended type extension                        00188000
&PREFIX.QUALSREC DS CL32 256 bit bitstring describing record types     *00189000
                         being recorded to this logstream (record 0 is *00190000
                         in first bit of first byte, record 255 is     *00191000
                         last bit of byte 32.)                          00192000
&PREFIX.QUALSBSZ DS F    Logstream buffer block size (number of bytes)  00193000
&PREFIX.QUALSTOD DS BL8  Last successful write TOD                      00194000
&PREFIX.QUALSTAT DS BL4  Logstream Status                               00195000
         ORG   &PREFIX.QUALSTAT                                         00196000
&PREFIX.QUALSTB1 DS B    Status byte 1                                  00197000
*  Bit definitions:                                                     00198000
&PREFIX.QUALSDEF EQU X'80' Default logstream, accepting records which  *00199000
                         are not being recorded in any other           *00200000
                         logstream.                                     00201000
&PREFIX.QUALSACT EQU X'40' Active                                       00202000
&PREFIX.QUALSCLN EQU X'20' being cleaned up                             00203000
&PREFIX.QUALSCNT EQU X'10' Connected                                    00204000
&PREFIX.QUALSDWG EQU X'08' On when the DSPSIZMAX option came from the  *00205000
                         global option                                  00206000
&PREFIX.QUALSTB2 DS B    Status byte 2                                  00207000
*  Bit definitions:                                                     00208000
&PREFIX.QUALSCRQ EQU X'80' On-Compression requested for records        *00209000
                         written to this log stream by SMF             *00210000
                         configuration Off-Compression not requested    00211000
&PREFIX.QUALSCPR EQU X'40' On-Compression is Prepared. This log stream *00212000
                         is ready to compress records (hardware is     *00213000
                         capable of using zEnterprise Data Compression *00214000
                         (zEDC)), and all setup for compression        *00215000
                         succeeded Off- Hardware is not capable of     *00216000
                         using zEDC or compression setup failed (see   *00217000
                         IFA730I)                                       00218000
&PREFIX.QUALSCMP EQU X'20' On- Compression is Available. The last use  *00219000
                         of zEDC was successful and it indicated a     *00220000
                         zEDC Express was available to satisfy         *00221000
                         compression requests Off- At last request-    *00222000
                         zEDC Expresses were not available to satisfy  *00223000
                         compression requests                           00224000
&PREFIX.QUALSPFG EQU X'10' The current PERMFIX value for this log      *00225000
                         stream is the global PERMFIX value. In the    *00226000
                         SMF configuration, a log stream PERMFIX value *00227000
                         was not specified.                             00228000
&PREFIX.QUALSXTD EQU X'08' This logstream is collecting record types   *00229000
                         above 255. The actual record type numbers are *00230000
                         only returned if the IFAQUERY request         *00231000
                         specifies ExtendedTypes=YES                    00232000
&PREFIX.QUALSTB3 DS B    Status byte 3                                  00233000
&PREFIX.QUALSTB4 DS B    Status byte 4                                  00234000
&PREFIX.QUALSBFL DS F    Number of records lost during buffer          *00235000
                         shortage. If zero then there is currently no  *00236000
                         buffer shortage.                               00237000
&PREFIX.QUALSDTM DS CL8  Time that logstream buffer became             *00238000
                         unavailable. If zero then there is currently  *00239000
                         no buffer shortage.                            00240000
&PREFIX.QUALSDSZ DS F    The DSPSIZMAX for this logstream (number of   *00241000
                         bytes)                                         00242000
&PREFIX.QUALSHWM DS F    The high water mark for the buffer area       *00243000
                         (number of bytes)                              00244000
&PREFIX.QUALSLFT DS F    Amount of storage used currently in the       *00245000
                         buffer area (number of bytes)                  00246000
*                                                                       00247000
*      ***************************************************************  00248000
*      *                                                             *  00249000
*      * SMF configuration parameter PERMFIX defines the maximum     *  00250000
*      * storage SMF can keep registered to zEDC. The following four *  00251000
*      * fields represent amounts of storage registered to zEDC for  *  00252000
*      * this log stream.                                               00253000
*      *                                                             *  00254000
*      ***************************************************************  00255000
*                                                                       00256000
*                                                                       00257000
&PREFIX.QUALSPFT DS F    Total storage SMF is currently using for zEDC *00258000
                         for this log stream. Value does not account   *00259000
                         for 1MB needed by each log stream using zEDC. *00260000
                         Value may be up to 2MB greater than the       *00261000
                         defined PERMFIX value depending on usage.      00262000
&PREFIX.QUALSPFM DS F    Max storage SMF can use for zEDC for this log *00263000
                         stream. Configuration defined PERMFIX value.   00264000
&PREFIX.QUALSPFH DS F    High water mark of storage SMF has used for   *00265000
                         zEDC for this log stream connection            00266000
&PREFIX.QUALSKEYHANDLE DS CL44 44 character key handle for RECSIGN      00267000
         ORG   &PREFIX.QUALSKEYHANDLE                                   00268000
&PREFIX.QUALSTOKENNAME DS CL32 32 character token name                  00269000
         DS    CL12      Remaining key handle                           00270000
&PREFIX.QUALSCRYPTOFLAGS DS B Option flags                              00271000
*  Bit definitions:                                                     00272000
&PREFIX.QUALSRECSIGNON EQU X'80' RECSIGN specified                      00273000
&PREFIX.QUALSARECSIGNON EQU X'40' ARECSIGN specified                    00274000
&PREFIX.QUALSSIGTYPE DS B SIGNATURE type for RECSIGN                    00275000
*  Bit definitions:                                                     00276000
&PREFIX.QUALSSIGRSA EQU X'80' SIGNATURE(RSA)                            00277000
&PREFIX.QUALSSIGECDSA EQU X'40' SIGNATURE(ECDSA)                        00278000
&PREFIX.QUALSHASHTYPE DS B HASH method for RECSIGN                      00279000
*  Bit definitions:                                                     00280000
&PREFIX.QUALSHASHSHA1 EQU X'80' HASH(SHA1)                              00281000
&PREFIX.QUALSHASHSHA256 EQU X'40' HASH(SHA256)                          00282000
&PREFIX.QUALSHASHSHA384 EQU X'20' HASH(SHA384)                          00283000
&PREFIX.QUALSHASHSHA512 EQU X'10' HASH(SHA512)                          00284000
&PREFIX.QUALSALTKEYHANDLE DS CL44 44 character key handle for ARECSIGN  00285000
         ORG   &PREFIX.QUALSALTKEYHANDLE                                00286000
&PREFIX.QUALSALTTOKENNAME DS CL32 32 character token name               00287000
         DS    CL12      Remaining key handle                           00288000
&PREFIX.QUALSALTSIGTYPE DS B SIGNATURE type for ARECSIGN                00289000
*  Bit definitions:                                                     00290000
&PREFIX.QUALSALTSIGLI2 EQU X'20' SIGNATURE(LI2)                         00291000
&PREFIX.QUALSALTHASHTYPE DS B HASH method for ARECSIGN                  00292000
*  Bit definitions:                                                     00293000
&PREFIX.QUALSALTHASHSHA512 EQU X'10' HASH(SHA512)                       00294000
&PREFIX.QUALSTYPE_LEN EQU *-&PREFIX.QUALSTYPE                           00295000
.L0005   ANOP                                                           00296000
         AIF   ('&QUALSEXTRECTYPE' EQ 'NO').L0009                       00297000
         AIF   ('&DSECT' EQ 'YES').L000A                                00298000
         AIF   ('&QUALSEXTRECTYPE' NE 'YES').L0009                      00299000
.L000A   ANOP                                                           00300000
*                                                                       00301000
*    *****************************************************************  00302000
*    *                                                               *  00303000
*    * QUAA Logstream extended type data QUALSLEN will include this  *  00304000
*    * area, but you must locate it by adding QUALSXTOFF to the      *  00305000
*    * address of the QUALSTYPE entry to allow QUALSTYPE to continue *  00306000
*    * expand.                                                          00307000
*    *                                                               *  00308000
*    *****************************************************************  00309000
*                                                                       00310000
*                                                                       00311000
         AIF   ('&DSECT' EQ 'YES').L000B                                00312000
&PREFIX.QUALSEXTRECTYPE DS 0X Logstream Record data extension for      *00313000
                         extended record types                          00314000
         AGO   .L000C                                                   00315000
.L000B   ANOP                                                           00316000
&PREFIX.QUALSEXTRECTYPE DSECT   Logstream Record data extension for    *00317000
                         extended record types                          00318000
.L000C   ANOP                                                           00319000
&PREFIX.QUALSEXTRECTYPEBITS DS CL256 256 byte representation of 2048   *00320000
                         record types, where: bit 0 (byte 1, bit 0) =  *00321000
                         record type 0, bit 2047 (byte 256, bit 7) =   *00322000
                         record type 2047                               00323000
&PREFIX.QUALSEXTRECTYPE_LEN EQU *-&PREFIX.QUALSEXTRECTYPE               00324000
.L0009   ANOP                                                           00325000
         AIF   ('&QUAFSTYPE' EQ 'NO').L000D                             00326000
         AIF   ('&DSECT' EQ 'YES').L000E                                00327000
         AIF   ('&QUAFSTYPE' NE 'YES').L000D                            00328000
.L000E   ANOP                                                           00329000
*                                                                       00330000
*    *****************************************************************  00331000
*    *                                                               *  00332000
*    * QUAA SMF Flood Policy Data                                       00333000
*    *                                                               *  00334000
*    *****************************************************************  00335000
*                                                                       00336000
*                                                                       00337000
         AIF   ('&DSECT' EQ 'YES').L000F                                00338000
&PREFIX.QUAFSTYPE DS 0D  Policy Record data format                      00339000
         AGO   .L0010                                                   00340000
.L000F   ANOP                                                           00341000
&PREFIX.QUAFSTYPE DSECT   Policy Record data format                     00342000
.L0010   ANOP                                                           00343000
&PREFIX.QUAFSTYP DS B    X'03' MSG Type, X'04' DROP Type Policy        *00344000
                         record. The high order bit will be on in the  *00345000
                         last record                                    00346000
         DS    B         Reserved X'00'                                 00347000
&PREFIX.QUAFSLEN DS H    Length of Policy record                        00348000
&PREFIX.QUAFEXTTYPE DS H Extended Record type (0-2047) when            *00349000
                         ExtendedTypes is set to YES. When             *00350000
                         ExtendedTypes is set or defaulted to NO, set  *00351000
                         to zero                                        00352000
         DS    H         Reserved X'00'                                 00353000
&PREFIX.QUAFINTVLTIME DS FL8 Interval time for this policy for flood   *00354000
                         detection                                      00355000
&PREFIX.QUAFENDINTVL DS FL8 Interval time for this policy for end of   *00356000
                         flood detection                                00357000
&PREFIX.QUAFRECTHRESH DS F Number of records that make up an interval  *00358000
                         for this policy                                00359000
&PREFIX.QUAFMAXHIGHINTS DS F Max number of intervals allow below the   *00360000
                         IntvlTime before action is taken for this     *00361000
                         policy                                         00362000
&PREFIX.QUAFTYPE DS X    Record type this filter is for when           *00363000
                         ExtendedTypes is set or defaulted to NO        00364000
&PREFIX.QUAFSTYPE_LEN EQU *-&PREFIX.QUAFSTYPE                           00365000
.L000D   ANOP                                                           00366000
         AIF   ('&QUAPSTYPE' EQ 'NO').L0011                             00367000
         AIF   ('&DSECT' EQ 'YES').L0012                                00368000
         AIF   ('&QUAPSTYPE' NE 'YES').L0011                            00369000
.L0012   ANOP                                                           00370000
*                                                                       00371000
*    *****************************************************************  00372000
*    *                                                               *  00373000
*    * QUAA SMF Flood Policy Drop History                               00374000
*    *                                                               *  00375000
*    *****************************************************************  00376000
*                                                                       00377000
*                                                                       00378000
         AIF   ('&DSECT' EQ 'YES').L0013                                00379000
&PREFIX.QUAPSTYPE DS 0D  Drop History data format                       00380000
         AGO   .L0014                                                   00381000
.L0013   ANOP                                                           00382000
&PREFIX.QUAPSTYPE DSECT   Drop History data format                      00383000
.L0014   ANOP                                                           00384000
&PREFIX.QUAPSTYP DS B    X'05' For Drop History record, x'85' for the  *00385000
                         last record                                    00386000
&PREFIX.QUAPRECTYPE DS X The record type of the flood for when         *00387000
                         ExtendedTypes is set or defaulted to NO        00388000
&PREFIX.QUAPSLEN DS H    Length of drop history record                  00389000
&PREFIX.QUAPEXTTYPE DS H Extended Record type (0-2047) when            *00390000
                         ExtendedTypes is set to YES. When             *00391000
                         ExtendedTypes is set or defaulted to NO, set  *00392000
                         to zero                                        00393000
         DS    H         Reserved X'00'                                 00394000
&PREFIX.QUAPDROPPEDRECORDS DS FL8 # of records dropped                  00395000
&PREFIX.QUAPFLOODSTART DS CL16 STCKE from start of the flood            00396000
&PREFIX.QUAPFLOODEND DS CL16 StckE from the end of the flood            00397000
*                                                                       00398000
*    *****************************************************************  00399000
*    *                                                               *  00400000
*    * QUAA Constants                                                   00401000
*    *                                                               *  00402000
*    *****************************************************************  00403000
*                                                                       00404000
*                                                                       00405000
&PREFIX.QUAALOGSTREAMTYPE EQU 2                                         00406000
&PREFIX.QUAAFLOODPOLICYMSGTYPE EQU 3                                    00407000
&PREFIX.QUAAFLOODPOLICYDROPTYPE EQU 4                                   00408000
&PREFIX.QUAADROPHISTORYTYPE EQU 5                                       00409000
&PREFIX.QUAALASTENTRY EQU 128                                           00410000
&PREFIX.QUAPSTYPE_LEN EQU *-&PREFIX.QUAPSTYPE                           00411000
.L0011   ANOP                                                           00412000
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 00413000
         AIF   ('&LIST' EQ 'YES').P4                                    00414000
.P3      ANOP                                                           00415000
         POP   PRINT                                                    00416000
.P4      ANOP                                                           00417000
.P_EXIT  ANOP                                                           00418000
         MEND                                                           00419000
**/ IFAQUAA_2:;                                                         00420000
* %IFAQUAA_INCLUDED = 'YES';                                            00421000
* %DCL ZCBPRINT CHAR EXT;                                               00422000
* %DEACTIVATE ZCBPRINT;                                                 00423000
* %DCL IFAQUAA_LIST CHAR EXT;                                           00424000
* %DEACTIVATE IFAQUAA_LIST;                                             00425000
* %IF IFAQUAA_LIST = 'NO' !                                             00426000
*    ZCBPRINT = 'NO' %THEN                                              00427000
* %DO;                                                                  00428000
*   @LIST PUSH NOECHO;                                                  00429000
*   @LIST NOASSEMBLE NOECHO;                                            00430000
*   @LIST OFF C NOECHO;                                                 00431000
* %END;                                                                 00432000
*/* Start of PL/X Source                                             */ 00433000
*   DECLARE                                                             00434000
*     1    QUAHDRType Type,         /* Header section                */ 00435000
*      2    QUAH#REC FIXED(32),     /* Number of QUALS or QUADS         00436000
*                                      records which follow.            00437000
*                                      Note: this field is zero with    00438000
*                                      zero return code, when the       00439000
*                                      service could not find any       00440000
*                                      records and SMF is recording  */ 00441000
*      2    QUAH#REM FIXED(32),     /* Number of QUALS or               00442000
*                                      QUADS records which were not     00443000
*                                      returned because of              00444000
*                                      insufficient space            */ 00445000
*      2    QUAHTLEN FIXED(32),     /* Total length of answer area      00446000
*                                      needed to contain all the        00447000
*                                      requested information. This      00448000
*                                      includes the area for the        00449000
*                                      records that were returned on    00450000
*                                      this call.                    */ 00451000
*      2    QUAHDOFF FIXED(32);     /* Offset from QUAHDR to the first  00452000
*                                      data record.                  */ 00453000
*                                                                       00454000
*   /*****************************************************************/ 00455000
*   /*                                                               */ 00456000
*   /* QUAA Logstream Data                                           */ 00457000
*   /*                                                               */ 00458000
*   /* WARNING] You must use the QUALSLEN to determine the size of   */ 00459000
*   /* QUALS that is presented. This size can change at any time     */ 00460000
*   /* due to new SMF support or service.                            */ 00461000
*   /*                                                               */ 00462000
*   /*****************************************************************/ 00463000
*                                                                       00464000
*   DECLARE                                                             00465000
*     1    QUALSType Type,          /* Logstream Record data format  */ 00466000
*      2    QUALSTYP BIT(8),       /* X'02' Logstream record, X'82'     00467000
*                                      last Logstream record         */ 00468000
*      2    *        BIT(8),        /* Reserved X'00'                */ 00469000
*      2    QUALSLEN FIXED(16),     /* Length of Logstream record,      00470000
*                                      including the QuaLSExtRecType    00471000
*                                      extension, if requested   @L4C*/ 00472000
*      2    QUALSNAME CHAR(26),     /* Logstream name                */ 00473000
*      2    QUALSXTOFF FIXED(16),   /* Offset from beginning of         00474000
*                                      QUALSType to extended            00475000
*                                      type extension            @L4A*/ 00476000
*      2    QUALSREC  CHAR(32),     /* 256 bit bitstring describing     00477000
*                                      record types being recorded      00478000
*                                      to this logstream (record 0      00479000
*                                      is in first bit of first byte,   00480000
*                                      record 255 is last bit of        00481000
*                                      byte 32.)                     */ 00482000
*      2    QUALSBSZ  FIXED(32),    /* Logstream buffer block size      00483000
*                                      (number of bytes)         @01C*/ 00484000
*      2    QUALSTOD BIT(64),       /* Last successful write TOD     */ 00485000
*      2    QUALSTAT BIT(32),       /* Logstream Status              */ 00486000
*       3    QUALSTB1 BIT(8),       /* Status byte 1                 */ 00487000
*        4    QUALSDEF  BIT(1),     /* Default logstream, accepting     00488000
*                                      records which are not being      00489000
*                                      recorded in any other            00490000
*                                      logstream.                    */ 00491000
*        4    QUALSACT  BIT(1),     /* Active                        */ 00492000
*        4    QUALSCLN  BIT(1),     /* being cleaned up              */ 00493000
*        4    QUALSCNT  BIT(1),     /* Connected                     */ 00494000
*        4    QUALSDWG Bit(1),      /* On when the DSPSIZMAX option     00495000
*                                      came from the global option      00496000
*                                                                @01A*/ 00497000
*        4    *       BIT(2),       /* Reserved                      */ 00498000
*       3    QUALSTB2 BIT(8),       /* Status byte 2                 */ 00499000
*        4    QUALSCRQ  BIT(1),     /* On-Compression requested for     00500000
*                                      records written to this log      00501000
*                                      stream by SMF configuration      00502000
*                                      Off-Compression not requested    00503000
*                                                                @L3A*/ 00504000
*        4    QUALSCPR  BIT(1),     /* On-Compression is Prepared. This 00505000
*                                      log stream is ready to compress  00506000
*                                      records (hardware is capable of  00507000
*                                      using zEnterprise Data           00508000
*                                      Compression (zEDC)), and all     00509000
*                                      setup for compression succeeded  00510000
*                                      Off- Hardware is not capable of  00511000
*                                      using zEDC or compression setup  00512000
*                                      failed (see IFA730I)      @L3A*/ 00513000
*        4    QUALSCMP  BIT(1),     /* On- Compression is Available.    00514000
*                                      The last use of zEDC was         00515000
*                                      successful and it indicated a    00516000
*                                      zEDC Express was available to    00517000
*                                      satisfy compression requests     00518000
*                                      Off- At last request- zEDC       00519000
*                                      Expresses were not available to  00520000
*                                      satisfy compression requests     00521000
*                                                                @L3A*/ 00522000
*        4    QUALSPFG  BIT(1),     /* The current PERMFIX value for    00523000
*                                      this log stream is the global    00524000
*                                      PERMFIX value. In the SMF        00525000
*                                      configuration, a log stream      00526000
*                                      PERMFIX value was not            00527000
*                                      specified.                @L3A*/ 00528000
*        4    QUALSXTD  BIT(1),     /* This logstream is collecting     00529000
*                                      record types above 255. The      00530000
*                                      actual record type numbers are   00531000
*                                      only returned if the IFAQUERY    00532000
*                                      request specifies                00533000
*                                      ExtendedTypes=YES         @L4A*/ 00534000
*        4    *       BIT(3),       /* Reserved                  @L4A*/ 00535000
*       3    QUALSTB3 BIT(8),       /* Status byte 3                 */ 00536000
*       3    QUALSTB4 BIT(8),       /* Status byte 4                 */ 00537000
*      2    QUALSBFL FIXED(31),     /* Number of records lost during    00538000
*                                      buffer shortage. If zero then    00539000
*                                      there is currently no buffer     00540000
*                                      shortage.                 @P1A*/ 00541000
*      2    QUALSDTM CHAR(8),       /* Time that logstream buffer       00542000
*                                      became unavailable. If zero then 00543000
*                                      there is currently no buffer     00544000
*                                      shortage.                 @P1A*/ 00545000
*      2    QUALSDSZ Fixed(32),     /* The DSPSIZMAX for this logstream 00546000
*                                      (number of bytes)         @01A*/ 00547000
*      2    QUALSHWM Fixed(32),     /* The high water mark for the      00548000
*                                      buffer area (number of bytes)    00549000
*                                                                @01A*/ 00550000
*      2    QUALSLFT Fixed(32),     /* Amount of storage used currently 00551000
*                                      in the buffer area (number of    00552000
*                                      bytes)                    @L3C*/ 00553000
*      /**************************************************************/ 00554000
*      /* SMF configuration parameter PERMFIX defines the maximum    */ 00555000
*      /* storage SMF can keep registered to zEDC. The following four*/ 00556000
*      /* fields represent amounts of storage registered to zEDC for */ 00557000
*      /* this log stream.                                       @L5A*/ 00558000
*      /**************************************************************/ 00559000
*      2    QUALSPFT Fixed(32),     /* Total storage SMF is currently   00560000
*                                      using for zEDC for this log      00561000
*                                      stream. Value does not account   00562000
*                                      for 1MB needed by each log       00563000
*                                      stream using zEDC. Value may be  00564000
*                                      up to 2MB greater than the       00565000
*                                      defined PERMFIX value depending  00566000
*                                      on usage.                 @L3A*/ 00567000
*      2    QUALSPFM Fixed(32),     /* Max storage SMF can use for zEDC 00568000
*                                      for this log stream.             00569000
*                                      Configuration defined PERMFIX    00570000
*                                      value.                    @L3C*/ 00571000
*      2    QUALSPFH Fixed(32),     /* High water mark of storage SMF   00572000
*                                      has used for zEDC for this log   00573000
*                                      stream connection         @L3A*/ 00574000
*      2    QUALSKeyHandle CHAR(44), /* 44 character key handle for     00575000
*                                      RECSIGN                   @03C*/ 00576000
*       3   QUALSTokenName CHAR(32), /* 32 character token name  @02A*/ 00577000
*       3   *         CHAR(12),     /* Remaining key handle      @02A*/ 00578000
*      2    QUALSCryptoFlags BIT(8), /* Option flags             @02A*/ 00579000
*       3   QUALSRecSignOn BIT(1),  /* RECSIGN specified         @02A*/ 00580000
*       3   QUALSARecSignOn BIT(1), /* ARECSIGN specified        @03A*/ 00581000
*       3   *           BIT(6),     /* Reserved                  @03C*/ 00582000
*      2    QUALSSigType BIT(8),    /* SIGNATURE type for RECSIGN       00583000
*                                                                @03C*/ 00584000
*       3   QUALSSigRSA BIT(1),     /* SIGNATURE(RSA)            @02A*/ 00585000
*       3   QUALSSigECDSA BIT(1),   /* SIGNATURE(ECDSA)          @02A*/ 00586000
*       3   *     BIT(6),           /* Reserved                  @02A*/ 00587000
*      2    QUALSHashType BIT(8),   /* HASH method for RECSIGN   @03C*/ 00588000
*       3   QUALSHashSHA1 BIT(1),   /* HASH(SHA1)                @02A*/ 00589000
*       3   QUALSHashSHA256 BIT(1), /* HASH(SHA256)              @02A*/ 00590000
*       3   QUALSHashSHA384 BIT(1), /* HASH(SHA384)              @02A*/ 00591000
*       3   QUALSHashSHA512 BIT(1), /* HASH(SHA512)              @02A*/ 00592000
*       3   *      BIT(4),          /* Reserved                  @02A*/ 00593000
*      2    QUALSAltKeyHandle CHAR(44), /* 44 character key handle for  00594000
*                                      ARECSIGN                  @03A*/ 00595000
*       3   QUALSAltTokenName CHAR(32), /* 32 character token name      00596000
*                                                                @03A*/ 00597000
*       3   *         CHAR(12),     /* Remaining key handle      @03A*/ 00598000
*      2    QUALSAltSigType BIT(8), /* SIGNATURE type for ARECSIGN      00599000
*                                                                @03A*/ 00600000
*       3   *     BIT(2),           /* Reserved                  @03A*/ 00601000
*       3   QUALSAltSigLI2 BIT(1),  /* SIGNATURE(LI2)            @03A*/ 00602000
*       3   *     BIT(5),           /* Reserved                  @03A*/ 00603000
*      2    QUALSAltHashType BIT(8), /* HASH method for ARECSIGN @03A*/ 00604000
*       3   *      BIT(3),          /* Reserved                  @03A*/ 00605000
*       3   QUALSAltHashSHA512 BIT(1),/* HASH(SHA512)            @03A*/ 00606000
*       3   *      BIT(4),          /* Reserved                  @03A*/ 00607000
*      2    * CHAR(0);              /* END OF QUALS              @L3A*/ 00608000
*                                                                       00609000
*   /*****************************************************************/ 00610000
*   /*                                                               */ 00611000
*   /* QUAA Logstream extended type data                             */ 00612000
*   /*                                                               */ 00613000
*   /* QUALSLEN will include this area, but you must locate it by    */ 00614000
*   /* adding QUALSXTOFF to the address of the QUALSTYPE entry       */ 00615000
*   /* to allow QUALSTYPE to continue expand.                        */ 00616000
*   /*                                                           @L4A*/ 00617000
*   /*****************************************************************/ 00618000
*                                                                       00619000
*   DECLARE                                                             00620000
*     1    QUALSExtRecType Type,   /* Logstream Record data extension   00621000
*                                      for extended record types @L4A*/ 00622000
*      2     QUALSExtRecTypeBits char(256); /* 256 byte representation  00623000
*                        of 2048 record types, where:                   00624000
*                        bit 0 (byte 1, bit 0) = record type 0,         00625000
*                        bit 2047 (byte 256, bit 7) = record type 2047  00626000
*                                                                @L4A*/ 00627000
*                                                                       00628000
*   /*****************************************************************/ 00629000
*   /*                                                               */ 00630000
*   /* QUAA SMF Flood Policy Data                                    */ 00631000
*   /*                                                           @L2A*/ 00632000
*   /*****************************************************************/ 00633000
*                                                                       00634000
*   DECLARE                                                             00635000
*     1    QuafSType Type,         /* Policy Record data format  @L2A*/ 00636000
*      2    QuafSTYP BIT(8),       /* X'03' MSG Type, X'04' DROP Type   00637000
*                                     Policy record. The high order     00638000
*                                     bit will be on in the last        00639000
*                                     record                     @L2A*/ 00640000
*      2    *        BIT(8),       /* Reserved X'00'             @L2A*/ 00641000
*      2    QuafSLEN FIXED(16),    /* Length of Policy record    @L2A*/ 00642000
*      2    QuafExtType Fixed(16), /* Extended Record type (0-2047)     00643000
*                                     when ExtendedTypes is set to YES. 00644000
*                                     When ExtendedTypes is set or      00645000
*                                     defaulted to NO, set to zero      00646000
*                                                                @L4C*/ 00647000
*      2    * Fixed(16),           /* Reserved X'00'                    00648000
*                                                                @L4A*/ 00649000
*      2    QuafIntvlTime Fixed(63), /* Interval time for this policy   00650000
*                                     for flood detection        @L2A*/ 00651000
*      2    QuafEndIntvl Fixed(63), /* Interval time for this policy    00652000
*                                     for end of flood detection @L2A*/ 00653000
*      2    QUAFRecThresh  Fixed(31), /* Number of records that make up 00654000
*                                     an interval for this policy       00655000
*                                                                @L2A*/ 00656000
*      2    QuafMaxHighInts Fixed(31), /* Max number of intervals       00657000
*                                     allow below the IntvlTime before  00658000
*                                     action is taken for this policy   00659000
*                                                                @L2A*/ 00660000
*      2    QuafType Fixed(8);     /* Record type this filter is        00661000
*                                     for when ExtendedTypes is set or  00662000
*                                     defaulted to NO            @L4C*/ 00663000
*   /*****************************************************************/ 00664000
*   /*                                                               */ 00665000
*   /* QUAA SMF Flood Policy Drop History                            */ 00666000
*   /*                                                           @L2A*/ 00667000
*   /*****************************************************************/ 00668000
*                                                                       00669000
*   DECLARE                                                             00670000
*     1    QuapSType Type,         /* Drop History data format   @L2A*/ 00671000
*      2    QuapSTYP BIT(8),       /* X'05' For Drop History record,    00672000
*                                     x'85' for the last record  @L2A*/ 00673000
*      2    QUAPRecType Fixed(8),  /* The record type of the flood      00674000
*                                     for when ExtendedTypes is set or  00675000
*                                     defaulted to NO            @L4C*/ 00676000
*      2    QuapSLEN  FIXED(16),   /* Length of drop history record     00677000
*                                                                @L2A*/ 00678000
*      2    QuapExtType Fixed(16), /* Extended Record type (0-2047)     00679000
*                                     when ExtendedTypes is set to YES. 00680000
*                                     When ExtendedTypes is set or      00681000
*                                     defaulted to NO, set to zero      00682000
*                                                                @L4C*/ 00683000
*      2    * Fixed(16),           /* Reserved X'00'                    00684000
*                                                                @L4A*/ 00685000
*      2    QUAPDroppedRecords Fixed(63), /* # of records dropped       00686000
*                                                                @L2A*/ 00687000
*      2    QuapFloodStart Char(16), /* STCKE from start of the flood   00688000
*                                                                @L2A*/ 00689000
*      2    QuapFloodEnd Char(16); /* StckE from the end of the flood   00690000
*                                                                @L2A*/ 00691000
*   /*****************************************************************/ 00692000
*   /*                                                               */ 00693000
*   /* QUAA Constants                                                */ 00694000
*   /*                                                           @L2A*/ 00695000
*   /*****************************************************************/ 00696000
*                                                                       00697000
*   Declare                                                             00698000
*      QuaaLogStreamType Fixed(8) Constant('02'x), /*            @L2A*/ 00699000
*      QuaaFloodPolicyMsgType Fixed(8) Constant('03'x), /*       @L2A*/ 00700000
*      QuaaFloodPolicyDropType Fixed(8) Constant('04'x), /*      @L2A*/ 00701000
*      QuaaDropHistoryType Fixed(8) Constant('05'x); /*          @L2A*/ 00702000
*                                                                       00703000
*   Declare                                                             00704000
*      QuaaLastEntry Fixed(8) Constant('80'x); /*                @L2A*/ 00705000
*                                                                       00706000
* @LOGIC;                                                               00707000
* #PRAGMA TOOL=CBGEN.                                                   00708000
* #USEORG.                                                              00709000
* #PREFIX.                                                              00710000
* #EPRAGMA.                                                             00711000
* @ENDLOGIC;                                                            00712000
*/* End of PL/X Source                                               */ 00713000
* %IF IFAQUAA_LIST = 'NO' !                                             00714000
*    ZCBPRINT = 'NO' %THEN                                              00715000
* %DO;                                                                  00716000
*   @LIST POP NOECHO;                                                   00717000
* %END;                                                                 00718000
* %END;                                                                 00719000
