*        %GOTO IFASMFR2A; /*                                            00001000
         MACRO                                                          00020000
&NAME    IFASMFR2 &RECTYPE                                           */ 00030000
*%IFASMFR2A:;                                                           00031000
*/***** START OF SPECIFICATIONS *************************************** 00032000
*01* MACRO-NAME = IFASMFR2                                        @02C* 00040000
*  *                                                                  * 00050000
*  *01* PROPRIETARY STATEMENT=                                        * 00060000
*  ***PROPRIETARY_STATEMENT******************************************** 00070000
*  *                                                                  * 00080000
*  *  LICENSED MATERIALS - PROPERTY OF IBM                            * 00090000
*  *  5650-ZOS                                                        * 00100000
*  *  COPYRIGHT IBM CORP. 1982, 2019                                  * 00110000
*  *                                                                  * 00120000
*  *  STATUS= HBB77C0                                                 * 00130000
*  *                                                                  * 00140000
*  ***END_OF_PROPRIETARY_STATEMENT************************************* 00150000
*  *                                                                  * 00160000
*  * EXTERNAL CLASSIFICATION: PI                                  @P4A* 00170000
*  * END OF EXTERNAL CLASSIFICATION:                              @P4A* 00180000
*  *                                                                  * 00181000
*  * IFASMFR2 maps SMF records in the range 20-27.                    * 00182000
*  *                                                                 */ 00190000
*        %GOTO IFASMFR2B; /*                                            00191000
.* * MACMEAN IFASMFR2 MEANS SYSTEM MANAGEMENT FACILITY RECORD MAPPING * 00200000
.* * MACCOMP Y-2 SC102/BL27P                                          * 00210000
.* * MACSTAT Y-2 73298/42020                                          * 00220000
.* * METHOD OF ACCESS                                                 * 00230000
.* *   PL/S - INCLUDE MACRO FROM LIBRARY                              * 00240000
.* *           EXAMPLE - %INCLUDE SYSLIB(IFASMFR2)                    * 00250000
.* *                                                                  * 00260000
.* *          THIS MACRO EXPANDS RECORDS 20 -27.                      * 00270000
.* *                                                                  * 00280000
.* *                                                                  * 00290000
.* THIS IS AN SMF MACRO WHICH BUILDS SMF RECORDS 20-27. THE REQUIRED  * 00300000
.* FORMAT IS -                                                        * 00310000
.*                                                                    * 00320000
.*          IFASMFR2 &RECTYPE                                         * 00330000
.*                                                                    * 00340000
.* CHANGE ACTIVITY:                                                     00350000
.*                                                                      00360000
.* TYPE 26 RECORD - REMOVE ORG STMTS APPROX 147550,156550      @ZA12438 00370000
.* TYPE 26 RECORD - ADD ORG STMTS TO EVENTS,ACTUALS SECTIONS   @ZA17757 00380000
.* TYPE 26 RECORD - ADD JES2 ROUTING SECTION                   @G387P27 00390000
.* TYPE 26 RECORD - ADD JES2 NETWORK SECTION                   @ZA62109 00400000
.* TYPE 22 RECORD - ADD CHANNEL PATH SECTION & STORAGE CHANGE  @G860P27 00410000
.* TYPE 26 RECORD - ADD PRINT SECTION                          @ZA74830 00420000
.* TYPE 22 RECORD - GALLUP SUPPORT FOR TYPE 21                     @TCA 00430000
.* TYPE 22 RECORD - 3990 ADDED SUPPORT                         @YA19861 00440000
.* TYPE 22 RECORD - ADD SMF22IND VALUE '8' COMMENT                 @0KA 00450000
.* TYPE 23 RECORD - ADD TIME THE STATUS FUNCTION WAS SCHEDULED FOR @LRA 00460000
.*                  SMF INTERVAL SYNC SUPPORT                      @LRA 00470000
.* TYPE 22 RECORD - MOVE DYNAMIC I/O SECTION TO IOS COMP ID        @LSA 00480000
.* TYPE 21 Record - Transfer Mapping to DFP                        @01A 00490000
.* TYPE 22 RECORD - ADD SMF22IND VALUE '8' COMMENT                 @0KA 00500000
.* TYPE 23 RECORD - Include system-related data fields             @02A 00510000
.* Add External Classification                                     @P4A 00520000
.* TYPE 23 RECORD - Add SMF23BFx field origin comments in SMF23SMF @LTA 00530000
.* TYPE 22 RECORD - ADD SMF22CYL and SMF22CYP                      @04A 00540000
.* TYPE 23 RECORD - Add RSM Statistics                             @05A 00550000
.* TYPE 23 RECORD - Add Delta RSM Statistics                       @06A 00560000
.* TYPE 23 RECORD - Added SMF23SPN and SMF23BND sections           @LVA 00570000
.* TYPE 23 RECORD - Add Logstream Statistics Section               @07A 00580000
.* TYPE 23 RECORD - Correct SMF23LFM in assembler.  The comment    @08A 00590000
.*                  continued onto a second line, but column 1     @08A 00600000
.*                  is blank.  Also fix SMF23LFM and SMF23LFL      @08A 00610000
.*                  comments (HBB7790 only).                       @08A 00620000
.* TYPE 23 RECORD - Add Compression info to Logstream section      @LYA 00630000
.* TYPE 22 RECORD - Add the Storage Element Extension, ID=x'0C'    @P5A 00640000
.*                  to report frame status for frames above        @P5A 00650000
.*                  x'FFFFFFFF'. Added SMF22IRX and updated some   @P5A 00660000
.*                  comments in the Storage Element (ID=x'03')     @P5A 00670000
.* TYPE 22 RECORD - Storage Control Element: Define SMF22SMTS and  @09A 00680000
.*                  SMF22PMTS                                      @09A 00690000
.* TYPE 23 RECORD - Add SMF23BBC and SMF23BAC                      @P6A 00700000
.* TYPE 22 RECORD - Change names of SMF22SMTS and SMF22PMTS to     @P7A 00710000
.*                  SMF22SMT and SMF22PMT                          @P7A 00720000
.* TYPE 23 RECORD - Added SMF23LHP and SMF23LCP                    @0AA 00730000
.* TYPE 23 RECORD - Added SMF23MBU                                 @0BA 00731000
.* Accommodate C                                                   @LZA 00732000
.*                                                                      00740000
.* $H3=ES      ,JBB2133,830912,PDFS: EXTENDED STORE, TYPE 22       @H3A 00750000
.* $H4=VF      ,JBB2214,840320,PDFS: VECTORS SUPPORT, TYPE 22      @H4A 00760000
.* $T7=UZ90334 ,JBB2125,840523,PDFS: TRANSFER REC 25,26 TO SC141   @T7A 00770000
.* $T8=UZ90378 ,JBB2133,841226,PDFS: ADD JES2 TYPE 24 RECORD       @T8A 00780000
.* $T9=UZ90410 ,JBB2214,850620,PDFS: 3480 SUPPORT FOR TYPE 21      @T9A 00790000
.* $TC=YA11323 ,JBB2220,860902,PDFS: GALLUP SUPPORT FOR TYPE 22    @TCA 00800000
.* $DD=DCR290  ,HBB3310,871123,PDFS: TYPE 22 FOR >2G EXT. STOR     @DDA 00810000
.* $TE=OY27075 ,JBB3313,890309,PDLO: ADD INTEGRATED CRYPTO SERVICE      00820000
.*                                   FACILITY SUPPORT              @TEA 00830000
.* $0I=OY32650 ,JBB3313,901109,PDMF: TYPE 22 MAX LENGTH            @0IA 00840000
.* $0J=OY27449 ,JBB3313,901101,PDBR: BUFFER ALLOC PROCESSING       @0JA 00850000
.* $0K=OY59035 ,JBB2220,930131,PDSL: SMF22IND SMF RECORD CREATOR   @0KA 00860000
.*                                   INDICATOR FIELD NOT           @0KA 00870000
.*                                   DOCUMENTED CORRECTLY          @0KA 00880000
.* $H5=DYNAM   ,HBB4420,891231,PDMF: DYNAMIC I/O CONFIGURATION     @H5A 00890000
.* $P1=PH30835 ,HBB4420,900504,PDMF: DYNAMIC I/O CONFIGURATION     @P1A 00900000
.* $P2=PH30923 ,HBB4420,900604,PDMF: DYNAMIC I/O CONFIGURATION     @P2A 00910000
.* $P3=PH31941 ,HBB4420,901206,PDBR: Correct Dynam I/O Section ID  @P3A 00920000
.* $0I=OY32650 ,HBB4420,901109,PDMF: TYPE 22 MAX LENGTH            @0IA 00930000
.* $0J=OY27449 ,HBB4420,901101,PDBR: BUFFER ALLOC PROCESSING       @0JA 00940000
.* $LR=SYNCS   ,HBB4430,911108,PDDH: SMF INTERVAL SYNC SUPPORT     @LRA 00950000
.*                                   (STAGE 3)                     @LRA 00960000
.* $LS=PRSMM   ,HBB4430,920205,PDLQ: TRANSFER I/O CONFIGURATION CHANGE  00970000
.*                                   ELEMENT OF RECORD TYPE 22 TO       00980000
.*                                   SC1C3. NOTE THAT CHANGE ACTIVITY   00990000
.*                                   FLAGGING HAS BEEN REMOVED FOR      01000000
.*                                   PH30835, PH30923, AND PH31941.     01010000
.*                                                                 @LSA 01020000
.* $01=OY56189 ,HBB4410,920825,PDBR: DFP Records Transfer          @01A 01030000
.* $0K=OY59035 ,JBB2220,930131,PDSL: SMF22IND SMF RECORD CREATOR   @0KA 01040000
.*                                   INDICATOR FIELD NOT           @0KA 01050000
.*                                   DOCUMENTED CORRECTLY          @0KA 01060000
.* $02=OW03229 ,HBB5510,940325,PDDH: System data in SMF record     @02A 01070000
.* $P4=PN71727 ,HBB5520,941020,PDDH: CDPI: SHOWHDR Cleanup         @P4A 01080000
.* $03=OW57571 ,HBB6606,021215,PDOO: Add SNSSDST3/SSCBDVC4         @03A 01090000
.* $LT=SMFBXL  ,HBB7709,030529,PDDZ: SMF Buffer Constraints        @LTA 01100000
.* $04=OA20043 ,HBB7709 070315 PDOO: Support for DFSMS Dynamic     @04A 01110000
.*                                   Volume Extension              @04A 01120000
.* $05=OA22414 ,HBB7730,080530,PDHL: Internal SMF 23 Statistics    @05A 01130000
.* $06=ME13927 ,HBB7760,080804,PDOO: Fix copyright                 @66A 01140000
.* $LU=G64CPU  ,HBB7760,080905,PDIN: Vector removal                @LUA 01150000
.* $06=OA27161 ,HBB7730,081126,PDOH: RSM Delta SMF23 Stats         @06A 01160000
.* $LV=SPNINST ,HBB7780,100410,PDBS: Spin Lock Instrumentation     @06A 01170000
.* $07=OA35175 ,HBB7770,110630,PDAS: DSPSIZMAX Static Support      @07A 01180000
.* $LW=IOSPEN  ,HBB7790,110530,PDJI: Config PFID SMF22 record      @LWA 01190000
.* $08=OA37043 ,HBB7770,110722,PDTA: Fix SMF23LFM                  @08A 01200000
.* $LX=SIM4I   ,HBB7790,120415,PDBS: SMF22CpuId                    @LXA 01210000
.* $LY=SMFZCOMP,HBB7790,121010,PDNJ: Compression Support           @LYA 01220000
.* $P5=ME25421 ,HBB7790,130220,PDOO: Storage section constraint    @P5A 01230000
.*                                   for > 1M # of frames          @P5A 01240000
.* $09=OA43664 ,HBB7770,140124,PROO: Support for Multi-Target PPRC @09A 01250000
.*                                   status bits                   @09A 01260000
.* $P6=ME27132 ,HBB77A0,140821,PDOO: Add before and after          @P6A 01270000
.*                                   compression stats in SMF23    @P6A 01280000
.*     ME27132  HBB77A0 140908 PDOO: Syntax error in ME27132            01290000
.*                                   change activity                    01300000
.* $P7=ME28202  HBB77A0 141010 PDOO: 9 Character field names       @P7A 01310000
.* $0A=OA51264  HBB77A0 170120 PDOO: Report buffer use percent     @0AA 01320000
.* $0B=OA52828  HBB77A0 180125 PDOO: SMFTBUFF                      @0BA 01321000
.* $LZ=270303   HBB77C0 180901 PDXB: Accommodate C                 @LZA 01322000
*                                                                    */ 01322100
*%IFASMFR2B:;                                                           01323000
*/***** END OF SPECIFICATIONS ****************************************/ 01340100
*        %GOTO IFAL20;   /*                                             01341000
         AIF   (&RECTYPE EQ 20).IFAS020                                 01350000
         AIF   (&RECTYPE EQ 21).IFAS021                                 01360000
         AIF   (&RECTYPE EQ 22).IFAS022                         Y02034  01370000
         AIF   (&RECTYPE EQ 23).IFAS023                       @G743PJW  01380000
         AIF   (&RECTYPE EQ 24).IFAS024                           @T8A  01390000
         AIF   (&RECTYPE EQ 25).IFAS025                       @Y02BPSE  01400000
         AIF   (&RECTYPE EQ 26).IFAS026                         Y02120  01410000
.E5      ANOP                                                           01420000
         SPACE 3                                                        01430000
         MNOTE 4,'&RECTYPE INVALID RECORD TYPE SPECIFIED'               01440000
.CONTB   ANOP                                                           01450000
         MEXIT                                                          01460000
.IFAS020 ANOP                                                           01470000
         EJECT                                                          01480000
* JOB COMMENCEMENT RECORD WRITTEN WHEN A JOB IS INITIATED.              01490000
* LENGTH IS VARIABLE. MINIMUM OF 61 BYTES.                              01500000
*                                                                       01510000
         DS    0F        ALIGN TO FULL WORD BOUNDARY                    01520000
SMFRCD20 EQU   *         RECORD 20                                      01530000
SMF20LEN DS    BL2'0'    RECORD LENGTH                                  01540000
SMF20SEG DS    BL2'0'    SEGMENT DESCRIPTOR                             01550000
SMF20HDR EQU   *         HEADER SEGMENT                                 01560000
SMF20FLG DS    BL1'0'    HEADER FLAG BYTE                               01570000
SMF20RTY DS    BL1'0'    RECORD TYPE 20                                 01580000
SMF20TME DS    BL4'0'    TOD, USING TIME MACRO W/BIN. INTVL.            01590000
SMF20DTE DS    PL4'0000' DATE, PACKED/DEC FORM; 00YYDDDF                01600000
SMF20SID DS    CL4' '    SYSTEM ID                               Y02901 01610000
SMF20JBN DS    CL8' '    JOB NAME                                       01620000
SMF20RST DS    BL4'0'    READER START TIME                              01630000
SMF20RSD DS    PL4'0000' READER START DATE, PK/DEC FORM: 00YYDDDF       01640000
SMF20UID DS    CL8' '    USERID                                         01650000
SMF20RIN DS    BL2'0'                                          @G32FPRS 01660000
         ORG   SMF20RIN                                        @G32FPRL 01670000
SMF20RLO DS    BL2'0'    OFFSET TO RELOCATE SECTION            @G32FPRL 01680000
SMF20PGM DS    CL20' '   PROGRAMMERS NAME                               01690000
SMF20NAF DS    BL1'0'    NO. ACCOUNTING FIELDS                          01700000
SMF20ACT EQU   *         ACCOUNTING FIELDS                              01710000
* BEGINNING OF RELOCATE SECTION                                         01720000
* SMF20RLO IS ITS OFFSET FROM BEGINNING OF HEADER - SMF20HDR   @G32FPRL 01730000
SMF20RLA EQU   *         RELOCATABLE AREA                      @G32FPRL 01740000
SMF20RLS DS    BL2       SIZE OF RELOCATABLE AREA              @G32FPRL 01750000
SMF20GRP DS    CL8' '    RACF GROUP ID                         @G32FPRS 01760000
SMF20RUD DS    CL8' '    RACF USER ID                          @G32FPRS 01770000
SMF20TID DS    CL8' '    RACF TERMINAL ID                      @G32FPRS 01780000
         AGO   .CONTB                                                   01790000
.IFAS021 ANOP                                                           01800000
         EJECT                                                          01810000
         IGESMF21        Call DFP Macro To Expand Record           @01A 01820000
* Remove Inline Declares                                         30@01D 01830000
         AGO   .CONTB                                                   01840000
.IFAS022 ANOP                                                    Y02034 01850000
         EJECT                                                   Y02034 01860000
*  THIS RECORD IS WRITTEN AFTER EVERY IPL AND EACH TIME A VARY   Y02034 01870000
*  COMMAND IS PROCESSED FOR A CPU, CHANNEL OR STORAGE BOX,         @H5C 01880000
*  OR EACH TIME AN ACTIVATE COMMAND IS ISSUED.                     @H5A 01890000
*  LENGTH IS VARIABLE. MINIMUM OF 24.                            Y02034 01900000
*                                                                Y02034 01910000
         DS    0F                  ALIGN ON FULLWORD BDY         Y02034 01920000
SMFRCD22 EQU   *                   HEADER SEGMENT                Y02034 01930000
SMF22LEN DS    BL2                 RECORD LENGTH                 Y02034 01940000
SMF22SEG DS    BL2                 SEGMENT DESRIPTOR             Y02034 01950000
SMF22FLG DS    BL1                 HEADER FLAG BYTE              Y02034 01960000
SMF22RTY DS    BL1                 RECORD TYPE (22)              Y02034 01970000
SMF22TME DS    BL4                 TOD FROM TIME MACRO BINARY    Y02034 01980000
SMF22DTE DS    PL4                 DATE FROM TIME MACRO          Y02034 01990000
SMF22SID DS    CL4                 SYSTEM INDICATOR              Y02034 02000000
SMF22IND DS    BL2                 RECORD CREATOR INDICATOR      Y02034 02010000
*                                  X'0001' AT IPL                Y02034 02020000
*                                  X'0002' BY VARY ON            Y02034 02030000
*                                  X'0003' BY VARY OFF           Y02034 02040000
*                                  X'0007' BY VARY CHANNEL PATH ONLINE  02050000
*                                  OR OFFLINE                  @G860P27 02060000
*                                  X'0008' BY 3990 STATE CHANGE    @0KA 02070000
*                                  X'0009' BY ACTIVATE             @H5A 02080000
*                                  '0099' RECORD IS A CONTINUATION @0IA 02090000
SMF22ECT DS    BL2                 # OF ELEMENTS FOLLOWING       Y02034 02100000
SMF22RSC EQU   *                   RESOURCE ELEMENTS             Y02034 02110000
*                                  CPU ELEMENT                   Y02034 02120000
SMF22CFG DS    BL1                 CPU FLAGS                       @H4A 02130000
*                    WAS SMF22VFI, X'80'  NOW RESERVED             @LUD 02140000
SMF22CCP EQU   X'20'               CPU RECONFIG INDICATOR          @TEA 02150000
SMF22PID DS    BL1                 PROCESSOR ID X'01'            Y02034 02160000
SMF22CPN DS    BL2                 CPU MODEL #                   Y02034 02170000
SMF22CpuId DS 0XL2                 2 byte CPU Address              @LXA 02180000
         DS    BL1                                                 @LXC 02190000
SMF22CPA DS    BL1                 1 byte CPU Address, should not be   X02200000
                                   used. Use SMF22CpuId            @LXC 02210000
         ORG   SMF22RSC                                          Y02034 02220000
*                                  CHANNEL ELEMENT               Y02034 02230000
SMF22CSD DS    BL1                 CHANNEL SET ID              @G64APJW 02240000
SMF22CID DS    BL1                 CHANNEL ID X'02'              Y02034 02250000
SMF22CHN DS    BL2                 CHANNEL TYPE AND MODEL #      Y02034 02260000
SMF22CHA DS    BL1                 CHANNEL ADDRESS               Y02034 02270000
SMF22CPD DS    BL1                 CPU ADDRESS                   Y02034 02280000
         ORG   SMF22RSC                                          Y02034 02290000
*                                  STORAGE ELEMENT(MEMORY)       Y02034 02300000
*                                  When the storage frame number,       02310000
*                                  reported in SMF22PGL, is larger      02320000
*                                  than a full word (x'FFFFFFFF'),      02330000
*                                  a Storage Element Extension          02340000
*                                  section is generated in place of     02350000
*                                  this section.  The Storage           02360000
*                                  Element Extension section is         02370000
*                                  section ID 12, or x'0C'.             02380000
SMF22MFL DS    BL1                 MEMORY FLAGS                @ZMC1115 02390000
SMF22SKP EQU   X'80'               REAL MEMORY IS INTERLEAVED  @ZMC1115 02400000
SMF22IRX EQU   x'40'               Real storage status could not        02410000
*                                  be obtained                   @P5A   02420000
SMF22TID DS    BL1                 STORAGE ID X'03'              Y02034 02430000
SMF22PGL DS    F                   Block number of the first online     02440000
*                                  frame reported in this storage       02450000
*                                  element. When the block number       02460000
*                                  exceeds x'FFFFFFFF', it is reported  02470000
*                                  in the SMF22 Storage Element         02480000
*                                  Extension (ID=x'0C')          @P5C   02490000
SMF22NPG DS    F                   The number of online frames          02500000
*                                  reported in this storage             02510000
*                                  element                       @P5C   02520000
         ORG   SMF22RSC                                        @Y30AQPF 02530000
*                                  IPL ELEMENT                 @Y30AQPF 02540000
SMF22RV4 DS    BL1                 RESV                        @Y30AQPF 02550000
SMF22IID DS    BL1                 IPL ID X'04'                @Y30AQPF 02560000
SMF22ION DS    BL40                UNITS ONLINE AT IPL         @Y30AQPF 02570000
         ORG   SMF22RSC                                        @Y30AQPF 02580000
*                                  VARY S ONLINE ELEMENT       @Y30AQPF 02590000
SMF22RV5 DS    BL1                 RESV                        @Y30AQPF 02600000
SMF22NID DS    BL1                 VARY S ONLINE ID X'05'      @Y30AQPF 02610000
SMF22RVA DS    BL1                 RESV                        @Y30AQPF 02620000
SMF22NSI DS    BL3                 SUBSYSTEM ID                @Y30AQPF 02630000
         ORG   SMF22RSC                                        @Y30AQPF 02640000
*                                  VARY S OFFLINE ELEMTNT      @Y30AQPF 02650000
SMF22RV6 DS    BL1                 RESV                        @Y30AQPF 02660000
SMF22FID DS    BL1                 VARY S OFFLINE ID X'06'     @Y30AQPF 02670000
SMF22RVB DS    BL1                 RESV                        @Y30AQPF 02680000
SMF22FSI DS    BL3                 SUBSYSTEM ID                @Y30AQPF 02690000
         ORG   SMF22RSC                                        @G860P27 02700000
*                                  CHANNEL PATH SECTION        @G860P27 02710000
SMF22RV7 DS    BL1                 RESERVED                    @G860P27 02720000
SMF22UID DS    BL1                 CHANNEL PATH SECT ID X'07'  @G860P27 02730000
SMF22PAR DS    0CL256              CHANNEL PATH ID SECTION     @G860P27 02740000
SMF22CPI DS    256BL1              ARRAY OF 256 ENTRIES TO MAP EACH     02750000
*                                  UNIQUE CPID                 @GSE4P27 02760000
SMF22PFG EQU   X'80'               1=CPID VALID FOR THIS INSTALLATION.  02770000
*                                  IF 0, SMF22POW=0  AND SMF22PON=0     02780000
*                                                              @G860P27 02790000
SMF22POW EQU   X'40'               1=CPID OWNED BY THIS SYSTEM.         02800000
*                                  IF 1, SMF22PFG=1. IF 0, SMF22PON=0   02810000
*                                                              @G860P27 02820000
SMF22PON EQU   X'20'               1=CPID IS ONLINE. IF 1, SMF22PFG=1   02830000
*                                  AND SMF22POW=1              @G860P27 02840000
         ORG   SMF22RSC                                        @ZMC1361 02850000
*                                  VARY CHANNEL PATH SECTION   @ZMC1361 02860000
SMF22RV8 DS    BL1                 RESERVED                    @ZMC1361 02870000
SMF22RID DS    BL1                 CHANNEL PATH SECT ID X'08'  @ZMC1361 02880000
SMF22CNT DS    BL1                 COUNT OF CHPIDS IN SECTION  @ZMC1361 02890000
SMF22CHI DS    256BL1              CHANNEL PATH IDS            @ZMC1361 02900000
         ORG   SMF22RSC                                            @H3A 02910000
*                                  EXTENDED STORAGE ELEMENT        @H3A 02920000
         DS    BL1                 RESERVED                        @H3A 02930000
SMF22XID DS    BL1                 EXTENDED STORAGE ID X'09'       @H3A 02940000
SMF22XAD DS    F                   PAGE ADDR OF LOWEST PAGE IN     @H3A 02950000
*                                  EXTENDED STORAGE BLOCK          @H3A 02960000
SMF22XNP DS    F                   # OF PAGES IN EXTENDED STORAGE  @H3A 02970000
*                                  BLOCK                           @H3A 02980000
         ORG   SMF22RSC                                            @TCA 02990000
*                                  STORAGE CONTROL ELEMENT         @TCA 03000000
         DS    BL1                 RESERVED                        @TCA 03010000
SMF22GID DS    BL1                 STORAGE CONTROL ID X'0A'        @TCA 03020000
SMF22SSI DS    BL2                 SUBSYSTEM IDENTIFIER            @TCA 03030000
SMF22MDL DS    BL1                 SUBSYSTEM MODEL IDENTIFIER      @TCA 03040000
SMF22VOL DS    CL6                 ORIGINATING DEVICE VOLSER       @TCA 03050000
SMF22CUA DS    BL2                 ORIGINATING DEVICE ID           @TCA 03060000
SMF22CCA DS    BL1                 ORIGINATING DEVICE CCA          @TCA 03070000
SMF22DDC DS    BL1                 ORIGINATING DEVICE DDC          @TCA 03080000
SMF22PDC DS    BL1                 ORIGINATING DEVICE PRIOR DDC    @TCA 03090000
SMF22SCS DS    BL1                 SUBSYSTEM CACHING STATUS        @TCA 03100000
SMF22PCS DS    BL1                 SUBSYSTEM CACHING PRIOR STATUS  @TCA 03110000
SMF22SNV DS    BL1                 SUBSYSTEM NVS STATUS            @TCA 03120000
SMF22PNV DS    BL1                 SUBSYSTEM NVS PRIOR STATUS      @TCA 03130000
SMF22SDS DS    BL2                 ORIGINATING DEVICE STATUS       @TCA 03140000
SMF22PDS DS    BL2                 ORIG. DEVICE PRIOR STATUS       @TCA 03150000
SMF22ADS DS    BL1                 ORIG.DEVICE ADDITIONAL STAT @YA19861 03160000
SMF22SMT DS    BL1                 Multi-target PPRC status        @P7C 03170000
SMF22PAD DS    BL1                 ORIG.DEVICE PRIOR ADD.STAT  @YA19861 03180000
SMF22PMT DS    BL1                 Previous Multi-Target PPRC      @P7C 03190000
*                                  STATUS                          @P7C 03200000
SMF22CYS DS    BL1                 State of copy services          @03A 03210000
*                                  functions                       @03A 03220000
*                                  X'80' XRC active for the device @03A 03230000
*                                  X'40' PPRC active for the       @03A 03240000
*                                        device                    @03A 03250000
*                                  X'20' PPRC primary or secondary @03A 03260000
*                                        volume                    @03A 03270000
*                                     ON =Volume is PPRC secondary @03A 03280000
*                                     OFF=Volume is PPRC primary   @03A 03290000
*                                  X'10' Volume in XRC suspended   @03A 03300000
*                                        or quiesced state         @03A 03310000
*                                  X'08' PPRC volume is State      @03A 03320000
*                                        Change pending            @03A 03330000
*                                  X'04' Concurrent Copy is        @03A 03340000
*                                        active                    @03A 03350000
*                                  X'02' Flash Copy is active      @03A 03360000
SMF22PCY DS    BL1                 State of copy services functions     03370000
*                                  previous (bit meanings same as       03380000
*                                  SMF22CYS)                       @03A 03390000
SMF22CYL DS    F                   Device high cyl                 @04A 03400000
SMF22CYP DS    F                   Device high cyl previous        @04A 03410000
         ORG   SMF22RSC                                            @0IA 03420000
*                                  CONTINUATION SECTION            @0IA 03430000
SMF22L99 DS    BL1                 LENGTH OF SECTION               @0IA 03440000
SMF22CON DS    BL1                RECORD WILL BE CONTINUED ID '99' @0IA 03450000
         ORG   SMF22RSC                                            @LWA 03460000
*                                  CONFIG PCI Function ID section  @LWA 03470000
SMF22PCIHDR DS   0CL6              PCIF header                     @LWA 03480000
            DS   BL1               RESERVED                        @LWA 03490000
SMF22PCIID  DS   BL1               Element ID, X'0B' for PCIE      @LWA 03500000
            DS   BL2               RESERVED                        @LWA 03510000
SMF22PCICNT DS   BL2               Count of PFIDs in this section  @LWA 03520000
SMF22PFID   DS   256BL4            Array of PCI function Identifiers    03530000
         ORG   SMF22RSC                                            @LWA 03540000
*                                  Storage Element extension       @P5A 03550000
*                                  This element is analogous to the     03560000
*                                  storage element (ID=x'03'), but it   03570000
*                                  reports page frames above            03580000
*                                  x'FFFFFFFF'                     @P5A 03590000
SMF22XFL DS    BL1                 Flags                           @P5A 03600000
SMF22XKP EQU   X'80'               Real memory is interleaved      @P5A 03610000
SMF22XRX EQU   x'40'               Real storage status could not        03620000
*                                  be obtained                     @P5A 03630000
SMF22TXD DS    BL1                 STORAGE ID X'0C'                @P4A 03640000
SMF22XGL DS    CL8                 Block number of the first online     03650000
*                                  frame reported in this storage       03660000
*                                  element                         @P5A 03670000
         DS    CL4                 Reserved                        @P5A 03680000
SMF22XPG DS    F                   The number of online frames reported 03690000
*                                  in this storage element         @P5A 03700000
*                                                                       03710000
.* 111 LINES DELETED FROM REC 22 (TRANSFER OWNERSHIP TO SC1C3)  111@LSD 03720000
         EJECT                                                     @LSA 03730000
         IOSDSMFR         CALL SC1C3 TO EXPAND THE I/O CONFIGURATION    03740000
.*                               CHANGE ELEMENT OF REC TYPE 22     @LSA 03750000
         AGO   .CONTB                                            Y02034 03760000
.IFAS023 ANOP                                                  @G743PJW 03770000
*                                                              @G743PJW 03780000
* SMF TYPE 23 RECORD - SMF STATISTICS                          @G743PJW 03790000
*                                                              @G743PJW 03800000
* THIS RECORD IS WRITTEN AT USER SPECIFIED INTERVALS TO        @G743PJW 03810000
* RECORD SMF STATISTICS COLLECTED DURING THE LAST INTERVAL     @G743PJW 03820000
*                                                              @G743PJW 03830000
* THE RECORD LENGTH IS VARIABLE                                @G743PJW 03840000
*                                                              @G743PJW 03850000
SMFRCD23 DSECT ,                                               @G743PJW 03860000
*                                                              @G743PJW 03870000
*        SMF RECORD HEADER SEGMENT                             @G743PJW 03880000
*                                                              @G743PJW 03890000
SMF23LEN DS    H'0'      RECORD LENGTH                         @G743PJW 03900000
SMF23SEG DS    H'0'      SEGMENT DESCRIPTOR                    @G743PJW 03910000
SMF23FLG DS    BL1       HEADER FLAG BYTE                      @G743PJW 03920000
SMF23RTY DS    BL1       RECORD TYPE - 23                      @G743PJW 03930000
SMF23TME DS    CL4       RECORD WRITTEN TIME                   @G743PJW 03940000
SMF23DTE DS    CL4       RECORD WRITTEN DATE                   @G743PJW 03950000
SMF23SID DS    CL4       SYSTEM IDENTIFICATION                 @G743PJW 03960000
*                                                              @G743PJW 03970000
*        SELF DEFINING SECTION                                 @G743PJW 03980000
*                                                              @G743PJW 03990000
         DS    BL2       RESERVED                              @VS49902 04000000
SMF23SLS DS    0CL24     SELF DEFINING SECTION                 @G744PJW 04010000
SMF23POF DS    F         OFFSET TO PRODUCT SEGMENT             @VS49902 04020000
SMF23PLN DS    H         LENGTH OF PRODUCT SEGMENT             @G743PJW 04030000
SMF23PON DS    H         NUMBER OF PRODUCT SEGMENTS            @G743PJW 04040000
SMF23SOF DS    F         OFFSET TO SYSTEM SEGMENT              @VS49902 04050000
SMF23SLN DS    H         LENGTH OF SYSTEM SEGMENT              @G743PJW 04060000
SMF23SON DS    H         NUMBER OF SYSTEM SEGMENTS             @G743PJW 04070000
SMF23ROF DS    F         OFFSET TO SMF SEGMENT                 @VS49902 04080000
SMF23RLN DS    H         LENGTH OF SMF SEGMENT                 @G743PJW 04090000
SMF23RON DS    H         NUMBER OF SMF SEGMENTS                @G743PJW 04100000
SMF23LOF DS    F         Offset to Logstream SMF Segment           @07A 04110000
SMF23LLN DS    H         Length of Logstream SMF Segment           @07A 04120000
SMF23LON DS    H         Number of Logstream SMF Segments          @07A 04130000
SMF23NOF DS    F         OFFSET TO SPN SEGMENT                     @LVA 04140000
SMF23NLN DS    H         LENGTH OF SPN SEGMENT                     @LVA 04150000
SMF23NON DS    H         NUMBER OF SPN SEGMENTS                    @LVA 04160000
SMF23BOF DS    F         OFFSET TO BND SEGMENT                     @LVA 04170000
SMF23BLN DS    H         LENGTH OF BND SEGMENT                     @LVA 04180000
SMF23BON DS    H         NUMBER OF BND SEGMENTS                    @LVA 04190000
*                                                              @G743PJW 04200000
*        PRODUCT SECTION                                       @G743PJW 04210000
*                                                              @G743PJW 04220000
SMF23PRS DSECT ,                                               @G743PJW 04230000
SMF23TID DS    H         SUBTYPE ID - 0                        @G743PJW 04240000
SMF23RVN DS    CL2       RECORD VERSION - '01'                 @G743PJW 04250000
SMF23PNM DS    CL8       PRODUCT NAME - SMF                    @G743PJW 04260000
*                                                              @G743PJW 04270000
*        SYSTEM DEFINITION SEGMENT                             @G743PJW 04280000
*                                                              @G743PJW 04290000
SMF23SDS DSECT ,                                               @G743PJW 04300000
SMF23INT DS    CL6       INTERVAL IN HHMMSS                    @G743PJW 04310000
SMF23RLS DS    CL4       OPERATING SYSTEM RELEASE NUMBER       @G743PJW 04320000
SMF23OSL DS    CL8       MVS Product Name (copied from CVTPRODN)   @0JA 04330000
SMF23TOD DS    CL8       Time the STATUS function was scheduled    @LRA 04340000
*                        (in TOD format)                           @LRA 04350000
SMF23SYN DS    CL8       System name                               @02A 04360000
SMF23SYP DS    CL8       Sysplex name                              @02A 04370000
*                                                              @G743PJW 04380000
*        SMF STATISTICS SEGMENT                                @G743PJW 04390000
*                                                              @G743PJW 04400000
SMF23SMF DSECT ,                                               @G743PJW 04410000
SMF23BFW DS    F         NUMBER OF BUFFERS WRITTEN             @G743PJW 04420000
SMF23BFQ DS    F         MAXIMUM NUMBER OF FULL BUFFERS        @G743PJW 04430000
SMF23SUS DS    F         NUMBER OF TIMES SUSPENDED             @G743PJW 04440000
SMF23RCW DS    F         NUMBER OF RECORDS WRITTEN             @G743PJW 04450000
SMF23BFA DS    F         Amount of each Buffer Allocation Request  @0JA 04460000
SMF23BFT DS    F         Total amount of buffer storage currently  @0JA 04470000
*                        allocated (and recently used)             @LTC 04480000
SMF23BFH DS    F         High water mark of buffer storage         @0JA 04490000
*                        allocation                                @0JA 04500000
SMF23BFM DS    F         Buffer storage maximum in affect          @0JA 04510000
*                        (BufSizMax binary value)                  @LTA 04520000
SMF23BFL DS    F         Buffer warning level in affect            @0JA 04530000
*                        (BufUseWarn binary value)                 @LTA 04540000
SMF23SFG DC    4BL1'0'   Statistics Section Flags                  @05A 04550000
SMF23GRF EQU   X'80'     If bit is on, indicates that a            @05A 04560000
*                        4-byte field, FIXED(32), is used          @05A 04570000
*                        for the accumulator for SMF23NGR          @05A 04580000
*                        (i.e. Field wraps at 4 gigabytes).        @05A 04590000
*                        If bit is off, indicates that a           @05A 04600000
*                        8-byte field, FIXED(64), is used          @05A 04610000
*                        for the accumulator.                      @05A 04620000
SMF23PBF EQU   X'40'     If bit is on, indicates that a            @05A 04630000
*                        4-byte field, FIXED(32), is used          @05A 04640000
*                        for the accumulator for SMF23PBG          @05A 04650000
*                        (i.e. Field wraps at 4 gigabytes).        @05A 04660000
*                        If bit is off, indicates that a           @05A 04670000
*                        8-byte field, FIXED(64), is used          @05A 04680000
*                        for the accumulator.                      @05A 04690000
SMF23FRF EQU   X'20'     If bit is on, indicates that a            @05A 04700000
*                        4-byte field, FIXED(32), is used          @05A 04710000
*                        for the accumulator for SMF23NFR          @05A 04720000
*                        (i.e. Field wraps at 4 gigabytes).        @05A 04730000
*                        If bit is off, indicates that a           @05A 04740000
*                        8-byte field, FIXED(64), is used          @05A 04750000
*                        for the accumulator.                      @05A 04760000
SMF23PFF EQU   X'10'     If bit is on, indicates that a            @05A 04770000
*                        4-byte field, FIXED(32), is used          @05A 04780000
*                        for the accumulator for SMF23PFX          @05A 04790000
*                        (i.e. Field wraps at 4 gigabytes).        @05A 04800000
*                        If bit is off, indicates that a           @05A 04810000
*                        8-byte field, FIXED(64), is used          @05A 04820000
*                        for the accumulator.                      @05A 04830000
SMF231FF EQU   X'08'     If bit is on, indicates that a            @05A 04840000
*                        4-byte field, FIXED(32), is used          @05A 04850000
*                        for the accumulator for SMF231RF          @05A 04860000
*                        (i.e. Field wraps at 4 gigabytes).        @05A 04870000
*                        If bit is off, indicates that a           @05A 04880000
*                        8-byte field, FIXED(64), is used          @05A 04890000
*                        for the accumulator.                      @05A 04900000
SMF23NFF EQU   X'04'     If bit is on, indicates that a            @05A 04910000
*                        4-byte field, FIXED(32), is used          @05A 04920000
*                        for the accumulator for SMF23NRF          @05A 04930000
*                        (i.e. Field wraps at 4 gigabytes).        @05A 04940000
*                        If bit is off, indicates that a           @05A 04950000
*                        8-byte field, FIXED(64), is used          @05A 04960000
*                        for the accumulator.                      @05A 04970000
SMF23IOF EQU   X'02'     If bit is on, indicates that 4-byte       @05A 04980000
*                        fields, FIXED(32), are used for the       @05A 04990000
*                        accumulators (one per CPU) for SMF23NIO   @05A 05000000
*                        (i.e. value will decrease from the        @05A 05010000
*                        the last interval if one of the           @05A 05020000
*                        accumulators wrap at 4 gigabytes).        @05A 05030000
*                        If bit is off, indicates that             @05A 05040000
*                        8-byte fields, FIXED(64), are used        @05A 05050000
*                        for the accumulators.                     @05A 05060000
SMF23TCF EQU   X'01'     If bit is on, indicates that 4-byte       @05A 05070000
*                        fields, FIXED(32), are used for the       @05A 05080000
*                        accumulators (one per CPU) for SMF23TCB   @05A 05090000
*                        (i.e. value will decrease from the        @05A 05100000
*                        the last interval if one of the           @05A 05110000
*                        accumulators wrap at 4 gigabytes).        @05A 05120000
*                        If bit is off, indicates that             @05A 05130000
*                        8-byte fields, FIXED(64), are used        @05A 05140000
*                        for the accumulators.                     @05A 05150000
SMF23SRF EQU   X'80'     If bit is on, indicates that 4-byte       @05A 05160000
*                        fields, FIXED(32), are used for the       @05A 05170000
*                        accumulators (one per CPU) for SMF23SRB   @05A 05180000
*                        (i.e. value will decrease from the        @05A 05190000
*                        the last interval if one of the           @05A 05200000
*                        accumulators wrap at 4 gigabytes).        @05A 05210000
*                        If bit is off, indicates that             @05A 05220000
*                        8-byte fields, FIXED(64), are used        @05A 05230000
*                        for the accumulators.                     @05A 05240000
SMF23NGR DS    D'0'      Total number of getmain requests          @05A 05250000
*                        that have been issued                     @05A 05260000
*                        (see SMF23SFG bit 0 for more details)     @05A 05270000
SMF23PBG DS    D'0'      Total number of pages backed              @05A 05280000
*                        during getmain requests                   @05A 05290000
*                        that have been issued                     @05A 05300000
*                        (see SMF23SFG bit 1 for more details)     @05A 05310000
SMF23NFR DS    D'0'      Total number of fix requests              @05A 05320000
*                        that have been issued                     @05A 05330000
*                        for storage (address space only)          @05A 05340000
*                        below two gigabytes                       @05A 05350000
*                        (see SMF23SFG bit 2 for more details)     @05A 05360000
SMF23PFX DS    D'0'      Total number of frames that               @05A 05370000
*                        were requested to be fixed                @05A 05380000
*                        for storage (address space only)          @05A 05390000
*                        below two gigabytes                       @05A 05400000
*                        (see SMF23SFG bit 3 for more details)     @05A 05410000
SMF231RF DS    D'0'      Total number of first reference           @05A 05420000
*                        faults taken                              @05A 05430000
*                        (see SMF23SFG bit 4 for more details)     @05A 05440000
SMF23NRF DS    D'0'      Total number of non-first                 @05A 05450000
*                        reference faults taken                    @05A 05460000
*                        (see SMF23SFG bit 5 for more details)     @05A 05470000
SMF23NIO DS    D'0'      Total number of I/Os                      @05A 05480000
*                        (see SMF23SFG bit 6 for more details)     @05A 05490000
SMF23TCB DS    D'0'      Total number of unlocked TCB dispatches   @05A 05500000
*                        (see SMF23SFG bit 7 for more details)     @05A 05510000
SMF23SRB DS    D'0'      Total number of SRB dispatches            @05A 05520000
*                        (see SMF23SFG bit 8 for more details)     @05A 05530000
SMF23NGD DS    F'0'      Total number of getmain requests          @06A 05540000
*                        that have been issued                     @06A 05550000
*                        for this interval                         @06A 05560000
*                        (see SMF23NGR for the cumulative total)   @06A 05570000
SMF23PBD DS    F'0'      Total number of pages backed              @06A 05580000
*                        during getmain requests                   @06A 05590000
*                        that have been issued                     @06A 05600000
*                        for this interval                         @06A 05610000
*                        (see SMF23PBG for the cumulative total)   @06A 05620000
SMF23NFD DS    F'0'      Total number of fix requests              @06A 05630000
*                        that have been issued                     @06A 05640000
*                        for storage (address space only)          @06A 05650000
*                        below two gigabytes                       @06A 05660000
*                        for this interval                         @06A 05670000
*                        (see SMF23NFR for the cumulative total)   @06A 05680000
SMF23PFD DS    F'0'      Total number of frames that               @06A 05690000
*                        were requested to be fixed                @06A 05700000
*                        for storage (address space only)          @06A 05710000
*                        below two gigabytes                       @06A 05720000
*                        for this interval                         @06A 05730000
*                        (see SMF23PFX for the cumulative total)   @06A 05740000
SMF231RD DS    F'0'      Total number of first reference           @06A 05750000
*                        faults taken                              @06A 05760000
*                        for this interval                         @06A 05770000
*                        (see SMF231RF for the cumulative total)   @06A 05780000
SMF23NRD DS    F'0'      Total number of non-first                 @06A 05790000
*                        reference faults taken                    @06A 05800000
*                        for this interval                         @06A 05810000
*                        (see SMF23NRF for the cumulative total)   @06A 05820000
SMF23NID DS    D'0'      Total number of I/Os                      @06A 05830000
*                        for this interval                         @06A 05840000
*                        (see SMF23NIO for the cumulative total)   @06A 05850000
SMF23TCD DS    D'0'      Total number of unlocked TCB dispatches   @06A 05860000
*                        for this interval                         @06A 05870000
*                        (see SMF23TCB for the cumulative total)   @06A 05880000
SMF23SRD DS    D'0'      Total number of SRB dispatches            @06A 05890000
*                        for this interval                         @06A 05900000
*                        (see SMF23SRB for the cumulative total)   @06A 05910000
SMF23MBU DS    F'0'      The maximum number of bytes stored in the      05911000
*                        temporary buffer that is used during SMF       05912000
*                        initialization.                           @0BA 05913000
*                                                                  @LVA 05920000
*        SPN SEGMENT                                               @LVA 05930000
*                                                                  @LVA 05940000
SMF23SPN DSECT ,         Spin lock instrumentation data            @LVA 05950000
*                                                                  @LVA 05960000
*        BND SEGMENT                                               @LVA 05970000
*                                                                  @LVA 05980000
SMF23BND DSECT ,         Bind break instrumentation data           @LVA 05990000
*                                                                       06000000
*                                                                  @07A 06010000
*        SMF LOGSTREAM STATISTICS SECTION                          @07A 06020000
*                                                                  @07A 06030000
SMF23LGS DSECT           SMF Logstream Statistics Section          @07A 06040000
SMF23LSL DS    H         Logstream name length                     @07A 06050000
SMF23LSN DS    CL26      Logstream name                            @07A 06060000
SMF23LFA DS    F         Amount of each Buffer Allocation Request  @07A 06070000
*                        for this logstream                        @07A 06080000
SMF23LFT DS    F         Total Amount of Buffer Storage currently  @07A 06090000
*                        allocated (and recently used)             @07A 06100000
SMF23LFH DS    F         High water mark of buffer storage allocation   06110000
*                                                                  @07A 06120000
SMF23LFM DS    F         Buffer storage maximum in effect          @08C 06130000
*                        (DspSizMax binary value)                  @08C 06140000
SMF23LFL DS    F         Buffer warning level in effect            @08C 06150000
SMF23LFG DS    CL4       Various flags                             @07A 06160000
SMF23BWG EQU   X'80'     Buffer warning level from global option   @07A 06170000
SMF23DWG EQU   X'40'     Buffer storage maximum from global option @07A 06180000
SMF23CRQ EQU   X'20'     On-Compression requested for records written   06190000
*                        to this log stream by SMF configuration        06200000
*                        Off-Compression not requested             @LYA 06210000
SMF23CPR EQU   X'10'     On-Compression is Prepared. This log stream is 06220000
*                        ready to compress records (hardware is capable 06230000
*                        of using zEnterprise Data Compression(zEDC)),  06240000
*                        and all setup for compression succeeded Off-   06250000
*                        Hardware is not capable of using zEDC or       06260000
*                        compression setup failed (see IFA730I).   @LYA 06270000
SMF23CMP EQU   X'08'     On- Compression is Available. The last use of  06280000
*                        zEDC was successful and it indicated zEDC      06290000
*                        Expresses were available to satisfy            06300000
*                        compression requests Off- At last request-     06310000
*                        zEDC Expresses were not available to satisfy   06320000
*                        compression requests.                     @LYA 06330000
SMF23PFG EQU   X'04'     The current PERMFIX value for this log stream  06340000
*                        is the global PERMFIX value. In the SMF        06350000
*                        configuration, a log stream PERMFIX value was  06360000
*                        not specified.                            @LYA 06370000
*********************************************************************** 06380000
** SMF configuration parameter PERMFIX defines the maximum storage   ** 06390000
** SMF can keep registered to zEDC. The following four fields        ** 06400000
** represent amounts of storage registered to zEDC for this log      ** 06410000
** stream.                                                       @LYA** 06420000
*********************************************************************** 06430000
SMF23PFT DS    F         Total storage SMF is currently using for zEDC  06440000
*                        for this log stream. Value does not account    06450000
*                        for 1MB needed by each log stream using zEDC.  06460000
*                        Value may be up to 2MB greater than the        06470000
*                        defined PERMFIX value depending on usage. @L7A 06480000
SMF23PFM DS    F         Max storage SMF can use for zEDC for this log  06490000
*                        stream. Configuration defined PERMFIX value.   06500000
*                                                                  @LYA 06510000
SMF23PFH DS    F         High water mark of storage SMF has used for    06520000
*                        zEDC for this log stream connection       @LYA 06530000
SMF23CNT DS    0CL8      Log Block wrute counts on an SMF interval      06540000
*                        basis                                     @LYA 06550000
SMF23CWN DS    F         Number of log blocks written containing        06560000
*                        compressed records during this interval.  @LYA 06570000
SMF23NCN DS    F         Number of log blocks written containing non    06580000
*                        compressed records during this interval.  @LYA 06590000
SMF23BBC DS    D         zEDC uncompressed bytes total. For             06600000
*                        logstreams with compressed data, this field    06610000
*                        contains the total number of uncompressed      06620000
*                        bytes that zEDC successfully compressed        06630000
*                        during the interval.  For logstreams with no   06640000
*                        compressed data, this field will contain       06650000
*                        zeroes.                                   @P6A 06660000
SMF23BAC DS    D         zEDC compressed bytes total. For logstreams    06670000
*                        with compressed data, this field contains      06680000
*                        the total number of compressed bytes that      06690000
*                        were written to the logstream during the       06700000
*                        interval.  For logstreams with no compressed   06710000
*                        data, this field will contain zeroes.     @P6A 06720000
SMF23LHP DS    F         High water mark of the percentage of the       06730000
*                        buffer that is in use.                    @0AA 06740000
SMF23LCP DS    F         Current percentage of the buffer that is       06750000
*                        in use.                                   @0AA 06760000
         AGO   .CONTB                                          @G743PJW 06770000
.IFAS024 ANOP                                                      @T8A 06780000
         EJECT                                                     @T8A 06790000
         IAZSMFR 24      CALL SC141 TO EXPAND REC 24               @T8A 06800000
         AGO   .CONTB                                              @T8A 06810000
.IFAS025 ANOP                                                  @Y02BPSE 06820000
.* 45 LINES DELETED(MAP OF REC 25)TO TRANSFER OWNERSHIP TO SC141 45@T7D 06830000
         EJECT                                                 @Y02BPSE 06840000
         IAZSMFR 25      CALL SC141 TO EXPAND REC 25               @T7A 06850000
         AGO   .CONTB                                                   06860000
.IFAS026 ANOP                                                    Y02120 06870000
.* 185 LINES DELETED(MAP OF REC 26) TO XFER OWNERSHIP TO SC141  185@T7D 06880000
         EJECT                                                   Y02120 06890000
         IAZSMFR 26      CALL SC141 TO EXPAND REC 26               @T7A 06900000
         AGO   .CONTB                                            Y02120 06910000
         MEND       */                                                  06920000
*%IFAL20: INCLIAZ='';             /* INIT SWITCH FOR IAZ MACROS  @T7A*/ 06930001
*%IF IBM_CBGENC = 'YES' %THEN %GOTO IFAL20A;                  /* @LZA*/ 06931001
*        %IF IFAR20='' %THEN %GOTO IFAL21;                    /* @LZC*/ 06940001
*%IFAL20A:;                                                   /* @LZA*/ 06941001
*   DCL 1 SMFRCD20 BASED(SMF20PTR) BDY(WORD),                           06950001
*/* RECORD TYPE 20 - JOB INITIATION                                  */ 06960001
*/* WRITTEN BY JOB INITIATION                                        */ 06970001
*        3 SMF20LEN FIXED(15),    /* RDW RECORD LENGTH               */ 06980001
*        3 SMF20SEG FIXED(15),    /* RDW SEGMENT DESCRIPTOR          */ 06990001
*        3 SMF20FLG BIT(8),       /* OPERATING ENVIRONMENT           */ 07000001
*        3 SMF20RTY FIXED(8),     /* RECORD TYPE 20                  */ 07010001
*        3 SMF20TME FIXED(31) BDY(HWORD), /* TOD RECORD WRITTEN      */ 07020001
*        3 SMF20DTE CHAR(4),      /* DATE RECORD WRITTEN             */ 07030001
*        3 SMF20SID CHAR(4),      /* SYSTEM ID FROM INSTALLATION     */ 07040001
*        3 SMF20JBN CHAR(8),      /* JOB NAME                        */ 07050001
*        3 SMF20RST FIXED(31) BDY(HWORD),/*READER START TIME(.01 SEC)*/ 07060002
*        3 SMF20RSD CHAR(4),      /* READER START DATE               */ 07070001
*        3 SMF20UIF CHAR(8),      /* USER ID FIELD                   */ 07080001
*         5 SMF20UID CHAR(8),                                           07090001
*        3 SMF20RIN FIXED(15) BDY(HWORD),            /*      @G32FPRL*/ 07100001
*          5 SMF20RLO FIXED(15) BDY(HWORD), /* OFFSET FROM BEGINNING    07110001
*                                             OF RECORD TO RELOCATABLE  07120001
*                                             AREA           @G32FPRL*/ 07130001
*        3 SMF20PGM CHAR(20),     /* PROGRAMMER'S NAME               */ 07140001
*        3 SMF20NAF FIXED(8),     /* # OF ACCT FIELDS FOLLOWING      */ 07150001
*        3 SMF20ACT CHAR(*);      /* ACCOUNTING FIELDS       @G32FPRL*/ 07160001
*   DCL 1 SMF20AFD BASED BDY(BYTE), /* ACCT SECTION                  */ 07170001
*        3 SMF20ANC PTR(8),       /* # OF CHAR IN THIS ACCT FIELD    */ 07180001
*        3 SMF20BCD CHAR(*);      /* ACCT FIELD CHARACTERS           */ 07190001
*        /* RELOCATABLE AREA  @G32FPRL*/                                07200001
*   DCL 1 SMF20RLA BASED(ADDR(SMF20FLG)+SMF20RLO) BDY(BYTE),            07210001
*        3 SMF20RLS FIXED(15) BDY(BYTE), /* SIZE OF RELOCATABLE AREA    07220001
*                                                            @G32FPRL*/ 07230001
*        3 SMF20GRP CHAR(8),      /* RACF GROUP ID           @G32FPRS*/ 07240001
*        3 SMF20RUD CHAR(8),      /* RACF USER ID            @G32FPRS*/ 07250001
*        3 SMF20TID CHAR(8);      /* RACF TERMINAL ID        @G32FPRS*/ 07260001
*%IFAL21:;                                                    /* @LZC*/ 07270001
*        %IF IFAR21='' %THEN %GOTO IFAL22;                    /* @LZC*/ 07271001
*                                   /* Remove Inline Declares  31@01D*/ 07280001
*%IFAL21A:;                                                   /* @LZA*/ 07281001
*%INCLUDE SYSLIB(IGESMF21) NOSEG;   /* Call DFP to Expand Record @01A*/ 07290001
*%IFAL22:;                                                    /* @LZC*/ 07300001
*%IF IBM_CBGENC = 'YES' %THEN %GOTO IFAL22A;                  /* @LZA*/ 07300101
*        %IF IFAR22='' %THEN %GOTO IFAL23;                    /* @LZC*/ 07301001
*%IFAL22A:;                                                   /* @LZA*/ 07302001
*   DCL 1 SMFRCD22 BASED(SMF22PTR) BDY(WORD),                           07310001
*/* RECORD TYPE 22 - CPU, CHANNEL, STORAGE CONFIGURATION and PFID    */ 07320001
*/* WRITTEN AT IPL AND BY VARY ON OR OFF WHENEVER A CPU, CHANNEL,    */ 07330001
*/* STORAGE BOX, or PFID IS CHANGED. OR WRITTEN WHEN A DYNAMIC I/O   */ 07340001
*/* CONFIGURATION CHANGE IS PERFORMED VIA THE ACTIVATE COMMAND.  @LWC*/ 07350001
*        3 SMF22LEN FIXED(15),    /* RDW RECORD LENGTH               */ 07360001
*        3 SMF22SEG FIXED(15),    /* RDW SEGMENT DESCRIPTOR          */ 07370001
*        3 SMF22FLG BIT(8),       /* OPERATING ENVIRONMENT           */ 07380001
*        3 SMF22RTY FIXED(8),     /* RECORD TYPE 22                  */ 07390001
*        3 SMF22TME FIXED(31) BDY(HWORD), /* TOD RECORD WRITTEN      */ 07400001
*        3 SMF22DTE CHAR(4),      /* DATE RECORD WRITTEN             */ 07410001
*        3 SMF22SID CHAR(4),      /* SYSTEM ID FROM INSTALLATION     */ 07420001
*        3 SMF22IND FIXED(15),    /* RECORD CREATOR INDICATOR           07430001
*                                    X'0001' AT IPL                     07440001
*                                    X'0002' BY VARY ON                 07450001
*                                    X'0003' BY VARY OFF                07460001
*                                    X'0007' BY VARY CHANNEL PATH       07470001
*                                    ONLINE OR OFFLINE       @G860P27   07480001
*                                    X'0008' BY 3990 STATE CHANGE @0KA  07490001
*                                    X'0009' FOR AN I/O                 07500001
*                                    CONFIGURATION CHANGE        @H5C   07510001
*                                '0099' RECORD IS A CONTINUATION @0IA*/ 07520001
*        3 SMF22ECT FIXED(15);    /* # RESOURCE ELEMENTS FOLLOWING   */ 07530001
*   DCL 1 SMF22CPU BASED BDY(HWORD), /* CPU ELEMENT                  */ 07540001
*        3 SMF22CFG CHAR(1),      /* CPU FLAGS                   @H4C*/ 07550001
*          5 *        BIT(1),     /* RESERVED, WAS SMF22VFI      @LUC*/ 07560001
*          5    *        BIT(1),     /* RESERVED                 @TEA*/ 07570001
*          5    SMF22CCP BIT(1),     /* CPU RECONFIG INDICATOR   @TEA*/ 07580001
*          5    *        BIT(5),     /* RESERVED                 @TEC*/ 07590001
*        3 SMF22PID FIXED(8),     /* ELEMENT ID, X'01' FOR CPU       */ 07600001
*        3 SMF22CPN CHAR(2),      /* CPU MODEL #                     */ 07610001
*        3 SMF22CpuId Char(2),    /* 2 byte CPU Address          @LXA*/ 07620001
*          5 *        CHAR(1),    /*                             @LXC*/ 07630001
*          5 SMF22CPA CHAR(1);    /* 1 byte CPU Address, should not     07640001
*                                    be used. Use SMF22CpuId     @LXC*/ 07650001
*   DCL 1 SMF22CHL BASED BDY(HWORD), /* CHANNEL ELEMENT              */ 07660001
*        3 SMF22CSD CHAR(1),      /* CHANNEL SET ID        @G64APJW  */ 07670001
*        3 SMF22CID FIXED(8),     /* ELEMENT ID, X'02' FOR CHANNEL   */ 07680001
*        3 SMF22CHN CHAR(2),      /* CHANNEL TYPE AND MODEL #        */ 07690001
*        3 SMF22CHA CHAR(1),      /* CHANNEL ADDRESS                 */ 07700001
*        3 SMF22CPD CHAR(1);      /* CPU ADDRESS                     */ 07710001
*   DCL 1 SMF22STR BASED BDY(HWORD), /* STORAGE ELEMENT                 07720001
*                                    Note: Status for frame numbers     07730001
*                                    above x'FFFFFFFF' is reported      07740001
*                                    in the Storage Element             07750001
*                                    Extension (ID=x'0C')        @P5C*/ 07760001
*        3 SMF22MFL CHAR(1),      /* MEMORY FLAGS            @ZMC1115*/ 07770001
*           4 SMF22SKP BIT(1),    /* REAL MEMORY IS INTERLEAVED         07780001
*                                                            @ZMC1115*/ 07790001
*           4 SMF22IRX BIT(1),    /* Real storage status could not      07800001
*                                    be obtained                 @P5A*/ 07810001
*        3 SMF22TID FIXED(8),     /* ELEMENT ID, X'03' FOR STORAGE   */ 07820001
*        3 SMF22PGL FIXED(32) BDY(HWORD),    /* Block number of the     07830001
*                                    first online frame reported in     07840001
*                                    this storage element. When the     07850001
*                                    block number exceeds               07860001
*                                    x'FFFFFFFF', it is reported in     07870001
*                                    the SMF22 Storage Element          07880001
*                                    Extension (ID=x'0C')        @P5C*/ 07890001
*        3 SMF22NPG FIXED(32) BDY(HWORD);    /* The number of online    07900001
*                                    frames reported in this storage    07910001
*                                    element                     @P5C*/ 07920001
*   DCL 1  SMF22IPL BASED BDY(BYTE),   /* IPL ELEMENT        @Y30AQPF*/ 07930001
*        3 SMF22RV4 CHAR(1),       /*RESV                    @Y30AQPF*/ 07940001
*        3 SMF22IID FIXED(8),      /* ELEMENT ID, X'04' FOR IPL         07950001
*                                       @Y30AQPF*/                      07960001
*        3 SMF22ION BIT(320);      /* SS/I UNITS ONLINE AT IPL          07970001
*                                      @Y30AQPF*/                       07980001
*   DCL 1 SMF22VON BASED BDY(BYTE), /* VARY S ONLINE ELEMENT @Y30AQPF*/ 07990001
*        3 SMF22RV5 CHAR(1),       /* RESERVED               @Y30AQPF*/ 08000001
*        3 SMF22NID FIXED(8),      /* ELEMENT ID, X'05' FOR VARY ONLI   08010001
*                                      @Y30AQPF*/                       08020001
*        3 SMF22RVA CHAR(1),       /* RESERVED               @Y30AQPF*/ 08030001
*        3 SMF22NSI CHAR(3);       /* SUBSYSTEM ID           @Y30AQPF*/ 08040001
*   DCL 1 SMF22VOF BASED BDY(BYTE), /* VARY S OFFLINE ELEMT  @Y30AQPF*/ 08050001
*        3 SMF22RV6 CHAR(1),       /* RESERVED               @Y30AQPF*/ 08060001
*        3 SMF22FID FIXED(8),      /* ELEMENT ID, X'06' FOR VARY OFFL   08070001
*                                      @Y30AQPF*/                       08080001
*        3 SMF22RVB CHAR(1),       /* RESERVED               @Y30AQPF*/ 08090001
*        3 SMF22FSI CHAR(3);       /* SUBSYSTEM ID           @Y30AQPF*/ 08100001
*   DCL 1 SMF22CHP BASED BDY(BYTE), /* CHANNEL PATH SECTION  @G860P27*/ 08110001
*        3 SMF22RV7 CHAR(1),       /* RESERVED               @G860P27*/ 08120001
*        3 SMF22UID FIXED(8),      /* ELEMENT ID, X'07' FOR CHANNEL     08130001
*                                     PATH SECTION           @G860P27*/ 08140001
*        3 SMF22PAR CHAR(256),    /* CHANNEL PATH ID SECTION @G860P27*/ 08150001
*        4 SMF22CPI(256) CHAR(1),  /* ARRAY OF 256 TO MAP EACH UNIQUE   08160001
*                                     CPID                   @G860P27*/ 08170001
*        5 SMF22PFG BIT(1),        /* 1=CPID VALID FOR THIS             08180001
*                                     INSTALLATION. IF 0, SMF22POW=0    08190001
*                                     AND SMF22PON=0         @G860P27*/ 08200001
*        5 SMF22POW BIT(1),        /* 1=CPID OWNED BY THIS              08210001
*                                     SYSTEM. IF 1, SMF22PFG=1. IF 0,   08220001
*                                         SMF22PON=0         @G860P27*/ 08230001
*        5 SMF22PON BIT(1);       /* 1=CPID IS ONLINE. IF 1, SMF22PFG=1 08240002
*                                     AND SMF22POW=1         @G860P27*/ 08250001
*   DCL 1 SMF22CHR BASED BDY(BYTE), /* VARY CHANNEL PATH SECTION        08260001
*                                                            @ZMC1361*/ 08270001
*        3 SMF22RV8 CHAR(1),       /* RESERVED               @ZMC1361*/ 08280001
*        3 SMF22RID FIXED(8),      /* ELEMENT ID, X'08' FOR CHANNEL     08290001
*                                     PATH SECTION           @ZMC1361*/ 08300001
*        3 SMF22CNT FIXED(8),      /* COUNT OF CHPID'S IN THIS          08310001
*                                     SECTION                @ZMC1361*/ 08320001
*        3 SMF22CHI (*) CHAR(1);   /* CHANNEL PATH ID        @ZMC1361*/ 08330001
*   DCL 1 SMF22XST BASED BDY(HWORD), /* EXTENDED STORAGE ELEMENT @H3A*/ 08340001
*        3 * CHAR(1),              /* RESERVED                   @H3A*/ 08350001
*        3 SMF22XID FIXED(8),     /* ELEMENT ID, X'09' FOR EXTENDED     08360001
*                                    STORAGE                     @H3A*/ 08370001
*        3 SMF22XAD FIXED(31) BDY(HWORD),/* PAGE ADDRESS OF LOWEST PAGE 08380001
*                     IN THIS EXTENDED STORAGE BLOCK             @H3A*/ 08390001
*        3 SMF22XNP FIXED(31) BDY(HWORD);    /* # OF PAGES IN EXTENDED  08400001
*                                          STORAGE BLOCK         @H3A*/ 08410001
*   DCL 1 SMF22SCE BASED BDY(HWORD), /* STORAGE CONTROL ELEMENT  @TCA*/ 08420001
*        3 * CHAR(1),              /* RESERVED                   @TCA*/ 08430001
*        3 SMF22GID FIXED(8),     /* ELEMENT ID, X'0A' FOR STORAGE      08440001
*                                    CONTROL                     @TCA*/ 08450001
*        3 SMF22SSI CHAR(2),      /* SUBSYSTEM IDENTIFIER        @TCA*/ 08460001
*        3 SMF22MDL CHAR(1),      /* SUBSYSTEM MODEL IDENTIFIER  @TCA*/ 08470001
*        3 SMF22VOL CHAR(6),      /* ORIGINATING DEVICE VOLSER   @TCA*/ 08480001
*        3 SMF22CUA CHAR(2),      /* ORIGINATING DEVICE ID       @TCA*/ 08490001
*        3 SMF22CCA CHAR(1),      /* ORIGINATING DEVICE CCA      @TCA*/ 08500001
*        3 SMF22DDC CHAR(1),      /* ORIGINATING DEVICE DDC      @TCA*/ 08510001
*        3 SMF22PDC CHAR(1),      /* ORIGINATING DEV PRIOR DDC   @TCA*/ 08520001
*        3 SMF22SCS BIT(8),       /* SUBSYSTEM CACHING STATUS    @TCA*/ 08530001
*        3 SMF22PCS BIT(8),       /* SUBSYS CACHING PRIOR STATUS @TCA*/ 08540001
*        3 SMF22SNV BIT(8),       /* SUBSYSTEM NVS STATUS        @TCA*/ 08550001
*        3 SMF22PNV BIT(8),       /* SUBSYSTEM NVS PRIOR STATUS  @TCA*/ 08560001
*        3 SMF22SDS BIT(16),      /* ORIGINATING DEVICE STATUS   @TCA*/ 08570001
*        3 SMF22PDS BIT(16),      /* ORIG. DEVICE PRIOR STATUS   @TCA*/ 08580001
*        3 SMF22ADS BIT(8),         /* ORIGINATING DEVICE ADDITIONAL    08590001
*                                      STATUS               @YA19861A*/ 08600001
*        3 SMF22SMT BIT(8),       /* Multi-target PPRC status    @P7C*/ 08610001
*        3 SMF22PAD BIT(8),         /* ORIGINATING DEVICE PRIOR         08620001
*                                      ADDITIONAL STATUS    @YA19861A*/ 08630001
*        3 SMF22PMT BIT(8),       /* Previous multi-target PPRC status  08640001
*                                                                @P7C*/ 08650001
*        3 SMF22CYS BIT(8),       /* State of copy services             08660001
*                                    functions                          08670001
*                                    X'80' XRC active for the device    08680001
*                                    X'40' PPRC active for the          08690001
*                                          device                       08700001
*                                    X'20' PPRC primary or secondary    08710001
*                                          volume                       08720001
*                                       ON =Volume is PPRC secondary    08730001
*                                       OFF=Volume is PPRC primary      08740001
*                                    X'10' Volume in XRC suspended      08750001
*                                          or quiesced state            08760001
*                                    X'08' PPRC volume is State         08770001
*                                          Change pending               08780001
*                                    X'04' Concurrent Copy is           08790001
*                                          active                       08800001
*                                    x'02' Flash Copy is active  @03A*/ 08810001
*        3 SMF22PCY BIT(8),       /* State of copy services functions   08820001
*                                    previous (bit meanings same as     08830001
*                                    SMF22CYS)                   @04C*/ 08840001
*        3 SMF22CYL FIXED(32) BDY(BYTE), /* Device high cyl      @04A*/ 08850001
*        3 SMF22CYP FIXED(32) BDY(BYTE); /* Device high cyl             08860001
*                                           previous             @04A*/ 08870001
*   DCL 1 SMF22STX BASED BDY(HWORD), /* Storage Element Extension       08880001
*                                    This section is generated in       08890001
*                                    place of the Storage Section       08900001
*                                    (ID= 3) when the storage frame     08910001
*                                    number, reported in SMF22XGL, is   08920001
*                                    larger than a full word            08930001
*                                    (x'FFFFFFFF').              @P5A*/ 08940001
*        3 SMF22XFL CHAR(1),      /* Flags                       @P5A*/ 08950001
*           4 SMF22XKP BIT(1),    /* Real memory is interleaved  @P5A*/ 08960001
*           4 SMF22XRX BIT(1),    /* Real storage status could not      08970001
*                                    be obtained                 @P5A*/ 08980001
*        3 SMF22TXD FIXED(8),     /* Element ID, X'0C'           @P5A*/ 08990001
*        3 SMF22XGL CHAR(8),      /* Block number of the first online   09000001
*                                    frame reported in this             09010001
*                                    storage element             @P5A*/ 09020001
*        3 *        CHAR(4),      /* Reserved                    @P5A*/ 09030001
*        3 SMF22XPG FIXED(32) BDY(HWORD); /* The number of online pages 09040001
*                                    reported in this storage           09050001
*                                    element                     @P5C*/ 09060001
*%IF IBM_CBGENC = 'YES' %THEN %GOTO IFAL22B;                  /* @LZA*/ 09061001
*  %INCLUDE SYSLIB(IOSDSMFR) NOSEG; /* INCLUDE IOS TYPE 22 MACRO @LSA*/ 09070001
*%IFAL22B:;                                                   /* @LZA*/ 09071001
*/* 123 LINES DELETED FROM RECORD TYPE 22 MAP (I/O CONFIGURATION        09080001
*       CHANGE ELEMENT(TO TRANSFER OWNERSHIP TO SC1C3)        123@LSD*/ 09090001
*   DCL 1 SMF22CIS BASED BDY(BYTE), /* CONTINUATION SECTION      @0IA*/ 09100001
*        3 SMF22L99 FIXED(8),       /* LENGTH OF SECTION         @0IA*/ 09110001
*        3 SMF22CON FIXED(8);  /* RECORD TO BE CONTINUED ID '99' @0IA*/ 09120001
*   DCL 1 SMF22PCIF BASED BDY(BYTE), /* CONFIG PCI function ID SECTION  09130001
*                                                                @LWA*/ 09140001
*        2 SMF22PCIHdr   CHAR(6),  /* PCIF header                @LWA*/ 09150001
*          3 *           CHAR(1),  /* Reserved                   @LWA*/ 09160001
*          3 SMF22PCIID  FIXED(8), /* Element ID, X'0B' for PCIE @LWA*/ 09170001
*          3 *           CHAR(2),  /* Reserved                   @LWA*/ 09180001
*          3 SMF22PCICNT FIXED(16) BDY(BYTE), /* Count of PFIDs in this 09190001
*                                     section                    @LWA*/ 09200001
*        2 SMF22PFID(*) FIXED(32) BDY(BYTE); /* Array of PCI function   09210001
*                                     Identifiers (PFIDs)        @LWA*/ 09220001
*%IFAL23:;                                                    /* @LZC*/ 09230001
*%IF IBM_CBGENC = 'YES' %THEN %GOTO IFAL23A;                  /* @LZA*/ 09230101
*        %IF IFAR23='' %THEN %GOTO IFAL25;                    /* @LZC*/ 09231001
*%IFAL23A:;                                                   /* @LZA*/ 09232001
*/***********************************************************@G743PJW*/ 09240001
*/*                                                          @G743PJW*/ 09250001
*/* SMF TYPE 23 RECORD - SMF STATISTICS                      @G743PJW*/ 09260001
*/*                                                          @G743PJW*/ 09270001
*/* THIS RECORD IS WRITTEN AT USER SPECIFIED INTERVALS       @G743PJW*/ 09280001
*/* TO RECORD SMF STATISTICS COLLECTED DURING THE INTERVAL.  @G743PJW*/ 09290001
*/*                                                          @G743PJW*/ 09300001
*/* THE RECORD LENGTH IS VARIABLE.                           @G743PJW*/ 09310001
*/*                                                          @G743PJW*/ 09320001
*/***********************************************************@G743PJW*/ 09330001
*DCL 1 SMFRCD23 BASED(SMF23PTR),   /*                        @G743PJW*/ 09340001
*      2 SMF23LEN FIXED(15),       /* RECORD LENGTH          @G743PJW*/ 09350001
*      2 SMF23SEG FIXED(15),       /* SEGMENT DESCRIPTOR     @G743PJW*/ 09360001
*      2 SMF23FLG CHAR(1),         /* HEADER FLAG BYTE       @G743PJW*/ 09370001
*      2 SMF23RTY FIXED(8),        /* RECORD TYPE - 23       @G743PJW*/ 09380001
*      2 SMF23TME FIXED(31) BDY(HWORD),  /* RECORD WRITTEN TIME         09390001
*                                                            @G743PJW*/ 09400001
*      2 SMF23DTE CHAR(4),         /* RECORD WRITTEN DATE YYDDDF        09410001
*                                                            @G743PJW*/ 09420001
*      2 SMF23SID CHAR(4),         /* SYSTEM IDENTIFICATION  @G743PJW*/ 09430001
*          /*  SELF DEFINING SECTION    @G743PJW*/                      09440001
*      2 * FIXED(15),              /* RESERVED               @VS49902*/ 09450001
*      2 SMF23SLS,                 /*                        @G743PJW*/ 09460001
*        3 SMF23POF FIXED(31),     /* OFFSET TO PRODUCT SEGMENT         09470001
*                                                            @VS49902*/ 09480001
*        3 SMF23PLN FIXED(15),     /* LENGTH OF PRODUCT SEGMENT         09490001
*                                                            @G743PJW*/ 09500001
*        3 SMF23PON FIXED(15),     /* NUMBER OF PRODUCT SEGMENTS        09510001
*                                                            @G743PJW*/ 09520001
*        3 SMF23SOF FIXED(31),     /* OFFSET TO SYSTEM SEGMENT          09530001
*                                                            @VS49902*/ 09540001
*        3 SMF23SLN FIXED(15),     /* LENGTH OF SYSTEM SEGMENT          09550001
*                                                            @G743PJW*/ 09560001
*        3 SMF23SON FIXED(15),     /* NUMBER OF SYSTEM SEGMENTS         09570001
*                                                            @G743PJW*/ 09580001
*        3 SMF23ROF FIXED(31),     /* OFFSET TO SMF SEGMENT  @VS49902*/ 09590001
*        3 SMF23RLN FIXED(15),     /* LENGTH OF SMF SEGMENT  @G743PJW*/ 09600001
*        3 SMF23RON FIXED(15),     /* NUMBER OF SMF SEGMENTS     @LVC*/ 09610001
*        3 SMF23LOF FIXED(31),     /* Offset to Logstream SMF Segment   09620001
*                                                                @07A*/ 09630001
*        3 SMF23LLN FIXED(15),     /* Length of Logstream SMF Segment   09640001
*                                                                @07A*/ 09650001
*        3 SMF23LON FIXED(15),     /* Number of Logstream SMF Segments  09660001
*                                                                @07A*/ 09670001
*        3 SMF23NOF FIXED(31),     /* OFFSET TO SPN SEGMENT      @LVA*/ 09680001
*        3 SMF23NLN FIXED(15),     /* LENGTH OF SPN SEGMENT      @LVA*/ 09690001
*        3 SMF23NON FIXED(15),     /* NUMBER OF SPN SEGMENTS     @LVA*/ 09700001
*        3 SMF23BOF FIXED(31),     /* OFFSET TO BND SEGMENT      @LVA*/ 09710001
*        3 SMF23BLN FIXED(15),     /* LENGTH OF BND SEGMENT      @LVA*/ 09720001
*        3 SMF23BON FIXED(15);     /* NUMBER OF BND SEGMENTS     @LVA*/ 09730001
*           /* PRODUCT SECTION   @G743PJW*/                             09740001
*  DCL 1 SMF23PRS BASED(ADDR(SMFRCD23)+SMF23POF), /*         @G743PJW*/ 09750001
*        2 SMF23TID FIXED(15),     /* SUBTYPE ID - 0         @G743PJW*/ 09760001
*        2 SMF23RVN CHAR(2),       /* RECORD VERSION NUMBER - 01        09770001
*                                                            @G743PJW*/ 09780001
*        2 SMF23PNM CHAR(8);       /* PRODUCT NAME - SMF     @G743PJW*/ 09790001
*           /* SYSTEM DEFINITION SEGMENT    @G743PJW*/                  09800001
*  DCL 1 SMF23SDS BASED(ADDR(SMFRCD23)+SMF23SOF),  /*        @G743PJW*/ 09810001
*        2 SMF23INT CHAR(6),       /* INTERVAL - HHMMSS      @G743PJW*/ 09820001
*        2 SMF23RLS CHAR(4),       /* OPERATING SYSTEM RELEASE          09830001
*                                     NUMBER                 @G743PJW*/ 09840001
*        2 SMF23OSL CHAR(8),        /* MVS Product Name (copied from    09850001
*                                      CVTPRODN)                 @0JA*/ 09860001
*        2 SMF23TOD CHAR(8),        /* Time the STATUS function was     09870001
*                                      scheduled (in TOD format) @LRA*/ 09880001
*        2 SMF23SYN CHAR(8),              /* System name         @02A*/ 09890001
*        2 SMF23SYP CHAR(8);              /* Sysplex name        @02A*/ 09900001
*           /*  SMF STATISTICS SECTION          @G743PJW*/              09910001
*  DCL 1 SMF23SMF BASED(ADDR(SMFRCD23)+SMF23ROF),       /*   @G743PJW*/ 09920001
*        2 SMF23BFW FIXED(31),     /* # OF BUFFERS WRITTEN   @G743PJW*/ 09930001
*        2 SMF23BFQ FIXED(31),     /* MAX # OF FULL BUFFERS  @G743PJW*/ 09940001
*        2 SMF23SUS FIXED(31),     /* # OF TIMES SUSPENDED   @G743PJW*/ 09950001
*        2 SMF23RCW FIXED(31),     /* # OF RECORDS WRITTEN   @G743PJW*/ 09960001
*        2 SMF23BFA FIXED(31),      /* Amount of each Buffer Allocation 09970001
*                                      Request                   @0JA*/ 09980001
*        2 SMF23BFT FIXED(31),      /* Total Amount of Buffer Storage   09990001
*                                      currently allocated (and         10000001
*                                      recently used)            @LTC*/ 10010001
*        2 SMF23BFH FIXED(31),      /* High water mark of fuffer        10020001
*                                      storage allocation        @0JA*/ 10030001
*        2 SMF23BFM FIXED(31),      /* Buffer storage maximum in affect 10040001
*                                      (BufSizMax binary value)  @LTC*/ 10050001
*        2 SMF23BFL FIXED(31),      /* Buffer warning level in affect   10060001
*                                      (BufUseWarn binary value) @05C*/ 10070001
*        2 SMF23SFG CHAR(4),  /* Statistics Section Flags        @05A*/ 10080001
*          3 SMF23GRF BIT(1), /* If bit is on, indicates that a         10090001
*                                4-byte field, FIXED(32), is used       10100001
*                                for the accumulator for SMF23NGR       10110001
*                                (i.e. Field wraps at 4 gigabytes).     10120001
*                                If bit is off, indicates that a        10130001
*                                8-byte field, FIXED(64), is used       10140001
*                                for the accumulator.            @05A*/ 10150001
*          3 SMF23PBF BIT(1), /* If bit is on, indicates that a         10160001
*                                4-byte field, FIXED(32), is used       10170001
*                                for the accumulator for SMF23PBG       10180001
*                                (i.e. Field wraps at 4 gigabytes).     10190001
*                                If bit is off, indicates that a        10200001
*                                8-byte field, FIXED(64), is used       10210001
*                                for the accumulator.            @05A*/ 10220001
*          3 SMF23FRF BIT(1), /* If bit is on, indicates that a         10230001
*                                4-byte field, FIXED(32), is used       10240001
*                                for the accumulator for SMF23NFR       10250001
*                                (i.e. Field wraps at 4 gigabytes).     10260001
*                                If bit is off, indicates that a        10270001
*                                8-byte field, FIXED(64), is used       10280001
*                                for the accumulator.            @05A*/ 10290001
*          3 SMF23PFF BIT(1), /* If bit is on, indicates that a         10300001
*                                4-byte field, FIXED(32), is used       10310001
*                                for the accumulator for SMF23PFX       10320001
*                                (i.e. Field wraps at 4 gigabytes).     10330001
*                                If bit is off, indicates that a        10340001
*                                8-byte field, FIXED(64), is used       10350001
*                                for the accumulator.            @05A*/ 10360001
*          3 SMF231FF BIT(1), /* If bit is on, indicates that a         10370001
*                                4-byte field, FIXED(32), is used       10380001
*                                for the accumulator for SMF231RF       10390001
*                                (i.e. Field wraps at 4 gigabytes).     10400001
*                                If bit is off, indicates that a        10410001
*                                8-byte field, FIXED(64), is used       10420001
*                                for the accumulator.            @05A*/ 10430001
*          3 SMF23NFF BIT(1), /* If bit is on, indicates that a         10440001
*                                4-byte field, FIXED(32), is used       10450001
*                                for the accumulator for SMF23NRF       10460001
*                                (i.e. Field wraps at 4 gigabytes).     10470001
*                                If bit is off, indicates that a        10480001
*                                8-byte field, FIXED(64), is used       10490001
*                                for the accumulator.            @05A*/ 10500001
*          3 SMF23IOF BIT(1), /* If bit is on, indicates that 4-byte    10510001
*                                fields, FIXED(32), are used for the    10520001
*                                accumulators (one per CPU) for         10530001
*                                SMF23NIO                               10540001
*                                (i.e. value will decrease from the     10550001
*                                the last interval if one of the        10560001
*                                accumulators wrap at 4 gigabytes).     10570001
*                                If bit is off, indicates that          10580001
*                                8-byte fields, FIXED(64), are used     10590001
*                                for the accumulators.           @05A*/ 10600001
*          3 SMF23TCF BIT(1), /* If bit is on, indicates that 4-byte    10610001
*                                fields, FIXED(32), are used for the    10620001
*                                accumulators (one per CPU) for         10630001
*                                SMF23TCB                               10640001
*                                (i.e. value will decrease from the     10650001
*                                the last interval if one of the        10660001
*                                accumulators wrap at 4 gigabytes).     10670001
*                                If bit is off, indicates that          10680001
*                                8-byte fields, FIXED(64), are used     10690001
*                                for the accumulators.           @05A*/ 10700001
*          3 SMF23SRF BIT(1), /* If bit is on, indicates that 4-byte    10710001
*                                fields, FIXED(32), are used for the    10720001
*                                accumulators (one per CPU) for         10730001
*                                SMF23SRB                               10740001
*                                (i.e. value will decrease from the     10750001
*                                the last interval if one of the        10760001
*                                accumulators wrap at 4 gigabytes).     10770001
*                                If bit is off, indicates that          10780001
*                                8-byte fields, FIXED(64), are used     10790001
*                                for the accumulators.           @05A*/ 10800001
*          3 * BIT(23),       /* Reserved                        @05A*/ 10810001
*        2 SMF23NGR CHAR(8),  /* Total number of getmain requests       10820001
*                                that have been issued                  10830001
*                                (see SMF23SFG bit 0 for more details)  10840001
*                                                                @05A*/ 10850001
*        2 SMF23PBG CHAR(8),  /* Total number of pages backed           10860001
*                                during getmain requests                10870001
*                                that have been issued                  10880001
*                                (see SMF23SFG bit 1 for more details)  10890001
*                                                                @05A*/ 10900001
*        2 SMF23NFR CHAR(8),  /* Total number of fix requests           10910001
*                                that have been issued                  10920001
*                                for storage (address space only)       10930001
*                                below two gigabytes                    10940001
*                                (see SMF23SFG bit 2 for more details)  10950001
*                                                                @05A*/ 10960001
*        2 SMF23PFX CHAR(8),  /* Total number of frames that            10970001
*                                were requested to be fixed             10980001
*                                for storage (address space only)       10990001
*                                below two gigabytes                    11000001
*                                (see SMF23SFG bit 3 for more details)  11010001
*                                                                @05A*/ 11020001
*        2 SMF231RF CHAR(8),  /* Total number of first reference        11030001
*                                faults taken                           11040001
*                                (see SMF23SFG bit 4 for more details)  11050001
*                                                                @05A*/ 11060001
*        2 SMF23NRF CHAR(8),  /* Total number of non-first              11070001
*                                reference faults taken                 11080001
*                                (see SMF23SFG bit 5 for more details)  11090001
*                                                                @05A*/ 11100001
*        2 SMF23NIO CHAR(8),  /* Total number of I/Os                   11110001
*                                (see SMF23SFG bit 6 for more details)  11120001
*                                                                @05A*/ 11130001
*        2 SMF23TCB CHAR(8),  /* Total number of unlocked TCB           11140001
*                                dispatches                             11150001
*                                (see SMF23SFG bit 7 for more details)  11160001
*                                                                @05A*/ 11170001
*        2 SMF23SRB CHAR(8),  /* Total number of SRB dispatches         11180001
*                                (see SMF23SFG bit 8 for more details)  11190001
*                                                                @05A*/ 11200001
*        2 SMF23NGD FIXED(32), /* Total number of getmain requests      11210001
*                                that have been issued                  11220001
*                                for this interval                      11230001
*                               (see SMF23NGR for the cumulative total) 11240001
*                                                                @06A*/ 11250001
*        2 SMF23PBD FIXED(32), /* Total number of pages backed          11260001
*                                during getmain requests                11270001
*                                that have been issued                  11280001
*                                for this interval                      11290001
*                               (see SMF23PBG for the cumulative total) 11300001
*                                                                @06A*/ 11310001
*        2 SMF23NFD FIXED(32), /* Total number of fix requests          11320001
*                                that have been issued                  11330001
*                                for storage (address space only)       11340001
*                                below two gigabytes                    11350001
*                                for this interval                      11360001
*                               (see SMF23NFR for the cumulative total) 11370001
*                                                                @06A*/ 11380001
*        2 SMF23PFD FIXED(32), /* Total number of frames that           11390001
*                                were requested to be fixed             11400001
*                                for storage (address space only)       11410001
*                                below two gigabytes                    11420001
*                                for this interval                      11430001
*                               (see SMF23PFX for the cumulative total) 11440001
*                                                                @06A*/ 11450001
*        2 SMF231RD FIXED(32), /* Total number of first reference       11460001
*                                faults taken                           11470001
*                                for this interval                      11480001
*                               (see SMF231RF for the cumulative total) 11490001
*                                                                @06A*/ 11500001
*        2 SMF23NRD FIXED(32), /* Total number of non-first             11510001
*                                reference faults taken                 11520001
*                                for this interval                      11530001
*                               (see SMF23NRF for the cumulative total) 11540001
*                                                                @06A*/ 11550001
*        2 SMF23NID CHAR(8),  /* Total number of I/Os                   11560001
*                                for this interval                      11570001
*                               (see SMF23NIO for the cumulative total) 11580001
*                                                                @06A*/ 11590001
*        2 SMF23TCD CHAR(8),  /* Total number of unlocked TCB           11600001
*                                dispatches                             11610001
*                                for this interval                      11620001
*                               (see SMF23TCB for the cumulative total) 11630001
*                                                                @06A*/ 11640001
*        2 SMF23SRD CHAR(8),  /* Total number of SRB dispatches         11650001
*                                for this interval                      11660001
*                               (see SMF23SRB for the cumulative total) 11670001
*                                                                @06A*/ 11680001
*        2 SMF23MBU FIXED(32); /* The maximum number of bytes           11681001
*                                 stored in the temporary buffer        11682001
*                                 that is used during SMF               11683001
*                                 initialization.                @0BA*/ 11684001
*           /*  SPN SECTION                                      @LVA*/ 11690001
*  DCL SMF23SPN CHAR(*) BASED(ADDR(SMFRCD23)+SMF23NOF); /* Spin         11700001
*                               lock instrumentation data        @LVA*/ 11710001
*           /*  BND SECTION                                      @LVA*/ 11720001
*  DCL SMF23BND CHAR(*) BASED(ADDR(SMFRCD23)+SMF23BOF); /* Bind         11730001
*                               break instrumentation data       @LVA*/ 11740001
*                                                                       11750001
*           /*  SMF Logstream Statistics Section                 @07A*/ 11760001
*  DCL 1 SMF23LGS BASED(ADDR(SMFRCD23)+SMF23LOF),       /*       @07A*/ 11770001
*        2 SMF23LSL Fixed(15),      /* Logstream name length     @07A*/ 11780001
*        2 SMF23LSN Char(26),       /* Logstream name            @07A*/ 11790001
*        2 SMF23LFA FIXED(31),      /* Amount of each Buffer Allocation 11800001
*                                      Request for this logstream       11810001
*                                                                @07A*/ 11820001
*        2 SMF23LFT FIXED(31),      /* Total Amount of Buffer Storage   11830001
*                                      currently allocated (and         11840001
*                                      recently used)            @07A*/ 11850001
*        2 SMF23LFH FIXED(31),      /* High water mark of buffer        11860001
*                                      storage allocation        @07A*/ 11870001
*        2 SMF23LFM FIXED(31),      /* Buffer storage maximum in effect 11880001
*                                      (DspSizMax binary value)  @08C*/ 11890001
*        2 SMF23LFL FIXED(31),      /* Buffer warning level in effect   11900001
*                                      (BufUseWarn binary value). When  11910001
*                                      zero SMF23BFL is the BufUseWarn  11920001
*                                      value in effect.          @08C*/ 11930001
*        2 SMF23LFG FIXED(31),      /* Various flags             @07A*/ 11940001
*          5 SMF23BWG Bit(1),       /* Buffer warning level from        11950001
*                                      global option             @07A*/ 11960001
*          5 SMF23DWG Bit(1),       /* Buffer storage maximum from      11970001
*                                      global option             @07A*/ 11980001
*          5 SMF23CRQ Bit(1),       /* On-Compression requested for     11990001
*                                      records written to this log      12000001
*                                      stream by SMF configuration      12010001
*                                      Off-Compression not requested    12020001
*                                                                @LYA*/ 12030001
*          5 SMF23CPR Bit(1),       /* On-Compression is Prepared. This 12040001
*                                      log stream is ready to compress  12050001
*                                      records (hardware is capable of  12060001
*                                      using zEnterprise Data           12070001
*                                      Compression(zEDC)), and all      12080001
*                                      setup for compression succeeded  12090001
*                                      Off- Hardware is not capable of  12100001
*                                      using zEDC or compression setup  12110001
*                                      failed (see IFA730I).     @LYA*/ 12120001
*          5 SMF23CMP Bit(1),       /* On- Compression is Available.    12130001
*                                      The last use of zEDC was         12140001
*                                      successful and it indicated zEDC 12150001
*                                      Expresses were available to      12160001
*                                      satisfy compression requests     12170001
*                                      Off- At last request- zEDC       12180001
*                                      Expresses were not available to  12190001
*                                      satisfy compression requests.    12200001
*                                                                @LYA*/ 12210001
*          5 SMF23PFG Bit(1),       /* The current PERMFIX value for    12220001
*                                      this log stream is the global    12230001
*                                      PERMFIX value. In the SMF        12240001
*                                      configuration, a log stream      12250001
*                                      PERMFIX value was not specified. 12260001
*                                                                @LYA*/ 12270001
*        /************************************************************/ 12280001
*        /* SMF configuration parameter PERMFIX defines the maximum  */ 12290001
*        /* storage SMF can keep registered to zEDC. The following   */ 12300001
*        /* four fields represent amounts of storage registered to   */ 12310001
*        /* zEDC for this log stream.                            @LYA*/ 12320001
*        /************************************************************/ 12330001
*        2  SMF23PFT Fixed(32),     /* Total storage SMF is currently   12340001
*                                      using for zEDC for this log      12350001
*                                      stream. Value does not account   12360001
*                                      for 1MB needed by each log       12370001
*                                      stream using zEDC. Value may be  12380001
*                                      up to 2MB greater than the       12390001
*                                      defined PERMFIX value depending  12400001
*                                      on usage.                 @LYA*/ 12410001
*        2  SMF23PFM Fixed(32),     /* Max storage SMF can use for zEDC 12420001
*                                      for this log stream.             12430001
*                                      Configuration defined PERMFIX    12440001
*                                      value.                    @LYC*/ 12450001
*        2  SMF23PFH Fixed(32),     /* High water mark of storage       12460001
*                                      SMF has used for compression     12470001
*                                      services for this log stream     12480001
*                                      connection                @LYA*/ 12490001
*        2  SMF23CNT Char(8) Bdy(DWORD), /* Log block write counts      12500001
*                                      on an SMF interval basis  @LYA*/ 12510001
*         3  SMF23CWN Fixed(32),    /* Number of log blocks written     12520001
*                                      containing compressed records    12530001
*                                      during this interval.     @LYA*/ 12540001
*         3  SMF23NCN Fixed(32),    /* Number of log blocks written     12550001
*                                      containing non compressed        12560001
*                                      records during this interval.    12570001
*                                                                @LYA*/ 12580001
*        2  SMF23BBC Char(8) Bdy(DWORD), /* zEDC uncompressed bytes     12590001
*                                      total. For logstreams with       12600001
*                                      compressed data, this field      12610001
*                                      contains the total number of     12620001
*                                      uncompressed bytes that zEDC     12630001
*                                      successfully compressed during   12640001
*                                      the interval. For logstreams     12650001
*                                      with no compressed data, this    12660001
*                                      field will contain zeroes.       12670001
*                                                                @P6A*/ 12680001
*        2  SMF23BAC Char(8) Bdy(DWORD), /* zEDC compressed bytes       12690001
*                                      total. For logstreams with       12700001
*                                      compressed data, this field      12710001
*                                      contains the total number of     12720001
*                                      compressed bytes that were       12730001
*                                      written to the logstream         12740001
*                                      during the interval. For         12750001
*                                      logstreams with no compressed    12760001
*                                      data, this field will contain    12770001
*                                      zeroes.                   @P6A*/ 12780001
*        2  SMF23LHP Fixed(32),     /* High water mark of the           12790001
*                                      percentage of the buffer         12800001
*                                      that is in use.           @0AA*/ 12810001
*        2  SMF23LCP Fixed(32),     /* Current percentage of the        12820001
*                                      buffer that is in use.    @0AA*/ 12830001
*                                                                       12840001
*        2  * Char(0);              /* End of SMF23LGS           @P6A*/ 12850001
*%IFAL25:;                                                    /* @LZC*/ 12860001
*%IF IBM_CBGENC = 'YES' %THEN %GOTO IFAL25A;                  /* @LZA*/ 12860101
*        %IF IFAR25='' %THEN %GOTO IFAL26;                    /* @LZC*/ 12861001
*/* 43 LINES DELETED(REC 25 MAP)TO TRANSFER OWNERSHIP TO SC141 43@T7D*/ 12870001
*%IFAL25A:;                                                   /* @LZA*/ 12871001
*%IAZR25='YES';                                             /*   @T7A*/ 12880001
*%INCLIAZ='YES'; /* AN IAZ MACRO IS REQUESTED-SET FLAG SO IFASMFR       12890001
*                   WILL INCLUDE THE JES IAZSMFR MACRO           @T7A*/ 12900001
*%IFAL26:;                                                    /* @LZC*/ 12910001
*%IF IBM_CBGENC = 'YES' %THEN %GOTO IFAL26A;                  /* @LZA*/ 12910101
*        %IF IFAR26='' %THEN %GOTO IFALR3;                    /* @LZC*/ 12911001
*/*188 LINES DELETED(REC 26 MAP)TO XFER OWNERSHIP TO SC141    188@T7D*/ 12920001
*%IFAL26A:;                                                   /* @LZA*/ 12921001
*%IAZR26='YES';                                             /*   @T7A*/ 12930001
*%INCLIAZ='YES'; /* AN IAZ MACRO IS REQUESTED-SET FLAG SO IFASMFR       12940001
*                   WILL INCLUDE THE JES IAZSMFR MACRO           @T7A*/ 12950001
*%IFALR3:   ;                                                           12960001
*%IF IBM_CBGENC ^= 'YES' %THEN %GOTO IFASMFR2C;                         12970001
*@logic;                                                                12971001
*#PRAGMA TOOL=CBGENC.                                                   12971100
*#CADDAFTERSTRUCT.smf20rla                                              12971200
*#include <igesmf21.h>                                                  12971400
*#ECADDAFTERSTRUCT.                                                     12971600
*#CADDAFTERSTRUCT.smf22stx                                              12971700
*#include <iosdsmfr.h>                                                  12971900
*#ECADDAFTERSTRUCT.                                                     12972100
*#EPRAGMA.                                                              12972200
*@endlogic;                                                             12973001
*%IFASMFR2C:;                                                           12980001
