*%GOTO IFABGN1;  /*                                                             
         MACRO                                                                  
&NAME    IFASMFR &RECTYPE                                            */         
*%IFABGN1: ;                                                                    
* /* START OF SPECIFICATIONS                                         */         
* /*                                                                 */         
* /* MACRO-NAME = IFASMFR                                        @03C*/         
* /*                                                                 */         
* /* PROPRIETARY STATEMENT =                                         */         
* /*                                                                 */         
* /* LICENSED MATERIALS - PROPERTY OF IBM                            */         
* /* 5650-ZOS COPYRIGHT IBM CORP. 1977, 2021                         */         
* /*                                                                 */         
* /* STATUS= HBB77D0                                                 */         
* /*                                                                 */         
* /* EXTERNAL CLASSIFICATION: PI                                 @P4A*/         
* /* END OF EXTERNAL CLASSIFICATION:                             @P4A*/         
* /*                                                                 */         
* /*                                                                 */         
* /*         THIS MACRO MAPS RECORDS IN THE RANGE 00-06. IT          */         
* /*         ACTS AS A ROUTER TO OTHER MACROS TO PROCESS OTHER       */         
* /*         RECORDS AS FOLLOWS:                                     */         
* /*                                                                 */         
* /*             MACRO        RECORDS                                */         
* /*            ********      *******                                */         
* /*            IFASMFR1      07-19                                  */         
* /*            IFASMFR2      20-27                                  */         
* /*            IFASMFR3      28-36                                  */         
* /*            IFASMFR4      37-46                                  */         
* /*            IFASMFR5      47-54                                  */         
* /*            IFASMFR6      55-69                                  */         
* /*            IFASMFR9      80-84                              @07C*/         
* /*            IFASMFRA      85-103                             @07C*/         
* /*            IFASMFRB      104-113                                */         
* /*            IFASMFRC      114-123                                */         
* /*            IFASMFRD      124-127                                */         
* /*            IFASMFRD      1152-2047 (update as required)     @PAA*/         
* /*                                                                 */         
* /*01* METHOD OF ACCESS                                             */         
* /*  PL/S - USER DEFINES MACRO VARIABLE IFARXX WHERE XX=RECORD NUM  */         
* /*         DECLARE SMFXXPTR PTR(31) OR RESPECIFY FOR BASE          */         
* /*         INCLUDE MACRO FROM LIBRARY                              */         
* /*          EXAMPLE %IFAR08 = 'YES',           NOTE. THE COMMA REP-*/         
* /*                  DCL SMF08PTR PTR(31),      RESENTS A SEMI-COLON*/         
* /*                  %INCLUDE SYSLIB(IFASMFR),  BUT ISN'T TO AVIOD  */         
* /*                                             A DIAGNOSTIC.       */         
* /*                                                                 */         
* /*01* NOTES: none                                                  */         
* /*                                                                 */         
* /* END OF SPECIFICATIONS                                           */         
*%GOTO IFABGN2;   /*                                                            
.*                                                                              
.*                                                                              
.* CHANGE ACTIVITY:                                                             
.*    Z40MPTH, ZA05171, Z40FPTH, ZA10800, G387P27, ZA74830,                     
.*    D5A    , ZA75776, T7A    , ZA80943, T8A    , DAA, YA15607,                
.*    LCA    , LBA    , DFA    , LAA    , LEA                                   
.*                                                                              
.*    OZ74830 - UPDATE TYPE 6 RECORD, ADD SMF6EFMN FIELD      @ZA74830          
.*    OZ75776 - CHANGE DECLARE LEVEL ON SMF6END               @ZA75776          
.*    OZ80943 - REMOVE MACROS IFASMFR7 AND IFASMFR8 SINCE     @ZA80943          
.*              THEIR FUNCTIONS HAVE BEEN TAKEN OVER BY RMF.  @ZA80943          
.*    OY15607 - ADD RESERVED FIELDS SMF4RSV1 AND SMF5RSV1.    @YA15607          
.*    OY27577 - PSF TYPE 6 CHANGES INCLUDED IN JBB3313        @YA27577          
.*    TYPE 6  - DOC CORRECTIONS FOR THE SMF6JNM FIELD             @P3A          
.*    TYPE 4  - Delete SMF4VDV                                   1@LYA          
.*    TYPE 4  - Documentation change to SMF4PGNO field            @LZA          
.*    TYPE 5  - Documentation change to SMF5PGNO field            @LZA          
.*    TYPE 0  - Include system-related data fields                @01A          
.*    Add External Classification                                 @P4A          
.*    TYPE 6  - Add fields in support of FULL BIN, COMSETUP, and  @04A          
.*              MVS Download Feature.                             @04A          
.*    TYPE 6  - Reserve subsystem identification of X'0009' for   @05A          
.*              IP PrintWay.                                      @05A          
.*    TYPE 6  - Increase file transfer section to have print      @06A          
.*              queue name for IP PrintWay                        @06A          
.*    OW25672 - Shift record types 85-88 mappings to IFASMFR9.    @07A          
.*    TYPE 6  - Add fields in support of PSF/MVS 3.1.0.           @08A          
.*    TYPE 6  - Added AOPSMF6 macro in support of SMF Type 6      @L1A          
.*              restructure                                       @L1A          
.*    TYPE 0  - Added field for timezone information              @P5A          
.*    TYPE 0  - Added SMF0MSWT and SMF0MTWT                       @P6A          
.*    TYPE 2  - Corrected erroneous comment                       @P7A          
.*    TYPE 2  - Added SMF2GRP (Type 2, Subtype 1) and SMF2INT     @L2A          
.*            - (Type 2, Subtype 2) mappings                      @L2A          
.*    TYPE 2  - Combine SMF2GRP and SMF2INT with SMFRCD2 so       @P8A          
.*              those mappings are included whenever the Type 2   @P8A          
.*              record is specified.                              @P8A          
.*    TYPE 2  - Defined SMF2GRTYPX and SMF2GEXT                   @L3A          
.*    TYPE 2  - Defined SMF2IRTYPX and SMF2IEXT                   @P9A          
.*    TYPE 2  - For subtype 2, defined SMF2IClInt.                @09A          
.*    TYPE 0  - Added SMF0TBUF.                                   @0AA          
.*    Accommodate C                                               @M1A          
.*    TYPE 2  - Defined SMF2GMinuteBdyFct and SMF2IMinuteBdyFct   @0BA          
.*    TYPE 2  - Defined Self defining area and ARecSign area      @0CA          
.*    TYPE 2  - Defined SMF2GSelfDefiningSectionExists bit        @0CA          
.*    TYPE 2  - Defined SMF2ISelfDefiningSectionExists bit        @0CA          
.*    TYPE 0  - Defined SMF0RS4K                                  @L4A          
.*    TYPE 1152-2047: Added macro logic to include IFASMFRD for   @PAA          
.*                    IBM assigned extended record types. The     @PAA          
.*                    range of types to be mapped in IFASMFRD     @PAA          
.*                    may be adjusted in the future to balance    @PAA          
.*                    types across other mapping macros.          @PAA          
.*    TYPE 0  - Defined SMF0_Num_CrypCtrs, SMF0_Num_NNPICtrs,     @0EA          
.*              SMF0_Flags, and SMF0RS4K_Not_Valid.               @0EA          
.*                                                                              
.*    $PV=PAJ0111 ,JBB2125,830627,PDFS: CHANGE SIZE OF SMF4RSH0   @PVA          
.*    $D5=DCR89   ,JBB2125,830627,PDFS: UPDATE TYPE 6 RECORD      @D5A          
.*    $T7=UZ90334 ,JBB2125,830627,PDFS: TRANSFER RECORDS TO JES   @T7A          
.*    $T8=UZ90378 ,JBB2133,840905,PDFS: TYPE 6 RESTRUCTURE        @T8A          
.*    $T6=UZ90370 ,JBB2133,841215,PDFS: UPDATE TYPE 6 FOR 3820    @T6A          
.*    $DA=DCR132  ,JBB2220,850515,PDFS: >1635 DD STATEMENTS       @DAA          
.*    $TB=DCR301  ,HBB3310,860102,PDFS: 10K JOB SUPPORT           @TBA          
.*    $LB=HIPER   ,JBB3311,880418,PDFS: HIPERSPACE SUPPORT        @LBA          
.*    $DF=DCR29   ,JBB3311,880718,PDFS: CREAD PAGE MISS COUNT     @DFA          
.*    $LC=B1SEC   ,JBB3313,880404,PDFS: SECURITY RELATED SUPPORT  @LCA          
.*    $QX=PGP0273 ,JBB3313,890331,PDWC: TYPE 6 LEVEL INDICATOR    @QXA          
.*    $DK=DCR0016 ,JBB3313,890612,PDWC: ADDITIONAL PSF SUPPROT    @DKA          
.*    $DL=DCR0037 ,JBB3313,880612,PDWC: 'DSNAME' FIELD LENGTH CHG @DLA          
.*    $DM=DCR0050 ,JBB3313,880716,PDBR: ADDITIONAL PSF SUPPORT    @DMA          
.*    $LA=SERVC   ,JBB3320,871217,PDFS: >1440 TIME SUPPORT        @LAA          
.*    $P1=PHB1095 ,JBB3320,890328,PDBR: TYPE 4 BASING ERROR       @P1A          
.*    $LE=EMVS2   ,HBB4410,881024,PDFS: ENTERPRISE II - TYPE 6    @LEA          
.*    $P2=PEO4165 ,HBB4410,900507,PDBR: SMF6LEV4 VALUE ERROR      @P2A          
.*    $02=OY30945 ,JBB2220,900409,PDBR: TYPE 6 CHNGES FOR PSF 4.0 @02A          
.*    $P3=PKB3728 ,HBB4430,920731,PDMF: 10X SMF6JNM DOC ERROR     @P3A          
.*    $LY=4DGIT   ,HBB5510,930304,PDSL: SMF 4K UCB Enhancement    @LYA          
.*    $LZ=WLMI    ,HBB5510,930715,PDOH: SMF-WLM Support           @LZA          
.*    $01=OW03229 ,HBB5510,940325,PDOH: System data in SMF record @01A          
.*    $03=OW02855 ,JBB3313,940115,PDBR: Usage Data Reporting      @03A          
.*    $P4=PN71727 ,HBB5520,941020,PDOH: CDPI: SHOWHDR Cleanup     @P4A          
.*    $04=OW13246 ,HBB4420,950601,PDOH: Type 6 Enhancements       @04A          
.*    $05=OW21583 ,HBB4420,960801,PDOH: Type 6 TCP/IP Support     @05A          
.*    $06=OW25152 ,HBB4420,970630,PDRR: IP Printway Enhancement   @06A          
.*    $07=OW25672 ,HBB5510,970630,PDRR: OAM Type 85 Enhancement   @07A          
.*    $08=OW35685 ,HBB5520,981030,PDOH: PSF/MVS 3.1.0 Support     @08A          
.*    $L1=SMFT6   ,HBB7708,021015,PDOO: SMF Type 6 Restructure    @L1A          
.*    $P5=ME13499 ,HBB7760,080731,PDAS: SMF Type 0 Timezone       @P5A          
.*    $P6=ME24004 ,HBB7790,120424,PDOO: Separate Wait Time Limits @P6A          
.*                                      For Batch TSO And STC     @P6A          
.*    $P7=ME26986 ,HBB77A0,131231,PDOO: Correct erroneous comment @P7A          
.*    $L2=SMFTAMP ,HBB77A0,140930,PDQV: SMF Digital Signature Support           
.*                                      (ME28079) (ME28215)       @L2A          
.*    $P8=ME28305 ,HBB77A0,141231,PDQV: Correct ASM portion of SMF2GRP          
.*                                      and SMF2INT               @P8A          
.*    $L3=SMFTYPEX HBB77B0 160202 PDOO: SMF Extended Record Type                
.*                                      W105614                   @L3A          
.*    $P9=W132135  HBB77B0,160901,PDOO: SMFTYPEX DigSig support   @P9A          
.*                                                                              
.*    $09=OA52676  HBB77A0 170915 PDOO: DigSig validation fails                 
.*                                      for END(2400)             @09A          
.*    $0A=OA52828  HBB77A0 180125 PDOO: SMFTBUFF                  @0AA          
.*    $M1=270303   HBB77C0 180901 PDXB: Accommodate C             @M1A          
.*    $0B=OA55526  HBB77A0 181010 PDOO: DigSig validation fails                 
.*                                      for out of order records  @0BA          
.*    $0C=SMFQ     HBB77C0 190507 PDMMK: SMF Quantum              @0CA          
.*    $L4=GT4T     HBB77D0 201001 PDED: Add SMF0RS4K                            
.*                                      Update SMF0RST commentary               
.*    $PA=W383576  HBB77D0 210213 PDOO: Record types 1153         @PAA          
.*    $0E=OA61511  HBB77C0 220415 PDTA: CPACF                     @0EA          
.*                                                                              
*  THIS IS AN SMF MACRO WHICH CONTROLS THE BUILDING OF SMF RECORDS. THE         
*  REQUIRED FORMAT IS                                                           
*                                                                               
*        IFASMFR  &RECTYPE                                                      
*                                                                               
*  NOTE: VALUES FOR &RECTYPE MUST BE ENCLOSED IN PARENS(UNLESS ONLY 1).         
*                                                                               
         LCLA  &NUM,&B                                                          
.* &NUM IS SET TO THE NUMBER OF SUBSTRING ITEMS IN THE FIRST PARAMETER          
.* AND &B IS USED TO POINT AT EACH SUBSTRING ITEM.                              
         AIF   ('&RECTYPE' EQ '').E1                                            
&NUM     SETA  N'&RECTYPE                                                       
         AGO   .CONTC                                                           
.CONTB   ANOP                                                                   
&NUM     SETA  &NUM-1                                                           
.CONTC   ANOP                                                                   
         AIF   (&NUM LE 0).OUT                                                  
&B       SETA  &B+1                                                             
.RTYCHK  AIF   ('&RECTYPE(&B)' EQ '').E3                                        
         AIF   (&RECTYPE(&B) LT 0).E5                             @PAA          
         AIF   (&RECTYPE(&B) GT 127 AND &RECTYPE(&B) LT 1152).E5  @PAC          
         AIF   (&RECTYPE(&B) GT 2047).E5                          @PAA          
         AGO   .CONTA                                                           
.E1      ANOP                                                                   
         SPACE 3                                                                
         MNOTE 8,'PARAMETERS OMITTED, PROCESSING TERMINATED'                    
         MEXIT                                                                  
.E3      ANOP                                                                   
         SPACE 3                                                                
         MNOTE 4,'NULL RECORD TYPE PASSED'                                      
         AGO   .CONTB                                                           
.E5      ANOP                                                                   
         SPACE 3                                                                
         MNOTE 4,'&RECTYPE(&B) INVALID RECORD TYPE SPECIFIED'                   
         AGO   .CONTB                                                           
.CONTA   AIF   (&RECTYPE(&B) GE 0 AND &RECTYPE(&B) LE 6).G0                     
         AIF   (&RECTYPE(&B) GE 7 AND &RECTYPE(&B) LE 19).G1                    
         AIF   (&RECTYPE(&B) GE 20 AND &RECTYPE(&B) LE 27).G2                   
         AIF   (&RECTYPE(&B) GE 28 AND &RECTYPE(&B) LE 36).G3                   
         AIF   (&RECTYPE(&B) GE 37 AND &RECTYPE(&B) LE 46).G4                   
         AIF   (&RECTYPE(&B) GE 47 AND &RECTYPE(&B) LE 54).G5                   
         AIF   (&RECTYPE(&B) GE 55 AND &RECTYPE(&B) LE 69).G6                   
.*  REMOVED REFERENCES TO IFASMFR7 AND IFASMFR8 - TWO LINES  @ZA80943           
         AIF   (&RECTYPE(&B) GE 80 AND &RECTYPE(&B) LE 84).G9      @07C         
         AIF   (&RECTYPE(&B) GE 85 AND &RECTYPE(&B) LE 103).GA     @07C         
         AIF   (&RECTYPE(&B) GE 104 AND &RECTYPE(&B) LE 113).GB                 
         AIF   (&RECTYPE(&B) GE 114 AND &RECTYPE(&B) LE 123).GC                 
         AIF   (&RECTYPE(&B) GE 124 AND &RECTYPE(&B) LE 127).GD                 
         AIF   (&RECTYPE(&B) GE 1152 AND &RECTYPE(&B) LE 2047).GD  @PAA         
         AGO   .E5                                                              
.G0      ANOP                                                                   
         AIF   (&RECTYPE(&B) EQ 0).IFAS000                                      
         AIF   (&RECTYPE(&B) EQ 2).IFAS002                                      
         AIF   (&RECTYPE(&B) EQ 3).IFAS003                                      
         AIF   (&RECTYPE(&B) EQ 4).IFAS004                                      
         AIF   (&RECTYPE(&B) EQ 5).IFAS005                                      
         AIF   (&RECTYPE(&B) EQ 6).IFAS006                                      
         AGO   .E5                                                              
.G1      ANOP                                                                   
         IFASMFR1 &RECTYPE(&B)                                                  
         AGO   .CONTB                                                           
.G2      ANOP                                                                   
         IFASMFR2 &RECTYPE(&B)                                                  
         AGO   .CONTB                                                           
.G3      ANOP                                                                   
         IFASMFR3 &RECTYPE(&B)                                                  
         AGO   .CONTB                                                           
.G4      ANOP                                                                   
         IFASMFR4 &RECTYPE(&B)                                                  
         AGO   .CONTB                                                           
.G5      ANOP                                                                   
         IFASMFR5 &RECTYPE(&B)                                                  
         AGO   .CONTB                                                           
.G6      ANOP                                                                   
         IFASMFR6 &RECTYPE(&B)                                                  
         AGO   .CONTB                                                           
.*  REMOVED REFERENCES TO IFASMFR7 AND IFASMFR8 - SIX LINES  @ZA80943           
.G9      ANOP                                                                   
         IFASMFR9 &RECTYPE(&B)                                                  
         AGO   .CONTB                                                           
.GA      ANOP                                                                   
         IFASMFRA &RECTYPE(&B)                                                  
         AGO   .CONTB                                                           
.GB      ANOP                                                                   
         IFASMFRB &RECTYPE(&B)                                                  
         AGO   .CONTB                                                           
.GC      ANOP                                                                   
         IFASMFRC &RECTYPE(&B)                                                  
         AGO   .CONTB                                                           
.GD      ANOP                                                                   
         IFASMFRD &RECTYPE(&B)                                                  
         AGO   .CONTB                                                           
.OUT     MEXIT                                                                  
.IFAS000 ANOP                                                                   
         EJECT                                                                  
*  THIS DSECT DEFINES THE FORMAT FOR RECORD TYPE 0 (IPL RECORD)                 
*  RECORD LENGTH IS 82 BYTES                                       @L4C         
*                                                                               
         DS    0F        ALIGN TO FULL WORD BOUNDARY                            
SMFRCD0  EQU   *         HEADER SEGMENT                                         
SMF0LEN  DS    BL2'0'    RECORD LENGTH                                          
SMF0SEG  DS    BL2'0'    SEGMENT DESCRIPTOR                                     
SMF0FLG  DC    BL1'0'    HEADER FLAG BYTE                                       
SMF0RTY  DC    BL1'0'    RECORD TYPE 0                                          
SMF0TME  DC    BL4'0'    TOD, USING FORMAT FROM TIME MACRO W/BIN. INTVL         
SMF0DTE  DC    PL4'0000'      DATE IN PACKED DECIMAL FORM: 00YYDDDF             
SMF0SID  DC    CL4' '    SYSTEM IDENTIFICATION                   Y02901         
SMF0JWT  DC    BL4'0'    Continuous wait time limt                              
*                        (SMFPRMxx JWT(hhmm) value)                             
*                        converted to minutes                     @P6C          
SMF0BUF  DC    BL4'0'    This field contains meaningless information            
*                                                                  @0AC         
SMF0VST  DC    BL4'0'    VIRTUAL STORAGE SIZE IN K BLOCKS(BINARY)XM4432         
SMF0OPT  DC    BL1'0'    OPTIONS BYTE:                                          
*                        BIT0 - SYSTEM & JOB DATA TO BE COLLECTED               
*                        BIT1 - STEP DATA TO BE COLLECTED                       
*                        BIT2 - EXITS REQUESTED                                 
*                        BIT3 - DATA SET ACCOUNTING                             
*                        BIT4 - VOLUME ACCOUNTING                               
*                        BIT5 - RESERVED(WAS ESV IN 14 AND 15)                  
*                        BIT6 - TEMPORARY-DATA-SET SCRATCH RECORDS              
*                        BIT7 - =0 BACKGROUND JOB; =1 FOREGROUND JOB            
SMF0RST  DC    BL4'0'    Real storage size in 1K blocks (binary).               
*                        This field is only accurate below 4TB.  For            
*                        larger systems this contains 'FFFFFFFF'x.              
*                        The SMF0RS4K field also represents the system          
*                        size and is not limited to 4 TB.  See SMF0RS4K         
*                        and SMF0RS4K_Not_Valid for additional                  
*                        instructions for determining if SMF0RS4K               
*                        contains valid information.               @0EC         
SMF0RSV  DC    BL1'0'    Reserved                                  @01A         
SMF0OSL  DC    CL8' '    MVS Product name                          @01A         
SMF0SYN  DC    CL8' '    System name                               @01A         
SMF0SYP  DC    CL8' '    Sysplex name                              @01A         
SMF0TZ   DC    BL4'0'    Difference in time between local          @P5A         
*                        time and Greenwich mean time in           @P5A         
*                        binary units of 1.048576 seconds.         @P5A         
*                        Copyied from CVTTZ.                       @P5A         
SMF0MSWT DC    BL4'0'    Started task wait time limit (SMFPRMxx    @P6A         
*                        SWT(hhmm) value) converted to minutes     @P6A         
SMF0MTWT DC    BL4'0'    TSO wait time limit (SMFPRMxx TWT(hhmm)   @P6A         
*                        value) converted to minutes               @P6A         
SMF0TBUF DC    BL2'0'    The number of megabytes specified by      @0AA         
*                        the SMFTBUFF IEASYSxx parmlib option. If  @0AA         
*                        the SMFTBUFF parameter value is           @0AA         
*                        incorrectly specified or SMFTBUFF is      @0AA         
*                        not specified, this value will be zero.   @0AA         
SMF0_End_V1 DS 0X        SMF0_Len_V1 is the length to here         @L4A         
SMF0RS4K DC    BL8'0'    Real storage size at IPL in 4K frame units@L4A         
SMF0_End_V2 DS 0X        SMF0_Len_V2 is the length to here         @L4A         
SMF0_Num_CrypCtrs DS BL2'0' Number of crypto counters supported by this         
*                        system                                    @0EA         
SMF0_Num_NNPICtrs DS BL2'0' Number of NNPI counters supported by this           
*                        system                                    @0EA         
SMF0_Flags DS BL1'0'     Flags                                     @0EA         
SMF0RS4K_Not_Valid EQU X'80' If the record length in SMF0LEN is                 
*                        SMF0_Len_V3 or larger, indicates if SMF0RS4K           
*                        contains a valid value or not.                         
*                        - As of z/OS 2.5, SMF0RS4K is always set and           
*                          this bit will not be set.                            
*                        - For prior z/OS releases, SMF0RS4K will               
*                          contain zeros and this bit will be set. @0EA         
SMF0_End_V3 DS 0X        SMF0_Len_V3 is the length to here         @0EA         
***********************************************************************         
*  The value in SMF0LEN, which contains the length of the record,     *         
*  will match one of the following constants that describes the       *         
*  length of the record.                                           @0EA         
***********************************************************************         
SMF0_Len_V1 EQU SMF0_End_V1-SMFRCD0                                @L4A         
SMF0_Len_V2 EQU SMF0_End_V2-SMFRCD0                                @L4A         
SMF0_Len_V3 EQU SMF0_End_V3-SMFRCD0                                @0EA         
SMF0_Len_Max EQU SMF0_Len_V3  This value might change upon any     @0EC         
*                        recompile after installation of service   @L4A         
*                        or a release. Do not use this equate      @L4A         
*                        unless that is OK.                        @L4A         
         AGO   .CONTB                                                           
.IFAS002 ANOP                                                                   
         EJECT                                                                  
* THIS RECORD IS WRITTEN BY THE SMF DUMP UTILITY PROGRAM AT THE                 
* BEGINNING OF A DUMP DATA SET. RECORD LENGTH IS 14 BYTES                       
*                                                                               
         DS    0F        ALIGN TO FULL WORD BOUNDARY                            
SMFRCD2  EQU   *         HEADER SEGMENT                                         
SMF2LEN  DS    BL2'0'    RECORD LENGTH                                          
SMF2SEG  DS    BL2'0'    SEGMENT DESCRIPTOR                                     
SMF2FLG  DC    BL1'0'    HEADER FLAG BYTE                                       
SMF2RTY  DC    BL1'0'    RECORD TYPE 2                                          
SMF2TME  DC    BL4'0'    TOD, USING FORMAT FROM TIME MACRO W/BIN. INTVL         
SMF2DTE  DC    PL4'0000'      DATE IN PACKED DECIMAL FORM: 00YYDDDF             
SMF2SID  DC    CL4' '    SYSTEM IDENTIFICATION                   Y02901         
* This record is written at the end of every digitally signed      @L2A         
* group.                                                           @0CC         
*                                                                               
          DS    0F         Align on full word boundary             @L2A         
SMF2GRP   DSECT            Group Record                            @P8C         
SMF2GLEN  DS    BL2'0'     Length                                  @L2A         
SMF2GSEG  DS    BL2'0'     Segment                                 @L2A         
SMF2GFLG  DC    BL1'0'     Flags. Bit 0 reserved. Bit 1 is ON when @L2A         
*                          subtypes are valid (SMF2GSTV). Bits 2-7 @L2A         
*                          are reserved.                           @L2A         
SMF2GRTY  DC    BL1'0'     Record Type (2)                         @L2A         
SMF2GTME  DC    BL4'0'     Time (of the last record in group)      @L2A         
SMF2GDTE  DC    PL4'0000'  Date (of the last record in group)      @L2A         
SMF2GSID  DC    CL4' '     System ID (DUMY)                        @L2A         
SMF2GWID  DC    CL4' '     Subsystem ID                            @L2A         
SMF2GSTP  DC    PL2'00'    Subtype (1)                             @L2A         
SMF2GRSID DC    CL4' '     Group's system ID                       @L2A         
SMF2GFLG2 DC    BL1'0'     More flags.                             @L2A         
*                          Bit  Meaning when set                   @L2A         
*                           0   This is the first group written    @L2A         
*                           1   This group's subtype is valid      @L2A         
*                           2   When on, This group's type is                   
*                               in SMF2GRTYPX.                                  
*                               When off, This group's type is                  
*                               in SMF2GRTYPE.                                  
*                               This bit will always be on                      
*                               for records generated on a                      
*                               z/OS 2.3 or above system.          @P9A         
*                           3   When on, indicates that this record             
*                               was generated on a system where the             
*                               fix for OA55526 was applied.                    
*                               (SMF2GMinuteBdyFct).               @0BA         
*                           4   When on, indicates that self                    
*                               defining section exists            @0CA         
*                           5-7 Reserved.                          @0BA         
SMF2GRTYPE DC   PL1'0'     Group's type                            @L2A         
*                          This field is only filled in when                    
*                          bit '20'x of SMF2GFLG2 is off.          @P9A         
SMF2GSTYPE DC   PL2'0'     Group's subtype                         @L2A         
SMF2GFTME  DC   BL4'0'     Group's start time                      @L2A         
SMF2GFDTE  DC   CL4' '     Group's start date                      @L2A         
SMF2GCNT   DC   BL4'0'     Group's record count                    @L2A         
SMF2GHASHMETH  DC CL1' '   Hash method flag                        @L2A         
SMF2GSIGTYPE   DC CL1' '   Signature type flag                     @L2A         
SMF2GTOKENNAME DC CL32' '  Token name                              @L2A         
SMF2GRTYPX DC   PL2'0'     Group's type                            @L2A         
*                          This field is only filled in when                    
*                          bit '20'x of SMF2GFLG2 is on.           @P9A         
SMF2GSIGLEN DC  BL4'0'     Signature length                        @L2A         
SMF2GSIG  DC   2CL256' '   Signature.  The length of this field is              
*                          contained in SMF2GSIGLEN                @0CA         
* This is the self defining section for the SMF type 2 Group Rec   @0CA         
* located at an offset of SMF2GSIGLEN from SMF2GSIG.               @0CA         
SMF2GSelfDefiningSection DSECT                                     @0CA         
SMF2GSDSLen         DC BL2'0'  Self Defining section length        @0CA         
                    DC BL2'0'  Reserved for alignment              @0CA         
SMF2GSDSASignOffSet DC BL4'0'  Offset from the beginning of the record          
*                              to the first ARECSIGN section       @0CA         
SMF2GSDSASignLen    DC BL2'0'  ARecsign Section Length             @0CA         
SMF2GSDSASignNum    DC BL2'0'  Number of ARecsign sections         @0CA         
* ARECSIGN section holds data for Alternate signatures.            @0CA         
* Only present when SMF2GSDSASignNum is non-zero.  Use             @0CA         
* SMF2GSDSASignOffset to locate section.                           @0CA         
SMF2GASignSection   DSECT                                          @0CA         
SMF2GASignHashMeth  DC CL1' '  Alternate Signature Hash Method     @0CA         
SMF2GASignSigType   DC CL1' '  Alternate Signature Signature Type  @0CA         
SMF2GASignTokenName DC CL32' ' Alternate Signature Token name      @0CA         
                    DC BL2'0'  Reserved                            @0CA         
SMF2GASignSigLen    DC BL4'0'  Alternate Signature Length          @0CA         
SMF2GASignSig       DS 0C      Alternate Signature.  The length of              
*                              this field is contained in                       
*                              SMF2GASignSigLen                    @0CA         
* This record is written at the end of an interval when digitally  @L2A         
* signing.                                                         @0CC         
*                                                                               
          DS    0F         Align on full word boundary             @L2A         
SMF2INT   DSECT            Interval Record                         @P8C         
SMF2ILEN  DS    BL2'0'     Length                                  @L2A         
SMF2ISEG  DS    BL2'0'     Segment                                 @L2A         
SMF2IFLG  DC    BL1'0'     Flags. Bit 0 reserved. Bit 1 is ON when @L2A         
*                          subtypes are valid (SMF2ISTV). Bits 2-7 @L2A         
*                          are reserved.                           @L2A         
SMF2IRTY  DC    BL1'0'     Record Type (2)                         @L2A         
SMF2ITME  DC    BL4'0'     Interval's time                         @L2A         
SMF2IDTE  DC    PL4'0000'  Interval's date                         @L2A         
SMF2ISID  DC    CL4' '     System ID (DUMY)                        @L2A         
SMF2IWID  DC    CL4' '     Subsystem ID                            @L2A         
SMF2ISTP  DC    PL2'00'    Subtype (1)                             @L2A         
SMF2IRSID DC    CL4' '     Group's system ID                       @L2A         
SMF2IFLG2 DC    BL1'0'     Bit  Meaning when set                   @P9C         
*                           0   First interval written             @P9C         
*                           1   Interval's subtype valid           @P9C         
*                           2   Halt driven interval               @P9C         
*                           3   New Crypto Options                 @P9C         
*                           4   When on, this interval's type is                
*                               in SMF2IRTYPX.                                  
*                               When off, this interval's type is               
*                               in SMF2IRTYPE.                                  
*                               This bit will always be on                      
*                               for records generated on a                      
*                               z/OS 2.3 or above system.          @P9A         
*                           5   This is a Close Interval rec       @09A         
*                           6   When on, indicates that this record             
*                               was generated on a system where the             
*                               fix for OA55526 was applied.                    
*                               (SMF2IMinuteBdyFct).               @0BA         
*                           7   When on, indicates that self                    
*                               defining section exists.           @0CA         
SMF2IRTYPE DC  PL1'0'      Interval's type                         @L2A         
*                          This field is only filled in when                    
*                          bit '08'x of SMF2IFLG2 is off.          @P9A         
SMF2ISTYPE DC  PL2'0'      Interval's subtype                      @L2A         
SMF2IFTME  DC  BL4'0'      First record's time                     @L2A         
SMF2IFDTE  DC  CL4' '      First record's date                     @L2A         
SMF2ILTME  DC  BL4'0'      Last record's time                      @L2A         
SMF2ILDTE  DC  CL4' '      Last record's date                      @L2A         
SMF2INTME  DC  BL4'0'      Next interval's time                    @L2A         
SMF2INDTE  DC  CL4' '      Next interval's date                    @L2A         
SMF2ICNT   DC  BL4'0'      Interval's record count                 @L2A         
SMF2IHASHMETH  DC CL1' '   Hash method flag                        @L2A         
SMF2ISIGTYPE   DC CL1' '   Signature type flag                     @L2A         
SMF2ITOKENNAME DC CL32' '  Token name                              @L2A         
SMF2IRTYPX DC  PL2'0'      Interval's type                                      
*                          This field is only filled in when                    
*                          bit '08'x of SMF2IFLG2 is on.           @P9A         
SMF2ISIGLEN  DC BL4'0'     Signature length                        @L2A         
SMF2ISIG  DC  2CL256' '    Signature.  The length of this field is in           
*                          SMF2ISIGLEN.                            @0CC         
* This is the self defining section for the SMF type 2 IntervalRec @0CA         
* located at an offset of SMF2ISIGLEN from SMF2ISIG.               @0CA         
SMF2ISelfDefiningSection DSECT                                     @0CA         
SMF2ISDSLen         DC BL2'0'  Self Defining section length        @0CA         
                    DC BL2'0'  Reserved for alignment              @0CA         
SMF2ISDSASignOffSet DC BL4'0'  ARecsign Section Offset             @0CA         
SMF2ISDSASignLen    DC BL2'0'  ARecsign Section Length             @0CA         
SMF2ISDSASignNum    DC BL2'0'  Number of ARecsign sections         @0CA         
* ARECSIGN section holds data for Alternate signatures.            @0CA         
* Only present when SMF2ISDSASignNum is non-zero.  Use             @0CA         
* SMF2ISDSASignOffset to locate section.                           @0CA         
SMF2IASignSection   DSECT                                          @0CA         
SMF2IASignHashMeth  DC CL1' '  Alternate Signature Hash Method     @0CA         
SMF2IASignSigType   DC CL1' '  Alternate Signature Signature Type  @0CA         
SMF2IASignTokenName DC CL32' ' Alternate Signature Token name      @0CA         
SMF2IASignFlgs      DC CL1'0'  Bit  Meaning when set               @0CA         
*                               0   New Crypto Options             @0CA         
*                              1-7  Reserved                       @0CA         
                    DC BL1'0'  Reserved                            @0CA         
SMF2IASignSigLen    DC BL4'0'  Alternate Signature Length          @0CA         
SMF2IASignSig       DS 0C      Alternate Signature.  The length of              
*                              this field is in SMF2IASignSigLen.  @0CA         
         AGO   .CONTB                                                           
.IFAS003 ANOP                                                                   
         EJECT                                                                  
* THIS RECORD IS WRITTEN BY THE SMF DUMP UTILITY PROGRAM AT THE END             
* OF A DUMP DATA SET. RECORD LENGTH IS 18 (DECIMAL) BYTES.       @P7C           
*                                                                               
         DS    0F        ALIGN TO FULL WORD BOUNDARY                            
SMFRCD3  EQU   *         HEADER SEGMENT                                         
SMF3LEN  DS    BL2'0'    RECORD LENGTH                                          
SMF3SEG  DS    BL2'0'    SEGMENT DESCRIPTOR                                     
SMF3FLG  DC    BL1'0'    HEADER FLAG BYTE                                       
SMF3RTY  DC    BL1'0'    RECORD TYPE 3                                          
SMF3TME  DC    BL4'0'    TOD, USING FORMAT FROM TIME MACRO W/BIN. INTVL         
SMF3DTE  DC    PL4'0000'      DATE IN PACKED DECIMAL FORM: 00YYDDDF             
SMF3SID  DC    CL4' '    SYSTEM IDENTIFICATION                   Y02901         
         AGO   .CONTB                                                           
.IFAS004 ANOP                                                                   
         EJECT                                                                  
* THIS RECORD IS WRITTEN AT NORMAL OR ABNORMAL TERMINATION OF A STEP.           
* RECORD LENGTH IS VARIABLE. MINIMUM OF 137.                                    
*                                                                               
         DS    0F        ALIGN TO FULL WORD BOUNDARY                            
SMFRCD4  EQU   *         HEADER SEGMENT                                         
SMF4LEN  DS    BL2'0'    RECORD LENGTH                                          
SMF4SEG  DS    BL2'0'    SEGMENT DESCRIPTOR                                     
SMF4FLG  DC    BL1'0'    HEADER FLAG BYTE                                       
SMF4RTY  DC    BL1'0'    RECORD TYPE 4                                          
SMF4TME  DC    BL4'0'    TOD USING FORMAT FROM TIME MACRO W/BIN. INTVL.         
SMF4DTE  DC    PL4'0000' DATE IN PACKED DECIMAL FORM: OOYYDDDF                  
SMF4SID  DC    CL4' '    SYSTEM IDENTIFICATION                   Y02901         
SMF4JBN  DC    CL8' '    JOB NAME                                               
SMF4RST  DC    BL4'0'    READER START TIME (IN 100THS SECONDS)                  
SMF4RSD  DC    PL4'0000' READER START DATE                                      
SMF4UIF  DC    CL8' '    USER IDENTIFICATION FIELD                              
SMF4STN  DC    BL1'0'    STEP NUMBER                                            
SMF4SIT  DC    BL4'0'    STEP INITIATION TIME (IN 100THS SECONDS)               
SMF4STID DC    PL4'0000' STEP INITIATION DATE (PACKED DECIMAL FORMAT)           
SMF4NCI  DC    BL4'0'    NUMBER OF CARD IMAGES IN DD DATA OR DD *               
*                        DATA SETS                                              
SMF4SCC  DC    BL2'0'    STEP COMPLETION CODE                  @G50FPRL         
SMF4PRTY DC    BL1'0'    PRIORITY AT WHICH STEP WAS DISPATCHED :                
*                        ACTUAL PRIORITY=251-(15-USER PRIORITY)*16              
SMF4PGMN DC    CL8' '    PROGRAM NAME                                           
SMF4STMN DC    CL8' '    STEP NAME                                              
SMF4RSV5 DC    BL2'0'    RESERVED                                  @PVC         
SMF4SYST DC    BL2'0'    SYSTEM AREA USED(TOP OF PROVATE AREA)   Y02901         
SMF4H0ST DC    BL2'0'    STORAGE USED(VIRT OR REAL-SEE SMF4RIN)                 
SMF4STU  EQU   SMF4H0ST  (LOW OF PRIVATE AREA)                   Y02901         
SMF4RV1  DC    BL2'0'    RESERVED                                  @PVC         
SMF4RSH0 DC    BL4'0'    REGION SIZE REQ(PRIVATE AREA 1K UNIT)     @PVM         
SMF4PRV  EQU   SMF4RSH0                                            @PVM         
SMF4SPK  DC    1BL1'0'   STORAGE PROTECT KEY                     A40791         
SMF4STI  DC    1BL1'0'   STEP TERMINATION INDICATOR                             
*                        BIT0 - RESERVED                                        
*                        BIT1 - CANCELLED AT EXIT IEFUJV                        
*                        BIT2 - CANCELLED AT EXIT IEFUJI                        
*                        BIT3 - CANCELLED AT EXIT IEFUSI                        
*                        BIT4 - CANCELLED AT EXIT IEFACTRT                      
*                        BIT5 - STEP IS TO BE RESTARTED        @YL026WA         
*                        BIT6 - 0=NORMAL COMPLETION                             
*                               1=ABEND                                         
*                        BIT7 - 1=STEP FLUSHED                                  
SMF4RV2  DC    BL2'0'    RESERVED                                A40791         
SMF4AST  DC    BL4'0'    DEVICE ALLOC START TIME                 A40791         
SMF4PPST DC    BL4'0'    PROBLEM PROGRAM START TIME              A40791         
SMF4RV3  DC    BL1'0'    RESERVED                              @YL026WA         
SMF4SRBT DC    BL3'0'    STEP CPU TIME UNDER SRB(.01 SEC)      @YL026WA         
SMF4RIN  DC    BL2'0'    RECORD INDICATORS                                      
*                        BIT0-3 RESERVED                           @DAC         
*                         4=1 FIELD SMF4SETM NOT VALID FOR SP410   @LAC         
*                            WHEN ACTJTIME >3 BYTES FOR TYPE 30    @DGA         
*                         5 =1 DEVICE DATA NOT RECORDED            @DAA         
*                         6 =1 POSSIBLE ERROR IN DEV ENTRY     @YM02618         
*                         7 =0 STOR IS VIRTUAL, =1 STOR IS REAL@YM02618         
*                         8-15 RESERVED                        @YM02618         
SMF4RLCT DC    BL2'0'    OFFSET TO RELOCATE SECTION                             
SMF4LENN DC    BL2'0'    LENGTH OF EXCP PORTION OF RECORD                       
*        FOR EACH DEVICE ASSIGNED TO EACH DATA SET THERE IS AN 8 BYTE           
*        ENTRY HAVING THE FOLLOWING FORMAT:                                     
*                                                                               
*     Note: Virtual I/O Devices are identified by the following:   @LYA         
*           Device Class 0                                         @LYA         
*           Unit Type 0                                            @LYA         
*           Device Number x'7FFF'                                  @LYA         
*                                                                               
SMF4DEVC DC    BL1'0'    DEVICE CLASS                                           
SMF4UTYP DC    BL1'0'    UNIT TYPE                                              
SMF4CUAD DC    BL2'0'    Device Number                             @LYC         
*                                                                 1@LYD         
SMF4EXCP DC    BL4'0'    COUNT OF EXCP'S ISSUED FOR THE DEVICE AND              
*                        DATA SET                                               
         ORG   SMF4DEVC                                                         
SMF4LNTH DC    BL1'0'    TOTAL LENGTH OF CPU AND ACCT. SECTION                  
SMF4SETM DC    BL3'0'    RESERVED                                 @LAC          
SMF4NAF  DC    BL1'0'    NUMBER OF ACCOUNTING FIELDS                            
SMF4ACTF DS    0C        EXEC STATEMENT ACCOUNTING FIELDS(VARIABLE)             
*                                                                               
*        EACH ENTRY FOR AN ACCOUNTING FIELD CONTAINS THE LENGTH OF THE          
*        FIELD (1 BYTE,BINARY), FOLLOWED BY THE FIELD(EBCDIC).AN                
*        OMITTED FIELD IS REPRESENTED BY A LENGTH INDICATOR OF 0.               
*                                                                               
*        RELOCATE SECTION                                                       
SMF4PGIN DS    BL4'0'    NUMBER OF PAGE-INS                                     
SMF4PGOT DS    BL4'0'    NUMBER OF PAGE-OUTS                                    
SMF4NSW  DS    BL4'0'    NUM OF SWAPS                            Y02901         
SMF4RGNS EQU   SMF4NSW                                           Y02901         
SMF4PSI  DS    BL4'0'    PAGES SWAPPED IN                        Y02901         
SMF4SIN  EQU   SMF4PSI                                           Y02901         
SMF4PSO  DS    BL4'0'    PAGES SWAPPED OUT                       Y02901         
SMF4SOUT EQU   SMF4PSO                                           Y02901         
SMF4VPI  DS    BL4'0'    VAM PAGE INS                            Y02132         
SMF4VPO  DS    BL4'0'    VAM PAGE OUTS                           Y02132         
*        PERFORMANCE SECTION                                                    
SMF4SST  DS    BL4'0'              STEP SERVICE TIME           @YM07459         
SMF4ACT  DS    BL4'0'              STEP ACTIVE TIME            @YM07459         
SMF4PGNO DS    BL2'0'      Step performance group number:          @LZC         
*                          - Valid only if workload management     @LZA         
*                            compatibility mode in effect.         @LZA         
*                          - Zero if workload management goal      @LZA         
*                            mode in effect when the Type 4        @LZA         
*                            record is generated.                  @LZA         
SMF4TRAN DS    BL4'0'      STEP TRANSACTION RESIDENCY TIME     @Z40FPPF         
SMF4CPM  DS    BL4'0'      CREAD PAGE MISS COUNT                   @DFC         
SMF4RCLM DS    BL4'0'      NUMBER OF VIO RECLAIMS              @Z40FPPF         
SMF4CPGN DS    BL4'0'      NUMBER OF COMMON PAGE-INS           @Z40FPPF         
SMF4HSPI DS    BL4'0'      HIPERSPACE PAGE IN COUNT                @LBC         
SMF4PGST DS    BL4'0'      NUMBER OF PAGES STOLEN FROM         @Z40FPPF         
*                          THIS MEMORY                         @Z40FPPF         
SMF4PSEC DS    CL8         COUNT OF PAGE SECONDS               @Z40FPPF         
SMF4LPAI DS    BL4'0'      LPA PAGE INS                        @G50FPRL         
SMF4HSPO DS    BL4'0'      HIPERSPACE PAGE OUT COUNT               @LBC         
SMF4CPUS DS    BL4'0'      STEP CPU SERVICE                    @G50FPRL         
SMF4IOCS DS    BL4'0'      STEP I/O SERVICE                    @G50FPRL         
SMF4MSOS DS    BL4'0'      STEP MAIN STORAGE SERVICE           @G50FPRL         
SMF4SRBS DS    BL4'0'      STEP SRB SERVICE                    @G50FPRL         
SMF4RSV1 DS    CL8' '      RESERVED                            @YA15607         
         AGO   .CONTB                                                           
.IFAS005 ANOP                                                                   
         EJECT                                                                  
* THIS RECORD IS WRITTEN AT  NORMAL OR ABNORMAL TERMINATION OF A JOB.           
* RECORD LENGTH IS VARIABLE. MINIMUM OF 117.                                    
*                                                                               
         DS    0F        ALIGN TO FULL WORD BOUNDARY                            
SMFRCD5  EQU   *         HEADER SEGMENT                                         
SMF5LEN  DS    BL2'0'    RECORD LENGTH                                          
SMF5SEG  DS    BL2'0'    SEGMENT DESCRIPTOR                                     
SMF5FLG  DC    BL1'0'    HEADER FLAG BYTE                                       
SMF5RTY  DC    BL1'0'    RECORD TYPE 5                                          
SMF5TME  DC    BL4'0'    TOD USING FORMAT FROM TIME MACRO W/BIN. INTVL.         
SMF5DTE  DC    PL4'0000' DATE, PACKED DEC. FORM : OOYYDDDF(F IS A SIGN)         
SMF5SID  DC    CL4' '    SYSTEM IDENTIFICATION                   Y02901         
SMF5JBN  DC    CL8' '    JOB NAME                                               
SMF5RST  DC    BL4'0'    READER START TIME FOR JOB (IN 100THS/SECONDS)          
SMF5RSD  DC    PL4'0000' READER START DATE,PACKED DECIMAL FORMAT                
SMF5UIF  DC    CL8' '    USER IDENTIFICATION FIELD                              
SMF5NST  DC    BL1'0'    NUMBER OF STEPS IN THE JOB                             
SMF5JIT  DC    BL4'0'    JOB INITIATION TIME (IN 100THS/SECONDS)                
SMF5JID  DC    PL4'0000' JOB INITIATION DATE, PACKED DECIMAL FORMAT             
SMF5NCI  DC    BL4'0'    NUMBER OF CARD-IMAGE RECORDS IN DD DATA OR DD*         
*                        DATA SETS                                              
SMF5JCC  DC    BL2'0'    JOB COMPLETION CODE                                    
SMF5JPTY DC    BL1'0'    JOB PRIORITY                                           
SMF5RSTT DC    BL4'0'    READER STOP TIME FOR JOB (IN 100THS/SECONDS)           
SMF5RSTD DC    PL4'0000' READER STOP DATE FOR JOB (IN PACKED DEC.FORM)          
SMF5JBTI DC    BL1'0'    JOB TERMINATION INDICATOR                              
*                           0-FIELD SMF5JCPU NOT VALID FOR SP410 @LAC           
*                            WHEN ACTJTIME IS >3 BYTES           @DGA           
*                           1-CANCELLED AT EXIT IEFUJV                          
*                           2-CANCELLED AT EXIT IEFUJI                          
*                           3-CANCELLED AT EXIT IEFUSI                          
*                           4-CANCELLED AT EXIT IEFACTRT                        
*                           5-RESERVED                                          
*                           6-O=NORMAL COMPLETION                               
*                             1=ABEND                                           
*                           7-RESERVED                                          
SMF5SMCI DC    BL1'0'    RESV-FORMERLY SYSOUT CLASSES INDICATOR  Y02120         
SMF5TRAN DC    BL4'0'    TOTAL TRANSACTION RESIDENCY TIME      @ZM01380         
SMF5CKRE DC    BL1'0'    RESV                                                   
SMF5RDCL DC    BL1'0'    READER DEVICE CLASS                                    
SMF5RUTY DC    BL1'0'    READER UNIT TYPE                                       
SMF5JICL DC    CL1' '    JOB INPUT CLASS                                        
SMF5SPK  DC    BL1'0'    STORAGE PROTECT KEY                     A40791         
SMF5SRBT DC    BL3'0'    JOB CPU TIME UNDER SRB(.01 SEC)       @YL026WA         
SMF5TJS  DS    BL4'0'    TOTAL JOB SERVICE(SERVICE UNITS)        Y02133         
SMF5TTAT DS    BL4'0'    TOTAL TRANSACTION ACTIVE TIME FOR JOB   Y02133         
SMF5RV2  DS    BL4'0'    RESERVED                              @YL026WA         
SMF5PGNO DC    BL2'0'    Performance group number                  @LZC         
*                          - Valid only if workload management     @LZA         
*                            compatibility mode in effect.         @LZA         
*                          - Zero if workload management goal      @LZA         
*                            mode in effect when the Type 5        @LZA         
*                            record is generated.                  @LZA         
SMF5RV3  DC    CL2' '    RESERVED                              @YL026WA         
SMF5TLEN DC    BL1'0'    TOTAL LENGTH OF ACCT SECT OF RECORD @G50FPRL           
SMF5PRGN DC    CL20' '   PROGRAMMER'S NAME                                      
SMF5JCPU DC    BL3'0'    RESERVED                                  @LAC         
SMF5ACTF DC    BL1'0'    NUMBER OF ACCOUNTING FIELDS                            
SMF5JSAF DS    0C        JOB STATEMENT ACCOUNTING FIELDS(VARIABLE)              
*                                                                               
*        EACH ENTRY FOR AN ACCOUNTING FIELD CONTAINS THE LENGTH OF THE          
*        FIELD(1 BYTE,BINARY),FOLLOWED BY THE FIELD (EBCDIC).AN OMITTED         
*        FIELD IS REPRESENTED BY A LENGTH INDICATOR OF 0.                       
SMF5CPUS DS    BL4'0'    JOB CPU SERVICE                       @G50FPRL         
SMF5IOCS DS    BL4'0'    JOB I/O SERVICE                       @G50FPRL         
SMF5MSOS DS    BL4'0'    JOB MAIN STORAGE SERVICE              @G50FPRL         
SMF5SRBS DS    BL4'0'    JOB SRB SERVICE                       @G50FPRL         
SMF5RSV1 DS    CL8' '    RESERVED                              @YA15607         
         AGO   .CONTB                                                           
.IFAS006 ANOP                                                                   
         EJECT                                                                  
* IN JES2, THIS RECORD IS WRITTEN FOR EACH JOB OUTPUT ELEMENT, @YL02120         
* WHICH REPRESENTS A GROUP OF DS DIFFERENTIATED BY PUNCH OR    @YL02120         
* PRINTER SETUP & TYPE OF OUTPUT(EG HELD VS NON-HELD).         @YL02120         
* FOR JES3, WRITTEN FOR EACH COPY OF A DATA SET                    @T8C         
*                                                                               
         DS    0F        ALIGN TO FULL WORD BOUNDARY                            
SMFRCD6  EQU   *         HEADER SEGMENT                                         
SMF6LEN  DS    BL2'0'    RECORD LENGTH                                          
SMF6SEG  DS    BL2'0'    SEGMENT DESCRIPTOR                                     
SMF6FLG  DC    BL1'0'    HEADER FLAG BYTE                                       
SMF6RTY  DC    BL1'0'    RECORD TYPE 6                                          
SMFJ6    EQU   6         PRINT/PUNCH RECORD TYPE                   @T8A         
SMF6TME  DC    BL4'0'    TOD, USING FORMAT FROM TIME MACRO W/BIN. INTVL         
SMF6DTE  DC    PL4'0000'      DATE IN PACKED DECIMAL FORM: 00YYDDDF             
SMF6SID  DC    CL4' '    SYSTEM IDENTIFICATION                   Y02901         
SMF6JBN  DC    CL8' '   JOB NAME                                                
SMF6RST  DC    BL4'0'   RDR START TIME, TIME JOB CARD 1ST READ @YL02120         
SMF6RSD  DC    PL4'0000' READER START DATE  00YYDDDF                            
SMF6UIF  DC    CL8' '   USER ID FIELD                                           
SMF6OWC  DC    CL1' '   OUTPUT WTR CLASS, BLANK FOR NON-SYSOUT @YL02120         
SMF6WST  DC    BL4'0'   WRITER START TIME                                       
SMF6WSD  DC    PL4'0000' WRITER START DATE                                      
SMF6NLR  DC    BL4'0'   # OF LOGICAL RECORDS HANDLED BY WRITER @YL02120         
*                       PER FORM # PER CLASS, INCLUDES REPEATS @YL02120         
*                       AND RESTARTS.                          @YL02120         
SMF6IOE  DC    BL1'0'   IO ERROR INDICATOR:                                     
*                       BITS 0-4 RESERVED                        Y02120         
SMF6DIE  EQU   X'04'    5 - DATA INPUT ERROR                   @ZA05171         
*                       6 - RESV                                 Y02120         
SMFCBIE  EQU   X'01'    7 - CONTROL BLOCK INPUT ERROR          @ZA05171         
SMF6NDS  DC    BL1'0'   # OF DATA SETS PROCESSED BY THE OUTPUT   Y02120         
*                       WRITER AND INCLUDED IN THIS RECORD.      Y02120         
*                       (COUNT FOR EACH TIME A DS IS PRINTED)    Y02120         
*                       DOES NOT INCLUDE RESTARTS.             @YL02120         
SMF6FMN  DC    CL4' '   FORM NUMBER                                             
SMF6PAD1 DC    BL1'0'   STATUS INDICATORS - THE SECTIONS WILL BE IN THE         
*                                           ORDER LISTED BELOW WHEN THE         
*                                           BIT IS TURNED ON       @T8C         
*                       BIT  MEANING                           @ZA10800         
SMF6FEXT EQU   X'80'     0   1 - FIRST EXTENSION PRESENT       @ZA10800         
SMF6REXT EQU   X'40'     1   1 - COMMON SECTION PRESENT            @TBC         
SMF6SEXT EQU   X'20'     2   1 - SECOND EXTENSION PRESENT          @T8A         
SMF6ESS1 EQU   X'10'     3   1 - ENHANCED SYSOUT SECTION PRESENT   @LEA         
SMF6FTFR EQU   X'08'     4   1 - FILE TRANSFER SECTION PRESENT     @04A         
*                       5-7  RESERVED                              @04C         
SMF6SBS  DS    BL2      SUBSYSTEM GENERATING ID                @YL02120         
*                       EXTWTR=0, JES2=2, JES3=5, PSF=7,           @T8C         
*                       IP PrintWay = 9                            @05A         
SMF6LN1  DS    BL2      LENGTH OF SECTION INCLUDING THIS FIELD     @T8C         
SMF6DCI  DS    BL1      DS CONTROL INDICATORS FOR DATA GROUP       @T8C         
SMF6DCRV EQU   X'80'    0 - RESERVED                               @T8C         
SMF6SDS  EQU   X'40'    1 - SPUN OFF DS                        @ZA05171         
SMF6OCN  EQU   X'20'    2 - TERMINATED BY OPERATOR             @ZA05171         
SMF6ORD  EQU   X'10'    3 - INTERRUPTED BY OPERATOR (JES2)     @ZA05171         
*                           OPERATOR RESTARTED DATA SET        @ZA05171         
*                           WITH DESTINATION (JES3)            @ZA05171         
SMF6OR   EQU   X'08'    4 - RESTARTED BY OPERATOR              @ZA05171         
SMF6ROR  EQU   X'04'    5 - CONT OF INTERRUPTED GROUP (JES2)   @ZA05171         
*                           RECEIVED OP RESTARTED DS(JES3)     @ZA05171         
SMF6OSS  EQU   X'02'    6 - CARRIAGE OVERRIDEN BY OPER(JES2)   @ZA05171         
*                           OPERATOR STARTED WITH              @ZA05171         
*                           SINGLE SPACE(JES3)                 @ZA05171         
SMF6INT  EQU   X'01'    7 - PUNCH WAS INTERPRETED              @ZA05171         
SMF6INDC DS    BL1      INDICATOR BITS                             @T8A         
*                       BITS 0-3 ARE RESERVED FOR FUTURE EXPANSION @T8A         
*                       OF DATASET CONTROL INDICATORS              @T8A         
*                       BITS 4-7 ARE RECORD LEVEL INDICATORS IN    @T8A         
*                       BIT VALUE FORMAT. EXAMPLE: LEVEL  1=X'01'  @T8A         
*                                                  LEVEL 12=X'0C'  @T8A         
*                                                  LEVEL 15=X'0F'  @T8A         
*                       THIS NUMBER WILL BE INCREMENTED BY 1       @T8A         
*                       EACH TIME A NEW RELEASE CHANGES THE RECORD @T8A         
SMF6LEV2 EQU   X'01'    THIS VARIABLE IS FOR JES2 TO SET THE LEVEL @T8A         
*                       INDICATOR BITS.                            @TBC         
SMF6J2L3 EQU   X'03'    THIS VARIABLE IS FOR JES2 TO SET THE LEVEL @TBA         
*                       INDICATOR BITS.                            @TBA         
SMF6J2L4 EQU   X'04'    THIS VARIABLE IS FOR JES2 TO SET THE LEVEL @QXA         
*                       INDICATOR BITS FOR SECURITY SUPPORT        @QXA         
SMF6LEV3 EQU   X'01'    THIS VARIABLE IS FOR JES3 TO SET THE LEVEL @T8A         
*                       INDICATOR BITS.                            @TBC         
SMF6J3L3 EQU   X'03'    THIS VARIABLE IS FOR JES3 TO SET THE LEVEL @TBA         
*                       INDICATOR BITS.                            @TBA         
SMF6J3L4 EQU   X'04'    THIS VARIABLE IS FOR JES3 TO SET THE LEVEL @QXA         
*                       INDICATOR BITS FOR SECURITY SUPPORT        @QXA         
*                       INDICATOR BITS.                            @TBA         
SMF6LEV4 EQU   X'05'    MVS/JES2 RELEASE 4.1.0                     @P2C         
SMF6LEV6 EQU   X'06'    PSF/MVS RELEASE 3.1.0                      @08A         
SMF6LEV7 EQU   X'07'    Z/OS RELEASE V1R5                          @L1A         
SMF6JNM  DS    CL4      WHEN SMF6INDC                              @P3C         
*                       CONTAINS A X'1', THIS FIELD CONTAINS       @P3C         
*                       A FOUR-DIGIT EBCDIC JOB NUMBER.            @P3C         
*                       WHEN SMF6INDC CONTAINS A X'3' OR GREATER,  @P3C         
*                       AND THE JOB NUMBER HAS MORE THAN 4 DIGITS, @P3C         
*                       THIS FIELD CONTAINS ZEROS.                 @P3C         
*                       IF THE JOB NUMBER IS < OR = TO 9999,       @P3C         
*                       THIS FIELD CONTAINS THE JOB NUMBER.        @P3C         
*                       FOR AN APPC TRANSACTION, THIS FIELD        @P3C         
*                       CONTAINS ZEROES. THE CORRECT JOB NUMBER OR @P3C         
*                       APPC TRANSACTION ID IS FOUND IN SMF6JBID.  @P3C         
SMF6OUT  DS    CL8      LOGICAL OUTPUT DEVICE NAME             @YL02120         
*                       FOR THE 3820, ACF/VTAM LOGICAL UNIT NAME   @T6A         
SMF6FCB  DS    CL4      FCB ID                                   Y02120         
SMF6UCS  DS    CL4      UCS ID                                   Y02120         
*                       END OF RECORD FOR EXTERNAL WTR         @YM04806         
SMF6PGE  DS    BL4      APPROXIMATE PHYSICAL PAGE COUNT            @T6C         
*                                                              @YL02120         
SMF6J2S  EQU   *        BEGIN JES2 ONLY SECTION                @YL02120         
SMF6RTE  DS    BL2      OUTPUT ROUTE CODE OR ZERO              @G387P27         
SMF6END2 DS    0X       END OF JES2 RECORD                         @T8A         
SMF6SIZ2 DS    0XL(SMF6END2-SMFRCD6) SIZE OF JES2 SMF6 RECORD      @T8A         
*                                    EXCLUDING OPTIONAL EXTENSIONS @T8A         
SMF6SIZ3 DS    0XL(SMF6END2-SMF6LN1) SIZE OF JES2 SMF6 RECORD      @T8A         
*                                    FROM SMF6LN1 TO HERE          @T8A         
*                                                              @YL02120         
         ORG   SMF6J2S                                         @YL02120         
SMF6J3S  EQU   *        BEGIN JES3 ONLY SECTION                @YL02120         
SMF6DFE  DS    BL2      DATA FORMAT ERROR INDICATORS           @YL02120         
*                       BITS 0-5 RESV                          @YL02120         
SMF6CCE  EQU   X'02'    6 - SOME 1ST CHAR CONTROL DATA BAD,    @ZA05171         
*                           DEFAULT USED                       @YL02120         
SMF6RBE  EQU   X'01'    7 - BAD RECORD LENGTH(TRUNCATE OR PAD) @ZA05171         
*                       8-15 RESV                              @YL02120         
SMF6OPR  DS    BL2      OUTPUT PRIORITY                        @YL02120         
SMF6GRP  DS    CL8      LOGICAL OUTPUT DEVICE GROUP NAME       @YL02120         
SMF6RSVJ DS    CL8      RESERVED FOR JES3                      @ZA05171         
SMF6RSVU DS    CL4      RESERVED FOR USER                      @ZA05171         
SMF6END  DS    0X       END OF JES3 RECORD                     @ZA05171         
SMF6SIZ  DS    0XL(SMF6END-SMFRCD6) SIZE OF JES3 SMF6 RECORD   @ZA05171         
*                                   EXCLUDING OPTIONAL EXTENSIONS  @T8A         
SMF6LSIZ DS    0XL(SMF6END-SMF6LN1) SIZE OF JES3 SMF6 RECORD       @T8A         
*                                   FROM SMF6LN1 TO HERE           @T8A         
*                                                                  @T8C         
*    FIRST EXTENSION - NON-IMPACT PRINTING SUBSYSTEM SECTION       @T8C         
*                      THIS SECTION WILL ONLY BE PRESENT WHEN      @T8A         
*                      SMF6SBS IS SET TO 2, 5 OR 7 INDICATING THAT @T8A         
*                      JES2, JES3 OR PSF HAS GENERATED THIS RECORD @T8A         
*                                                                  @T8A         
         ORG   SMF6LN1                                         @ZA10800         
SMF6LN2  DS    BL2      LENGTH FIRST EXTENSION INCLUDING THIS FLD  @T8C         
SMF6CPS  DS    8CL1     COPIES DISTRIBUTION                    @ZA10800         
SMF6CHR  DS    4CL4     TRANSLATE TABLE NAMES FRO CHARS PARM   @ZA10800         
SMF6MID  DS    CL4      COPY MODIFICATION MODULE NAME          @ZA10800         
SMF6FLI  DS    CL4      FLASH OVERLAY NAME                     @ZA10800         
SMF6FLC  DS    BL1      NUMBER OF COPIES FLASHED               @ZA10800         
SMF6BID  DS    BL1      FLAG BYTE                              @ZA10800         
SMF6BTS  EQU   X'80'    THE BTSS WAS USED FOR OUTPUT           @ZA10800         
SMF6OPJ  EQU   X'40'    OPTCD=J WAS USED FOR OUTPUT            @ZA10800         
SMF6CSP  EQU   X'20'    CUT SHEET PRINTER                          @T6A         
SMF6FEND DS    0X       END OF FIRST EXTENSION                     @T8A         
SMF6FSIZ DS    0XL(SMF6FEND-SMF6LN2) SIZE OF FIRST EXTENSION       @T8A         
*                                                                  @T8A         
*      COMMON SECTION - THIS SECTION IS AN EXTENSION OF THE FIXED  @TBC         
*                       HEADER SECTION AND WILL BE WRITTEN BY ALL  @TBC         
*                       GENERATORS OF THE TYPE 6 RECORD. THIS WAS  @TBC         
*                       PREVIOUSLY CALLED THE ROUTING SECTION.     @TBA         
*                                                                  @T8A         
         ORG   SMF6LN1                                             @T8A         
SMF6LN3  DS    BL2      LENGTH OF SECTION INCLUDING THIS FIELD     @T8M         
SMF6ROUT DS    CL4      OUTPUT ROUTE CODE                          @T8M         
SMF6EFMN DS    CL8      OUTPUT FORM NUMBER                         @T8M         
SMF6REND DS    0X       END OF OLD ROUTING SECTION                 @TBC         
SMF6RSIZ DS    0XL(SMF6REND-SMF6LN3)   SIZE OF OLD ROUTING SECTION @TBC         
         DS    CL16     RESERVED                                   @TBA         
SMF6JBID DS    CL8      JOB ID                                     @TBA         
SMF6STNM DS    CL8      STEPNAME                                   @LCA         
SMF6PRNM DS    CL8      PROCEDURE STEP NAME                        @LCA         
SMF6DDNM DS    CL8      DD NAME                                    @LCA         
SMF6USID DS    CL8      USER ID                                    @LCA         
SMF6SECS DS    CL8      SECURITY LABEL (SECLABEL)                  @LCA         
SMF6PRMD DS    CL8      PROCESSING MODE                            @LCA         
SMF6DSNM DS    CL53     DATA SET RESOURCE NAME                     @DLC         
         DS    CL3      RESERVED                                   @DLA         
SMF6OTOK DS    CL20     OUTPUT GROUP TOKEN                         @DKC         
SMF6DEND DS    0X       END OF ROUTING SECTION                     @QXA         
SMF6DSIZ DS    0XL(SMF6DEND-SMF6LN3)  SIZE OF ROUTING SECTION      @QXA         
*                                                                  @02A         
*    ENHANCED SYSOUT SECTION                                       @LEA         
*                                                                               
         ORG   SMF6LN1                                             @LEA         
SMF6LN5  DS    BL2      LENGTH ENHANCED SYSOUT SECTION INCLUDING THIS           
*                          FIELD                                   @LEA         
SMF6SGID DS    BL4      SEGMENT IDENTIFIER                         @LEA         
SMF6IND  DS    BL1      SECTION INDICATOR                          @LEA         
SMF6SJF  EQU   X'80'    ERROR OBTAINING SWBTU - SWBTU DATA AREA    @LEA         
*                          NOT PRESENT                             @LEA         
SMF6RSV  DS    BL1      RESERVED                                   @LEA         
SMF6JDVT DS    CL8      JDVTNAME                                   @LEA         
SMF6TUL  DS    BL2      SWBTU DATA AREA LENGTH                     @LEA         
SMF6TU   DS    0C       SWBTU DATA AREA  -  DATA AREA CAN BE       @LEA         
*                         PROCESSED USING SWBTUREQ MACRO           @LEA         
SMF6EEND DS    0X       END OF ENHANCED SYSOUT SECTION             @LEA         
SMF6ESIZ DS    0XL(SMF6EEND-SMF6LN5) SIZE OF ENHANCED SYSOUT SEC.  @LEA         
*                       MOVED SMF6LN4  TO AOPSMF6                 2@L1D         
*                       MOVED SMF6BNLN TO AOPSMF6                 2@L1D         
*                       MOVED SMF6BNNO TO AOPSMF6                 4@L1D         
*                       MOVED SMF6LN6  TO AOPSMF6                11@L1D         
         AOPSMF6        SMF TYPE 6 ENHANCEMENTS                    @L1A         
         AGO   .CONTB                                                           
         MEND                */                                                 
 %IFABGN2:;                                                                     
 %IFAL00:;                                                    /* @M1C*/         
 %IF IBM_CBGENC = 'YES' %THEN %GOTO IFAL00A;                  /* @M1A*/         
         %IF IFAR00='' %THEN %GOTO IFAL01;                    /* @M1C*/         
 %IFAL00A:;                                                   /* @M1A*/         
    DCL 1 SMFRCD00 BASED(SMF00PTR) BDY(WORD),                                   
 /* RECORD TYPE 0 - IPL                                              */         
 /* FIRST RECORD WRITTEN DURING IPL - OPTIONS IN EFFECT              */         
         3 SMF0LEN FIXED(15),     /* RDW RECORD LENGTH               */         
         3 SMF0SEG FIXED(15),     /* RDW SEGMENT DESCRIPTOR          */         
         3 SMF0FLG BIT(8),        /* OPERATING ENVIRONMENT           */         
         3 SMF0RTY FIXED(8),      /* RECORD TYPE 0                   */         
         3 SMF0TME FIXED(31) BDY(HWORD), /* TOD RECORD WRITTEN       */         
         3 SMF0DTE CHAR(4),       /* DATE RECORD WRITTEN             */         
         3 SMF0SID CHAR(4),       /* SYSTEM ID FROM INSTALLATION     */         
         3 SMF0JWT FIXED(31) BDY(HWORD), /* Continuous wait time                
                                            limit                               
                                            (SMFPRMxx JWT(hhmm) value)          
                                            converted to minutes @P6C*/         
         3 SMF0BUF FIXED(31) BDY(HWORD), /* This field contains                 
                                         meaningless information @0AC*/         
         3 SMF0VST FIXED(31) BDY(HWORD), /* VIRTUAL MEMORY SIZE(1K)  */         
         3 SMF0OPT BIT(8),        /* SMF OPTIONS BYTE                           
                                     0-SYSTEM AND JOB                           
                                     1-STEP                                     
                                     2-EXITS TAKEN                              
                                     3-DATA SET                                 
                                     4-DASD VOLUMES                             
                                     5-RESERVED                                 
                                     6-SCRATCH FOR TEMPORARIES                  
                                     7-=0 FOR BKGD, =1 FOR FRGD      */         
         3 SMF0RST FIXED(31) BDY(WORD,4), /* Real storage size in 1K            
                                     blocks (binary).  This field is            
                                     only accurate below 4TB.  For              
                                     larger systems this contains               
                                     'FFFFFFFF'x.  The SMF0RS4K field           
                                     also represents the system size            
                                     and is not limited to 4 TB.  See           
                                     SMF0RS4K and SMF0RS4K_Not_Valid            
                                     for additional instructions for            
                                     determining if SMF0RS4K contains           
                                     valid information.          @0EC*/         
         3 SMF0RSV BIT(8),                /* Reserved            @01A*/         
         3 SMF0OSL CHAR(8),               /* MVS Product name    @01A*/         
         3 SMF0SYN CHAR(8),               /* System name         @01A*/         
         3 SMF0SYP CHAR(8),               /* Sysplex name        @01A*/         
         3 SMF0TZ FIXED(31)       /* Difference in time between local           
                                     time and Greenwich mean time in            
                                     binary units of 1.048576 seconds.          
                                     Copied from CVTTZ.          @P6C*/         
        ,3 SMF0MSWT FIXED(31)     /* Started task wait time limit               
                                     (SMFPRMxx SWT(hhmm) value)                 
                                     converted to minutes        @P6A*/         
        ,3 SMF0MTWT FIXED(31)     /* TSO wait time limit (SMFPRMxx              
                                     TWT(hhmm) value) converted to              
                                     minutes                     @P6A*/         
        ,3 SMF0TBUF FIXED(16)     /* The number of megabytes specified          
                                     by the SMFTBUFF IEASYS parmlib             
                                     option. If the SMFTBUFF parameter          
                                     value is incorrectly specified             
                                     or SMFTBUFF is not specified,              
                                     this value will be zero.    @0AA*/         
        ,3 SMF0_End_V1 CHAR(0)    /* SMF0_Len_V1 is the length to here          
                                                                 @L4A*/         
        ,3 SMF0RS4K FIXED(64) BDY(WORD,3) /* Real storage size at IPL           
                                     in 4K frame units           @L4A*/         
        ,3 SMF0_End_V2 CHAR(0)    /* SMF0_Len_V2 is the length to here          
                                                                 @L4A*/         
        ,3 SMF0_Num_CrypCtrs fixed(15) unsigned /* Number of crypto             
                                     counters supported by this                 
                                     system                      @0EA*/         
        ,3 SMF0_Num_NNPICtrs fixed(15) unsigned /* Number of NNPI               
                                     counters supported by this                 
                                     system                      @0EA*/         
        ,3 SMF0_Flags  Bit(8)     /* Flags                       @0EA*/         
          ,5 SMF0RS4K_Not_Valid Bit(1) /* If the record length in               
                                     SMF0LEN is SMF0_Len_V3 or                  
                                     larger, indicates if SMF0RS4K              
                                     contains a valid value or not.             
                                     - As of z/OS 2.5, SMF0RS4K is              
                                       always set and this bit will             
                                       not be set.                              
                                     - For prior z/OS releases,                 
                                       SMF0RS4K will contain zeros              
                                       and this bit will be set. @0EA*/         
        ,3 SMF0_End_V3 CHAR(0)    /* SMF0_Len_V3 is the length to here          
                                                                 @0EA*/         
        ;                         /* End of SMFRCD00 map         @P6A*/         
 /********************************************************************/         
 /* The value in SMF0LEN, which contains the length of the record,   */         
 /* will match one of the following constants that describes the     */         
 /* length of the record.                                        @0EA*/         
 /********************************************************************/         
    DCL SMF0_Len_V1 Constant(Offset(SMFRCD00.SMF0_End_V1))    /* @L4A*/         
       ,SMF0_Len_V2 Constant(Offset(SMFRCD00.SMF0_End_V2))    /* @L4A*/         
       ,SMF0_Len_V3 Constant(Offset(SMFRCD00.SMF0_End_V3))    /* @0EA*/         
       ,SMF0_Len_Max Constant(SMF0_Len_V3) /* This value might change           
                                     upon any recompile after                   
                                     installation of service or a               
                                     release. Do not use this constant          
                                     unless that is OK.          @0EC*/         
       ;                                                                        
 %IFAL01:;                                                                      
 %IFAL02:;                                                    /* @M1C*/         
 %IF IBM_CBGENC = 'YES' %THEN %GOTO IFAL02A;                  /* @M1A*/         
         %IF IFAR02='' %THEN %GOTO IFAL03;                    /* @M1C*/         
 %IFAL02A:;                                                   /* @M1A*/         
    DCL 1 SMFRCD02 BASED(SMF02PTR) BDY(WORD),                                   
 /* RECORD TYPE 2 - DUMP HEADER                                      */         
 /* WRITTEN AT BEGINNING OF SMF DUMP FILE                            */         
         3 SMF2LEN FIXED(15),     /* RDW RECORD LENGTH               */         
         3 SMF2SEG FIXED(15),     /* RDW SEGMENT DESCRIPTOR          */         
         3 SMF2FLG BIT(8),        /* OPERATING ENVIRONMENT           */         
         3 SMF2RTY FIXED(8),      /* RECORD TYPE 2                   */         
         3 SMF2TME FIXED(31) BDY(HWORD), /* TOD RECORD WRITTEN       */         
         3 SMF2DTE CHAR(4),       /* DATE RECORD WRITTEN             */         
         3 SMF2SID CHAR(4);       /* SYSTEM ID FROM INSTALLATION     */         
 /* RECORD TYPE 2 SUBTYPE 1 - GROUP RECORD                       @L2A*/         
 /* WRITTEN AT THE END OF EVERY DIGITALLY SIGNED GROUP           @L2A*/         
    DCL 1 SMF2GRP BDY(WORD) TYPE  /* Group record                @L2A*/         
         ,2 SMF2GFixedPortion     /* Fixed length portion of rec @0CA*/         
          ,3 SMF2GLEN FIXED(15)   /* Length                      @L2A*/         
          ,3 SMF2GSEG FIXED(15)   /* Segment                     @L2A*/         
          ,3 SMF2GFLG BIT(8)      /* Flags                       @L2A*/         
            ,5 *        BIT(1)    /*                             @L2A*/         
            ,5 SMF2GSTV BIT(1)    /* Subtypes are valid          @L2A*/         
            ,5 *        BIT(6)    /*                             @L2A*/         
          ,3 SMF2GRTY FIXED(8)    /* Type                        @L2A*/         
          ,3 SMF2GTME FIXED(31) BDY(HWORD) /* Time (of last rec in              
                                     group)                      @L2A*/         
          ,3 SMF2GDTE CHAR(4)     /* Date (of last rec in group) @L2A*/         
          ,3 SMF2GSID CHAR(4)     /* System ID (DUMY)            @L2A*/         
          ,3 SMF2GWID CHAR(4)     /* Subsystem ID                @L2A*/         
          ,3 SMF2GSTP FIXED(15)   /* Subtype                     @L2A*/         
          ,3 SMF2GRSID CHAR(4)    /* Group's system ID           @L2A*/         
          ,3 SMF2GFLG2 BIT(8)     /* Flags                       @L2A*/         
            ,5 SMF2GFIRST BIT(1)  /* First group written         @L2A*/         
            ,5 SMF2GGSTV  BIT(1)  /* Group's subtype valid       @L2A*/         
            ,5 SMF2GEXT   BIT(1)  /* When on, This group's type is              
                                     in SMF2GRTYPX.                             
                                     When off, This group's type is             
                                     in SMF2GRTYPE.              @P9A*/         
            ,5 SMF2GMinuteBdyFct BIT(1)  /* When on, indicates that             
                                     THIS record was generated on a             
                                     system where the fix for OA55526           
                                     was applied.                @0BA*/         
            ,5 SMF2GSelfDefiningSectionExists Bit(1) /* When on,                
                                     indicates that self defining               
                                     section exists              @0CA*/         
            ,5 *          BIT(3)  /* Reserved                    @0CC*/         
          ,3 SMF2GRTYPE FIXED(8)  /* Group's type                @L2A           
                                     This field is only filled in               
                                     when SMF2GEXT is off.       @P9A*/         
          ,3 SMF2GSTYPE FIXED(15) /* Group's subtype             @L2A*/         
          ,3 SMF2GFTME FIXED(31)  /* Group's start time          @L2A*/         
          ,3 SMF2GFDTE CHAR(4)    /* Group's start date          @L2A*/         
          ,3 SMF2GCNT FIXED(31)   /* Group's record count        @L2A*/         
          ,3 SMF2GHASHMETH CHAR(1) /* Hash method flag           @L2A*/         
          ,3 SMF2GSIGTYPE CHAR(1) /* Signature type flag         @L2A*/         
          ,3 SMF2GTOKENNAME CHAR(32) /* Token name               @L2A*/         
          ,3 SMF2GRTYPX FIXED(16) /* Group's type                               
                                     This field is only filled in               
                                     when SMF2GEXT is on.        @P9A*/         
          ,3 SMF2GSIGLEN FIXED(31) /* Signature Length           @L2A*/         
         ,2 SMF2GSIG CHAR(512)    /* Signature.  The length of this             
                                     field is in SMF2GSIGLEN.    @0CC*/         
         ,2 SMF2GEND Char(0)      /* End                         @0CC*/         
        ;                         /* Group record                @L2A*/         
 /* Self Defining Section for group records. Located at                         
    Addr(SMF2GSIG)+SMF2GSIGLEN.                                  @0CA*/         
    Dcl 1 SMF2GSelfDefiningSection Type                                         
        , 3 SMF2GSDSLen      Fixed(15) /* Self Defining section                 
                                             Length              @0CA*/         
        , 3 *                Char(2)   /* Reserved for alignment @0CA*/         
        , 3 SMF2GSDSASignOffSet Fixed(31) /* Offset from beginning of           
                                          record to first ARECSIGN              
                                          section                @0CA*/         
        , 3 SMF2GSDSASignLen Fixed(15) /* ARECSIGN Section length               
                                                                 @0CA*/         
        , 3 SMF2GSDSASignNum Fixed(15) /* Number of ARECSIGN Sections           
                                                                 @0CA*/         
        ;                                                                       
 /* ARECSIGN section located at addr(SMFRCD02)+SMF2GSDSASignOffset.             
                                                                 @0CA*/         
    Dcl 1 SMF2GASignSection Type                                                
        , 3 SMF2GASignHeader                                                    
          , 5 SMF2GASignHashMeth  Char(1)  /* Alternate Signature               
                                               Hash Method Flag  @0CA*/         
          , 5 SMF2GASignSigType   Char(1)  /* Alternate Sig Type @0CA*/         
          , 5 SMF2GASignTokenName Char(32) /* Alt Sig Token Name @0CA*/         
          , 5 *                Char(2) /* reserved for alignment @0CA*/         
          , 5 SMF2GASignSigLen Fixed(31)   /* Length of SMF2GASignSig           
                                                                 @0CA*/         
        , 3 SMF2GASignSig Char(*)    /* Alternate Signature.  The               
                                     length of this field is in                 
                                     SMF2GASignSigLen.           @0CA*/         
        ;                                                                       
 /* RECORD TYPE 2 SUBTYPE 2 - INTERVAL RECORD                    @L2A*/         
 /* WRITTEN AT THE END OF INTERVAL WHEN DIGITALLY SIGNING        @L2A*/         
    DCL 1 SMF2INT BDY(WORD) TYPE  /* Interval record             @L2A*/         
         ,2 SMF2IFixedPortion     /* Fixed length portion of rec @0CA*/         
          ,3 SMF2ILEN FIXED(15)   /* Length                      @L2A*/         
          ,3 SMF2ISEG FIXED(15)   /* Segment                     @L2A*/         
          ,3 SMF2IFLG BIT(8)      /* Flags                       @L2A*/         
            ,5 *       BIT(1)     /*                             @L2A*/         
            ,5 SMF2ISTV BIT(1)    /* Subtypes are valid          @L2A*/         
            ,5 *       BIT(6)     /*                             @L2A*/         
          ,3 SMF2IRTY FIXED(8)    /* Type                        @L2A*/         
          ,3 SMF2ITME FIXED(31) BDY(HWORD) /* Interval's time    @L2A*/         
          ,3 SMF2IDTE CHAR(4)     /* Interval's date             @L2A*/         
          ,3 SMF2ISID CHAR(4)     /* System ID (DUMY)            @L2A*/         
          ,3 SMF2IWID Char(4)     /* Subsystem ID                @L2A*/         
          ,3 SMF2ISTP FIXED(15)   /* Subtype                     @L2A*/         
          ,3 SMF2IRSID CHAR(4)    /* Interval's system ID        @L2A*/         
          ,3 SMF2IFLG2 BIT(8)     /* Flags                       @L2A*/         
            ,5 SMF2IFIRST BIT(1)  /* First interval written      @L2A*/         
            ,5 SMF2IISTV  BIT(1)  /* Interval's subtype valid    @L2A*/         
            ,5 SMF2IHALT  BIT(1)  /* Halt driven interval        @L2A*/         
            ,5 SMF2INCO   BIT(1)  /* New Crypto Options          @L2A*/         
            ,5 SMF2IEXT   BIT(1)  /* When on, This interval's type is           
                                     in SMF2IRTYPX.                             
                                     When off, This interval's type is          
                                     in SMF2IRTYPE.                             
                                     This bit will always be on                 
                                     for records generated on a                 
                                     z/OS 2.3 or above system.   @P9A*/         
            ,5 SMF2IClInt BIT(1)  /* This is a close interval    @09A*/         
            ,5 SMF2IMinuteBdyFct BIT(1)  /* When on, indicates that             
                                     this record was generated on a             
                                     system where the fix for OA55526           
                                     was applied.                @0BA*/         
            ,5 SMF2ISelfDefiningSectionExists Bit(1) /* When on,                
                                     indicates taht self defining               
                                     section exists              @0CA*/         
          ,3 SMF2IRTYPE FIXED(8)  /* Interval's type             @L2A           
                                     This field is only filled in               
                                     when SMF2IEXT is off.       @P9C*/         
          ,3 SMF2ISTYPE FIXED(15) /* Interval's subtype          @L2A*/         
          ,3 SMF2IFTME FIXED(31)  /* First record's time         @L2A*/         
          ,3 SMF2IFDTE CHAR(4)    /* First record's date         @L2A*/         
          ,3 SMF2ILTME FIXED(31)  /* Last record's time          @L2A*/         
          ,3 SMF2ILDTE CHAR(4)    /* Last record's date          @L2A*/         
          ,3 SMF2INTME FIXED(31)  /* Next interval's time        @L2A*/         
          ,3 SMF2INDTE CHAR(4)    /* Next interval's date        @L2A*/         
          ,3 SMF2ICNT FIXED(31)   /* Interval's record count     @L2A*/         
          ,3 SMF2IHASHMETH CHAR(1) /* Hash method flag           @L2A*/         
          ,3 SMF2ISIGTYPE CHAR(1) /* Signature type flag         @L2A*/         
          ,3 SMF2ITOKENNAME CHAR(32) /* Token name               @L2A*/         
          ,3 SMF2IRTYPX FIXED(16) /* Intervals type                             
                                     This field is only filled in               
                                     when SMF2IEXT is on.        @P9C*/         
          ,3 SMF2ISIGLEN FIXED(31) /* Signature length           @L2A*/         
         ,2 SMF2ISIG CHAR(512)    /* Signature.  The length of this             
                                     field is in SMF2ISIGLEN.    @0CA*/         
         ,2 SMF2IEND CHAR(0)      /* End                         @0CC*/         
        ;                         /* End interval record         @L2A*/         
 /* Self Defining Section for group records. Located at                         
    Addr(SMF2ISIG)+SMF2ISIGLEN)                                  @0CA*/         
    Dcl 1 SMF2ISelfDefiningSection Type                                         
        , 3 SMF2ISDSLen      Fixed(15) /* Self Defining section Length          
                                                                 @0CA*/         
        , 3 *                Char(2)   /* Reserved for alignment @0CA*/         
        , 3 SMF2ISDSASignOffSet Fixed(31) /* ARECSIGN Section Offset            
                                                                 @0CA*/         
        , 3 SMF2ISDSASignLen Fixed(15) /* ARECSIGN Section Length               
                                                                 @0CA*/         
        , 3 SMF2ISDSASignNum Fixed(15) /* Number of ARECSIGN Sections           
                                                                 @0CA*/         
        ;                                                                       
 /* ARECSIGN section located at addr(SMFRCD02)+SMF2IASignOffset.                
                                                                 @0CA*/         
    Dcl 1 SMF2IASignSection Type                                                
        , 3 SMF2IASignHeader                                                    
          , 5 SMF2IASignHashMeth Char(1) /* Alternate Signature                 
                                            Hash Method Flag     @0CA*/         
          , 5 SMF2IASignSigType  Char(1) /* Alternate Sig Type   @0CA*/         
          , 5 SMF2IASignTokenName Char(32) /* Alt Sig Token Name @0CA*/         
          , 5 SMF2IASignFlgs  Bit(8)   /* Flags for Alt Sig      @0CA*/         
            , 7 SMF2IAsignNCO Bit(1)   /* New Crypto opts        @0CA*/         
            , 7 *             Bit(7)   /* reserved               @0CA*/         
          , 5 *                Char(1) /* reserved for alignment @0CA*/         
          , 5 SMF2IASignSigLen Fixed(31) /* Length of SMF2IASignSig             
                                                                 @0CA*/         
        , 3 SMF2IASignSig Char(*)      /* Alternate Signature.  The             
                                          length of this field is in            
                                          SMF2IASignSigLen.      @0CA*/         
        ;                                                                       
 %IFAL03:;                                                    /* @M1C*/         
 %IF IBM_CBGENC = 'YES' %THEN %GOTO IFAL03A;                  /* @M1A*/         
         %IF IFAR03='' %THEN %GOTO IFAL04;                    /* @M1C*/         
 %IFAL03A:;                                                   /* @M1A*/         
    DCL 1 SMFRCD03 BASED(SMF03PTR) BDY(WORD),                                   
 /* RECORD TYPE 3 - DUMP TRAILER                                     */         
 /* WRITTEN AT END OF SMF DUMP FILE                                  */         
         3 SMF3LEN FIXED(15),     /* RDW RECORD LENGTH               */         
         3 SMF3SEG FIXED(15),     /* RDW SEGMENT DESCRIPTOR          */         
         3 SMF3FLG BIT(8),        /* OPERATING ENVIRONMENT           */         
         3 SMF3RTY FIXED(8),      /* RECORD TYPE 3                   */         
         3 SMF3TME FIXED(31) BDY(HWORD), /* TOD RECORD WRITTEN       */         
         3 SMF3DTE CHAR(4),       /* DATE RECORD WRITTEN             */         
         3 SMF3SID CHAR(4);       /* SYSTEM ID FROM INSTALLATION     */         
 %IFAL04:;                                                    /* @M1C*/         
 %IF IBM_CBGENC = 'YES' %THEN %GOTO IFAL04A;                  /* @M1A*/         
         %IF IFAR04='' %THEN %GOTO IFAL05;                    /* @M1C*/         
 %IFAL04A:;                                                   /* @M1A*/         
    DCL 1 SMFRCD04 BASED(SMF04PTR) BDY(WORD),                                   
 /* RECORD TYPE 4 - STEP TERMINATE                                   */         
 /* WRITTEN AT NORMAL OR ABNORMAL TERMINATION OF A BGD JOB STEP      */         
         3 SMF4LEN FIXED(15),     /* RDW RECORD LENGTH               */         
         3 SMF4SEG FIXED(15),     /* RDW SEGMENT DESCRIPTOR          */         
         3 SMF4FLG BIT(8),        /* OPERATING ENVIRONMENT           */         
         3 SMF4RTY FIXED(8),      /* RECORD TYPE 4                   */         
         3 SMF4TME FIXED(31) BDY(HWORD), /* TOD RECORD WRITTEN       */         
         3 SMF4DTE CHAR(4),       /* DATE RECORD WRITTEN             */         
         3 SMF4SID CHAR(4),       /* SYSTEM ID FROM INSTALLATION     */         
         3 SMF4JBN CHAR(8),       /* JOB NAME                        */         
         3 SMF4RST FIXED(31) BDY(HWORD), /* READER START TIME(.01 SEC)*/        
         3 SMF4RSD CHAR(4),       /* READER START DATE               */         
         3 SMF4UIF CHAR(8),       /* USER IDENTIFICATION FIELD       */         
         3 SMF4STN FIXED(8),      /* STEP NUMBER                     */         
         3 SMF4SIT FIXED(31) BDY(WORD,4), /* STEP INITIATION TIME    */         
         3 SMF4STID CHAR(4),      /* STEP INITATION DATE             */         
         3 SMF4NCI FIXED(31) BDY(WORD,4), /* SPOOL IN COUNT          */         
         3 SMF4SCC FIXED(16) BDY(WORD,4), /* STEP COMPLETION CODE    */         
         3 SMF4PRTY FIXED(8),     /* DISPATCHING PRIORITY            */         
         3 SMF4PGMN CHAR(8),      /* PROGRAM NAME                    */         
         3 SMF4STMN CHAR(8),      /* STEP NAME                       */         
         3 SMF4RSV5 FIXED(16),    /* RESERVED                    @PVC*/         
         3 SMF4SYST FIXED(16),    /* SYS AREA USED-TOP OF PRIVATE(1K)*/         
         3 SMF4STU FIXED(16),     /* STOR USED-LOW OF PRIVATE(1K)    */         
          5 SMF4H0ST FIXED(16),                                                 
         3 SMF4RV1 CHAR(2),       /* RESERVED                    @PVC*/         
         3 SMF4PRV FIXED(31) BDY(HWORD), /* RGN REQ IN PRIVATE   @PVM*/         
          5 SMF4RSH0 FIXED(31) BDY(HWORD), /* RGN REQUEST IN PRIVATE            
                                     AREA IN 1K UNITS            @PVM*/         
         3 SMF4SPK FIXED(8),      /* STORAGE PROTECT KEY             */         
         3 SMF4STI BIT(8),        /* STEP TERMINATION INDICATOR                 
                                     0-RESV                                     
                                     1-CANCELLED AT EXIT IEFUJV                 
                                     2-CANCELLED AT EXIT IEFUJI                 
                                     3-CANCELLED AT EXIT IEFUSI                 
                                     4-CANCELLED AT EXIT IEFACTRT               
                                     5-STEP TO BE RESTARTED  @YL026WA           
                                     6-ABEND                                    
                                     7-STEP FLUSHED                  */         
         3 SMF4RV2 CHAR(2),       /* RESV                            */         
         3 SMF4AST FIXED(31) BDY(HWORD), /* DEVICE ALLOC START TIME  */         
         3 SMF4PPST FIXED(31) BDY(HWORD), /* PROB PROG START TIME    */         
         3 SMF4RV3 CHAR(1),       /* RESV                    @YL026WA*/         
         3 SMF4SRBT PTR(24) BDY(WORD,4), /* STEP CPU UNDER SRB                  
                                                             @YL026WA*/         
         3 SMF4RIN BIT(16),       /* RECORD INDICATORS               */         
          5 * BIT(4),             /* 0-3 RESV                    @DGC*/         
          5 SMFBIT4 BIT(1),       /* 4 SMF4SETM NOT VALID FOR SP410             
                                       SEE TYPE 30 RECORD                       
                                       WHEN ACTJTIME IS >3 BYTES @LAC*/         
          5 * BIT(1),              /*5 DEVICE DATA NOT RECORDED  @DAC*/         
          5 SMF4IEX BIT(1),       /* 6 POSSIBLE ERROR IN DEV ENTRY   */         
          5 * BIT(9),             /* 7 =0 VIRT, =1 REAL STORAGE      */         
                                  /* 8-15 RESV                       */         
         3 SMF4RLCT FIXED(15),    /* OFFSET TO RELOCATE SECTION      */         
         3 SMF4LENN FIXED(15);    /* LGTH OF EXCP SECTION + THESE 2  */         
    DCL 1 SMF4EXPS BASED BDY(WORD), /* EXCP SECTION, ENTRY FOR EACH             
                                     DEVICE OF EACH NON-SPOOLED DS   */         
 /*                                                                  */         
 /* Note: Virtual I/O Devices are identified by the following:   @LYA*/         
 /*       Device Class 0                                         @LYA*/         
 /*       Unit Type 0                                            @LYA*/         
 /*       Device Number x'7FFF'                                  @LYA*/         
 /*                                                                  */         
         3 SMF4CUT CHAR(2),       /* DEVICE CLASS AND UNIT TYPE      */         
          5 SMF4DEVC CHAR(1),     /* DEVICE CLASS                    */         
          5 SMF4UTYP CHAR(1),     /* UNIT TYPE                       */         
         3 SMF4CUAD CHAR(2),      /* Device Number               @LYC*/         
                                  /*                            1@LYD*/         
         3 SMF4EXCP FIXED(31);    /* EXCP COUNT FOR DEVICE OF DS     */         
    DCL 1 SMF4CPUA BASED BDY(WORD), /* CPU  ACCT SECTION HDR    @P1C*/          
         3 SMF4LNTH FIXED(8),     /* LGTH OF CPU AND ACCT SECTIONS   */         
         3 SMF4SETM PTR(24),      /* ACTJTIME WHEN 3 BYTES       @LAC*/         
         3 SMF4NAF PTR(8);        /* NUM OF ACCT FIELDS IN ACCT SECT */         
    DCL 1 SMF4ACTF BASED BDY(BYTE), /* ACCT SECTION                  */         
         3 SMF4ANC PTR(8),        /* # CHAR IN THIS ACCT FIELD       */         
         3 SMF4BCD CHAR(*);       /* ACCT FIELD CHARACTERS           */         
    DCL 1 SMF4RELS BASED BDY(BYTE), /* RELOCATE SECTION              */         
         3 SMF4PGIN FIXED(31) BDY(BYTE), /* # OF PAGE-INS            */         
         3 SMF4PGOT FIXED(31) BDY(BYTE), /* # OF PAGE-OUTS           */         
         3 SMF4NSW  FIXED(31) BDY(BYTE), /* # OF SWAPS               */         
          5 SMF4RGNS FIXED(31) BDY(BYTE),                                       
         3 SMF4PSI  FIXED(31) BDY(BYTE), /* # OF PAGES SWAPPED IN    */         
          5 SMF4SIN  FIXED(31) BDY(BYTE),                                       
         3 SMF4PSO  FIXED(31) BDY(BYTE), /* # OF PAGES SWAPPED OUT   */         
          5 SMF4SOUT FIXED(31) BDY(BYTE),                                       
         3 SMF4VPI  FIXED(31) BDY(BYTE), /* # OF VIO PAGE-INS        */         
         3 SMF4VPO  FIXED(31) BDY(BYTE), /* # OF VIO PAGE-OUTS                  
                                                             @Z40FPPF*/         
         3 SMF4SST FIXED(31) BDY(BYTE), /* STEP SERVICE TIME @YM07459*/         
         3 SMF4TAT FIXED(31) BDY(BYTE), /* STEP TRANSACTION ACTIVE              
                                          TIME               @YM07459*/         
         3 SMF4PGNO FIXED(16) BDY(BYTE), /* Step performance                    
                                            group number         @LZC*/         
                        /* - Valid only if workload management   @LZA*/         
                        /*   compatibility mode in effect.       @LZA*/         
                        /* - Zero if workload management goal    @LZA*/         
                        /*   mode in effect when the Type 4      @LZA*/         
                        /*   record is generated.                @LZA*/         
         3 SMF4TRAN FIXED(31) BDY(BYTE), /* STEP TRANSACTION RESIDENCY          
                                            TIME             @Z40FPPF*/         
         3 SMF4CPM FIXED(31) BDY(BYTE), /* CREAD PAGE MISS COUNT @DFC*/         
         3 SMF4RCLM FIXED(31) BDY(BYTE), /* NUMBER OF VIO RECLAIMS              
                                                             @Z40FPPF*/         
         3 SMF4CPGN FIXED(31) BDY(BYTE), /* NUMBER OF COMMON PAGE-INS           
                                                             @Z40FPPF*/         
         3 SMF4HSPI FIXED(31) BDY(BYTE), /* HIPERSPACE PAGE IN COUNT            
                                                                 @LBC*/         
         3 SMF4PGST FIXED(31) BDY(BYTE), /* NUMBER OF PAGES STOLEN              
                                            FROM THIS MEMORY @Z40FPPF*/         
         3 SMF4PSEC CHAR(8),             /* COUNT OF PAGE SECONDS               
                                                             @Z40FPPF*/         
         3 SMF4LPAI FIXED(31) BDY(BYTE), /* LPA PAGE INS     @G50FPRL*/         
         3 SMF4HSPO FIXED(31) BDY(BYTE), /* HIPERSPACE PAGE OUT COUNT           
                                                                 @LBC*/         
         3 SMF4CPUS FIXED(31) BDY(BYTE), /* STEP CPU SERVICE @G50FPRL*/         
         3 SMF4IOCS FIXED(31) BDY(BYTE), /* STEP I/O SERVICE @G50FPRL*/         
         3 SMF4MSOS FIXED(31) BDY(BYTE), /* STEP MAIN STORAGE SERVICE           
                                                             @G50FPRL*/         
         3 SMF4SRBS FIXED(31) BDY(BYTE), /* STEP SRB SERVICE @G50FPRL*/         
         3 SMF4RSV1 CHAR(8);             /* RESERVED         @YA15607*/         
 %IFAL05:;                                                    /* @M1C*/         
 %IF IBM_CBGENC = 'YES' %THEN %GOTO IFAL05A;                  /* @M1A*/         
         %IF IFAR05='' %THEN %GOTO IFAL06;                    /* @M1C*/         
 %IFAL05A:;                                                   /* @M1A*/         
    DCL 1 SMFRCD05 BASED(SMF05PTR) BDY(WORD),                                   
 /* RECORD TYPE 5 - JOB TERMINATION                                  */         
 /* WRITTEN AT NORMAL OR ABNORMAL TERMINATION OF A JOB               */         
         3 SMF5LEN FIXED(15),     /* RDW RECORD LENGTH               */         
         3 SMF5SEG FIXED(15),     /* RDW SEGMENT DESCRIPTOR          */         
         3 SMF5FLG BIT(8),        /* OPERATING ENVIRONMENT           */         
         3 SMF5RTY FIXED(8),      /* RECORD TYPE 5                   */         
         3 SMF5TME FIXED(31) BDY(HWORD), /* TOD RECORD WRITTEN       */         
         3 SMF5DTE CHAR(4),       /* DATE RECORD WRITTEN             */         
         3 SMF5SID CHAR(4),       /* SYSTEM ID FROM INSTALLATION     */         
         3 SMF5JBN CHAR(8),       /* JOB NAME                        */         
         3 SMF5RST FIXED(31) BDY(HWORD), /*READER START TIME (.01 SEC)*/        
         3 SMF5RSD CHAR(4),       /* READER START DATE               */         
         3 SMF5UIF CHAR(8),       /* USER IDENTIFICATION FIELD       */         
         3 SMF5NST FIXED(8),      /* # OF STEPS IN JOB               */         
         3 SMF5JIT FIXED(31) BDY(WORD,4), /* JOB INITIATION TIME     */         
         3 SMF5JID CHAR(4),       /* JOB INITATION DATE              */         
         3 SMF5NCI FIXED(31) BDY(WORD,4), /* SPOOL-IN COUNT FOR JOB  */         
         3 SMF5JCC FIXED(16) BDY(WORD,4), /* JOB COMPLETION CODE     */         
         3 SMF5JPTY FIXED(8),     /* JOB PRIORITY                    */         
         3 SMF5RSTT FIXED(31) BDY(HWORD), /* READER STOP TIME(.01 SEC)*/        
         3 SMF5RSTD CHAR(4),      /* READER STOP DATE                */         
         3 SMF5JBTI BIT(8),       /* JOB TERMINATION INDICATORS  @DGC*/         
           5 SMFBIT0 BIT(1),      /* 0-SMF5JCPU NOT VALID FOR SP410             
                                       WHEN ACTJTIME IS >3 BYTES                
                                       SEE TYPE 30 RECORD     @LAC*/            
           5 *  BIT(7),                                                         
                                  /* 1-CANCELLED AT EXIT IEFUJV   */            
                                  /* 2-CANCELLED AT EXIT IEFUJI   */            
                                  /* 3-CANCELLED AT EXIT IEFUSI   */            
                                  /* 4-CANCELLED AT EXIT IEFACTRT */            
                                  /* 5-RESV                       */            
                                  /* 6-ABEND                      */            
                                  /* 7-RESV                          */         
         3 SMF5SMCI CHAR(1),      /* RESV-FORMERLY SYSOUT CLASS IND  */         
         3 SMF5TRAN FIXED(31),    /* TOTAL TRANSACTION                          
                                            RESIDENCY TIME   @ZM01380*/         
         3 SMF5CKRE CHAR(1),      /* RESV                            */         
         3 SMF5RDCL CHAR(1),      /* READER DEVICE CLASS             */         
         3 SMF5RUTY CHAR(1),      /* READER UNIT TYPE                */         
         3 SMF5JICL CHAR(1),      /* JOB INPUT CLASS                 */         
         3 SMF5SPK FIXED(8),      /* STORAGE PROTECT KEY             */         
         3 SMF5SRBT PTR(24),      /* JOB CPU UNDER SRB(.01 S)@YL026WA*/         
         3 SMF5TJS FIXED(31),     /* TOTAL JOB SERV(SERV UNITS)      */         
         3 SMF5TTAT FIXED(31),    /* TOTAL TRANSACTION ACTIVE                   
                                            TIME FOR JOB             */         
         3 SMF5RV2 CHAR(4),       /* RESV                    @YL026WA*/         
         3 SMF5PGNO FIXED(16),    /* Performance group number    @LZC*/         
                        /* - Valid only if workload management   @LZA*/         
                        /*   compatibility mode in effect.       @LZA*/         
                        /* - Zero if workload management goal    @LZA*/         
                        /*   mode in effect when the Type 5      @LZA*/         
                        /*   record is generated.                @LZA*/         
         3 SMF5RV3  CHAR(2),      /* RESERVED                @YL026WA*/         
       3 SMF5TLEN FIXED(8),  /* LGTH OF ACCT SECT OF RECORD @G50FPRL */         
         3 SMF5PRGN CHAR(20),     /* PROGRAMMER'S NAME               */         
         3 SMF5JCPU FIXED(24) BDY(WORD,2), /* ACTJTIME WHEN 3 BYTES             
                                                                 @LAC*/         
         3 SMF5ACTF FIXED(8);     /* # OF ACCT FIELDS IN ACCT SECTION*/         
    DCL 1 SMF5JSAF BASED BDY(BYTE), /* ACCT SECTION                  */         
         3 SMF5ANC PTR(8),        /* # CHAR IN THIS ACCT FIELD       */         
         3 SMF5BCD CHAR(*);       /* ACCT FIELD CHARACTERS           */         
   DCL 1 SMF5SRMD BASED(ADDR(SMF5PRGN)+SMF5TLEN) BDY(BYTE),                     
       /*SRM JOB RELETATED SERVICE DATA                @G50FPRL*/               
         3 SMF5CPUS FIXED(31) BDY(BYTE), /* JOB CPU SERVICE  @G50FPRL*/         
         3 SMF5IOCS FIXED(31) BDY(BYTE), /* JOB I/O SERVICE  @G50FPRL*/         
         3 SMF5MSOS FIXED(31) BDY(BYTE), /* JOB MAIN STORAGE SERVICE            
                                                             @G50FPRL*/         
         3 SMF5SRBS FIXED(31) BDY(BYTE), /* JOB SRB SERVICE  @G50FPRL*/         
         3 SMF5RSV1 CHAR(8);             /* RESERVED         @YA15607*/         
 %IFAL06:;                                                    /* @M1C*/         
 %IF IBM_CBGENC = 'YES' %THEN %GOTO IFAL06A;                  /* @M1A*/         
         %IF IFAR06='' %THEN %GOTO IFALR1;                    /* @M1C*/         
 %IFAL06A:;                                                   /* @M1A*/         
    DCL 1 SMFRCD06 BASED(SMF06PTR) BDY(WORD),                                   
 /* RECORD TYPE 6 - SYSOUT WRITER                                @TBC*/         
 /* IN JES2, WRITTEN FOR EACH JOB OUTPUT ELEMENT, WHICH      @YL02120           
     REPRESENTS A GROUP OF DS DIFFERENTIATED BY PUNCH OR     @YL02120           
     PRINTER SETUP & TYPE OF OUTPUT(EG HELD VS NON-HELD).    @YL02120           
    IN JES3, WRITTEN FOR EACH COPY OF A DATA SET                 @T8C*/         
         3 SMF6LEN FIXED(15),     /* RDW RECORD LENGTH               */         
         3 SMF6SEG FIXED(15),     /* RDW SEGMENT DESCRIPTOR          */         
         3 SMF6FLG BIT(8),        /* OPERATING ENVIRONMENT           */         
         3 SMF6RTY FIXED(8),      /* RECORD TYPE 6                   */         
         3 SMF6TME FIXED(31) BDY(HWORD), /* TOD RECORD WRITTEN       */         
         3 SMF6DTE CHAR(4),       /* DATE RECORD WRITTEN             */         
         3 SMF6SID CHAR(4),       /* SYSTEM ID FROM INSTALLATION     */         
         3 SMF6JBN CHAR(8),       /* JOB NAME FROM JMR               */         
         3 SMF6RST FIXED(31) BDY(HWORD), /*READER START TIME (.01 SEC)*/        
         3 SMF6RSD CHAR(4),       /* READER START DATE               */         
         3 SMF6UIF CHAR(8),       /* USER IDENTIFICATION FIELD       */         
         3 SMF6OWC CHAR(1),       /* OUTPUT WRITER CLASS-                       
                                     BLANK FOR NON SYSOUT    @YL02120*/         
         3 SMF6WST FIXED(31) BDY(WORD,4), /* TOD WRITER START        */         
         3 SMF6WSD CHAR(4),       /* WRITER START DATE               */         
         3 SMF6NLR FIXED(31) BDY(WORD,4), /* # LOGICAL RECS WRITTEN  */         
         3 SMF6IOE BIT(8),        /* IO ERROR INDICATOR              */         
           5 *        BIT(5),     /* RESERVED                @ZA05171*/         
           5 SMF6DIE  BIT(1),     /* DATA INPUT ERROR        @ZA05171*/         
           5 *        BIT(1),     /* RESERVED                @ZA05171*/         
           5 SMF6CBIE BIT(1),     /*CONTROL BLOCK INPUT ERROR@ZA05171*/         
         3 SMF6NDS FIXED(8),      /* # DS PROCESSED BY WRITER        */         
         3 SMF6FMN CHAR(4),       /* FORM NUMBER                     */         
         3 SMF6PAD1 BIT(8),       /* INDICATORS - THE SECTIONS WILL BE          
                                     IN THE ORDER AS LISTED BELOW WHEN          
                                     THE BIT IS TURNED ON        @T8C*/         
           5 SMF6FEXT BIT(1),     /* FIRST EXTENSION PRESENT     @T8C*/         
           5 SMF6REXT BIT(1),     /* COMMON SECTION PRESENT      @TBC*/         
           5 SMF6SEXT BIT(1),     /* SECOND EXTENSION PRESENT    @T8A*/         
           5 SMF6ESS1 BIT(1),     /* ENHANCED SYSOUT SEC PRESENT @LEA*/         
           5 SMF6FTFR BIT(1),     /* FILE TRANSFER SEC PRESENT   @04A*/         
           5 * BIT(3),            /* RESERVED                    @04C*/         
         3 SMF6SBS FIXED(15),     /* SUBSYSTEM GENERATING ID                    
                                EXTWTR=0, JES2-2, JES3-5, PSF=7,                
                                IP PrintWay = 9                  @05C*/         
         3 SMF6LN1 FIXED(15),     /* LGTH OF SECTION INCLUDING SELF  */         
         3 SMF6DCI BIT(8),        /* DATA SET CONTROL INDICATORS @T8C*/         
           5 SMF6DCRV  BIT(1),    /* RESERVED                    @T8A*/         
           5 SMF6SDS   BIT(1),    /* SPUN OFF DATA SET       @ZA05171*/         
           5 SMF6OCN   BIT(1),    /* TERMINATED BY OPERATOR  @ZA05171*/         
           5 SMF6ORD   BIT(1),    /* INTERRUPTED BY OPERATOR(JES2)              
                                     OPERATOR RESTARTED DATA SET WITH           
                                     DESTINATION(JES3)       @ZA05171*/         
           5 SMF6OR    BIT(1),    /* RESTARTED BY OPERATOR   @ZA05171*/         
           5 SMF6ROR   BIT(1),    /* CONTINUATION OF INTERRUPTED                
                                     GROUP(JES2)                                
                                     RECEIVED OP RESTARTED DS(JES3)             
                                                             @ZA05171*/         
           5 SMF6OSS   BIT(1),    /* CARRIAGE OVERRIDEN BY                      
                                     OPERATOR(JES2)                             
                                     OPERATOR STARTED WITH SINGLE               
                                     SPACE(JES3)             @ZA05171*/         
           5 SMF6INT   BIT(1),     /* PUNCH WAS INTERRUPTED  @ZA05171*/         
         3 SMF6INDC BIT(8),       /* BIT INDICATORS.  BITS 0-3 ARE              
                                     RESERVED FOR FUTURE EXPANSION              
                                     OF DATA SET CONTROL INDICATORS.            
                                     BITS 4-7 ARE RECORD LEVEL                  
                                     INDICATORS TO BE SET IN                    
                                     BIT VALUE FORMAT.  EXAMPLE:                
                                     LEVEL 1=X'01', LEVEL 12=X'0C'.             
                                     THIS NUMBER WILL BE INCREMENTED            
                                     BY 1 EACH TIME A NEW RELEASE               
                                     CHANGES THE RECORD.         @T8A*/         
         3 SMF6JNM CHAR(4), /*  WHEN SMF6INDC                                   
                             CONTAINS A X'1', THIS FIELD CONTAINS               
                             A FOUR-DIGIT EBCDIC JOB NUMBER.                    
                             WHEN SMF6INDC CONTAINS A X'3' OR GREATER,          
                             AND THE JOB NUMBER HAS MORE THAN 4 DIGITS,         
                             THIS FIELD CONTAINS ZEROS.                         
                             IF THE JOB NUMBER IS < OR = TO 9999,               
                             THIS FIELD CONTAINS THE JOB NUMBER.                
                             FOR AN APPC TRANSACTION, THIS FIELD                
                             CONTAINS ZEROES. THE CORRECT JOB NUMBER OR         
                             APPC TRANSACTION ID IS FOUND IN SMF6JBID.          
                                                                @P3C*/          
         3 SMF6OUT CHAR(8),       /* LOGICAL OUTPUT DEVICE NAME (FOR            
                                     THE 3820, ACF/VTAM LOGICAL                 
                                     UNIT NAME)                  @T6C*/         
         3 SMF6FCB CHAR(4),       /* FCB ID                          */         
         3 SMF6UCS CHAR(4),       /* UCS ID,  END OF REC FOR EXT WTR */         
         3 SMF6PGE FIXED(31),     /* APPROXIMATE PHYSICAL PAGE                  
                                     COUNT                       @T6C*/         
         3 SMF6J2S CHAR(2) BDY(WORD),  /* SPECIAL JES2 SECTION   @T8C*/         
           5 SMF6RTE FIXED(15),   /* OUTPUT ROUTE CODE OR ZERO                  
                                                             @G387P27*/         
         3 SMF6END2 CHAR(0);      /* END OF JES2 BASE RECORD     @T8A*/         
   DCL SMF6LEV2 FIXED(8) CONSTANT(1), /* THIS VARIABLE IS FOR JES2 TO           
                                         SET LEVEL INDICATOR     @QXA*/         
       SMF6J2L3 FIXED(8) CONSTANT(3), /* THIS VARIABLE IS FOR JES2 TO           
                                         SET LEVEL INDICATOR     @QXA*/         
       SMF6J2L4 FIXED(8) CONSTANT(4), /* THIS VARIABLE IS FOR JES2 TO           
                                         SET LEVEL INDICATOR FOR                
                                         SECURITY SUPPORT        @QXA*/         
       SMF6LEV3 FIXED(8) CONSTANT(1), /* THIS VARIABLE IS FOR JES3 TO           
                                         SET LEVEL INDICATOR     @QXA*/         
       SMF6J3L3 FIXED(8) CONSTANT(3), /* THIS VARIABLE IS FOR JES3 TO           
                                         SET LEVEL INDICATOR     @QXA*/         
       SMF6J3L4 FIXED(8) CONSTANT(4), /* THIS VARIABLE IS FOR JES3 TO           
                                         SET LEVEL INDICATOR FOR                
                                         SECURITY SUPPORT        @QXA*/         
       SMF6LEV4 FIXED(8) CONSTANT(5), /* MVS/JES2 RELEASE 4.1.0  @P2A*/         
       SMF6LEV6 FIXED(8) CONSTANT(6), /* PSF/MVS Release 3.1.0   @08A*/         
       SMF6LEV7 FIXED(8) CONSTANT(7); /* Z/OS RELEASE V1R5       @L1A*/         
 %IF IBM_CPSI = 'YES' %THEN %GOTO IFASMFR01A;                                   
 %IFASMFR_DEF = 'DEFINED(SMF6J2S)';                                             
 %GOTO IFASMFR01B;                                                              
 %IFASMFR01A:;                                                                  
 %IFASMFR_DEF = 'BASED';                                                        
 %IFASMFR01B:;                                                                  
   DCL 1 SMF6J2SD CHAR(24) IFASMFR_DEF BDY(WORD),             /* @M1C*/         
         3 SMF6J3S CHAR(24) BDY(WORD),  /* SPECIAL JES3 SECTION  @T8C*/         
           5 SMF6DFE BIT(16),     /* DATA FORMAT ERROR INDICATORS    */         
            6 SMF6DFE0 BIT(8),                                                  
             7 *     BIT(6),      /* 0-5 RESERVED                @T8C*/         
             7 SMF6CCE BIT(1),    /* 6-ONE OR MORE RECORDS CONTAINED            
                                       INVALID 1ST CHAR CONTROL DATA,           
                                       DEFAULT SUBSTITUTED       @T8C*/         
             7 SMF6RBE BIT(1),    /* 7-INVALID LGTH REC IN DATA,                
                                       TRUNCATED OR PADDED       @T8C*/         
            6 SMF6DFE1 BIT(8),    /* 8-15 RESERVED               @T8C*/         
           5 SMF6OPR FIXED(16) BDY(HWORD), /* OUTPUT PRIORITY    @T8C*/         
           5 SMF6GRP CHAR(8),     /*LOG OUTPUT DEV GROUP NAME    @T8C*/         
           5 SMF6RSVJ CHAR(8),    /*RESERVED FOR JES3            @T8C*/         
           5 SMF6RSVU CHAR(4),    /*RESERVED FOR USER            @T8C*/         
         3 SMF6END CHAR(0);       /* END OF JES3 BASE RECORD @ZA75776*/         
      /* BEGINNING OF FIRST EXTENSION - THIS SECTION WILL ONLY BE               
         PRESENT WHEN SMF6SBS IS SET TO 2, 5 OR 7 INDICATING THAT               
         JES2, JES3 OR PSF HAS GENERATED THIS RECORD.            @T8A*/         
   DCL 1 SMF6EXT1 BASED,          /* FIRST EXTENSION - NON-IMPACT               
                                     PRINTING SUBSYSTEM SECTION  @T8C*/         
         3 SMF6LN2 FIXED(15),   /* LENGTH OF FIRST EXTENSION                    
                                     INCLUDING THIS FIELD        @T8C*/         
         3 SMF6CPS(8) CHAR(1),    /* COPIES DISTRIBUTION     @ZA10800*/         
         3 SMF6CHR CHAR(16),      /* TRANSLATE TABLE NAMES   @ZA10800           
                                     FROM CHARS PARAMETER    @ZA10800*/         
         3 SMF6MID CHAR(4),       /* COPY MODIFICATION       @ZA10800           
                                     MODULE NAME             @ZA10800*/         
         3 SMF6FLI CHAR(4),       /* FLASH OVERLAY NAME      @ZA10800*/         
         3 SMF6FLC BIT(8),       /* NUMBER OF COPIES FLASHED @ZA10800*/         
         3 SMF6BID BIT(8),        /* FLAG BYTE               @ZA10800*/         
           4 SMF6BTS BIT(1),      /* THE BTSS WAS USED FOR   @ZA10800           
                                     OUTPUT                  @ZA10800*/         
           4 SMF6OPJ BIT(1),      /* OPTCD=J WAS USED FOR    @ZA10800           
                                     OUTPUT                  @ZA10800*/         
           4 SMF6CSP BIT(1);      /* CUT SHEET PRINTER           @T6A*/         
      /* BEGINNING OF COMMON SECTION - THIS SECTION IS AN EXTENSION             
         OF THE FIXED HEADER SECTION AND WILL BE WRITTEN BY ALL                 
         GENERATORS OF THE TYPE 6 RECORD. THIS WAS PREVIOUSLY CALLED            
         THE ROUTING SECTION.                                    @TBC*/         
  DCL 1 SMF6RSEC BASED,             /* COMMON SECTION            @TBC*/         
        3 SMF6LN3 FIXED(15),        /* LENGTH OF THIS SECTION                   
                                       INCLUDING THIS FIELD      @T8M*/         
        3 SMF6ROUT CHAR(4), /* OUTPUT ROUTE CODE                 @T8M*/         
        3 SMF6EFMN CHAR(8), /* OUTPUT FORM NUMBER                @T8M*/         
        3 * CHAR(16),               /* RESERVED                  @TBA*/         
        3 SMF6JBID CHAR(8),         /* JOB ID                    @TBA*/         
        3 SMF6STNM CHAR(8),         /* STEP NAME                 @LCA*/         
        3 SMF6PRNM CHAR(8),         /* PROCEDURE STEP NAME       @LCA*/         
        3 SMF6DDNM CHAR(8),         /* DD NAME                   @LCA*/         
        3 SMF6USID CHAR(8),         /* USER ID                   @LCA*/         
        3 SMF6SECS CHAR(8),         /* SECURITY LABEL (SECLABEL) @LCA*/         
        3 SMF6PRMD CHAR(8),         /* PROCESSING MODE           @LCA*/         
        3 SMF6DSNM CHAR(53),        /* DATA SET RESOURCE NAME    @DLC*/         
        3 * CHAR(3),                /* RESERVED                  @DLA*/         
        3 SMF6OTOK CHAR(20);        /* OUTPUT GROUP TOKEN        @DKC*/         
      /* ENHANCED SYSOUT SECTION                                 @LEA*/         
   DCL 1 SMF6ESS  BASED,          /* ENHANCED SYSOUT SECTION     @LEA*/         
         3 SMF6LN5 FIXED(15),     /* LENGTH OF ESS SECTION INCLUDING            
                                      THIS FIELD                 @LEA*/         
         3 SMF6SGID FIXED(31) BDY(HWORD),  /* SEGMENT IDENTIFIER @LEA*/         
         3 SMF6IND BIT(8),        /* SECTION INDICATOR           @LEA*/         
           5 SMF6SJF BIT(1),      /* ERROR OBTAINING SWBTU - SWBTU              
                                      DATA AREA NOT PRESENT      @LEA*/         
         3 SMF6RSV CHAR(1),       /* RESERVED                    @LEA*/         
         3 SMF6JDVT CHAR(8),      /* JDVTNAME                    @LEA*/         
         3 SMF6TUL FIXED(15),     /* SWBTU DATA AREA LENGTH      @LEA*/         
         3 SMF6TU CHAR(*);        /* SWBTU DATA AREA  -  DATA AREA              
                                      CAN BE PROCESSED USING SWBTUREQ           
                                      MACRO                      @LEA*/         
                                                                                
                               /* Moved SMF6EXT2 to AOPSMF6    50@L1D*/         
                               /* Moved SMF6BNMI to AOPSMF6     4@L1D*/         
                               /* Moved SMF6BNCN to AOPSMF6     4@L1D*/         
                               /* Moved SMF6FXFR to AOPSMF6    10@L1D*/         
 %IF IBM_CBGENC = 'YES' %THEN %GOTO IFASMFR_E;                /* @M1A*/         
 %INCLUDE SYSLIB(AOPSMF6)  NOSEG;  /* Type 6 Enhancements        @L1A*/         
 %IFALR1: ;                                                                     
 %IF IBM_CBGENC = 'YES' %THEN %GOTO IFASMFR_E;                /* @M1A*/         
 %INCLUDE SYSLIB(IFASMFR1) NOSEG;                                               
 %INCLUDE SYSLIB(IFASMFR2) NOSEG;                                               
 %INCLUDE SYSLIB(IFASMFR3) NOSEG;                                               
 %INCLUDE SYSLIB(IFASMFR4) NOSEG;                                               
 %INCLUDE SYSLIB(IFASMFR5) NOSEG;                                               
 %INCLUDE SYSLIB(IFASMFR6) NOSEG;                                               
 %INCLUDE SYSLIB(IFASMFR9) NOSEG;                                               
 %INCLUDE SYSLIB(IFASMFRA) NOSEG;                                               
 %INCLUDE SYSLIB(IFASMFRB) NOSEG;                                               
 %INCLUDE SYSLIB(IFASMFRC) NOSEG;                                               
 %INCLUDE SYSLIB(IFASMFRD) NOSEG;                                               
 %INCLUDE SYSLIB(IAZSMFR) NOSEG;    /* EXPAND JES SMF MAPPINGS   @T7A*/         
 %IFASMFR_E:;                                                                   
 @logic;                                                                        
  This only contains pragma statements for smf type 2 record mapping            
  #PRAGMA TOOL=PADI.                                                            
  #ASMLINE.   IFASMFR 02                                                        
  #LINE.   %IFAR02='YES';                                                       
  #LINE.   DCL SMF02PTR PTR(31);                                                
  #PADIDELETE.SMFRCD2                                                           
  #PADIDELETE.SMFRCD02                                                          
  #PADIDELETE.SMF2GFixedPortion                                                 
  #PADIDELETE.SMF2GSTV                                                          
  #PADIDELETE.SMF2GFIRST                                                        
  #PADIDELETE.SMF2GGSTV                                                         
  #PADIDELETE.SMF2GEXT                                                          
  #PADIDELETE.SMF2GMinuteBdyFct                                                 
  #PADIDELETE.SMF2GSelfDefiningSectionExists                                    
  #PADIDELETE.SMF2GEND                                                          
  #PADIDELETE.SMF2GASignHeader                                                  
  #PADIDELETE.SMF2IFixedPortion                                                 
  #PADIDELETE.SMF2ISTV                                                          
  #PADIDELETE.SMF2IFIRST                                                        
  #PADIDELETE.SMF2IISTV                                                         
  #PADIDELETE.SMF2IHALT                                                         
  #PADIDELETE.SMF2INCO                                                          
  #PADIDELETE.SMF2IEXT                                                          
  #PADIDELETE.SMF2IClInt                                                        
  #PADIDELETE.SMF2IMinuteBdyFct                                                 
  #PADIDELETE.SMF2ISelfDefiningSectionExists                                    
  #PADIDELETE.SMF2IEND                                                          
  #PADIDELETE.SMF2IASignHeader                                                  
  #PADIDELETE.SMF2IASignNCO                                                     
  #EPRAGMA.                                                                     
 @endlogic;                                                                     
