*        %GOTO IFASMFR1A; /*                                            00010004
         MACRO                                                          00020000
&NAME    IFASMFR1 &RECTYPE                                           */ 00030004
*%IFASMFR1A:;                                                           00031005
*/***** START OF SPECIFICATIONS *************************************** 00032004
* *                                                                   * 00040004
*01* MACRO-NAME = IFASMFR1                                            * 00050004
* *                                                                   * 00060004
* *                                                                   * 00070004
* * PROPRIETARY STATEMENT =                                           * 00080004
* *                                                                   * 00090004
* *   LICENSED MATERIALS - PROPERTY OF IBM                            * 00100004
* *   5650-ZOS COPYRIGHT IBM CORP. 1977, 2019                         * 00120009
* *                                                                   * 00140004
* * STATUS = HBB77C0                                                  * 00150009
* *                                                                   * 00160004
* * EXTERNAL CLASSIFICATION: PI                                   @P1A* 00161010
* * END OF EXTERNAL CLASSIFICATION:                               @P1A* 00162004
* *                                                                   * 00162116
* * IFASMFR1 maps SMF records in the range 07-19.                     * 00162218
* *                                                                  */ 00163014
*        %GOTO IFASMFR1B; /*                                            00164014
.* * METHOD OF ACCESS                                                 * 00170013
.* *  PL/S - INCLUDE MACRO FROM LIBRARY                               * 00180013
.* *          EXAMPLE - %INCLUDE SYSLIB(IFASMFR1)                     * 00190013
.* *                                                                  * 00200013
.* *          THIS MACRO EXPANDS RECORDS 7-19. RECORD 15 CAN BE       * 00210013
.* *          SPECIFIED BUT TYPE 14 IS CREATED FOR IT.                * 00220013
.* *                                                                  * 00230013
.* *                                                                  * 00240013
.* *  TYPE 8  - Delete SMF8VDV                                    @LYA  00250013
.* *  TYPE 9  - Delete SMF9VDV                                    @LYA  00260013
.* *  TYPE 10 - Delete SMF10VDV                                   @LYA  00270013
.* *  TYPE 11 - Delete SMF11VDV                                   @LYA  00280013
.* *                                                                  * 00281013
.* *                                                                  * 00300013
.* * CHANGE ACTIVITY:                                                 * 00310013
.* *                                                                  * 00320013
.* * TYPE 14/15 Record - Transfer Mapping to DFP                  @01A* 00330013
.* * TYPE 17 Record - Transfer Mapping to DFP                     @01A* 00340013
.* * TYPE 18 Record - Transfer Mapping to DFP                     @01A* 00350013
.* * TYPE 19 Record - Transfer Mapping to DFP                     @01A* 00360013
.* * TYPE 7  Record - Added SMF7FL1 and SMF7NROX                  @02A* 00370013
.* * TYPE 7  Record - Added SMF7LSD and SMF7LSN                   @LZA* 00371013
.* * TYPE 7  Record - Added SMF7TBLS                              @03A* 00372013
.* * Accommodate C                                                @M1A* 00373013
.* *                                                                  * 00380013
.* * $L9=ILIBS   ,JBB3311,880229,PDFS: ILIB TYPE 14 CHANGES       @L9A* 00390013
.* * $04=OY30300 ,HBB4410,900308,PDLO: HIPERBATCH SUPPORT         @04A* 00400013
.* * $TD=OY21350 ,HBB4410,900411,PDBR: RECORDS 9 & 11 - VARY PATH @TDA* 00410013
.* *                                   INDICATOR                  @TDA* 00420013
.* * $LY=4DGIT   ,HBB5510,930304,PDSL: SMF 4K UCB enhancement     @LYA* 00430013
.* * $01=OY56189 ,HBB4410,920825,PDBR: DFP Records Transfer       @01A* 00440013
.* * $02=OA19453 ,HBB7709,070205,PDOO: SMF7NRO too small for      @02A* 00450013
.* *                                   SMCABFLS                   @02A* 00460013
.* * $LZ=SMFFLD  ,HBB7770,090530,PDAS: SMF Flood Automation       @LZA* 00461013
.* * $P0=ME16373 ,HBB7770,090830,PDAS: Add dropped records from   @P0A* 00462013
.* *                                   flooding for SMF7          @P0A* 00470013
.* * $P1=ME16572 ,HBB7770,091120,PDQV: Asset Protection Errors    @P1A* 00470113
.* * $P2=ME18198 ,HBB7780,100917,PDRJ: Type-o in SMF9VPC comment  @P2A* 00470213
.* * $03=OA52828 HBB77A0 180125 PDOO: SMFTBUFF                    @03A* 00470313
.* * $M1=270303  HBB77C0 180901 PDXB: Accommodate C               @M1A* 00470415
.* *                                                                    00471013
.* THIS IS AN SMF MACRO WHICH BUILDS SMF RECORDS 7-19. THE REQUIRED     00480013
.* FORMAT IS -                                                          00490013
.*                                                                      00500013
.*       IFASMFR1 &RECTYPE                                           */ 00510014
*%IFASMFR1B:;                                                           00510114
*/***** END OF SPECIFICATIONS ****************************************/ 00511014
*        %GOTO IFAL07;    /*                                            00521004
         AIF   (&RECTYPE EQ 7).IFAS007                                  00530000
         AIF   (&RECTYPE EQ 8).IFAS008                                  00540000
         AIF   (&RECTYPE EQ 9).IFAS009                                  00550000
         AIF   (&RECTYPE EQ 10).IFAS010                                 00560000
         AIF   (&RECTYPE EQ 11).IFAS011                                 00570000
         AIF   (&RECTYPE EQ 14 OR &RECTYPE EQ 15).IFAS014               00580000
         AIF   (&RECTYPE EQ 17).IFAS017                                 00590000
         AIF   (&RECTYPE EQ 18).IFAS018                                 00600000
         AIF   (&RECTYPE EQ 19).IFAS019                                 00610000
.E5      ANOP                                                           00620000
         SPACE 3                                                        00630000
         MNOTE 4,'&RECTYPE INVALID RECORD TYPE SPECIFIED'               00640000
.CONTB   ANOP                                                           00650000
         MEXIT                                                          00660000
.IFAS007 ANOP                                                           00670000
         EJECT                                                          00680000
* THIS RECORD IS WRITTEN WHEN AN SMF DATA SET OR LOGSTREAM BECOMES      00690000
* AVAILABLE FOLLOWING THE UNAVAILABILITY OF AN SMF DATA SET. RECORD     00700000
* This record is also written when the SMF flood facility has dropped   00701000
* records as the result of a drop filter.                               00702000
* LENGTH IS 62 BYTES.                                              @P0C 00710000
*                                                                       00720000
         DS    0F        ALIGN TO FULL WORD BOUNDARY                    00730000
SMFRCD7  EQU   *         HEADER SEGMENT                                 00740000
SMF7LEN  DS    BL2'0'    RECORD LENGTH                                  00750000
SMF7SEG  DS    BL2'0'    SEGMENT DESCRIPTOR                             00760000
SMF7FLG  DC    BL1'0'    HEADER FLAG BYTE                               00770000
SMF7RTY  DC    BL1'0'    RECORD TYPE 7                                  00780000
SMF7TME  DC    BL4'0'    TOD, USING FORMAT FROM TIME MACRO W/BIN. INTVL 00790000
SMF7DTE  DC    PL4'0000'      DATE IN PACKED DECIMAL FORM: 00YYDDDF     00800000
SMF7SID  DC    CL4' '    SYSTEM IDENTIFICATION                   Y02901 00810000
SMF7NRO  DC    BL2'0'    Number of SMF records omitted from data set.   00820000
*                        Unsigned, count up to 65,535. This field       00830000
*                        is marked as invalid, and is set to            00840000
*                        zero when SMF7NRF is on. SMF7NROX is           00850000
*                        the 4 byte equivalent of this field.      @02C 00860000
SMF7STM  DC    BL4'0'    When SMF7DRP is off this is the time when the  00870000
*                        buffers condition began. When SMF7DRP is on    00890000
*                        this is the time the DROP record filter became 00891000
*                        active. This field is in hundredths of a       00892000
*                        second                                    @P0C 00893000
SMF7STD  DC    PL4'0000' When SMF7DRP is off this is the date when the  00900000
*                        buffers condition began. When SMF7DRP is on    00910000
*                        this is the date the DROP record filter became 00911000
*                        active. This field is in packed decimal        00912000
*                        format: 00YYDDDF                          @P0C 00913000
SMF7FL1  DC    BL1'0'    Flag byte                                 @02A 00920000
SMF7NRF  EQU   X'80'     SMF7NRO has exceeded its 2 byte capacity       00930000
*                        and is therefore invalid. SMF7NROX is the 4    00940000
*                        byte equivalent of SMF7NRO.               @02A 00950000
SMF7LSD  EQU   X'40'     This record is the result of a logstream       00951000
*                        dataspace becoming full                   @LZA 00952000
SMF7DRP  EQU   X'20'     This record is the result of the SMF record    00953000
*                        flood facility dropping records           @P0A 00954000
SMF7RSV1 DC    BL2'0'    Reserved for alignment of SMF7NROX        @P0C 00960000
SMF7DTYP DC    BL1'0'    The type of record that was dropped by         00961000
*                        the filter. Will be zero unless SMF7DRP        00962000
*                        is on.                                    @P0A 00963000
SMF7NROX DC    F'0'      Number of SMF records omitted from data   @02A 00970000
*                        set. Unsigned, 4 byte equivalent of       @02A 00980000
*                        SMF7NRO.                                  @02A 00990000
SMF7LSN  DC    CL26' '   For a logstream dataset condition this will    00991000
*                        have the logstream name, otherwise will be     00992000
*                        zeros                                     @LZA 00993000
SMF7TBLS DC    XL8'0'    The number of bytes lost during SMF            00994008
*                        initialization. This field will be non zero    00995008
*                        if the SMF temporary buffer is exhausted       00996008
*                        and therefore records are lost during SMF      00997008
*                        initialization.                           @03A 00998008
         AGO   .CONTB                                                   01000000
.IFAS008 ANOP                                                           01010000
         EJECT                                                          01020000
* THIS RECORD IS WRITTEN AFTER COMPLETION OF IPL, FOLLOWING THE SET     01030000
* DATE COMMAND. RECORD LENGTH IS VARIABLE. MINIMUM OF 16 BYTES.         01040000
*                                                                       01050000
         DS    0F        ALIGN TO FULL WORD BOUNDARY                    01060000
SMFRCD8  EQU   *         HEADER SEGMENT                                 01070000
SMF8LEN  DS    BL2'0'    RECORD LENGTH                                  01080000
SMF8SEG  DS    BL2'0'    SEGMENT DESCRIPTOR                             01090000
SMF8FLG  DC    BL1'0'    HEADER FLAG BYTE                               01100000
SMF8RTY  DC    BL1'0'    RECORD TYPE 8                                  01110000
SMF8TME  DC    BL4'0'    TOD USING FORMAT FROM TIME MACRO W/BIN. INTVL. 01120000
SMF8DTE  DC    PL4'0000' DATE IN PACKED DEC.FORMAT: OOYYDDDF            01130000
SMF8SID  DC    CL4' '    SYSTEM IDENTIFICATION                   Y02901 01140000
SMF8LENN DC    BL2'0'    LENGTH OF FIELD                                01150000
*        FOR EACH DEVICE ONLINE THERE IS A FOUR-BYTE ENTRY HAVING THE   01160000
*        FOLLOWING FORMAT:                                              01170000
SMF8IODV DS    0C        Device Identification                     @LYC 01180000
*                                                                  @LYA 01190000
*     Note: Virtual I/O Devices are identified by the following:   @LYA 01200000
*           Device Class 0                                         @LYA 01210000
*           Unit Type 0                                            @LYA 01220000
*           Device Number x'7FFF'                                  @LYA 01230000
*                                                                  @LYA 01240000
*                        BYTE 0 - DEVICE CLASS                          01250000
*                             1 - UNIT TYPE                             01260000
*                             2,3 - DEVICE NUMBER              @G860P27 01270000
SMF8DUT  DS    BL2'0'    DEVICE CLASS AND UNIT TYPE                @LYA 01280000
SMF8CHA  DS    BL2'0'    DEVICE NUMBER                             @LYA 01290000
*                                                                 1@LYD 01300000
         AGO   .CONTB                                                   01310000
.IFAS009 ANOP                                                           01320000
         EJECT                                                          01330000
* THIS RECORD IS WRITTEN WHEN A DEVICE IS VARIED ONLINE.                01340000
* RECORD LENGTH IS VARIABLE. MINIMUM OF 20 BYTES.                       01350000
*                                                                       01360000
         DS    0F        ALIGN TO FULL WORD BOUNDARY                    01370000
SMFRCD9  EQU   *         HEADER SEGMENT                                 01380000
SMF9LEN  DS    BL2'0'    RECORD LENGTH                                  01390000
SMF9SEG  DS    BL2'0'    SEGMENT DESCRIPTOR                             01400000
SMF9FLG  DC    BL1'0'    HEADER FLAG BYTE                               01410000
SMF9RTY  DC    BL1'0'    RECORD TYPE 9                                  01420000
SMF9TME  DC    BL4'0'    TOD USING FORMAT FROM TIME MACRO W/BIN. INTVL. 01430000
SMF9DTE  DC    PL4'0000' DATE IN PACKED DEC. FORM: OOYYDDDF             01440000
SMF9SID  DC    CL4' '    SYSTEM IDENTIFICATION                   Y02901 01450000
SMF9LENN DC    BL2'0'    LENGTH OF THIS FIELD PLUS REST OF RECORD       01460000
SMF9DVAD DS    0C        Device Identification                     @LYC 01470000
*                                                                  @LYA 01480000
*     Note: Virtual I/O Devices are identified by the following:   @LYA 01490000
*           Device Class 0                                         @LYA 01500000
*           Unit Type 0                                            @LYA 01510000
*           Device Number x'7FFF'                                  @LYA 01520000
*                                                                  @LYA 01530000
*                        FOR EACH DEVICE BEING ADDED THERE IS AN EIGHT  01540000
*                        BYTE ENTRY HAVING THE FOLLOWING FORMAT:        01550000
*                        BYTE 0-DEVICE CLASS                            01560000
*                             1-UNIT TYPE                               01570000
*                             2,3 - DEVICE NUMBER              @G860P27 01580000
*                             4 - VARY PATH CALLER INDICATOR       @TDA 01590000
*                             5-7 - RESERVED                       @TDA 01600000
SMF9DUT  DS    BL2'0'    DEVICE CLASS AND UNIT TYPE                @TDA 01610000
SMF9CUA  DS    BL2'0'    DEVICE NUMBER                             @TDA 01620000
*                                                                 1@LYD 01630000
SMF9VPC  DS    BL1'0'    VARY PATH CALLER INDICATOR                @TDA 01640000
*                           0 = SYSTEM CONSOLE                     @TDA 01650000
*                           2 = ESCON MANAGER                      @P2C 01660000
SMF9RSV  DS    CL3' '    RESERVED                                  @TDA 01670000
         AGO   .CONTB                                                   01680000
.IFAS010 ANOP                                                           01690000
         EJECT                                                          01700000
* THIS RECORD IS WRITTEN AFTER SUCCESSFUL DEVICE ALLOCATION RECOVERY.   01710000
* RECORD LENGTH IS VARIABLE. MINIMUM 0F 44 BYTES.                       01720000
*                                                                       01730000
         DS    0F        ALIGN TO FULL WORD BOUNDARY                    01740000
SMFRCD10 EQU   *         HEADER SEGMENT                                 01750000
SMF10LEN DS    BL2'0'    RECORD LENGTH                                  01760000
SMF10SEG DS    BL2'0'    SEGMENT DESCRIPTOR                             01770000
SMF10FLG DC    BL1'0'    HEADER FLAG BYTE                               01780000
SMF10RTY DC    BL1'0'    RECORD TYPE 10                                 01790000
SMF10TME DC    BL4'0'    TOD USING FORMAT FROM TIME MACRO W/BIN. INTVL. 01800000
SMF10DTE DC    PL4'0000' DATE IN PACKED DEC. FORM: OOYYDDDF             01810000
SMF10SID DC    CL4' '    SYSTEM IDENTIFICATION                   Y02901 01820000
SMF10JBN DC    CL8' '    JOB NAME                                       01830000
SMF10RST DC    BL4'0'    READER START TIME                              01840000
SMF10RSD DC    PL4'0000' READER START DATE                              01850000
SMF10UIF DC    CL8' '    USER  IDENTIFICATION FIELD                     01860000
SMF10LN  DC    BL2'0'    LENGTH OF THIS FIELD PLUS REST OF RECORD       01870000
SMF10DEV DS    0C        Device Identification                     @LYC 01880000
*                                                                  @LYA 01890000
*    Note: Virtual I/O Devices are identified by the following:    @LYA 01900000
*          Device Class 0                                          @LYA 01910000
*          Unit Type 0                                             @LYA 01920000
*          Device Number x'7FFF'                                   @LYA 01930000
*                                                                       01940000
*                        FOR EACH DEVICE THERE IS A FOUR BYTE ENTRY     01950000
*                        HAVING THE FOLLOWING FORMAT:                   01960000
*                        BYTE 0-DEVICE CLASS                            01970000
*                             1-UNIT TYPE                               01980000
*                             2,3 - DEVICE NUMBER              @G860P26 01990000
*                                                                 1@LYD 02000000
SMF10DUT DS    BL2'0'    Device class and unit type                @LYA 02010000
SMF10CUA DS    BL2'0'    Device Number                             @LYA 02020000
         AGO   .CONTB                                                   02030000
.IFAS011 ANOP                                                           02040000
         EJECT                                                          02050000
* THIS RECORD IS WRITTEN WHEN A DEVICE IS VARIED OFFLINE.               02060000
* RECORD LENGTH IS VARIABLE. MINIMUM OF 20 BYTES.                       02070000
*                                                                       02080000
         DS    0F        ALIGN TO FULL WORD BOUNDARY                    02090000
SMFRCD11 EQU   *         HEADER SEGMENT                                 02100000
SMF11LEN DS    BL2'0'    RECORD LENGTH                                  02110000
SMF11SEG DS    BL2'0'    SEGMENT DESCRIPTOR                             02120000
SMF11FLG DC    BL1'0'    HEADER FLAG BYTE                               02130000
SMF11RTY DC    BL1'0'    RECORD TYPE 11                                 02140000
SMF11TME DC    BL4'0'    TOD USING FORMAT FROM TIME MACRO W/BIN. INTVL. 02150000
SMF11DTE DC    PL4'0000' DATE IN PACKED DEC. FORM: OOYYDDDF             02160000
SMF11SID DC    CL4' '    SYSTEM IDENTIFICATION                   Y02901 02170000
SMF11LN  DC    BL2'0'    LENGTH OF THIS FIELD PLUS REST OF RECORD       02180000
SMF11DEV DS    0C        Device Identification                     @LYC 02190000
*                                                                  @LYA 02200000
*     Note: Virtual I/O Devices are identified by the following:   @LYA 02210000
*           Device Class 0                                         @LYA 02220000
*           Unit Type 0                                            @LYA 02230000
*           Device Number x'7FFF'                                  @LYA 02240000
*                                                                  @LYA 02250000
*                                                                       02260000
*                        FOR EACH DEVICE BEING REMOVED, THERE IS AN     02270000
*                        8-BYTE ENTRY HAVING THE FOLLOWING FORMAT:      02280000
*                        BYTE 0-DEVICE CLASS                            02290000
*                             1-UNIT TYPE                               02300000
*                             2,3 - DEVICE NUMBER              @G860P27 02310000
*                             4 - VARY PATH CALLER INDICATOR       @TDA 02320000
*                             5-7 RESERVED                         @TDA 02330000
SMF11DUT DS    BL2'0'    DEVICE CLASS AND UNIT TYPE                @TDA 02340000
SMF11CUA DS    BL2'0'    DEVICE NUMBER                             @TDA 02350000
*                                                                 1@LYD 02360000
SMF11VPC DS    BL1'0'    VARY PATH CALLER INDICATOR                @TDA 02370000
*                           0 = SYSTEM CONSOLE                     @TDA 02380000
*                           2 = ESCON MANGER                       @TDA 02390000
SMF11RSV DS    CL3' '    RESERVED                                  @TDA 02400000
         AGO   .CONTB                                                   02410000
.IFAS014 ANOP                                                           02420000
         EJECT                                                          02430000
         IFGSMF14        Call DFP Macro To Expand Record           @01A 02440000
* Remove Inline Declares                                         99@01D 02450000
         AGO   .CONTB                                                   02460000
.IFAS017 ANOP                                                           02470000
         EJECT                                                          02480000
         IGGSMF17        Call DFP Macro To Expand Record           @01A 02490000
* Remove Inline Declares                                         21@01D 02500000
         AGO   .CONTB                                                   02510000
.IFAS018 ANOP                                                           02520000
         EJECT                                                          02530000
         IGGSMF18        Call DFP Macro To Expand Record           @01A 02540000
* Remove Inline Declares                                         22@01D 02550000
         AGO   .CONTB                                                   02560000
.IFAS019 ANOP                                                           02570000
         EJECT                                                          02580000
         IGGSMF19        Call DFP Macro To Expand Record           @01A 02590000
* Remove Inline Declares                                         24@01D 02600000
         AGO   .CONTB                                                   02610000
         MEND                        */                                 02620000
 %IFAL07:;                                                              02620104
 %IF IBM_CBGENC = 'YES' %THEN %GOTO IFAL07A;                  /* @M1A*/ 02621012
 %IF IFAR07='' %THEN %GOTO IFAL08;                                      02630004
 %IFAL07A:;                                                   /* @M1A*/ 02631012
 /* RECORD TYPE 7 - DATA LOST CONDITION                              */ 02650000
 /* THIS RECORD IS WRITTEN WHEN AN SMF DATA SET OR LOGSTREAM BECOMES */ 02651000
 /* AVAILABLE FOLLOWING THE UNAVAILABILITY OF AN SMF DATA SET. RECORD*/ 02652000
 /* LENGTH IS 62 BYTES.                                              */ 02653000
    DCL 1 SMFRCD07 BASED(SMF07PTR) BDY(WORD),                           02654006
         3 SMF7LEN FIXED(15),     /* RDW RECORD LENGTH               */ 02680000
         3 SMF7SEG FIXED(15),     /* RDW SEGMENT DESCRIPTOR          */ 02690000
         3 SMF7FLG BIT(8),        /* OPERATING ENVIRONMENT           */ 02700000
         3 SMF7RTY FIXED(8),      /* RECORD TYPE 7                   */ 02710000
         3 SMF7TME FIXED(31) BDY(HWORD), /* TOD RECORD WRITTEN       */ 02720000
         3 SMF7DTE CHAR(4),       /* DATE RECORD WRITTEN             */ 02730000
         3 SMF7SID CHAR(4),       /* SYSTEM ID FROM INSTALLATION     */ 02740000
         3 SMF7NRO FIXED(16),     /* Number of SMF records omitted      02750000
                                     from data set. Unsigned, count     02760000
                                     up to 65,535. This field is        02770000
                                     marked as invalid, and is set to   02780000
                                     zero when SMF7NRF is on. SMF7NROX  02790000
                                     is the 4 byte equivalent of this   02800000
                                     field.                      @02C*/ 02810000
         3 SMF7STM FIXED(31),     /* STARTING TOD RECORDS LOST       */ 02820000
         3 SMF7STD CHAR(4),       /* STARTING DATE RECORDS LOST  @02C*/ 02830000
         3 SMF7FL1   CHAR(1),     /* Flag byte                   @02A*/ 02840000
           5 SMF7NRF BIT(1),      /* SMF7NRO has exceeded its 2 byte    02850000
                                     capacity and is therefore invalid. 02860000
                                     SMF7NROX is the 4 byte equivalent  02870000
                                     of SNF7NRO.                 @02A*/ 02880000
           5 SMF7LSD BIT(1),      /* This record is the result of a     02881000
                                     logstream dataspace becoming full  02882000
                                                                 @LZA*/ 02883000
           5 SMF7DRP BIT(1),      /* This record is the result of       02884000
                                     the SMF record facility dropping   02885000
                                     records                     @P0C*/ 02886000
           5 *       BIT(5),      /* Reserved                    @P0C*/ 02890000
         3 SMF7RSV1  CHAR(2),     /* Reserved for alignment of          02900000
                                     SMF7NROX                    @P0C*/ 02910000
         3 SMF7DTYP FIXED(8),     /* The type of record that was        02911000
                                     dropped by the filter. Will nbe    02912000
                                     zero unless SMF7DRP is on.  @P0A*/ 02913000
         3 SMF7NROX  FIXED(32),   /* Number of SMF records omitted from 02920000
                                     data set. Unsigned, 4 byte         02930000
                                     equivalent of SMF7NRO.      @02A*/ 02940000
         3 SMF7LSN CHAR(26)       /* For a logstream dataset condition  02941008
                                     this will have the logstream name, 02942000
                                     otherwise will be zeros     @LZA*/ 02943000
        ,3 SMF7TBLS BIT(64)       /* The number of bytes lost           02943108
                                     during SMF initialization.         02943208
                                     This field will be non zero if     02943308
                                     the SMF temporary buffer is        02943408
                                     exhausted and therefore            02943508
                                     records are lost during SMF        02943608
                                     initialization.             @03A*/ 02943708
        ;                                                               02943808
 %IFAL08:;                                                    /* @M1A*/ 02943912
 %IF IBM_CBGENC = 'YES' %THEN %GOTO IFAL08A;                  /* @M1A*/ 02944012
         %IF IFAR08='' %THEN %GOTO IFAL09;                    /* @M1C*/ 02950012
 %IFAL08A:;                                                   /* @M1A*/ 02951012
 /* RECORD TYPE 8 - DEVICE CONFIGURATION                             */ 02970000
 /* WRITTEN DURING SMF INITIALIZATION                                */ 02980000
    DCL 1 SMFRCD08 BASED(SMF08PTR) BDY(WORD),                           02981006
         3 SMF8LEN FIXED(15),     /* RDW RECORD LENGTH               */ 02990000
         3 SMF8SEG FIXED(15),     /* RDW SEGMENT DESCRIPTOR          */ 03000000
         3 SMF8FLG BIT(8),        /* OPERATING ENVIRONMENT           */ 03010000
         3 SMF8RTY FIXED(8),      /* RECORD TYPE 8                   */ 03020000
         3 SMF8TME FIXED(31) BDY(HWORD), /* TOD RECORD WRITTEN       */ 03030000
         3 SMF8DTE CHAR(4),       /* DATE RECORD WRITTEN             */ 03040000
         3 SMF8SID CHAR(4),       /* SYSTEM ID FROM INSTALLATION     */ 03050000
         3 SMF8LENN FIXED(15);    /* LGTH OF DEVICE SECTION PLUS        03060000
                                     THESE 2 BYTES                   */ 03070000
                                  /* DEVICE ENTRY FOR EACH DEVICE       03080000
                                     ONLINE AT IPL                   */ 03090000
 /*                                                                  */ 03100000
 /*Note: Virtual I/O Devices are identified by the following:   @LYA */ 03110000
 /*      Device Class 0                                         @LYA */ 03120000
 /*      Unit Type 0                                            @LYA */ 03130000
 /*      Device Number x'7FFF'                                  @LYA */ 03140000
 /*                                                                  */ 03150000
    DCL 1 SMF8IODV BASED BDY(WORD), /* Device Identification     @LYC*/ 03160000
         3 SMF8DUT CHAR(2),       /* DEVICE CLASS AND UNIT TYPE      */ 03170000
         3 SMF8CHA CHAR(2);       /* Device Number               @LYC*/ 03180000
                                  /*                            1@LYD*/ 03190000
 %IFAL09:;                                                    /* @M1A*/ 03190112
 %IF IBM_CBGENC = 'YES' %THEN %GOTO IFAL09A;                  /* @M1A*/ 03191012
         %IF IFAR09='' %THEN %GOTO IFAL10;                    /* @M1C*/ 03200012
 %IFAL09A:;                                                   /* @M1A*/ 03201012
 /* RECORD TYPE 9 - VARY ONLINE                                      */ 03220000
 /* WRITTEN WHEN A DEVICE IS VARIED ONLINE                           */ 03230000
    DCL 1 SMFRCD09 BASED(SMF09PTR) BDY(WORD),                           03231006
         3 SMF9LEN FIXED(15),     /* RDW RECORD LENGTH               */ 03240000
         3 SMF9SEG FIXED(15),     /* RDW SEGMENT DESCRIPTOR          */ 03250000
         3 SMF9FLG BIT(8),        /* OPERATING ENVIRONMENT           */ 03260000
         3 SMF9RTY FIXED(8),      /* RECORD TYPE 9                   */ 03270000
         3 SMF9TME FIXED(31) BDY(HWORD), /* TOD RECORD WRITTEN          03280000
                                                             @ZMC1210*/ 03290000
         3 SMF9DTE CHAR(4),       /* DATE RECORD WRITTEN             */ 03300000
         3 SMF9SID CHAR(4),       /* SYSTEM ID FROM INSTALLATION     */ 03310000
         3 SMF9LENN FIXED(15);    /* LGTH OF DEVICE SECTION + THESE 2*/ 03320000
 /*                                                                  */ 03330000
 /*Note: Virtual I/O Devices are identified by the following:   @LYA */ 03340000
 /*      Device Class 0                                         @LYA */ 03350000
 /*      Unit Type 0                                            @LYA */ 03360000
 /*      Device Number x'7FFF'                                  @LYA */ 03370000
 /*                                                                  */ 03380000
    DCL 1 SMF9DVAD BASED BDY(WORD), /*Device Identification      @LYC*/ 03390000
         3 SMF9DUT CHAR(2),       /* DEVICE CLASS AND UNIT TYPE      */ 03400000
         3 SMF9CUA CHAR(2),       /* DEVICE NUMBER           @G860P27*/ 03410000
                                  /*                            1@LYD*/ 03420000
         3 SMF9VPC FIXED(8),      /* VARY PATH CALLER            @TDA*/ 03430000
                                  /* 0 = SYSTEM CONSOLE          @TDA*/ 03440000
                                  /* 2 = ESCON MANAGER           @TDA*/ 03450000
         3 SMF9RSV CHAR(3);       /* RESERVED                    @TDA*/ 03460000
 %IFAL10:;                                                    /* @M1A*/ 03460112
 %IF IBM_CBGENC = 'YES' %THEN %GOTO IFAL10A;                  /* @M1A*/ 03461012
         %IF IFAR10='' %THEN %GOTO IFAL11;                    /* @M1A*/ 03470012
 %IFAL10A:;                                                   /* @M1A*/ 03471012
 /* RECORD TYPE 10 - ALLOCATION RECOVERY                             */ 03490000
 /* WRITTEN AFTER SUCCESSFUL DEVICE ALLOCATION RECOVERY              */ 03500000
    DCL 1 SMFRCD10 BASED(SMF10PTR) BDY(WORD),                           03501006
         3 SMF10LEN FIXED(15),    /* RDW RECORD LENGTH               */ 03510000
         3 SMF10SEG FIXED(15),    /* RDW SEGMENT DESCRIPTOR          */ 03520000
         3 SMF10FLG BIT(8),       /* OPERATING ENVIRONMENT           */ 03530000
         3 SMF10RTY FIXED(8),     /* RECORD TYPE 10                  */ 03540000
         3 SMF10TME FIXED(31) BDY(HWORD), /* TOD RECORD WRITTEN      */ 03550000
         3 SMF10DTE CHAR(4),      /* DATE RECORD WRITTEN             */ 03560000
         3 SMF10SID CHAR(4),      /* SYSTEM ID FROM INSTALLATION     */ 03570000
         3 SMF10JBN CHAR(8),      /* JOB NAME                        */ 03580000
         3 SMF10RST FIXED(31) BDY(HWORD), /*READER START TIME(.01 SEC)*/03590000
         3 SMF10RSD CHAR(4),      /* READER START DATE               */ 03600000
         3 SMF10UIF CHAR(8),      /* USER IDENTIFICATION FIELD       */ 03610000
         3 SMF10LN FIXED(15);     /* LGTH OF DEVICE SECTION + THESE 2*/ 03620000
    DCL 1 SMF10DEV BASED BDY(WORD), /*Device Identification      @LYC*/ 03630000
 /*                                                                  */ 03640000
 /*Note: Virtual I/O Devices are identified by the following:    @LYA*/ 03650000
 /*      Device Class 0                                          @LYA*/ 03660000
 /*      Unit Type 0                                             @LYA*/ 03670000
 /*      Device Number x'7FFF'                                   @LYA*/ 03680000
 /*                                                                  */ 03690000
         3 SMF10DUT CHAR(2),      /* DEVICE CLASS AND UNIT TYPE      */ 03700000
         3 SMF10CUA CHAR(2);       /* Device Number              @LYC*/ 03710000
                                   /*                           1@LYD*/ 03720000
 %IFAL11:;                                                    /* @M1A*/ 03720112
 %IF IBM_CBGENC = 'YES' %THEN %GOTO IFAL11A;                  /* @M1A*/ 03721012
         %IF IFAR11='' %THEN %GOTO IFAL12;                    /* @M1C*/ 03730012
 %IFAL11A:;                                                   /* @M1A*/ 03731012
 /* RECORD TYPE 11 - VARY OFFLINE                                    */ 03750000
 /* WRITTEN WHEN A DEVICE IS VARIED OFFLINE                          */ 03760000
    DCL 1 SMFRCD11 BASED(SMF11PTR) BDY(WORD),                           03761006
         3 SMF11LEN FIXED(15),    /* RDW RECORD LENGTH               */ 03770000
         3 SMF11SEG FIXED(15),    /* RDW SEGMENT DESCRIPTOR          */ 03780000
         3 SMF11FLG BIT(8),       /* OPERATING ENVIRONMENT           */ 03790000
         3 SMF11RTY FIXED(8),     /* RECORD TYPE 11                  */ 03800000
         3 SMF11TME FIXED(31) BDY(HWORD), /* TOD RECORD WRITTEN         03810000
                                                             @ZMC1210*/ 03820000
         3 SMF11DTE CHAR(4),      /* DATE RECORD WRITTEN             */ 03830000
         3 SMF11SID CHAR(4),      /* SYSTEM ID FROM INSTALLATION     */ 03840000
         3 SMF11LN FIXED(15);     /* LGTH OF DEVICE SECTION + THESE 2*/ 03850000
 /*                                                                  */ 03860000
 /* Note: Virtual I/O Devices are identified by the following:   @LYA*/ 03870000
 /*       Device Class 0                                         @LYA*/ 03880000
 /*       Unit Type 0                                            @LYA*/ 03890000
 /*       Device Number x'7FFF'                                  @LYA*/ 03900000
 /*                                                                  */ 03910000
    DCL 1 SMF11DEV BASED BDY(WORD), /*Device Identification      @LYC*/ 03920000
         3 SMF11DUT CHAR(2),      /* DEVICE CLASS AND UNIT TYPE      */ 03930000
         3 SMF11CUA CHAR(2),      /* DEVICE NUMBER           @G860P27*/ 03940000
                                  /*                            1@LYD*/ 03950000
         3 SMF11VPC FIXED(8),     /* VARY PATH CALLER            @TDA*/ 03960000
                                  /* 0 = SYSTEM CONSOLE          @TDA*/ 03970000
                                  /* 2 = ESCON MANAGER           @TDA*/ 03980000
         3 SMF11RSV CHAR(3);      /* RESERVED                    @TDA*/ 03990000
 %IFAL12: ;                                                             04000000
 %IF IBM_CBGENC = 'YES' %THEN %GOTO IFALR2;                   /* @M1A*/ 04001012
 %IFAL14: IF IFAR14^='' %THEN %GOTO IFAL15;                             04010000
         %IF IFAR15='' %THEN %GOTO IFAL16;                              04020000
 %IFAL15: ;                                                   /* @M1A*/ 04030012
                                    /* Remove Inline Declares  96@01D*/ 04040000
 %INCLUDE SYSLIB(IFGSMF14) NOSEG;   /* Call DFP to Expand Record @01A*/ 04050000
 %IFAL16: ;                                                             04060000
 %IFAL17:;                                                    /* @M1C*/ 04070012
         %IF IFAR17='' %THEN %GOTO IFAL18;                    /* @M1C*/ 04071012
                                    /* Remove Inline Declares  21@01D*/ 04080000
 %INCLUDE SYSLIB(IGGSMF17) NOSEG;   /* Call DFP to Expand Record @01A*/ 04090000
 %IFAL18:;                                                    /* @M1C*/ 04100012
         %IF IFAR18='' %THEN %GOTO IFAL19;                    /* @M1C*/ 04101012
                                    /* Remove Inline Declares  22@01D*/ 04110000
 %INCLUDE SYSLIB(IGGSMF18) NOSEG;   /* Call DFP to Expand Record @01A*/ 04120000
 %IFAL19:;                                                    /* @M1C*/ 04130012
         %IF IFAR19='' %THEN %GOTO IFALR2;                    /* @M1C*/ 04131012
                                    /* Remove Inline Declares  23@01D*/ 04140000
 %INCLUDE SYSLIB(IGGSMF19) NOSEG;   /* Call DFP to Expand Record @01A*/ 04150000
 %IFALR2: ;                                                             04160000
