*        %GOTO IFASMFR5A; /*                                            00010004
         MACRO                                                          00100000
&NAME    IFASMFR5 &RECTYPE                                           */ 00150004
*%IFASMFR5A:;                                                           00160004
*/***** START OF SPECIFICATIONS *************************************** 00170004
*  *                                                                  * 00200004
*01* MACRO-NAME = IFASMFR5                                            * 00250004
*  *                                                                  * 00300004
*  * COPYRIGHT =                                                      * 00350004
*  * 5650-ZOS COPYRIGHT IBM CORP., 1979, 2019                         * 00400007
*  * LICENSED MATERIALS - PROPERTY OF IBM                             * 00450004
*  *                                                                  * 00600004
*  * STATUS = HBB77C0                                                 * 00650007
*  *                                                                  * 00700004
*  * EXTERNAL CLASSIFICATION: PI                                      * 00711008
*  * END OF EXTERNAL CLASSIFICATION:                                  * 00712008
*  *                                                                  * 00713013
*  * IFASMFR5 maps SMF records in the range 47-54.                    * 00714014
*  *                                                                 */ 00720011
*        %GOTO IFASMFR5B; /*                                            00730011
.* * MACMEAN IFASMFR5 MEANS SYSTEM MANAGEMENT FACILITY RECORD MAPPING * 00750011
.* * MACCOMP Y-2 SC102/BL27P                                          * 00800011
.* * MACSTAT Y-2 73298/42020                                          * 00850011
.* * METHOD OF ACCESS                                                 * 00900011
.* *  PL/S - INCLUDE MACRO FROM LIBRARY                               * 00950011
.* *          EXAMPLE - %INCLUDE SYSLIB(IFASMFR5)                     * 01000011
.* *                                                                  * 01050011
.* *          THIS MACRO EXPANDS RECORDS 47 - 54.                     * 01100011
.* *                                                                  * 01150011
.* * CHANGE ACTIVITY:                                                   01200011
.* * $T7=UZ90334 ,JBB2125,840502,PDFS: XFER 47-49,52-54 TO SC141  @T7A  01250011
.* * $L1=270303  ,HBB77C0,180901,PDXB: Accommodate C              @L1A  01260012
.* *                                                                    01300011
.* THIS IS AN SMF MACRO WHICH BUILDS SMF RECORDS 47-54. THE REQUIRED    01350011
.* FORMAT IS -                                                          01400011
.*                                                                      01450011
.*          IFASMFR5 &RECTYPE                                        */ 01500011
*%IFASMFR5B:;                                                           01501011
*/***** END OF SPECIFICATIONS ****************************************/ 01510011
*        %GOTO IFAL47;   /*                                             01560004
         AIF   (&RECTYPE EQ 47).IFAS047                         Y02120  01600000
         AIF   (&RECTYPE EQ 48).IFAS048                         Y02120  01650000
         AIF   (&RECTYPE EQ 49).IFAS049                       @YL026WA  01700000
         AIF   (&RECTYPE EQ 50).IFAS050                                 01750000
         AIF   (&RECTYPE EQ 52).IFAS052                           @T7A  01800000
         AIF   (&RECTYPE EQ 53).IFAS053                           @T7A  01850000
         AIF   (&RECTYPE EQ 54).IFAS054                           @T7A  01900000
.E5      ANOP                                                    Y02120 01950000
         SPACE 3                                                        02000000
         MNOTE 4,'&RECTYPE INVALID RECORD TYPE SPECIFIED'               02050000
.CONTB   ANOP                                                           02100000
         MEXIT                                                          02150000
.IFAS047 ANOP                                                    Y02120 02200000
.* 56 LINES DELETED(MAP OF REC 47)TO TRANSFER OWNERSHIP TO SC141 56@T7D 02250000
         EJECT                                                   Y02120 02300000
         IAZSMFR 47     CALL SC141 TO EXPAND REC 47                @T7A 02350000
         AGO   .CONTB                                            Y02120 02400000
.IFAS048 ANOP                                                    Y02120 02450000
.* 94 LINES DELETED(MAP OF REC 48)TO TRANSFER OWNERSHIP TO SC141 94@T7D 02500000
         EJECT                                                   Y02120 02550000
         IAZSMFR 48     CALL SC141 TO EXPAND REC 48                @T7A 02600000
         AGO   .CONTB                                            Y02120 02650000
.IFAS049 ANOP                                                  @YL026WA 02700000
.* 50 LINES DELETED(MAP OF REC 49)TO TRANSFER OWNERSHIP TO SC141 50@T7D 02750000
         EJECT                                                 @YL026WA 02800000
         IAZSMFR 49     CALL SC141 TO EXPAND REC 49                @T7A 02850000
         AGO   .CONTB                                          @YL026WA 02900000
.IFAS050 ANOP                                                           02950000
         EJECT                                                          03000000
* THIS DSECT DEFINES THE FORMAT FOR RECORD TYPE 50 (VTAM       @ZA20643 03050000
* TUNING STATISTICS). THE RECORD LENGTH IS 58 BYTES.           @ZA20643 03100000
*                                                              @ZA20643 03150000
         DS    0F        ALIGN TO FULL WORD BOUNDARY           @ZA20643 03200000
SMFRCD50 EQU   *         READER SEGMENT                        @ZA20643 03250000
SMF50LEN DS    BL2'0'    RECORD LENGTH                         @ZA20643 03300000
SMF50SEG DS    BL2'0'    SEGMENT DESCRIPTOR                    @ZA20643 03350000
SMF50FLG DC    BL1'0'    HEADER FLAG TYPE                      @ZA20643 03400000
SMF50RTY DC    BL1'0'    RECORD TYPE 50                        @ZA20643 03450000
SMF50TME DC    BL4'0'    TOD,FORMAT FROM TIME MAC W/BIN INTRVL @ZA20643 03500000
SMF50DTE DC    PL4'0000' DATE IN PACKED DEC FORM: 00YYDDDF     @ZA20643 03550000
SMF50SID DS    CL4   SYSTEM IDENTIFICATION                     @ZA20643 03600000
SMF50NME DS    CL8   LOCALLY ATTCHD INTELLIGENT CONTROLLER     @ZA20643 03650000
SMF50DLR DS    BL4       DUMP/LOAD/RESTART TCB COUNT           @ZA20643 03700000
SMF50CWR DS    BL4       NUMBER OF WRITE CHANNEL PROGRAMS      @ZA20643 03750000
SMF50CRD DS    BL4       NUMBER OF READ CHANNEL PROGRAMS       @ZA20643 03800000
SMF50ATN DS    BL4       ATTENTIONS (TOTAL)                    @ZA20643 03850000
SMF50ATR DS    BL4       ATTENTIONS ON READ                    @ZA20643 03900000
SMF50PUI DS    BL4       PIO'S INBOUND                         @ZA20643 03950000
SMF50PUO DS    BL4       PIO'S OUTBOUND                        @ZA20643 04000000
SMF50BUF DS    BL4       READ BUFFERS USED                     @ZA20643 04050000
SMF50SLD DS    BL4       NCP SLOWDOWN                          @ZA20643 04100000
         AGO   .CONTB                                                   04150000
.IFAS052 ANOP                                                      @T7A 04200000
         IAZSMFR 52      CALL SC141 TO EXPAND REC 52               @T7A 04250000
         AGO   .CONTB                                              @T7A 04300000
.IFAS053 ANOP                                                      @T7A 04350000
         IAZSMFR 53      CALL SC141 TO EXPAND REC 53               @T7A 04400000
         AGO   .CONTB                                              @T7A 04450000
.IFAS054 ANOP                                                      @T7A 04500000
         IAZSMFR 54      CALL SC141 TO EXPAND REC 54               @T7A 04550000
         AGO   .CONTB                                              @T7A 04600000
         MEND          */                                               04650000
 %IFAL47:  INCLIAZ='';            /* INIT SWITCH FOR IAZ MACROS  @T7A*/ 04700000
 %IF IBM_CBGENC = 'YES' %THEN %GOTO IFAL47A;                  /* @L1A*/ 04710010
         %IF IFAR47='' %THEN %GOTO IFAL48;                  /*   @T7C*/ 04750000
 /* 61 LINES DELETED(REC 47 MAP)TO TRANSFER OWNERSHIP TO SC141 61@T7D*/ 04800000
 %IFAL47A:;                                                   /* @L1A*/ 04810010
 %IAZR47='YES';                                            /*    @T7A*/ 04850000
 %INCLIAZ='YES';   /* AN IAZ MACRO IS REQUESTED-SET FLAG SO IFASMFR     04900000
                      WILL INCLUDE THE JES IAZSMFR MACRO         @T7A*/ 04950000
 %IFAL48:;                                                    /* @L1C*/ 05000010
 %IF IBM_CBGENC = 'YES' %THEN %GOTO IFAL48A;                  /* @L1A*/ 05001010
         %IF IFAR48='' %THEN %GOTO IFAL49;                    /* @L1C*/ 05010010
 /* 98 LINES DELETED(REC 48 MAP)TO TRANSFER OWNERSHIP TO SC141 98@T7D*/ 05050000
 %IFAL48A:;                                                   /* @L1A*/ 05060010
 %IAZR48='YES';                                            /*    @T7A*/ 05100000
 %INCLIAZ='YES';   /* AN IAZ MACRO IS REQUESTED-SET FLAG SO IFASMFR     05150000
                      WILL INCLUDE THE JES IAZSMFR MACRO         @T7A*/ 05200000
 %IFAL49:;                                                    /* @L1C*/ 05250010
 %IF IBM_CBGENC = 'YES' %THEN %GOTO IFAL49A;                  /* @L1A*/ 05251010
         %IF IFAR49='' %THEN %GOTO IFAL50;                    /* @L1C*/ 05260010
 /* 49 LINES DELETED(REC 49 MAP)TO TRANSFER OWNERSHIP TO SC141 49@T7D*/ 05300000
 %IFAL49A:;                                                   /* @L1A*/ 05310010
 %IAZR49='YES';                                            /*    @T7A*/ 05350000
 %INCLIAZ='YES';   /* AN IAZ MACRO IS REQUESTED-SET FLAG SO IFASMFR     05400000
                      WILL INCLUDE THE JES IAZSMFR MACRO         @T7A*/ 05450000
 %IFAL50:;                                                    /* @L1C*/ 05500010
 %IF IBM_CBGENC = 'YES' %THEN %GOTO IFAL50A;                  /* @L1A*/ 05501010
         %IF IFAR50='' %THEN %GOTO IFAL52;                    /* @L1C*/ 05510010
 %IFAL50A:;                                                   /* @L1A*/ 05520010
    DCL 1 SMFRCD50 BASED(SMF50PTR) BDY(WORD),          /*    @ZA20643*/ 05550000
 /* RECORD TYPE 50 - VTAM TUNING STATISTICS RECORD           @ZA20643*/ 05600000
 /* RECORD LENGTH IS 58 BYTES                                @ZA20643*/ 05650000
         3 SMF50LEN FIXED(15),     /* RECORD LENGTH          @ZA20643*/ 05700000
         3 SMF50SEG FIXED(15),     /* SEGMENT DESCRIPTOR     @ZA20643*/ 05750000
         3 SMF50FLG BIT(8),        /* OPERATING ENVIRONMENT  @ZA20643*/ 05800000
         3 SMF50RTY FIXED(8),      /* RECORD TYPE 50         @ZA20643*/ 05850000
         3 SMF50TME FIXED(31) BDY(BYTE), /* TOD RECORD WRITTEN          05900000
                                                             @ZA20643*/ 05950000
         3 SMF50DTE CHAR(4),       /* DATE IN PACKED FORM    @ZA20643*/ 06000000
         3 SMF50SID CHAR(4),       /* SYSTEM IDENTIFICATION  @ZA20643*/ 06050000
         3 SMF50NME CHAR(8),       /* LOCALLY ATTACHED INTELLIGENT      06100000
                                      CONTROLLER             @ZA20643*/ 06150000
         3 SMF50DLR FIXED(31) BDY(BYTE), /* DUMP,LOAD,RESTART,TCB       06200002
                                      COUNT                      @L1C*/ 06250010
         3 SMF50CWR FIXED(31) BDY(BYTE)                                 06300002
                             ,     /* # OF WRITE CHANNEL PGMS    @L1C*/ 06310010
         3 SMF50CRD FIXED(31) BDY(BYTE)                                 06350002
                             ,     /* # OF READ CHANNEL PGMS     @L1C*/ 06360010
         3 SMF50ATN FIXED(31) BDY(BYTE), /* ATTENTIONS (TOTAL)   @L1C*/ 06410010
         3 SMF50ATR FIXED(31) BDY(BYTE), /* ATTENTIONS ON READ   @L1C*/ 06460010
         3 SMF50PUI FIXED(31) BDY(BYTE), /* PIO'S INBOUND        @L1C*/ 06510010
         3 SMF50PUO FIXED(31) BDY(BYTE), /* PIO'S OUTBOUND       @L1C*/ 06560010
         3 SMF50BUF FIXED(31) BDY(BYTE), /* READ BUFFERS USED    @L1C*/ 06610010
         3 SMF50SLD FIXED(31) BDY(BYTE); /* NCP SLOWDOWN         @L1C*/ 06660010
 %IFAL52:;                                                    /* @L1C*/ 06700010
 %IF IBM_CBGENC = 'YES' %THEN %GOTO IFAL52A;                  /* @L1A*/ 06701010
         %IF IFAR52='' %THEN %GOTO IFAL53;                    /* @L1C*/ 06710010
 %IFAL52A:;                                                   /* @L1A*/ 06720010
 %IAZR52='YES';                                            /*    @T7A*/ 06750000
 %INCLIAZ='YES';   /* AN IAZ MACRO IS REQUESTED-SET FLAG SO IFASMFR     06800000
                      WILL INCLUDE THE JES IAZSMFR MACRO         @T7A*/ 06850000
 %IFAL53:;                                                    /* @L1C*/ 06900010
 %IF IBM_CBGENC = 'YES' %THEN %GOTO IFAL53A;                  /* @L1A*/ 06901010
         %IF IFAR53='' %THEN %GOTO IFAL54;                    /* @L1C*/ 06910010
 %IFAL53A:;                                                   /* @L1A*/ 06920010
 %IAZR53='YES';                                            /*    @T7A*/ 06950000
 %INCLIAZ='YES';   /* AN IAZ MACRO IS REQUESTED-SET FLAG SO IFASMFR     07000000
                      WILL INCLUDE THE JES IAZSMFR MACRO         @T7A*/ 07050000
 %IFAL54:;                                                    /* @L1C*/ 07100010
 %IF IBM_CBGENC = 'YES' %THEN %GOTO IFAL54A;                  /* @L1A*/ 07101010
         %IF IFAR54='' %THEN %GOTO IFALXX;                    /* @L1C*/ 07110010
 %IFAL54A:;                                                   /* @L1A*/ 07120010
 %IAZR54='YES';                                            /*    @T7A*/ 07150000
 %INCLIAZ='YES';   /* AN IAZ MACRO IS REQUESTED-SET FLAG SO IFASMFR     07200000
                      WILL INCLUDE THE JES IAZSMFR MACRO         @T7A*/ 07250000
 %IFALXX: ;                                                             07300000
