*/********************************************************************* 00000100
* $MAC(IGGEBPFX) COMP(28414):                                           00000200
*                                                                       00000300
* MACRO NAME:  IGGEBPFX                                                 00000400
*                                                                       00000500
* DESCRIPTION: If the basic format or large format data set on DASD is  00000600
*              encrypted, the access method (BSAM or QSAM) inserts the  00000700
*              prefix on each block.  It is not visible to the user     00000800
*              unless the user issues EXCP, EXCPVR or XDAP or the user  00000900
*              reads with BSAM CI mode.                                 00001000
*              The length of the prefix is not included in the BLKSIZE  00001100
*              value in the DSCB, JFCB, DCB or DCBE.                    00001200
*              A program that reads or writes with EXCP,EXCPVR or XDAP  00001300
*              must account for this block prefix.  Either every block  00001400
*              or no block must have it.                                00001500
*                                                                       00001600
* STATUS: z/OS 2.5 DFSMS                                                00001700
*                                                                       00001800
* PROPRIETARY V3 STATEMENT                                              00001900
* Licensed Materials - Property of IBM                                  00002000
* "Restricted Materials of IBM"                                         00002100
* 5650-ZOS                                                              00002200
* Copyright IBM Corp. 2020                                              00002300
* END PROPRIETARY V3 STATEMENT                                          00002400
*                                                                       00002500
* FUNCTION: Map the block prefix for basic format and large             00002600
*           format encrypted sequential data sets.                      00002700
*                                                                       00002800
* INVOCATION:                                                           00002900
*     Assembler: IGGEBPFX                                               00003000
*     PL/X: %EBP_Base = 'BASED'       (Default is 'BASED')              00003100
*           %Include SYSLIB(IGGEBPFX)                                   00003200
*$L0=ENCRYPT,HDZ2240,20191014,SVLWER: seq. data set encryption     @L0A 00003300
**********************************************************************/ 00003400
*    %GOTO EBPPLX;                                                      00003500
* Map the block prefix for basic format and large format encrypted      00003600
* sequential data sets.                                                 00003700
         MACRO     /* Allow for unbalanced quote (bilingual macro)      00003800
         IGGEBPFX                                                       00003900
.* Skip error message if only parameters are null.                      00004000
         AIF   (N'&SYSLIST LE 2 AND                                    *00004100
               '&SYSLIST(1)' EQ '' AND '&SYSLIST(2)' EQ '').Expand      00004200
         MNOTE 4,'Positional parameter ignored'                         00004300
.Expand  ANOP                                                           00004400
EBP      DSECT           Encrypted block prefix, sequential data set    00004500
EBPFlag1 DS   X          Flags.  Reserved bits must be zero             00004600
EBPEncrypted EQU X'80'   This block is encrypted                        00004700
         DS    XL2       Reserved, must be zero                         00004800
EBPTTTT  DS    FL4       Relative track number across all volumes,      00004900
*                        first is zero                                  00005000
EBPR     DS    FL1       Block number on track, first is 1              00005100
EBPLen   EQU   *-EBP                                                    00005200
         MEND      end of allowing unbalanced quote */                  00005300
*%EBPPLX:;                                                              00005400
*%If EBP_Base = '' %then %EBP_Base = 'BASED';                           00005500
*Dcl 1 EBP      EBP_Base,                                               00005600
*      2 EBPFlag1 bit(8),         ]+0 Flags                             00005700
*        3 EBPEncrypted bit(1),   ]   This block is encrypted           00005800
*        3 *      bit(7),         ]   Reserved, must be zero            00005900
*      2 *        char(2),        ]+1 Reserved, must be zero            00006000
*      2 EBPTTTT fixed bdy(byte), ]+3 Relative track number across all  00006100
*                                 ]   volumes.  First is zero.          00006200
*      2 EBPR     fixed(8);       ]+7 Block number on track, first is 1 00006300
