*        %GOTO SMF69PLS;      /*                                        00050000
         MACRO                                                          00100000
&NAME    IGGSMF69                                                       00150000
.********************************************************************** 00200000
.*  This macro is obsolete but we are keeping it around just in case. * 00210000
.*  Pat Choi 2/5/2019                                                 * 00220000
.********************************************************************** 00230000
.*                                                                    * 00250000
.*   MACRO NAME = IGGSMF69                                            * 00300000
.*                                                                    * 00350000
.*PROPRIETARY V3 STATEMENT                                            * 00400000
.*LICENSED MATERIALS - PROPERTY OF IBM                                * 00450000
.*"RESTRICTED MATERIALS OF IBM"                                       * 00500000
.*5650-ZOS                                                            * 00550002
.*COPYRIGHT IBM CORP. 1993,2019                                       * 00600002
.*END PROPRIETARY V3 STATEMENT                                        * 00650000
.*                                                                    * 00750000
.*                                                                    * 00800000
.* This is the macro that includes the Assembler and PLS declarations * 00850000
.* for the SMF Type 69 Record.                                        * 00900000
.*                                                                    * 00950000
.* Method of Access:                                                  * 01000000
.*   ASM - User includes Record Type on IFASMFR macro invocation      * 01050000
.*         Examples:                                                  * 01100000
.*         - IFASMFR  69                                              * 01150000
.*         - IFASMFR (...,69,...)                                     * 01200000
.*                                                                    * 01250000
.*  PL/S - User defines a macro variable IFAR69 where 69=Record type  * 01300000
.*         being requested, INCLUDEs the IFASMFR macro and declares   * 01350000
.*         the basing pointer for the record mapping.                 * 01400000
.*         Example:                                                   * 01450000
.*         - %IFAR69 = 'YES'                                          * 01500000
.*           DCL SMF69PTR PTR(31)                                     * 01550000
.*           %INCLUDE SYSLIB(IFASMFR)                                 * 01600000
.*                                                                    * 01650000
.*                                                                    * 01700000
.* CHANGE ACTIVITY =                                                  * 01750000
.*                                                                    * 01800000
.* NOTE: All record mapping changes must be forwarded to the SMF      * 01850000
.*       writer for inclusion in the SMF Manual                       * 01900000
.*                                                                    * 01950000
.* A - Define new macro for record mapping                        @00A* 02000000
.*                                                                    * 02050000
.* $00=.......,.......,......,....: DFP Record Mappings Transfer  @00A* 02100000
.* $L1=T270967,HDZ2240,2019FEB05,PDChoi:                          @01A* 02110001
.*  1) Add comment at the top to say this macro is obsolete.      @01A* 02120001
.*  2) Fix copyright                                              @01A* 02130001
.*  3) Make PL/X statements assembler comments and remove MEXIT   @01A* 02140001
.*     so that PADI doesn't complain.                             @01A* 02141001
.*  4) No statements flagged.                                     @01A* 02142001
.*                                                                    * 02200000
.********************************************************************** 02250000
*                                                                       02300000
* THIS DSECT DEFINES THE FORMAT FOR RECORD TYPE 69 (VSAM DATA           02350000
* SPACE DEFINED OR DELETED).  RECORD LENGTH IS 102 BYTES.               02400000
*                                                                       02450000
         DS    0F                  ALIGN TO FULLWORD BOUNDARY           02500000
SMFRCD69 EQU   *                   HEADER SEGMENT                       02550000
SMF69LEN DS    BL2'0'              RECORD LENGTH                        02600000
SMF69SEG DS    BL2'0'              SEGMENT DESCRIPTOR                   02650000
SMF69FLG DC    BL1'0'              HEADER FLAG BYTE                     02700000
SMF69RTY DC    BL1'0'              RECORD TYPE 69                       02750000
SMF69TME DC    BL4'0'              TOD, USING FORMAT FROM TIME MACRO    02800000
*                                  WITH BIN INTERVAL                    02850000
SMF69DTE DC    PL4'0000'           DATE IN PACKED DECIMAL FORM          02900000
*                                  00YYDDDF (F IS THE SIGN)             02950000
SMF69SID DC    CL4' '              SYSTEM IDENTIFICATION                03000000
SMF69JBN DC    CL8' '              JOBNAME                              03050000
SMF69RST DC    BL4'0'              READER START TIME IN 100THS SECONDS  03100000
SMF69RSD DC    PL4'0000'           READER START DATE                    03150000
SMF69UIF DC    CL8' '              USER IDENTIFICATION FIELD            03200000
SMF69CUU DC    BL2'0'              DEVICE NUMBER                        03250000
SMF69IND DC    BL2'0'              MODULE/SPINDLE ID                    03300000
SMF69NDS DC    BL2'0'              NUMBER OF EXTENT ON VOLUME           03350000
SMF69NUC DC    BL2'0'              NUMBER UNALLOCATED CYLS ON VOLUME    03400000
SMF69NUT DC    BL2'0'              NUMBER UNALLOCATED TRKS. ON          03450000
*                                  VOLUME-NOT IN UNAL CYL'S             03500000
SMF69LNC DC    BL2'0'              LARGEST # FREE CONTG. CYLS           03550000
SMF69LNT DC    BL2'0'              LARGEST # FREE CONTG. TRKS           03600000
SMF69CNM DC    CL44' '             CATALOG NAME                         03650000
SMF69VSR DC    CL6' '              VOLUME SERIAL                        03700000
*                                                                       03750000
         MEND */                                                        03800003
*%SMF69PLS:;                                                            03900003
*                                                                       03950003
*   DCL 1 SMFRCD69 BASED(SMF69PTR) BDY(WORD),                           04000003
*                                                                       04050003
*/* RECORD TYPE 69 - VSAM DATA SPACE DEFINED OR DELETED              */ 04100003
*/* WRITTEN WHEN A DATA SPACE IS DEFINED OR DELETED                  */ 04150003
*                                                                       04200003
*        3 SMF69LEN FIXED(15),    /* RDW RECORD LWNGTH               */ 04250003
*        3 SMF69SEG FIXED(15),    /* RDW SEGMENT DESCRIPTOR          */ 04300003
*        3 SMF69FLG BIT(8),       /* OPERATING ENVIRONMENT           */ 04350003
*        3 SMF69RTY FIXED(8),     /* RECORD TYPE 69                  */ 04400003
*        3 SMF69TME FIXED(31) BDY(HWORD), /* TOD RECORD WRITTEN      */ 04450003
*        3 SMF69DTE CHAR(4),      /* DATE RECORD WRITTEN             */ 04500003
*        3 SMF69SID CHAR(4),      /* SYSTEM ID FROM INSTALLATION     */ 04550003
*        3 SMF69JBN CHAR(8),      /* JOB NAME                        */ 04600003
*        3 SMF69RST FIXED(31) BDY(HWORD), /* RDR START TOD(.01 SEC)  */ 04650003
*        3 SMF69RSD CHAR(4),      /* READER START DATE               */ 04700003
*        3 SMF69UIF CHAR(8),      /* USER IDENTIFICATION FIELD       */ 04750003
*        3 SMF69CUU CHAR(2),      /* DEVICE NUMBER                   */ 04800003
*        3 SMF69IND CHAR(2),      /* MODULE/SPINDLE ID               */ 04850003
*        3 SMF69NDS FIXED(15),    /* # OF EXTENTS ON VOLUME          */ 04900003
*        3 SMF69NUC FIXED(15),    /* # UNALLOCATED CYLS ON VOLUME    */ 04950003
*        3 SMF69NUT FIXED(15),    /* # UNAL TRKS ON VOL-NOT IN UNAL     05000003
*                                    CYLS                            */ 05050003
*        3 SMF69LNC FIXED(15),    /* LARGEST # FREE CONTG. CYLS      */ 05100003
*        3 SMF69LNT FIXED(15),    /* LARGEST # FREE CONTG. TRKS      */ 05150003
*        3 SMF69CNM CHAR(44),     /* CATALOG NAME                    */ 05200003
*        3 SMF69VSR CHAR(6);      /* VOLUME SERIAL NUMBER            */ 05250003
*                                                                       05300003
