*        %GOTO SMF68PLS;      /*                                        00050000
         MACRO                                                          00100000
&NAME    IGGSMF68                                                       00150000
.********************************************************************** 00200000
.*  This macro is obsolete but we are keeping it around just in case. * 00210000
.*  Pat Choi 2/5/2019                                                 * 00220000
.********************************************************************** 00230000
.*                                                                    * 00250000
.*   MACRO NAME = IGGSMF68                                            * 00300000
.*                                                                    * 00350000
.*PROPRIETARY V3 STATEMENT                                            * 00400000
.*LICENSED MATERIALS - PROPERTY OF IBM                                * 00450000
.*"RESTRICTED MATERIALS OF IBM"                                       * 00500000
.*5650-ZOS                                                            * 00550002
.*COPYRIGHT IBM CORP. 1993,2019                                       * 00600002
.*END PROPRIETARY V3 STATEMENT                                        * 00650000
.*                                                                    * 00750000
.*                                                                    * 00800000
.* This is the macro that includes the Assembler and PLS declarations * 00850000
.* for the SMF Type 68 Record.                                        * 00900000
.*                                                                    * 00950000
.* Method of Access:                                                  * 01000000
.*   ASM - User includes Record Type on IFASMFR macro invocation      * 01050000
.*         Examples:                                                  * 01100000
.*         - IFASMFR  68                                              * 01150000
.*         - IFASMFR (...,68,...)                                     * 01200000
.*                                                                    * 01250000
.*  PL/S - User defines a macro variable IFAR68 where 68=Record type  * 01300000
.*         being requested, INCLUDEs the IFASMFR macro and declares   * 01350000
.*         the basing pointer for the record mapping.                 * 01400000
.*         Example:                                                   * 01450000
.*         - %IFAR68 = 'YES'                                          * 01500000
.*           DCL SMF68PTR PTR(31)                                     * 01550000
.*           %INCLUDE SYSLIB(IFASMFR)                                 * 01600000
.*                                                                    * 01650000
.*                                                                    * 01700000
.* CHANGE ACTIVITY =                                                  * 01750000
.*                                                                    * 01800000
.* NOTE: All record mapping changes must be forwarded to the SMF      * 01850000
.*       writer for inclusion in the SMF Manual                       * 01900000
.*                                                                    * 01950000
.* A - Define new macro for record mapping                        @00A* 02000000
.*                                                                    * 02050000
.* $00=.......,.......,......,....: DFP Record Mappings Transfer  @00A* 02100000
.* $L1=T270967,HDZ2240,2019FEB05,PDChoi:                          @01A* 02110001
.*  1) Add comment at the top to say this macro is obsolete.      @01A* 02120001
.*  2) Fix copyright                                              @01A* 02130001
.*  3) Make PL/X statements assembler comments and remove MEXIT   @01A* 02140001
.*     so that PADI doesn't complain.                             @01A* 02141001
.*  4) No statements flagged.                                     @01A* 02150001
.*                                                                    * 02200000
.********************************************************************** 02250000
*                                                                       02300000
* THIS DSECT DEFINES THE FORMAT FOR RECORD TYPE 68 (VSAM DATA           02350000
* SET RENAMED).  RECORD LENGTH IS 170 BYTES                             02400000
*                                                                       02450000
         DS    0F                   ALIGN TO FULLWORD BOUNDARY          02500000
SMFRCD68 EQU   *                    HEADER SEGMENT                      02550000
SMF68LEN DS    BL2'0'               RECORD LENGTH                       02600000
SMF68SEG DS    BL2'0'               SEGMENT DESCRIPTOR                  02650000
SMF68FLG DC    BL1'0'               HEADER FLAG BYTE                    02700000
SMF68RTY DC    BL1'0'               RECORD TYPE 68                      02750000
SMF68TME DC    BL4'0'               TOD USING FORMAT FROM TIME          02800000
*                                   MACRO WITH BIN INTERVAL             02850000
SMF68DTE DC    PL4'0000'            DATE IN PACKED DECIMAL FORMAT       02900000
*                                   00YYDDDF (F IS THE SIGN)            02950000
SMF68SID DC    CL4' '               SYSTEM IDENTIFICATION               03000000
SMF68JBN DC    CL8' '              JOBNAME                              03050000
SMF68RST DC    BL4'0'              READER START TIME (IN 100THS         03100000
*                                  SECONDS)                             03150000
SMF68RSD DC    PL4'0000'            READER START DATE                   03200000
SMF68UIF DC    CL8' '               USER IDENTIFICATION FIELD           03250000
SMF68CNM DC    CL44' '              CATALOG NAME                        03300000
SMF68ONM DC    CL44' '              OLD DATA SET NAME                   03350000
SMF68NNM DC    CL44' '              NEW DATA SET NAME                   03400000
*                                                                       03450000
         MEND */                                                        03500003
*%SMF68PLS:;                                                            03600003
*                                                                       03650003
*   DCL 1 SMFRCD68 BASED(SMF68PTR) BDY(WORD),                           03700003
*                                                                       03750003
*/* RECORD TYPE 68 - VSAM DATA SET RENAME                            */ 03800003
*/* WRITTEN WHEN A VSAM DATA SET OR INDEX IS RENAMED                 */ 03850003
*                                                                       03900003
*        3 SMF68LEN FIXED(15),    /* RDW RECORD LENGTH               */ 03950003
*        3 SMF68SEG FIXED(15),    /* RDW SEGMENT DESCRIPTOR          */ 04000003
*        3 SMF68FLG BIT(8),       /* OPERATING ENVIRONMENT           */ 04050003
*        3 SMF68RTY FIXED(8),     /* RECORD TYPE 68                  */ 04100003
*        3 SMF68TME FIXED(31) BDY(HWORD), /* TOD RECORD WRITTEN      */ 04150003
*        3 SMF68DTE CHAR(4),      /* DATE RECORD WRITTEN             */ 04200003
*        3 SMF68SID CHAR(4),      /* SYSTEM ID FROM INSTALLATION     */ 04250003
*        3 SMF68JBN CHAR(8),      /* JOB NAME                        */ 04300003
*        3 SMF68RST FIXED(31) BDY(HWORD), /* RDR START TOD(.01 SEC)  */ 04350003
*        3 SMF68RSD CHAR(4),      /* READER START DATE               */ 04400003
*        3 SMF68UIF CHAR(8),      /* USER IDENTIFICATION FIELD       */ 04450003
*        3 SMF68CNM CHAR(44),     /* CATALOG NAME                    */ 04500003
*        3 SMF68ONM CHAR(44),     /* OLD DATA SET NAME               */ 04550003
*        3 SMF68NNM CHAR(44);     /* NEW DATA SET NAME               */ 04600003
*                                                                       04650003
