         MACRO                                                          00050000
         IGGVREC                                                        00100000
.*                                                                      00150000
.*  MAPS THE BLOCK DESCRIPTOR WORD AND RECORD DESCRIPTOR WORD FOR       00200000
.*  VARIABLE FORMAT RECORDS.                                            00250000
.*                                                                      00300000
.*   CHANGE ACTIVITY                                                    00350000
.*$L0=GT32K,HDZ11F0,990119,SJPLRK: NEW                           @L0A   00400000
.*$L1=279971,HDZ2240,181029,SJPLVV: SHIP IN MACLIB               @L1A   00400100
.*                                                                      00450000
.*PROPRIETARY V3 STATEMENT                                              00500000
.*LICENSED MATERIALS - PROPERTY OF IBM                                  00550000
.*"RESTRICTED MATERIALS OF IBM"                                         00600000
.*5650-ZOS                                                              00650000
.*COPYRIGHT IBM CORP. 2000,2018                                         00700000
.*END PROPRIETARY V3 STATEMENT                                          00750000
.*                                                                      00800000
VARREC   DSECT                BDW, RDW FOR V-FORMAT RECORDS             00850000
VRBDW    DS    0F             BLOCK DESCRIPTOR WORD                     00900000
VRBDWLL  DS    0H             BLOCK LENGTH -- LL                        00950000
VRBDWXFM EQU   X'80'          EXTENDED FORMAT INDICATOR                 01000000
VRBDLLLL DS    F              EXTENDED FORMAT BLOCK LENGTH -- LLLL      01050000
VRRDW    DS    0F             RECORD DESCRIPTOR WORD                    01100000
VRRDWLL  DS    0H             RECORD LENGTH -- LL                       01150000
VRSDW    DS    0F             SEGMENT DESCRIPTOR WORD                   01200000
VRSDWLL  DS    H              SEGMENT LENGTH - LL                       01250000
VRRDW00  DS    0H             RDW RESERVED BYTES                        01300000
VRSDWC   DS    C              SEGMENT CONTROL CODE BYTE                 01350000
VRSDW0   DS    X              RESERVED, MUST BE 0                       01400000
         MEND                                                           01450000
