*        %GOTO VSMDPLS1;            /*                                  00010000
         MACRO                                                          00020000
         IGVVSMD                                                        00030000
         AGO   .VSMD1                                                */ 00040000
*%VSMDPLS1: ;                       /*                                  00050000
.VSMD1   ANOP                                                        */ 00060000
*/* START OF SPECIFICATIONS ******************************************* 00391000
*                                                                       00392000
*01* DESCRIPTIVE NAME: VSM Descriptors                                  00393000
*                                                                       00394000
*01* MACRO NAME:  IGVVSMD                                               00395000
*                                                                       00396000
*01* FUNCTION:                                                          00396100
*02* Describes information provided by VSMLIST service.                 00396200
*                                                                       00396300
*01* EXTERNAL CLASSIFICATION: PI                                        00397000
*01* END OF EXTERNAL CLASSIFICATION:                                    00398000
*                                                                       00399000
*01* DSECT NAME:                                                        00399100
*     VSMD                                                              00399200
*                                                                       00399300
*01* PROPRIETARY STATEMENT:                                             00399400
*      Licensed Materials - Property of IBM                             00399600
*      5650-ZOS                                                         00399700
*      COPYRIGHT IBM CORP. 1980, 2019                                   00399800
*                                                                       00399900
*01* METHOD OF ACCESS:                                                  00400000
*                                                                       00400100
*01* COMPONENT:  Virtual Storage Manager (SC1CH)                        00400200
*                                                                       00400300
*01* EYE-CATCHER:  None                                                 00400400
*                                                                       00400500
*01* STORAGE ATTRIBUTES:                                                00400600
*02*  Subpool:   Any                                                    00400700
*02*  Key:       Any                                                    00400800
*                                                                       00400900
*01* SIZE:                                                              00401000
*      8 bytes                                                          00401100
*                                                                       00401200
*01* CREATED BY:                                                        00401300
*     N/A                                                               00401400
*                                                                       00401500
*01* POINTED TO BY:                                                     00401600
*     N/A                                                               00401700
*                                                                       00401800
*01* SERIALIZATION:                                                     00401900
*     None                                                              00402000
*                                                                       00402100
*01* CHANGE ACTIVITY:                                                   00402200
*    $P1=WI230767,HBB77C0,180731,PD00ED: Add VSMDIEP                    00402300
*    $P2=WI298221,HBB77C0,190204,PD00OH: Make ShowHdr Compliant         00402402
*                                                                       00402501
*  END OF SPECIFICATIONS                                             */ 00402601
*/* A - 000000-999999                                        @G860P9T*/ 00403000
*        %GOTO VSMDPLS2;            /*                                  00410000
VSMD     DSECT                                                          00420000
VSMDSP   DS    0F                      SUBPOOL DESCRIPTOR               00430000
VSMDFRMT DS    AL1                     INDICATES FORMAT OF DESC.        00440000
VSMDLEN  DS    AL1                     LENGTH OF THE DESCRIPTOR         00450000
VSMDID   DS    AL1                     SUBPOOL ID                       00460000
VSMDKEY  DS    AL1                     STORAGE KEY (BITS 0 - 3)         00470000
         ORG   VSMDKEY                                                  00480000
VSMDFLGS DS    BL1                     MISCELLANEOUS FLAGS              00490000
VSMDOWN  EQU   X'08'                   IF ONE, THE SUBPOOL IS OWNED     00500000
VSMDSHR  EQU   X'04'                   IF ONE, THE SUBPOOL IS SHARED    00510000
VSMDINV  EQU   X'02'                   IF ONE, THE SUBPOOL IS INVALID   00520000
VSMDIEP  EQU   X'01'                   IF ONE, THE STORAGE IS NON      X00521000
                                       EXECUTABLE                  @P1A 00522000
VSMDTCBP DS    AL4                     ADDRESS OF OWNING TCB OR ZERO    00530000
         ORG   VSMDSP                                                   00540000
VSMDBLK  DS    0F                      BLOCK DESCRIPTOR                 00550000
VSMDAREA DS    A                       ADDRESS OF BLOCK                 00560000
VSMDSIZE DS    A                       SIZE OF THE BLOCK                00570000
         ORG   VSMDSP                                                   00580000
VSMDTCB  DS    A                       ADDRESS OF OWNING TCB            00590000
         ORG   VSMDSP                                                   00600000
VSMDCNT  DS    A                       NUMBER OF DESCRIPTORS THAT       00610000
*                                      FOLLOW                           00620000
         MEND                                                      , */ 00630000
*%VSMDPLS2: ;                                                           00640000
*DCL 1 VSMDSP BASED(VSMDPTR),       /* SUBPOOL DESCRIPTOR            */ 00650000
*      2 VSMDFRMT FIXED(8),         /* INDICATES FORMAT OF DESC.     */ 00660000
*      2 VSMDLEN  FIXED(8),         /* LENGTH OF THE DESCRIPTOR      */ 00670000
*      2 VSMDID   FIXED(8),         /* SUBPOOL ID                    */ 00680000
*      2 VSMDKEY  FIXED(8),         /* STORAGE KEY (BITS 0 - 3)      */ 00690000
*        3 VSMDFLGS CHAR(1),        /* MISCELLANEOUS FLAGS           */ 00700000
*          4 *        BIT(4),                                           00710000
*          4 VSMDOWN  BIT(1),       /* IF ONE, THE SUBPOOL IS OWNED  */ 00720000
*          4 VSMDSHR  BIT(1),       /* IF ONE, THE SUBPOOL IS SHARED */ 00730000
*          4 VSMDINV  BIT(1),       /* IF ONE, THE SUBPOOL IS           00740000
*                                      INVALID                       */ 00740100
*          4 VSMDIEP  BIT(1),       /* IF ONE, THE STORAGE IS NON       00741000
*                                      EXECUTABLE                @P1A*/ 00742000
*      2 VSMDTCBP PTR(31);          /* ADDRESS OF OWNING TCB OR ZERO */ 00760000
*DCL 1 VSMDBLK BASED(VSMDPTR),      /* BLOCK DESCRIPTOR              */ 00770000
*      2 VSMDAREA PTR(31),          /* ADDRESS OF BLOCK              */ 00780000
*      2 VSMDSIZE FIXED(31);        /* SIZE OF THE BLOCK             */ 00790000
*DCL   VSMDTCB PTR(31) BASED(VSMDPTR); /* ADDRESS OF OWNING TCB      */ 00800000
*DCL   VSMDCNT FIXED(31) BASED(VSMDPTR); /* NUMBER OF DESCRIPTORS       00810000
*                                      THAT FOLLOW                   */ 00820003
