* %GOTO ISMHDR;                                                         00010000
         MACRO                                                          00020000
         IGWCISM &DSECT=YES,&VERSION=1                           @L7C   00030000
         AIF ('&VERSION' EQ '1' OR '&VERSION' EQ '2').ISMHDR     @L7A   00031000
         IGGERMAC 205,'VERSION','1 OR 2'                         @L7A   00032000
         MEXIT                                                   @L7A   00033000
*        AGO   .ISMHDR                                                  00034000
* %ISMHDR:;                                                             00035000
*%/*                                                                    00036000
.ISMHDR  ANOP              */;                                          00037000
*/********************************************************************/ 00038000
*/*                                                                  */ 00039000
*/* $MAC(IGWCISM) COMP(28473): MAPPING MACRO FOR IS_IT_MANAGED?      */ 00040000
*/*                                                                  */ 00050000
*/*  MACRO NAME: IGWCISM                                             */ 00060000
*/*                                                                  */ 00070000
*/*  DESCRIPTION: MAP THE FPL FOR COMMON ADAPTER IS_IT_MANAGED?      */ 00080000
*/*               (IGWCISM MODULE)                               @L1A*/ 00090000
*/*                                                                  */ 00100000
*/*  STATUS: SEE CHANGE ACTIVITY                                 @L1C*/ 00110000
*/*                                                                  */ 00120000
*/*PROPRIETARY V3 STATEMENT                                          */ 00130000
*/*LICENSED MATERIALS - PROPERTY OF IBM                              */ 00140000
*/*"RESTRICTED MATERIALS OF IBM"                                     */ 00150000
*/*5650-ZOS                                                          */ 00160000
*/*COPYRIGHT IBM CORP. 1993,2017                                     */ 00170000
*/*END PROPRIETARY V3 STATEMENT                                      */ 00180000
*/*                                                                  */ 00190000
*/*  FUNCTION: THIS MACRO MAPS THE FPL FOR MODULE IGWCIMGD       @L1C*/ 00200000
*/*                                                                  */ 00210000
*/*  NOTES:                                                          */ 00220000
*/*                                                                  */ 00230000
*/*    DEPENDENCIES: NONE                                            */ 00240000
*/*    RESTRICTIONS: NONE                                            */ 00250000
*/*                                                                  */ 00260000
*/*    LINKAGE:                                                      */ 00270000
*/*      PL/AS:                                                      */ 00280000
*/*        %INCLUDE SYSLIB(IGWCISM)                                  */ 00290000
*/*                                                                  */ 00300000
*/*      ASSEMBLER:                                                  */ 00310000
*/*        IGWCISM <DSECT={YES!ANYTHING ELSE}>                       */ 00320000
*/*        - DSECT=YES CAUSES A DSECT WITH NAME "ISM" TO BE          */ 00330000
*/*                    DEFINED. DEFAULT FOR "DSECT" IS YES.          */ 00340000
*/*                                                                  */ 00350000
*/*  EXIT NORMAL:                                                    */ 00360000
*/*                                                                  */ 00370000
*/*    RETURN CODE: 0                                                */ 00380000
*/*    NO ERRORS DETECTED, MAPPING MACRO ONLY.                       */ 00390000
*/*                                                                  */ 00400000
*/*  EXIT ERRORS:                                                    */ 00410000
*/*                                                                  */ 00420000
*/*    NO ERRORS WILL BE DETECTED BY THIS MACRO.                     */ 00430000
*/*                                                                  */ 00440000
*/*  EXTERNAL REFERENCES: NONE                                       */ 00450000
*/*                                                                  */ 00460000
*/*  CHANGE ACTIVITY:                                                */ 00470000
*/*                                                                  */ 00480000
*/*  $L0=PDSE,HDP3320,880206,STLFPC:   PDSE SUPPORT              @L0A*/ 00490000
*/*  $01=OY28734,HDP3320,900111,SJPLCC: UPDATE COPYRIGHT         @01A*/ 00500000
*/*  $02=OY32467,HDP3320,900111,SJPLCC: UPDATE COPYRIGHT         @02A*/ 00510000
*/*                                                                  */ 00520000
*/*    DFSMS 1.1.0 CHNAGES                                       @L1A*/ 00530000
*/* $L1=PM,JDZ1110,910321,SJPLREB: DATATYPE AND CONCAT=ALL PARMS @L1A*/ 00540000
*/* $L2=STRIPE,JDZ1110,920812,SJPLREB: STRIPED DATA SET SUPPORT  @L2A*/ 00550000
*/* $03=OY64658,JDZ1110,930604,SJPLREB: CORRECT ISMDTREC,        @03A*/ 00560000
*/*                 ISMDTPGM, AND ISMDTUNK BIT DEFINITIONS       @03A*/ 00570000
*/*    DFSMS/MVS 1.2.0 CHANGES                                   @L3A*/ 00580000
*/* $L3=COMPRESS,HDZ11B0,930616,SJPLCC: COMPRESSION SUPPORT      @L3A*/ 00590000
*/* $L4=xSAM,HDZ11C0,950208,SJPLCC: xSAM SUPPORT                 @L4A*/ 00600000
*/* $L5=LI3039,HDZ2210,120615,SVLDM: PDSE Format 2 support       @L5A*/ 00610000
*/* $04=OA44234,HDZ2210,20140116,ElmerLatorre                    @04A*/ 00620000
*/*   1. Add flag to indicate Format-2 PDSE is generations enabled.  */ 00630000
*/* $L6=ENCRYPT,HDZ2230,20160531,EZHOVA: SAM Encryption          @L6A*/ 00640000
*/*$L7=OA56622,HDZ2240,20200122,ElmerLatorre:                    @L7A*/ 00650000
*/*   1. Add Block Prefix Length field and increase its length.      */ 00660002
*/********************************************************************/ 00670000
*%/*                                                                    00680000
.*/ GOTO ISMPLS;                                                        00690000
         AIF   ('&DSECT' EQ 'YES').ISM001                               00700000
ISM      DS    0F                      IS_IT_MANAGED? PARAMETER LIST    00710000
         AGO   .ISM002                                                  00720000
.ISM001  ANOP                                                           00730000
ISM      DSECT                         IS_IT_MANAGED? PARAMETER LIST    00740000
.ISM002  ANOP                                                           00750000
ISMHDR   DS    0CL16                   PARAMETER LIST HEADER            00760000
ISMID    DS    CL8                     PARAMETER LIST ID 'ISITMGD'      00770000
ISMLEN   DS    F                       PARAMETER LIST LENGTH            00780000
ISMLVL   DS    X                       PARAMETER LIST LEVEL             00790000
         DS    CL3                     RESERVED                         00800000
ISMADDR  DS    A                       INPUT PTR TO DCB OR DEB          00810000
ISMCON   DS    X                       CONCATENATION NUMBER (INPUT)     00820000
*                                       FIRST DATA SET IS ZERO     @L1A 00830000
ISMIFLG  DS    0BL3                    INPUT FLAGS                      00840000
ISMIFLG1 DS    B                       INPUT FLAG BYTE                  00850000
ISMDEB   EQU   X'80'                   DEB ADDRESS SUPPLIED             00860000
ISMDCB   EQU   X'40'                   DCB ADDRESS SUPPLIED             00870000
ISMALL   EQU   X'20'                   CONCAT=ALL SPECIFIED        @L1A 00880000
ISMDTYPE EQU   X'10'                   DATATYPE=YES SPECIFIED      @L1A 00890000
ISMIRES1 EQU   X'0F'                   RESERVED INPUT BITS         @L1A 00900000
ISMIRES2 DS    BL2                     RESERVED INPUT BYTES        @L1C 00910000
ISMOFLG  DS    0BL4                    OUTPUT FLAGS                     00920000
ISMOFLG1 DS    B                       OUTPUT FLAG BYTE 1               00930000
ISMNMGD  EQU   X'80'                   DATA SET IS NON-MANAGED          00940000
ISMMGD   EQU   X'40'                   DATA SET IS MANAGED              00950000
ISMOFLG2 DS    B                       OUTPUT FLAG BYTE 2               00960000
ISMPDSE  EQU   X'80'                   DATA SET IS A PDSE               00970000
ISMDSUNK EQU   X'40'                   DATA SET IS UNKNOWN KIND    @L1A 00980000
ISMDSALL EQU   X'20'                   ALL DATA SETS OF SAME KIND  @L1A 00990000
ISMDSTRP EQU   X'10'                   DATA SET IS STRIPED         @L2A 01000000
ISMDCOMP EQU   X'08'                   DATA SET IS COMPRESSED FMT  @L3A 01010000
ISMOMVS  EQU   X'04'                   HFS/REMOTE FILE             @L4A 01020000
ISMMGENS EQU   X'02'                   PDSE is Generations Enabled @04A 01030000
ISMENCRP EQU   X'01'                   DATA SET IS ENCRYPTED       @L6A 01040000
ISMOFLG3 DS    B                       OUTPUT FLAG BYTE 3          @L1A 01050000
ISMDTREC EQU   X'80'                   DATATYPE-PDSE RECORD FORMAT @03A 01060000
*                                       LIBRARY, I.E. DATA MEMBERS @03A 01070000
ISMDTPGM EQU   X'40'                   DATATYPE-PDSE LOAD MOD LIB  @03A 01080000
ISMDTUNK EQU   X'20'                   DATATYPE-UNKNOWN            @03A 01090000
ISMDSNVER DS   FL1                     DATA SET FORMAT             @L5C 01100000
ISMLENV1 EQU   *-ISM                   LENGTH OF Version 1 ISM     @L7A 01110000
* END OF ISM VERSION 1                                             @L7A 01120000
         AIF   ('&VERSION' EQ '1').FINISH                          @L7A 01130000
ISMV2FLDS DS   0BL12                   Add 12 bytes to parm list   @L7A 01140003
ISMBPRFX  DS   FL1                     Block Prefix Length         @L7A 01150000
          DS   BL11                    Reserved                    @L7A 01160003
*                                                                       01180000
*  THE FOLLOWING EQUATES ARE CONSTANTS OF ISM                           01190000
*                                                                       01200000
ISMLENV2 EQU   *-ISM                   LENGTH OF Version 2 ISM     @L7A 01210000
* END OF ISM VERSION 2                                             @L7A 01230000
.FINISH  ANOP                                                      @L7A 01240000
ISMLENC  EQU   *-ISM                   LENGTH OF ISM                    01240108
ISMEND   EQU   *                       End of ISM. This labe shows      01241000
*                                      the current length of a ISM.     01242000
ISMEYECL EQU   C'ISIT'                 ISM EYECATCHER LEFT HALF         01243000
ISMEYECR EQU   C'MGD '                 ISM EYECATCHER RIGHT HALF        01244000
ISMLEVC  EQU   1                       CURRENT ISM LEVEL                01245000
         MEND                                                           01246000
*%ISMPLS:;                                                              01247000
*%IF ISM_VERSION = '' ! ISM_VERSION = '1' ! ISM_VERSION = '2' %THEN     01248010
*%DO;                                                         /* @L7A*/ 01248110
*   %IF ISM_VERSION = '' %THEN                                /* @L7A*/ 01248210
*     %ISM_VERSION = '1';                                      ] @L7A   01249010
*   %ELSE;                                                    /* @L7A*/ 01249110
*DECLARE                                                                01250000
*  1 ISM  BDY(WORD) BASED,                                      ] @l7C  01260005
*    3 ISMHDR    CHAR(16) BDY(WORD), /* PARAMETER LIST HEADER        */ 01270000
*      4 ISMID     CHAR(8),         /*  CHARACTER STRING 'ISITMGD'   */ 01280000
*      4 ISMLEN    BINARY(31),      /*  PARAMETER LIST LENGTH        */ 01290000
*      4 ISMLVL    BINARY(8),       /*  PARAMETER LIST LEVEL         */ 01300000
*      4    *      BINARY(24),      /*  RESERVED                     */ 01310000
*    3 ISMADDR   PTR(31),           /* INPUT PTR TO DCB OR DEB       */ 01320000
*    3 ISMCON    FIXED(8),          /* CONCATENATION NUMBER  -          01330000
*                                              ORIGIN IS ZERO        */ 01340000
*    3 ISMIFLG   BIT(24),           /* INPUT FLAGS                   */ 01350000
*      4 ISMFLG1   BIT(8),          /*  INPUT FLAG BYTE              */ 01360000
*        5 ISMDEB    BIT(1),        /*   DEB ADDRESS SUPPLIED        */ 01370000
*        5 ISMDCB    BIT(1),        /*   DCB ADDRESS SUPPLIED        */ 01380000
*        5 ISMALL    BIT(1),        /*   CONCAT=ALL SPECIFIED    @L1A*/ 01390000
*        5 ISMDTYPE  BIT(1),        /*   DATATYPE=YES SPECIFIED  @L1A*/ 01400000
*        5 ISMIRES1  BIT(4),        /*   RESERVED INPUT BITS, ANY       01410000
*                                        CHANGES TO ISMIRES1 MUST ALSO  01420000
*                                        CHANGE ISMIRES1_C       @L1A*/ 01430000
*      4 ISMIRES2 BIT(16),          /*  RESERVED INPUT BYTES, ANY       01440000
*                                        CHANGES TO ISMIRES2 MUST ALSO  01450000
*                                        CHANGE ISMIRES2_C       @L1A*/ 01460000
*    3 ISMOFLG   BIT(32),           /* OUTPUT FLAGS                  */ 01470000
*      4 ISMOFLG1  BIT(8),          /*  OUTPUT FLAG BYTE 1           */ 01480000
*         5 ISMNMGD   BIT(1),       /*   DATA SET IS NON-MANAGED     */ 01490000
*         5 ISMMGD    BIT(1),       /*   DATA SET IS MANAGED         */ 01500000
*         5   *       BIT(6),       /*   RESERVED                    */ 01510000
*       4 ISMOFLG2  BIT(8),         /*  OUTPUT FLAG BYTE 2           */ 01520000
*         5 ISMPDSE   BIT(1),       /*   DATA SET IS A PDSE          */ 01530000
*         5 ISMDSUNK  BIT(1),       /*   DATA SET IS UNKNOWN KIND@L1A*/ 01540000
*         5 ISMDSALL  BIT(1),       /*   ALL DATA SETS SAME KIND @L1A*/ 01550000
*         5 ISMDSTRP  BIT(1),       /*   DATA SET IS STRIPED     @L2A*/ 01560000
*         5 ISMDCOMP  BIT(1),       /*   DATA SET IS COMPRESSED FMT     01570000
*                                                                @L3A*/ 01580000
*         5 ISMOMVS   BIT(1),       /*   FILE IS AN HFS OR REMOTE       01590000
*                                        FILE ACCESSED VIA OE    @L4A*/ 01600000
*         5 ISMMGENS  BIT(1),       /*   PDSE is enabled for gens@04A*/ 01610000
*         5 ISMENCRP  BIT(1),       /*   DATA SET IS ENCRYPTED   @L6C*/ 01620000
*       4 ISMOFLG3  BIT(8),         /*  OUTPUT FLAG BYTE 3       @L1A*/ 01630000
*         5 ISMDTREC  BIT(1),       /*   DATATYPE-PDSE RECORD FORMAT    01640000
*                                        LIBRARY, I.E. DATA MEMBERS     01650000
*                                                                @L1A*/ 01660000
*         5 ISMDTPGM  BIT(1),       /*   DATATYPE-PDSE LOAD LIB  @L1A*/ 01670000
*         5 ISMDTUNK  BIT(1),       /*   DATATYPE-UNKNOWN        @L1A*/ 01680000
*         5   *       BIT(5),       /*   RESERVED                @L1A*/ 01690000
*       4  ISMDSNVER  FIXED(8),     /*   DATA SET FORMAT         @L5C*/ 01700000
*] End of ISM Version 1                                          @L7A   01710000
*%IF ISM_VERSION = '1' %THEN        /* IF VERSION 1, then done   @L7A*/ 01720000
*    %GOTO ISMEND;                                              ]@L7A   01730000
*    3 ISMV2FLDS BIT(96) BDY(WORD), /*   V2  Fields              @L7A*/ 01740003
*       4 ISMBPRFX    FIXED(8),     /*   Block Prefix Length     @L7A*/ 01760001
*       4 *           BIT(88),      /*   Reserved                @L7A*/ 01770003
*] End of ISM Version 2                                          @L7A   01790000
*%ISMEND:;                                                              01800000
* 3 ISMEND         CHAR(0);/* Current end of ISM        @L7A*/          01801000
*%END;                              /* Version = 1 or 2          @L7A*/ 01802010
*                                                                       01802106
*   /*****************************************************************/ 01803000
*   /* THE FOLLOWING ARE CONSTANT DECLARATIONS FOR ISM               */ 01804000
*   /*****************************************************************/ 01805000
*                                                                       01806000
* DECLARE                                                               01807000
*   ISMEYEC CHAR(8) CONSTANT('ISITMGD '),  /* ISM EYECATCHER         */ 01808000
*   ISMLENC FIXED(32) CONSTANT(LENGTH(ISM)),                            01809000
*   ISMLENV1 FIXED(32) CONSTANT(28),       /* V1 Length of ISM   @L7C*/ 01810005
*   ISMLENV2 FIXED(32) CONSTANT(40),       /* V2 Length of ISM   @L7A*/ 01820001
*                                     /* LENGTH OF ISM               */ 01830000
*   ISMLEVC FIXED(8) CONSTANT(1),     /* CURRENT ISM LEVEL           */ 01840000
*   ISMIRES1_C BIT(4) CONSTANT('0000'B), /* REQUIRED BIT SETTINGS FOR   01850000
*                                        ISMIRES1                @L1A*/ 01860000
*   ISMIRES2_C BIT(16) CONSTANT('0000'X); /* REQUIRED BIT SETTINGS FOR  01870000
*                                        ISMIRES2                @L1A*/ 01880005
