*%GOTO CDATAPLX;                                                        00050000
*/*                                                                     00100000
         MACRO                                                          10692200
&LABEL   IGWCDATA  &MF=I,&RETCODE=,&RSNCODE=,&SERVICE=,                X10711900
               &SCOPE=,&CONTOKEN=,&ERRDATA=,&DATATYPE=,                X10731600
               &UPDATE=,&STORREQD=,&REQTYPE=,&DSMSKBLP=,               X10751300
               &RETDALOC=,&RETDASIZ=,&CFLSBLCK=,&SCMSKBLP=         @03C 10784980
.*--------------------------------------------------------------------  10790700
.* MAC(IGWCDATA) COMP(DF122) :                                          10817600
.*                                                                      10844500
.* MACRO NAME: IGWCDATA                                                 10865300
.*                                                                      10886100
.* DESCRIPTION: PSPI INTERFACE TO OBTAIN VSAM RLS STATISTICS            10936100
.* STATUS: z/OS 1.13 DFSMS                                              10986100
.*                                                                      11772500
.*  PROPRIETARY V3 STATEMENT                                            11822500
.*  LICENSED MATERIALS - PROPERTY OF IBM                                11872500
.*  "RESTRICTED MATERIALS OF IBM"                                       11922500
.*  5650-ZOS                                                            11972500
.*  COPYRIGHT IBM CORP. 1995, 2015                                      12022500
.*  END PROPRIETARY V3 STATEMENT                                        12072500
.*                                                                      12122500
.* FUNCTION- INNVOCATION OF THE IGWCDATA FUNCTION - ASSEMBLER VERSION   12172500
.*                                                                      12222500
.* NOTES - THIS MACRO REQUIRES THE HIGH LEVEL ASSEMBLER.                12272500
.*         IGWMCIDB DSECT=YES  IS REQUIRED FOR THE                      12322500
.*         EXPANSION                                                    12372500
.*                                                                      12422500
.* CHANGE ACTIVITY:                                                     12472500
.*                                                                      12522500
.* $00=OW39785,HDZ11E0,000204,SJPLKMK: IGWCDATA INTERFACE FOR ASM       12572500
.* $01=OW44252,HDZ11F0,000428,SJPLMKD: Assembler fixes RMF              12622500
.* $L1=64BIT,HDZ1D10,20101116,SVLWER: 64 bit message               @L1A 12672500
.* $02=OA42288,HDZ1D10,05162013,RPRIETO: Add support for service   @02A 12972500
.*                                       OBTCFLSD                  @02A 13272500
.* $03=OA42798,HDZ1D10,06/10/2013,bpooja: Add support for          @03A 13372500
.*                                      storage class mask         @03A 13472500
.*-------------------------------------------------------------------   13739200
         LCLC  &LAB1,&LAB2,&LAB3,&LAB4,&LAB5,&LAB6                      13789200
         LCLC  &LABA,&LABB,&LABC,&LABD,&LABE,&LABF                      13839200
         LCLA  &I                                                       13889200
         LCLB  &SMF15,&SMF16,&SMF17,&SMF18,&SMF19                       13939200
         LCLB  &LMF15,&LMF16,&LMF17,&LMF18,&LMF19                       13989200
&LAB1    SETC  'CDATA'.'&SYSNDX'.'A'                                    14039200
&LAB2    SETC  'CDATA'.'&SYSNDX'.'B'                                    14089200
&LAB3    SETC  'CDATA'.'&SYSNDX'.'C'                                    14139200
&LAB4    SETC  'CDATA'.'&SYSNDX'.'D'                                    14189200
&LAB5    SETC  'CDATA'.'&SYSNDX'.'E'                                    14239200
&LAB6    SETC  'CDATA'.'&SYSNDX'.'F'                                    14289200
&LABA    SETC  'CDATA'.'&SYSNDX'.'G'                                    14339200
&LABB    SETC  'CDATA'.'&SYSNDX'.'H'                                    14389200
&LABC    SETC  'CDATA'.'&SYSNDX'.'I'                                    14439200
&LABD    SETC  'CDATA'.'&SYSNDX'.'J'                                    14489200
&LABE    SETC  'CDATA'.'&SYSNDX'.'K'                                    14539200
&LABF    SETC  'CDATA'.'&SYSNDX'.'L'                                    14589200
         GBLC  &SYSAM64    AMODE64=YES set by SYSSTATE macro       @L1A 14597500
         GBLC  &SYSASCE    ASCENV=AR or ANY set by SYSSTATE macro  @L1A 14605800
         SYSSTATE TEST     Test how macros are to expand           @L1A 14614100
         AIF   ('&SYSAM64' EQ 'YES').E0    GO IF AMODE64=YES       @L1A 14622400
         AIF   (('&SYSASCE' NE '') AND ('&SYSASCE' NE 'P')).E1     @L1A 14630700
         AIF   ('&MF' NE 'L').CA100                                     14639200
         AIF   ('&LABEL' EQ '').CA050                                   14689200
&LABEL   DS    0D                                                       14739200
         AGO   .CA075                                                   14789200
.CA050   ANOP                                                           14839200
         DS    0D                                                       14889200
.CA075   ANOP                                                           14939200
         DC    (CIDB_LENGTHC)X'00'                                      14989200
         MEXIT                                                          15039200
.*                                                                      23683500
.* DEAL WITH MF=I,E                                                     23733500
.*                                                                      27284500
.CA100   ANOP                                                           27334500
         AIF   ('&LABEL' EQ '').CA200                                   27384500
&LABEL   DS    0H                                                       27434500
.CA200   ANOP                                                           27484500
         AIF   ('&MF' NE 'I').CA820                                     27534500
         B     &LAB2                                                    27584500
&LAB1    DS    0D                                                       27634500
         DC    (CIDB_LENGTHC)X'00'                                      27684500
&LAB2    DS    0H                                                       27734500
         LA    15,&LAB1                                                 27784500
         AGO   .CA860                                                   27834500
.CA820   ANOP                                                           27884500
         AIF   ('&MF(1)' EQ 'E').CA840                                  27934500
         MNOTE 8,'IGWCDATA - INVALID MF= SPECIFICATION'                 27984500
         MEXIT                                                          28034500
.CA840   ANOP                                                           28084500
         AIF   ('&MF(2)'(1,1) EQ '(').CA850                             28134500
         LA    15,&MF(2)                                                28184500
         AGO   .CA860                                                   28234500
.CA850   ANOP                                                           28284500
         LR    15,&MF(2)                                                28334500
.*                                                                      51161900
.* CLEAR OUT SECTIONS 1,2,3                                             51211900
.*                                                                      51854400
.CA860   ANOP                                                           51904400
         PUSH  USING                                                    51954400
         USING MMFCIDBTYPE,15                                           52004400
         XC    CIDB_SECTION_ONE,CIDB_SECTION_ONE                        52054400
         XC    CIDB_SECTION_TWO,CIDB_SECTION_TWO                        52104400
         XC    CIDB_SECTION_THREE,CIDB_SECTION_THREE                    52154400
         MVC   CIDB_EYECATCHER(8),=CL8'IGWMCIDB'                        52204400
         LA    14,CIDB_LENGTHC                                          52254400
         ST    14,CIDB_LENGTH                                           52304400
         LA    14,CIDB_LEVELC                                           52354400
         STC   14,CIDB_VERSION                                          52404400
.*                                                                      52491500
.* MAKE SURE RETCODE, RSNCODE SPECIFIED                                 52541500
.*                                                                      52768500
.CA1000  ANOP                                                           52783600
         AIF   ('&RSNCODE' NE '').CA1010                                52798700
         MNOTE 8,'IGWCDATA - RSNCODE= IS REQUIRED'                      52813800
         POP   USING                                                    52828900
         MEXIT                                                          52844000
.CA1010  ANOP                                                           52859100
         AIF   ('&RETCODE' NE '').CA1015                                52874200
         MNOTE 8,'IGWCDATA - RETCODE= IS REQUIRED'                      52889300
         POP   USING                                                    52904400
         MEXIT                                                          52919500
.*                                                                      52934700
.* HANDLE SERVICE                                                       52984700
.*                                                                      53100900
.CA1015  ANOP                                                           53150900
         AIF   ('&SERVICE' NE '').CA1020                                53200900
         MNOTE 8,'IGWCDATA - SERVICE= IS REQUIRED'                      53250900
         POP   USING                                                    53300900
         MEXIT                                                          53350900
.*                                                                      54596700
.* CLEAR FLAG BYTE                                                      54646700
.*                                                                      54818300
.CA1020  ANOP                                                           54826800
         MVI   CIDB_FUNCTIONS,0                                         54835300
         AIF ('&SERVICE' EQ 'CONNECT').CA2000                           54843800
         AIF ('&SERVICE' EQ 'CONNECTU').CA2100                          54852300
         AIF ('&SERVICE' EQ 'OBTDATA').CA2200                           54860800
         AIF ('&SERVICE' EQ 'OBTDSMSK').CA2300                          54869300
         AIF ('&SERVICE' EQ 'DISCONN').CA2400                           54877800
         AIF ('&SERVICE' EQ 'OBTCFLSD').CA2500                     @02A 54881800
          AIF ('&SERVICE' EQ 'OBTSCMSK').CA2600                    @03A 54883800
         MNOTE 8,'IGWCDATA - INVALID VALUE SPECIFIED FOR SERVICE='      54886300
         POP   USING                                                    54894800
         MEXIT                                                          54903300
.CA2000  ANOP                                                           54911800
         OI    CIDB_FUNCTIONS,CIDB_CONNECT                              54920300
         AGO   .CA3000                                                  54928800
.CA2100  ANOP                                                           54937300
         OI    CIDB_FUNCTIONS,CIDB_CONNECT_UPDT                         54945800
         AGO   .CA3000                                                  54954300
.CA2200  ANOP                                                           54962800
         OI    CIDB_FUNCTIONS,CIDB_OBTAIN_DATA                          54971300
         AGO   .CA3000                                                  54979800
.CA2300  ANOP                                                           54988300
         OI    CIDB_FUNCTIONS,CIDB_OBTAIN_DSMASK                        54996800
         AGO   .CA3000                                                  55005300
.CA2400  ANOP                                                           55013800
         OI    CIDB_FUNCTIONS,CIDB_DISCONNECT                           55022300
         AGO   .CA3000                                                  55030800
.CA2500  ANOP                                                      @02A 55032800
         OI    CIDB_FUNCTIONS,CIDB_OBTAIN_CFLS_DATA                @02A 55034800
         AGO   .CA3000                                             @02A 55036800
.CA2600  ANOP                                                      @03A 55037500
         OI    CIDB_FUNCTIONS1,CIDB_OBTAIN_SCMASK                  @03A 55038200
         AGO   .CA3000                                             @03A 55038900
.*                                                                      55039900
.* HANDLE SCOPE - flag byte has been cleared                            55089900
.*                                                                      55261500
.CA3000  ANOP                                                           55273100
         AIF   ('&SERVICE' EQ 'CONNECT').CA3050                         55284700
         AIF   ('&SCOPE' EQ '').CA3300                                  55296300
         MNOTE 8,'IGWCDATA - SCOPE= INVALID FOR SERVICE=&SERVICE'       55307900
         POP   USING                                                    55319500
         MEXIT                                                          55331100
.CA3050  ANOP                                                           55342700
         AIF   ('&SCOPE' EQ '').CA3200                                  55354300
         AIF   ('&SCOPE' EQ 'LOCAL').CA3100                             55365900
         AIF   ('&SCOPE' EQ 'GLOBAL').CA3200                            55377500
         MNOTE 8,'IGWCDATA - SCOPE=&SCOPE INVALID SPECIFICATION'        55389100
         POP   USING                                                    55400700
         MEXIT                                                          55412300
.CA3100  ANOP                                                           55423900
         OI    CIDB_FUNCTIONS,CIDB_LOCAL                                55435500
         AGO   .CA3300                                                  55447100
.CA3200  ANOP                                                           55458700
         OI    CIDB_FUNCTIONS,CIDB_GLOBAL                               55470300
.*                                                                      55483100
.* HANDLE CONTOKEN                                                      55533100
.*                                                                      55898600
.CA3300  ANOP                                                           55910900
         AIF   ('&CONTOKEN' NE '').CA3350                          @02C 55927190
         AIF   ('&SERVICE' EQ 'OBTCFLSD').CA3500                   @02A 55931180
         MNOTE 8,'IGWCDATA - CONTOKEN= REQUIRED'                        55935500
         POP   USING                                                    55947800
         MEXIT                                                          55960100
.CA3350  ANOP                                                      @02A 55962100
         AIF   ('&SERVICE' NE 'OBTCFLSD').CA3400                   @02A 55964100
         MNOTE 8,'IGWCDATA - CONTOKEN= NOT REQUIRED'               @02A 55966100
         POP   USING                                               @02A 55968100
         MEXIT                                                     @02A 55970100
.CA3400  ANOP                                                           55972400
         AIF   ('&SERVICE' NE 'CONNECT').CA3410                         55984700
         XC    CIDB_CONNECT_TOKEN,CIDB_CONNECT_TOKEN                    55997000
         AGO   .CA3500                                                  56009300
.CA3410  ANOP                                                           56021600
         AIF   ('&CONTOKEN'(1,1) EQ '(').CA3420                         56033900
         LA    1,&CONTOKEN                                              56046200
         AGO   .CA3430                                                  56058500
.CA3420  ANOP                                                           56070800
         LR    1,&CONTOKEN(1)                                           56083100
.CA3430  ANOP                                                           56095400
         MVC   CIDB_CONNECT_TOKEN,0(1)                                  56107700
.*                                                                      56120200
.* HANDLE DATATYPES, CLEAR FLAG BYTE                                    56170200
.*                                                                      56341800
.CA3500  ANOP                                                           56347000
         MVI   CIDB_DATATYPES,0                                         56352200
         AIF   ('&DATATYPE' NE '').CA3520                               56357400
         AIF   ('&SERVICE' EQ 'CONNECT').CA3515                         56362600
         AIF   ('&SERVICE' EQ 'CONNECTU').CA3515                        56367800
         AIF   ('&SERVICE' EQ 'OBTSCMSK').CA3940                   @03A 56369800
         AGO   .CA3800                                                  56373000
.CA3515  ANOP                                                           56378200
         MNOTE 8,'IGWCDATA - DATATYPE= REQUIRED FOR SERVICE=&SERVICE'   56383400
         POP   USING                                                    56388600
         MEXIT                                                          56393800
.CA3520  ANOP                                                           56399000
         AIF   ('&SERVICE' EQ 'CONNECT').CA3600                         56404200
         AIF   ('&SERVICE' EQ 'CONNECTU').CA3600                        56409400
         MNOTE 8,'IGWCDATA - DATATYPE= INVALID WITH SERVICE=&SERVICE'   56414600
         POP   USING                                                    56419800
         MEXIT                                                          56425000
.CA3600  ANOP                                                           56430200
&I       SETA  0                                                        56435400
.CA3610  ANOP                                                           56440600
&I       SETA  &I+1                                                     56445800
.CA3620  ANOP                                                           56451000
         AIF   (&I GT N'&DATATYPE).CA3700                               56456200
&SMF15   SETB  ('&DATATYPE(&I)' EQ 'SMF42ST15' OR &SMF15)               56461400
&LMF15   SETB  ('&DATATYPE(&I)' EQ 'SMF42ST15')                         56466600
&SMF16   SETB  ('&DATATYPE(&I)' EQ 'SMF42ST16' OR &SMF16)               56471800
&LMF16   SETB  ('&DATATYPE(&I)' EQ 'SMF42ST16')                         56477000
&SMF17   SETB  ('&DATATYPE(&I)' EQ 'SMF42ST17' OR &SMF17)               56482200
&LMF17   SETB  ('&DATATYPE(&I)' EQ 'SMF42ST17')                         56487400
&SMF18   SETB  ('&DATATYPE(&I)' EQ 'SMF42ST18' OR &SMF18)               56492600
&LMF18   SETB  ('&DATATYPE(&I)' EQ 'SMF42ST18')                         56497800
&SMF19   SETB  ('&DATATYPE(&I)' EQ 'SMF42ST19' OR &SMF19)               56503000
&LMF19   SETB  ('&DATATYPE(&I)' EQ 'SMF42ST19')                         56508200
         AIF   ((NOT &LMF15) AND (NOT &LMF16) AND (NOT &LMF17) AND (NOTX56513400
                &LMF18) AND (NOT &LMF19)).CA3690                        56518600
         AGO   .CA3610                                                  56523800
.CA3690  ANOP                                                           56529000
         MNOTE 8,'IGWCDATA - DATATYPE=&DATATYPE(&I) INVALID'            56534200
         POP   USING                                                    56539400
         MEXIT                                                          56544600
.CA3700  ANOP                                                           56549800
         OI    CIDB_DATATYPES,B'&SMF15&SMF16&SMF17&SMF18.00&SMF19.0'    56555000
.*                                                                      56563400
.* HANDLE DSMSKBLP                                                      56613400
.*                                                                      56785000
.CA3800  ANOP                                                           56791500
         AIF   ('&SERVICE' NE 'OBTDSMSK').CA3820                        56798000
         AIF   ('&DSMSKBLP' NE '').CA3900                               56804500
         MNOTE 8,'IGWCDATA - DSMSKBLP= REQUIRED WITH SERVICE=OBTDSMSK'  56811000
         POP   USING                                                    56817500
         MEXIT                                                          56824000
.CA3820  ANOP                                                           56830500
         AIF   ('&SERVICE' EQ 'CONNECT').CA3830                         56837000
         AIF   ('&SERVICE' EQ 'CONNECTU').CA3830                        56843500
         AIF   ('&DSMSKBLP' EQ '').CA4000                               56850000
         MNOTE 8,'IGWCDATA - DSMSKBLP= INVALID WITH SERVICE=&SERVICE'   56856500
         POP   USING                                                    56863000
         MEXIT                                                          56869500
.CA3830  ANOP                                                           56876000
         AIF   (&SMF16).CA3850                                          56882500
         AIF   ('&DSMSKBLP' EQ '').CA4000                               56889000
         MNOTE 4,'IGWCDATA - DSMSKBLP= IGNORED, NO SMF42ST16 SPECIFICATX56895500
               ION'                                                     56902000
         AGO   .CA4000                                                  56908500
.CA3850  ANOP                                                           56915000
         AIF   ('&DSMSKBLP' NE '').CA3900                               56921500
.* Either SC or DS mask should be on for SUBTYPE16      @03A            56928990
         AIF   ('&SCMSKBLP' NE '').CA3940                               56929980
         MNOTE 8,'IGWCDATA - DSMSKBLP OR SCMSKBLP REQUIRED FOR DATATYPEX56930970
               =SMF42ST16'                               @03C           56931960
         POP   USING                                                    56934500
         MEXIT                                                          56941000
.CA3900  ANOP                                                           56947500
.CA3910  ANOP                                                           56954000
         AIF   ('&DSMSKBLP'(1,1) EQ '(').CA3920                         56960500
         LA    1,&DSMSKBLP                                              56967000
         AGO   .CA3930                                                  56973500
.CA3920  ANOP                                                           56980000
         LR    1,&DSMSKBLP(1)                                           56986500
.CA3930  ANOP                                                           56993000
         ST    1,CIDB_DSMSKBL@                                          56999500
         AGO   .CA4000                                  @03A            56999600
.*                                                      @03A            56999700
.* START HANDLE SCMSKBLP                                @03A            56999800
.*                                                      @03A            56999900
.CA3940  ANOP                                                           57000000
         AIF   ('&SERVICE' NE 'OBTSCMSK').CA3950                        57000100
         AIF   ('&SCMSKBLP' NE '').CA3960                               57000200
         MNOTE 8,'IGWCDATA - SCMSKBLP= REQUIRED WITH SERVICE=OBTSCMSK'  57000300
         POP   USING                                                    57000400
         MEXIT                                                          57000500
.CA3950  ANOP                                                           57000600
         AIF   ('&SERVICE' EQ 'CONNECT').CA3952                         57000700
         AIF   ('&SERVICE' EQ 'CONNECTU').CA3952                        57000800
         AIF   ('&SCMSKBLP' EQ '').CA4000                               57000900
         MNOTE 8,'IGWCDATA - SCMSKBLP= INVALID WITH SERVICE=&SERVICE'   57001000
         POP   USING                                                    57001100
         MEXIT                                                          57001200
.CA3952  ANOP                                                           57001300
         AIF   (&SMF16).CA3955                                          57001400
         AIF   ('&SCMSKBLP' EQ '').CA4000                               57001500
         MNOTE 4,'IGWCDATA - SCMSKBLP= IGNORED, NO SMF42ST16 SPECIFICATX57001600
               ION'                                                     57001700
         AGO   .CA4000                                                  57001800
.CA3955  ANOP                                                           57001900
         AIF   ('&SCMSKBLP' NE '').CA3960                               57002000
         MNOTE 8,'IGWCDATA -  DSMSKBLP OR SCMSKBLP REQUIRED FOR DATATYPX57002100
                 E=SMF42ST16'                                           57002200
         POP   USING                                                    57002300
         MEXIT                                                          57002400
.CA3960  ANOP                                                           57002500
.CA3970  ANOP                                                           57002600
         AIF   ('&SCMSKBLP'(1,1) EQ '(').CA3980                         57002700
         LA    1,&SCMSKBLP                                              57002800
         AGO   .CA3990                                                  57002900
.CA3980  ANOP                                                           57003000
         LR    1,&SCMSKBLP(1)                                           57003100
.CA3990  ANOP                                                           57003200
         ST    1,CIDB_SCMSKBL@                                          57003300
.* END SCMSKBLP                                                   @03A  57003400
.*                                                                      57006600
.* HANDLE ERRDATA                                                       57056600
.*                                                                      57422100
.CA4000  ANOP                                                           57435900
         AIF   ('&ERRDATA' NE '').CA4100                                57449700
         MNOTE 8,'IGWCDATA - ERRDATA= IS REQUIRED'                      57463500
         POP   USING                                                    57477300
         MEXIT                                                          57491100
.CA4100  ANOP                                                           57504900
.CA4110  ANOP                                                           57518700
         AIF   ('&ERRDATA'(1,1) EQ '(').CA4120                          57532500
         LA    1,&ERRDATA                                               57546300
         AGO   .CA4130                                                  57560100
.CA4120  ANOP                                                           57573900
         LR    1,&ERRDATA(1)                                            57587700
.CA4130  ANOP                                                           57601500
         ST    1,CIDB_ERRDATA@                                          57615300
         XC    0(256,1),0(1)                                            57629100
.*                                                                      57643700
.* HANDLE UPDATE                                                        57693700
.*                                                                      57865300
.CA4200  ANOP                                                           57874100
         AIF   ('&SERVICE' EQ 'CONNECTU').CA4210                        57882900
         AIF   ('&UPDATE' EQ '').CA5000                                 57891700
         MNOTE 8,'IGWCDATA - UPDATE= INVALID WITH SERVICE=&SERVICE'     57900500
         POP   USING                                                    57909300
         MEXIT                                                          57918100
.CA4210  ANOP                                                           57926900
         AIF   ('&UPDATE' NE '').CA4250                                 57935700
         MNOTE 8,'IGWCDATA - UPDATE= REQUIRED FOR SERVICE=CONNECTU'     57944500
         POP   USING                                                    57953300
         MEXIT                                                          57962100
.CA4250  ANOP                                                           57970900
         AIF   ('&UPDATE' EQ 'DELETE').CA4300                           57979700
         AIF   ('&UPDATE' EQ 'ADD').CA4270                              57988500
         MNOTE 8,'IGWCDATA - UPDATE=&UPDATE INVALID SPECIFICATION'      57997300
         POP   USING                                                    58006100
         MEXIT                                                          58014900
.CA4270  ANOP                                                           58023700
         OI    CIDB_FLAGS,CIDB_ADD                                      58032500
         NI    CIDB_FLAGS,X'FF'-CIDB_DELETE                             58041300
         AGO   .CA5000                                                  58050100
.CA4300  OI    CIDB_FLAGS,CIDB_DELETE                                   58058900
         NI    CIDB_FLAGS,X'FF'-CIDB_ADD                                58067700
.CA5000  ANOP                                                           58076500
.*                                                                      58086900
.* DO STORREQD                                                          58136900
.*                                                                      65095000
         AIF   ('&SERVICE' EQ 'CONNECTU').CA5200                        65115700
         AIF   ('&SERVICE' EQ 'OBTDATA').CA5200                         65136400
         AIF   ('&STORREQD' EQ '').CA5500                               65157100
         MNOTE 8,'IGWCDATA - STORREQD= IS INVALID FOR SERVICE=&SERVICE' 65177800
         POP   USING                                                    65198500
         MEXIT                                                          65219200
.CA5200  ANOP                                                           65239900
         AIF   ('&STORREQD' NE '').CA5500                               65260600
         MNOTE 8,'IGWCDATA - STORREQD= REQUIRED FOR SERVICE=&SERVICE'   65281300
         POP   USING                                                    65302000
         MEXIT                                                          65322700
.*                                                                      65344300
.* HANDLE REQTYPE                                                       65394300
.*                                                                      65510500
.CA5500  ANOP                                                           65517000
         AIF   ('&SERVICE' EQ 'OBTDATA').CA5600                         65523500
         AIF   ('&REQTYPE' EQ '').CA6300                                65530000
         MNOTE 8,'IGWCDATA - REQTYPE= INVALID FOR SERVICE=&SERVICE'     65536500
         POP   USING                                                    65543000
         MEXIT                                                          65549500
.CA5600  ANOP                                                           65556000
         AIF   ('&REQTYPE' EQ '').CA6100                                65562500
         AIF   ('&REQTYPE' EQ 'NEW').CA6100                             65569000
         AIF   ('&REQTYPE' EQ 'CONTINUE').CA6200                        65575500
         MNOTE 8,'IGWCDATA - REQTYPE=&REQTYPE INVALID SPECIFICATION'    65582000
         POP   USING                                                    65588500
         MEXIT                                                          65595000
.CA6100  ANOP                                                           65601500
         OI    CIDB_FLAGS,CIDB_REQUEST_NEW                              65608000
         NI    CIDB_FLAGS,X'FF'-CIDB_REQUEST_CONT                       65614500
         AGO   .CA6300                                                  65621000
.CA6200  ANOP                                                           65627500
         OI    CIDB_FLAGS,CIDB_REQUEST_CONT                             65634000
         NI    CIDB_FLAGS,X'FF'-CIDB_REQUEST_NEW                        65640500
.*                                                                      65649000
.* HANDLE RETDALOC, RETDASIZ                                            65699000
.*                                                                      65898300
.CA6300  ANOP                                                           65909600
         AIF   ('&SERVICE' EQ 'CONNECTU').CA6400                        65920900
         AIF   ('&SERVICE' EQ 'OBTDATA').CA6400                         65932200
         AIF   ('&RETDALOC' NE '').CA6350                               65943500
         AIF   ('&RETDASIZ' NE '').CA6350                               65954800
         AGO   .CA6700                                             @02C 65971090
.CA6350  ANOP                                                           65977400
         MNOTE 8,'IGWCDATA - RETDALOC/RETDASIZ= INVALID FOR SERVICE=&SEX65988700
               RVICE'                                                   66000000
         POP   USING                                                    66011300
         MEXIT                                                          66022600
.CA6400  ANOP                                                           66033900
         AIF   ('&RETDALOC' NE '').CA6500                               66045200
         MNOTE 8,'IGWCDATA - RETDALOC= REQUIRED FOR SERVICE=&SERVICE'   66056500
         POP   USING                                                    66067800
         MEXIT                                                          66079100
.CA6500  ANOP                                                           66090400
.CA6510  ANOP                                                           66101700
         AIF   ('&RETDALOC'(1,1) EQ '(').CA6520                         66113000
         LA    1,&RETDALOC                                              66124300
         AGO   .CA6530                                                  66135600
.CA6520  ANOP                                                           66146900
         LR    1,&RETDALOC(1)                                           66158200
.CA6530  ANOP                                                           66169500
         ST    1,CIDB_RTN_DATA@                                         66180800
         AIF   ('&RETDASIZ' NE '').CA6600                               66192100
         MNOTE 8,'IGWCDATA - RETDASIZ= REQUIRED FOR SERVICE=&SERVICE'   66203400
         POP   USING                                                    66214700
         MEXIT                                                          66226000
.CA6600  ANOP                                                           66237300
         AIF   ('&RETDASIZ'(1,1) EQ '(').CA6620                         66248600
         LA    1,&RETDASIZ                                              66259900
         AGO   .CA6630                                                  66271200
.CA6620  ANOP                                                           66282500
         LR    1,&RETDASIZ(1)                                           66293800
.CA6630  ANOP                                                           66305100
         L     1,0(,1)                                                  66316400
         ST    1,CIDB_RTN_DATA_SIZE                                     66327700
.*                                                                 @02A 66328300
.* HANDLE CFLSBLCK                                                 @02A 66328900
.*                                                                 @02A 66329500
.CA6700  ANOP                                                      @02A 66330100
         AIF   ('&SERVICE' EQ 'OBTCFLSD').CA6720                   @02A 66330700
         AIF   ('&CFLSBLCK' EQ '').CA7000                          @02A 66331300
         MNOTE 8,'IGWCDATA - CFLSBLCK= INVALID WITH SERVICE=&SERVICE'   66331900
         POP   USING                                               @02A 66332500
         MEXIT                                                     @02A 66333100
.CA6720  ANOP                                                      @02A 66333700
         AIF   ('&CFLSBLCK' NE '').CA6750                          @02A 66334300
         MNOTE 8,'IGWCDATA - CFLSBLCK= REQUIRED FOR SERVICE=&SERVICE'   66334900
         POP   USING                                               @02A 66335500
         MEXIT                                                     @02A 66336100
.CA6750  ANOP                                                      @02A 66336700
         AIF   ('&CFLSBLCK'(1,1) EQ '(').CA6770                    @02A 66337300
         LA    1,&CFLSBLCK                                         @02A 66337900
         AGO   .CA6790                                             @02A 66338500
.CA6770  ANOP                                                      @02A 66339100
         LR    1,&CFLSBLCK(1)                                      @02A 66339700
.CA6790  ANOP                                                      @02A 66340300
         ST    1,CIDB_CFLSBLCK@                                    @02A 66340900
.*                                                                      66341500
.* START INNVOCATION                                                    66391500
.*                                                                      66784700
.CA7000  ANOP                                                           66834700
         L     14,X'10'                                                 66884700
         L     14,X'4C0'(,14)                                           66934700
         LA    0,CDATARSN_SYSTEMDOWNLEVEL                               66984700
         CLC   X'10'(4,14),=X'01010400'                                 67034700
         BL    &LAB6                                                    67084700
         L     14,X'2C'(,14)                                            67134700
         L     14,X'E8'(,14)                                            67184700
         L     1,X'C8'(,14)                                             67234700
         LTR   1,1                                                      67284700
         BZ    &LAB6                                                    67334700
         ICM   1,15,X'1C'(1)                                            67384700
         BNZ   &LAB3                                                    67434700
         B     &LAB6                                                    67484700
&LAB3    DS    0H                                                       67534700
         LA    0,CDATARSN_SERVERNOTAVAILABLE                            67584700
         L     1,X'10'(,14)                                             67634700
         LTR   1,1                                                      67684700
         BZ    &LAB6                                                    67734700
         TM    X'18'(14),X'80'                                          67784700
         BZ    &LAB6                                                    67834700
         ICM   14,15,X'C'(1)                                            67884700
         BZ    &LAB6                                                    67934700
         LA    0,6                                                      67984700
         LR    1,15                                                     68034700
         PC    0(14)                                                    68084700
         DROP  15                                                       68088200
         USING MMFCIDBTYPE,1                                            68091700
         AIF   ('&MF' NE 'I').CB820                                     68095200
         LA    1,&LAB1                                                  68098700
         AGO   .CB860                                                   68102200
.CB820   ANOP                                                           68105700
.CB840   ANOP                                                           68109200
         AIF   ('&MF(2)'(1,1) EQ '(').CB850                             68112700
         LA    1,&MF(2)                                                 68116200
         AGO   .CB860                                                   68119700
.CB850   ANOP                                                           68123200
         LR    1,&MF(2)                                                 68126700
.CB860   ANOP                                                           68130200
         B     &LABA                                                    68134700
&LAB6    DS    0H                                                       68141800
         AIF   ('&MF' NE 'I').CC820                                     68148900
         LA    1,&LAB1                                                  68156000
         AGO   .CC860                                                   68163100
.CC820   ANOP                                                           68170200
.CC840   ANOP                                                           68177300
         AIF   ('&MF(2)'(1,1) EQ '(').CC850                             68184400
         LA    1,&MF(2)                                                 68191500
         AGO   .CC860                                                   68198600
.CC850   ANOP                                                           68205700
         LR    1,&MF(2)                                                 68212800
.CC860   ANOP                                                           68219900
         LA    15,CDATARC_ENVR                                          68227000
         B     &LABE                                                    68234700
&LABA    DS    0H                                                       68284700
         CL    0,=X'0000EE03'                                           68334700
         BNE   &LABB                                                    68384700
         LA    0,CDATARSN_INVALIDMODE                                   68434700
         LA    15,CDATARC_ENVR                                          68484700
         B     &LABE                                                    68534700
&LABB    DS    0H                                                       68584700
         CL    0,=X'0000EE02'                                           68634700
         BNE   &LABC                                                    68684700
         LA    0,CDATARSN_ABENDOTHER                                    68734700
         LA    15,CDATARC_ENVR                                          68784700
         B     &LABE                                                    68834700
&LABC    DS    0H                                                       68884700
         CL    0,=X'0000EE01'                                           68934700
         BNE   &LABD                                                    68984700
         LA    0,CDATARSN_SERVERNOTAVAILABLE                            69034700
         LA    15,CDATARC_ENVR                                          69084700
         B     &LABE                                                    69134700
&LABD    DS    0H                                                       69184700
&LABE    DS    0H                                                       69334700
.*                                                                      98861300
.* RETCODE/RSNCODE COPY BACK                                            98911300
.*                                                                      98999800
.CA7200  ANOP                                                           99001600
         AIF   ('&RETCODE'(1,1) EQ '(').CA7220                          99003400
         LA    1,&RETCODE                                               99005200
         AGO   .CA7230                                                  99007000
.CA7220  ANOP                                                           99008800
         LR    1,&RETCODE(1)                                            99010600
.CA7230  ANOP                                                           99012400
         ST    15,0(,1)                                                 99014200
         LR    14,15                                                    99016000
         AIF   ('&MF(1)' EQ 'E').CA7250                                 99017800
         LA    15,&LAB1                                                 99019600
         AGO   .CA7400                                                  99021400
.CA7250  ANOP                                                           99023200
         AIF   ('&MF(2)'(1,1) EQ '(').CA7350                            99025000
         LA    15,&MF(2)                                                99026800
         AGO   .CA7400                                                  99028600
.CA7350  ANOP                                                           99030400
         LR    15,&MF(2)                                                99032200
.CA7400  ANOP                                                           99034000
         DROP  1                                                        99034600
         USING MMFCIDBTYPE,15                                           99035200
         ST    14,CIDB_RETURNCODE                                       99035800
.CA7500  ANOP                                                           99037600
         AIF   ('&RSNCODE'(1,1) EQ '(').CA7520                          99039400
         LA    1,&RSNCODE                                               99041200
         AGO   .CA7530                                                  99043000
.CA7520  ANOP                                                           99044800
         LR    1,&RSNCODE(1)                                            99046600
.CA7530  ANOP                                                           99048400
         ST    0,0(,1)                                                  99050200
         ST    0,CIDB_REASONCODE                                        99052000
.*                                                                      99055200
.* HANDLE CONTOKEN                                                      99096700
.*                                                                      99138300
         AIF   ('&SERVICE' EQ 'OBTCFLSD').CA8200                   @02A 99141300
.CA8000  ANOP                                                           99145400
         AIF   ('&CONTOKEN'(1,1) EQ '(').CA8020                         99152500
         LA    1,&CONTOKEN                                              99159600
         AGO   .CA8030                                                  99166700
.CA8020  ANOP                                                           99173800
         LR    1,&CONTOKEN(1)                                           99180900
.CA8030  ANOP                                                           99188000
         AIF   ('&SERVICE' EQ 'DISCONN').CA8100                         99195100
         MVC   0(L'CIDB_CONNECT_TOKEN,1),CIDB_CONNECT_TOKEN             99202200
         AGO   .CA8200                                                  99209300
.CA8100  ANOP                                                           99216400
         XC    0(L'CIDB_CONNECT_TOKEN,1),0(1)                           99223500
.CA8200  ANOP                                                           99230600
.*                                                                      99237700
.* HANDLE STORREQD                                                      99244800
.*                                                                      99251900
         AIF   ('&SERVICE' EQ 'OBTDATA').CA8300                         99259000
         AIF   ('&SERVICE' EQ 'CONNECTU').CA8300                        99266100
         AGO   .CA9900                                                  99273200
.CA8300  ANOP                                                           99280300
.CA8310  ANOP                                                           99287400
         AIF   ('&STORREQD'(1,1) EQ '(').CA8320                         99294500
         LA    1,&STORREQD                                              99301600
         AGO   .CA8330                                                  99308700
.CA8320  ANOP                                                           99315800
         LR    1,&STORREQD(1)                                           99322900
.CA8330  ANOP                                                           99330000
         L     14,CIDB_STORAGE_REQD                                     99337100
         ST    14,0(,1)                                                 99344200
.*                                                                      99351300
.* POP USING AND GET OUT                                                99358400
.*                                                                      99365500
.CA9900  ANOP                                                           99372600
         L     15,CIDB_RETURNCODE                                       99374900
         DROP  15                                                       99377200
         POP   USING                                                    99379700
         MEXIT                                                     @L1A 99381000
.E0      IGGERMAC 203,IGWCDATA THE IGWCDATA MACRO DOES NOT SUPPORT @L1A 99382300
         MEXIT                   SYSSTATE AMODE64=YES              @L1A 99383600
.E1      IGGERMAC 204,IGWCDATA THE IGWCDATA MACRO DOES NOT SUPPORT @L1A 99384900
         MEND                    SYSSTATE ASCENV=AR OR ANY         @L1A 99386200
*     END OF ASM SECTION */                                             99387900
*%CDATAPLX:;                                                            99388200
*/********************************************************************/ 99388500
*/* $MAC(IGWCDATA) COMP(DF122):                                      */ 99388800
*/*                                                                  */ 99389100
*/* MACRO NAME: IGWCDATA                                             */ 99389400
*/*                                                                  */ 99389700
*/* DESCRIPTION: INTERFACE TO OBTAIN VSAM RLS STATISTICS             */ 99390700
*/*                                                                  */ 99391800
*/* STATUS: z/OS 1.13 DFSMS                                          */ 99392100
*/*                                                                  */ 99392400
*/* FUNCTION: Invocation of the IGWCDATA function (PL/X)             */ 99393700
*/*                                                                  */ 99395100
*/* NOTES:                                                           */ 99395400
*/*                                                                  */ 99395700
*/*    Include IGWMCIDB is needed for the expansion. Include         */ 99396000
*/*    IGWMDSMB if this capability is used. Invoke ?Epilog at the    */ 99396300
*/*    end of the module.                                            */ 99396600
*/*                                                                  */ 99396900
*/* CHANGE ACTIVITY:                                                 */ 99397200
*/*                                                                  */ 99397500
*/* $L0=VSAMRLS,HDZ11C0,950725,SJPLDCO: Original version             */ 99397800
*/* $L1=OW39875,HDZ11E0,990615,SJPLDLM: Add rls mmf cdata support@01A*/ 99398100
*/* $L2=64BIT,HDZ1D10,20101105,SJPLWER: 64-bit messages          @L2A*/ 99398200
*/* $02=OA42288,HDZ1D10,05162013,RPRIETO:Add support for service @02A*/ 99398260
*/*                                      OBTCFLSD                @02A*/ 99398320
*/********************************************************************/ 99398400
*%IGWCDATA: MACRO                                                       99398700
*  /* KEYWORDS DEFINED HERE*/                                           99399000
*  KEYS(MF,                                                             99399300
*       RETCODE,                                                        99399600
*       RSNCODE,                                                        99399900
*       SERVICE,                                                        99400200
*       SCOPE,                                                          99400500
*       CONTOKEN,                                                       99400800
*       ERRDATA,                                                        99401100
*       DATATYPE,                                                       99401400
*       UPDATE,                                                         99401700
*       STORREQD,                                                       99402000
*       REQTYPE,                                                        99402300
*       DSMSKBLP,                                                       99402600
*       SCMSKBLP,                                                ]@03A  99402700
*       ACBADDR,                                                        99402900
*       RETDALOC,                                                       99403200
*       RETDASIZ,                                                ] @02C 99403590
*       CFLSBLCK);                                               ] @02A 99403680
*/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */99403800
*/* GLOBAL MACRO VARIABLES.                                           */99404100
*/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */99404400
*DCL EMBEDDED_INCLUDE CHAR EXT;  /* INDICATE SOMETHING INCLUDED       */99404700
*]                                                                      99405000
*]                                                                      99405300
*]  CHANGES REQUIRED FOR VSAM PC                                        99405600
*]                                                                      99405900
*]                                                                      99406200
*]  END CHANGES REQUIRED FOR VSAM PC                                    99406500
*]                                                                      99406800
*/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */99407100
*/* LOCAL MACRO VARIABLES.                                            */99407400
*/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */99407700
*DCL DEFAULTS        CHAR  INT;  /*YES=>SET ALL FIELDS TO THEIR       */99408000
*                                /* DEFAULT VALUES (IF THEY HAVE ONE) */99408300
*DCL FIELD_VALUE     CHAR  INT;  /*WORK VAR, TO ANSWER VALUES FOR PLAS*/99408600
*DCL FPL_BASE_NAME   CHAR  INT;  /*SET TO 4 CHAR NAME OF FPL          */99408900
*DCL FPL_PREFIX      CHAR  INT;  /*PREFIX OF ALL FPL FIELD NAMES      */99409200
*DCL FPL_NAME        CHAR  INT;  /*SET TO NAME OF EITHER FPL OR @FPL  */99409500
*DCL FPL_PTR         CHAR  INT;  /*BASING EXPRESSION FOR THE FPL      */99409800
*DCL FPL_PTR_NAME    CHAR  INT;  /*PLAS VARIABLE THAT POINTS TO FPL   */99410100
*DCL FPL_STOR_NAME   CHAR  INT;  /*NAME OF THE STORAGE THE FPL IS IN  */99410400
*DCL DSMB_PTR_NAME   CHAR  INT;  /*SET TO NAME OF DATASET MASK BLOCK  */99410700
*DCL DSMB_PTR        CHAR  INT;  /*BASING EXPRESSION FOR THE DSMB     */99411000
*DCL DSMB_PREFIX     CHAR  INT;  /*PREFIX OF ALL DSMB FIELD NAMES     */99411300
*DCL SCMB_PTR_NAME   CHAR  INT;  /*SET TO NAME OF STORAGE MASK @03A   */99411370
*DCL SCMB_PTR        CHAR  INT;  /*BASING EXPRESSION FOR THE SCMB @03A*/99411440
*DCL SCMB_PREFIX     CHAR  INT;  /*PREFIX OF ALL SCMB FIELD NAMES @03A*/99411510
*DCL MAC_RETCODE     FIXED INT;  /*GLOBAL RETURN CODE FROM MACRO      */99411600
*DCL MF1             CHAR  INT;  /*=MF(1) IF MF KEYWORD SPECIFIED     */99411900
*                                /* ='S' OTHERWISE                    */99412200
*DCL NULL            CHAR  INT;  /*SET TO ''                          */99412500
*DCL kenmf           char  int; /*@kmk*/                                99412800
*DCL REQUIRED        CHAR  INT;  /*YES=>FORCE PRESENCE OF ALL REQ"D   */99413100
*                                /* KEYWORDS AND SET ALL DEFAULTS     */99413400
*DCL REQ_MSG         CHAR  INT;  /*MSG TO SAY "KEYWORD REQUIRED"      */99413700
*DCL NOTREQ_MSG      CHAR  INT;  /*MSG TO SAY "KEYWORD NOT REQUIRED" */ 99413800
*                                                              ] @02A*/ 99413900
*DCL NOT_ALLOWED_MSG CHAR  INT;  /*MSG TO SAY "KEYWORD REQUIRED"      */99414000
*DCL TEMP_TEXT       CHAR  INT;  /*WORK VAR                           */99414300
*DCL TEMP_NUM        FIXED INT;  /*WORK VAR                           */99414600
*DCL TT              CHAR  INT;  /*WORK VAR                           */99414900
*Dcl  (SYSAM64,                  /*AMODE64 set by SYSSTATE        @L2A*/99415000
      SYSASCE) external char;    /*State is ANY, P or AR          @L2A*/99415100
*                                                                       99415200
*/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */99415500
*/* MACRO VARIABLES USED TO TEST FOR ILLEGAL KEYWORDS.                */99415800
*/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */99416100
*DCL M_I              FIXED INT;   /*LOOP VARIABLE                    */99416400
*DCL M_KEYCHAR        CHAR  INT;   /*SINGLE CHARACTER FROM MACKEYS    */99416700
*DCL M_KEYNAME        CHAR  INT;   /*KEYNAME EXTRACTED FROM MACKEYS   */99417000
*DCL M_KEYNAMES       CHAR  INT;   /*LIST OF ALL VALID KEYWORDS -     */99417300
*                                  /*THIS VARIABLE MUST BE KEPT IN    */99417600
*                                  /*SYNC WITH THE MACRO STATEMENT    */99417900
*DCL M_PAREN_DEPTH    FIXED INT;   /*PAREN NESTING LEVEL IN MACKEYS   */99418200
*                                                                       99418500
*M_KEYNAMES = ' MF                                  '!!                 99418800
*             ' RETCODE                             '!!                 99419100
*             ' RSNCODE                             '!!                 99419400
*             ' SERVICE                             '!!                 99419700
*             ' SCOPE                               '!!                 99420000
*             ' CONTOKEN                            '!!                 99420300
*             ' ERRDATA                             '!!                 99420600
*             ' DATATYPE                            '!!                 99420900
*             ' UPDATE                              '!!                 99421200
*             ' STORREQD                            '!!                 99421500
*             ' REQTYPE                             '!!                 99421800
*             ' DSMSKBLP                            '!!                 99422100
*             ' SCMSKBLP                            '!!          ] @03A 99422200
*             ' ACBADDR                             '!!                 99422400
*             ' RETDALOC                            '!!                 99422700
*             ' RETDASIZ                            '!!          ] @02C 99423090
*             ' CFLSBLCK                            ';           ] @02A 99423180
*                                                                       99423300
*/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */99423600
*/* DECLARES FOR CHECKING THAT ONLY ONE OF A LIST OF NAMES WAS        */99423900
*/* SPECIFIED.                                                        */99424200
*/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */99424500
*DCL ALL_NAMES      CHAR  INT; /*ALL NAMES IN THE LIST                */99424800
*DCL KEY_COUNT     FIXED  INT; /*COUNT OF NAMES SPECIFIED             */99425100
*DCL KEY_NAMES      CHAR  INT; /*LIST OF NAMES THAT WERE SPECIFIED    */99425400
*DCL FPL_LENGTH     CHAR  INT; /*LENGTH OF FPL FOR MOVE, CLEARING     */99425700
*DCL DSSPECD        CHAR  INT; /*Is dataset one of the types spec'd?  */99426000
*DCL RETDAT         CHAR  INT; /*Is it a service w/ return data parm? */99426300
*                                                                       99426600
*/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */99426900
*/* INITIALIZATION SEQUENCE                                           */99427200
*/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */99427500
*FPL_BASE_NAME = 'Cidb';      /*THE FPL_BASE_NAME CONSISTS OF AN F */   99427800
*                                /*FOLLOWED BY THE 3 LETTER FUNCTION  */99428100
*                                /*ACRONYM                            */99428400
*KENMF=' BDY(DWORD) ';           /*@kmk*/                               99428700
*EMBEDDED_INCLUDE = 'YES';      /* INDICATE SOMETHING INCLUDED        */99429000
*]                                                                      99429300
*]  CHANGES REQUIRED FOR VSAM PC                                        99429600
*]                                                                      99429900
*VRGB_Base = 'based(DFVVRLS)';                                          99430200
*                                                                       99430500
*IF IGWMCIDB_INCLUDE ^= 'DONE' THEN                                     99430800
*IGWMCIDB_INCLUDE = 'YES';      /* FORCE INCLUDE OF FPL               */99431100
*                                                                       99431400
*IF IGWMDSMB_INCLUDE ^= 'DONE' THEN                                     99431700
*IGWMDSMB_INCLUDE = 'YES';      /* FORCE INCLUDE OF DATASET MASK BLOCK*/99432000
*                                                                       99432300
*IF IGWSINT_INCLUDE ^= 'DONE' THEN                                      99432600
*IGWSINT_INCLUDE = 'YES';       /* FORCE INCLUDE OF FPL               */99432900
*                                                                       99433200
*IF IGW0REG_INCLUDE ^= 'DONE' THEN                                      99433500
*IGW0REG_INCLUDE = 'YES';       /* FORCE INCLUDE OF REGISTER NAMES    */99433800
*                                                                       99434100
*IF IHADFA_INCLUDE ^= 'DONE' THEN                                       99434400
*IHADFA_INCLUDE = 'YES';       /* FORCE INCLUDE OF DFA               */ 99434700
*                                                                       99435000
*IF IHADFVT_INCLUDE ^= 'DONE' THEN                                      99435300
*IHADFVT_INCLUDE = 'YES';       /* FORCE INCLUDE OF DFVT              */99435600
*                                                                       99435900
*IF IDAVRGB_INCLUDE ^= 'DONE' THEN                                      99436200
*IDAVRGB_INCLUDE = 'YES';       /* FORCE INCLUDE OF VSAM ANCHOR       */99436500
*                                                                       99436800
*IF IDAVTYP_INCLUDE ^= 'DONE' THEN                                      99437100
*IDAVTYP_INCLUDE = 'YES';       /* FORCE INCLUDE OF VSAM TYPES        */99437400
*                                                                       99437700
*IF IDAVRCI_INCLUDE ^= 'DONE' THEN                                      99438000
*IDAVRCI_INCLUDE = 'YES';       /* FORCE INCLUDE OF VSAM CONSTANTS    */99438300
*                                                                       99438600
*IF IGWFTYPE_INCLUDE ^= 'DONE' THEN                                     99438900
*IGWFTYPE_INCLUDE = 'YES';      /* FORCE INCLUDE OF SSF TYPES         */99439200
*                                                                       99439500
*IF IGWARSC_INCLUDE ^= 'DONE' THEN                                      99439800
*IGWARSC_INCLUDE = 'YES';      /* FORCE INCLUDE OF SUB-COMPONENTS    */ 99440100
*                                                                       99440400
*IF CVT_INCLUDE ^= 'DONE' THEN                                          99440700
*CVT_INCLUDE = 'YES';          /* FORCE INCLUDE OF CVT               */ 99441000
*                                                                       99441300
*IF IDAVSSPC_INCLUDE ^= 'DONE' THEN                                     99441600
*IDAVSSPC_INCLUDE = 'YES';      /* FORCE INCLUDE OF SUB-COMPONENTS    */99441900
*                                                                       99442200
*]                                                                      99442500
*] END  CHANGES REQUIRED FOR VSAM PC                                    99442800
*]                                                                      99443100
*                                                                       99443400
*MAC_RETCODE = 0;                                                       99443700
*NULL = '';                                                             99444000
*REQUIRED    = 'NO';                                                    99444300
*DSSPECD     = 'NO';                                                    99444600
*RETDATA     = 'NO';                                                    99444900
*REQ_MSG     = 'IS A REQUIRED KEYWORD.';                                99445200
*NOTREQ_MSG  = 'IS NOT A REQUIRED KEYWORD.';                     ] @02A 99445300
*NOT_ALLOWED_MSG = 'IS A NOT ALLOWED WITHOUT KEYWORD SMF42ST16.';       99445500
*TEMP_TEXT=MACLABEL!!' '!!MACNAME!!' '!!MACKEYS!!' '!!MACLIST!!' ';     99445800
*ANS(COMMENT(TEMP_TEXT)) NORESCAN;                                      99446100
*ANS('@LIST PUSH;') RESCAN SKIP COL(MACCOL);                            99446400
*ANS('@LIST   ON;') RESCAN SKIP COL(MACCOL);                            99446700
*                                                                       99447000
*]                                                                      99447300
*]  ANSWER OUT INVOCATION ECHO AND DO                                   99447600
*]                                                                      99447900
*                                                                       99448200
*ANS('@FORMAT PUSH;') SKIP COL(MACCOL) NORESCAN;                        99448500
*ANS('@FORMAT OFF;') SKIP COL(MACCOL) NORESCAN;                         99448800
*                                                                       99449100
*/* ANSWER OUT BLOCK COMMENT BORDER LINE */                             99449400
*TEMP_NUM = MACRMAR-MACCOL-3;                                           99449700
*IF TEMP_NUM < 2 THEN TEMP_NUM = 3;                                     99450000
*TEMP_TEXT = '/'!!REPEAT('*',TEMP_NUM)!!'/';                            99450300
*ANS(TEMP_TEXT) SKIP COL(MACCOL) NORESCAN;                              99450600
*                                                                       99450900
*/* ANSWER OUT MACRO LABEL IF ANY */                                    99451200
*IF MACLABEL ^= NULL THEN DO;                                           99451500
*  TEMP_TEXT='/* ? '!!MACLABEL!!' ';                                    99451800
*  ANS(TEMP_TEXT) SKIP COL(MACCOL) NORESCAN;                            99452100
*  ANS('*/') COL(MACRMAR-2) NORESCAN;                                   99452400
*  TEMP_TEXT = '/*   ';                                                 99452700
*END;                                                                   99453000
*ELSE TEMP_TEXT = '/* ? ';                                              99453300
*                                                                       99453600
*/* ANSWER OUT MACRO NAME */                                            99453900
*TEMP_TEXT=TEMP_TEXT!!MACNAME!!' ';                                     99454200
*ANS(TEMP_TEXT!!MACLIST) SKIP COL(MACCOL) NORESCAN;                     99454500
*ANS('*/') COL(MACRMAR-2) NORESCAN;                                     99454800
*TT = '/*'!!REPEAT(' ',LENGTH(TEMP_TEXT)-2);                            99455100
*IF (MACCOL+LENGTH(TT)+25) > MACRMAR THEN TT = '/* ';                   99455400
*                                                                       99455700
*/* ANSWER OUT MACRO KEYWORDS - ONE PER LINE */                         99456000
*M_KEYNAME = '';                                                        99456300
*DO M_I = 1 TO LENGTH(MACKEYS);                                         99456600
*  M_KEYCHAR = MACKEYS(M_I:M_I);                                        99456900
*  M_KEYNAME = M_KEYNAME!!M_KEYCHAR;                                    99457200
*  IF (M_KEYCHAR = '(') ! (M_KEYCHAR = ' ') THEN DO;                    99457500
*    /* SKIP OVER ANY ARGUMENTS OF THE KEYWORD */                       99457800
*    IF (M_KEYCHAR = '(') THEN DO;                                      99458100
*      M_PAREN_DEPTH = 1;                                               99458400
*      DO UNTIL (M_PAREN_DEPTH = 0) ! (M_I = LENGTH(MACKEYS));          99458700
*        M_I = M_I + 1;                                                 99459000
*        M_KEYNAME = M_KEYNAME!!MACKEYS(M_I:M_I);                       99459300
*        IF MACKEYS(M_I:M_I) = '(' THEN                                 99459600
*          M_PAREN_DEPTH = M_PAREN_DEPTH + 1;                           99459900
*        IF MACKEYS(M_I:M_I) = ')' THEN DO;                             99460200
*          M_PAREN_DEPTH = M_PAREN_DEPTH - 1;                           99460500
*          TEMP_TEXT = MACKEYS!!' ';                                    99460800
*          IF TEMP_TEXT(M_I+1:M_I+1) ^= ')' THEN                        99461100
*            M_KEYNAME = M_KEYNAME!!' ';                                99461400
*        END;                                                           99461700
*      END;   /* DO UNTIL (M_PAREN_DEPTH = 0)... */                     99462000
*      M_KEYNAME = M_KEYNAME!!' ';                                      99462300
*    END;   /* IF (M_KEYCHAR = '(') THEN DO */                          99462600
*    TEMP_TEXT=TT!!M_KEYNAME;                                           99462900
*    ANS(TEMP_TEXT) SKIP COL(MACCOL) NORESCAN;                          99463200
*    ANS('*/') COL(MACRMAR-2) NORESCAN;                                 99463500
*    M_KEYNAME = '';                                                    99463800
*  END;    /* IF (M_KEYCHAR = '(') ! (M_KEYCHAR = ' ') THEN DO */       99464100
*END;   /* DO M_I = 1 TO LENGTH(MACKEYS) */                             99464400
*                                                                       99464700
*/* ANSWER OUT BLOCK COMMENT BORDER LINE */                             99465000
*TEMP_NUM = MACRMAR-MACCOL-3;                                           99465300
*IF TEMP_NUM < 2 THEN TEMP_NUM = 3;                                     99465600
*TEMP_TEXT = '/'!!REPEAT('*',TEMP_NUM)!!'/';                            99465900
*ANS(TEMP_TEXT) SKIP COL(MACCOL) NORESCAN;                              99466200
*ANS('@FORMAT POP;') SKIP COL(MACCOL) NORESCAN;                         99466500
*                                                                       99466800
*ANS('?SYSSTATE (TEST);');        /* Check for 64-bit & AR mode   @L2A*/99466900
*IF (SYSAM64 = 'YES') THEN        /* AMODE64                      @L2A*/99467000
*  DO;                                                          /*@L2A*/99467100
*    ANS MESSAGE('YOU SPECIFIED AMODE64 ON THE SYSSTATE' !!             99467200
*      ' MACRO BUT THE IGWCDATA MACRO DOES NOT SUPPORT AMODE64')        99467300
*      MSGLEVEL(8);                                             /*@L2A*/99467400
*    ANS(COMMENT('YOU SPECIFIED AMODE64 ON THE SYSSTATE' !!             99467500
*      ' MACRO BUT THE IGWCDATA MACRO DOES NOT SUPPORT AMODE64'))       99467600
*                            NORESCAN SKIP COL(MACCOL+2);       /*@L2A*/99467700
*  IF MAC_RETCODE < 8 THEN MAC_RETCODE = 8;                     /*@L2A*/99467800
*  END;                                                         /*@L2A*/99467900
*IF (SYSASCE ^= 'P') THEN        /* If not primary mode           @L2A*/99468000
*  DO;                                                          /*@L2A*/99468100
*    ANS MESSAGE('YOU SPECIFIED ASCENV(AR) OR (ANY) ON THE' !!          99468200
*      ' SYSSTATE MACRO BUT THE IGWCDATA MACRO DOES NOT SUPPORT IT')    99468300
*      MSGLEVEL(8);                                             /*@L2A*/99468400
*    ANS(COMMENT('YOU SPECIFIED ASCENV(AR) OR (ANY) ON THE' !!          99468500
*      ' SYSSTATE MACRO BUT THE IGWCDATA MACRO DOES NOT SUPPORT IT'))   99468600
*                            NORESCAN SKIP COL(MACCOL+2);               99468700
*  IF MAC_RETCODE < 8 THEN MAC_RETCODE = 8;                     /*@L2A*/99468800
*  END;                                                         /*@L2A*/99468900
*                                                                       99469000
*ANS('DO; ') SKIP COL(MACCOL) NORESCAN;                                 99469100
*                                                                       99469200
*]                                                                      99469300
*] HANDLE POSITIONAL ARGUMENTS                                          99469400
*]                                                                      99469500
*                                                                       99469600
*IF MACLIST ^= '' THEN DO;                                              99469700
*  TT = MACNAME!!'-IGWSCM05E-SYNTAX ERROR: '!!                          99469800
*      'NO POSITIONAL ARGUMENTS ARE ALLOWED ON THIS MACRO.';            99469900
*  ANS MESSAGE(TT)        SKIP COL(MACCOL) NORESCAN;                    99470100
*  ANS ('/* '!!TT!!' */') SKIP COL(MACCOL) NORESCAN;                    99470400
*  IF MAC_RETCODE < 8 THEN MAC_RETCODE = 8;                             99470700
*END;                                                                   99471000
*                                                                       99471300
*]                                                                      99471600
*]  TEST FOR KEYWORDS IN THE MACRO INVOCATION THAT ARE NOT IN THE       99471900
*]  MACRO STATEMENT.                                                    99472200
*]                                                                      99472500
*                                                                       99472800
*M_KEYNAME = ' ';                                                       99473100
*DO M_I = 1 TO LENGTH(MACKEYS);                                         99473400
*  M_KEYCHAR = MACKEYS(M_I:M_I);                                        99473700
*  IF (M_KEYCHAR = '(') ! (M_KEYCHAR = ' ') THEN DO;                    99474000
*    M_KEYNAME = M_KEYNAME !!' ';                                       99474300
*    IF INDEX(M_KEYNAMES,M_KEYNAME) = 0 THEN DO                         99474600
*      TT = MACNAME!!'-IGWSCM14E-SYNTAX ERROR: '!!                      99474900
*          'KEYWORD "'!!M_KEYNAME!!'" '!!                               99475200
*          'IS NOT SPECIFIED IN THE MACRO STATEMENT.';                  99475500
*      ANS MESSAGE(TT)        SKIP COL(MACCOL) NORESCAN;                99475800
*      ANS ('/* '!!TT!!' */') SKIP COL(MACCOL) NORESCAN;                99476100
*      IF MAC_RETCODE < 8 THEN MAC_RETCODE = 8;                         99476400
*    END;   /* IF INDEX(M_KEYNAMES,M_KEYNAME) = 0 THEN DO */            99476700
*    M_KEYNAME = ' ';  /* REINITIALIZE THE KEYNAME */                   99477000
*    /* SKIP OVER ANY ARGUMENTS OF THE KEYWORD */                       99477300
*    IF (M_KEYCHAR = '(') THEN DO;                                      99477600
*      M_PAREN_DEPTH = 1;                                               99477900
*      DO UNTIL (M_PAREN_DEPTH = 0) ! (M_I = LENGTH(MACKEYS));          99478200
*        M_I = M_I + 1;                                                 99478500
*        IF MACKEYS(M_I:M_I) = '(' THEN                                 99478800
*          M_PAREN_DEPTH = M_PAREN_DEPTH + 1;                           99479100
*        IF MACKEYS(M_I:M_I) = ')' THEN                                 99479400
*          M_PAREN_DEPTH = M_PAREN_DEPTH - 1;                           99479700
*      END;   /* DO UNTIL (M_PAREN_DEPTH = 0)... */                     99480000
*    END;   /* IF (M_KEYCHAR = '(') THEN DO */                          99480300
*  END;                                                                 99480600
*  ELSE DO;                                                             99480900
*    M_KEYNAME = M_KEYNAME!!M_KEYCHAR;                                  99481200
*  END;    /* IF (M_KEYCHAR = '(') ! (M_KEYCHAR = ' ') THEN DO */       99481500
*END;   /* DO M_I = 1 TO LENGTH(MACKEYS) */                             99481800
*                                                                       99482100
*]                                                                      99482400
*] HANDLE KEYWORD "MF"                                                  99482700
*]                                                                      99483000
*                                                                       99483300
*KEY_COUNT = 0;                                                         99483600
*IF MF = NULL THEN DO;                                                  99483900
*  MF1 = 'S';                                                           99484200
*END;                                                                   99484500
*ELSE DO;                                                               99484800
*  IF NUMBER(MF) = 0 THEN DO;                                           99485100
*    TT = MACNAME!!'-IGWSCM11E-SYNTAX ERROR: '!!                        99485400
*        'KEYWORD "MF" '!!                                              99485700
*        'MUST HAVE AT LEAST 1 ARGUMENT(S).';                           99486000
*  ANS MESSAGE(TT)        SKIP COL(MACCOL) NORESCAN;                    99486300
*  ANS ('/* '!!TT!!' */') SKIP COL(MACCOL) NORESCAN;                    99486600
*    IF MAC_RETCODE < 8 THEN MAC_RETCODE = 8;                           99486900
*  END;                                                                 99487200
*  MF1 = MF(1);                                                         99487500
*END;                                                                   99487800
*IF MF1='S' THEN DO;                                                    99488100
*  KEY_COUNT = KEY_COUNT + 1;                                           99488400
*  REQUIRED = 'YES';                                                    99488700
*  IF NUMBER(MF) > 1 THEN DO;                                           99489000
*    TT = MACNAME!!'-IGWSCM01E-SYNTAX ERROR: '!!                        99489300
*        'KEYWORD "MF(S)" '!!                                           99489600
*        'MUST HAVE EXACTLY ONE ARGUMENT.';                             99489900
*    ANS MESSAGE(TT)        SKIP COL(MACCOL) NORESCAN;                  99490200
*    ANS ('/* '!!TT!!' */') SKIP COL(MACCOL) NORESCAN;                  99490500
*    IF MAC_RETCODE < 8 THEN MAC_RETCODE = 8;                           99490800
*  END;                                                                 99491100
*END;                                                                   99491400
*IF MF1='L' THEN DO;                                                    99491700
*  KEY_COUNT = KEY_COUNT + 1;                                           99492000
*  IF NUMBER(MF) > 3 THEN DO;                                           99492300
*    TT = MACNAME!!'-IGWSCM10E-SYNTAX ERROR: '!!                        99492600
*        'KEYWORD "MF(L)" '!!                                           99492900
*        'MUST HAVE NO MORE THAN 3 ARGUMENTS.';                         99493200
*    ANS MESSAGE(TT)        SKIP COL(MACCOL) NORESCAN;                  99493500
*    ANS ('/* '!!TT!!' */') SKIP COL(MACCOL) NORESCAN;                  99493800
*    IF MAC_RETCODE < 8 THEN MAC_RETCODE = 8;                           99494100
*  END;                                                                 99494400
*  IF NUMBER(MF) < 2 THEN DO;                                           99494700
*    TT = MACNAME!!'-IGWSCM12E-SYNTAX ERROR: '!!                        99495000
*        'stor_name ARGUMENT MUST BE (BUT WAS NOT) SPECIFIED IN '!!     99495300
*        'MF(L,stor_name) KEYWORD.';                                    99495600
*    ANS MESSAGE(TT)        SKIP COL(MACCOL) NORESCAN;                  99495900
*    ANS ('/* '!!TT!!' */') SKIP COL(MACCOL) NORESCAN;                  99496200
*    IF MAC_RETCODE < 8 THEN MAC_RETCODE = 8;                           99496500
*  END;                                                                 99496800
*  if number(mf)=3 then do;        /*@kmk*/                             99497100
*      kenmf=mf(3);                /*@kmk*/                             99497400
*  end;                            /*@kmk*/                             99497700
*END;                                                                   99498000
*IF MF1='E' THEN DO;                                                    99498300
*  KEY_COUNT = KEY_COUNT + 1;                                           99498600
*  IF NUMBER(MF) > 3 THEN DO;                                           99498900
*    TT = MACNAME!!'-IGWSCM10E-SYNTAX ERROR: '!!                        99499200
*        'KEYWORD "MF(E)" '!!                                           99499500
*        'MUST HAVE NO MORE THAN 3 ARGUMENTS.';                         99499800
*    ANS MESSAGE(TT)        SKIP COL(MACCOL) NORESCAN;                  99500100
*    ANS ('/* '!!TT!!' */') SKIP COL(MACCOL) NORESCAN;                  99500400
*    IF MAC_RETCODE < 8 THEN MAC_RETCODE = 8;                           99500700
*  END;                                                                 99501000
*  IF NUMBER(MF) < 2 THEN DO;                                           99501300
*    TT = MACNAME!!'-IGWSCM12E-SYNTAX ERROR: '!!                        99501600
*        'FPL NAME ARGUMENT MUST BE (BUT WAS NOT) SPECIFIED IN '!!      99501900
*        'MF(E,FPL_NAME) KEYWORD.';                                     99502200
*    ANS MESSAGE(TT)        SKIP COL(MACCOL) NORESCAN;                  99502500
*    ANS ('/* '!!TT!!' */') SKIP COL(MACCOL) NORESCAN;                  99502800
*    IF MAC_RETCODE < 8 THEN MAC_RETCODE = 8;                           99503100
*  END;                                                                 99503400
*  ]                                                                    99503700
*  ]  NOTE: THE FOLLOWING IF STATEMENTS ARE ACTUALLY NESTED]            99504000
*  ]                                                                    99504300
*                                                                       99504600
*  IF (MF(3) = 'COMPLETE') ! (MF(3) = '')                               99504900
*    THEN FIELD_VALUE = 'COMPLETE';                                     99505200
*  ELSE                                                                 99505500
*  DO;                                                                  99505800
*    TT = MACNAME!!'-IGWSCM09E-SYNTAX ERROR: '!!                        99506100
*        'INVALID VALUE "'!!MF(3)!!'" '!!                               99506400
*        'SPECIFIED FOR KEYWORD '!!                                     99506700
*        '"MF"';                                                        99507000
*    ANS MESSAGE(TT)        SKIP COL(MACCOL) NORESCAN;                  99507300
*    ANS ('/* '!!TT!!' */') SKIP COL(MACCOL) NORESCAN;                  99507600
*    IF MAC_RETCODE < 8 THEN MAC_RETCODE = 8;                           99507900
*  END;                                                                 99508200
*  ]                                                                    99508500
*  ]  NOTE: END OF NESTED IF STATEMENTS.                                99508800
*  ]                                                                    99509100
*                                                                       99509400
*  REQUIRED = 'YES';                                                    99509700
*END;                                                                   99510000
*IF MF1='B' THEN DO;                                                    99510300
*  KEY_COUNT = KEY_COUNT + 1;                                           99510600
*  DEFAULTS = 'YES';                                                    99510900
*  IF NUMBER(MF) > 3 THEN DO;                                           99511200
*    TT = MACNAME!!'-IGWSCM10E-SYNTAX ERROR: '!!                        99511500
*        'KEYWORD "MF(B)" '!!                                           99511800
*        'MUST HAVE NO MORE THAN 3 ARGUMENTS.';                         99512100
*    ANS MESSAGE(TT)        SKIP COL(MACCOL) NORESCAN;                  99512400
*    ANS ('/* '!!TT!!' */') SKIP COL(MACCOL) NORESCAN;                  99512700
*    IF MAC_RETCODE < 8 THEN MAC_RETCODE = 8;                           99513000
*  END;                                                                 99513300
*  IF NUMBER(MF) < 2 THEN DO;                                           99513600
*    TT = MACNAME!!'-IGWSCM12E-SYNTAX ERROR: '!!                        99513900
*        'FPL NAME ARGUMENT MUST BE (BUT WAS NOT) SPECIFIED IN '!!      99514200
*        'MF(B,FPL_NAME) KEYWORD.';                                     99514500
*    ANS MESSAGE(TT)        SKIP COL(MACCOL) NORESCAN;                  99514800
*    ANS ('/* '!!TT!!' */') SKIP COL(MACCOL) NORESCAN;                  99515100
*    IF MAC_RETCODE < 8 THEN MAC_RETCODE = 8;                           99515400
*  END;                                                                 99515700
*  IF (MF(3) ^= 'AUTO') & (MF(3) ^= '') THEN DO;                        99516000
*    TT = MACNAME!!'-IGWSCM09E-SYNTAX ERROR: '!!                        99516300
*        'INVALID VALUE "'!!MF(3)!!'" '!!                               99516600
*        'SPECIFIED FOR KEYWORD '!!                                     99516900
*        '"MF"';                                                        99517200
*    ANS MESSAGE(TT)        SKIP COL(MACCOL) NORESCAN;                  99517500
*    ANS ('/* '!!TT!!' */') SKIP COL(MACCOL) NORESCAN;                  99517800
*    IF MAC_RETCODE < 8 THEN MAC_RETCODE = 8;                           99518100
*  END;                                                                 99518400
*END;                                                                   99518700
*IF KEY_COUNT = 0 THEN DO;                                              99519000
*  TT = MACNAME!!'-IGWSCM09E-SYNTAX ERROR: '!!                          99519300
*      'INVALID VALUE "'!!MF1!!'" SPECIFIED FOR '!!                     99519600
*      'KEYWORD "MF".';                                                 99519900
*  ANS MESSAGE(TT)        SKIP COL(MACCOL) NORESCAN;                    99520200
*  ANS ('/* '!!TT!!' */') SKIP COL(MACCOL) NORESCAN;                    99520500
*  IF MAC_RETCODE < 8 THEN MAC_RETCODE = 8;                             99520800
*END;                                                                   99521100
*                                                                       99521400
*]                                                                      99521700
*]  SET FPL_NAME and FPL_PREFIX                                         99522000
*]                                                                      99522300
*                                                                       99522600
*FPL_NAME = FPL_BASE_NAME;                                              99522900
*                                                                       99523200
*Uni_num   = MacIndex;                                                  99523500
*IF (MF1='L') ! (MF1='E') ! (MF1='B') THEN                              99523800
*  FPL_PREFIX = 'Cidb_';                                                99524100
*ELSE                                                                   99524400
*  FPL_PREFIX = 'L_Cidb_'!!Uni_num!!'.'!!FPL_NAME!!'_';                 99524700
*                                                                       99525000
*]                                                                      99525300
*]  DECLARE THE STORAGE FOR THE FPL.                                    99525600
*]                                                                      99525900
*                                                                       99526200
*IF (MF1='S')                                                           99526500
*  THEN FPL_STOR_NAME = MACNAME!!'_'!!MACINDEX;                         99526800
*ELSE FPL_STOR_NAME = MF(2);                                            99527100
*                                                                       99527400
*IF (MF1='L') THEN DO;                                                  99527700
* /*@kmk*/                                                              99528000
*   ANS ('DCL '!!FPL_STOR_NAME!!' ISA(MmfCidbType)  ' !! kenmf !!';')   99528300
* /*ANS ('DCL '!!FPL_STOR_NAME!!' ISA(MmfCidbType)  BDY(DWORD);')*/     99528600
*     SKIP COL(MACCOL+2) NORESCAN;                                      99528900
*END;                                                                   99529200
*                                                                       99529500
*IF (MF1='S') ! ((MF1='B') & (MF(3)='AUTO')) THEN DO;                   99529800
*   ANS ('DCL '!!FPL_STOR_NAME!!                                        99530100
*        ' CHAR(LENGTH(Mmf'!!FPL_NAME!!'Type)) '!!                      99530400
*        TEMP_TEXT!!';')                                                99530700
*     SKIP COL(MACCOL+2) NORESCAN;                                      99531000
*END;                                                                   99531300
*                                                                       99531600
*]                                                                      99531900
*]  CREATE BASING EXPRESSION FOR ANSWERING FPL ASSIGNMENTS              99532200
*]                                                                      99532500
*                                                                       99532800
*IF (MF1 ^= 'L') & (MF1 ^= 'E') THEN DO;                                99533100
*  FPL_PTR_NAME = MACNAME!!'_'!!MACINDEX!!'_PTR';                       99533400
*  ANS('DCL '!!FPL_PTR_NAME!!' PTR;') SKIP COL(MACCOL+2);               99533700
*  ANS(FPL_PTR_NAME!!' = ADDR('!!FPL_STOR_NAME!!');')                   99534000
*    NORESCAN SKIP COL(MACCOL+2);                                       99534300
*  FPL_PTR = FPL_PTR_NAME !! '->';                                      99534600
*  ANS('DCL L_Cidb_'!!Uni_num!!'  BASED ISA(MmfCidbType) BDY(DWORD);')  99534900
*                                 SKIP COL(MACCOL+2);                   99535200
*END;                                                                   99535500
*                                                                       99535800
*]                                                                      99536100
*]  INITIALIZE THE PARM BLOCK                                           99536400
*]                                                                      99536700
*                                                                       99537000
*IF (MF1 = 'S') THEN DO;                                                99537300
*                                                                       99537600
*  ANS(FPL_PTR!!FPL_PREFIX!!'SECTION_ONE     =  '!!                     99537900
*      FPL_PTR!!FPL_PREFIX!!'SECTION_ONE     && '!!                     99538200
*      FPL_PTR!!FPL_PREFIX!!'SECTION_ONE;'    )                         99538500
*    NORESCAN SKIP COL(MACCOL+2);                                       99538800
*                                                                       99539100
*  ANS(FPL_PTR!!FPL_PREFIX!!'SECTION_TWO     =  '!!                     99539400
*      FPL_PTR!!FPL_PREFIX!!'SECTION_TWO     && '!!                     99539700
*      FPL_PTR!!FPL_PREFIX!!'SECTION_TWO;'  )                           99540000
*    NORESCAN SKIP COL(MACCOL+2);                                       99540300
*                                                                       99540600
*  ANS(FPL_PTR!!FPL_PREFIX!!'SECTION_THREE   =  '!!                     99540900
*      FPL_PTR!!FPL_PREFIX!!'SECTION_THREE   && '!!                     99541200
*      FPL_PTR!!FPL_PREFIX!!'SECTION_THREE;'  )                         99541500
*    NORESCAN SKIP COL(MACCOL+2);                                       99541800
*                                                                       99542100
*  ANS(FPL_PTR!!FPL_PREFIX!!'HDR.Cidb_EYECATCHER = CIDB_VISUALC;')      99542400
*    NORESCAN SKIP COL(MACCOL+2);                                       99542700
*  ANS(FPL_PTR!!FPL_PREFIX!!'HDR.Cidb_LENGTH = CIDB_LENGTHC;')          99543000
*    NORESCAN SKIP COL(MACCOL+2);                                       99543300
*  ANS(FPL_PTR!!FPL_PREFIX!!'HDR.Cidb_VERSION = CIDB_LEVELC;')          99543600
*    NORESCAN SKIP COL(MACCOL+2);                                       99543900
*END;                                                                   99544200
*                                                                       99544500
*IF (MF1 = 'L') ! (MF1 = 'B') ! (MF1 = 'E') THEN DO;                    99544800
*                                                                       99545100
*   ANS(FPL_STOR_NAME!!'.'!!FPL_PREFIX!!'SECTION_ONE     =  '!!         99545400
*       FPL_STOR_NAME!!'.'!!FPL_PREFIX!!'SECTION_ONE     && '!!         99545700
*       FPL_STOR_NAME!!'.'!!FPL_PREFIX!!'SECTION_ONE;'    )             99546000
*     NORESCAN SKIP COL(MACCOL+2);                                      99546300
*                                                                       99546600
*   ANS(FPL_STOR_NAME!!'.'!!FPL_PREFIX!!'SECTION_TWO     =  '!!         99546900
*       FPL_STOR_NAME!!'.'!!FPL_PREFIX!!'SECTION_TWO     && '!!         99547200
*       FPL_STOR_NAME!!'.'!!FPL_PREFIX!!'SECTION_TWO;'    )             99547500
*     NORESCAN SKIP COL(MACCOL+2);                                      99547800
*                                                                       99548100
*                                                                       99548400
*   ANS(FPL_STOR_NAME!!'.'!!FPL_PREFIX!!'SECTION_THREE   =  '!!         99548700
*       FPL_STOR_NAME!!'.'!!FPL_PREFIX!!'SECTION_THREE   && '!!         99549000
*       FPL_STOR_NAME!!'.'!!FPL_PREFIX!!'SECTION_THREE;' )              99549300
*     NORESCAN SKIP COL(MACCOL+2);                                      99549600
*                                                                       99549900
*  ANS(FPL_STOR_NAME!!'.'!!FPL_PREFIX!!'EYECATCHER   = CIDB_VISUALC;')  99550200
*    NORESCAN SKIP COL(MACCOL+2);                                       99550500
*  ANS(FPL_STOR_NAME!!'.'!!FPL_PREFIX!!'LENGTH       = CIDB_LENGTHC;')  99550800
*    NORESCAN SKIP COL(MACCOL+2);                                       99551100
*  ANS(FPL_STOR_NAME!!'.'!!FPL_PREFIX!!'VERSION      = CIDB_LEVELC;')   99551400
*    NORESCAN SKIP COL(MACCOL+2);                                       99551700
*END;                                                                   99552000
*                                                                       99552300
*]                                                                      99552600
*]  HANDLE KEYWORD "RSNCODE"                                            99552900
*]                                                                      99553200
*                                                                       99553500
*IF RSNCODE = NULL THEN DO;                                             99553800
*   IF REQUIRED='YES' THEN DO;                                          99554100
*    TT = MACNAME!!'-IGWSCM03E-SYNTAX ERROR: '!!                        99554400
*        'KEYWORD "RSNCODE" '!!REQ_MSG;                                 99554700
*    ANS MESSAGE(TT)        SKIP COL(MACCOL) NORESCAN;                  99555000
*    ANS ('/* '!!TT!!' */') SKIP COL(MACCOL) NORESCAN;                  99555300
*    IF MAC_RETCODE < 8 THEN MAC_RETCODE = 8;                           99555600
*  END;                                                                 99555900
*END;                                                                   99556200
*ELSE IF NUMBER(RSNCODE) ^= 1 THEN DO;                                  99556500
*    TT = MACNAME!!'-IGWSCM01E-SYNTAX ERROR: '!!                        99556800
*        'KEYWORD "RSNCODE" '!!                                         99557100
*        'MUST HAVE EXACTLY ONE ARGUMENT.';                             99557400
*    ANS MESSAGE(TT)        SKIP COL(MACCOL) NORESCAN;                  99557700
*    ANS ('/* '!!TT!!' */') SKIP COL(MACCOL) NORESCAN;                  99558000
*    IF MAC_RETCODE < 8 THEN MAC_RETCODE = 8;                           99558300
*END;                                                                   99558600
*                                                                       99558900
*]                                                                      99559200
*]  HANDLE KEYWORD "RETCODE"                                            99559500
*]                                                                      99559800
*                                                                       99560100
*IF RETCODE = NULL THEN DO;                                             99560400
*   IF REQUIRED='YES' THEN DO;                                          99560700
*    TT = MACNAME!!'-IGWSCM03E-SYNTAX ERROR: '!!                        99561000
*        'KEYWORD "RETCODE" '!!REQ_MSG;                                 99561300
*    ANS MESSAGE(TT)        SKIP COL(MACCOL) NORESCAN;                  99561600
*    ANS ('/* '!!TT!!' */') SKIP COL(MACCOL) NORESCAN;                  99561900
*    IF MAC_RETCODE < 8 THEN MAC_RETCODE = 8;                           99562200
*   END;                                                                99562500
*END;                                                                   99562800
*ELSE IF NUMBER(RETCODE) ^= 1 THEN DO;                                  99563100
*    TT = MACNAME!!'-IGWSCM01E-SYNTAX ERROR: '!!                        99563400
*        'KEYWORD "RETCODE" '!!                                         99563700
*        'MUST HAVE EXACTLY ONE ARGUMENT.';                             99564000
*    ANS MESSAGE(TT)        SKIP COL(MACCOL) NORESCAN;                  99564300
*    ANS ('/* '!!TT!!' */') SKIP COL(MACCOL) NORESCAN;                  99564600
*    IF MAC_RETCODE < 8 THEN MAC_RETCODE = 8;                           99564900
*  END;                                                                 99565200
*                                                                       99565500
*]                                                                      99565800
*]  HANDLE KEYWORD "SERVICE"                                            99566100
*]                                                                      99566400
*                                                                       99566700
*IF SERVICE = NULL THEN DO;                                             99567000
*   IF REQUIRED='YES' THEN DO;                                          99567300
*     TT = MACNAME!!'-IGWSCM03E-SYNTAX ERROR: '!!                       99567600
*         'KEYWORD "SERVICE" '!!REQ_MSG;                                99567900
*     ANS MESSAGE(TT)        SKIP COL(MACCOL) NORESCAN;                 99568200
*     ANS ('/* '!!TT!!' */') SKIP COL(MACCOL) NORESCAN;                 99568500
*     IF MAC_RETCODE < 8 THEN MAC_RETCODE = 8;                          99568800
*     END;                                                              99569100
*   END;                                                                99569400
*ELSE DO;                                                               99569700
*    IF (NUMBER(SERVICE) ^= 1) THEN DO;                                 99570000
*      ANS SKIP COL(MACCOL) NORESCAN MESSAGE                            99570300
*        (MACNAME!!'-IGWSCM01E-SYNTAX ERROR: '!!                        99570600
*        'KEYWORD "SERVICE" '!!                                         99570900
*        'MUST HAVE EXACTLY ONE ARGUMENT.');                            99571200
*      IF MAC_RETCODE < 8 THEN MAC_RETCODE = 8;                         99571500
*    END;                                                               99571800
*    ELSE DO;                                                           99572100
*                                                                       99572400
*      IF ((SERVICE(1) ^= 'CONNECT')          &                         99572700
*          (SERVICE(1) ^= 'CONNECTU')         &                         99573000
*          (SERVICE(1) ^= 'OBTDATA')          &                         99573300
*          (SERVICE(1) ^= 'OBTDSMSK')         &                         99573600
*          (SERVICE(1) ^= 'OBTSCMSK')         &                  ] @03A 99573650
*          (SERVICE(1) ^= 'OBTCFLSD')         &                  ] @02A 99573700
*          (SERVICE(1) ^= 'DISCONN')) THEN                              99573900
*      DO;                                                              99574200
*        ANS SKIP COL(MACCOL) NORESCAN MESSAGE                          99574500
*          (MACNAME!!'-IGWSSF09E-SYNTAX ERROR: '!!                      99574800
*          'INVALID VALUE "'!!SERVICE(1)!!'" '!!                        99575100
*          'SPECIFIED FOR KEYWORD '!!                                   99575400
*          '"SERVICE"');                                                99575700
*        IF MAC_RETCODE < 8 THEN MAC_RETCODE = 8;                       99576000
*      END;                                                             99576300
*                                                                       99576600
*      ELSE DO;                                                         99576900
*       IF (MF1='L') ! (MF1='E') ! (MF1='B') THEN                       99577200
*        Do;                                                            99577500
*         FIELD_VALUE = '''1''B';                                       99577800
*         SELECT(SERVICE(1));                                           99578100
*           WHEN('CONNECT')                                             99578400
*            Do;                                                        99578700
*             TEMP_TEXT = FPL_STOR_NAME!!'.'!!FPL_PREFIX!!              99579000
*                          'CONNECT     = '!!FIELD_VALUE!!';';          99579300
*             ANS(TEMP_TEXT) SKIP COL(MACCOL+2) NORESCAN;               99579600
*                                                                       99579900
*             FIELD_VALUE = '''0''B';                                   99580200
*                                                                       99580500
*             TEMP_TEXT = FPL_STOR_NAME!!'.'!!FPL_PREFIX!!              99580800
*                          'CONNECT_UPDT = '!!FIELD_VALUE!!';';         99581100
*             ANS(TEMP_TEXT) SKIP COL(MACCOL+2) NORESCAN;               99581400
*                                                                       99581700
*             TEMP_TEXT = FPL_STOR_NAME!!'.'!!FPL_PREFIX!!              99582000
*                          'OBTAIN_DATA  = '!!FIELD_VALUE!!';';         99582300
*             ANS(TEMP_TEXT) SKIP COL(MACCOL+2) NORESCAN;               99582600
*                                                                       99582900
*             TEMP_TEXT = FPL_STOR_NAME!!'.'!!FPL_PREFIX!!              99583200
*                          'OBTAIN_DSMASK = '!!FIELD_VALUE!!';';        99583500
*             ANS(TEMP_TEXT) SKIP COL(MACCOL+2) NORESCAN;               99583800
*                                                                       99584100
*             TEMP_TEXT = FPL_STOR_NAME!!'.'!!FPL_PREFIX!!              99584400
*                          'DISCONNECT   = '!!FIELD_VALUE!!';';         99584700
*             ANS(TEMP_TEXT) SKIP COL(MACCOL+2) NORESCAN;               99585000
*                                                                       99585300
*             TEMP_TEXT = FPL_STOR_NAME!!'.'!!FPL_PREFIX!!       ] @02A 99585360
*                          'OBTAIN_CFLS_DATA = '!!FIELD_VALUE!!';';     99585420
*             ANS(TEMP_TEXT) SKIP COL(MACCOL+2) NORESCAN;        ] @02A 99585480
*                                                                ] @02A 99585540
*             TEMP_TEXT = FPL_STOR_NAME!!'.'!!FPL_PREFIX!!       ] @03A 99585550
*                         'OBTAIN_SCMASK = '!!FIELD_VALUE!!';';  ] @03A 99585560
*             ANS(TEMP_TEXT) SKIP COL(MACCOL+2) NORESCAN;        ] @03A 99585570
*                                                                ] @03A 99585580
*             RETDAT='NO';                                              99585600
*            End;                                                       99585900
*           WHEN('CONNECTU')                                            99586200
*            Do;                                                        99586500
*             TEMP_TEXT = FPL_STOR_NAME!!'.'!!FPL_PREFIX!!              99586800
*                          'CONNECT_UPDT = '!!FIELD_VALUE!!';';         99587100
*             ANS(TEMP_TEXT) SKIP COL(MACCOL+2) NORESCAN;               99587400
*                                                                       99587700
*             FIELD_VALUE = '''0''B';                                   99588000
*                                                                       99588300
*             TEMP_TEXT = FPL_STOR_NAME!!'.'!!FPL_PREFIX!!              99588600
*                          'CONNECT      = '!!FIELD_VALUE!!';';         99588900
*             ANS(TEMP_TEXT) SKIP COL(MACCOL+2) NORESCAN;               99589200
*                                                                       99589500
*             TEMP_TEXT = FPL_STOR_NAME!!'.'!!FPL_PREFIX!!              99589800
*                          'OBTAIN_DATA  = '!!FIELD_VALUE!!';';         99590100
*             ANS(TEMP_TEXT) SKIP COL(MACCOL+2) NORESCAN;               99590400
*                                                                       99590700
*             TEMP_TEXT = FPL_STOR_NAME!!'.'!!FPL_PREFIX!!              99591000
*                          'OBTAIN_DSMASK = '!!FIELD_VALUE!!';';        99591300
*             ANS(TEMP_TEXT) SKIP COL(MACCOL+2) NORESCAN;               99591600
*                                                                       99591900
*             TEMP_TEXT = FPL_STOR_NAME!!'.'!!FPL_PREFIX!!              99592200
*                          'DISCONNECT   = '!!FIELD_VALUE!!';';         99592500
*             ANS(TEMP_TEXT) SKIP COL(MACCOL+2) NORESCAN;               99592800
*                                                                       99593100
*             TEMP_TEXT = FPL_STOR_NAME!!'.'!!FPL_PREFIX!!       ] @02A 99593160
*                          'OBTAIN_CFLS_DATA = '!!FIELD_VALUE!!';';     99593220
*             ANS(TEMP_TEXT) SKIP COL(MACCOL+2) NORESCAN;        ] @02A 99593280
*                                                                ] @02A 99593340
*             TEMP_TEXT = FPL_STOR_NAME!!'.'!!FPL_PREFIX!!       ] @03A 99593350
*                         'OBTAIN_SCMASK = '!!FIELD_VALUE!!';';  ] @03A 99593360
*             ANS(TEMP_TEXT) SKIP COL(MACCOL+2) NORESCAN;        ] @03A 99593370
*                                                                ] @03A 99593380
*             RETDAT='YES';                                             99593400
*            End;                                                       99593700
*           WHEN('OBTDATA')                                             99594000
*            Do;                                                        99594300
*             TEMP_TEXT = FPL_STOR_NAME!!'.'!!FPL_PREFIX!!              99594600
*                          'OBTAIN_DATA  = '!!FIELD_VALUE!!';';         99594900
*             ANS(TEMP_TEXT) SKIP COL(MACCOL+2) NORESCAN;               99595200
*                                                                       99595500
*             FIELD_VALUE = '''0''B';                                   99595800
*                                                                       99596100
*             TEMP_TEXT = FPL_STOR_NAME!!'.'!!FPL_PREFIX!!              99596400
*                          'CONNECT_UPDT = '!!FIELD_VALUE!!';';         99596700
*             ANS(TEMP_TEXT) SKIP COL(MACCOL+2) NORESCAN;               99597000
*                                                                       99597300
*             TEMP_TEXT = FPL_STOR_NAME!!'.'!!FPL_PREFIX!!              99597600
*                          'CONNECT      = '!!FIELD_VALUE!!';';         99597900
*             ANS(TEMP_TEXT) SKIP COL(MACCOL+2) NORESCAN;               99598200
*                                                                       99598500
*             TEMP_TEXT = FPL_STOR_NAME!!'.'!!FPL_PREFIX!!              99598800
*                          'OBTAIN_DSMASK = '!!FIELD_VALUE!!';';        99599100
*             ANS(TEMP_TEXT) SKIP COL(MACCOL+2) NORESCAN;               99599400
*                                                                       99599700
*             TEMP_TEXT = FPL_STOR_NAME!!'.'!!FPL_PREFIX!!              99600000
*                          'DISCONNECT   = '!!FIELD_VALUE!!';';         99600300
*             ANS(TEMP_TEXT) SKIP COL(MACCOL+2) NORESCAN;               99600600
*                                                                       99600900
*             TEMP_TEXT = FPL_STOR_NAME!!'.'!!FPL_PREFIX!!       ] @02A 99600960
*                          'OBTAIN_CFLS_DATA = '!!FIELD_VALUE!!';';     99601020
*             ANS(TEMP_TEXT) SKIP COL(MACCOL+2) NORESCAN;        ] @02A 99601080
*                                                                ] @02A 99601140
*             TEMP_TEXT = FPL_STOR_NAME!!'.'!!FPL_PREFIX!!       ] @03A 99601150
*                         'OBTAIN_SCMASK = '!!FIELD_VALUE!!';';  ] @03A 99601160
*             ANS(TEMP_TEXT) SKIP COL(MACCOL+2) NORESCAN;        ] @03A 99601170
*                                                                ] @03A 99601180
*             RETDAT='YES';                                             99601200
*            End;                                                       99601500
*           WHEN('OBTDSMSK')                                            99601800
*            do;                                                        99602100
*             TEMP_TEXT = FPL_STOR_NAME!!'.'!!FPL_PREFIX!!              99602400
*                          'OBTAIN_DSMASK = '!!FIELD_VALUE!!';';        99602700
*             ANS(TEMP_TEXT) SKIP COL(MACCOL+2) NORESCAN;               99603000
*                                                                       99603300
*             FIELD_VALUE = '''0''B';                                   99603600
*                                                                       99603900
*             TEMP_TEXT = FPL_STOR_NAME!!'.'!!FPL_PREFIX!!              99604200
*                          'CONNECT_UPDT = '!!FIELD_VALUE!!';';         99604500
*             ANS(TEMP_TEXT) SKIP COL(MACCOL+2) NORESCAN;               99604800
*                                                                       99605100
*             TEMP_TEXT = FPL_STOR_NAME!!'.'!!FPL_PREFIX!!              99605400
*                          'OBTAIN_DATA  = '!!FIELD_VALUE!!';';         99605700
*             ANS(TEMP_TEXT) SKIP COL(MACCOL+2) NORESCAN;               99606000
*                                                                       99606300
*             TEMP_TEXT = FPL_STOR_NAME!!'.'!!FPL_PREFIX!!              99606600
*                          'CONNECT       = '!!FIELD_VALUE!!';';        99606900
*             ANS(TEMP_TEXT) SKIP COL(MACCOL+2) NORESCAN;               99607200
*                                                                       99607500
*             TEMP_TEXT = FPL_STOR_NAME!!'.'!!FPL_PREFIX!!              99607800
*                          'DISCONNECT   = '!!FIELD_VALUE!!';';         99608100
*             ANS(TEMP_TEXT) SKIP COL(MACCOL+2) NORESCAN;               99608400
*                                                                       99608700
*             TEMP_TEXT = FPL_STOR_NAME!!'.'!!FPL_PREFIX!!       ] @02A 99608760
*                          'OBTAIN_CFLS_DATA = '!!FIELD_VALUE!!';';     99608820
*             ANS(TEMP_TEXT) SKIP COL(MACCOL+2) NORESCAN;        ] @02A 99608880
*                                                                ] @02A 99608940
*             TEMP_TEXT = FPL_STOR_NAME!!'.'!!FPL_PREFIX!!       ] @03A 99608950
*                         'OBTAIN_SCMASK = '!!FIELD_VALUE!!';';  ] @03A 99608960
*             ANS(TEMP_TEXT) SKIP COL(MACCOL+2) NORESCAN;        ] @03A 99608970
*                                                                ] @03A 99608980
*             RETDAT   = 'NO';                                          99609000
*             DSSPECD  = 'YES';                                         99609300
*            End;                                                       99609600
*           WHEN('OBTSCMSK')                                     ] @03A 99609608
*            do;                                                 ] @03A 99609616
*             TEMP_TEXT = FPL_STOR_NAME!!'.'!!FPL_PREFIX!!       ] @03A 99609624
*                         'OBTAIN_SCMASK = '!!FIELD_VALUE!!';';  ] @03A 99609632
*             ANS(TEMP_TEXT) SKIP COL(MACCOL+2) NORESCAN;        ] @03A 99609640
*                                                                ] @03A 99609648
*             FIELD_VALUE = '''0''B';                            ] @03A 99609656
*                                                                ] @03A 99609664
*             TEMP_TEXT = FPL_STOR_NAME!!'.'!!FPL_PREFIX!!       ] @03A 99609672
*                         'CONNECT_UPDT = '!!FIELD_VALUE!!';';   ] @03A 99609680
*             ANS(TEMP_TEXT) SKIP COL(MACCOL+2) NORESCAN;        ] @03A 99609688
*                                                                ] @03A 99609696
*             TEMP_TEXT = FPL_STOR_NAME!!'.'!!FPL_PREFIX!!       ] @03A 99609704
*                         'OBTAIN_DATA  = '!!FIELD_VALUE!!';';   ] @03A 99609712
*             ANS(TEMP_TEXT) SKIP COL(MACCOL+2) NORESCAN;        ] @03A 99609720
*                                                                ] @03A 99609728
*             TEMP_TEXT = FPL_STOR_NAME!!'.'!!FPL_PREFIX!!       ] @03A 99609736
*                         'CONNECT       = '!!FIELD_VALUE!!';';  ] @03A 99609744
*             ANS(TEMP_TEXT) SKIP COL(MACCOL+2) NORESCAN;        ] @03A 99609752
*                                                                ] @03A 99609760
*             TEMP_TEXT = FPL_STOR_NAME!!'.'!!FPL_PREFIX!!       ] @03A 99609768
*                         'DISCONNECT   = '!!FIELD_VALUE!!';';   ] @03A 99609776
*             ANS(TEMP_TEXT) SKIP COL(MACCOL+2) NORESCAN;        ] @03A 99609784
*                                                                ] @03A 99609792
*             TEMP_TEXT = FPL_STOR_NAME!!'.'!!FPL_PREFIX!!       ] @03A 99609800
*                       'OBTAIN_CFLS_DATA = '!!FIELD_VALUE!!';'; ] @03A 99609808
*             ANS(TEMP_TEXT) SKIP COL(MACCOL+2) NORESCAN;        ] @03A 99609816
*                                                                ] @03A 99609824
*             TEMP_TEXT = FPL_STOR_NAME!!'.'!!FPL_PREFIX!!       ] @03A 99609832
*                         'OBTAIN_DSMASK = '!!FIELD_VALUE!!';';  ] @03A 99609840
*             ANS(TEMP_TEXT) SKIP COL(MACCOL+2) NORESCAN;        ] @03A 99609848
*                                                                ] @03A 99609856
*             RETDAT   = 'NO';                                   ] @03A 99609864
*             DSSPECD  = 'YES';                                  ] @03A 99609872
*            End;                                                ] @03A 99609880
*           WHEN('DISCONN')                                             99609900
*            Do;                                                        99610200
*             TEMP_TEXT = FPL_STOR_NAME!!'.'!!FPL_PREFIX!!              99610500
*                          'DISCONNECT   = '!!FIELD_VALUE!!';';         99610800
*             ANS(TEMP_TEXT) SKIP COL(MACCOL+2) NORESCAN;               99611100
*                                                                       99611400
*             FIELD_VALUE = '''0''B';                                   99611700
*                                                                       99612000
*             TEMP_TEXT = FPL_STOR_NAME!!'.'!!FPL_PREFIX!!              99612300
*                          'CONNECT_UPDT = '!!FIELD_VALUE!!';';         99612600
*             ANS(TEMP_TEXT) SKIP COL(MACCOL+2) NORESCAN;               99612900
*                                                                       99613200
*             TEMP_TEXT = FPL_STOR_NAME!!'.'!!FPL_PREFIX!!              99613500
*                          'OBTAIN_DATA  = '!!FIELD_VALUE!!';';         99613800
*             ANS(TEMP_TEXT) SKIP COL(MACCOL+2) NORESCAN;               99614100
*                                                                       99614400
*             TEMP_TEXT = FPL_STOR_NAME!!'.'!!FPL_PREFIX!!              99614700
*                          'OBTAIN_DSMASK = '!!FIELD_VALUE!!';';        99615000
*             ANS(TEMP_TEXT) SKIP COL(MACCOL+2) NORESCAN;               99615300
*                                                                       99615600
*             TEMP_TEXT = FPL_STOR_NAME!!'.'!!FPL_PREFIX!!              99615900
*                          'CONNECT      = '!!FIELD_VALUE!!';';         99616200
*             ANS(TEMP_TEXT) SKIP COL(MACCOL+2) NORESCAN;               99616500
*                                                                       99616800
*             TEMP_TEXT = FPL_STOR_NAME!!'.'!!FPL_PREFIX!!       ] @02A 99616860
*                          'OBTAIN_CFLS_DATA = '!!FIELD_VALUE!!';';     99616920
*             ANS(TEMP_TEXT) SKIP COL(MACCOL+2) NORESCAN;        ] @02A 99616980
*                                                                ] @02A 99617040
*             TEMP_TEXT = FPL_STOR_NAME!!'.'!!FPL_PREFIX!!       ] @03A 99617050
*                          'OBTAIN_SCMASK = '!!FIELD_VALUE!!';'; ] @03A 99617060
*             ANS(TEMP_TEXT) SKIP COL(MACCOL+2) NORESCAN;        ] @03A 99617070
*                                                                ] @03A 99617080
*             RETDAT='NO';                                              99617100
*            End;                                                       99617400
*           WHEN('OBTCFLSD')                                     ] @02A 99617409
*            do;                                                 ] @02A 99617418
*             TEMP_TEXT = FPL_STOR_NAME!!'.'!!FPL_PREFIX!!       ] @02A 99617427
*                          'OBTAIN_CFLS_DATA = '!!FIELD_VALUE!!';';     99617436
*             ANS(TEMP_TEXT) SKIP COL(MACCOL+2) NORESCAN;        ] @02A 99617445
*                                                                ] @02A 99617454
*             FIELD_VALUE = '''0''B';                            ] @02A 99617463
*                                                                ] @02A 99617472
*             TEMP_TEXT = FPL_STOR_NAME!!'.'!!FPL_PREFIX!!       ] @02A 99617481
*                          'CONNECT_UPDT = '!!FIELD_VALUE!!';';  ] @02A 99617490
*             ANS(TEMP_TEXT) SKIP COL(MACCOL+2) NORESCAN;        ] @02A 99617499
*                                                                ] @02A 99617508
*             TEMP_TEXT = FPL_STOR_NAME!!'.'!!FPL_PREFIX!!       ] @02A 99617517
*                          'OBTAIN_DATA  = '!!FIELD_VALUE!!';';  ] @02A 99617526
*             ANS(TEMP_TEXT) SKIP COL(MACCOL+2) NORESCAN;        ] @02A 99617535
*                                                                ] @02A 99617544
*             TEMP_TEXT = FPL_STOR_NAME!!'.'!!FPL_PREFIX!!       ] @02A 99617553
*                          'CONNECT       = '!!FIELD_VALUE!!';'; ] @02A 99617562
*             ANS(TEMP_TEXT) SKIP COL(MACCOL+2) NORESCAN;        ] @02A 99617571
*                                                                ] @02A 99617580
*             TEMP_TEXT = FPL_STOR_NAME!!'.'!!FPL_PREFIX!!       ] @02A 99617589
*                          'DISCONNECT   = '!!FIELD_VALUE!!';';  ] @02A 99617598
*             ANS(TEMP_TEXT) SKIP COL(MACCOL+2) NORESCAN;        ] @02A 99617607
*                                                                ] @02A 99617616
*             TEMP_TEXT = FPL_STOR_NAME!!'.'!!FPL_PREFIX!!       ] @02A 99617625
*                          'OBTAIN_DSMASK = '!!FIELD_VALUE!!';'; ] @02A 99617634
*             ANS(TEMP_TEXT) SKIP COL(MACCOL+2) NORESCAN;        ] @02A 99617643
*                                                                ] @02A 99617652
*                                                                ] @03A 99617653
*             TEMP_TEXT = FPL_STOR_NAME!!'.'!!FPL_PREFIX!!       ] @03A 99617654
*                          'OBTAIN_SCMASK = '!!FIELD_VALUE!!';'; ] @03A 99617655
*             ANS(TEMP_TEXT) SKIP COL(MACCOL+2) NORESCAN;        ] @03A 99617656
*                                                                ] @03A 99617657
*             RETDAT   = 'NO';                                   ] @02A 99617661
*            End;                                                ] @02A 99617670
*                                                                ] @02A 99617689
*           OTHERWISE;                                                  99617700
*         END;                                                          99618000
*        End;                                                           99618300
*       Else                                                            99618600
*        Do;                                                            99618900
*         FIELD_VALUE = '''1''B';                                       99619200
*         SELECT(SERVICE(1));                                           99619500
*           WHEN('CONNECT') DO;                                         99619800
*             ANS(FPL_PTR!!FPL_PREFIX!!'CONNECT = '!!FIELD_VALUE!!';')  99620100
*                 SKIP COL(MACCOL+2) NORESCAN;                          99620400
*                                                                       99620700
*            FIELD_VALUE = '''0''B';                                    99621000
*                                                                       99621300
*          ANS(FPL_PTR!!FPL_PREFIX!!'CONNECT_UPDT = '!!FIELD_VALUE!!';')99621600
*                 SKIP COL(MACCOL+2) NORESCAN;                          99621900
*                                                                       99622200
*           ANS(FPL_PTR!!FPL_PREFIX!!'OBTAIN_DATA = '!!FIELD_VALUE!!';')99622500
*                 SKIP COL(MACCOL+2) NORESCAN;                          99622800
*                                                                       99623100
*         ANS(FPL_PTR!!FPL_PREFIX!!'OBTAIN_DSMASK = '!!FIELD_VALUE!!';')99623400
*                 SKIP COL(MACCOL+2) NORESCAN;                          99623700
*                                                                       99624000
*            ANS(FPL_PTR!!FPL_PREFIX!!'DISCONNECT = '!!FIELD_VALUE!!';')99624300
*                 SKIP COL(MACCOL+2) NORESCAN;                          99624600
*                                                                ] @02A 99624950
*     ANS(FPL_PTR!!FPL_PREFIX!!'OBTAIN_CFLS_DATA = '!!FIELD_VALUE!!';') 99625000
*                SKIP COL(MACCOL+2) NORESCAN;                    ] @02A 99625050
*                                                                ] @02A 99625100
*        ANS(FPL_PTR!!FPL_PREFIX!!'OBTAIN_SCMASK = '!!FIELD_VALUE!!';') 99625120
*                 SKIP COL(MACCOL+2) NORESCAN;                   ] @03A 99625140
*                                                                ] @03A 99625160
*            RETDAT='NO';                                               99625200
*            END;                                                       99625500
*           WHEN('CONNECTU') DO;                                        99625800
*          ANS(FPL_PTR!!FPL_PREFIX!!'CONNECT_UPDT = '!!FIELD_VALUE!!';')99626100
*                 SKIP COL(MACCOL+2) NORESCAN;                          99626400
*                                                                       99626700
*            FIELD_VALUE = '''0''B';                                    99627000
*                                                                       99627300
*          ANS(FPL_PTR!!FPL_PREFIX!!'CONNECT      = '!!FIELD_VALUE!!';')99627600
*                 SKIP COL(MACCOL+2) NORESCAN;                          99627900
*                                                                       99628200
*           ANS(FPL_PTR!!FPL_PREFIX!!'OBTAIN_DATA = '!!FIELD_VALUE!!';')99628500
*                 SKIP COL(MACCOL+2) NORESCAN;                          99628800
*                                                                       99629100
*         ANS(FPL_PTR!!FPL_PREFIX!!'OBTAIN_DSMASK = '!!FIELD_VALUE!!';')99629400
*                 SKIP COL(MACCOL+2) NORESCAN;                          99629700
*                                                                       99630000
*            ANS(FPL_PTR!!FPL_PREFIX!!'DISCONNECT = '!!FIELD_VALUE!!';')99630300
*                 SKIP COL(MACCOL+2) NORESCAN;                          99630600
*                                                                ] @02A 99630950
*     ANS(FPL_PTR!!FPL_PREFIX!!'OBTAIN_CFLS_DATA = '!!FIELD_VALUE!!';') 99631000
*                 SKIP COL(MACCOL+2) NORESCAN;                   ] @02A 99631050
*                                                                ] @02A 99631100
*        ANS(FPL_PTR!!FPL_PREFIX!!'OBTAIN_SCMASK = '!!FIELD_VALUE!!';') 99631120
*                 SKIP COL(MACCOL+2) NORESCAN;                   ] @03A 99631140
*                                                                ] @03A 99631160
*            RETDAT='YES';                                              99631200
*            END;                                                       99631500
*           WHEN('OBTDATA') DO;                                         99631800
*           ANS(FPL_PTR!!FPL_PREFIX!!'OBTAIN_DATA = '!!FIELD_VALUE!!';')99632100
*                 SKIP COL(MACCOL+2) NORESCAN;                          99632400
*                                                                       99632700
*            FIELD_VALUE = '''0''B';                                    99633000
*                                                                       99633300
*          ANS(FPL_PTR!!FPL_PREFIX!!'CONNECT_UPDT = '!!FIELD_VALUE!!';')99633600
*                 SKIP COL(MACCOL+2) NORESCAN;                          99633900
*                                                                       99634200
*           ANS(FPL_PTR!!FPL_PREFIX!!'CONNECT     = '!!FIELD_VALUE!!';')99634500
*                 SKIP COL(MACCOL+2) NORESCAN;                          99634800
*                                                                       99635100
*         ANS(FPL_PTR!!FPL_PREFIX!!'OBTAIN_DSMASK = '!!FIELD_VALUE!!';')99635400
*                 SKIP COL(MACCOL+2) NORESCAN;                          99635700
*                                                                       99636000
*            ANS(FPL_PTR!!FPL_PREFIX!!'DISCONNECT = '!!FIELD_VALUE!!';')99636300
*                 SKIP COL(MACCOL+2) NORESCAN;                          99636600
*                                                                ] @02A 99636950
*     ANS(FPL_PTR!!FPL_PREFIX!!'OBTAIN_CFLS_DATA = '!!FIELD_VALUE!!';') 99637000
*                 SKIP COL(MACCOL+2) NORESCAN;                   ] @02A 99637050
*                                                                ] @02A 99637100
*        ANS(FPL_PTR!!FPL_PREFIX!!'OBTAIN_SCMASK = '!!FIELD_VALUE!!';') 99637120
*                 SKIP COL(MACCOL+2) NORESCAN;                   ] @03A 99637140
*                                                                ] @03A 99637160
*            RETDAT='YES';                                              99637200
*            END;                                                       99637500
*           WHEN('OBTDSMSK') DO;                                        99637800
*         ANS(FPL_PTR!!FPL_PREFIX!!'OBTAIN_DSMASK = '!!FIELD_VALUE!!';')99638100
*                 SKIP COL(MACCOL+2) NORESCAN;                          99638400
*                                                                       99638700
*            FIELD_VALUE = '''0''B';                                    99639000
*                                                                       99639300
*          ANS(FPL_PTR!!FPL_PREFIX!!'CONNECT_UPDT = '!!FIELD_VALUE!!';')99639600
*                 SKIP COL(MACCOL+2) NORESCAN;                          99639900
*                                                                       99640200
*           ANS(FPL_PTR!!FPL_PREFIX!!'OBTAIN_DATA = '!!FIELD_VALUE!!';')99640500
*                 SKIP COL(MACCOL+2) NORESCAN;                          99640800
*                                                                       99641100
*         ANS(FPL_PTR!!FPL_PREFIX!!'CONNECT       = '!!FIELD_VALUE!!';')99641400
*                 SKIP COL(MACCOL+2) NORESCAN;                          99641700
*                                                                       99642000
*            ANS(FPL_PTR!!FPL_PREFIX!!'DISCONNECT = '!!FIELD_VALUE!!';')99642300
*                 SKIP COL(MACCOL+2) NORESCAN;                          99642600
*                                                                ] @02A 99642950
*     ANS(FPL_PTR!!FPL_PREFIX!!'OBTAIN_CFLS_DATA = '!!FIELD_VALUE!!';') 99643000
*                 SKIP COL(MACCOL+2) NORESCAN;                   ] @02A 99643050
*                                                                ] @02A 99643100
*        ANS(FPL_PTR!!FPL_PREFIX!!'OBTAIN_SCMASK = '!!FIELD_VALUE!!';') 99643120
*                 SKIP COL(MACCOL+2) NORESCAN;                   ] @03A 99643140
*                                                                ] @03A 99643160
*             RETDAT   = 'NO';                                          99643200
*             DSSPECD  = 'YES';                                         99643500
*            END;                                                       99643800
*           WHEN('OBTSCMSK') DO;                                 ] @03A 99643810
*        ANS(FPL_PTR!!FPL_PREFIX!!'OBTAIN_SCMASK = '!!FIELD_VALUE!!';') 99643820
*                 SKIP COL(MACCOL+2) NORESCAN;                   ] @03A 99643830
*                                                                ] @03A 99643840
*            FIELD_VALUE = '''0''B';                             ] @03A 99643850
*                                                                ] @03A 99643860
*         ANS(FPL_PTR!!FPL_PREFIX!!'CONNECT_UPDT = '!!FIELD_VALUE!!';') 99643870
*                 SKIP COL(MACCOL+2) NORESCAN;                   ] @03A 99643880
*                                                                ] @03A 99643890
*          ANS(FPL_PTR!!FPL_PREFIX!!'OBTAIN_DATA = '!!FIELD_VALUE!!';') 99643900
*                 SKIP COL(MACCOL+2) NORESCAN;                   ] @03A 99643910
*                                                                ] @03A 99643920
*        ANS(FPL_PTR!!FPL_PREFIX!!'CONNECT       = '!!FIELD_VALUE!!';') 99643930
*                 SKIP COL(MACCOL+2) NORESCAN;                   ] @03A 99643940
*                                                                ] @03A 99643950
*           ANS(FPL_PTR!!FPL_PREFIX!!'DISCONNECT = '!!FIELD_VALUE!!';') 99643960
*                 SKIP COL(MACCOL+2) NORESCAN;                   ] @03A 99643970
*                                                                ] @03A 99643980
*     ANS(FPL_PTR!!FPL_PREFIX!!'OBTAIN_CFLS_DATA = '!!FIELD_VALUE!!';') 99643990
*                 SKIP COL(MACCOL+2) NORESCAN;                   ] @03A 99644000
*                                                                ] @03A 99644010
*        ANS(FPL_PTR!!FPL_PREFIX!!'OBTAIN_DSMASK = '!!FIELD_VALUE!!';') 99644020
*                 SKIP COL(MACCOL+2) NORESCAN;                   ] @03A 99644030
*                                                                ] @03A 99644040
*             RETDAT   = 'NO';                                   ] @03A 99644050
*             DSSPECD  = 'YES';                                  ] @03A 99644060
*            END;                                                ] @03A 99644070
*           WHEN('DISCONN') DO;                                         99644100
*            ANS(FPL_PTR!!FPL_PREFIX!!'DISCONNECT = '!!FIELD_VALUE!!';')99644400
*                 SKIP COL(MACCOL+2) NORESCAN;                          99644700
*                                                                       99645000
*            FIELD_VALUE = '''0''B';                                    99645300
*                                                                       99645600
*          ANS(FPL_PTR!!FPL_PREFIX!!'CONNECT_UPDT = '!!FIELD_VALUE!!';')99645900
*                 SKIP COL(MACCOL+2) NORESCAN;                          99646200
*                                                                       99646500
*           ANS(FPL_PTR!!FPL_PREFIX!!'OBTAIN_DATA = '!!FIELD_VALUE!!';')99646800
*                 SKIP COL(MACCOL+2) NORESCAN;                          99647100
*                                                                       99647400
*         ANS(FPL_PTR!!FPL_PREFIX!!'OBTAIN_DSMASK = '!!FIELD_VALUE!!';')99647700
*                 SKIP COL(MACCOL+2) NORESCAN;                          99648000
*                                                                       99648300
*            ANS(FPL_PTR!!FPL_PREFIX!!'CONNECT    = '!!FIELD_VALUE!!';')99648600
*                 SKIP COL(MACCOL+2) NORESCAN;                          99648900
*                                                                ] @02A 99649250
*     ANS(FPL_PTR!!FPL_PREFIX!!'OBTAIN_CFLS_DATA = '!!FIELD_VALUE!!';') 99649300
*                 SKIP COL(MACCOL+2) NORESCAN;                   ] @02A 99649350
*                                                                ] @02A 99649400
*        ANS(FPL_PTR!!FPL_PREFIX!!'OBTAIN_SCMASK = '!!FIELD_VALUE!!';') 99649420
*                 SKIP COL(MACCOL+2) NORESCAN;                   ] @03A 99649440
*                                                                ] @03A 99649460
*             RETDAT='NO';                                              99649500
*             END;                                                      99649800
*           WHEN('OBTCFLSD') DO;                                 ] @02A 99649810
*     ANS(FPL_PTR!!FPL_PREFIX!!'OBTAIN_CFLS_DATA = '!!FIELD_VALUE!!';') 99649820
*                 SKIP COL(MACCOL+2) NORESCAN;                   ] @02A 99649830
*                                                                ] @02A 99649840
*            FIELD_VALUE = '''0''B';                             ] @02A 99649850
*                                                                ] @02A 99649860
*         ANS(FPL_PTR!!FPL_PREFIX!!'CONNECT_UPDT = '!!FIELD_VALUE!!';') 99649870
*                 SKIP COL(MACCOL+2) NORESCAN;                   ] @02A 99649880
*                                                                ] @02A 99649890
*          ANS(FPL_PTR!!FPL_PREFIX!!'OBTAIN_DATA = '!!FIELD_VALUE!!';') 99649900
*                 SKIP COL(MACCOL+2) NORESCAN;                   ] @02A 99649910
*                                                                ] @02A 99649920
*        ANS(FPL_PTR!!FPL_PREFIX!!'CONNECT       = '!!FIELD_VALUE!!';') 99649930
*                 SKIP COL(MACCOL+2) NORESCAN;                   ] @02A 99649940
*                                                                ] @02A 99649950
*           ANS(FPL_PTR!!FPL_PREFIX!!'DISCONNECT = '!!FIELD_VALUE!!';') 99649960
*                 SKIP COL(MACCOL+2) NORESCAN;                   ] @02A 99649970
*                                                                ] @02A 99649980
*        ANS(FPL_PTR!!FPL_PREFIX!!'OBTAIN_DSMASK = '!!FIELD_VALUE!!';') 99649990
*                 SKIP COL(MACCOL+2) NORESCAN;                   ] @02A 99650000
*        ANS(FPL_PTR!!FPL_PREFIX!!'OBTAIN_SCMASK = '!!FIELD_VALUE!!';') 99650003
*                 SKIP COL(MACCOL+2) NORESCAN;                   ] @03A 99650006
*                                                                ] @02A 99650010
*             RETDAT   = 'NO';                                   ] @02A 99650020
*           END;                                                 ] @02A 99650030
*                                                                ] @02A 99650040
*           OTHERWISE;                                                  99650100
*         END;                                                          99650400
*        End;                                                           99650700
*      END;                                                             99651000
*    END;                                                               99651300
*END;                                                                   99651600
*                                                                       99651900
*]                                                                      99652200
*]  HANDLE KEYWORD "SCOPE"                                              99652500
*]                                                                      99652800
*                                                                       99653100
*IF SERVICE(1) = 'CONNECT' THEN                                         99653400
* Do;                                                                   99653700
*  IF SCOPE = NULL THEN                                                 99654000
*   Do;                                                                 99654300
*    IF (MF1='L') ! (MF1='E') ! (MF1='B') THEN                          99654600
*     Do;                                                               99654900
*      FIELD_VALUE = '''1''B';                                          99655200
*      TEMP_TEXT = FPL_STOR_NAME!!'.'!!FPL_PREFIX!!                     99655500
*                   'GLOBAL      = '!!FIELD_VALUE!!';';                 99655800
*      ANS(TEMP_TEXT) SKIP COL(MACCOL+2) NORESCAN;                      99656100
*      FIELD_VALUE = '''0''B';                                          99656400
*      TEMP_TEXT = FPL_STOR_NAME!!'.'!!FPL_PREFIX!!                     99656700
*                   'LOCAL       = '!!FIELD_VALUE!!';';                 99657000
*      ANS(TEMP_TEXT) SKIP COL(MACCOL+2) NORESCAN;                      99657300
*      RETDAT='NO';                                                     99657600
*     End;                                                              99657900
*    Else                                                               99658200
*     Do;                                                               99658500
*      FIELD_VALUE = '''1''B';                                          99658800
*      ANS(FPL_PTR!!FPL_PREFIX!!'GLOBAL = '!!FIELD_VALUE!!';')          99659100
*               SKIP COL(MACCOL+2) NORESCAN;                            99659400
*      FIELD_VALUE = '''0''B';                                          99659700
*      ANS(FPL_PTR!!FPL_PREFIX!!'LOCAL  = '!!FIELD_VALUE!!';')          99660000
*               SKIP COL(MACCOL+2) NORESCAN;                            99660300
*      RETDAT='NO';                                                     99660600
*     End;                                                              99660900
*   End;                                                                99661200
*  ELSE DO;                                                             99661500
*      IF (NUMBER(SCOPE) ^= 1) THEN DO;                                 99661800
*        ANS SKIP COL(MACCOL) NORESCAN MESSAGE                          99662100
*          (MACNAME!!'-IGWSCM01E-SYNTAX ERROR: '!!                      99662400
*          'KEYWORD "SCOPE" '!!                                         99662700
*          'MUST HAVE EXACTLY ONE ARGUMENT.');                          99663000
*        IF MAC_RETCODE < 8 THEN MAC_RETCODE = 8;                       99663300
*      END;                                                             99663600
*      ELSE DO;                                                         99663900
*                                                                       99664200
*        IF ((SCOPE(1) ^= 'GLOBAL')   &                                 99664500
*            (SCOPE(1) ^= 'LOCAL'))   THEN                              99664800
*        DO;                                                            99665100
*          ANS SKIP COL(MACCOL) NORESCAN MESSAGE                        99665400
*            (MACNAME!!'-IGWSSF09E-SYNTAX ERROR: '!!                    99665700
*            'INVALID VALUE "'!!SCOPE(1)!!'" '!!                        99666000
*            'SPECIFIED FOR KEYWORD '!!                                 99666300
*            '"SCOPE"');                                                99666600
*          IF MAC_RETCODE < 8 THEN MAC_RETCODE = 8;                     99666900
*        END;                                                           99667200
*                                                                       99667500
*        ELSE                                                           99667800
*         Do;                                                           99668100
*          IF (MF1='L') ! (MF1='E') ! (MF1='B') THEN                    99668400
*           Do;                                                         99668700
*            FIELD_VALUE = '''1''B';                                    99669000
*            SELECT(SCOPE(1));                                          99669300
*              WHEN('GLOBAL')                                           99669600
*               Do;                                                     99669900
*                TEMP_TEXT = FPL_STOR_NAME!!'.'!!FPL_PREFIX!!           99670200
*                             'GLOBAL      = '!!FIELD_VALUE!!';';       99670500
*                ANS(TEMP_TEXT) SKIP COL(MACCOL+2) NORESCAN;            99670800
*                FIELD_VALUE = '''0''B';                                99671100
*                TEMP_TEXT = FPL_STOR_NAME!!'.'!!FPL_PREFIX!!           99671400
*                             'LOCAL       = '!!FIELD_VALUE!!';';       99671700
*                ANS(TEMP_TEXT) SKIP COL(MACCOL+2) NORESCAN;            99672000
*                RETDAT='NO';                                           99672300
*               End;                                                    99672600
*              WHEN('LOCAL')                                            99672900
*               Do;                                                     99673200
*                TEMP_TEXT = FPL_STOR_NAME!!'.'!!FPL_PREFIX!!           99673500
*                            'LOCAL       = '!!FIELD_VALUE!!';';        99673800
*                ANS(TEMP_TEXT) SKIP COL(MACCOL+2) NORESCAN;            99674100
*                FIELD_VALUE = '''0''B';                                99674400
*                TEMP_TEXT = FPL_STOR_NAME!!'.'!!FPL_PREFIX!!           99674700
*                            'GLOBAL      = '!!FIELD_VALUE!!';';        99675000
*                ANS(TEMP_TEXT) SKIP COL(MACCOL+2) NORESCAN;            99675300
*                RETDAT='NO';                                           99675600
*               End;                                                    99675900
*              OTHERWISE;                                               99676200
*            END;                                                       99676500
*           End;                                                        99676800
*          Else                                                         99677100
*           Do;                                                         99677400
*            FIELD_VALUE = '''1''B';                                    99677700
*            SELECT(SCOPE(1));                                          99678000
*              WHEN('GLOBAL') DO;                                       99678300
*                ANS(FPL_PTR!!FPL_PREFIX!!'GLOBAL = '!!FIELD_VALUE!!';')99678600
*                    SKIP COL(MACCOL+2) NORESCAN;                       99678900
*                FIELD_VALUE = '''0''B';                                99679200
*                ANS(FPL_PTR!!FPL_PREFIX!!'LOCAL  = '!!FIELD_VALUE!!';')99679500
*                    SKIP COL(MACCOL+2) NORESCAN;                       99679800
*               RETDAT='NO';                                            99680100
*               END;                                                    99680400
*              WHEN('LOCAL') DO;                                        99680700
*               ANS(FPL_PTR!!FPL_PREFIX!!'LOCAL = '!!FIELD_VALUE!!';')  99681000
*                   SKIP COL(MACCOL+2) NORESCAN;                        99681300
*               FIELD_VALUE = '''0''B';                                 99681600
*               ANS(FPL_PTR!!FPL_PREFIX!!'GLOBAL = '!!FIELD_VALUE!!';') 99681900
*                   SKIP COL(MACCOL+2) NORESCAN;                        99682200
*               RETDAT='NO';                                            99682500
*               END;                                                    99682800
*              OTHERWISE;                                               99683100
*            END;                                                       99683400
*           End;                                                        99683700
*         End;                                                          99684000
*     END;                                                              99684300
*  END;                                                                 99684600
* End;                                                                  99684900
*]                                                                      99685200
*]  HANDLE KEYWORD "CONTOKEN"                                           99685500
*]                                                                      99685800
*IF CONTOKEN = NULL THEN DO;                                            99686100
*   IF REQUIRED='YES' & (SERVICE(1) ^= 'OBTCFLSD') THEN DO;      ] @02C 99686490
*     TT = MACNAME!!'-IGWSCM03E-SYNTAX ERROR: '!!                       99686700
*         'KEYWORD "CONTOKEN" '!!REQ_MSG;                               99687000
*     ANS MESSAGE(TT)        SKIP COL(MACCOL) NORESCAN;                 99687300
*     ANS ('/* '!!TT!!' */') SKIP COL(MACCOL) NORESCAN;                 99687600
*     IF MAC_RETCODE < 8 THEN MAC_RETCODE = 8;                          99687900
*    END;                                                               99688200
* END;                                                                  99688500
*ELSE IF NUMBER(CONTOKEN) ^= 1 THEN DO;                                 99688800
*    TT = MACNAME!!'-IGWSCM01E-SYNTAX ERROR: '!!                        99689100
*        'KEYWORD "CONTOKEN" '!!                                        99689400
*        'MUST HAVE EXACTLY ONE ARGUMENT.';                             99689700
*    ANS MESSAGE(TT)        SKIP COL(MACCOL) NORESCAN;                  99690000
*    ANS ('/* '!!TT!!' */') SKIP COL(MACCOL) NORESCAN;                  99690300
*    IF MAC_RETCODE < 8 THEN MAC_RETCODE = 8;                           99690600
*  END;                                                                 99690900
*Else                                                                   99691200
* Do;                                                                   99691500
*  If SERVICE(1) ^= 'OBTCFLSD' THEN                              ] @02A 99691990
*   Do;                                                          ] @02A 99692180
*     IF SERVICE(1) ^= 'CONNECT' THEN                                   99692370
*      Do;                                                              99692560
*       FIELD_VALUE = CONTOKEN(1);                                      99692750
*       IF (MF1='L') ! (MF1='E') ! (MF1='B') THEN                       99692940
*        Do;                                                            99693130
*         TEMP_TEXT = FPL_STOR_NAME!!'.'!!FPL_PREFIX!!                  99693320
*                    'CONNECT_TOKEN = '!!FIELD_VALUE!!';';              99693510
*         ANS(TEMP_TEXT) SKIP COL(MACCOL+2) NORESCAN;                   99693700
*        End;                                                           99693890
*       Else                                                            99694080
*        Do;                                                            99694270
*         TEMP_TEXT = FPL_PTR!!FPL_PREFIX!!'CONNECT_TOKEN = '!!         99694460
*           FIELD_VALUE!!';';                                           99694650
*         ANS(TEMP_TEXT) SKIP COL(MACCOL+2) NORESCAN;                   99694840
*        End;                                                           99695030
*      End;                                                             99695220
*     ELSE                                                              99695410
*      Do;                                                              99695600
*       FIELD_VALUE = '''0''B';                                         99695790
*       IF (MF1='L') ! (MF1='E') ! (MF1='B') THEN                       99695980
*        Do;                                                            99696170
*         TEMP_TEXT = FPL_STOR_NAME!!'.'!!FPL_PREFIX!!                  99696360
*                    'CONNECT_TOKEN = '!!FIELD_VALUE!!';';              99696550
*         ANS(TEMP_TEXT) SKIP COL(MACCOL+2) NORESCAN;                   99696740
*        End;                                                           99696930
*       Else                                                            99697120
*        Do;                                                            99697310
*         TEMP_TEXT = FPL_PTR!!FPL_PREFIX!!'CONNECT_TOKEN = '!!         99697500
*           FIELD_VALUE!!';';                                           99697690
*         ANS(TEMP_TEXT) SKIP COL(MACCOL+2) NORESCAN;                   99697880
*        End;                                                           99698070
*      End;                                                             99698260
*   End;                                                         ] @02A 99698450
*  ELSE                                                          ] @02A 99698640
*   Do;                                                          ] @02A 99698830
*     TT = MACNAME!!'-IGWSCM03E-SYNTAX ERROR: '!!                ] @02A 99699020
*         'KEYWORD "CONTOKEN" '!!NOTREQ_MSG;                     ] @02A 99699210
*     ANS MESSAGE(TT)        SKIP COL(MACCOL) NORESCAN;          ] @02A 99699400
*     ANS ('/* '!!TT!!' */') SKIP COL(MACCOL) NORESCAN;          ] @02A 99699590
*     IF MAC_RETCODE < 8 THEN MAC_RETCODE = 8;                   ] @02A 99699780
*   End;                                                         ] @02A 99699970
* End;                                                                  99701400
*]                                                                      99701700
*]  HANDLE KEYWORD "DATATYPE"                                           99702000
*]                                                                      99702300
*IF DATATYPE = NULL THEN DO;                                            99702600
*   IF REQUIRED='YES' THEN DO;                                          99702900
*     IF SERVICE(1)='CONNECTU' THEN DO;                                 99703200
*     TT = MACNAME!!'-IGWSCM03E-SYNTAX ERROR: '!!                       99703500
*         'KEYWORD "DATATYPE" '!!REQ_MSG;                               99703800
*     ANS MESSAGE(TT)        SKIP COL(MACCOL) NORESCAN;                 99704100
*     ANS ('/* '!!TT!!' */') SKIP COL(MACCOL) NORESCAN;                 99704400
*     IF MAC_RETCODE < 8 THEN MAC_RETCODE = 8;                          99704700
*     END;                                                              99705000
*   END;                                                                99705300
*END;                                                                   99705600
*ELSE IF ((SERVICE(1)='CONNECTU')!(SERVICE(1)='CONNECT')) THEN DO;      99705900
*    IF (NUMBER(DATATYPE) = 0) THEN DO;                                 99706200
*      ANS SKIP COL(MACCOL) NORESCAN MESSAGE                            99706500
*        (MACNAME!!'-IGWSCM11E-SYNTAX ERROR: '!!                        99706800
*        'KEYWORD "DATATYPE" MUST HAVE AT LEAST 1 ARGUMENT(S).');       99707100
*      IF MAC_RETCODE < 8 THEN MAC_RETCODE = 8;                         99707400
*    END;                                                               99707700
*    ELSE IF (NUMBER(DATATYPE) > 6) THEN DO;                            99708000
*      ANS SKIP COL(MACCOL) NORESCAN MESSAGE                            99708300
*        (MACNAME!!'-IGWSCM10E-SYNTAX ERROR: '!!                        99708600
*        'KEYWORD "DATATYPE" MUST HAVE NO MORE THAN 6 ARGUMENTS.');     99708900
*      IF MAC_RETCODE < 8 THEN MAC_RETCODE = 8;                         99709200
*    END;                                                               99709500
*    ELSE                                                               99709800
*     Do;                                                               99710100
*      IF (MF1='L') ! (MF1='E') ! (MF1='B') THEN                        99710400
*       Do;                                                             99710700
*         FIELD_VALUE = '''0''B';                                       99711000
*         TEMP_TEXT = FPL_STOR_NAME!!'.'!!FPL_PREFIX!!                  99711300
*                         'DATATYPES   = '!!FIELD_VALUE!!';';           99711600
*         ANS(TEMP_TEXT) SKIP COL(MACCOL+2) NORESCAN;                   99711900
*       End;                                                            99712200
*      Else                                                             99712500
*       Do;                                                             99712800
*         FIELD_VALUE = '''0''B';                                       99713100
*         ANS(FPL_PTR!!FPL_PREFIX!!'DATATYPES = '!!FIELD_VALUE!!';')    99713400
*               SKIP COL(MACCOL+2) NORESCAN;                            99713700
*       End;                                                            99714000
*      DO M_I = 1 TO NUMBER(DATATYPE);                                  99714300
*       IF (MF1='L') ! (MF1='E') ! (MF1='B') THEN                       99714600
*        Do;                                                            99714900
*         FIELD_VALUE = '''1''B';                                       99715200
*         SELECT(DATATYPE(M_I));                                        99715500
*           WHEN('SMF42ST15')                                           99715800
*            Do;                                                        99716100
*             TEMP_TEXT = FPL_STOR_NAME!!'.'!!FPL_PREFIX!!              99716400
*                          'SMF42ST15   = '!!FIELD_VALUE!!';';          99716700
*             ANS(TEMP_TEXT) SKIP COL(MACCOL+2) NORESCAN;               99717000
*            End;                                                       99717300
*           WHEN('SMF42ST16')                                           99717600
*            Do;                                                        99717900
*             TEMP_TEXT = FPL_STOR_NAME!!'.'!!FPL_PREFIX!!              99718200
*                          'SMF42ST16   = '!!FIELD_VALUE!!';';          99718500
*             ANS(TEMP_TEXT) SKIP COL(MACCOL+2) NORESCAN;               99718800
*             DSSPECD = 'YES';                                          99719100
*            END;                                                       99719400
*           WHEN('SMF42ST17')                                           99719700
*            Do;                                                        99720000
*             TEMP_TEXT = FPL_STOR_NAME!!'.'!!FPL_PREFIX!!              99720300
*                          'SMF42ST17   = '!!FIELD_VALUE!!';';          99720600
*             ANS(TEMP_TEXT) SKIP COL(MACCOL+2) NORESCAN;               99720900
*            End;                                                       99721200
*           WHEN('SMF42ST18')                                           99721500
*            Do;                                                        99721800
*             TEMP_TEXT = FPL_STOR_NAME!!'.'!!FPL_PREFIX!!              99722100
*                          'SMF42ST18   = '!!FIELD_VALUE!!';';          99722400
*             ANS(TEMP_TEXT) SKIP COL(MACCOL+2) NORESCAN;               99722700
*            End;                                                       99723000
*           WHEN('SMF42ST19')                                           99723300
*            Do;                                                        99723600
*             TEMP_TEXT = FPL_STOR_NAME!!'.'!!FPL_PREFIX!!              99723900
*                          'SMF42ST19   = '!!FIELD_VALUE!!';';          99724200
*             ANS(TEMP_TEXT) SKIP COL(MACCOL+2) NORESCAN;               99724500
*            End;                                                       99724800
*           WHEN('SMF64')                                               99725100
*            Do;                                                        99725400
*             TEMP_TEXT = FPL_STOR_NAME!!'.'!!FPL_PREFIX!!              99725700
*                          'SMF64       = '!!FIELD_VALUE!!';';          99726000
*             ANS(TEMP_TEXT) SKIP COL(MACCOL+2) NORESCAN;               99726300
*            End;                                                       99726600
*           WHEN('VSAMDATA1')                                           99726900
*            Do;                                                        99727200
*             TEMP_TEXT = FPL_STOR_NAME!!'.'!!FPL_PREFIX!!              99727500
*                          'VSAMDATA1   = '!!FIELD_VALUE!!';';          99727800
*             ANS(TEMP_TEXT) SKIP COL(MACCOL+2) NORESCAN;               99728100
*            End;                                                       99728400
*           WHEN('VSAMDATA2')                                           99728700
*            Do;                                                        99729000
*             TEMP_TEXT = FPL_STOR_NAME!!'.'!!FPL_PREFIX!!              99729300
*                          'VSAMDATA2   = '!!FIELD_VALUE!!';';          99729600
*             ANS(TEMP_TEXT) SKIP COL(MACCOL+2) NORESCAN;               99729900
*            End;                                                       99730200
*           OTHERWISE                                                   99730500
*            Do;                                                        99730800
*              ANS SKIP COL(MACCOL) NORESCAN MESSAGE                    99731100
*                (MACNAME!!'-IGWSSF09E-SYNTAX ERROR: '!!                99731400
*                'INVALID VALUE "'!!DATATYPE(M_I)!!'" '!!               99731700
*                'SPECIFIED FOR KEYWORD '!!                             99732000
*                '"DATATYPE"');                                         99732300
*              IF MAC_RETCODE < 8 THEN MAC_RETCODE = 8;                 99732600
*            END;                                                       99732900
*         END;                                                          99733200
*        End;                                                           99733500
*       Else                                                            99733800
*        Do;                                                            99734100
*         FIELD_VALUE = '''1''B';                                       99734400
*         SELECT(DATATYPE(M_I));                                        99734700
*           WHEN('SMF42ST15')                                           99735000
*             ANS(FPL_PTR!!FPL_PREFIX!!'SMF42ST15 = '!!FIELD_VALUE!!';')99735300
*                 SKIP COL(MACCOL+2) NORESCAN;                          99735600
*           WHEN('SMF42ST16') DO;                                       99735900
*             ANS(FPL_PTR!!FPL_PREFIX!!'SMF42ST16 = '!!FIELD_VALUE!!';')99736200
*                 SKIP COL(MACCOL+2) NORESCAN;                          99736500
*             DSSPECD = 'YES';                                          99736800
*             END;                                                      99737100
*           WHEN('SMF42ST17')                                           99737400
*             ANS(FPL_PTR!!FPL_PREFIX!!'SMF42ST17 = '!!FIELD_VALUE!!';')99737700
*                 SKIP COL(MACCOL+2) NORESCAN;                          99738000
*           WHEN('SMF42ST18')                                           99738300
*             ANS(FPL_PTR!!FPL_PREFIX!!'SMF42ST18 = '!!FIELD_VALUE!!';')99738600
*                 SKIP COL(MACCOL+2) NORESCAN;                          99738900
*           WHEN('SMF42ST19')                                           99739200
*             ANS(FPL_PTR!!FPL_PREFIX!!'SMF42ST19 = '!!FIELD_VALUE!!';')99739500
*                 SKIP COL(MACCOL+2) NORESCAN;                          99739800
*           WHEN('SMF64')                                               99740100
*             ANS(FPL_PTR!!FPL_PREFIX!!'SMF64 = '!!FIELD_VALUE!!';')    99740400
*                 SKIP COL(MACCOL+2) NORESCAN;                          99740700
*           WHEN('VSAMDATA1')                                           99741000
*             ANS(FPL_PTR!!FPL_PREFIX!!'VSAMDATA1 = '!!FIELD_VALUE!!';')99741300
*                 SKIP COL(MACCOL+2) NORESCAN;                          99741600
*           WHEN('VSAMDATA2')                                           99741900
*             ANS(FPL_PTR!!FPL_PREFIX!!'VSAMDATA2 = '!!FIELD_VALUE!!';')99742200
*                 SKIP COL(MACCOL+2) NORESCAN;                          99742500
*           OTHERWISE DO;                                               99742800
*               ANS SKIP COL(MACCOL) NORESCAN MESSAGE                   99743100
*                 (MACNAME!!'-IGWSSF09E-SYNTAX ERROR: '!!               99743400
*                 'INVALID VALUE "'!!DATATYPE(M_I)!!'" '!!              99743700
*                 'SPECIFIED FOR KEYWORD '!!                            99744000
*                 '"DATATYPE"');                                        99744300
*               IF MAC_RETCODE < 8 THEN MAC_RETCODE = 8;                99744600
*             END;                                                      99744900
*         END;                                                          99745200
*        End;                                                           99745500
*      END;                                                             99745800
*     End;                                                              99746100
*END;                                                                   99746400
*]                                                                      99746700
*]  HANDLE KEYWORD "DSMSKBL"                                            99747000
*]                                                                      99747300
*IF DSMSKBLP ^= NULL  & DSSPECD = 'NO' THEN                             99747600
* Do;                                                                   99747900
*  TT = MACNAME!!'-IGWSCM03E-SYNTAX ERROR: '!!                          99748200
*      'KEYWORD "DSMSKBLP" '!!NOT_ALLOWED_MSG;                          99748500
*     ANS MESSAGE(TT)        SKIP COL(MACCOL) NORESCAN;                 99748800
*     ANS ('/* '!!TT!!' */') SKIP COL(MACCOL) NORESCAN;                 99749100
*     IF MAC_RETCODE < 8 THEN MAC_RETCODE = 8;                          99749400
*End;                                                                   99749700
*ELSE IF DSMSKBLP = NULL THEN DO;                                       99750000
*   IF REQUIRED='YES' THEN DO;                                          99750300
*     IF ((SERVICE(1)='OBTDSMSK') !                            ]@03C    99750690
*      ((DSSPECD = 'YES') & (SCMSKBLP = NULL)))                ]@03A    99750780
*     THEN DO;                                                          99750900
*     TT = MACNAME!!'-IGWSCM03E-SYNTAX ERROR: '!!                       99751200
*         'KEYWORD "DSMSKBLP" '!!REQ_MSG;                               99751500
*     ANS MESSAGE(TT)        SKIP COL(MACCOL) NORESCAN;                 99751800
*     ANS ('/* '!!TT!!' */') SKIP COL(MACCOL) NORESCAN;                 99752100
*     IF MAC_RETCODE < 8 THEN MAC_RETCODE = 8;                          99752400
*     END;                                                              99752700
*   END;                                                                99753000
*END;                                                                   99753300
*ELSE IF ((SERVICE(1) = 'OBTDSMSK')!(DSSPECD = 'YES'))                  99753600
*  THEN DO;                                                             99753900
*    IF (NUMBER(DSMSKBLP) ^= 1) THEN DO;                                99754200
*      ANS SKIP COL(MACCOL) NORESCAN MESSAGE                            99754500
*        (MACNAME!!'-IGWSCM01E-SYNTAX ERROR: '!!                        99754800
*        'KEYWORD "DSMSKBLP" MUST HAVE EXACTLY 1 ARGUMENT.');           99755100
*      IF MAC_RETCODE < 8 THEN MAC_RETCODE = 8;                         99755400
*    END;                                                               99755700
*  Else                                                                 99756000
*    Do;                                                                99756300
*     FIELD_VALUE = DSMSKBLP(1);                                        99756600
*     IF (MF1='L') ! (MF1='E') ! (MF1='B') THEN                         99756900
*      Do;                                                              99757200
*       TEMP_TEXT = FPL_STOR_NAME!!'.'!!FPL_PREFIX!!                    99757500
*                    'DSMSKBL@      = '!!FIELD_VALUE!!';';              99757800
*       ANS(TEMP_TEXT) SKIP COL(MACCOL+2) NORESCAN;                     99758100
*      End;                                                             99758400
*     Else                                                              99758700
*      Do;                                                              99759000
*       TEMP_TEXT = FPL_PTR!!FPL_PREFIX!!'DSMSKBL@      = '!!           99759300
*         FIELD_VALUE!!';';                                             99759600
*       ANS(TEMP_TEXT) SKIP COL(MACCOL+2) NORESCAN;                     99759900
*      End;                                                             99760200
*    End;                                                               99760500
*END;                                                                   99760800
*]                                                               ]@03A  99760806
*]  HANDLE KEYWORD "SCMSKBL"                                     ]@03A  99760812
*]                                                               ]@03A  99760818
*IF SCMSKBLP ^= NULL & DSSPECD = 'NO' THEN                       ]@03A  99760824
* Do;                                                            ]@03A  99760830
*  TT = MACNAME!!'-IGWSCM03E-SYNTAX ERROR: '!!                   ]@03A  99760836
*      'KEYWORD "SCMSKBLP" '!!NOT_ALLOWED_MSG;                   ]@03A  99760842
*     ANS MESSAGE(TT)        SKIP COL(MACCOL) NORESCAN;          ]@03A  99760848
*     ANS ('/* '!!TT!!' */') SKIP COL(MACCOL) NORESCAN;          ]@03A  99760854
*     IF MAC_RETCODE < 8 THEN MAC_RETCODE = 8;                   ]@03A  99760860
*End;                                                            ]@03A  99760866
*ELSE IF SCMSKBLP = NULL THEN DO;                                ]@03A  99760872
*   IF REQUIRED='YES' THEN DO;                                   ]@03A  99760878
*     IF ((SERVICE(1)='OBTSCMSK') !                              ]@03A  99760884
*      ((DSSPECD = 'YES') & (DSMSKBLP = NULL)))                  ]@03A  99760890
*     THEN DO;                                                   ]@03A  99760896
*     TT = MACNAME!!'-IGWSCM03E-SYNTAX ERROR: '!!                ]@03A  99760902
*         'KEYWORD "SCMSKBLP" '!!REQ_MSG;                        ]@03A  99760908
*     ANS MESSAGE(TT)        SKIP COL(MACCOL) NORESCAN;          ]@03A  99760914
*     ANS ('/* '!!TT!!' */') SKIP COL(MACCOL) NORESCAN;          ]@03A  99760920
*     IF MAC_RETCODE < 8 THEN MAC_RETCODE = 8;                   ]@03A  99760926
*     END;                                                       ]@03A  99760932
*   END;                                                         ]@03A  99760938
*END;                                                            ]@03A  99760944
*ELSE IF ((SERVICE(1) = 'OBTSCMSK')!(DSSPECD = 'YES'))           ]@03A  99760950
*  THEN DO;                                                      ]@03A  99760956
*    IF (NUMBER(SCMSKBLP) ^= 1) THEN DO;                         ]@03A  99760962
*      ANS SKIP COL(MACCOL) NORESCAN MESSAGE                     ]@03A  99760968
*        (MACNAME!!'-IGWSCM01E-SYNTAX ERROR: '!!                 ]@03A  99760974
*        'KEYWORD "SCMSKBLP" MUST HAVE EXACTLY 1 ARGUMENT.');    ]@03A  99760980
*      IF MAC_RETCODE < 8 THEN MAC_RETCODE = 8;                  ]@03A  99760986
*    END;                                                        ]@03A  99760992
*  Else                                                          ]@03A  99760998
*    Do;                                                         ]@03A  99761004
*     FIELD_VALUE = SCMSKBLP(1);                                 ]@03A  99761010
*     IF (MF1='L') ! (MF1='E') ! (MF1='B') THEN                  ]@03A  99761016
*      Do;                                                       ]@03A  99761022
*       TEMP_TEXT = FPL_STOR_NAME!!'.'!!FPL_PREFIX!!             ]@03A  99761028
*                    'SCMSKBL@      = '!!FIELD_VALUE!!';';       ]@03A  99761034
*       ANS(TEMP_TEXT) SKIP COL(MACCOL+2) NORESCAN;              ]@03A  99761040
*      End;                                                      ]@03A  99761046
*     Else                                                       ]@03A  99761052
*      Do;                                                       ]@03A  99761058
*       TEMP_TEXT = FPL_PTR!!FPL_PREFIX!!'SCMSKBL@      = '!!    ]@03A  99761064
*         FIELD_VALUE!!';';                                      ]@03A  99761070
*       ANS(TEMP_TEXT) SKIP COL(MACCOL+2) NORESCAN;              ]@03A  99761076
*      End;                                                      ]@03A  99761082
*    End;                                                        ]@03A  99761088
*END;                                                            ]@03A  99761094
*]                                                                      99761100
*]  HANDLE KEYWORD "ERRDATA"                                            99761400
*]                                                                      99761700
*IF (MF1 ^= 'L') THEN                                                   99762000
* Do;                                                                   99762300
*  IF ERRDATA = NULL THEN                                               99762600
*   Do;                                                                 99762900
*     TT = MACNAME!!'-IGWSCM03E-SYNTAX ERROR: '!!                       99763200
*         'KEYWORD "ERRDATA" '!!REQ_MSG;                                99763500
*     ANS MESSAGE(TT)        SKIP COL(MACCOL) NORESCAN;                 99763800
*     ANS ('/* '!!TT!!' */') SKIP COL(MACCOL) NORESCAN;                 99764100
*     IF MAC_RETCODE < 8 THEN MAC_RETCODE = 8;                          99764400
*   End;                                                                99764700
*  Else                                                                 99765000
*   DO;                                                                 99765300
*    IF (NUMBER(ERRDATA) ^= 1) THEN                                     99765600
*     Do;                                                               99765900
*      ANS SKIP COL(MACCOL) NORESCAN MESSAGE                            99766200
*        (MACNAME!!'-IGWSCM01E-SYNTAX ERROR: '!!                        99766500
*        'KEYWORD "ERRDATAP" MUST HAVE EXACTLY 1 ARGUMENT.');           99766800
*      IF MAC_RETCODE < 8 THEN MAC_RETCODE = 8;                         99767100
*     End;                                                              99767400
*    ELSE                                                               99767700
*     Do;                                                               99768000
*      FIELD_VALUE = ERRDATA(1);                                        99768300
*                                                                       99768600
*      IF (MF1='L') ! (MF1='E') ! (MF1='B') THEN                        99768900
*       Do;                                                             99769200
*        TEMP_TEXT = FPL_STOR_NAME!!'.'!!FPL_PREFIX!!                   99769500
*                     'ERRDATA@    = '!!FIELD_VALUE!!';';               99769800
*        ANS(TEMP_TEXT) SKIP COL(MACCOL+2) NORESCAN;                    99770100
*       End;                                                            99770400
*      Else                                                             99770700
*       Do;                                                             99771000
*        TEMP_TEXT = FPL_PTR!!FPL_PREFIX!!'ERRDATA@ = '!!               99771300
*          FIELD_VALUE!!';';                                            99771600
*        ANS(TEMP_TEXT) SKIP COL(MACCOL+2) NORESCAN;                    99771900
*       End;                                                            99772200
*                                                                       99772500
*      BlockAnswer Page Column(MacCol+2) ReScan;                        99772800
*      ' Dcl Area_'!!Uni_num!!' char(256)                            '!!99773100
*      '              based(FIELD_VALUE);                            '  99773400
*      '  Area_'!!Uni_num!!'  =                                      '!!99773700
*      '  Area_'!!Uni_num!!'  &&                                     '!!99774000
*      '  Area_'!!Uni_num!!';                                        '  99774300
*      EndAnswer;                                                       99774600
*                                                                       99774900
*     End;                                                              99775200
*   End;                                                                99775500
* End;                                                                  99775800
*]                                                                      99776100
*]  HANDLE KEYWORDS "UPDATE"                                            99776400
*]                                                                      99776700
*IF SERVICE(1)='CONNECTU' THEN DO;                                      99777000
*  IF (UPDATE=NULL) THEN DO;                                            99777300
*   IF REQUIRED='YES' THEN DO;                                          99777600
*     TT = MACNAME!!'-IGWSCM14E-SYNTAX ERROR: '!!                       99777900
*     'KEYWORD "UPDATE" IS NOT SPECIFIED '!!                            99778200
*     'IN THE MACRO STATEMENT';                                         99778500
*     ANS MESSAGE(TT)        SKIP COL(MACCOL) NORESCAN;                 99778800
*     ANS ('/* '!!TT!!' */') SKIP COL(MACCOL) NORESCAN;                 99779100
*     IF MAC_RETCODE < 8 THEN MAC_RETCODE = 8;                          99779400
*     END;                                                              99779700
*   END;                                                                99780000
*  ELSE IF NUMBER(UPDATE) ^= 1 THEN DO;                                 99780300
*    TT = MACNAME!!'-IGWSCM01E-SYNTAX ERROR: '!!                        99780600
*        'KEYWORD "UPDATE" '!!                                          99780900
*        'MUST HAVE EXACTLY ONE ARGUMENT.';                             99781200
*    ANS MESSAGE(TT)    SKIP COL(MACCOL) NORESCAN;                      99781500
*    ANS ('/* '!!TT!!' */') SKIP COL(MACCOL) NORESCAN;                  99781800
*    IF MAC_RETCODE < 8 THEN MAC_RETCODE = 8;                           99782100
*    END;                                                               99782400
*  ]                                                                    99782700
*  ]  HANDLE KEYWORD "ADD"                                              99783000
*  ]                                                                    99783300
*  ELSE IF (UPDATE(1) = 'ADD') THEN                                     99783600
*   Do;                                                                 99783900
*    FIELD_VALUE = '''1''B';                                            99784200
*    IF (MF1='L') ! (MF1='E') ! (MF1='B') THEN                          99784500
*     Do;                                                               99784800
*      TEMP_TEXT = FPL_STOR_NAME!!'.'!!FPL_PREFIX!!                     99785100
*                   'ADD         = '!!FIELD_VALUE!!';';                 99785400
*      ANS(TEMP_TEXT) SKIP COL(MACCOL+2) NORESCAN;                      99785700
*      FIELD_VALUE = '''0''B';                                          99786000
*      TEMP_TEXT = FPL_STOR_NAME!!'.'!!FPL_PREFIX!!                     99786300
*                   'DELETE      = '!!FIELD_VALUE!!';';                 99786600
*      ANS(TEMP_TEXT) SKIP COL(MACCOL+2) NORESCAN;                      99786900
*     End;                                                              99787200
*    Else                                                               99787500
*     Do;                                                               99787800
*      ANS(FPL_PTR!!FPL_PREFIX!!'ADD = '!!FIELD_VALUE!!';')             99788100
*      SKIP COL(MACCOL+2) NORESCAN;                                     99788400
*      FIELD_VALUE = '''0''B';                                          99788700
*      ANS(FPL_PTR!!FPL_PREFIX!!'DELETE = '!!FIELD_VALUE!!';')          99789000
*      SKIP COL(MACCOL+2) NORESCAN;                                     99789300
*     End;                                                              99789600
*   End;                                                                99789900
*  ]                                                                    99790200
*  ]  HANDLE KEYWORD "DELETE"                                           99790500
*  ]                                                                    99790800
*  ELSE IF (UPDATE(1) = 'DELETE') THEN                                  99791100
*   Do;                                                                 99791400
*    FIELD_VALUE = '''1''B';                                            99791700
*    IF (MF1='L') ! (MF1='E') ! (MF1='B') THEN                          99792000
*     Do;                                                               99792300
*      TEMP_TEXT = FPL_STOR_NAME!!'.'!!FPL_PREFIX!!                     99792600
*                   'DELETE      = '!!FIELD_VALUE!!';';                 99792900
*      ANS(TEMP_TEXT) SKIP COL(MACCOL+2) NORESCAN;                      99793200
*      FIELD_VALUE = '''0''B';                                          99793500
*      TEMP_TEXT = FPL_STOR_NAME!!'.'!!FPL_PREFIX!!                     99793800
*                   'ADD         = '!!FIELD_VALUE!!';';                 99794100
*      ANS(TEMP_TEXT) SKIP COL(MACCOL+2) NORESCAN;                      99794400
*     End;                                                              99794700
*    Else                                                               99795000
*     Do;                                                               99795300
*      ANS(FPL_PTR!!FPL_PREFIX!!'DELETE = '!!FIELD_VALUE!!';')          99795600
*      SKIP COL(MACCOL+2) NORESCAN;                                     99795900
*      FIELD_VALUE = '''0''B';                                          99796200
*      ANS(FPL_PTR!!FPL_PREFIX!!'ADD    = '!!FIELD_VALUE!!';')          99796500
*      SKIP COL(MACCOL+2) NORESCAN;                                     99796800
*     End;                                                              99797100
*   END;                                                                99797400
*  ELSE DO;                                                             99797700
*      ANS SKIP COL(MACCOL) NORESCAN MESSAGE                            99798000
*        (MACNAME!!'-IGWSSF09E-SYNTAX ERROR: '!!                        99798300
*        'INVALID VALUE "'!!UPDATE(1)!!'" '!!                           99798600
*        'SPECIFIED FOR KEYWORD '!!                                     99798900
*        '"UPDATE"');                                                   99799200
*      IF MAC_RETCODE < 8 THEN MAC_RETCODE = 8;                         99799500
*    END;                                                               99799800
*END;                                                                   99800100
*]                                                                      99800400
*]  HANDLE KEYWORD "STORREQD"                                           99800700
*]                                                                      99801000
*IF RETDAT='YES' THEN DO;                                               99801300
*  IF STORREQD = NULL THEN DO;                                          99801600
*    IF REQUIRED='YES' THEN DO;                                         99801900
*     TT = MACNAME!!'-IGWSCM03E-SYNTAX ERROR: '!!                       99802200
*         'KEYWORD "STORREQD" '!!REQ_MSG;                               99802500
*     ANS MESSAGE(TT)        SKIP COL(MACCOL) NORESCAN;                 99802800
*     ANS ('/* '!!TT!!' */') SKIP COL(MACCOL) NORESCAN;                 99803100
*     IF MAC_RETCODE < 8 THEN MAC_RETCODE = 8;                          99803400
*    END;                                                               99803700
*  END;                                                                 99804000
*  ELSE IF NUMBER(STORREQD) ^= 1 THEN DO;                               99804300
*    TT = MACNAME!!'-IGWSCM01E-SYNTAX ERROR: '!!                        99804600
*        'KEYWORD "STORREQD" '!!                                        99804900
*        'MUST HAVE EXACTLY ONE ARGUMENT.';                             99805200
*    ANS MESSAGE(TT)    SKIP COL(MACCOL) NORESCAN;                      99805500
*    ANS ('/* '!!TT!!' */') SKIP COL(MACCOL) NORESCAN;                  99805800
*    IF MAC_RETCODE < 8 THEN MAC_RETCODE = 8;                           99806100
*    END;                                                               99806400
*  ELSE DO;  /* OUTPUT field.  Nothing to do here.  */                  99806700
*  END;                                                                 99807000
*END;                                                                   99807300
*]                                                                      99807600
*]  HANDLE KEYWORD "REQTYPE"                                            99807900
*]                                                                      99808200
*IF SERVICE(1)='OBTDATA' THEN                                           99808500
* Do;                                                                   99808800
*  FIELD_VALUE = '''1''B';                                              99809100
*  IF REQTYPE = NULL THEN DO;                                           99809400
*    TEMP_TEXT = FPL_PTR!!FPL_PREFIX!!'REQUEST_NEW = '!!                99809700
*      FIELD_VALUE!!';';                                                99810000
*    ANS(TEMP_TEXT) SKIP COL(MACCOL+2) NORESCAN;                        99810300
*    FIELD_VALUE = '''0''B';                                            99810600
*    TEMP_TEXT = FPL_PTR!!FPL_PREFIX!!'REQUEST_CONT = '!!               99810900
*      FIELD_VALUE!!';';                                                99811200
*    ANS(TEMP_TEXT) SKIP COL(MACCOL+2) NORESCAN;                        99811500
*  END;                                                                 99811800
*  ELSE IF NUMBER(REQTYPE) ^= 1 THEN DO;                                99812100
*    TT = MACNAME!!'-IGWSCM01E-SYNTAX ERROR: '!!                        99812400
*        'KEYWORD "REQTYPE" '!!                                         99812700
*        'MUST HAVE EXACTLY ONE ARGUMENT.';                             99813000
*    ANS MESSAGE(TT)        SKIP COL(MACCOL) NORESCAN;                  99813300
*    ANS ('/* '!!TT!!' */') SKIP COL(MACCOL) NORESCAN;                  99813600
*    IF MAC_RETCODE < 8 THEN MAC_RETCODE = 8;                           99813900
*  END;                                                                 99814200
*  ELSE IF (REQTYPE(1) = 'NEW') THEN                                    99814500
*   do;                                                                 99814800
*    IF (MF1='L') ! (MF1='E') ! (MF1='B') THEN                          99815100
*     Do;                                                               99815400
*      TEMP_TEXT = FPL_STOR_NAME!!'.'!!FPL_PREFIX!!                     99815700
*                   'REQUEST_NEW = '!!FIELD_VALUE!!';';                 99816000
*      ANS(TEMP_TEXT) SKIP COL(MACCOL+2) NORESCAN;                      99816300
*      FIELD_VALUE = '''0''B';                                          99816600
*      TEMP_TEXT = FPL_STOR_NAME!!'.'!!FPL_PREFIX!!                     99816900
*                   'REQUEST_CONT = '!!FIELD_VALUE!!';';                99817200
*      ANS(TEMP_TEXT) SKIP COL(MACCOL+2) NORESCAN;                      99817500
*     End;                                                              99817800
*    Else                                                               99818100
*     Do;                                                               99818400
*      TEMP_TEXT = FPL_PTR!!FPL_PREFIX!!'REQUEST_NEW  = '!!             99818700
*        FIELD_VALUE!!';';                                              99819000
*      ANS(TEMP_TEXT) SKIP COL(MACCOL+2) NORESCAN;                      99819300
*      FIELD_VALUE = '''0''B';                                          99819600
*      TEMP_TEXT = FPL_PTR!!FPL_PREFIX!!'REQUEST_CONT = '!!             99819900
*        FIELD_VALUE!!';';                                              99820200
*      ANS(TEMP_TEXT) SKIP COL(MACCOL+2) NORESCAN;                      99820500
*     End;                                                              99820800
*   END;                                                                99821100
*  ELSE IF (REQTYPE(1) = 'CONTINUE') THEN                               99821400
*   Do;                                                                 99821700
*    IF (MF1='L') ! (MF1='E') ! (MF1='B') THEN                          99822000
*     Do;                                                               99822300
*      TEMP_TEXT = FPL_STOR_NAME!!'.'!!FPL_PREFIX!!                     99822600
*                   'REQUEST_CONT = '!!FIELD_VALUE!!';';                99822900
*      ANS(TEMP_TEXT) SKIP COL(MACCOL+2) NORESCAN;                      99823200
*      FIELD_VALUE = '''0''B';                                          99823500
*      TEMP_TEXT = FPL_STOR_NAME!!'.'!!FPL_PREFIX!!                     99823800
*                   'REQUEST_NEW  = '!!FIELD_VALUE!!';';                99824100
*      ANS(TEMP_TEXT) SKIP COL(MACCOL+2) NORESCAN;                      99824400
*     End;                                                              99824700
*    Else                                                               99825000
*     Do;                                                               99825300
*      TEMP_TEXT = FPL_PTR!!FPL_PREFIX!!'REQUEST_CONT = '!!             99825600
*        FIELD_VALUE!!';';                                              99825900
*      ANS(TEMP_TEXT) SKIP COL(MACCOL+2) NORESCAN;                      99826200
*      FIELD_VALUE = '''0''B';                                          99826500
*      TEMP_TEXT = FPL_PTR!!FPL_PREFIX!!'REQUEST_NEW  = '!!             99826800
*        FIELD_VALUE!!';';                                              99827100
*      ANS(TEMP_TEXT) SKIP COL(MACCOL+2) NORESCAN;                      99827400
*     End;                                                              99827700
*   End;                                                                99828000
*  ELSE DO;                                                             99828300
*    ANS SKIP COL(MACCOL) NORESCAN MESSAGE                              99828600
*    (MACNAME!!'-IGWSSF09E-SYNTAX ERROR: '!!                            99828900
*    'INVALID VALUE "'!!REQTYPE(1)!!'" '!!                              99829200
*    'SPECIFIED FOR KEYWORD '!!                                         99829500
*    '"REQTYPE"');                                                      99829800
*    IF MAC_RETCODE < 8 THEN MAC_RETCODE = 8;                           99830100
*    END;                                                               99830400
* END;                                                                  99830700
*]                                                                      99831000
*]  HANDLE KEYWORD "RETDALOC"                                           99831300
*]                                                                      99831600
*IF RETDAT='YES' THEN DO;                                               99831900
*  IF RETDALOC = NULL THEN DO;                                          99832200
*    IF REQUIRED='YES' THEN DO;                                         99832500
*     TT = MACNAME!!'-IGWSCM03E-SYNTAX ERROR: '!!                       99832800
*         'KEYWORD "RETDALOC" '!!REQ_MSG;                               99833100
*     ANS MESSAGE(TT)        SKIP COL(MACCOL) NORESCAN;                 99833400
*     ANS ('/* '!!TT!!' */') SKIP COL(MACCOL) NORESCAN;                 99833700
*     IF MAC_RETCODE < 8 THEN MAC_RETCODE = 8;                          99834000
*    END;                                                               99834300
*   END;                                                                99834600
*  ELSE IF NUMBER(RETDALOC) ^= 1 THEN DO;                               99834900
*    TT = MACNAME!!'-IGWSCM01E-SYNTAX ERROR: '!!                        99835200
*        'KEYWORD "RETDALOC" '!!                                        99835500
*        'MUST HAVE EXACTLY ONE ARGUMENT.';                             99835800
*    ANS MESSAGE(TT)        SKIP COL(MACCOL) NORESCAN;                  99836100
*    ANS ('/* '!!TT!!' */') SKIP COL(MACCOL) NORESCAN;                  99836400
*    IF MAC_RETCODE < 8 THEN MAC_RETCODE = 8;                           99836700
*   END;                                                                99837000
*  ELSE                                                                 99837300
*   Do;                                                                 99837600
*    FIELD_VALUE = RETDALOC(1);                                         99837900
*    IF (MF1='L') ! (MF1='E') ! (MF1='B') THEN                          99838200
*     Do;                                                               99838500
*      TEMP_TEXT = FPL_STOR_NAME!!'.'!!FPL_PREFIX!!                     99838800
*                   'RTN_DATA@   = '!!FIELD_VALUE!!';';                 99839100
*      ANS(TEMP_TEXT) SKIP COL(MACCOL+2) NORESCAN;                      99839400
*     End;                                                              99839700
*    Else                                                               99840000
*     Do;                                                               99840300
*      TEMP_TEXT = FPL_PTR!!FPL_PREFIX!!'RTN_DATA@ = '!!                99840600
*        FIELD_VALUE!!';';                                              99840900
*      ANS(TEMP_TEXT) SKIP COL(MACCOL+2) NORESCAN;                      99841200
*     End;                                                              99841500
*   END;                                                                99841800
*END;                                                                   99842100
*]                                                                      99842400
*]  HANDLE KEYWORD "RETDASIZ"                                           99842700
*]                                                                      99843000
*IF RETDAT='YES' THEN DO;                                               99843300
*  IF RETDASIZ = NULL THEN DO;                                          99843600
*    IF REQUIRED='YES' THEN DO;                                         99843900
*     TT = MACNAME!!'-IGWSCM03E-SYNTAX ERROR: '!!                       99844200
*         'KEYWORD "RETDASIZ" '!!REQ_MSG;                               99844500
*     ANS MESSAGE(TT)        SKIP COL(MACCOL) NORESCAN;                 99844800
*     ANS ('/* '!!TT!!' */') SKIP COL(MACCOL) NORESCAN;                 99845100
*     IF MAC_RETCODE < 8 THEN MAC_RETCODE = 8;                          99845400
*    END;                                                               99845700
*  END;                                                                 99846000
*  ELSE IF NUMBER(RETDASIZ) ^= 1 THEN DO;                               99846300
*    TT = MACNAME!!'-IGWSCM01E-SYNTAX ERROR: '!!                        99846600
*        'KEYWORD "RETDASIZ" '!!                                        99846900
*        'MUST HAVE EXACTLY ONE ARGUMENT.';                             99847200
*    ANS MESSAGE(TT)        SKIP COL(MACCOL) NORESCAN;                  99847500
*    ANS ('/* '!!TT!!' */') SKIP COL(MACCOL) NORESCAN;                  99847800
*    IF MAC_RETCODE < 8 THEN MAC_RETCODE = 8;                           99848100
*   END;                                                                99848400
*  ELSE DO;                                                             99848700
*    FIELD_VALUE = RETDASIZ(1);                                         99849000
*    IF (MF1='L') ! (MF1='E') ! (MF1='B') THEN                          99849300
*     Do;                                                               99849600
*      TEMP_TEXT = FPL_STOR_NAME!!'.'!!FPL_PREFIX!!                     99849900
*                   'RTN_DATA_SIZE = '!!FIELD_VALUE!!';';               99850200
*      ANS(TEMP_TEXT) SKIP COL(MACCOL+2) NORESCAN;                      99850500
*     End;                                                              99850800
*    Else                                                               99851100
*     Do;                                                               99851400
*      TEMP_TEXT = FPL_PTR!!FPL_PREFIX!!'RTN_DATA_SIZE = '!!            99851700
*        FIELD_VALUE!!';';                                              99852000
*      ANS(TEMP_TEXT) SKIP COL(MACCOL+2) NORESCAN;                      99852300
*     End;                                                              99852600
*  END;                                                                 99852900
*END;                                                                   99853200
*]                                                                      99853500
*]  HANDLE KEYWORD "ACBADDR"                                            99853800
*]                                                                      99854100
*IF ACBADDR ^= NULL THEN DO;                                            99854400
*  IF SERVICE(1) = 'OBTDATA' THEN DO;                                   99854700
*    IF NUMBER(ACBADDR) ^= 1 THEN DO;                                   99855000
*      TT = MACNAME!!'-IGWSCM01E-SYNTAX ERROR: '!!                      99855300
*          'KEYWORD "ACBADDR" '!!                                       99855600
*          'MUST HAVE EXACTLY ONE ARGUMENT.';                           99855900
*      ANS MESSAGE(TT)      SKIP COL(MACCOL) NORESCAN;                  99856200
*      ANS ('/* '!!TT!!' */') SKIP COL(MACCOL) NORESCAN;                99856500
*      IF MAC_RETCODE < 8 THEN MAC_RETCODE = 8;                         99856800
*      END;                                                             99857100
*    ELSE DO;                                                           99857400
*     FIELD_VALUE = ACBADDR(1);                                         99857700
*     IF (MF1='L') ! (MF1='E') ! (MF1='B') THEN                         99858000
*      Do;                                                              99858300
*       TEMP_TEXT = FPL_STOR_NAME!!'.'!!FPL_PREFIX!!                    99858600
*                    'ACB@        = '!!FIELD_VALUE!!';';                99858900
*       ANS(TEMP_TEXT) SKIP COL(MACCOL+2) NORESCAN;                     99859200
*      End;                                                             99859500
*     Else                                                              99859800
*      Do;                                                              99860100
*       TEMP_TEXT = FPL_PTR!!FPL_PREFIX!!'ACB@ = '!!                    99860400
*         FIELD_VALUE!!';';                                             99860700
*       ANS(TEMP_TEXT) SKIP COL(MACCOL+2) NORESCAN;                     99861000
*      End;                                                             99861300
*    END;                                                               99861600
*  END;                                                                 99861900
*END;                                                                   99862200
*]                                                                 @02A 99862505
*]  HANDLE KEYWORD "CFLSBLCK"                                      @02A 99862510
*]                                                                 @02A 99862515
*IF CFLSBLCK ^= NULL  & (SERVICE(1)^='OBTCFLSD') THEN            ] @02A 99862520
* DO;                                                            ] @02A 99862525
*  TT = MACNAME!!'-IGWSCM03E-SYNTAX ERROR: '!!                   ] @02A 99862530
*      'KEYWORD "CFLSBLCK" '!!NOT_ALLOWED_MSG;                   ] @02A 99862535
*     ANS MESSAGE(TT)        SKIP COL(MACCOL) NORESCAN;          ] @02A 99862540
*     ANS ('/* '!!TT!!' */') SKIP COL(MACCOL) NORESCAN;          ] @02A 99862545
*     IF MAC_RETCODE < 8 THEN MAC_RETCODE = 8;                   ] @02A 99862550
* END;                                                           ] @02A 99862555
*ELSE IF CFLSBLCK = NULL THEN                                    ] @02A 99862560
* DO;                                                            ] @02A 99862565
*   IF REQUIRED='YES' THEN                                       ] @02A 99862570
*    DO;                                                         ] @02A 99862575
*      IF (SERVICE(1)='OBTCFLSD') THEN                           ] @02A 99862580
*       DO;                                                      ] @02A 99862585
*         TT = MACNAME!!'-IGWSCM03E-SYNTAX ERROR: '!!            ] @02A 99862590
*             'KEYWORD "CFLSBLCK" '!!REQ_MSG;                    ] @02A 99862595
*         ANS MESSAGE(TT)        SKIP COL(MACCOL) NORESCAN;      ] @02A 99862600
*         ANS ('/* '!!TT!!' */') SKIP COL(MACCOL) NORESCAN;      ] @02A 99862605
*         IF MAC_RETCODE < 8 THEN MAC_RETCODE = 8;               ] @02A 99862610
*       END;                                                     ] @02A 99862615
*    END;                                                        ] @02A 99862620
* END;                                                           ] @02A 99862625
*ELSE IF (SERVICE(1) = 'OBTCFLSD') THEN                          ] @02A 99862630
* DO;                                                            ] @02A 99862635
*   IF (NUMBER(CFLSBLCK) ^= 1) THEN                              ] @02A 99862640
*    DO;                                                         ] @02A 99862645
*      ANS SKIP COL(MACCOL) NORESCAN MESSAGE                     ] @02A 99862650
*       (MACNAME!!'-IGWSCM01E-SYNTAX ERROR: '!!                  ] @02A 99862655
*       'KEYWORD "CFLSBLCK" MUST HAVE EXACTLY 1 ARGUMENT.');     ] @02A 99862660
*      IF MAC_RETCODE < 8 THEN MAC_RETCODE = 8;                  ] @02A 99862665
*    END;                                                        ] @02A 99862670
*   ELSE                                                         ] @02A 99862675
*    DO;                                                         ] @02A 99862680
*      FIELD_VALUE = CFLSBLCK(1);                                ] @02A 99862685
*      IF (MF1='L') ! (MF1='E') ! (MF1='B') THEN                 ] @02A 99862690
*       DO;                                                      ] @02A 99862695
*         TEMP_TEXT = FPL_STOR_NAME!!'.'!!FPL_PREFIX!!           ] @02A 99862700
*                      'CFLSBLCK@     = '!!FIELD_VALUE!!';';     ] @02A 99862705
*         ANS(TEMP_TEXT) SKIP COL(MACCOL+2) NORESCAN;            ] @02A 99862710
*       END;                                                     ] @02A 99862715
*      ELSE                                                      ] @02A 99862720
*       DO;                                                      ] @02A 99862725
*         TEMP_TEXT = FPL_PTR!!FPL_PREFIX!!'CFLSBLCK@     = '!!  ] @02A 99862730
*           FIELD_VALUE!!';';                                    ] @02A 99862735
*         ANS(TEMP_TEXT) SKIP COL(MACCOL+2) NORESCAN;            ] @02A 99862740
*       END;                                                     ] @02A 99862745
*    END;                                                        ] @02A 99862750
* END;                                                           ] @02A 99862755
*                                                                ] @02A 99862760
*/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */99862800
*/* MAKE THE CALL PC CALL                                             */99863100
*/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */99863400
*IF (MF1 = 'S') ! (MF1 = 'E') THEN DO;                                  99863700
*]                                                                      99864000
*]  CHANGES REQUIRED FOR VSAM PC                                        99864300
*]                                                                      99864600
*                                                                       99864900
*  Uni_num   = MacIndex;                                                99865200
*  TEMP_TEXT = FPL_STOR_NAME;                                           99865500
*                                                                       99865800
*   BlockAnswer Page Column(MacCol+2) ReScan;                           99866100
*   '/**************************************************************/'  99866400
*   '/*  Set the function id assigned to the function that this    */'  99866700
*   '/*  macro is calling, and define the parameter area that is   */'  99867000
*   '/*  being passed.                                             */'  99867300
*   '/**************************************************************/'  99867600
*   '                                                                '  99867900
*   'Dcl L_Reg0_'!!Uni_num!!'  Register(0)  Restricted;              '  99868200
*   'Dcl L_Reg15_'!!Uni_num!!' Register(15) Restricted;              '  99868500
*   '                                                                '  99868800
*   'Dcl CVTPTR_'!!Uni_num!!'  PTR(31) LOCATION(16);                 '  99869100
*   '                                                                '  99869400
*   'Dcl VSSPC_MMF_CDATA_ROUTER_'!!Uni_num!!' Fixed(31)              '!!99869700
*   '    constant(06x);                                              '  99870000
*   ']                                                               '  99870300
*   'dcl REL140_'!!Uni_num!!' char(4) initial(''01010400''x);        '  99870600
*   'dcl CallNotAuth_'!!Uni_num!!' fixed(31) initial(''0000EE03''x); '  99870900
*   'dcl CallAbend_'!!Uni_num!!' fixed(31) initial(''0000EE02''x);   '  99871200
*   'dcl CallNoServ_'!!Uni_num!!' fixed(31) initial(''0000EE01''x);  '  99871500
*   'dcl DFA@_'!!Uni_num!!' ptr(31) based(CVTPTR_'!!Uni_num!!'+1216);'  99871800
*   'dcl DFVT@_'!!Uni_num!!' ptr(31) based(DFA@_'!!Uni_num!!'+44);   '  99872100
*   'dcl VRGB@_'!!Uni_num!!' ptr(31) based(DFVT@_'!!Uni_num!!'+232); '  99872400
*   'dcl GMMF@_'!!Uni_num!!' ptr(31) based(VRGB@_'!!Uni_num!!'+200); '  99872700
*   'dcl CdtaSupport_'!!Uni_num!!' fixed(32)                         '!!99873000
*   '                        based(GMMF@_'!!Uni_num!!'+28);          '  99873300
*   'dcl dfarels_'!!Uni_num!!' char(4)                               '!!99873600
*   '                        based(DFA@_'!!Uni_num!!'+16);           '  99873900
*   'dcl PCTB@_'!!Uni_num!!' ptr(31) based(VRGB@_'!!Uni_num!!'+16);  '  99874200
*   'dcl ServerAvailable_'!!Uni_num!!' bit(1)                        '!!99874500
*   '        based(VRGB@_'!!Uni_num!!'+24);                          '  99874800
*   'dcl PC#_'!!Uni_num!!'   fixed(32) based(PCTB@_'!!Uni_num!!'+12);'  99875100
*   ']                                                               '  99875400
*   'Dcl VSS_PC_CallerSpaceRouter_'!!Uni_num!!' entry                '!!99875700
*   '    (fixed(31) byvalue input inreg(0),                          '!!99876000
*   '    Char(*) byaddr input output inreg(1))                       '!!99876300
*   '    subsystem(PC#_'!!Uni_num!!')                                '!!99876600
*   '    options(ENV(AR));                                           '  99876900
*   '                                                                '  99877200
*   'If DFARELS_'!!Uni_num!!' < REL140_'!!Uni_num!!' !               '!!99877500
*   '   (GMMF@_'!!Uni_num!!' ^= 0      &                             '!!99877800
*   '    CdtaSupport_'!!Uni_num!!' = 0)   then                       '  99878100
*   ' Do;                                                            '  99878400
*   '  L_Reg15_'!!Uni_num!!' =  CdataRc_Envr;                        '  99878700
*   '  L_Reg0_'!!Uni_num!!'  =  CdataRsn_SystemDownLevel;            '  99879000
*   ' End;                                                           '  99879300
*   'Else                                                            '  99879600
*   ' Do;                                                            '  99879900
*   '  If (DFA@_'!!Uni_num!!'  ^= 0 &                                '!!99880200
*   '      DFVT@_'!!Uni_num!!' ^= 0 &                                '!!99880500
*   '      VRGB@_'!!Uni_num!!' ^= 0 &                                '!!99880800
*   '      PCTB@_'!!Uni_num!!' ^= 0 &                                '!!99881100
*   '      ServerAvailable_'!!Uni_num!!' &                           '!!99881400
*   '      PC#_'!!Uni_num!!'   ^= 0) Then                            '  99881700
*   '      Do;                                                       '  99882000
*   '        Call VSS_PC_CallerSpaceRouter_'!!Uni_num!!'             '!!99882300
*   '             (VSSPC_MMF_CDATA_ROUTER_'!!Uni_num!!',             '!!99882600
*   '              '!!FPL_STOR_NAME!!');                             '  99882900
*   '      /********************************************************/'  99883200
*   '      /* Upon return from the PC, R15 contains the Return code*/'  99883500
*   '      /* and R0 contains the reason code returned from either */'  99883800
*   '      /* the VSS PC service, or from the SCM command function */'  99884100
*   '      /********************************************************/'  99884400
*   '        If L_Reg0_'!!Uni_num!!' = CallNotAuth_'!!Uni_num!!' then'  99884700
*   '         Do;                                                    '  99885000
*   '          L_Reg15_'!!Uni_num!!' = CdataRc_Envr;                 '  99885300
*   '          L_Reg0_'!!Uni_num!!'  = CdataRsn_InvalidMode;         '  99885600
*   '         End;                                                   '  99885900
*   '        If L_Reg0_'!!Uni_num!!' = CallAbend_'!!Uni_num!!' then  '  99886200
*   '         Do;                                                    '  99886500
*   '          L_Reg15_'!!Uni_num!!' = CdataRc_Envr;                 '  99886800
*   '          L_Reg0_'!!Uni_num!!'  = CdataRsn_AbendOther;          '  99887100
*   '         End;                                                   '  99887400
*   '        If L_Reg0_'!!Uni_num!!' = CallNoServ_'!!Uni_num!!' then '  99887700
*   '         Do;                                                    '  99888000
*   '          L_Reg15_'!!Uni_num!!' = CdataRc_Envr;                 '  99888300
*   '          L_Reg0_'!!Uni_num!!'  = CdataRsn_ServerNotAvailable;  '  99888600
*   '         End;                                                   '  99888900
*   '      End;                                                      '  99889200
*   '  Else                                                          '  99889500
*   '    ]                                                           '  99889800
*   '    ] Server not available                                      '  99890100
*   '    ]                                                           '  99890400
*   '    Do;                                                         '  99890700
*   '     L_Reg15_'!!Uni_num!!' =  CdataRc_Envr;                     '  99891000
*   '     L_Reg0_'!!Uni_num!!'  =  CdataRsn_ServerNotAvailable;      '  99891300
*   '    End;                                                        '  99891600
*   ' End;                                                           '  99891900
*   '                                                                '  99892200
*   EndAnswer;                                                          99892500
*                                                                       99892800
*]                                                                      99893100
*]  END CHANGES REQUIRED FOR VSAM PC                                    99893400
*]                                                                      99893700
*                                                                       99894000
*END;   /* IF (MF1 = 'S') ! (MF1 = 'E') THEN DO */                      99894300
*                                                                       99894600
*]                                                                      99894900
*]  COPY ALL OUTPUT DATA INTO THE PL/X VARIABLES SPECIFIED BY THE CALL  99895200
*]                                                                      99895500
*                                                                       99895800
*IF (MF1 = 'S') ! (MF1 = 'E') THEN                                      99896100
* Do;                                                                   99896400
*  IF RSNCODE = NULL THEN                                               99896700
*   Do;                                                                 99897000
*     TT = MACNAME!!'-IGWSCM13E-SYNTAX ERROR: '!!                       99897300
*         'KEYWORD "RSNCODE" '!!                                        99897600
*         'IS REQUIRED ON THIS CALL BECAUSE IT IS AN OUTPUT.';          99897900
*     ANS MESSAGE(TT)        SKIP COL(MACCOL) NORESCAN;                 99898200
*     ANS ('/* '!!TT!!' */') SKIP COL(MACCOL) NORESCAN;                 99898500
*     IF MAC_RETCODE < 8 THEN MAC_RETCODE = 8;                          99898800
*   End;                                                                99899100
*  ELSE                                                                 99899400
*   Do;                                                                 99899700
*    IF (MF1='L') ! (MF1='E') ! (MF1='B') THEN                          99900000
*     Do;                                                               99900300
*      FIELD_VALUE = RSNCODE(1);                                        99900600
*      TEMP_TEXT = FIELD_VALUE!!' = L_Reg0_'!!Uni_num!!';';             99900900
*      ANS(TEMP_TEXT) SKIP COL(MACCOL+2) NORESCAN;                      99901200
*                                                                       99901500
*      TEMP_TEXT =                                                      99901800
*       FPL_STOR_NAME!!'.'!!FPL_PREFIX!!'ReasonCode = '!!               99902100
*                                   'L_Reg0_'!!Uni_num!!';';            99902400
*      ANS(TEMP_TEXT) SKIP COL(MACCOL+2) NORESCAN;                      99902700
*     End;                                                              99903000
*    Else                                                               99903300
*     Do;                                                               99903600
*      FIELD_VALUE = RSNCODE(1);                                        99903900
*      TEMP_TEXT = FIELD_VALUE!!' = L_Reg0_'!!Uni_num!!';';             99904200
*      ANS(TEMP_TEXT) SKIP COL(MACCOL+2) NORESCAN;                      99904500
*                                                                       99904800
*      TEMP_TEXT =                                                      99905100
*         FPL_PTR!!FPL_PREFIX!!'ReasonCode = '!!                        99905400
*                                   'L_Reg0_'!!Uni_num!!';';            99905700
*      ANS(TEMP_TEXT) SKIP COL(MACCOL+2) NORESCAN;                      99906000
*     End;                                                              99906300
*   End;                                                                99906600
*                                                                       99906900
*  IF RETCODE = NULL THEN                                               99907200
*   Do;                                                                 99907500
*    TT = MACNAME!!'-IGWSCM13E-SYNTAX ERROR: '!!                        99907800
*        'KEYWORD "RETCODE" '!!                                         99908100
*        'IS REQUIRED ON THIS CALL BECAUSE IT IS AN OUTPUT.';           99908400
*    ANS MESSAGE(TT)       SKIP COL(MACCOL) NORESCAN;                   99908700
*    ANS ('/* '!!TT!!' */') SKIP COL(MACCOL) NORESCAN;                  99909000
*    IF MAC_RETCODE < 8 THEN MAC_RETCODE = 8;                           99909300
*   END;                                                                99909600
*  ELSE                                                                 99909900
*   do;                                                                 99910200
*    IF (MF1='L') ! (MF1='E') ! (MF1='B') THEN                          99910500
*     Do;                                                               99910800
*      FIELD_VALUE = RETCODE(1);                                        99911100
*      TEMP_TEXT = FIELD_VALUE!!' = L_Reg15_'!!Uni_num!!';';            99911400
*      ANS(TEMP_TEXT) SKIP COL(MACCOL+2) NORESCAN;                      99911700
*                                                                       99912000
*      TEMP_TEXT =                                                      99912300
*       FPL_STOR_NAME!!'.'!!FPL_PREFIX!!'ReturnCode = '!!               99912600
*                                   'L_Reg15_'!!Uni_num!!';';           99912900
*      ANS(TEMP_TEXT) SKIP COL(MACCOL+2) NORESCAN;                      99913200
*     End;                                                              99913500
*    Else                                                               99913800
*     Do;                                                               99914100
*      FIELD_VALUE = RETCODE(1);                                        99914400
*      TEMP_TEXT = FIELD_VALUE!!' = L_Reg15_'!!Uni_num!!';';            99914700
*      ANS(TEMP_TEXT) SKIP COL(MACCOL+2) NORESCAN;                      99915000
*                                                                       99915300
*      TEMP_TEXT =                                                      99915600
*         FPL_PTR!!FPL_PREFIX!!'ReturnCode = '!!                        99915900
*                                   'L_Reg15_'!!Uni_num!!';';           99916200
*      ANS(TEMP_TEXT) SKIP COL(MACCOL+2) NORESCAN;                      99916500
*     End;                                                              99916800
*   End;                                                                99917100
*                                                                       99917400
*  IF (SERVICE(1) = 'CONNECT') THEN                                     99917700
*   Do;                                                                 99918000
*    IF CONTOKEN = NULL THEN                                            99918300
*     Do;                                                               99918600
*      TT = MACNAME!!'-IGWSCM13E-SYNTAX ERROR: '!!                      99918900
*          'KEYWORD "CONTOKEN" '!!                                      99919200
*          'IS REQUIRED ON THIS CALL BECAUSE IT IS AN OUTPUT.';         99919500
*      ANS MESSAGE(TT)       SKIP COL(MACCOL) NORESCAN;                 99919800
*      ANS ('/* '!!TT!!' */') SKIP COL(MACCOL) NORESCAN;                99920100
*      IF MAC_RETCODE < 8 THEN MAC_RETCODE = 8;                         99920400
*     END;                                                              99920700
*    ELSE                                                               99921000
*     Do;                                                               99921300
*      IF (MF1='L') ! (MF1='E') ! (MF1='B') THEN                        99921600
*       Do;                                                             99921900
*        TEMP_TEXT = CONTOKEN(1)!!'='!!FPL_STOR_NAME!!'.'!!FPL_PREFIX!! 99922200
*                     'CONNECT_TOKEN;';                                 99922500
*        ANS(TEMP_TEXT) SKIP COL(MACCOL+2) NORESCAN;                    99922800
*       End;                                                            99923100
*      Else                                                             99923400
*       Do;                                                             99923700
*        ANS(CONTOKEN(1)!!'='!!FPL_PTR!!FPL_PREFIX!!'CONNECT_TOKEN;')   99924000
*                          NORESCAN COL(MACCOL+2);                      99924300
*       End;                                                            99924600
*     End;                                                              99924900
*   End;                                                                99925200
*                                                                       99925500
*   IF (SERVICE(1) = 'OBTDATA') THEN                                    99925800
*    Do;                                                                99926100
*     IF CONTOKEN = NULL THEN                                           99926400
*      Do;                                                              99926700
*       TT = MACNAME!!'-IGWSCM13E-SYNTAX ERROR: '!!                     99927000
*           'KEYWORD "CONTOKEN" '!!                                     99927300
*           'IS REQUIRED ON THIS CALL BECAUSE IT IS AN OUTPUT.';        99927600
*       ANS MESSAGE(TT)       SKIP COL(MACCOL) NORESCAN;                99927900
*       ANS ('/* '!!TT!!' */') SKIP COL(MACCOL) NORESCAN;               99928200
*       IF MAC_RETCODE < 8 THEN MAC_RETCODE = 8;                        99928500
*      END;                                                             99928800
*     ELSE                                                              99929100
*      do;                                                              99929400
*       IF (MF1='L') ! (MF1='E') ! (MF1='B') THEN                       99929700
*        Do;                                                            99930000
*         TEMP_TEXT = CONTOKEN(1)!!'='!!FPL_STOR_NAME!!'.'!!FPL_PREFIX!!99930300
*                      'CONNECT_TOKEN;';                                99930600
*         ANS(TEMP_TEXT) SKIP COL(MACCOL+2) NORESCAN;                   99930900
*        End;                                                           99931200
*       Else                                                            99931500
*        Do;                                                            99931800
*         ANS(CONTOKEN(1)!!'='!!FPL_PTR!!FPL_PREFIX!!'CONNECT_TOKEN;')  99932100
*                           NORESCAN COL(MACCOL+2);                     99932400
*        End;                                                           99932700
*      End;                                                             99933000
*    END;                                                               99933300
*                                                                       99933600
*   IF (SERVICE(1) = 'CONNECTU') THEN                                   99933900
*    Do;                                                                99934200
*     IF CONTOKEN = NULL THEN                                           99934500
*      Do;                                                              99934800
*       TT = MACNAME!!'-IGWSCM13E-SYNTAX ERROR: '!!                     99935100
*           'KEYWORD "CONTOKEN" '!!                                     99935400
*           'IS REQUIRED ON THIS CALL BECAUSE IT IS AN OUTPUT.';        99935700
*       ANS MESSAGE(TT)       SKIP COL(MACCOL) NORESCAN;                99936000
*       ANS ('/* '!!TT!!' */') SKIP COL(MACCOL) NORESCAN;               99936300
*       IF MAC_RETCODE < 8 THEN MAC_RETCODE = 8;                        99936600
*      END;                                                             99936900
*     ELSE                                                              99937200
*      do;                                                              99937500
*       IF (MF1='L') ! (MF1='E') ! (MF1='B') THEN                       99937800
*        Do;                                                            99938100
*         TEMP_TEXT = CONTOKEN(1)!!'='!!FPL_STOR_NAME!!'.'!!FPL_PREFIX!!99938400
*                      'CONNECT_TOKEN;';                                99938700
*         ANS(TEMP_TEXT) SKIP COL(MACCOL+2) NORESCAN;                   99939000
*        End;                                                           99939300
*       Else                                                            99939600
*        Do;                                                            99939900
*         ANS(CONTOKEN(1)!!'='!!FPL_PTR!!FPL_PREFIX!!'CONNECT_TOKEN;')  99940200
*                           NORESCAN COL(MACCOL+2);                     99940500
*        End;                                                           99940800
*      End;                                                             99941100
*    END;                                                               99941400
*                                                                       99941700
*   IF (SERVICE(1) = 'OBTDSMSK') ! (SERVICE(1) = 'OBTSCMSK') THEN ]@03C 99942090
*    Do;                                                                99942300
*     IF CONTOKEN = NULL THEN                                           99942600
*      Do;                                                              99942900
*       TT = MACNAME!!'-IGWSCM13E-SYNTAX ERROR: '!!                     99943200
*           'KEYWORD "CONTOKEN" '!!                                     99943500
*           'IS REQUIRED ON THIS CALL BECAUSE IT IS AN OUTPUT.';        99943800
*       ANS MESSAGE(TT)       SKIP COL(MACCOL) NORESCAN;                99944100
*       ANS ('/* '!!TT!!' */') SKIP COL(MACCOL) NORESCAN;               99944400
*       IF MAC_RETCODE < 8 THEN MAC_RETCODE = 8;                        99944700
*      END;                                                             99945000
*     ELSE                                                              99945300
*      do;                                                              99945600
*       IF (MF1='L') ! (MF1='E') ! (MF1='B') THEN                       99945900
*        Do;                                                            99946200
*         TEMP_TEXT = CONTOKEN(1)!!'='!!FPL_STOR_NAME!!'.'!!FPL_PREFIX!!99946500
*                      'CONNECT_TOKEN;';                                99946800
*         ANS(TEMP_TEXT) SKIP COL(MACCOL+2) NORESCAN;                   99947100
*        End;                                                           99947400
*       Else                                                            99947700
*        Do;                                                            99948000
*         ANS(CONTOKEN(1)!!'='!!FPL_PTR!!FPL_PREFIX!!'CONNECT_TOKEN;')  99948300
*                           NORESCAN COL(MACCOL+2);                     99948600
*        End;                                                           99948900
*      End;                                                             99949200
*    END;                                                               99949500
*                                                                       99949800
*   IF RETDAT='YES' THEN                                                99950100
*    Do;                                                                99950400
*     IF STORREQD = NULL THEN                                           99950700
*      Do;                                                              99951000
*       TT = MACNAME!!'-IGWSCM13E-SYNTAX ERROR: '!!                     99951300
*            'KEYWORD "STORREQD" '!!                                    99951600
*            'IS REQUIRED ON THIS CALL BECAUSE IT IS AN OUTPUT.';       99951900
*        ANS MESSAGE(TT)       SKIP COL(MACCOL) NORESCAN;               99952200
*        ANS ('/* '!!TT!!' */') SKIP COL(MACCOL) NORESCAN;              99952500
*        IF MAC_RETCODE < 8 THEN MAC_RETCODE = 8;                       99952800
*      End;                                                             99953100
*     ELSE                                                              99953400
*      Do;                                                              99953700
*       IF (MF1='L') ! (MF1='E') ! (MF1='B') THEN                       99954000
*        Do;                                                            99954300
*         TEMP_TEXT = STORREQD(1)!!'='!!FPL_STOR_NAME!!'.'!!FPL_PREFIX!!99954600
*                      'STORAGE_REQD;';                                 99954900
*         ANS(TEMP_TEXT) SKIP COL(MACCOL+2) NORESCAN;                   99955200
*        End;                                                           99955500
*       Else                                                            99955800
*        Do;                                                            99956100
*         ANS(STORREQD(1)!!'='!!FPL_PTR!!FPL_PREFIX!!'STORAGE_REQD;')   99956400
*                          NORESCAN COL(MACCOL+2);                      99956700
*        End;                                                           99957000
*      END;                                                             99957300
*    END;                                                               99957600
* END;                                                                  99957900
*                                                                       99958200
* IF (MF1 = 'S') ! (MF1 = 'E') THEN DO;                                 99958500
*  ANS('Rfy L_Reg15_'!!Uni_num!!' Unrestricted;') SKIP COL(MACCOL);     99958800
*  ANS('Rfy L_Reg0_'!!Uni_num!!'  Unrestricted;') SKIP COL(MACCOL);     99959100
* End;                                                                  99959400
*]                                                                      99959700
*]  END OF COPY BACK.                                                   99960000
*]                                                                      99960300
*                                                                       99960600
*ANS('@LIST POP;') RESCAN SKIP COL(MACCOL);                             99960900
*ANS('END;') SKIP COL(MACCOL) NORESCAN;                                 99961200
*TEMP_TEXT=MACLABEL!!' '!!MACNAME!!' ';                                 99961500
*ANS(COMMENT(TEMP_TEXT)) NORESCAN;                                      99961800
*/* COMMON RETURN POINT (FOR NON-TERMINAL ERRORS)*/                     99962100
*RETURN CODE(MAC_RETCODE);                                              99962400
*%END;                                                                  99962700
