*                                                                       00050000
* %DCL IGWMDSMB_INCLUDED CHAR EXT;                                      00100000
* %DEACTIVATE IGWMDSMB_INCLUDED;                                        00150000
* %IF IGWMDSMB_INCLUDED = '' %THEN                                      00200000
* %DO;                                                                  00250000
*/* Macro made bi-lingual on 95264. CBGEN compile date 95240         */ 00300000
*% /*                                                                   00350000
         MACRO                                                          00400000
         IGWMDSMB &DSECT=YES,&LIST=YES                                  00469900
         GBLC  &IGWMDSMB_INCLUDED                                       00500000
         GBLC  &ZCBPRINT                                                00550000
&IGWMDSMB_INCLUDED SETC 'YES'                                           00600000
 TITLE   'IGWMDSMB  - IGWCDATA DATA SET MASK BLOCK                    ' 00669900
                                                                        00700000
                                                                        00725000
**/ IGWMDSMB_1:;                                                        00750000
*/* START OF SPECIFICATIONS ******************************************* 00800000
*    $MAC(IGWMDSMB) COMP(DF122) :                                     * 00850000
*                                                                     * 00900000
*                                                                     * 00925000
*   MACRO NAME: IGWMDSMB                                              * 00950000
*                                                                     * 01000000
*   DESCRIPTIVE NAME: IGWCDATA DATA SET MASK BLOCK                    * 01050000
*                                                                     * 01100000
*   STATUS: DFSMS VERSION 1 RELEASE 3.0                               * 01150000
*                                                                     * 01200000
*  PROPRIETARY V3 STATEMENT                                           * 01242802
*  LICENSED MATERIALS - PROPERTY OF IBM                               * 01285602
*  "RESTRICTED MATERIALS OF IBM"                                      * 01328402
*  5650-ZOS                                                           * 01371202
*  COPYRIGHT IBM CORP. 1995, 2015                                     * 01414002
*  END PROPRIETARY V3 STATEMENT                                       * 01456802
*                                                                     * 01500000
*   FUNCTION: THIS MACRO PROVIDES A TYPE DECLARATION WHICH MUST BE    * 01550000
*     USED TO MAP CDTA DATA SET MASK CONTROL BLOCKS.                  * 01600000
*                                                                     * 01650000
*   NOTES:                                                            * 01700000
*                                                                     * 01750000
*     THIS MACRO SHOULD BE INCLUDED VIA THE SSF PROLOG/EPILOG         * 01800000
*     SERVICES.                                                       * 01850000
*                                                                     * 01900000
*  Change History:                                                    * 01950000
*  $00=VSAMRLS,HDZ11C0,950919,SJPLDCO:                                * 02000000
*  $01=OW39785,HDZ11E0,990615,SJPLDLM: Add rls mmf cdata support @01A * 02025000
*  $02=OW44252,HDZ11F0,000428,SJPLMKD: Add RMF fixes             @02A * 02037500
*  $03=OA41786,HDZ1C10,03/27/2013,bpooja: Fix assembler portion. @03A * 02043500
*  $04=OA42798,HDZ1D10,06/10/2013,bpooja: Add new SCMB type for  @04A * 02045500
*                                       storage class mask block.@04A * 02047500
*** END OF SPECIFICATIONS ********************************************/ 02050000
*% /*                                                                   02100000
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 02150000
         AIF   ('&LIST' EQ 'YES').P2                                    02200000
.P1      ANOP                                                           02250000
         PUSH  PRINT                                                    02300000
         PRINT OFF                                                      02350000
.P2      ANOP                                                           02400000
*                                                                       02450000
*   ******************************************************************] 02500000
*   *                                                                 ] 02550000
*   * DECLARATION TO DESCRIBE THE BLOCK FOR IGWCDATA INTERFACE        ] 02600000
*   *                                                                 ] 02650000
*   ******************************************************************] 02700000
*                                                                       02750000
*                                                                       02800000
         AIF   ('&DSECT' EQ 'YES').L0003                                02900000
DSMBTYPE            DS   0D                                             03000000
         AGO   .L0004                                                   03050000
.L0003   ANOP                                                           03100000
DSMBTYPE            DSECT                                         @03C  03169900
.L0004   ANOP                                                           03200000
DSMB_HDR            DS   0CL0016   Standard Header                      03299900
DSMB_EYECATCHER     DS   1CL0008                                  @03C  03349900
DSMB_LENGTH         DS   1FL4                                     @03C  03399900
DSMB_VERSION        DS   1FL1                                     @03C  03449900
                    DS   1CL0003                                        03500000
*                                                                       03550000
*                                                                       03600000
*   Array of 100 input dataset masks                                    03650000
*                                                                       03700000
*                                                                       03750000
*                                                                       03800000
DSMB_INPUT_SECTION  DS   0CL6416                                        03879900
DSMB_NUM_IMASKS     DS   1FL4                                           03925000
                    DS   1CL12                                          03950000
*    Beginning of first element in array of 100 elements          @03C  04004900
DSMB_DSMASKS        DS   0CL64                                          04034900
DSMB_IMASK_LEN      DS   1CL4                                           04083300
DSMB_DATASET_MASK   DS   1CL0044                                        04091600
DSMB_IMASK_RETURNCODE DS 1FL4                                     @03C  04119800
DSMB_IMASK_REASONCODE DS 1FL4                                     @03C  04139800
                      DS   1CL8                                         04159800
DSMB_IMASK_ENTRY_LENGTH EQU   *-DSMB_DSMASKS   Length of one entry      04179800
               DS   99CL(*-DSMB_DSMASKS)  Next 99 entries array   @03A  04199800
DSMB_OUTPUT_SECTION DS 0CL6416                                          04219800
*                                                                       04300000
*                                                                       04350000
*   IGWCDATA output area for data set masks (100)                       04400000
*                                                                       04450000
*                                                                       04500000
*                                                                       04550000
DSMB_NUM_OMASKS     DS  1FL4                                            04584900
                    DS  1CL12                                           04594900
*    Beginning of first element in array of 100 elements          @03C  04604900
DSMB_OMASK          DS   0CL0064                                  @03D  04614900
DSMB_OMASK_LEN      DS   1FL4                                           04666600
DSMB_OMASK_DATASET_MASK DS 1CL0044                                @03M  04674600
                    DS   1CL16                                          04683200
DSMB_OMASK_ENTRY_LENGTH EQU *-DSMB_OMASK       Length of one entry      04749700
                    DS   99CL(*-DSMB_OMASK)  Next 99 entries array@03A  04799700
DSMB_LENGTHC        EQU  *-DSMBTYPE    Length of DSMB                   04849700
*                                                                       04900000
*                                                                       04950000
*  THE FOLLOWING ARE CONSTANT DECLARATIONS FOR DSMB                     05000000
*                                                                       05050000
*                                                                       05100000
*                                                                       05150000
DSMB_VISUALC1 EQU C'IGWM'  First half of constant Dsmb_EYECATCHER@03A   05259900
DSMB_VISUALC2 EQU C'DSMB'  Second half of constant Dsmb_EYECATCHER@03A  05319900
DSMB_LEVELC EQU 1        DSMB level number                        @03C  05379900
*                                                                       05380900
*   ******************************************************************] 05381900
*   *                                                                 ] 05382900
*   * DECLARATION TO DESCRIBE THE BLOCK FOR STORAGE CLASS INTERFACE   ] 05383900
*   * START                                                      @04A ] 05384900
*   ******************************************************************] 05385900
*                                                                       05386900
*                                                                       05387900
         AIF   ('&DSECT' EQ 'YES').L0005                         ] @04A 05388900
SCMBTYPE            DS   0D                                      ] @04A 05389900
         AGO   .L0006                                            ] @04A 05390900
.L0005   ANOP                                                    ] @04A 05391900
SCMBTYPE            DSECT                                        ] @04A 05392900
.L0006   ANOP                                                    ] @04A 05393900
SCMB_HDR            DS   0CL0016   Standard Header               ] @04A 05394900
SCMB_EYECATCHER     DS   1CL0008                                 ] @04A 05395900
SCMB_LENGTH         DS   1FL4                                    ] @04A 05396900
SCMB_VERSION        DS   1FL1                                    ] @04A 05397900
                    DS   1CL0003                                 ] @04A 05398900
*                                                                ] @04A 05399900
*                                                                ] @04A 05400900
*   Array of 100 input storage class masks                       ] @04A 05401900
*                                                                ] @04A 05402900
*                                                                ] @04A 05403900
*                                                                ] @04A 05404900
SCMB_INPUT_SECTION  DS   0D                                      ] @04A 05405900
SCMB_NUM_IMASKS     DS   1FL4                                    ] @04A 05406900
                    DS   1CL12                                   ] @04A 05407900
*    Beginning of first element in array of 100 elements         ] @04A 05408900
SCMB_SCMASKS        DS   0CL28                                   ] @04A 05409900
SCMB_IMASK_LEN      DS   1CL4                                    ] @04A 05410900
SCMB_IMASK_STORCLAS_MASK   DS   1CL8                             ] @04A 05411900
SCMB_IMASK_RETURNCODE DS 1FL4                                    ] @04A 05412900
SCMB_IMASK_REASONCODE DS 1FL4                                    ] @04A 05413900
                      DS   1CL8                                  ] @04A 05414900
SCMB_IMASK_ENTRY_LENGTH EQU   *-SCMB_SCMASKS  Length of one entry  @04A 05415900
               DS   99CL(*-SCMB_SCMASKS)    Next 99 entries array  @04A 05416900
SCMB_OUTPUT_SECTION DS 0D                                          @04A 05417900
*                                                                  @04A 05418900
*                                                                  @04A 05419900
*   IGWCDATA output area for storage class masks (100)             @04A 05420900
*                                                                  @04A 05421900
*                                                                  @04A 05422900
*                                                                  @04A 05423900
SCMB_NUM_OMASKS     DS  1FL4                                       @04A 05424900
                    DS  1CL12                                      @04A 05425900
*    Beginning of first element in array of 100 elements           @04A 05426900
SCMB_OMASK          DS   0CL28                                     @04A 05427900
SCMB_OMASK_LEN      DS   1FL4                                      @04A 05428900
SCMB_OMASK_STORCLAS_MASK DS 1CL8                                   @04A 05429900
                    DS   1CL16                                     @04A 05430900
SCMB_OMASK_ENTRY_LENGTH EQU *-SCMB_OMASK       Length of one entry @04A 05431900
                    DS   99CL(*-SCMB_OMASK)  Next 99 entries array @04A 05432900
SCMB_LENGTHC        EQU  *-SCMBTYPE    Length of SCMB              @04A 05433900
SCMB_VISUALC1       EQU C'IGWM'  First half of constant SCMB_EYECATCHER 05434900
SCMB_VISUALC2       EQU C'SCMB'  Second halfof constant SCMB_EYECATCHER 05435900
SCMB_LEVELC EQU 1        SCMB level number                         @04A 05436900
*  END SCMB  @04A                                                       05437900
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 05450000
         AIF   ('&LIST' EQ 'YES').P4                                    05500000
.P3      ANOP                                                           05550000
         POP   PRINT                                                    05600000
.P4      ANOP                                                           05650000
.P_EXIT  ANOP                                                           05700000
         MEND                                                           05750000
**/ IGWMDSMB_2:;                                                        05800000
* %IGWMDSMB_INCLUDED = 'YES';                                           05850000
* %DCL ZCBPRINT CHAR EXT;                                               05900000
* %DEACTIVATE ZCBPRINT;                                                 05950000
* %DCL IGWMDSMB_LIST CHAR EXT;                                          06000000
* %DEACTIVATE IGWMDSMB_LIST;                                            06050000
* %IF IGWMDSMB_LIST ^= 'NO' &                                           06100000
*    ZCBPRINT ^= 'NO' %THEN                                             06150000
*   %GOTO IGWMDSMB_3;                                                   06200000
*   @LIST PUSH NOECHO;                                                  06250000
*   @LIST NOASSEMBLE NOECHO;                                            06300000
*   @LIST OFF C NOECHO;                                                 06350000
* %IGWMDSMB_3:;                                                         06400000
*/* Start of PL/X Source                                             */ 06450000
*                                                                       06500000
*   ] DECLARATION TO DESCRIBE THE BLOCK FOR IGWCDATA INTERFACE          06550000
*                                                                       06600000
*DECLARE                                                                06650000
*1 MmfDsmbType type   BDY(DWORD),                                       06700000
* 2 DSMB_HDR,                            ]   Standard Header            06750000
*   4 Dsmb_EYECATCHER       CHAR(8),                                    06800000
*   4 Dsmb_LENGTH           FIXED(31),                                  06850000
*   4 Dsmb_VERSION          FIXED(8),                                   06900000
*   4 *                     CHAR(3),                                    06950000
*                                                                       07000000
* ]                                                                     07050000
* ] Array of 100 input dataset masks                                    07100000
* ]                                                                     07150000
*                                                                       07200000
* 2 DSMB_INPUT_SECTION             BDY(DWORD),                          07225000
*  3 DSMB_NUM_IMASKS               FIXED(31),                           07250000
*  3 *                             Char(12),                            07275000
*  3 DSMB_DSMASKS(100),                                                 07300000
*   4 DSMB_IMASK_LEN               FIXED(31),                           07325000
*   4 DSMB_IMASK_DATASET_MASK      CHAR(44),                            07350000
*   4 DSMB_IMASK_RETURNCODE        Fixed(31),                           07375000
*   4 DSMB_IMASK_REASONCODE        Fixed(32),                           07400000
*   4 *                            CHAR(8),                             07425000
*                                                                       07450000
* 2 DSMB_OUTPUT_SECTION            BDY(DWORD),                          07500000
* ]                                                                     07550000
* ] IGWCDATA output area for data set masks (100)                       07600000
* ]                                                                     07650000
*  3 DSMB_NUM_OMASKS               FIXED(31),                           07692800
*  3 *                             Char(12),                            07735600
*  3 DSMB_OMASK(100)               BDY(DWORD),                          07778400
*   4 DSMB_OMASK_LEN               FIXED(31),                           07821200
*   4 DSMB_OMASK_DATASET_MASK      CHAR(44),                            07864000
*   4 *                            CHAR(16);                            07906800
*]                                                                      07950000
*] THE FOLLOWING ARE CONSTANT DECLARATIONS FOR DSMB                     08000000
*]                                                                      08050000
*                                                                       08100000
*DECLARE                                                                08150000
*  DSMB_VISUALC CHAR(8)   CONSTANT('IGWMDSMB'),   ] DSMB eyecatc        08399900
*  DSMB_LENGTHC FIXED(31) CONSTANT(LENGTH(MmfDsmbType)),] length of DS  08599900
*  DSMB_LEVELC  FIXED(8)  CONSTANT(1);            ] DSMB level          08799900
*                                                              ]@04A    08805900
*]                                                             ]@04A    08811900
*] Storage class mask block                                    ]@04A    08817900
*]                                                             ]@04A    08823900
*DECLARE                                                       ]@04A    08829900
*1 MmfSCMBType type   BDY(DWORD),                              ]@04A    08835900
* 2 SCMB_HDR,                            ]   Standard Header   ]@04A    08841900
*   4 SCMB_EYECATCHER       CHAR(8),                           ]@04A    08847900
*   4 SCMB_LENGTH           FIXED(31),                         ]@04A    08853900
*   4 SCMB_VERSION          FIXED(8),                          ]@04A    08859900
*   4 *                     CHAR(3),                           ]@04A    08865900
*                                                              ]@04A    08871900
* ]                                                            ]@04A    08877900
* ] Array of 100 input dataset masks                           ]@04A    08883900
* ]                                                            ]@04A    08889900
*                                                              ]@04A    08895900
* 2 SCMB_INPUT_SECTION             BDY(DWORD),                 ]@04A    08901900
*  3 SCMB_NUM_IMASKS               FIXED(31),                  ]@04A    08907900
*  3 *                             Char(12),                   ]@04A    08913900
*  3 SCMB_SCMASKS(100),                                        ]@04A    08919900
*   4 SCMB_IMASK_LEN               FIXED(31),                  ]@04A    08925900
*   4 SCMB_IMASK_STORCLAS_MASK      CHAR(8),                   ]@04A    08931900
*   4 SCMB_IMASK_RETURNCODE        Fixed(31),                  ]@04A    08937900
*   4 SCMB_IMASK_REASONCODE        Fixed(32),                  ]@04A    08943900
*   4 *                            CHAR(8),                    ]@04A    08949900
*                                                              ]@04A    08955900
* 2 SCMB_OUTPUT_SECTION            BDY(DWORD),                 ]@04A    08961900
* ]                                                            ]@04A    08967900
* ] IGWCDATA output area for storage class masks(100)          ]@04A    08973900
* ]                                                            ]@04A    08979900
*  3 SCMB_NUM_OMASKS               FIXED(31),                  ]@04A    08985900
*  3 *                             Char(12),                   ]@04A    08991900
*  3 SCMB_OMASK(100),                                          ]@04A    08997900
*   4 SCMB_OMASK_LEN               FIXED(31),                  ]@04A    09003900
*   4 SCMB_OMASK_STORCLAS_MASK      CHAR(8),                   ]@04A    09009900
*   4 *                            CHAR(16);                   ]@04A    09015900
*]                                                              @04A    09021900
*] THE FOLLOWING ARE CONSTANT DECLARATIONS FOR SCMB             @04A    09027900
*]                                                              @04A    09033900
*                                                              ]@04A    09039900
*DECLARE                                                       ]@04A    09045900
*  SCMB_VISUALC CHAR(8)   CONSTANT('IGWMSCMB'), ] SCMB eyecatcher@04A   09051900
*  SCMB_LENGTHC FIXED(31) CONSTANT(LENGTH(MmfSCMBType)),]length  @04A   09057900
*  SCMB_LEVELC  FIXED(8)  CONSTANT(1);            ] SCMB level   @04A   09063900
* %END;                                                                 09100000
