*%;   /* PL/X MACRO COMMENTS ARE NOT PRINTED UNLESS MSOURCE USED.       00050000
         MACRO                                                          00100000
         IHAARA &DESCR=NO           WHETHER TO EXPAND DESCRIPTION       00150000
         AIF   ('&DESCR' EQ 'YES').DESCRIBE GO IF DESCRIPTION WANTED    00200000
         AIF   ('&DESCR' EQ 'NO').EXPAND    GO IF NO DESCRIPTION WANTED 00250000
         MNOTE 4,'VALUE OF DESCR= MUST BE ''YES'' OR ''NO''.'           00300000
.DESCRIBE ANOP              END THIS PL/X COMMENT       */              00350000
*/********************************************************************* 00400000
* $MAC(IHAARA) COMP(DF107):                                             00450000
.*PROPRIETARY V3 STATEMENT                                              00500000
.*LICENSED MATERIALS - PROPERTY OF IBM                                  00550000
.*"RESTRICTED MATERIALS OF IBM"                                         00600000
.*5694-A01                                                              00650000
.*(C) COPYRIGHT 1998,2003 IBM CORP.                                     00700000
.*END PROPRIETARY V3 STATEMENT                                          00750000
* DESCRIPTION = Mapping of allocation retrieval area.                   00800000
* FUNCTION = Map area returned by RDJFCB in a user subpool if the       00850000
*      caller's DCB exit list points to an ARL, which is mapped by      00900000
*      IHAARL.  For concatenated data sets, RDJFCB can return more      00950000
*      than one ARA.  They are stacked after each other, with           01000000
*      possible padding at the end of each.  RDJFCB sets ARLRTRVD       01050000
*      to the number of ARAs returned. Each ARA may contain an     @01A 01075000
*      Extended Information Segment which contains the block size  @01A 01100000
*      and system determined block size limit values. RDJFCB sets  @01A 01125000
*      ARAXINF if the Extended Information Segment is present.     @01A 01150000
* STATUS = z/OS DFSMS V1R3                                              01175000
* PROCESSOR = PL/X and Assembler.                                       01200000
* DISTRIBUTION LIBRARY = AMACLIB                                        01250000
* INVOCATION =                                                          01300000
*      ASSEMBLER -                                                      01350000
*           DESCR=YES or NO.  Specifies whether this description is to  01400000
*                be generated.  The default is NO.                      01450000
*      PL/X -                                                           01500000
*           %INCLUDE SYSLIB(IHAARA)   (End this statement and the other 01550000
*                PL/X lines with a semicolon).  There is an             01600000
*                assignment statement that can be used before           01650000
*                this line to control the expansion.                    01700000
*           %ARABASE=.  This variable controls the basing expression.   01750000
*                if it is null or not set, the structure will be based  01800000
*                and have no basing expression, thereby requiring later 01850000
*                code to use an implicit or explicit basing             01900000
*                expression.  Examples follow.                          01950000
*                %ARABASE = 'BASED(ARAPTR)'                             02000000
*                %ARABASE = 'BASED(EXITARA)'                            02050000
*                %ARABASE = 'BASED'            (THE DEFAULT)            02100000
*                %ARABASE = 'DEFINED(DXCCW1)'  (ON TOP OF DXCCW1)       02150000
*                %ARABASE = 'AUTOMATIC'                                 02200000
*                %ARABASE = 'STATIC'           (NOT REENTRANT)          02250000
* OUTPUT = Successful execution of RDJFCB results in the return of      02300000
*      an area called the allocation retrieval area.  RDJFCB builds     02350000
*      an ARA in user-key storage and sets ARLAREA to point to it.      02400000
* CHANGE ACTIVITY =                                                     02450000
*$L0=K150970,HDZ11E0,980305,SJPLWER: 13-year-old area needs macro  @L0A 02500000
*$L1=GT32K,HDZ11F0,981110,SJPLGEC: LBI Large Blksize support       @L1A 02525000
*$01=OW44466,HDZ11F0,000306,SJPLGEC: BLKSZLIM SUPPORT              @01A 02537500
*$L2=USSPO,HDZ11H0,010625,SJPLGEC: BPAM USS DIRECTORY SUPPORT      @L2A 02543700
*$P1=K1K0611,HDZ11K0,041110,SJPLGEC: PLX ERRORS                    @P1A 02546800
*********************************************************************** 02550000
         AGO   .EXPAND   AVOID GENERATING STRANGE ASSEMBLER COMMENT  */ 02600000
*%;   /* COMMENTS ON PL/X MACRO LINES NOT PRINTED UNLESS MSOURCE USED.  02650000
.EXPAND  ANOP            Expand the macro                               02700000
.*                                                                      02750000
ARA      DSECT           ALLOCATION RETRIEVAL AREA                      02800000
ARALEN   DS    H         Length of this area for one data set,         *02850000
                         including this, extended information      @L2C*02883300
                         segment and padding. Do not use           @L2A*02916600
                         this to calculate number of volumes            02950000
ARAFLG   DS    X         ARA flags                                 @L1C 02975000
ARAXINF  EQU   X'80'     ARA Extended Information Segment present  @L1A 03000000
*  Bits 1-7 are reserved                                           @L1A 03025000
ARAXINOF DS    X         Offset in double words to Extended Info       *03050000
                          Segment(it follows the last volser field)@L1C 03075000
ARAJFCB  DS    CL176     Main JFCB for one data set                     03100000
* End of minimum length of ARA.                                         03150000
ARAVOL   DS    CL6       Sixth and later volume serials if any.  Length*03200000
                         of this area is (JFCBNVOL-5)*6.  Entries at   *03250000
                         end can be blanks.  If first byte of an entry *03300000
                         is X'FF', VOL=REF was specified and the serial*03350000
                         number has not been determined.                03400000
ARAXINFO DSECT           Extended Information Segment              @L1A 03408300
ARAXINLN DS    H         Length of Extended Info Segment(including @L1A*03416600
                          8 byte header)                           @L1A 03420700
ARAPATHO DS    H         Offset from the beginning of the Extended @L2A*03424800
                           Info Segment to the path name if        @L2A*03428900
                           present. Otherwise zero.                @L2A 03433000
         DS    XL4       Reserved                                  @L2C 03437100
ARAXLBKS DS    DL8       Blksize value                             @L1A 03441500
ARABKSLM DS    DL8       BLKSZLIM value                            @01A 03443600
         DS    XL16      RESERVED                                  @01A 03445700
*    New fields will be inserted here.                             @L2A 03446700
ARAXLEN  EQU   *-ARAXINFO  Extended Info Segment len               @01A 03447800
         SPACE 1                                                        03447900
*                                                                       03448000
*    Path name. Present only if user set ARLUSS on and system set  @L2A 03448100
*    ARAPATHO to nonzero.                                          @L2A 03448200
*                                                                       03448300
ARAPATHNAME DSECT                                                  @L2A 03448400
ARAPATHLEN  DS    H      LENGTH OF SIGNIFICANT CHARACTERS THAT     @L2A*03448500
                         follow                                    @L2A 03448600
ARAPATHNAM  DS    CL255  CHARACTERS IN PATH NAME (UP TO 255-LEFT   @L2A*03448700
                         justified, padded with blanks)            @L2A 03448800
ARAPNAMLEN  EQU   *-ARAPATHNAME PATH NAME LENGTH                   @L2A 03449400
         SPACE 1                                                        03450000
         MEND      END LONG PL/X MACRO COMMENT */                       03500000
    %IF ARABASE = '' %THEN    ]ARABASE defaults to CHAR INTERNAL        03550000
      %ARABASE = 'BASED';     ]Supply default for base expression       03600000
 DECLARE                                                                03650000
   1 ARA      ARABASE,        ]ALLOCATION RETRIEVAL AREA                03700000
     2 ARALEN   FIXED(15),    ]Length of this area for one data set,    03750000
                              ]  including this and padding. Do not use 03800000
                              ]  this to calculate number of volumes.   03850000
     2 ARAFLG   BIT(8),       ]ARA flags                           @L1A 03875000
       3  ARAXINF BIT(1),     ]Extended Information Segment present@L1A 03900000
       3  *     BIT(7),       ]Reserved                            @L1A 03925000
     2 ARAXINOF BIT(8),       ]Offset in double words to Extended  @L1A 03950000
                              ]  Info Segment                      @L1A 03975000
     2 ARAJFCB  CHAR(176),    ]Main JFCB for one data set               04000000
 /* End of minimum length of ARA. */                                    04050000
     2 ARAVOL   CHAR(6);      ]6th and later volumes if any.  Len       04100000
                              ]of this area is (JFCBNVOL-5)*6.  Entries 04150000
                              ]at end can be blanks.  If first byte of  04200000
                              ]an entry is X'FF', VOL=REF was specified 04250000
                              ]and the serial number has not been       04300000
                              ]determined.                              04350000
 DECLARE                                                                04357100
   1 ARAXINFO BASED(ADDR(ARA)+8*ARAXINOF), ]Extended Information   @P1C 04361800
                              ]Segment                             @P1A 04366500
     2 ARAXINLN FIXED(15),    ]Length of Extended Info Segment     @L1A 04371300
                              ] (including 8 byte header)          @L1A 04378400
     2 ARAPATHO FIXED(15),    ]Offset from beginning of Extended   @L2A 04380500
                              ] Info Segment to the path name if   @L2A 04382600
                              ] present. Otherwise zero.           @P1C 04384700
     2 *   CHAR(4),           ]Reserved                            @L2C 04386800
     2 ARAXLBKS  BIT(64),     ]BLKSIZE VALUE                       @L1A 04389100
     2 ARABKSLM  BIT(64),     ]BLKSZLIM VALUE                      @01A 04392700
     2 *   CHAR(16)           ]Reserved                            @L2C 04442700
                      ;  ]End of main part of extended info seg    @L2A 04492700
 DECLARE        ] Path name. Present only if user sets ARLUSS on   @L2A 04542700
                ] and system set ARAPATHO to nonzero.              @L2A 04592700
    1 ARAPathName CHAR(257)                ]                       @P1C 04630200
         BASED(ADDR(ARAXINFO)+ARAPATHO),   ]Path name              @P1A 04667700
      2 ARAPathLen FIXED(15) BDY(BYTE), ]Length of significant     @P1C 04705200
                                     ]characters in next field     @L2A 04742700
      2 ARAPathNam CHAR(255)         ]Characters in path name (up  @P1C 04792700
                                     ]to 255-left justified,       @L2A 04842700
                                     ]padded with blanks)          @L2A 04892700
                      ;  ]End of IHAARA and extended info segment  @L2A 04942700
