*                                                                               
*        %GOTO ASCBL1;  /*                                                      
         MACRO                                                                  
         IHAASCB &DSECT=YES,&LIST=NO                               @D6C         
**/                                                                             
*%ASCBL1 : ;                                                                    
*                                                                               
*/* START OF SPECIFICATIONS **************************************** */         
*/*                                                                  */         
*/*01* MACRO NAME = IHAASCB                                          */         
*/*                                                                  */         
*/*01* DESCRIPTIVE NAME = ADDRESS SPACE CONTROL BLOCK                */         
*/*                                                                  */         
*/*01* PROPRIETARY STATEMENT =                                   @L8C*/         
*/*                                                                  */         
*/*      LICENSED MATERIALS - PROPERTY OF IBM                        */         
*/*      5650-ZOS COPYRIGHT IBM CORP. 1977, 2021                     */         
*/*                                                                  */         
*/*01* STATUS = HBB77D0                                              */         
*/*                                                                  */         
*/*01* EXTERNAL CLASSIFICATION:                                      */         
*/*02*         DMTI:BASE                                             */         
*/*02*         GUPI:FIELDS                                           */         
*/*                  ASCBASID                                        */         
*/*                  ASCBASSB                                        */         
*/*                  ASCBASXB                                        */         
*/*                  ASCBFW3                                     @LKA*/         
*/*                  ASCBNOFT                                    @LMA*/         
*/*                  ASCBPO1M                                    @LPA*/         
*/*                  ASCBP1M0                                    @LPA*/         
*/*                  ASCBSDBF                                    @LKA*/         
*/*                  ASCBXTCB                                        */         
*/*02*         PSPI:FIELDS                                           */         
*/*                  ASCBDCTI                                        */         
*/*                  ASCBEJST                                        */         
*/*                  ASCBJBNI                                        */         
*/*                  ASCBJBNS                                        */         
*/*                  ASCBLSQT                                        */         
*/*                  ASCBOUCB                                        */         
*/*                  ASCBOUXB                                        */         
*/*                  ASCBRSME                                        */         
*/*                  ASCBSRBT                                        */         
*/*                  ASCBTCBS                                        */         
*/*                  ASCBTCBE                                        */         
*/*                  ASCBLSQE                                        */         
*/*01* END OF EXTERNAL CLASSIFICATION:                               */         
*/*01*                                                               */         
*/*01* ACRONYM: ASCB                                                 */         
*/*01* DSECT NAME:  ASCB                                             */         
*/*                                                                  */         
*/*01* COMPONENT:  SUPERVISOR CONTROL (SC1C5)                        */         
*/*                                                                  */         
*/*01* EYE-CATCHER:  ASCB                                            */         
*/*02*   OFFSET:   0                                                 */         
*/*02*   LENGTH:   4                                                 */         
*/*01* STORAGE ATTRIBUTES:                                           */         
*/*02*   MAIN STORAGE:                                               */         
*/*02*   VIRTUAL STORAGE:                                            */         
*/*02*   AUXILIARY STORAGE:                                          */         
*/*02*   DATA SPACE:                                                 */         
*/*02*   SUBPOOL:           245                                      */         
*/*02*   KEY:           0                                            */         
*/*02*   RESIDENCY:     Below 16M                                    */         
*/*01* SIZE: 384 bytes                                               */         
*/*01* CREATED BY:  IEAMSWCB, IEAVEMRQ                               */         
*/*01* POINTED TO BY:                                                */         
*/*     CVTASCBH and CVTASCBL fields of the CVT data area            */         
*/*     PSAANEW field of the PSA data area                           */         
*/*     PSAAOLD field of the PSA data area (Master's ASCB)           */         
*/*     ASVTENTY field of the ASVT data area                         */         
*/*     ASCBFWDP, ASCBBWDP and ASCBTRQP fields of the ASCB data area */         
*/*     ASMASCBP field of the ASMVT data area                        */         
*/*     JSELASCB field of the JSEL data area                         */         
*/*     LCTASCBA field of the LCT data area                          */         
*/*     LDAASCB field of the LDA data area                           */         
*/*     LWAPASCB field of the LWA data area                          */         
*/*     PCBASCB field of the PCB data area                           */         
*/*     RSMASCB field of the RSMHD data area                         */         
*/*     SMCAASCB field of the SMCA data area                         */         
*/*     SRBASCB field of the SRB data area                           */         
*/*     SSENASCB and SSETASCB fields of the SSOB data area           */         
*/*     TCASASCB field of the TCAST data area                        */         
*/*     TQEASCB field of the TQE data area                           */         
*/*     TSBASCBA field of the TSB data area                          */         
*/*     TVCSASCB field of the TVCS data area                         */         
*/*     TWAASCB field of the TWAR data area                          */         
*/*     UCMASCB field of the UCM data area                           */         
*/*     OUCBASCB field of the OUCB data area                         */         
*/*     WEBHASCB field of the WEB data area                          */         
*/*     WEBLSQP field of the WEB data area                           */         
*/*                                                                  */         
*/*01* SERIALIZATION: Serialization of the ASCB is dependent on      */         
*/*   the field being referenced. Some serialization techniques      */         
*/*   used here are local lock, compare and swap (CS), compare       */         
*/*   double and swap, and global intersect.                         */         
*/*01* FUNCTION:  Contain information and pointers needed for        */         
*/*   Address Space Control.  The ASCB is non-swappable.             */         
*/*                                                                  */         
*/*01* METHOD OF ACCESS =                                            */         
*/*      BAL  - DSECT IS PRODUCED UNLESS DSECT=NO IS SPECIFIED.      */         
*/*             USING ON ASCB GIVES ADDRESSABILITY FOR ALL SYMBOLS.  */         
*/*      BAL  LISTING - SPECIFY LIST=YES ON MACRO CALL               */         
*/*      PL/S - DCL ASCBPTR PTR                                      */         
*/*      PL/S LISTING - SPECIFY %IHALIST='YES' BEFORE %INCLUDE       */         
*/*                                                                  */         
*/*01* DEPENDENCIES:                                                 */         
*/*                                                                  */         
*/*      For any field additions/modifications to the IHAASCB macro: */         
*/*                                                                  */         
*/*      1) IEAASCBP (ASCB dump formatter) should be updated         */         
*/*         appropriately.                                       @PBA*/         
*/*                                                                  */         
*/*01* DISTRIBUTION LIBRARY = AMACLIB                                */         
*/*                                                                  */         
*/* END OF SPECIFICATIONS ****************************************** */         
*%GOTO ASCBL2;  /*                                                              
.*                                                                              
.*********************************************************************          
.*   CHANGE ACTIVITY=                                                           
.*                                                                              
.*   OZ40479 - MOVE ASCBTOFF FROM ASCBFLG1 TO ASCBRCTF BYTE FOR                 
.*             COMPARE AND SWAP SERIALIZATION. THIS IS THE RCT BYTE             
.*             BUT RCT DOESNT USE THIS BIT                   @ZA40479           
.*   OZ58694 - ASCBSSOM IS SERIALIZED BY USING COMPARE AND SWAP                 
.*             RATHER THAN THE DISPATCHER LOCK               @ZA58694           
.*   OZ68643 - SUPPORT A VERSION CODE FOR THE ASCB           @ZA68643           
.*   OZ94366 - NEW BIT ASCBJSTE TO INDICATE ASCB ON SVTJSTEQ @ZA94366           
.*                                                                              
.*   G860PXX - HBB2102 SUPPORT                                                  
.*                                                                              
.*  $L1=RAS      JBB1326  800918  PD16XK:  RAS ENHANCEMENTS                     
.*  $L2=EXTREAL  JBB1326  800918  PD16XK:  EXTENDED REAL ADDRESSING             
.*  $P1=PMM0013  JBB1326  800918  PD16XZ:  CHANGE ASCBXCNT DECLARE              
.*  $D1=DCR0114  JBB1326  810115  PD16XK:  FIELD FOR TCAM                       
.*  $D2=DCR0018  JBB2110  820517  PD16XZ:  MOVE BIT ASCBS3S                     
.*  $D3=DCR0018  JBB2110  820630  PD16FH:  CREATE LEVEL NUMBER FIELD            
.*  $D4=DCR0044  JBB2110  820817  PD16F5:  CREATE GRS COUNTER                   
.*  $H1=ADVPROC2 JBB2133  821013  PD16F5:  AXP                                  
.*  $P2=PAE0007  JBB2133  821019  PD16XD:  UPDATE CHANGE-ACTIVITY               
.*  $D5=DCR0019  JBB2133  820609  PD16FN:  CREATE PTR TO RAB EXTENSION          
.*  $D6=DCR0009  JBB2214  841015  PD16G1:  ASSB SUPPORT                         
.*  $D7=DCR0062  JBB2133  841115  PD16FN:  ASCBCHAP MOVELSW SUPPORT             
.*  $D8=DCR0040  JBB2220  841112  PD16G1:  ASSB SUPPORT                         
.*  $D9=DCR0007  JBB2220  840813  PD16XK:  MOVE AND EXPAND ASM FIELDS           
.*  $L3=REASID   JBB2220  841112  PD16G1:  REUSABLE ASIDS                       
.*  $L4=TRQ      JBB2217  850325  PD16FN:  TRUE READY QUEUE                     
.*  $P3=PCI0032  JBB2217  850930  PD16FN:  TRUE READY QUEUE                     
.*  $01=OZ94676  JBB2216  860131  PD16Q4:  SUPPORT FOR CICS/XRF                 
.*  $02=OY03626  JBB2217  870101  PD16Q4:  CHANGE ASCBFMCT FROM                 
.*                                         FIXED(15) TO FIXED(16)               
.*                                         FOR > 128 MEG REAL.                  
.*  $L5=RTMRAS   HBB3310  860206  PD16Q4:  RTM RAS SUPPORT                      
.*  $DA=DCR0220  HBB3310  870216  PD16FH:  REDUCED PREEMPTION                   
.*  $03=OY07913  JBB2217  870731  PD161M:  DEFINE ASCBGQIR.                     
.*  $L6=PR313    JBB3313  881216  PD16BN:  CHANGE ASCBFMCT COMMENT              
.*  $04=OY26326  JBB3313  890930  PD16Q4:  DEFINE ASCBLLSQ.                     
.*  $L7=ASCB     HBB4410  880404  PD16BN:  ASCB VSCR SUPPORT                    
.*  $P4=PEO2836  HBB4410  900105  PD16CU:  DEFINE ASCBLSAS.                     
.*  $05=OY46976  HBB4420  911111  PD16EJ:  DEFINE ASCBNSTK.                     
.*  $06=OY58195  HBB4430  920915  PD16H5:  Define ASCBTRQC                      
.*  $L8=DISPR    HBB5510  930801  PD16CU:  DISPATCHER RESTRUCTURE               
.*                                                                              
.*                                         MULTISYSTEM SLIP                     
.*                                         ENHANCEMENTS                         
.*  $L9=SHPCS    HBB5510  930304  PD16EI:  DEFINE BIT ASCBSAS FOR               
.*  $P5=PIG4108  HBB5510  930320  PD16EI:  SPECIFICATION EXCEPTION              
.*                                         ON SRB DISPATCH.  MOVED              
.*                                         BIT ASCBSAS.                         
.*  $LA=WLMI     HBB5510  911104  PY12AG:  WORKLOAD MANAGER I                   
.*  $LB=DISPR    HBB5510  930801  PD16IW:  ASCBMEMP DEFINITION                  
.*  $07=OW05760  HBB5510  940512  PC89GD:  Local lock performance               
.*                                         (TRSQ PTM# PIG5378)                  
.*  $LC=WLMP     HBB6603  951012  B7HGEJ:  Tcb-In-Enclaves                      
.*  $P6=PQC0697  HBB6603  960104  B7HGEJ:  Define Bit Constant for              
.*                                         ASCBDSTK.                            
.*  $P7=PQC0753  HBB6603  960201  B7HGEJ:  Correct Bit ASCBDSTZ                 
.*                                         declaration so that PL/AS            
.*                                         can still compile.                   
.*  $P8=PQC0769  HBB6603  960201  B7HG2M:  Correct Bit ASCBDSTZ                 
.*                                         declaration so that PL/X             
.*                                         allows it in SETS/REFS on            
.*                                         Generate                             
.*  $08=OW20780  HBB5510  960603  R4GAXZ:  Update descriptions of               
.*                                         ASCBLTCS, LTCL, LTCB, and            
.*                                         LTCN to include                      
.*                                         'preemptable-class SRBs'.            
.*  $P9=PUX0132  HBB6605  970603  R4GAXZ:  Make ASCBXMPQ reserved.              
.*  $LD=PADS2    HBB7707  010920  PD00XB:  ASCBCNIP                             
.*  $LE=LXREU    HBB7709  030801  PD00XB:  ASN-and-LX-Reuse Facility            
.*  $PA=ME02621  HBB7720  050105  PD00GD:  Track holder information             
.*  $09=OA09688  HBB7709  050321  PD00CJ:  ASCBLQEL serialization               
.*                                         statement update                     
.*  $P9=ME04378  HBB7730  050914  PD00BC:  Remove ASCBCREQ                      
.*  $0A=OA14340  HBB7709  060106  PD00OO:  Define ASCBIOSX                      
.*  $LF=HCR9     HBB7740  060418  PD00XB:  IEA_LXS check                        
.*  $LG=ME06938  HBB7740  060419  PD00QR:  Add SRM flags                        
.*  $LH=GRSTOR2  HBB7740  060613  PD00FY:  REMOVE ASCBLQEL,ASCBGQEL             
.*  $PB=ME07341  HBB7740  060731  PD00RY:  Remove ASCBGSYN                      
.*  $LI=ME08949  HBB7740  061225  PD00D0:  Added ASCBVCMGivePreemption          
.*  $0B=OA20633  JBB772S  070501  PD00D0:  Added ASCBVCMGiveSigpAny             
.*  $LJ=CACHE    HBB7760  080601  PD00XB:  Moved ASCB/ASSB/ASXB fields          
.*  $LK=ME13799  HBB7760  080618  PD00XB:  ASCBSDB1                             
.*  $LL=CACHE2   HBB7770  090415  PD00XZ:  Moved ASCB fields                    
.*  $LM=ME20533  HBB7790  101130  PD00XB:  ASCBNOFT                             
.*  $LN=FORCETCB HBB7790  110401  PD00SW:  ASCBNOFT Updates                     
.*  $LO=ME23254  HBB7790  110810  PD00XB:  ASCBSVCN                             
.*  $LP=1MPAGE   HBB7790  120509  PD00XB:  PageFrameSize1M                      
.*  $LQ=ME24369  HBB7790  120515  PD00BS:  SMF30 Counter Section                
.*  $LR=CSVEXITS HBB77A0  141001  PD00XB:  CSVEXITs                             
.*  $0C=OA48571  HBB77A0  150923  PD00NJ:  Add HFTS dispatch counts             
.*  $0D=OA50953  HBB7790  160715  PD00D0:  Honor Priority Ineligible            
.*  $0E=OA52902  HBB77B0  170515  PD00XB:  ASCBM881                             
.*  $0F=OA54589  HBB7790  171225  PD00KP:  CR2                                  
.*  $LS=zCBP     HBB77C0  171012  PD00NJ:  zCBP                                 
.*  $0G=FB       HBB77B0  190131  PD00XB:  FB                                   
.*  $0H=OA58732  HBB77D0  200515  PD00XB:  ASCBXMSO                             
.*  $0I=OA60036  HBB77C0  211012  PD00NJ:  z16                                  
.*                                                                              
.*********************************************************************          
.*                                                                              
.*********************************************************************          
.*                                                                              
.* THE FOLLOWING ARE THE NAMING CONVENTIONS USED FOR RESERVED AREAS             
.*     1. RESERVED FIELDS ARE NAMED AS FOLLOWS                                  
.*                        ASCBRXXX DS    ???       - RESERVED.                  
.*                             XXX IS THE OFFSET WITHIN THE ASCB                
.*                             ??? IS THE FIELD SIZE                            
.*                                                                              
.*     2. PL/S - RESERVED FIELDS DEFINED AS BIT STRINGS WHICH ARE NOT           
.*               MULTIPLES OF 8 OR DO NOT START ON A BYTE BOUNDARY              
.*               ARE NOT NAMED.                                                 
.*                                                                              
.*********************************************************************          
.*                                                                              
         PUSH  PRINT                                               @D6A         
         AIF   ('&LIST' EQ 'YES').ASCBLST                          @D6A         
         PRINT OFF                                                 @D6A         
.ASCBLST ANOP                                                      @D6A         
         SPACE 1                                                                
         AIF ('&DSECT' EQ 'NO').ASCB10                                          
ASCB     DSECT                                                                  
         AGO .ASCB20                                                            
.ASCB10  ANOP                                                                   
         DS    0D                                                               
ASCB     EQU   *                                                                
.ASCB20  ANOP                                                                   
ASCBEGIN DS    0D -                BEGINNING OF ASCB                            
ASCBASCB DS    CL4 -               ACRONYM IN EBCDIC -ASCB-                     
ASCBFWDP DS    A -                 ADDRESS OF NEXT ASCB ON ASCB READY           
*                                  QUEUE                                        
ASCBBWDP DS    A -                 ADDRESS OF PREVIOUS ASCB ON ASCB             
*                                  READY QUEUE                                  
ASCBLTCS DS    A -                 TCB and preemptable-class SRB   @07C         
*                                  Local lock suspend service queue.            
*                                  Serialization: ASCB CML promotion            
*                                  WEB lock.                                    
ASCBDiag010 DS 0D                  IBM use only                    @0IC         
ASCBSUPC_PREZOS12 DS 0D -          SUPERVISOR CELL FIELD           @LLC         
ASCBSVRB_PREZOS12 DS A  -          SVRB POOL ADDRESS.              @LLC         
ASCBSYNC_PREZOS12 DS F -           COUNT USED TO SYNCHRONIZE SVRB POOL.-        
                                                                   @LLC         
ASCBIOSP DS    A -                 POINTER TO IOS PURGE INTERFACE               
*                                  CONTROL BLOCK (IPIB)                         
*                                  (MDC308)                    @Z40FP9A         
ASCBWQLK DS    0XL4                WEB QUEUE LOCK WORD             @L8A         
*                                  SERIALIZATION: COMPARE AND SWAP              
*                                  OWNERSHIP: SUPERVISOR CONTROL                
ASCBR01C DS    XL2                 RESERVED, MUST BE ZERO          @L8A         
ASCBWQID DS    H                   LOGICAL CPU ID OF THE PROCESSOR @L8A         
*                                  HOLDING THE WEB QUEUE LOCK                   
*                                  OWNERSHIP: SUPERVISOR CONTROL                
ASCB_Job_Step_SeqNum DS 0F -       Sequence number incremented at job           
*                                  step change, when ASSB and ASCB time         
*                                  and counts fields are reset. Used            
*                                  to sequence resets of the time and           
*                                  count fields                    @0CA         
ASCBSAWQ_PREZOS11 DS A -           ADDRESS OF ADDRESS SPACE SRB WEB             
*                                  QUEUE                           @LJC         
*                                  SERIALIZATION: WEB QUEUE LOCK                
*                                  OWNERSHIP: SUPERVISOR CONTROL                
*                                  Not set as of z/OS 1.11                      
ASCBURRQ_PREZOS11 EQU X'80' -      SYSEVENT USER READY REQUIRED    @LJC         
*                                  SERIALIZATION: WEB QUEUE LOCK                
*                                  OWNERSHIP: SUPERVISOR CONTROL                
*                                  Not set as of z/OS 1.11                      
ASCBASN  DS    0H -                SAME AS ASCBASID                @L8A         
ASCBASID DS    H -                 ADDRESS SPACE IDENTIFIER FOR THE             
*                                  ASCB                                         
ASCBDiag026 DS X -                 IBM use only                    @0GC         
ASCBSRMFlags DS X -                SRM flags                                    
*                                  Ownership: SRM                  @LGA         
*                                  Serialization: SRMLOCK          @LGA         
ASCBVCMOverRide EQU   X'80' -      This bit indicates that this                 
*                                  address space should not follow              
*                                  the standard SRM management in               
*                                  an VCM=on environment.                       
*                                  Instead of trying to assign the              
*                                  work this address space to the               
*                                  same affinity node for cache                 
*                                  efficiency concerns, assign this             
*                                  work to any affinity node, ignore            
*                                  any cache concerns.                          
*                                  Ownership: SRM                  @LGA         
ASCBBrokenUp    EQU   X'40' -      This bit indicates that this                 
*                                  address space has been broken up             
*                                  by SRM.                                      
*                                  Ownership: SRM                  @LGA         
ASCBVCMGivePreemption EQU X'20' -  This bit indicates that this                 
*                                  address space should get full                
*                                  preemption.                                  
*                                  Ownership: SRM                  @LIA         
ASCBVCMGiveSigpAny EQU X'10'    -  This bit indicates that this                 
*                                  address space can SIGP any                   
*                                  waiting CPUs to process its work.            
*                                  Ownership: SRM                  @0BA         
AscbInEligHonorPriority EQU X'08'  When on, specialty engine eligible  X        
                                   work in this address space will not X        
                                   be offloaded to CPs for help        X        
                                   processing.                         X        
                                   Ownership: SRM                  @0DA         
AscbSRMFlagsDiag EQU X'06'         Diagnostic data for IBM use only@LSA         
ASCBLL5  DS    X -                 FLAGS. SERIALIZATION - LOCAL    @D2A         
*                                  LOCK                            @D2A         
ASCBS3S  EQU   X'20' -             STAGE II EXIT EFECTOR HAS       @D2M         
*                                  SCHEDULED AN RQE OR IQE AND     @D2M         
*                                  STAGE III EXIT EFFECTOR         @D2M         
*                                  SHOULD BE INVOKED               @D2M         
ASCBHLHI DS    FL1 -               INDICATION OF SUSPEND LOCKS     @L4C         
*                                  HELD AT TASK SUSPENSION         @L4C         
ASCBDPH  DS    0H -                HALFWORD DISPATCHING PRIORITY   @L4A         
ASCBDPHI DS    FL1 -               HIGH ORDER BYTE OF HALFWORD     @L4A         
*                                  DISPATCHING PRIORITY            @L4C         
ASCBDP   DS    FL1 -               DISPATCHING PRIORITY RANGE FROM              
*                                  0-255                                        
ASCBTCBE DS    FL4 -               Count of ready tcbs in the      @LCC         
*                                  space that are in an enclave.                
*                                  Ownership:  Task Management                  
*                                  Serialization: Compare and Swap and          
*                                  WEB Lock of TCB for which this count         
*                                  is being manipulated.                        
ASCBLDA  DS    A -                 POINTER TO LOCAL DATA AREA PART OF           
*                                  LSQA FOR VSM                                 
ASCBRSMF DS    B -                 RSM ADDRESS SPACE FLAGS                      
*                                  (MDC368)                    @ZA17355         
ASCB2LPU EQU   X'80' -             SECOND LEVEL PREFERRED USER.  THIS           
*                                  OFFSET FIXED BY ARCHITECTURE.                
*                                  (MDC369)                    @G50EP9A         
ASCB1LPU EQU   X'40' -             FIRST LEVEL PREFERRED USER                   
*                                  (MDC370)                    @ZA17355         
ASCBN2LP EQU   X'20' -             SRM IN SYSEVENT TRANSWAP SHOULD NOT          
*                                  SET ASCB2LPU BIT - HOWEVER IT MAY            
*                                  ALREADY BE ON AND WILL STAY ON               
*                                  (MDC371)                    @ZA17355         
ASCBVEQR EQU   X'10' -             V=R ADDRESS SPACE  (MDC372) @ZA17355         
ASCBFLG3 DS    X   -               Flags needing no serialization  @LDA         
ASCBCNIP EQU   X'80' -             Address space created during NIP             
*                                                                  @LDA         
ASCBREUS EQU   X'40' -             This is a reusable ASID. It may be           
*                                  given out only to a reusable ASID            
*                                  requestor                       @LEA         
ASCBM881 EQU   X'20'               This address space went through              
*                                  IEEMB881                        @0EA         
ASCBR036 DS    0H                  Reserved as of z/OS 1.11        @LJA         
ASCBHASI_PREZOS11 DS H -           Local lock owning ASID.         @LJC         
*                                  Not set as of z/OS 1.11                      
ASCBCSCB DS    A -                 ADDRESS OF CSCB                              
ASCBTSB  DS    A -                 ADDRESS OF TSB                               
ASCBEJST DS    D -                 ELAPSED JOB STEP TIMING  UNSIGNED            
*                                  64 BIT BINARY NUMBER                         
ASCBEWST DS    D -                 TIME OF DAY WHENEVER I-STREAM IS             
*                                  SWITCHED FROM A MEMORY                       
ASCBJSTL DS    F -                 CPU TIME LIMIT FOR THE JOB STEP              
*                                  UNSIGNED 32 BIT BINARY NUMBER                
ASCBECB  DS    F -                 RCT'S WORK ECB                               
ASCBUBET DS    F -                 TIME STAMP WHEN USER BECOMES READY           
ASCBTLCH DS    A -                 CHAIN FIELD FOR TIME LIMIT EXCEEDED          
*                                  QUEUE  (MDC329)             @G50DP9A         
ASCBDUMP DS    A -                 SVC DUMP TASK TCB ADDRESS                    
ASCBFW1  DS    0F -                FULL-WORD LABEL TO BE USED FOR               
*                                  COMPARE AND SWAP FOR ANY BIT IN              
*                                  THIS WORD                     MDC026         
ASCBAFFN DS    H -                 CPU AFFINITY INDICATOR                       
ASCBRCTF DS    B -                 FLAGS FOR RCT SERIALIZED BY COMPARE          
*                                  AND SWAP                    @ZA40479         
ASCBTMNO EQU   X'80' -             MEMORY IS BEING QUIESCED, IS                 
*                                  QUIESCED, OR IS BEING RESTORED               
ASCBFRS  EQU   X'40' -             RESTORE REQUEST                              
ASCBFQU  EQU   X'20' -             QUIESCE REQUEST                              
ASCBJSTE EQU   X'10' -             JOB STEP TIME EXCEEDED. NOT USED BY          
*                                  RCT                         @ZA94366         
ASCBWAIT EQU   X'08' -             LONG WAIT INDICATOR                          
ASCBOUT  EQU   X'04' -             ADDRESS SPACE CONSIDERED SWAPPED OUT         
ASCBTMLW EQU   X'02' -             MEMORY IS IN A LONG WAIT                     
ASCBTOFF EQU   X'01' -             MEMORY SHOULD NOT BE CHECKED FOR JOB         
*                                  STEP TIMING. NOT USED BY RCT@ZA40479         
ASCBFLG1 DS    B -                 FLAG FIELD                                   
ASCBLSAS EQU   X'80' -             ADDRESS SPACE IS LOGICALLY SWAPPED  -        
                                   OUT                                 -        
                                   SERIALIZATION - WHEN SETTING, CPU   -        
                                   LOCK, AND THE SWAP INTERSECT        -        
                                                 - WHEN RESETTING,     -        
                                   NONE REQUIRED                   @DHC         
ASCBDSTK EQU   X'40' -             SRM REQUIRES A TIME STAMP TO    @P6C         
*                                  DETERMINE WHEN THE ADDRESS SPACE             
*                                  GOES INTO LONG WAIT.  ASCBEWST WILL          
*                                  BE UPDATED WHEN THIS BIT IS ON.              
*                                  NOTE:  If this bit moves position            
*                                  the bit constant ASCBDSTZ must also          
*                                  be changed.                                  
ASCBDSTZ EQU   X'40' -             Bit constant for bit position  @P7A          
*                                  ASCBDSTK.  PL/X cannot map bit               
*                                  positions in generated code, so              
*                                  this bit constant allows PL/X to             
*                                  set the bit in generated assembler.          
ASCBTERM EQU   X'10' -             ADDRESS SPACE TERMINATING NORMALLY           
ASCBABNT EQU   X'08' -             ADDRESS SPACE TERMINATING ABNORMALLY         
ASCBMEMP EQU   X'04' -             Memory Termination PURGEDQ flag @LBA         
*                                  Serialization: none                          
ASCBTMCH DS    F -                 TERMINATION QUEUE CHAIN                      
ASCBASXB DS    A -                 POINTER TO ADDRESS SPACE EXTENSION           
*                                  CONTROL BLOCK (ASXB)                         
ASCBFW2  DS    0F -                FULLWORD LABEL TO ADDRESS BITS IN            
*                                  THIS WORD  (MDC330)         @G50DP9A         
ASCBSWCT DS    H -                 NUMBER OF TIMES MEMORY ENTERS SHORT          
*                                  WAIT                                         
ASCBDSP1 DS    B -                 NONDISPATCHABILITY FLAGS.                    
*                                  SERIALIZATION - GLOBAL INTERSECT.            
*                                                     (MDC388) @G381P9A         
ASCBSSND EQU   X'80' -             SYSTEM SET NONDISPATCHABLE AND THIS          
*                                  ASCB IS NOT EXEMPT (MDC331) @G50DP9A         
ASCBFAIL EQU   X'40' -             A FAILURE HAS OCCURRED WITHIN THE            
*                                  ADDRESS SPACE. THE MEMORY IS                 
*                                  NONDISPATCHABLE                              
ASCBSNQS EQU   X'20' -             STATUS STOP NON-QUIESCABLE LEVEL             
*                                  SRB'S  (MDC323)             @G50DP9A         
ASCBSSSS EQU   X'10' -             STATUS STOP SRB SUMMARY                      
*                                  (MDC332)                    @G50DP9A         
ASCBSTND EQU   X'08' -             TCB'S NONDISPATCHABLE                        
*                                  (MDC322)                    @G50DP9A         
ASCBUWND EQU   X'04' -             STATUS SET UNLOCKED WORKUNITS   @LAA         
*                                  NONDISPATCHABLE.                @LAA         
ASCBNOQ  EQU   X'02' -             ASCB NOT ON SWAPPED IN QUEUE    @L4A         
*                                                                               
ASCBFLG2 DS    B -                 FLAG BYTE.                                   
*                                  SERIALIZATION - GLOBAL INTERSECT             
*                                                     (MDC387) @G381P9A         
ASCBXMPT EQU   X'80' -             ASCB EXEMPT FROM SYSTEM                      
*                                  NONDISPATCHABLE               MDC013         
ASCBPXMT EQU   X'40' -             ASCB PERMANENTLY EXEMPT FROM SYSTEM          
*                                  NONDISPATCHABLE               MDC014         
ASCBCEXT EQU   X'20' -             CANCEL TIMER EXTENSION BECAUSE EOT           
*                                  PROCESSING IS STARTED FOR THE JOB            
*                                  STEP TCB                      MDC021         
ASCBS2S  EQU   X'10' -             FOR LOCK MANAGER, ENTRY MADE TO              
*                                  STAGE II EXIT EFFECTOR WITHOUT               
*                                  CORRESPONDING ENTRY TO STAGE III             
*                                  EXIT EFFECTOR                 MDC020         
ASCBNCML EQU   X'08' -             ASCB NOT ELIGIBLE FOR CML LOCK               
*                                  REQUESTS                        @LAM         
ASCBNOMT EQU   X'04' -             ADDRESS SPACE MUST NOT BE MEMTERMED          
*                                  UNLESS A DAT ERROR HAS OCCURRED.             
*                                  IF A DAT ERROR HAS OCCURRED, ACTION          
*                                  IS CONTROLLED BY ASCBNOMD.                   
*                                  OWNERSHIP - SCHEDULER                        
*                                                     (MDC387) @G381P9A         
ASCBNOMD EQU   X'02' -             IF ON,ADDRESS SPACE CANNOT BE                
*                                  MEMTERMED ON A DAT ERROR.                    
*                                  IF OFF, PROCESS MEMTERM ON A DAT             
*                                  ERROR.                                       
*                                  OWNERSHIP - SCHEDULER                        
*                                                     (MDC387) @G381P9A         
ASCBSCNT DS    0F -                FULLWORD LABEL FOR COMPARE AND SWAP          
*                                  (CS)  (MDC333)              @G50DP9A         
         DS    H -                 FIRST HALFWORD OF ASCBSCNT MUST BE           
*                                  ZERO               (MDC387) @G381P9A         
ASCBSRBS DS    H -                 COUNT OF SRB'S SUSPENDED IN THIS             
*                                  MEMORY  (MDC325)            @G50DP9A         
ASCBLLWQ DS    A -                 ADDRESS SPACE LOCAL LOCK        @04C         
*                                  SUSPEND SERVICE WEB QUEUE                    
*                                  SERIALIZATION: WEB QUEUE LOCK                
*                                  OWNERSHIP: SUPERVISOR CONTROL                
ASCBRCTP DS    A -                 POINTER TO REGION CONTROL TASK (RCT)         
*                                  TCB  (MDC334)               @G50DP9A         
ASCBLKGP DS    0D -                LOCK GROUP  (MDC306)        @Z40FP9A         
ASCBLOCK DS    F -                 LOCAL LOCK.  THIS OFFSET FIXED BY            
*                                  ARCHITECTURE.  (MDC305)     @G50EP9A         
ASCBLSWQ DS    A -                 ADDRESS SPACE LOCAL LOCK WEB    @L8C         
*                                  SUSPEND QUEUE                                
*                                  THIS OFFSET FIXED BY ARCHITECTURE.           
*                                  (MDC307)                    @G50EP9A         
*                                  SERIALIZATION: CDS WITH ASCBLOCK             
*                                  OWNERSHIP: SUPERVISOR CONTROL                
ASCBS3NL EQU   X'80' -             THE LOCAL LOCK IS NEEDED BY THE @L8A         
*                                  STAGE 3 EXIT EFFECTOR TO QUEUE               
*                                  ASYNCHRONOUS EXITS           E               
*                                  SERIALIZATION: CDS WITH ASCBLOCK             
*                                  OWNERSHIP: SUPERVISOR CONTROL                
ASCBLTCL EQU   X'01'  -            THE LOCAL LOCK IS NEEDED BY SOME             
*                                  TCB or preemptable-class SRB                 
*                                  WHEN SET IN BIT 31 OF ASCBLSWQ. @07A         
ASCBQECB DS    F -                 QUIESCE ECB                                  
ASCBMECB DS    F -                 MEMORY CREATE/DELETE ECB                     
ASCBOUCB DS    A -                 SYSTEM RESOURCES MANAGER (SRM) USER          
*                                  CONTROL BLOCK POINTER                        
ASCBOUXB DS    A -                 SYSTEM RESOURCES MANAGER (SRM) USER          
*                                  EXTENSION BLOCK POINTER                      
ASCBFW2A DS    0F -                FULLWORD LABEL TO ADDRESS       @DAA         
*                                  BITS IN THIS WORD.                           
*                                  SERIALIZATION - CS.                          
ASCBFMCT DS    H -                 RESERVED. ALLOCATED PAGE FRAME  @L6C         
*                                  COUNT NOW RESIDES IN THE RAX                 
*                                  (MAPPING MACRO IARRAX).                      
ASCBLEVL DS    X -                 LEVEL NUMBER OF ASCB            @D3A         
ASCBVS00 EQU   X'00' -             HBB2102 (NOT IN BASE)       @ZA68643         
ASCBVS01 EQU   X'01' -             JBB2110                         @D3A         
ASCBVS02 EQU   X'02' -             JBB2133                         @H1A         
ASCBVS03 EQU   X'03' -             HBB4410                         @L7A         
ASCBVERS EQU   X'03' -             LEVEL OF THIS MAPPING           @L7C         
ASCBFL2A DS    B -                 FLAG BYTE.                      @DAA         
ASCBNOPR EQU   X'80' -             NO PREEMPTION FLAG              @DAA         
*                                  1=DO NOT SIGP ANOTHER PROCESSOR TO           
*                                    EXECUTE READY WORK IN THIS SPACE           
*                                  0=DO SIGP ANOTHER PROCESSOR                  
*                                    OWNERSHIP:     SRM                         
*                                    SERIALIZATION: CS ON ASCBFW2A              
ASCBHREQ_PREZOS11 DS 0A -          Local lock requestor address    @0CC         
*                                  Not set as of z/OS 1.11                      
ASCBEJST_Disps DS F -              Count of task dispatches.                    
*                                  Incremented and cache aligned with           
*                                  ASCBEJST.                                    
*                                  SERIALIZATION - CS.                          
*                                  OWNERSHIP - SUPERVISOR.         @0CA         
ASCBIQEA DS    A -                 POINTER TO IQE FOR ATCAM                     
*                                  ASYNCHRONOUS PROCESSING       MDC010         
ASCBRTMC DS    A -                 ANCHOR FOR SQA SDWA QUEUE                    
*                                                     (MDC388) @G381P9A         
ASCBMCC  DS    CL4 -               USED TO HOLD A MEMORY TERMINATION            
*                                  COMPLETION CODE ON ABNORMAL MEMORY           
*                                  TERMINATION                   MDC012         
ASCBJBNI DS    A -                 POINTER TO JOBNAME FIELD FOR                 
*                                  INITIATED PROGRAMS OR ZERO    MDC018         
ASCBJBNS DS    A -                 POINTER TO JOBNAME FIELD FOR                 
*                                  START/MOUNT/LOGON OR ZERO     MDC019         
ASCBSRQ  DS    0F -                DISPATCHER SERIALIZATION REQUIRED            
*                                  (MDC312)                    @G50DP9A         
ASCBSRQ1 DS    B -                 FIRST BYTE OF ASCBSRQ                        
*                                  (MDC313)                    @Z40FP9A         
ASCBDSG4 EQU   X'80' -             SIGNAL WAITING PROCESSORS WHEN               
*                                  INTERSECT IS RESET (MDC335) @G50DP9A         
ASCBDFLT EQU   X'40' -             DEFAULT LOCAL INTERSECT                      
*                                  (MDC336)                    @G50DP9A         
ASCBSRQ2 DS    B -                 SECOND BYTE OF ASCBSRQ                       
*                                  (MDC315)                    @Z40FP9A         
ASCBDSG3 EQU   X'80' -             SIGNAL WAITING PROCESSORS WHEN               
*                                  INTERSECT IS RESET (MDC337) @G50DP9A         
ASCBSRM1 EQU   X'02' -             SYSTEM RESOURCE MANAGER (SRM)                
*                                  INTERSECTING  (MDC338)      @G50DP9A         
ASCBQVER EQU   X'01' -             QUEUE VERIFICATION INTERSECTING              
*                                  (MDC339)                    @G50DP9A         
ASCBSRQ3 DS    B -                 THIRD BYTE OF ASCBSRQ                        
*                                  (MDC316)                    @Z40FP9A         
ASCBDSG2 EQU   X'80' -             SIGNAL WAITING PROCESSORS WHEN               
*                                  INTERSECT IS RESET (MDC340) @G50DP9A         
ASCBRCTI EQU   X'40' -             REGION CONTROL TASK (RCT)                    
*                                  INTERSECTING  (MDC381)      @ZM48358         
ASCBTCBV EQU   X'20' -             TCB VERIFICATION INTERSECTING                
*                                  (MDC342)                    @G50DP9A         
ASCBACHA EQU   X'10' -             ASCB CHAP INTERSECTING                       
*                                  (MDC343)                    @G50DP9A         
ASCBMTER EQU   X'04' -             MEMORY TERMINATION INTERSECTING              
*                                  (MDC345)                    @G50DP9A         
ASCBMINI EQU   X'02' -             MEMORY INITIALIZATION INTERSECTING           
*                                  (MDC346)                    @G50DP9A         
ASCBCBVE EQU   X'01' -             CONTROL BLOCK VERIFICATION                   
*                                  INTERSECTING  (MDC347)      @G50DP9A         
ASCBSRQ4 DS    B -                 FOURTH BYTE OF ASCBSRQ                       
*                                  (MDC317)                    @Z40FP9A         
ASCBDSG1 EQU   X'80' -             SIGNAL WAITING PROCESSORS WHEN               
*                                  INTERSECT IS RESET (MDC348) @G50DP9A         
ASCBDETA EQU   X'40' -             DETACH INTERSECTING                          
*                                  (MDC349)                    @G50DP9A         
ASCBATTA EQU   X'20' -             ATTACH INTERSECTING                          
*                                  (MDC350)                    @G50DP9A         
ASCBRTM2 EQU   X'10' -             RTM2 INTERSECTING  (MDC351) @G50DP9A         
ASCBRTM1 EQU   X'08' -             RTM1 INTERSECTING  (MDC352) @G50DP9A         
ASCBCHAP EQU   X'04' -             CHAP INTERSECTING  (MDC353) @G50DP9A         
ASCBSTAT EQU   X'02' -             STATUS INTERSECTING                          
*                                  (MDC354)                    @G50DP9A         
ASCBPURD EQU   X'01' -             PURGEDQ INTERSECTING                         
*                                  (MDC355)                    @G50DP9A         
ASCBVGTT DS    A -                 ADDRESS OF VSAM GLOBAL TERMINATION           
*                                  TABLE (VGTT)                  MDC024         
ASCBPCTT DS    A -                 ADDRESS OF PRIVATE CATALOG                   
*                                  TERMINATION TABLE (PCTT)      MDC025         
ASCBSSRB DS    H -                 COUNT OF STATUS STOP SRB'S                   
*                                  (MDC324)                    @G50DP9A         
ASCBSMCT DS    FL1 -               NUMBER OF OUTSTANDING STEP MUST              
*                                  COMPLETE REQUESTS IN ADDRESS                 
*                                  SPACE                         MDC016         
ASCBSRBM DS    B -                 MODEL PSW BYTE 0 USED BY SRB                 
*                                  DISPATCHER  (MDC379)        @G65RP9A         
ASCBPER  EQU   X'40' -             PER BIT IN ASCBSRBM - ALSO USED TO           
*                                  SHOW PER STATUS FOR THE ADDRESS              
*                                  SPACE  (MDC380)             @G65RP9A         
ASCBSWTL DS    F -                 STEP WAIT TIME LIMIT          MDC029         
ASCBSRBT DS    D -                 ACCUMULATED SRB TIME          MDC030         
ASCBLTCB DS    A -                 TCB and preemptable-class SRB   @07C         
*                                  Local lock suspend queue.                    
*                                  Serialization: Adding, CS. Deleting,         
*                                  ASCB CML promotion WEB lock and CS.          
ASCBLTCN DS    F -                 Count of TCB and preemptable-   @07A         
*                                  class SRB (local and CML)                    
*                                  requestors needing this local lock.          
*                                  Serialization: CS                            
ASCBTCBS DS    F -                 NUMBER OF READY TCB'S.          @L8A         
*                                  THE ACTUAL NUMBER OF READY TCBS IS           
*                                  ASCBTCBS-ASCBLSQT.                           
*                                  SERIALIZATION: CS                            
*                                  OWNERSHIP: TASK MANAGEMENT                   
ASCBLSQT DS    F -                 NUMBER OF TCBS ON A LOCAL LOCK  @L8A         
*                                  SUSPEND QUEUE.                               
*                                  SERIALIZATION: CS                            
*                                  OWNERSHIP: TASK MANAGEMENT                   
ASCBWPRB DS    A -                 ADDRESS OF WAIT POST REQUEST BLOCK           
*                                  (MDC362)                    @G50CP9A         
ASCBSRDP DS    0F -                SYSTEM RESOURCE MANAGER (SRM)                
*                                  DISPATCHING PRIORITY                         
*                                  (MDC363)                    @G50IP9A         
ASCBNDP  DS    FL1 -               NEW DISPATCHING PRIORITY                     
*                                  (MDC364)                    @G50IP9A         
ASCBTNDP DS    FL1 -               NEW TIME SLICE DISPATCHING PRIORITY          
*                                  (MDC365)                    @G50IP9A         
ASCBNTSG DS    FL1 -               NEW TIME SLICE GROUP                         
*                                  (MDC366)                    @G50IP9A         
ASCBIODP DS    FL1 -               I/O PRIORITY (MDC374)       @G50IP9A         
ASCBLOCI DS    A -                 LOCK IMAGE, ADDRESS OF ASCB                  
*                                  HOLDING THIS ASCB'S LOCAL                    
*                                  LOCK AS A CML LOCK.                          
*                                  SERIALIZATION - LOCAL LOCK.                  
*                                  OWNERSHIP - SUPERVISOR.                      
*                                  (MDC384)                    @G381P9A         
ASCBCMLW DS    A -                 ADDRESS OF THE WEB REPRESENTING @L8C         
*                                  THE WORKUNIT THAT IS HOLDING THIS            
*                                  ASCB'S LOCAL LOCK AS A CML OR LOCAL          
*                                  LOCK.                                        
*                                  SERIALIZATION - LOCAL LOCK.                  
*                                  OWNERSHIP - SUPERVISOR CONTROL               
ASCBCMLC_PREZOS12 DS 0F -          COUNT OF CML LOCKS HELD BY      @0CC         
*                                  THIS ADDRESS SPACE.                          
ASCBSRBT_Disps DS F -              Count of SRB dispatches.                     
*                                  Incremented and cache aligned with           
*                                  ASCBSRBT.                                    
*                                  SERIALIZATION - CS.                          
*                                  OWNERSHIP - SUPERVISOR.         @0CA         
ASCBSSOM DS    0F -                SPACE SWITCH EVENT OWNER    @ZA58694         
*                                  MASK.                       @ZA58694         
*                                  SERIALIZATION - CS.         @ZA58694         
*                                  OWNERSHIP - SUPERVISOR.     @ZA58694         
ASCBSSO1 DS    XL3 -               SPACE SWITCH EVENT OWNER    @G381P9A         
*                                  MASK BYTES 1 - 3.                            
*                                                     (MDC389) @G381P9A         
ASCBSSO4 DS    B -                 SPACE SWITCH EVENT OWNER    @G381P9A         
*                                  MASK BYTE 4.       (MDC389) @G381P9A         
ASCBSSSP EQU   X'02' -             SLIP/PER REQUESTED          @G381P9A         
*                                  NOTIFICATION ON SPACE SWITCH                 
*                                  EVENTS.            (MDC389) @G381P9A         
ASCBSSJS EQU   X'01' -             JOB STEP TERMINATION        @G381P9A         
*                                  REQUESTED SPACE SWITCH EVENTS                
*                                  FOR BREAKING LATENT ADDRESSING               
*                                  BINDS              (MDC389) @G381P9A         
ASCBASTE DS    A -                 VIRTUAL ADDRESS OF ADDRESS  @G381P9A         
*                                  SPACE SECOND TABLE ENTRY                     
*                                  (ASTE). SERIALIZATION - N/A.                 
*                                  OWNERSHIP - SUPERVISOR.                      
*                                  (MDC384)                    @G381P9A         
ASCBLTOV DS    A -                 VIRTUAL ADDRESS OF THE      @G381P9A         
*                                  LINKAGE TABLE ORIGIN.                        
*                                  (LOCATED IN PC/AUTH ADDRESS                  
*                                  SPACE   LSQA).                               
*                                  SERIALIZATION - PC/AUTH                      
*                                  ADDRESS SPACE LOCAL LOCK.                    
*                                  OWNERSHIP - XM SERVICES.                     
*                                  (MDC384)                    @G381P9A         
ASCBATOV DS    A -                 VIRTUAL ADDRESS OF          @G381P9A         
*                                  AUTHORIZATION TABLE (LOCATED                 
*                                  IN PC/AUTH ADDRESS SPACE                     
*                                  LSQA). SERIALIZATION: PC/AUTH,               
*                                  ADDRESS SPACE LOCAL LOCK.                    
*                                  OWNERSHIP: XM SERVICES                       
*                                  (MDC384)                    @G381P9A         
ASCBETC  DS    H -                 NUMBER OF ENTRY TABLES      @G381P9A         
*                                  CURRENTLY OWNED BY THIS                      
*                                  ADDRESS SPACE.                               
*                                  SERIALIZATION - PC/AUTH                      
*                                  ADDRESS SPACE LOCAL LOCK.                    
*                                  OWNERSHIP - XM SERVICES.                     
*                                  (MDC384)                    @G381P9A         
ASCBETCN DS    H -                 NUMBER OF CONNECTIONS TO    @G381P9A         
*                                  ENTRY TABLES IN THIS ADDRESS                 
*                                  SPACE CONTAINING ANY SPACE                   
*                                  SWITCH ENTRIES.                              
*                                  SERIALIZATION - PC/AUTH                      
*                                  ADDRESS SPACE LOCAL LOCK.                    
*                                  OWNERSHIP - XM SERVICES.                     
*                                  (MDC387)                    @G381P9A         
ASCBLXR  DS    H -                 NUMBER OF LINKAGE INDEXES   @G381P9A         
*                                  RESERVED BY THIS ADDRESS                     
*                                  SPACE.                                       
*                                  SERIALIZATION - PC/AUTH                      
*                                  ADDRESS SPACE LOCAL LOCK.                    
*                                  OWNERSHIP - XM SERVICES.                     
*                                  (MDC384)                    @G381P9A         
ASCBAXR  DS    H -                 NUMBER OF AUTHORIZATION     @G381P9A         
*                                  INDEXES RESERVED BY THIS                     
*                                  ADDRESS SPACE.                               
*                                  SERIALIZATION - PC/AUTH                      
*                                  ADDRESS SPACE LOCAL LOCK.                    
*                                  OWNERSHIP - XM SERVICES.                     
*                                  (MDC384)                    @G381P9A         
ASCBSTKH DS    A -                 ADDRESS OF LOCAL STACK POOL @G381P9A         
*                                  HEADER FOR PCLINK SERVICE.                   
*                                  SERIALIZATION - N/A.                         
*                                  OWNERSHIP - XM SERVICES.                     
*                                  (MDC383)                    @G381P9A         
ASCBCSWD DS    0F                  CS-serialized word              @0FA         
*                                  cleared at step term / start    @0FA         
ASCBCSW0 DS    X                   Byte 0                          @0FA         
ASCBCSW1 DS    X                   Byte 1                          @0FA         
ASCBCSW2 DS    X                   Byte 2, Ser: CS                 @0FA         
ASCBZKF  EQU   X'80'                                               @0FA         
ASCBCSW3 DS    X                   Byte 3, Ser: CS                 @0FA         
ASCBZU   EQU   X'40'                                               @0FA         
ASCBZF   EQU   X'20'                                               @0FA         
ASCBZN   EQU   X'10'                                               @0FA         
ASCBZM   EQU   X'04'                                               @0FA         
ASCBZS   EQU   X'02'                                               @0FA         
ASCBZC   EQU   X'01'               Checked.                        @0FA         
ASCBR114 DS    XL4                 Reserved.                       @0FC         
AscbJafbAddr DS A -                Address of the JAFB             @LQA         
ASCBXTCB DS    A -                 ADDRESS OF THE JOB STEP @G381P9A             
*                                  TASK TCB WHICH OWNS THE CROSS MEMORY         
*                                  RESOURCES IN THIS ADDRESS SPACE.             
*                                  SERIALIZATION - LOCAL LOCK.                  
*                                  OWNERSHIP - SUPERVISOR.                      
*                                                 (MDC384)     @G381P9A         
ASCBFW3  DS    0F -                Fullword label to address bits in            
*                                  this word.                                   
*                                  Serialization - CS.                          
*                                  This word is a programming interface         
*                                  only for bits ASCBSDBF, ASCBNOFT,            
*                                  ASCBPO1M, ASCBP1M0              @LPC         
ASCBCS1  DS    B -                 FIRST BYTE OF COMPARE AND                    
*                                  SWAP FLAGS.    (MDC384)     @G381P9A         
ASCBXMET EQU   X'80' -             IF ONE, THE ADDRESS SPACE IS    @L3C         
*                                  NON-REUSABLE BECAUSE OF CROSS                
*                                  MEMORY CONNECTIONS TO IT.  THIS              
*                                  CONDITION MAY NOT BE PERMANENT.              
*                                  SERIALIZATION - CS AND PC/AUTH               
*                                  ADDRESS SPACE LOCAL LOCK.                    
*                                  OWNERSHIP - XM SERVICES.                     
ASCBXMEC EQU   X'40' -             CROSS MEMORY ENTRY TABLES   @G381P9A         
*                                  CONTAINING SPACE SWITCH ENTRIES              
*                                  HAVE BEEN CREATED BY THIS ADDRESS            
*                                  SPACE.                                       
*                                  SERIALIZATION - CS AND PC/AUTH               
*                                  ADDRESS SPACE LOCAL LOCK.                    
*                                  OWNERSHIP - XM SERVICES.                     
*                                                 (MDC390)     @G381P9A         
ASCBXMPA EQU   X'20' -             IF ONE, THE ADDRESS SPACE IS    @L3A         
*                                  PERMANENTLY NON-REUSABLE BECAUSE             
*                                  OF INCOMPLETE TERMINATION                    
*                                  PROCESSING OF PC/AUTH RESOURCE               
*                                  MANAGER.                                     
*                                  SERIALIZATION - CS AND PC/AUTH               
*                                  ADDRESS SPACE LOCAL LOCK.                    
*                                  OWNERSHIP - XM SERVICES.                     
ASCBXMLK EQU   X'10' -             IF ONE, THE ADDRESS SPACE IS    @L3A         
*                                  PERMANENTLY NON-REUSABLE BECAUSE             
*                                  OF A CML BIND.                               
*                                  SERIALIZATION - CS AND PC/AUTH               
*                                  ADDRESS SPACE LOCAL LOCK.                    
*                                  OWNERSHIP - XM SERVICES.                     
ASCBPERS EQU   X'08' -             COMMUNICATION BIT FOR       @G381P9A         
*                                  SLIP/PER SRB ROUTINES.                       
*                                  IF 1, THE LOCAL SRB ROUTINE WILL             
*                                  ACTIVATE PER FOR THE SPECIFIED               
*                                  ADDRESS SPACE/JOB/CROSS MEMORY               
*                                  REFERENCES.                                  
*                                  IF 0, THE LOCAL SRB ROUTINE WILL             
*                                  DEACTIVATE PER FOR THE ADDRESS               
*                                  SPACE.                                       
*                                  SERIALIZATION - CS AND SLIP                  
*                                  SERIALIZATION WORD, SHDRSEQ.                 
*                                  OWNERSHIP - SLIP/PER.                        
*                                                    (MDC390)  @G381P9A         
ASCBDTER EQU   X'04' -             A DAT ERROR HAS OCCURRED    @G381P9A         
*                                  FOR THIS ADDRESS SPACE.     @G381P9A         
*                                  SERIALIZATION - CS.         @G381P9A         
*                                  OWNERSHIP - RTM.  (MDC390)  @G381P9A         
ASCBPERO EQU   X'02' -             PER PROCESSING NEEDS TO BE      @L5A         
*                                  DONE WHEN ADDRESS SPACE IS SWAPPED           
*                                  IN.                                          
*                                  SERIALIZATION - CS.                          
*                                  OWNERSHIP - SLIP.                            
ASCBSWOP EQU   X'01' -             ADDRESS SPACE IS SWAPPED OUT    @L5A         
*                                  WITH RESPECT TO PER PROCESSING BEING         
*                                  DONE.                                        
*                                  SERIALIZATION - CS.                          
*                                  OWNERSHIP - RCT.                             
ASCBCS2  DS    B -                 SECOND BYTE OF COMPARE AND SWAP @P5A         
*                                  FLAGS.                                       
ASCBSAS  EQU   X'80' -             INDICATES THAT STORAGE          @P5M         
*                                  ALTERATION SELECTION (PER 2) IS ON           
*                                  FOR EITHER A DATA SPACE ASSOCIATED           
*                                  WITH THE ADDRESS SPACE, OR THE               
*                                  ADDRESS SPACE ITSELF.                        
ASCBSMGR EQU   X'40' -             This space is or has been associated         
*                                  with the session manager        @LEA         
ASCBDTIN EQU   X'20' -             This space is or has been associated         
*                                  with ISPF                       @LEA         
ASCBXMNR EQU   X'10' -             The address space is                         
*                                  permanently non-reusable because of          
*                                  cross memory connections to a                
*                                  system LX.                                   
*                                  Serialization - CS and PC/AUTH               
*                                  address space Local lock.                    
*                                  Ownership - XM services         @LFA         
ASCBSDBF EQU   X'08' -             A work unit in this address space            
*                       has set CVTSDBF bit 0 to 1. If this address             
*                       space is memtermed when this bit is on, the             
*                       system will reset CVTSDBF. ASCBSDBF must be             
*                       set on only by the work unit that has just set          
*                       CVTSDBF bit 0 to 1. ASCBSDBF must be reset              
*                       just prior to resetting CVTSDBF. ASCBSDBF must          
*                       be set in the home address space. The SVC Dump          
*                       request must properly indicate BUFFER=YES.              
*                       Serialization: CS                          @LKA         
ASCBNOFT EQU   X'04' -  Set this to exempt all tasks in this address            
*                       space from being affected by the FORCE TCB              
*                       command.                                                
*                       Serialization: CS                          @LNC         
ASCBPO1M EQU   X'02' -             Set this to indicate that           *        
                                   the RMODE 31 portion of program     *        
                                   objects is to be backed by 1M pages *        
                                   (when available). The bit is reset  *        
                                   at jobstep start.                   *        
                                   It applies only to modules loaded   *        
                                   into private storage.               *        
                                   Serialization: CS               @LPA         
ASCBP1M0 EQU   X'01' -             Set this to indicate that           *        
                                   the RMODE 31 portion of program     *        
                                   objects is to be backed by 1M pages *        
                                   (when available), but only when the *        
                                   module will be placed into SP252.   *        
                                   The bit is reset at jobstep start.  *        
                                   It applies only to modules loaded   *        
                                   into private storage.               *        
                                   Do not also set ASCBPO1M.           *        
                                   Serialization: CS               @LPA         
ASCBCS3  DS    B -                 3rd byte of CS flags            @0HA         
ASCBXMSO EQU   X'80' -             This address space has owned a               
*                                  XM table with a space-switch PC @0HA         
ASCBCS4  DS    B -                 4th byte of CS flags            @0HA         
ASCBGXL  DS    A -                 ADDRESS OF GLOBALLY LOADED MODULE            
*                                  EXTENT INFORMATION CONTROL BLOCK.            
*                                  SERIALIZATION - LOCAL LOCK.                  
*                                  OWNERSHIP - CONTENTS SUPERVISION             
*                                                   (MDC389)   @G381P9A         
ASCBEATT DS    D -                 EXPENDED AND ACCOUNTED TASK TIME.            
*                                  SERIALIZATION - N/A.                         
*                                  OWNERSHIP - SCHEDULER.                       
*                                                   (MDC387)   @G381P9A         
ASCBINTS DS    D -                 JOB SELECTION TIME STAMP.                    
*                                  SERIALIZATION - N/A.                         
*                                  OWNERSHIP - SCHEDULER.                       
*                                                   (MDC387)   @G381P9A         
ASCBFW4  DS    0F -                FULLWORD LABEL TO ADDRESS   @G381P9A         
*                                  BITS IN THIS WORD.                           
*                                  SERIALIZATION - LOCAL LOCK.                  
*                                                   (MDC389)   @G381P9A         
ASCBLL1  DS    B -                 FIRST BYTE OF FLAGS.        @G381P9A         
*                                  SERIALIZATION - LOCAL LOCK. @G381P9A         
*                                                   (MDC389)   @G381P9A         
ASCBSSPC EQU   X'80' -             STATUS STOP TASKS PENDING   @G381P9A         
*                                  A CML LOCK RELEASE.         @G381P9A         
*                                                   (MDC389)   @G381P9A         
ASCBLL2  DS    B -                 SECOND BYTE OF FLAGS.       @G381P9A         
*                                  SERIALIZATION - LOCAL LOCK. @G381P9A         
*                                                   (MDC389)   @G381P9A         
ASCBLL3  DS    B -                 THIRD BYTE OF FLAGS.        @G381P9A         
*                                  SERIALIZATION - LOCAL LOCK. @G381P9A         
*                                                    (MDC389)  @G381P9A         
ASCBLL4  DS    B -                 FOURTH BYTE OF FLAGS.       @G381P9A         
*                                  SERIALIZATION - LOCAL LOCK. @G381P9A         
*                                                    (MDC389)  @G381P9A         
ASCBNRLL EQU   X'80' -             No release of Local Lock OK.    @LRA         
*                                  Set only after obtaining LL.    @LRA         
ASCBTYP1 EQU   X'02' -             TYPE 1 SVC HAS CONTROL.  THIS OFFSET         
*                                  FIXED BY ARCHITECTURE.      @G860PXK         
ASCBRCMS DS    A                   ADDRESS OF THE REQUESTED    @G381PXU         
*                                  CMS CLASS LOCK FOR WHICH    @G381P9A         
*                                  THE LOCAL LOCK HOLDER IS    @G381P9A         
*                                  SUSPENDED.                  @G381P9A         
*                                  SERIALIZATION - LOCAL LOCK. @G381P9A         
*                                  OWNERSHIP - SUPERVISOR.     @G381P9A         
*                                                    (MDC391)  @G381P9A         
ASCBIOSC DS    F -                 I/O SERVICE MEASURE.        @G381PXU         
*                                  SERIALIZATION - CS.         @G381PXU         
*                                  UPDATED BY JES2,JES3,SMF.   @G381PXU         
*                                  READ BY RMF,SMF,SRM.        @G381PXU         
ASCBPKML DC    H'0' -              PKM OF LAST TASK DISPATCHED                  
*                                  IN THIS ADDRESS SPACE.                       
*                                  SERIALIZATION - NONE.                        
*                                  OWNERSHIP - DISPATCHER.     @G387PXH         
ASCBXCNT DS    H -                 EXCP COUNT FIELD.               @L1A         
*                                  SERIALIZATION - LOCAL LOCK.                  
*                                  OWNERSHIP - EXCP.                            
ASCBNSQA DS    A -                 ADDRESS OF THE SQA RESIDENT                  
*                                  NSSA CHAIN.                                  
*                                  SERIALIZATION - DISPATCHER LOCK.             
*                                  OWNERSHIP - DISPATCHER.     @G38BPXH         
ASCBASM  DS    A -                 ADDRESS OF THE ASM HEADER.      @L2A         
*                                  SERIALIZATION - NONE.                        
*                                  OWNERSHIP - ASM.                             
ASCBASSB DS    A -                 POINTER TO ADDRESS SPACE        @D6C         
*                                  SECONDARY BLOCK (ASSB).                      
ASCBTCME DS    A -                 POINTER TO TCXTB.               @D1A         
*                                  OWNERSHIP - TCAM.                            
ASCBGQIR DS    0A -                ISGQSCAN INFORMATION            @O3A         
*                                  ROUTINE ADDRESS.                             
*                                  SERIALIZATION  - COMPARE AND SWAP.           
*                                  OWNERSHIP - GRS                              
         DS    XL1 -               BYTE 0 OF ASCBGQIR              @O3A         
ASCBGQAB EQU   X'80' -             ISGQSCAN INFORMATION            @O3A         
*                                  ROUTINE ABENDED FLAG. IF ON,                 
*                                  ISGQSCAN INFORMATION ROUTINE                 
*                                  UNEXPECTEDLY ABENDED.                        
         DS    XL2 -               BYTE 1 AND 2 OF ASCBGQIR        @O3A         
ASCBGQI3 DS    XL1 -               BYTE 3 OF ASCBGQIR              @O3A         
ASCBGQDS EQU   X'01' -             ISGQSCAN INFORMATION            @O3A         
*                                  ROUTINE DISABLED FLAG. IF ON,                
*                                  ISGQSCAN WILL NOT INVOKE THE                 
*                                  ISGQSCAN INFORMATION ROUTINE.                
ASCBLSQE DS    F -                 Number of Enclave TCBs that are on           
*                                  a Local Lock Suspend Queue.                  
*                                  Ownership:  Task Management                  
*                                  Serialization:  Compare and Swap             
*                                                                  @LCA         
ASCBIOSX DS    D -                 I/O service measure extended.   @0AC         
*                                  This is like ASCBIOSC but it is @0AA         
*                                  extended to 8 bytes, so its     @0AA         
*                                  value continuestto grow past the@0AA         
*                                  4GB ASCBIOSC maximum capacity.  @0AA         
*                                  Serialization - CSG.            @0AA         
ASCBR168 DS    XL1  -              RESERVED.                       @0IC         
AscbDiag169 DS    XL1  -           IBM use only                    @0IA         
ASCBSVCN DS    XL2  -              SVC Number for type-1 SVC           *        
                                   Serialization - local lock      @LOA         
ASCBRSME DS    A   -               POINTER TO RSM ADDRESS SPACE    @D5A         
*                                  BLOCK EXTENSION.                @D5A         
*                                  SERIALIZATION: RSMAD LOCK       @D5A         
*                                  OWNERSHIP: RSM                  @D5A         
ASCBAVM  DS    0F -                AVAILABILITY MANAGER ADDRESS    @01C         
*                                  SPACE RELATED DATA.                          
*                                  SERIALIZATION: CS.                           
*                                  OWNERSHIP: AVM.                              
ASCBAVM1 DS    B -                 FIRST BYTE OF ASCBAVM.          @01A         
*                                  RESERVED.                                    
ASCBAVM2 DS    B -                 SECOND BYTE OF ASCBAVM.         @01A         
*                                  RESERVED.                                    
ASCBAGEN DS    H -                 AVM ASID REUSE GENERATION       @01A         
*                                  NUMBER.                                      
ASCBARC  DS    F -                 REASON CODE ON MEMTERM.                      
*                                  SERIALIZATION - N/A.                         
*                                  OWNERSHIP - RTM.            @G860PXK         
ASCBRSM  DS    0A -                ADDRESS OF RSM'S CONTROL BLOCK               
*                                  HEADER.                     @G860PVB         
ASCBRSMA DS    AL4 -               ADDRESS OF RSM'S CONTROL BLOCK               
*                                  HEADER.                     @G860PVB         
ASCBDCTI DS    F'0' -              ACCUMULATED CHANNEL CONNECT TIME             
*                                  INCURRED BY THIS MEMORY     @G860PVB         
ASCBEND  DS    0D -                END OF ASCB                     @L7C         
         POP   PRINT                                               @D6A         
         MEND  , -    */                                                        
*%ASCBL2 : ;                                                                    
*                                                                               
*  @LISTPUSH;                                                  /*@D6A*/         
*  %IF IHALIST='YES' %THEN                                     /*@D6A*/         
*     %GOTO ASCBLST;                                           /*@D6A*/         
*  @LISTOFF;                                                   /*@D6A*/         
*  %ASCBLST:;                                                  /*@D6A*/         
*                                                                               
*DCL 1 ASCB     BASED(ASCBPTR) BDY(DWORD),                                      
*      2 ASCBEGIN CHAR(0),        /* BEGINNING OF ASCB               */         
*      2 ASCBASCB CHAR(4) BDY(WORD), /* ACRONYM IN EBCDIC  -ASCB-    */         
*      2 ASCBFWDP PTR(31),        /* ADDRESS OF NEXT ASCB ON ASCB               
*                                    READY QUEUE                     */         
*      2 ASCBBWDP PTR(31),        /* ADDRESS OF PREVIOUS ASCB ON ASCB           
*                                    READY QUEUE                     */         
*      2 ASCBLTCS PTR(31),        /* TCB and preemptable-class SRB              
*                                    Local lock suspend service queue.          
*                                    Serialization: ASCB CML promotion          
*                                    WEB lock.                   @07C*/         
*      2 * CHAR(8) BDY(DWORD),  /* Refer To                                     
*                                   ASCBDIAG010                  @0IA*/         
* %IF SYSVERSION = '' %THEN %GOTO ASCBPLS4;                   /* @LLA*/         
* %IF SYSRULESMOD='PL/S-III ' %THEN %GOTO ASCBPLS4;           /* @LLA*/         
*       3 ASCBDiag010 Char(8) BDY(DWORD), /* IBM use only        @ZNA*/         
*        4 ASCBSUPC_PREZOS12 BIT(64) BDY(DWORD), /* SUPERVISOR CELL             
*                                    FIELD                       @LLC*/         
*         5 ASCBSVRB_PREZOS12 PTR(31), /* SVRB POOL ADDRESS.     @LLC*/         
*         5 ASCBSYNC_PREZOS12 FIXED(31), /* COUNT USED TO SYNCHRONIZE           
*                                    SVRB POOL.                  @LLC*/         
* %ASCBPLS4:;                                                 /* @LLA*/         
*      2 ASCBIOSP PTR(31),        /* POINTER TO IOS PURGE INTERFACE             
*                                    CONTROL BLOCK (IPIB)                       
*                                    (MDC308)                @Z40FP9A*/         
*      2 ASCBWQLK PTR(31),        /* WEB QUEUE LOCK WORD                        
*                                    SERIALIZATION: CS                          
*                                    OWNERSHIP: SUPERVISOR CONTROL              
*                                                                @L8A*/         
*       3 ASCBR01C CHAR(2),       /* RESERVED, MUST BE ZERO      @L8A*/         
*       3 ASCBWQID FIXED(16),     /* LOGICAL CPU ID OF PROCESSOR                
*                                    HOLDING THE WEB QUEUE LOCK                 
*                                    OWNERSHIP: SUPERVISOR CONTROL              
*                                                                @L8A*/         
*      2 * CHAR(4) BDY(WORD),                                 /* @0CC*/         
* %IF SYSVERSION = '' %THEN %GOTO ASCB024;                    /* @0CC*/         
* %IF SYSRULESMOD='PL/S-III ' %THEN %GOTO ASCB024;            /* @0CC*/         
*       3 ASCB_Job_Step_SeqNum Fixed(32), /* Sequence number                    
*                                    incremented at job step change,            
*                                    when ASSB and ASCB and time and            
*                                    counts fields are reset. Used to           
*                                    sequence resets of the time and            
*                                    count fields                @0CA*/         
*        4 ASCBSAWQ_PREZOS11 PTR(31), /* ADDRESS OF ADDRESS SPACE SRB           
*                                    WEB QUEUE                                  
*                                    SERIALIZATION: WEQ QUEUE LOCK              
*                                    OWNERSHIP: SUPERVISOR CONTROL.             
*                                    Not set as of z/OS 1.11                    
*                                                                @LJC*/         
*         5 ASCBURRQ_PREZOS11 BIT(1), /* SYSEVENT USER READY REQUIRED           
*                                    SERIALIZATION: WEQ QUEUE LOCK              
*                                    OWNERSHIP: SUPERVISOR CONTROL.             
*                                    Not set as of z/OS 1.11                    
*                                                                @LJC*/         
* %ASCB024:;                                                  /* @0CC*/         
*      2 ASCBASID BIT(16) BDY(WORD), /* ADDRESS SPACE IDENTIFIER                
*                                    FOR THE ASCB                    */         
*        3 ASCBASN FIXED(15),        /* SAME AS ASCBASID         @L8A*/         
*      2 *        BIT(16),        /* Flags                       @0GC*/         
* %IF SYSVERSION = '' %THEN %GOTO ASCBPLS1;                   /* @LGA*/         
* %IF SYSRULESMOD='PL/S-III ' %THEN %GOTO ASCBPLS1;           /* @LGA*/         
*      3 ASCBDiag026 Bit(8),      /* IBM use only                @0GA*/         
*      3 ASCBSRMFlags BIT(8),     /* SRM flags                                  
*                                    Ownership: SRM                             
*                                    Serialization: SRMLOCK      @LGA*/         
*        5 ASCBVCMOverRide BIT(1),/* ASCBVCMOverRide flag                       
*                                    This bit indicates that this               
*                                    address space should not follow            
*                                    the standard SRM management in             
*                                    an VCM=on environment.                     
*                                    Instead of trying to assign the            
*                                    work this address space to the             
*                                    same affinity node for cache               
*                                    efficiency concerns, assign this           
*                                    work to any affinity node, ignore          
*                                    any cache concerns.                        
*                                    Ownership: SRM              @LGA*/         
*        5 ASCBBrokenUp    BIT(1),/* ASCBBrokenUp flag                          
*                                    This bit indicates that this               
*                                    address space has been broken up           
*                                    by SRM.                                    
*                                    Ownership: SRM              @LGA*/         
*        5 ASCBVCMGivePreemption Bit(1), /* ASCBVCMGivePreemption flag          
*                                    This bit indicates that this               
*                                    address space should get full              
*                                    preemption.                                
*                                    Ownership: SRM              @LIA*/         
*        5 ASCBVCMGiveSigpAny Bit(1), /* ASCBVCMGiveSigpAny flag                
*                                    address space can SIGP any                 
*                                    waiting CPUs to process its work.          
*                                    Ownership: SRM              @0BA*/         
*        5 AscbInEligHonorPriority Bit(1), /* When on, specialty                
*                                    engine eligible work in this               
*                                    address space will not                     
*                                    be offloaded to CPs for help               
*                                    processing.                                
*                                    Ownership: SRM              @0DA*/         
*        5 ASCBSRMFlagsDiag BIT(2), /* Diagnostic data for IBM use only         
*                                                                @LSA*/         
* %ASCBPLS1:;                                                 /* @LGA*/         
*      2 ASCBLL5 BIT(8) BDY(WORD),/* FLAGS. SERIALIZATION - LOCAL               
*                                    LOCK                        @D2A*/         
*        4 *        BIT(2),       /* RESERVED.                   @D2A*/         
*        4 ASCBS3S  BIT(1),       /* STAGE II EXIT EFFECTOR HAS                 
*                                    SCHEDULED AN RQE OR IQE AND                
*                                    STAGE III EXIT EFFECTOR                    
*                                    SHOULD BE INVOKED           @D2M*/         
*        4 *        BIT(5),       /* RESERVED.                   @D2A*/         
*      2 ASCBHLHI BIT(8),         /* INDICATION OF SUSPEND LOCKS HELD           
*                                    AT TASK SUSPENSION          @L4C*/         
*      2 ASCBDPH  FIXED(16),      /* DISPATCHING PRIORITY        @L8C*/         
*        4 ASCBDPHI FIXED(8),     /* HIGH ORDER BYTE OF HALFWORD                
*                                    DISPATCHING PRIORITY        @L8C*/         
*        4 ASCBDP   PTR(8),       /* DISPATCHING PRIORITY RANGE FROM            
*                                    0-255                       @L8C*/         
*      2 ASCBTCBE FIXED(32),      /* Count of ready TCBs in the space           
*                                    that are in an enclave.                    
*                                    OWNERSHIP: Task Management                 
*                                    SERIALIZATION:  Compare and Swap           
*                                    and the WEB Lock of the TCB for            
*                                    which this count is being                  
*                                    manipulation.               @LCC*/         
*      2 ASCBLDA  PTR(31),        /* POINTER TO LOCAL DATA AREA                 
*                                    PART OF LSQA FOR VSM            */         
*      2 ASCBRSMF BIT(8) ABNORMAL,/* RSM ADDRESS SPACE FLAGS                    
*                                    (MDC368)                @G860PVB*/         
*        4 ASCB2LPU BIT(1),       /* SECOND LEVEL PREFERRED USER.               
*                                    THIS OFFSET FIXED BY                       
*                                    ARCHITECTURE.  (MDC369) @G50EP9A*/         
*        4 ASCB1LPU BIT(1),       /* FIRST LEVEL PREFERRED USER                 
*                                    (MDC370)                @ZA17355*/         
*        4 ASCBN2LP BIT(1),       /* SRM IN SYSEVENT TRANSWAP SHOULD            
*                                    NOT SET ASCB2LPU BIT - HOWEVER             
*                                    IT MAY ALREADY BE ON AND WILL              
*                                    STAY ON  (MDC371)       @ZA17355*/         
*        4 ASCBVEQR BIT(1),       /* V=R ADDRESS SPACE                          
*                                    (MDC372)                @ZA17355*/         
*        4 *        BIT(4),       /* RESERVED.               @ZA17355*/         
*      2 ASCBFLG3 BIT(8),         /* Flags, no serialization     @LDA*/         
*        4 ASCBCNIP BIT(1),       /* This address space was created             
*                                    during NIP. Set by IEAVEMRQ.               
*                                    Serialization: none         @LDA*/         
*        4 ASCBREUS BIT(1),       /* This is a reusable ASID. It may            
*                                    be given out only to a reusable            
*                                    ASID requestor. Set by IEAVEMRQ.           
*                                    Serialization: none         @LEA*/         
*        4 ASCBM881 BIT(1),       /* This address space went through            
*                                    IEEMB881                    @0EA*/         
*      2 ASCBR036 FIXED(16),      /* Reserved as of z/OS 1.11    @LJC*/         
* %IF SYSVERSION = '' %THEN %GOTO ASCBPLS2;                   /* @LJA*/         
* %IF SYSRULESMOD='PL/S-III ' %THEN %GOTO ASCBPLS2;           /* @LJA*/         
*        3 ASCBHASI_PREZOS11 FIXED(16), /* Local lock owning ASID.              
*                                          Not set as of z/OS 1.11              
*                                                                @LJC*/         
* %ASCBPLS2:;                                                 /* @LJA*/         
*      2 ASCBCSCB PTR(31),        /* ADDRESS OF CSCB                 */         
*      2 ASCBTSB  PTR(31),        /* ADDRESS OF TSB                  */         
*      2 ASCBEJST BIT(64) BDY(DWORD), /* ELAPSED JOB STEP TIMING                
*                                    UNSIGNED 64-BIT BINARY NUMBER   */         
*      2 ASCBEWST BIT(64) BDY(DWORD), /* TIME OF DAY WHENEVER I-STREAM          
*                                    IS SWITCHED FROM A MEMORY       */         
*      2 ASCBJSTL BIT(32) BDY(WORD), /* CPU TIME LIMIT FOR THE                  
*                                    JOB STEP                        */         
*      2 ASCBECB  BIT(32) BDY(WORD), /* RCT'S WORK ECB               */         
*      2 ASCBUBET BIT(32) BDY(WORD), /* TIME STAMP WHEN USER BECAME             
*                                    READY                           */         
*      2 ASCBTLCH PTR(31),        /* CHAIN FIELD FOR TIME LIMIT                 
*                                    EXCEEDED QUEUE                             
*                                    (MDC329)                @G50DP9A*/         
*      2 ASCBDUMP PTR(31),        /* SVC DUMP TASK TCB ADDRESS       */         
*      2 ASCBFW1  FIXED(31),      /* FULL-WORD LABEL TO BE USED FOR             
*                                    COMPARE AND SWAP FOR ANY BIT IN            
*                                    THIS WORD                 MDC026*/         
*       3 ASCBAFFN BIT(16) BDY(WORD), /* CPU AFFINITY INDICATOR      */         
*       3 ASCBRCTF BIT(8),        /* FLAGS FOR RCT SERIALIZED BY                
*                                    COMPARE AND SWAP        @ZA40479*/         
*        4 ASCBTMNO BIT(1),       /* MEMORY IS BEING QUIESCED, IS               
*                                    QUIESCED, OR IS BEING RESTORED  */         
*        4 ASCBFRS  BIT(1),       /* RESTORE REQUEST                 */         
*        4 ASCBFQU  BIT(1),       /* QUICESCE REQUEST                */         
*        4 ASCBJSTE BIT(1),       /* JOB STEP TIME EXCEEDED. NOT                
*                                    USED BY RCT             @ZA94366*/         
*        4 ASCBWAIT BIT(1),       /* LONG WAIT INDICATOR             */         
*        4 ASCBOUT  BIT(1),       /* ADDRESS SPACE CONSIDERED SWAPPED           
*                                    OUT                             */         
*        4 ASCBTMLW BIT(1),       /* MEMORY IS IN A LONG WAIT        */         
*        4 ASCBTOFF BIT(1) ABNL,  /* MEMORY SHOULD NOT BE CHECKED FOR           
*                                    JOB STEP TIMING                            
*                                    NOT USED BY RCT         @ZA40479*/         
*       3 ASCBFLG1 BIT(8),        /* FLAG BYTE                       */         
*        4 ASCBLSAS BIT(1),       /* ADDRESS SPACE IS LOGICALLY SWAPPED         
*                                    OUT                                        
*                                    SERIALIZATION - WHEN SETTING, CPU          
*                                    LOCK, AND THE SWAP INTERSECT               
*                                                  - WHEN RESETTING,            
*                                    NONE REQUIRED               @DHC*/         
*        4 ASCBDSTK BIT(1) ABNL,  /* SRM REQUIRES A TIME STAMP TO               
*                                    DETERMINE WHEN THE ADDRESS SPACE           
*                                    GOES INTO LONG WAIT.  ASCBEWST             
*                                    WILL BE UPDATED WHEN THIS BIT              
*                                    IS ON. NOTE: If this bit moves             
*                                    positions, the bit constant                
*                                    ASCBDSTZ must also be changed.             
*                                                                @P6C*/         
*        4 *        BIT(1),       /* RESERVED.                   @05C*/         
*        4 ASCBTERM BIT(1),       /* ADDRESS SPACE TERMINATING                  
*                                    NORMALLY                        */         
*        4 ASCBABNT BIT(1),       /* ADDRESS SPACE TERMINATING                  
*                                    ABNORMALLY                      */         
*        4 ASCBMEMP BIT(1),       /* Memory Termination PURGEDQ flag            
*                                    Serialization: none         @LBA*/         
*        4 *        BIT(2),       /* RESERVED.                   @LBC*/         
*      2 ASCBTMCH PTR(31),        /* TERMINATION QUEUE CHAIN         */         
*      2 ASCBASXB PTR(31),        /* POINTER TO ADDRESS SPACE                   
*                                    EXTENSION CONTROL BLOCK (ASXB)  */         
*      2 ASCBFW2  FIXED(31),      /* FULLWORD LABEL TO ADDRESS BITS             
*                                    IN THIS WORD  (MDC330)  @G50DP9A*/         
*       3 ASCBSWCT FIXED(15) BDY(WORD), /* NUMBER OF TIMES MEMORY               
*                                    ENTERS SHORT WAIT       @G50DP9A*/         
*       3 ASCBDSP1 BIT(8),        /* NONDISPATCHABILITY                         
*                                    FLAGS.                                     
*                                    SERIALIZATION - GLOBAL INTERSECT.          
*                                                   (MDC388) @G381P9A*/         
*        4 ASCBSSND BIT(1),       /* SYSTEM SET NONDISPATCHABLE AND             
*                                    THIS ASCB IS NOT EXEMPT                    
*                                    (MDC331)                @G50DP9A*/         
*        4 ASCBFAIL BIT(1),       /* A FAILURE HAS OCCURRED WITHIN              
*                                    THE ADDRESS SPACE. THE MEMORY              
*                                    IS NONDISPATCHABLE      @G50DP9A*/         
*        4 ASCBSNQS BIT(1),       /* STATUS STOP NON-QUIESCABLE LEVEL           
*                                    SRB'S  (MDC323)         @G50DP9A*/         
*        4 ASCBSSSS BIT(1),       /* STATUS STOP SRB SUMMARY                    
*                                    (MDC332)                @G50DP9A*/         
*        4 ASCBSTND BIT(1),       /* TCB'S NONDISPATCHABLE                      
*                                    (MDC322)                @G50DP9A*/         
*        4 ASCBUWND BIT(1),       /* STATUS SET UNLOCKED WORKUNITS              
*                                    NONDISPATCHABLE.            @LAA*/         
*        4 ASCBNOQ  BIT(1),       /* ASCB NOT ON SWAPPED IN                     
*                                    QUEUE                       @L4A*/         
*        4 *        BIT(1),       /* RESERVED.                   @L4C*/         
*       3 ASCBFLG2 BIT(8),        /* FLAG BYTE.                                 
*                                    SERIALIZATION - GLOBAL INTERSECT.          
*                                                   (MDC387) @G381P9A*/         
*        4 ASCBXMPT BIT(1),       /* ASCB EXEMPT FROM SYSTEM                    
*                                    NONDISPATCHABLE                            
*                                    (MDC013)                @G50DP9A*/         
*        4 ASCBPXMT BIT(1),       /* ASCB PERMANENTLY EXEMPT FROM               
*                                    SYSTEM NONDISPATCHABLE                     
*                                    (MDC014)                @G50DP9A*/         
*        4 ASCBCEXT BIT(1) ABNL,  /* CANCEL TIMER EXTENSION BECAUSE             
*                                    EOT PROCESSING IS STARTED FOR              
*                                    THE JOB STEP TCB                           
*                                    (MDC021)                @G50DP9A*/         
*        4 ASCBS2S  BIT(1),       /* FOR LOCK MANAGER, ENTRY MADE TO            
*                                    STAGE II EXIT EFFECTOR WITHOUT             
*                                    CORRESPONDING ENTRY TO STAGE III           
*                                    EXIT EFFECTOR  (MDC020) @G50DP9A*/         
*        4 ASCBNCML BIT(1),       /* ASCB IS NOT ELIGIBLE FOR CML LOCK          
*                                    REQUESTS.                   @LAM*/         
*        4 ASCBNOMT BIT(1),       /* ADDRESS SPACE MUST NOT BE                  
*                                    MEMTERMED UNLESS A DAT ERROR HAS           
*                                    OCCURRED. IF A DAT ERROR HAS               
*                                    OCCURRED, ACTION IS CONTROLLED             
*                                    BY ASCBNOMD.                               
*                                    OWNERSHIP - SCHEDULER.                     
*                                                   (MDC387) @G381P9A*/         
*        4 ASCBNOMD BIT(1),       /* IF ON, ADDRESS SPACE CANNOT BE             
*                                    MEMTERMED ON A DAT ERROR.                  
*                                    IF OFF, PROCESS MEMTERM ON A DAT           
*                                    ERROR.                                     
*                                    OWNERSHIP -  SCHEDULER                     
*                                                   (MDC387) @G381P9A*/         
*        4 *        BIT(1),       /* RESERVED.               @G50DP9A*/         
*      2 ASCBSCNT FIXED(31),      /* FULLWORD LABEL FOR COMPARE AND             
*                                    SWAP (CS)  (MDC333)     @G50DP9A*/         
*       3 *        FIXED(15),     /* FIRST HALFWORD OF ASCBSCNT MUST            
*                                    BE ZERO        (MDC387) @G381P9A*/         
*       3 ASCBSRBS FIXED(15),     /* COUNT OF SRB'S SUSPENDED IN THIS           
*                                    MEMORY  (MDC325)        @G50DP9A*/         
*      2 ASCBLLWQ PTR(31),        /* ADDRESS SPACE LOCAL LOCK SUSPEND           
*                                    SERVICE WEB QUEUE                          
*                                    SERIALIZATION: LOCAL LOCK                  
*                                    OWNERSHIP: SUPERVISOR CONTROL              
*                                                                @L8A*/         
*      2 ASCBRCTP PTR(31),        /* POINTER TO REGION CONTROL TASK             
*                                    (RCT) TCB  (MDC334)     @G50DP9A*/         
*      2 ASCBLKGP CHAR(8) BDY(DWORD), /* LOCK GROUP (MDC306) @Z40FP9A*/         
*       3 ASCBLOCK FIXED(31),     /* LOCAL LOCK. THIS OFFSET FIXED BY           
*                                    ARCHITECTURE.  (MDC305) @G50EP9A*/         
*       3 ASCBLSWQ PTR(31),       /* ADDRESS SPACE LOCAL LOCK WEB               
*                                    SUSPEND QUEUE                              
*                                    SERIALIZATION: CDS WITH ASCBLOCK           
*                                    OWNERSHIP: SUPERVISOR CONTROL              
*                                                                @L8A*/         
*         4 ASCBS3NL BIT(1),      /* THE LOCAL LOCK IS NEEDED BY THE            
*                                    STAGE 3 EXIT EFFECTOR TO QUEUE             
*                                    ASYNCHRONOUS EXITS                         
*                                    SERIALIZATION: CDS WITH ASCBLOCK           
*                                    OWNERSHIP: SUPERVISOR CONTROL              
*                                                                @L8A*/         
*         4 *        BIT(30),     /*                             @07A*/         
*         4 ASCBLTCL BIT(1),      /* THE LOCAL LOCK IS NEEDED BY SOME           
*                                    TCB or preemptable-class SRB.              
*                                                                @07A*/         
*      2 ASCBQECB BIT(32) BDY(WORD), /* QUIESCE ECB                  */         
*      2 ASCBMECB BIT(32) BDY(WORD), /* MEMORY CREATE/DELETE ECB     */         
*      2 ASCBOUCB PTR(31),        /* SYSTEM RESOURCES MANAGER (SRM)             
*                                    USER CONTROL BLOCK POINTER      */         
*      2 ASCBOUXB PTR(31),        /* SYSTEM RESOURCES MANAGER (SRM)             
*                                    USER EXTENSION BLOCK POINTER    */         
*      2 ASCBFW2A BDY(WORD),      /* FULLWORD LABEL TO ADDRESS                  
*                                    BITS IN THIS WORD.          @DAA*/         
*        3 ASCBFMCT FIXED(16),    /* RESERVED. ALLOCATED PAGE FRAME             
*                                    COUNT NOW RESIDES IN THE RAX               
*                                    (MAPPING MACRO IARRAX).     @L6C*/         
*        3 ASCBLEVL FIXED( 8),    /* LEVEL NUMBER OF ASCB        @DAC*/         
*        3 ASCBFL2A BIT(8),       /* FLAG BYTE                   @DAA*/         
*            5 ASCBNOPR BIT(1) ABNL, /* NO PREEMPTION FLAG                      
*                                    1=DO NOT SIGP ANOTHER PROCESSOR            
*                                      TO EXECUTE READY WORK IN THIS            
*                                      SPACE                                    
*                                    0=DO SIGP ANOTHER PROCESSOR                
*                                      OWNERSHIP:     SRM                       
*                                      SERIALIZATION: CS         @DAA*/         
*      2 * CHAR(4) BDY(WORD),     /*                             @0CC*/         
* %IF SYSVERSION = '' %THEN %GOTO ASCB100; /*                    @0CC*/         
* %IF SYSRULESMOD='PL/S-III ' %THEN %GOTO ASCB100; /*            @0CC*/         
*        3 ASCBHREQ_PREZOS11 PTR(31), /* Local lock requestor address.          
*                                    Not set as of z/OS 1.11                    
*                                                                @LJC*/         
*          5 ASCBEJST_Disps FIXED(32), /* Count of task dispatches.             
*                                    Incremented and cache aligned with         
*                                    ASCBEJST.                                  
*                                    SERIALIZATION - CS.                        
*                                    OWNERSHIP - SUPERVISOR.     @0CA*/         
* %ASCB100:;                      /*                             @0CC*/         
*      2 ASCBIQEA PTR(31),        /* POINTER TO IQE FOR ATCAM                   
*                                    ASYNCHRONOUS PROCESSING   MDC010*/         
*      2 ASCBRTMC PTR(31),        /* ANCHOR FOR SQA SDWA QUEUE.                 
*                                                   (MDC388) @G381P9A*/         
*      2 ASCBMCC  CHAR(4) BDY(WORD), /* USED TO HOLD A MEMORY                   
*                                    TERMINATION COMPLETION CODE ON             
*                                    ABNORMAL MEMORY TERMINATION                
*                                                              MDC012*/         
*      2 ASCBJBNI PTR(31),        /* POINTER TO JOBNAME FIELD FOR               
*                                    INITIATED PROGRAMS OR ZERO                 
*                                                              MDC018*/         
*      2 ASCBJBNS PTR(31),        /* POINTER TO JOBNAME FIELD FOR               
*                                    START/MOUNT/LOGON OR ZERO MDC019*/         
*      2 ASCBSRQ  BIT(32) BDY(WORD), /* DISPATCHER SERIALIZATION                
*                                    REQUIRED  (MDC312)      @G50DP9A*/         
*       3 ASCBSRQ1 BIT(8),        /* FIRST BYTE OF ASCBSRQ                      
*                                    (MDC313)                @Z40FP9A*/         
*        4 ASCBDSG4 BIT(1),       /* SIGNAL WAITING PROCESSORS WHEN             
*                                    INTERSECT IS RESET                         
*                                    (MDC335)                @G50DP9A*/         
*        4 ASCBDFLT BIT(1),       /* DEFAULT LOCAL INTERSECT                    
*                                    (MDC336)                @G50DP9A*/         
*        4 *        BIT(6),       /* RESERVED.               @Z40FP9A*/         
*       3 ASCBSRQ2 BIT(8),        /* SECOND BYTE OF ASCBSRQ                     
*                                    (MDC315)                @Z40FP9A*/         
*        4 ASCBDSG3 BIT(1),       /* SIGNAL WAITING PROCESSORS WHEN             
*                                    INTERSECT IS RESET                         
*                                    (MDC337)                @G50DP9A*/         
*        4 *        BIT(5),       /* RESERVED.               @Z40FP9A*/         
*        4 ASCBSRM1 BIT(1),       /* SYSTEM RESOURCE MANAGER (SRM)              
*                                    INTERSECTING  (MDC338)  @G50DP9A*/         
*        4 ASCBQVER BIT(1),       /* QUEUE VERIFICATION INTERSECTING            
*                                    (MDC339)                @G50DP9A*/         
*       3 ASCBSRQ3 BIT(8),        /* THIRD BYTE OF ASCBSRQ                      
*                                    (MDC316)                @Z40FP9A*/         
*        4 ASCBDSG2 BIT(1),       /* SIGNAL WAITING PROCESSORS WHEN             
*                                    INTERSECT IS RESET                         
*                                    (MDC340)                @G50DP9A*/         
*        4 ASCBRCTI BIT(1),       /* REGION CONTROL TASK (RCT)                  
*                                    INTERSECTING  (MDC381)  @ZM48358*/         
*        4 ASCBTCBV BIT(1),       /* TCB VERIFICATION INTERSECTING              
*                                    (MDC342)                @G50DP9A*/         
*        4 ASCBACHA BIT(1),       /* ASCB CHAP INTERSECTING                     
*                                    (MDC343)                @G50DP9A*/         
*        4 *        BIT(1),       /* RESERVED. (MDC344)      @G50DP9A*/         
*        4 ASCBMTER BIT(1),       /* MEMORY TERMINATION INTERSECTING            
*                                    (MDC345)                @G50DP9A*/         
*        4 ASCBMINI BIT(1),       /* MEMORY INITIALIZATION                      
*                                    INTERSECTING  (MDC346)  @G50DP9A*/         
*        4 ASCBCBVE BIT(1),       /* CONTROL BLOCK VERIFICATION                 
*                                    INTERSECTING  (MDC347)  @G50DP9A*/         
*       3 ASCBSRQ4 BIT(8),        /* FOURTH BYTE OF ASCBSRQ                     
*                                    (MDC317)                @Z40FP9A*/         
*        4 ASCBDSG1 BIT(1),       /* SIGNAL WAITING PROCESSORS WHEN             
*                                    INTERSECT IS RESET                         
*                                    (MDC348)                @G50DP9A*/         
*        4 ASCBDETA BIT(1),       /* DETACH INTERSECTING                        
*                                    (MDC349)                @G50DP9A*/         
*        4 ASCBATTA BIT(1),       /* ATTACH INTERSECTING                        
*                                    (MDC350)                @G50DP9A*/         
*        4 ASCBRTM2 BIT(1),       /* RTM2 INTERSECTING                          
*                                    (MDC351)                @G50DP9A*/         
*        4 ASCBRTM1 BIT(1),       /* RTM1 INTERSECTING                          
*                                    (MDC352)                @G50DP9A*/         
*        4 ASCBCHAP BIT(1),       /* CHAP INTERSECTING                          
*                                    (MDC353)                @G50DP9A*/         
*        4 ASCBSTAT BIT(1),       /* STATUS INTERSECTING                        
*                                    (MDC354)                @G50DP9A*/         
*        4 ASCBPURD BIT(1),       /* PURGEDQ INTERSECTING                       
*                                    (MDC355)                @G50DP9A*/         
*      2 ASCBVGTT PTR(31),        /* ADDRESS OF VSAM GLOBAL                     
*                                    TERMINATION TABLE (VGTT)  MDC024*/         
*      2 ASCBPCTT PTR(31),        /* ADDRESS OF PRIVATE CATALOG                 
*                                    TERMINATION TABLE (PCTT)  MDC025*/         
*      2 ASCBSSRB FIXED(15),      /* COUNT OF STATUS STOP SRB'S                 
*                                    (MDC324)                @G50DP9A*/         
*      2 ASCBSMCT PTR(8),         /* NUMBER OF OUTSTANDING STEP                 
*                                    MUST COMPLETE REQUESTS IN                  
*                                    ADDRESS SPACE             MDC016*/         
*      2 ASCBSRBM BIT(8),         /* MODEL PSW BYTE 0 USED BY SRB               
*                                    DISPATCHER  (MDC379)    @G65RP9A*/         
*       3 *        BIT(1),        /* BIT 0 OF ASCBSRBM       @G65RP9A*/         
*       3 ASCBPER  BIT(1),        /* PER BIT IN ASCBSRBM - ALSO USED            
*                                    TO SHOW PER STATUS FOR THE                 
*                                    ADDRESS SPACE  (MDC380) @G65RP9A*/         
*      2 ASCBSWTL FIXED(31),      /* STEP WAIT TIME LIMIT      MDC029*/         
*      2 ASCBSRBT CHAR(8) BDY(DWORD), /* ACCUMULATED SRB TIME  MDC030*/         
*      2 ASCBLTCB PTR(31),        /* TCB and preemptable-class SRB              
*                                    Local lock suspend queue.                  
*                                    Serialization: Adding, CS.                 
*                                    Deleting, ASCB CML promotion WEB           
*                                    lock and CS.                @07C*/         
*      2 ASCBLTCN FIXED(31),      /* Count of TCB and preemptable-class         
*                                    SRB (local and CML)                        
*                                    requestors needing this local              
*                                    lock.                                      
*                                    Serialization: CS           @07A*/         
*      2 ASCBTCBS FIXED(31),      /* NUMBER OF READY TCBS.                      
*                                    THE ACTUAL NUMBER OF READY TCBS            
*                                    IS ASCBTCBS-ASCBLSQT.                      
*                                    SERIALIZATION: CS                          
*                                    OWNERSHIP: TASK MANAGEMENT                 
*                                                                @L8A*/         
*      2 ASCBLSQT FIXED(31),      /* NUMBER OF TCBS ON A LOCAL LOCK             
*                                    SUSPEND QUEUE.                             
*                                    SERIALIZATION: CS                          
*                                    OWNERSHIP: TASK MANAGEMENT                 
*                                                                @L8A*/         
*      2 ASCBWPRB PTR(31),        /* ADDRESS OF WAIT POST REQUEST               
*                                    BLOCK  (MDC362)         @G50CP9A*/         
*      2 ASCBSRDP FIXED(31),      /* SYSTEM RESOURCE MANAGER (SRM)              
*                                    DISPATCHING PRIORITY                       
*                                    (MDC363)                @G50IP9A*/         
*       3 ASCBNDP  PTR(8),        /* NEW DISPATCHING PRIORITY                   
*                                    (MDC364)                @G50IP9A*/         
*       3 ASCBTNDP PTR(8),        /* NEW TIME SLICE DISPATCHING                 
*                                    PRIORITY  (MDC365)      @G50IP9A*/         
*       3 ASCBNTSG PTR(8),        /* NEW TIME SLICE GROUP                       
*                                    (MDC366)                @G50IP9A*/         
*       3 ASCBIODP PTR(8),        /* I/O PRIORITY (MDC374)   @G50IP9A*/         
*      2 ASCBLOCI PTR(31),        /* LOCK IMAGE, ADDRESS OF                     
*                                    ASCB HOLDING THIS ASCB'S                   
*                                    LOCAL LOCK AS A CML                        
*                                    LOCK.                                      
*                                    SERIALIZATION-LOCAL LOCK.                  
*                                    OWNERSHIP - SUPERVISOR.                    
*                                    (MDC383)                @G381P9A*/         
*      2 ASCBCMLW PTR(31),        /* ADDRESS OF THE WEB REPRESENTING            
*                                    THE WORKUNIT THAT IS HOLDING THIS          
*                                    ASCB'S LOCAL LOCK AS A                     
*                                    CML OR LOCAL LOCK.                         
*                                    SERIALIZATION: LOCAL LOCK                  
*                                    OWNERSHIP: SUPERVISOR CONTROL              
*                                                                @L8C*/         
*      2 * CHAR(4) BDY(WORD),     /*                             @0CC*/         
* %IF SYSVERSION = '' %THEN %GOTO ASCB0F4; /*                    @0CC*/         
* %IF SYSRULESMOD='PL/S-III ' %THEN %GOTO ASCB0F4; /*            @0CC*/         
*        3 ASCBCMLC_PREZOS12 FIXED(31), /* COUNT OF CML LOCKS HELD              
*                                    BY THIS ADDRESS SPACE.                     
*                                    Not set as of z/OS 1.12     @0CC*/         
*          5 ASCBSRBT_Disps FIXED(32), /* Count of SRB dispatches.              
*                                    Incremented and cache aligned with         
*                                    ASCBSRBT.                                  
*                                    SERIALIZATION - CS.                        
*                                    OWNERSHIP - SUPERVISOR.     @0CA*/         
* %ASCB0F4:;                      /*                             @0CA*/         
*      2 ASCBSSOM FIXED(32),      /* SPACE SWITCH EVENT OWNER MASK.             
*                                    SERIALIZATION  CS.                         
*                                    OWNERSHIP - SUPERVISOR.                    
*                                                            @ZA58694*/         
*       3 ASCBSSO1 CHAR(3),       /* SPACE SWITCH EVENT OWNER MASK              
*                                    BYTES 1 - 3.   (MDC389) @G381P9A*/         
*       3 ASCBSSO4 BIT(8),        /* SPACE SWITCH EVENT OWNER MASK              
*                                    BYTE 4.        (MDC389) @G381P9A*/         
*        4 * BIT(6),              /* RESERVED FOR SPACE SWITCH EVENT            
*                                    OWNER INDICATORS.                          
*                                                   (MDC389) @G381P9A*/         
*        4 ASCBSSSP BIT(1),       /* SLIP/PER REQUESTED NOTIFICATION            
*                                    ON SPACE SWITCH EVENTS.                    
*                                                   (MDC389) @G381P9A*/         
*        4 ASCBSSJS BIT(1),       /* JOB STEP TERMINATION REQUESTED             
*                                    SPACE SWITCH EVENTS FOR BREAKING           
*                                    LATENT ADDRESSING BINDS.                   
*                                                   (MDC389) @G381P9A*/         
*      2 ASCBASTE PTR(31),        /* VIRTUAL ADDRESS OF                         
*                                    ADDRESS SPACE SECOND                       
*                                    TABLE ENTRY (ASTE).                        
*                                    SERIALIZATION - N/A.                       
*                                    OWNERSHIP - SUPERVISOR.                    
*                                    (MDC384)                @G381P9A*/         
*      2 ASCBLTOV PTR(31),        /* VIRTUAL ADDRESS OF THE                     
*                                    LINKAGE TABLE ORIGIN.                      
*                                    (LOCATED IN PC/AUTH                        
*                                    ADDRESS SPACE LSQA).                       
*                                    SERIALIZATION - PC/AUTH                    
*                                    ADDRESS SPACE LOCAL LOCK.                  
*                                    OWNERSHIP-XM SERVICES.                     
*                                    (MDC383)                @G381P9A*/         
*      2 ASCBATOV PTR(31),        /* VIRTUAL ADDRESS OF                         
*                                    AUTHORIZATION TABLE                        
*                                    (LOCATED IN PC/AUTH                        
*                                    ADDRESS SPACE LSQA).                       
*                                    SERIALIZATION:  PC/AUTH                    
*                                    ADDRESS SPACE LOCAL LOCK.                  
*                                    OWNERSHIP:  XM SERVICES.                   
*                                    (MDC383)                @G381P9A*/         
*      2 ASCBETC FIXED(15),       /* NUMBER OF ENTRY TABLES                     
*                                    CURRENTLY OWNED BY THIS                    
*                                    ADDRESS SPACE.                             
*                                    SERIALIZATION - PC/AUTH                    
*                                    ADDRESS SPACE LOCAL LOCK.                  
*                                    OWNERSHIP - XM SERVICES.                   
*                                    (MDC387)                @G381P9A*/         
*      2 ASCBETCN FIXED(15),      /* NUMBER OF CONNECTIONS                      
*                                    TO ENTRY TABLES IN THIS                    
*                                    ADDRESS SPACE CONTAINING                   
*                                    ANY SPACE SWITCH ENTRIES.                  
*                                    SERIALIZATION - PC/AUTH                    
*                                    ADDRESS SPACE LOCAL LOCK.                  
*                                    OWNERSHIP - XM SERVICES.                   
*                                    (MDC387)                @G381P9A*/         
*      2 ASCBLXR FIXED(15),       /* NUMBER OF LINKAGE                          
*                                    INDEXES RESERVED BY                        
*                                    THIS ADDRESS SPACE.                        
*                                    SERIALIZATION - PC/AUTH                    
*                                    ADDRESS SPACE LOCAL LOCK.                  
*                                    OWNERSHIP - XM SERVICES.                   
*                                    (MDC387)                @G381P9A*/         
*      2 ASCBAXR FIXED(15),       /* NUMBER OF AUTHORIZATION                    
*                                    INDEXES RESERVED BY THIS                   
*                                    ADDRESS SPACE.                             
*                                    SERIALIZATION - PC/AUTH                    
*                                    ADDRESS SPACE LOCAL LOCK.                  
*                                    OWNERSHIP - XM SERVICES.                   
*                                    (MDC387)                @G381P9A*/         
*      2 ASCBSTKH PTR(31),        /* ADDRESS OF LOCAL STACK                     
*                                    POOL HEADER FOR PCLINK                     
*                                    SERVICE.                                   
*                                    SERIALIZATION - N/A.                       
*                                    OWNERSHIP - XM SERVICES.                   
*                                    (MDC383)                @G381P9A*/         
*      2 ASCBCSWD FIXED(32),      /* CS-serialized word, cleared at             
*                                    step term / start           @0FA*/         
*        3 ASCBCSW0 FIXED(8),     /* Byte 0                      @0FA*/         
*        3 ASCBCSW1 FIXED(8),     /* Byte 1                      @0FA*/         
*        3 ASCBCSW2 FIXED(8),     /* Byte 2, ser: CS             @0FA*/         
*          5 ASCBZKF BIT(1),      /*                             @0FA*/         
*        3 ASCBCSW3 FIXED(8),     /* Byte 3, ser: CS             @0FA*/         
*          5 *        BIT(1),     /*                             @0FA*/         
*          5 ASCBZU BIT(1),       /*                             @0FA*/         
*          5 ASCBZF BIT(1),       /*                             @0FC*/         
*          5 ASCBZN BIT(1),       /*                             @0FC*/         
*          5 *        BIT(1),     /*                             @0FC*/         
*          5 ASCBZM BIT(1),       /*                             @0FA*/         
*          5 ASCBZS BIT(1),       /*                             @0FA*/         
*          5 ASCBZC BIT(1),       /* Checked.                    @0FA*/         
*      2 ASCBR114 CHAR(4),        /* RESERVED                    @0FC*/         
*      2 * CHAR(4) BDY(WORD),                                                   
* %IF SYSVERSION = '' %THEN %GOTO ASCBPLS6;                   /* @LQA*/         
* %IF SYSRULESMOD='PL/S-III ' %THEN %GOTO ASCBPLS6;           /* @LQA*/         
*        3 AscbJafbAddr Ptr(31),  /* Address of the JAFB         @LQA*/         
* %ASCBPLS6:;                                                 /* @LQA*/         
*      2 ASCBXTCB PTR(31),        /* ADDRESS OF JOB STEP TASK TCB               
*                                    WHICH OWNS THE CROSS MEMORY                
*                                    RESOURCES IN THIS ADDRESS                  
*                                    SPACE.                                     
*                                    SERIALIZATION - LOCAL LOCK.                
*                                    OWNERSHIP - SUPERVISOR.                    
*                                                 (MDC384)   @G381P9A*/         
*      2 ASCBFW3 FIXED(32),       /* Fullword label to address bits in          
*                                  this word.                                   
*                                  Serialization - CS.                          
*                                  This word is a programming interface         
*                                  only for bits ASCBSDBF, ASCBNOFT,            
*                                  ASCBPO1M, ASCBP1M0            @LPC*/         
*       3 ASCBCS1 BIT(8),         /* FIRST BYTE OF COMPARE AND SWAP             
*                                    FLAGS.       (MDC384)   @G381P9A*/         
*        4 ASCBXMET BIT(1) ABNL,  /* IF ONE, THE ADDRESS SPACE IS               
*                                    NON-REUSABLE BECAUSE OF CROSS              
*                                    MEMORY CONNECTIONS TO IT.  THIS            
*                                    CONDITION MAY NOT BE PERMANENT.            
*                                    SERIALIZATION - CS AND PC/AUTH             
*                                    ADDRESS SPACE LOCAL LOCK.                  
*                                    OWNERSHIP - XM SERVICES.    @L3C*/         
*        4 ASCBXMEC BIT(1) ABNL,  /* CROSS MEMORY ENTRY TABLES                  
*                                    CONTAINING SPACE SWITCH ENTRIES            
*                                    HAVE BEEN CREATED BY THIS                  
*                                    ADDRESS SPACE.                             
*                                    SERIALIZATION - CS AND PC/AUTH             
*                                    ADDRESS SPACE LOCAL LOCK.                  
*                                    OWNERSHIP - XM SERVICES.                   
*                                                 (MDC390)   @G381P9A*/         
*        4 ASCBXMPA BIT(1) ABNL,  /* IF ONE, THE ADDRESS SPACE IS               
*                                    PERMANENTLY NON-REUSABLE BECAUSE           
*                                    OF INCOMPLETE TERMINATION                  
*                                    PROCESSING OF PC/AUTH RESOURCE             
*                                    MANAGER.                                   
*                                    SERIALIZATION - CS AND PC/AUTH             
*                                    ADDRESS SPACE LOCAL LOCK.                  
*                                    OWNERSHIP - XM SERVICES.    @L3A*/         
*        4 ASCBXMLK BIT(1) ABNL,  /* IF ONE, THE ADDRESS SPACE IS               
*                                    PERMANENTLY NON-REUSABLE BECAUSE           
*                                    OF A CML BIND.                             
*                                    SERIALIZATION - CS AND PC/AUTH             
*                                    ADDRESS SPACE LOCAL LOCK.                  
*                                    OWNERSHIP - XM SERVICES.    @L3A*/         
*        4 ASCBPERS BIT(1) ABNL,  /* COMMUNICATION BIT FOR SLIP/PER             
*                                    SRB ROUTINES.                              
*                                    IF 1, THE LOCAL SRB ROUTINE WILL           
*                                    ACTIVATE PER FOR THE SPECIFIED             
*                                    ADDRESS SPACE/JOB/CROSS MEMORY             
*                                    REFERENCES.                                
*                                    IF 0, THE LOCAL SRB ROUTINE WILL           
*                                    DEACTIVATE PER FOR THE ADDRESS             
*                                    SPACE.                                     
*                                    SERIALIZATION - CS AND SLIP                
*                                    SERIALIZATION WORD, SHDRSEQ.               
*                                    OWNERSHIP - SLIP/PER.                      
*                                                   (MDC390) @G381P9A*/         
*        4 ASCBDTER BIT(1) ABNL,  /* A DAT ERROR HAS OCCURRED FOR THIS          
*                                    ADDRESS SPACE.                             
*                                    SERIALIZATION - CS.                        
*                                    OWNERSHIP - RTM.                           
*                                                   (MDC390) @G381P9A*/         
*        4 ASCBPERO BIT(1) ABNL,  /* PER PROCESSING NEEDS TO BE DONE            
*                                    WHEN ADDRESS SPACE IS SWAPPED IN           
*                                    SERIALIZATION - CS.                        
*                                    OWNERSHIP - SLIP.           @L5C*/         
*        4 ASCBSWOP BIT(1) ABNL,  /* ADDRESS SPACE IS SWAPPED OUT WITH          
*                                    RESPECT TO PER PROCESSING BEING            
*                                    DONE.                                      
*                                    SERIALIZATION - CS.                        
*                                    OWNERSHIP - RCT.            @L5A*/         
*       3 ASCBCS2 BIT(8),         /* SECOND BYTE OF COMPARE AND SWAP            
*                                    FLAGS.                      @P5A*/         
*         4 ASCBSAS  BIT(1) ABNL, /* INDICATES THAT STORAGE                     
*                                    ALTERATION SELECTION (PER 2)               
*                                    IS ON FOR EITHER A DATA SPACE              
*                                    ASSOCIATED WITH THE ADDRESS                
*                                    SPACE, OR THE ADDRESS SPACE                
*                                    ITSELF.                     @P5M*/         
*         4 ASCBSMGR BIT(1) ABNL, /* This space is or has been                  
*                                    associated with the session                
*                                    manager                     @LEA*/         
*         4 ASCBDTIN BIT(1) ABNL, /* This space is or has been                  
*                                    associated with ISPF        @LEA*/         
*         4 ASCBXMNR BIT(1) ABNL, /* The address space is permanently           
*                                    non-reusable because of cross              
*                                    memory connections to a system             
*                                    LX.                                        
*                                    Serialization - CS and PC/AUTH             
*                                    address space local lock.                  
*                                    Ownership - XM services     @LFA*/         
*         4 ASCBSDBF BIT(1) ABNL, /* A work unit in this address space          
*                       has set CVTSDBF bit 0 to 1. If this address             
*                       space is memtermed when this bit is on, the             
*                       system will reset CVTSDBF. ASCBSDBF must be             
*                       set on only by the work unit that has just set          
*                       CVTSDBF bit 0 to 1. ASCBSDBF must be reset              
*                       just prior to resetting CVTSDBF. ASCBSDBF               
*                       must be set in the home address space.                  
*                       The SVC Dump request must properly indicate             
*                       BUFFER=YES.                                             
*                       Serialization: CS                        @LKA*/         
*         4 ASCBNOFT BIT(1) ABNL, /* Set this to exempt all tasks in            
*                       this address space from being affected by the           
*                       FORCE TCB command.                                      
*                       Serialization: CS                        @LNC*/         
*         4 ASCBPO1M BIT(1) ABNL, /* Set this to indicate that                  
*                                  the RMODE 31 portion of program              
*                                  objects is to be backed by 1M pages          
*                                  (when available). The bit is reset           
*                                  at jobstep start.                            
*                                  It applies only to modules loaded            
*                                  into private storage.                        
*                                  Serialization: CS             @LPA*/         
*         4 ASCBP1M0 BIT(1) ABNL, /* Set this to indicate that                  
*                                  the RMODE 31 portion of program              
*                                  objects is to be backed by 1M pages          
*                                  (when available), but only when the          
*                                  module will be placed into SP252.            
*                                  The bit is reset at jobstep start.           
*                                  It applies only to modules loaded            
*                                  into private storage.                        
*                                  Do not also set ASCBPO1M.                    
*                                  Serialization: CS             @LPA*/         
*       3 ASCBCS3 BIT(8),         /* 3rd byte of CS flags. Don't need           
*                                    CS if setting bits in only one             
*                                    byte                        @0HA*/         
*         4 ASCBXMSO BIT(1),      /* This address space has owned a             
*                                    XM table with a space-switch               
*                                    PC                          @0HA*/         
*       3 ASCBCS4 BIT(8),         /* 4th byte of CS flags        @0HC*/         
*      2 ASCBGXL  PTR(31),        /* ADDRESS OF GLOBALLY LOADED                 
*                                    MODULE EXTENT INFORMATION                  
*                                    CONTROL BLOCK.                             
*                                    SERIALIZATION - LOCAL LOCK                 
*                                    OWNERSHIP - CONTENTS SUPERVISION           
*                                                  (MDC388)  @G381P9A*/         
*      2 ASCBEATT CHAR(8) BDY(DWORD), /* EXPENDED AND ACCOUNTED                 
*                                    TASK TIME.                                 
*                                    SERIALIZATION - N/A.                       
*                                    OWNERSHIP - SCHEDULER.                     
*                                                  (MDC387)  @G381P9A*/         
*      2 ASCBINTS CHAR(8) BDY(DWORD), /* JOB SELECTION TIME STAMP.              
*                                    SERIALIZATION - N/A.                       
*                                    OWNERSHIP - SCHEDULER.                     
*                                                  (MDC387)  @G381P9A*/         
*      2 ASCBFW4 FIXED(32),       /* FULLWORD LABEL TO ADDRESS BITS             
*                                    IN THIS WORD.                              
*                                    SERIALIZATION - LOCAL LOCK.                
*                                                  (MDC389)  @G381P9A*/         
*       3 ASCBLL1 BIT(8),         /* FIRST BYTE OF FLAGS.                       
*                                    SERIALIZATION - LOCAL LOCK.                
*                                                  (MDC389)  @G381P9A*/         
*        4 ASCBSSPC BIT(1),       /* STATUS STOP TASKS PENDING A                
*                                    CML LOCK RELEASE.                          
*                                                  (MDC389)  @G381P9A*/         
*        4 *        BIT(7),       /* RESERVED.                   @D6C*/         
*       3 ASCBLL2 BIT(8),         /* SECOND BYTE OF FLAGS.                      
*                                    SERIALIZATION - LOCAL LOCK.                
*                                                  (MDC389)  @G381P9A*/         
*       3 ASCBLL3 BIT(8),         /* THIRD  BYTE OF FLAGS.                      
*                                    SERIALIZATION - LOCAL LOCK.                
*                                                  (MDC389)  @G381P9A*/         
*       3 ASCBLL4 BIT(8),         /* FOURTH BYTE OF FLAGS.                      
*                                    SERIALIZATION - LOCAL LOCK.                
*                                                  (MDC389)  @G381P9A*/         
*        4 ASCBNRLL BIT(1),       /* No Release of Local Lock OK. Set           
*                                    only after obtaining LL.    @LRA*/         
*        4 *        BIT(5),       /* RESERVED.                   @LRC*/         
*        4 ASCBTYP1 BIT(1),       /* TYPE 1 SVC HAS CONTROL.  THIS              
*                                    OFFSET FIXED BY ARCHITECTURE.              
*                                                            @G860PXK*/         
*        4 *        BIT(1),       /* RESERVED.               @G860PXK*/         
*      2 ASCBRCMS PTR(31),        /* ADDRESS OF THE REQUESTED CMS               
*                                    CLASS LOCK FOR WHICH THE LOCAL             
*                                    LOCK HOLDER IS SUSPENDED.                  
*                                    SERIALIZATION - LOCAL LOCK.                
*                                    OWNERSHIP - SUPERVISOR.                    
*                                                  (MDC391)  @G381P9A*/         
*      2 ASCBIOSC FIXED(32),      /* I/O SERVICE MEASURE.                       
*                                    SERIALIZATION - CS.                        
*                                    UPDATED BY JES2,JES3,SMF.                  
*                                    READ BY RMF,SMF,SRM.    @G381PXU*/         
*      2 ASCBPKML FIXED(16),      /* PKM OF LAST TASK DISPATCHED                
*                                    IN THIS ADDRESS SPACE.                     
*                                    SERIALIZATION - NONE.                      
*                                    OWNERSHIP - DISPATCHER. @G387PXH*/         
*      2 ASCBXCNT FIXED(15),      /* EXCP COUNT FIELD.                          
*                                    SERIALIZATION - LOCAL LOCK.                
*                                    OWNERSHIP - EXCP.           @P1C*/         
*      2 ASCBNSQA PTR(31),        /* ADDRESS OF THE SQA RESIDENT                
*                                    NSSA CHAIN.                                
*                                    SERIALIZATION - DISPATCHER LOCK.           
*                                    OWNERSHIP - DISPATCHER  @G38BPXH*/         
*      2 ASCBASM  PTR(31),        /* ADDRESS OF THE ASM HEADER.                 
*                                    SERIALIZATION - NONE.                      
*                                    OWNERSHIP - ASM.            @L2A*/         
*      2 ASCBASSB PTR(31),        /* POINTER TO ADDRESS SPACE                   
*                                    SECONDARY BLOCK (ASSB).     @D6C*/         
*      2 ASCBTCME PTR(31),        /* POINTER TO TCXTB.                          
*                                    OWNERSHIP - TCAM.           @D1A*/         
*      2 ASCBGQIR PTR(31),        /* ISGQSCAN INFORMATION ROUTINE               
*                                    ADDRESS.                                   
*                                    SERIALIZATION - COMPARE AND SWAP           
*                                    OWNERSHIP - GRS             @O3A*/         
*       3 *      BIT(8),          /* BYTE 0 OF ASCBGQIR          @O3A*/         
*        4 ASCBGQAB    BIT(1),    /* ISGQSCAN INFORMATION ROUTINE               
*                                    ABENDED FLAG. IF ON, ISGQSCAN              
*                                    INFORMATION ROUTINE UNEXPECTEDLY           
*                                    ABENDED.                    @O3A*/         
*        4 *           BIT(7),    /*                             @O3A*/         
*       3 *      BIT(16),         /* BYTES 1 AND 2 OF ASCBGQIR                  
*                                                                @O3A*/         
*       3 ASCBGQI3 BIT(8),        /* BYTE 3 OF ASCBGQIR          @O3A*/         
*        4 *           BIT(7),    /*                             @O3A*/         
*        4 ASCBGQDS BIT(1),       /* ISGQSCAN INFORMATION ROUTINE               
*                                    DISABLED FLAG. IF ON, ISGQSCAN             
*                                    WILL NOT INVOKE THE ISGQSCAN               
*                                    INFORMATION ROUTINE.        @O3A*/         
*      2 ASCBLSQE  FIXED(31),     /* Number of Enclave TCBs that are on         
*                                    a Local lock suspend queue.                
*                                    Ownership: Task Management                 
*                                    Serialization: Compare and Swap            
*                                                                @LCA*/         
*      2 ASCBIOSX CHAR(8),        /* I/O service measure extended.              
*                                    This is like ASCBIOSC but it               
*                                    is extended to 8 bytes, so                 
*                                    its value continues to grow                
*                                    past the 4GB ASCBIOSC maximum              
*                                    capacity.                                  
*                                    Serialization - CSG         @0AC*/         
*      2 ASCBR168 CHAR(1),        /* RESERVED.                   @0IC*/         
*      2 * CHAR(1),                                           /* @0IA*/         
* %IF SYSVERSION = '' %THEN %GOTO ASCB16A;                    /* @0IA*/         
* %IF SYSRULESMOD='PL/S-III ' %THEN %GOTO ASCB16A;            /* @0IA*/         
*                                                                               
*        3 ASCBDiag169 Char(1),   /* IBM use only                @0IA*/         
* %ASCB16A:;                                                  /* @0IA*/         
*      2 ASCBSVCN CHAR(2),        /* SVC number for type 1 SVC.                 
*                                    Serialization - local lock  @LOA*/         
*      2 ASCBRSME PTR(31),        /* POINTER TO RSM ADDRESS SPACE               
*                                    BLOCK EXTENSION.                           
*                                    SERIALIZATION: RSMAD LOCK                  
*                                    OWNERSHIP: RSM              @D5A*/         
*      2 ASCBAVM  BIT(32) BDY(WORD), /* AVAILABILITY MANAGER ADDRESS            
*                                    SPACE RELATED DATA.                        
*                                    SERIALIZATION: CS.                         
*                                    OWNERSHIP: AVM.             @01C*/         
*        3 ASCBAVM1 BIT(8),       /* FIRST BYTE OF ASCBAVM. - RESERVED.         
*                                                                @01A*/         
*        3 ASCBAVM2 BIT(8),       /* SECOND BYTE OF ASCBAVM.                    
*                                    RESERVED.                   @01A*/         
*        3 ASCBAGEN FIXED(16),    /* AVM ASID REUSE GENERATION NUMBER.          
*                                                                @01A*/         
*      2 ASCBARC  FIXED(32),      /* REASON CODE ON MEMTERM.                    
*                                    SERIALIZATION - N/A.                       
*                                    OWNERSHIP - RTM.        @G860PXK*/         
*      2 ASCBRSM  PTR(31),        /* ADDRESS OF RSM'S CONTROL BLOCK             
*                                    HEADER.                 @G860PVB*/         
*       3 ASCBRSMA PTR(31),       /* ADDRESS OF RSM'S CONTROL BLOCK             
*                                    HEADER.                 @G860PVB*/         
*      2 ASCBDCTI FIXED(31),      /* ACCUMULATED CHANNEL CONNECT TIME           
*                                    INCURRED BY THIS MEMORY.@G860PVB*/         
*      2 ASCBEND  CHAR(0) BDY(DWORD); /* END OF ASCB                 */         
*DCL ASCBVS00 FIXED(8) CONSTANT( 0); /* HBB2102 (NOT IN BASE)@ZA68643*/         
*DCL ASCBVS01 FIXED(8) CONSTANT( 1); /* JBB2110                  @D3A*/         
*DCL ASCBVS02 FIXED(8) CONSTANT( 2); /* JBB2133                  @H1A*/         
*DCL ASCBVS03 FIXED(8) CONSTANT( 3); /* HBB4410                  @L7A*/         
*DCL ASCBVERS FIXED(8) CONSTANT( 3); /* LEVEL OF THIS MAPPING    @L7C*/         
*DCL ASCBDSTZ FIXED(8) CONSTANT(64); /*  Bit constant (x'40') for bit           
*                                    position ASCBDSTK.  PL/X cannot            
*                                    map bit positions in generated             
*                                    positions in generated code, so            
*                                    this bit constant allows PL/X to           
*                                    set the bit in generated                   
*                                    assembler.  Note that the decimal          
*                                    value for the constant (64) is             
*                                    used here instead of x'40',                
*                                    because PL/AS does not tolerate            
*                                    a hex constant here.        @P8C*/         
*  @LISTPOP;                                                   /*@D6A*/         
