*                                                                       00001000
* %DCL IHACDR_INCLUDED CHAR EXT;                                        00002000
* %DEACTIVATE IHACDR_INCLUDED;                                          00003000
* %IF IHACDR_INCLUDED = '' %THEN                                        00004000
* %DO;                                                                  00005000
*/* Macro made bi-lingual on 16037. CBGEN compile date 15295         */ 00006000
*% /*                                                                   00007000
         MACRO                                                          00008000
         IHACDR &DSECT=YES,&LIST=YES,&TITLE=YES,&CDR=YES,&GNEQ=COND,   *00009000
               &SNEQ=COND,&NED=COND                                     00010000
         GBLC  &IHACDR_INCLUDED                                         00011000
         GBLC  &ZCBPRINT                                                00012000
&IHACDR_INCLUDED SETC 'YES'                                             00013000
         AIF   ('&LIST' EQ 'NONE').P0                                   00014000
         AIF   ('&TITLE' EQ 'NO').P5                                    00015000
 TITLE   'IHACDR  - Configuration Data Record                     '     00016000
.P5      ANOP                                                           00017000
**/ IHACDR_1:;                                                          00018000
*/**** START OF SPECIFICATIONS **************************************** 00019000
*                                                                     * 00020000
*01* MACRO NAME:  IHACDR                                              * 00021000
*                                                                     * 00022000
*01* DESCRIPTIVE NAME:  Configuration Data Record                     * 00023000
*                                                                     * 00024000
*02*   ACRONYM: CDR                                                   * 00025000
*                                                                     * 00026000
*01*   DSECT-NAME: CDR, NED, GNEQ, SNEQ                               * 00027000
*                                                                     * 00028000
*01* PROPRIETARY STATEMENT=                                           * 00029000
*                                                                     * 00030000
*    LICENSED MATERIALS - PROPERTY OF IBM                             * 00031000
*    5694-A01 COPYRIGHT IBM CORP. 1992,2009                       @P4C* 00032000
*                                                                     * 00033000
*01* STATUS= HBB7760                                              @P4C* 00034000
*                                                                     * 00035000
*                                                                     * 00036000
*01* FUNCTION:      IHACDR maps the configuration data record (CDR),  * 00037000
*                   which is returned by the read configuration data  * 00038000
*                   (RCD) command. A CDR consists of a variable       * 00039000
*                   number of 32-byte fields. Each 32-byte field is   * 00040000
*                   identified in the first 2 bits (field identifier) * 00041000
*                   as one of four types: unused, a general node      * 00042000
*                   element qualifier (GNEQ), a specific node element * 00043000
*                   qualifier (SNEQ), or a node element descriptor    * 00044000
*                   (NED).  After the field identifier, the contents  * 00045000
*                   of the rest of the 32-byte field depends on the   * 00046000
*                   type. If the 32-byte field is a GNEQ, it is       * 00047000
*                   mapped by the GNEQ structure included in IHACDR.  * 00048000
*                   If the 32-byte field is an SNEQ, it is mapped by  * 00049000
*                   the SNEQ structure included in IHACDR.  If the    * 00050000
*                   32-byte field is an NED, it is mapped by the NED  * 00051000
*                   structure included in IHACDR. Unused fields have  * 00052000
*                   no mapping.                                       * 00053000
*                                                                     * 00054000
*                   The GNEQ is required and is the last 32-byte      * 00055000
*                   field in a CDR.  The GNEQ contains information    * 00056000
*                   that applies to all of the node elements in a     * 00057000
*                   CDR.                                              * 00058000
*                                                                     * 00059000
*                   An SNEQ or set of contiguous SNEQs contain        * 00060000
*                   information regarding the node element described  * 00061000
*                   by the immediately preceding NED in the CDR.      * 00062000
*                   SNEQs are optional.                               * 00063000
*                                                                     * 00064000
*                   An NED is a required 32-byte field in a CDR.      * 00065000
*                   There may be more than 1 NED in a CDR.  The NED   * 00066000
*                   contains information that uniquely identifies a   * 00067000
*                   node element.                                     * 00068000
*                                                                     * 00069000
*01* COMPONENT: I/O Supervisor (SC1C3)                                * 00070000
*                                                                     * 00071000
*01* EYE-CATCHER: none                                                * 00072000
*02*   OFFSET: N/A                                                    * 00073000
*02*   LENGTH: N/A                                                    * 00074000
*                                                                     * 00075000
*01* STORAGE ATTRIBUTES:                                              * 00076000
*02*   SUBPOOL:  caller-provided                                      * 00077000
*02*   KEY:  caller-provided                                          * 00078000
*02*   RESIDENCY: caller-provided                                     * 00079000
*                                                                     * 00080000
*01* METHOD OF ACCESS:                                                * 00081000
*                                                                     * 00082000
*02*   ASM: IHACDR                                                    * 00083000
*             ,DSECT=YES!NO to specify if macro should be defined     * 00084000
*                           as a DSECT.                               * 00085000
*             ,LIST=YES!NO to control whether or not the macro        * 00086000
*                          will appear in the assembler listing.      * 00087000
*             ,CDR=YES!NO to control whether the CDR mapping is       * 00088000
*                         expanded.                                   * 00089000
*             ,GNEQ=YES!NO to control whether the GNEQ mapping is     * 00090000
*                          expanded.                                  * 00091000
*             ,SNEQ=YES!NO to control whether the SNEQ mapping is     * 00092000
*                          expanded.                                  * 00093000
*             ,NED=YES!NO to control whether the NED mapping is       * 00094000
*                         expanded.                                   * 00095000
*                                                                     * 00096000
*                                                                     * 00097000
*02*   PL/X: %INCLUDE SYSLIB(IHACDR)                                  * 00098000
*                                                                     * 00099000
*      Printing of the macro expansion can be controlled by the       * 00100000
*      IHACDR_INCLUDED global macro variable.                         * 00101000
*      Any value other than 'NO' will result in                       * 00102000
*      the  macro  expansion being printed.  The default is 'YES'.    * 00103000
*      following examples illustrate how the                          * 00104000
*      the IHACDR_INCLUDED variable should be set.                    * 00105000
*                                                                     * 00106000
*            PL/X:  %IHACDR_INCLUDED='YES' %IHACDR_INCLUDED='NO'      * 00107000
*                                                                     * 00108000
*01* CREATED BY = issuer of IOSCDR service                            * 00109000
*                                                                     * 00110000
*01* DELETED BY =  issuer of IOSCDR service                           * 00111000
*                                                                     * 00112000
*01* POINTED TO BY: User defined                                      * 00113000
*                                                                     * 00114000
*01* SIZE: Variable                                                   * 00115000
*                CDR  -- X'0020' bytes                                * 00116000
*02*                     byte records.                                * 00117000
*                GNEQ -- X'0020' bytes                                * 00118000
*                SNEQ -- X'0020' bytes                                * 00119000
*                NED  -- X'0020' bytes                                * 00120000
*                                                                     * 00121000
*01* STORAGE ESTIMATE =                                               * 00122000
*   One per issuance of IOSCDR service.                               * 00123000
*                                                                     * 00124000
*01* SERIALIZATION = N/A                                              * 00125000
*                                                                     * 00126000
* EXTERNAL CLASSIFICATION: GUPI                                       * 00127000
* END OF EXTERNAL CLASSIFICATION                                      * 00128000
*                                                                     * 00129000
*01* NOTES =                                                          * 00130000
*                                                                     * 00131000
*      1.  Printing of the macro expansion is controlled by the       * 00132000
*          ZCBPRINT global macro variable.  Any value other than 'NO' * 00133000
*          will result in the macro expansion being printed.  The     * 00134000
*          default is 'YES'.  The following examples illustrate how   * 00135000
*          the ZCBPRINT variable should be set.                       * 00136000
*                                                                     * 00137000
*               ASM:  GBLC &ZCBPRINT                                  * 00138000
*                     &ZCBPRINT SETC 'YES'  or   &ZCBPRINT SETC 'NO'  * 00139000
*              PL/X:  %DCL ZCBPRINT CHAR EXT                          * 00140000
*                     %ZCBPRINT='YES'       or   %ZCBPRINT='NO'       * 00141000
*                                                                     * 00142000
*     2.  A  global  variable IHACDR_INCLUDED is set to YES the first*  00143000
*          time the macro is invoked.                                 * 00144000
*               ASM:  This variable can be checked by the caller, to  * 00145000
*                     determine if the macro has already been invoked.* 00146000
*              PL/X:  This variable is checked in the macro code to   * 00147000
*                     determine if the control block should be        * 00148000
*                     included.                                       * 00149000
*                                                                     * 00150000
*01* CHANGE ACTIVITY:                                                 * 00151000
*                                                                     * 00152000
*   Flag LineItem  FMID    Date   ID    Comment                       * 00153000
*                                                                     * 00154000
*    $L0=OY21399  JBB2220 880201 PDLG:  Configuration Data Record     * 00155000
*    $L1=VERS     HBB3310 880201 PDLG:  Version macro into product    * 00156000
*    $L2=SNWY2    HBB4410 891023 PDLH:  Sunway II support             * 00157000
*    $L3=DEVSD    HBB5510 930304 PDLU:  IOS CDR Interface.            * 00158000
*                                       Externalize and make          * 00159000
*                                       bilingual.                    * 00160000
*    $L4=IOSFLR   HBB7730 050930 PDGG:  FICON RAS/Flapping links      * 00161000
*                                       support.                      * 00162000
*                                       Changes flagged by APAR       * 00163000
*                                       OA10906.                  @L4A* 00164000
*                                                                     * 00165000
*    $P1=PIG2270  HBB5510 930823 PDLU:  Prolog updates            @P1A* 00166000
*    $P2=PIG3270  HBB5510 931104 PDLU:  Prolog updates, CDPI      @P2A* 00167000
*    $P3=ME06244  HBB7730 060324 PDNO:  Correct length of CDR         * 00168000
*                                       area and remove obsolete      * 00169000
*                                       copyright statement.      @P3A* 00170000
*    $P4=ME09499  HBB7760 090306 PDNO:  Add NEDCLASS of x'0C'     @P4A* 00171000
*    $P5=ME15754  HBB7760 090315 PDNO:  No code changes.  Fix         * 00172000
*                                       copyright.                @P5A* 00173000
*                                                                     * 00174000
*    $01=OW09673  HBB4430 950410 PDMC:  Correct mapping for time-out. * 00175000
*                                                                 @01A* 00176000
*    $02=OW25260  HBB4430 970331 PDNO:  3590 support for OS/390 R3    * 00177000
*                                                                 @02A* 00178000
*    $03=OA10906  HBB7707 050930 PDGG:  FICON RAS/Flapping links      * 00179000
*                                       support.                      * 00180000
*                                       Add a redefine of the NEDID   * 00181000
*                                       for the first 26 bytes (no    * 00182000
*                                       TAG field).               @03A* 00183000
*    $04=OA43308 HBB7780 150401 PDB7:   Dynamic Routing Health Check  * 00184000
*                                       support                       * 00185000
*                                                                     * 00186000
****** END OF SPECIFICATIONS *****************************************/ 00187000
*% /*                                                                   00188000
.P0      ANOP                                                           00189000
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 00190000
         AIF   ('&LIST' EQ 'YES').P2                                    00191000
.P1      ANOP                                                           00192000
         PUSH  PRINT                                                    00193000
         PRINT OFF                                                      00194000
.P2      ANOP                                                           00195000
         AIF   ('&CDR' EQ 'NO').L0002                                   00196000
         AIF   ('&DSECT' EQ 'YES').L0003                                00197000
         AIF   ('&CDR' NE 'YES').L0002                                  00198000
CDR      DS    0D        Configuration data record                      00199000
         AGO   .L0004                                                   00200000
.L0003   ANOP                                                           00201000
CDR      DSECT           Configuration data record                      00202000
.L0004   ANOP                                                           00203000
CDRFIELD DS    0CL32     A CDR consists of a variable number of        *00204000
                         32-byte fields                                 00205000
CDRFINFO DS    0CL32     CDR field information                          00206000
CDRFLAGS DS    0CL1      Byte 0                                         00207000
CDRFLDID EQU   X'C0'     Field identifier - identifies the contents of *00208000
                         the 32-byte field. The content of the         *00209000
                         remaining fields of this structure depend on  *00210000
                         the field identifier.                          00211000
         ORG   CDRFLAGS+1                                               00212000
         DS    CL31      Bytes 1-31                                     00213000
*                                                                       00214000
*    *****************************************************************  00215000
*    *                                                               *  00216000
*    * Values for CDRFLDID                                           *  00217000
*    *                                                               *  00218000
*    *****************************************************************  00219000
*                                                                       00220000
*                                                                       00221000
CDRFUNUS EQU   B'00000000' Unused                                       00222000
CDRFSNEQ EQU   B'01000000' SNEQ                                         00223000
CDRFGNEQ EQU   B'10000000' GNEQ                                         00224000
CDRFNED  EQU   B'11000000' NED                                          00225000
CDR_LEN  EQU   *-CDR                                                    00226000
.L0002   ANOP                                                           00227000
         AIF   ('&GNEQ' EQ 'NO').L0005                                  00228000
         AIF   ('&DSECT' EQ 'YES').L0006                                00229000
         AIF   ('&GNEQ' NE 'YES').L0005                                 00230000
.L0006   ANOP                                                           00231000
*                                                                       00232000
*    *****************************************************************  00233000
*    *                                                               *  00234000
*    * GNEQ                                                          *  00235000
*    *                                                               *  00236000
*    *****************************************************************  00237000
*                                                                       00238000
*                                                                       00239000
         AIF   ('&DSECT' EQ 'YES').L0007                                00240000
GNEQ     DS    0D        General Node-Element Qualifier                 00241000
         AGO   .L0008                                                   00242000
.L0007   ANOP                                                           00243000
GNEQ     DSECT           General Node-Element Qualifier                 00244000
.L0008   ANOP                                                           00245000
GNEFLAGS DS    0CL1      Flags                                          00246000
GNEFLDID EQU   X'C0'     Field identifier                               00247000
GNEDYNRT EQU   X'01'     Dynamic Routing is supported                   00248000
         ORG   GNEFLAGS+1                                               00249000
GNERS    DS    B         Record selector                                00250000
GNEINTID DS    H         Interface ID                                   00251000
GNEDDTO  DS    X         Device-Dependent Time Out                      00252000
         DS    CL1       Reserved                                       00253000
GNEMIHPT DS    X         MIH primary time out                           00254000
GNEMIHST DS    X         MIH secondary time out                         00255000
GNEXINFO DS    0CL24     General node element extended information      00256000
GNEQFLDS DS    X         Q fields                                       00257000
         ORG   GNEQ+32                                                  00258000
GNEQ_LEN EQU   *-GNEQ                                                   00259000
.L0005   ANOP                                                           00260000
         AIF   ('&SNEQ' EQ 'NO').L0009                                  00261000
         AIF   ('&DSECT' EQ 'YES').L000A                                00262000
         AIF   ('&SNEQ' NE 'YES').L0009                                 00263000
.L000A   ANOP                                                           00264000
*                                                                       00265000
*    *****************************************************************  00266000
*    *                                                               *  00267000
*    * SNEQ                                                          *  00268000
*    *                                                               *  00269000
*    *****************************************************************  00270000
*                                                                       00271000
*                                                                       00272000
         AIF   ('&DSECT' EQ 'YES').L000B                                00273000
SNEQ     DS    0D        Specific Node-Element Qualifier                00274000
         AGO   .L000C                                                   00275000
.L000B   ANOP                                                           00276000
SNEQ     DSECT           Specific Node-Element Qualifier                00277000
.L000C   ANOP                                                           00278000
SNEFLAGS DS    0CL1      Flags                                          00279000
SNEFLDID EQU   X'C0'     Field identifier                               00280000
         ORG   SNEFLAGS+1                                               00281000
         DS    CL7       Reserved                                       00282000
SNEXINFO DS    CL24      Specific node element extended information     00283000
SNEQ_LEN EQU   *-SNEQ                                                   00284000
.L0009   ANOP                                                           00285000
         AIF   ('&NED' EQ 'NO').L000D                                   00286000
         AIF   ('&DSECT' EQ 'YES').L000E                                00287000
         AIF   ('&NED' NE 'YES').L000D                                  00288000
.L000E   ANOP                                                           00289000
*                                                                       00290000
*    *****************************************************************  00291000
*    *                                                               *  00292000
*    * NED                                                           *  00293000
*    *                                                               *  00294000
*    *****************************************************************  00295000
*                                                                       00296000
*                                                                       00297000
         AIF   ('&DSECT' EQ 'YES').L000F                                00298000
NED      DS    0D        Node-Element Descriptor                        00299000
         AGO   .L0010                                                   00300000
.L000F   ANOP                                                           00301000
NED      DSECT           Node-Element Descriptor                        00302000
.L0010   ANOP                                                           00303000
NEDFLAGS DS    0CL1      Flags                                          00304000
NEDFLDID EQU   X'C0'     Field identifier                               00305000
NEDTOKEN EQU   X'20'     Token indicator                                00306000
NEDSNIND EQU   X'10'     Serial number indicator                        00307000
NEDSUBSN EQU   X'08'     Substitute serial number indicator             00308000
NEDRECON EQU   X'04'     Reconfiguration NED indicator                  00309000
NEDEMULA EQU   X'02'     Emulation NED indicator                        00310000
         ORG   NEDFLAGS+1                                               00311000
NEDTYPE  DS    X         Type of node element described by this NED     00312000
NEDCLASS DS    X         I/O device class. Valid only for I/O device   *00313000
                         type NEDs                                      00314000
NEDFLAG2 DS    0X                                                       00315000
NEDLEVEL EQU   X'01'     Level indicator                                00316000
         ORG   NEDFLAG2+1                                               00317000
NEDID    DS    0CL28     Node element identifier                        00318000
NEDSRTID DS    0CL26     26 byte node element identifier                00319000
NEDTYPEN DS    CL6       Type number                                    00320000
NEDMODN  DS    CL3       Model number                                   00321000
NEDMANUF DS    CL3       Manufacturer                                   00322000
NEDPMANU DS    CL2       Plant of manufacture                           00323000
NEDSEQN  DS    CL12      Sequence number                                00324000
NEDTAG   DS    H         Tag                                            00325000
*                                                                       00326000
*    *****************************************************************  00327000
*    *                                                               *  00328000
*    * Values for NEDTYPE                                            *  00329000
*    *                                                               *  00330000
*    *****************************************************************  00331000
*                                                                       00332000
*                                                                       00333000
NEDTUNSP EQU   0         Unspecified                                    00334000
NEDTIODV EQU   1         I/O device                                     00335000
NEDTCU   EQU   2         Control Unit                                   00336000
*                                                                       00337000
*    *****************************************************************  00338000
*    *                                                               *  00339000
*    * Values for NEDCLASS                                           *  00340000
*    *                                                               *  00341000
*    *****************************************************************  00342000
*                                                                       00343000
*                                                                       00344000
NEDCUNSP EQU   0         Unspecified                                    00345000
NEDCDASD EQU   1         DASD                                           00346000
NEDCTAPE EQU   2         Magnetic tape                                  00347000
NEDCURIN EQU   3         Unit record (input)                            00348000
NEDCUROT EQU   4         Unit record (output)                           00349000
NEDCPRT  EQU   5         Printer                                        00350000
NEDCCOMM EQU   6         Communications controller                      00351000
NEDCFST  EQU   7         Full screen terminal                           00352000
NEDCLMT  EQU   8         Line mode terminal                             00353000
NEDCCTCA EQU   9         Channel-to-channel adapter                     00354000
NEDCSWIT EQU   10        Switch                                         00355000
NEDCCTRL EQU   12        Controller                                     00356000
*                                                                       00357000
*    *****************************************************************  00358000
*    *                                                               *  00359000
*    * Values for GNEQFLDS                                              00360000
*    *                                                               *  00361000
*    *****************************************************************  00362000
*                                                                       00363000
*                                                                       00364000
GNEQITME EQU   1         Device dependent time out value field offset   00365000
NED_LEN  EQU   *-NED                                                    00366000
.L000D   ANOP                                                           00367000
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 00368000
         AIF   ('&LIST' EQ 'YES').P4                                    00369000
.P3      ANOP                                                           00370000
         POP   PRINT                                                    00371000
.P4      ANOP                                                           00372000
.P_EXIT  ANOP                                                           00373000
         MEND                                                           00374000
**/ IHACDR_2:;                                                          00375000
* %IHACDR_INCLUDED = 'YES';                                             00376000
* %DCL ZCBPRINT CHAR EXT;                                               00377000
* %DEACTIVATE ZCBPRINT;                                                 00378000
* %DCL IHACDR_LIST CHAR EXT;                                            00379000
* %DEACTIVATE IHACDR_LIST;                                              00380000
* %IF IHACDR_LIST ^= 'NO' &                                             00381000
*    ZCBPRINT ^= 'NO' %THEN                                             00382000
*   %GOTO IHACDR_3;                                                     00383000
*   @LIST PUSH NOECHO;                                                  00384000
*   @LIST NOASSEMBLE NOECHO;                                            00385000
*   @LIST OFF C NOECHO;                                                 00386000
* %IHACDR_3:;                                                           00387000
*/* Start of PL/X Source                                             */ 00388000
* DCL 1 CDR BDY(DWORD) BASED(CDRPTR), /* Configuration data record   */ 00389000
*       3 CDRFIELD(*) CHAR(32),   /* A CDR consists of a variable       00390000
*                                    number of 32-byte fields        */ 00391000
*         5 CDRFINFO,             /* CDR field information           */ 00392000
*           7 CDRFLAGS,           /* Byte 0                      @P3A*/ 00393000
*             9 CDRFLDID BIT(2),  /* Field identifier - identifies the  00394000
*                                    contents of the 32-byte field.     00395000
*                                    The content of the remaining       00396000
*                                    fields of this structure depend    00397000
*                                    on the field identifier.    @P3C*/ 00398000
*             9 * BIT(6),         /* Reserved                    @P3C*/ 00399000
*           7 * CHAR(31);         /* Bytes 1-31                  @P3C*/ 00400000
*     /* Values for CDRFLDID                                         */ 00401000
* DCL                                                                   00402000
*   CDRFUNUS BIT(8) CONSTANT('00000000'B), /* Unused             @L3C*/ 00403000
*   CDRFSNEQ BIT(8) CONSTANT('01000000'B), /* SNEQ               @L3C*/ 00404000
*   CDRFGNEQ BIT(8) CONSTANT('10000000'B), /* GNEQ               @L3C*/ 00405000
*   CDRFNED  BIT(8) CONSTANT('11000000'B); /* NED                @L3C*/ 00406000
*                                                                       00407000
*     /* GNEQ                                                        */ 00408000
* DCL 1 GNEQ BDY(DWORD) BASED(GNEQPTR), /* General Node-Element         00409000
*                                          Qualifier                 */ 00410000
*       3 GNEFLAGS,               /* Flags                           */ 00411000
*         5 GNEFLDID BIT(2),      /* Field identifier                */ 00412000
*         5 * BIT(5),             /* Reserved                    @04C*/ 00413000
*         5 GNEDYNRT BIT(1),      /* Dynamic Routing is supported       00414000
*                                                                @04A*/ 00415000
*       3 GNERS BIT(8),           /* Record selector                 */ 00416000
*       3 GNEINTID FIXED(16),     /* Interface ID                    */ 00417000
*       3 GNEDDTO FIXED(8),       /* Device-Dependent Time Out   @01C*/ 00418000
*       3 * CHAR(1),              /* Reserved                    @02C*/ 00419000
*       3 GNEMIHPT FIXED(8),      /* MIH primary time out        @02A*/ 00420000
*       3 GNEMIHST FIXED(8),      /* MIH secondary time out      @02A*/ 00421000
*       3 GNEXINFO CHAR(24),      /* General node element extended      00422000
*                                    information                     */ 00423000
*         5 GNEQFLDS(24) FIXED(8); /* Q fields                       */ 00424000
*                                                                       00425000
*     /* SNEQ                                                        */ 00426000
* DCL 1 SNEQ BDY(DWORD) BASED(SNEQPTR), /* Specific Node-Element        00427000
*                                          Qualifier                 */ 00428000
*       3 SNEFLAGS,               /* Flags                           */ 00429000
*         5 SNEFLDID BIT(2),      /* Field identifier                */ 00430000
*         5 * BIT(6),             /* Reserved                        */ 00431000
*       3 * CHAR(7),              /* Reserved                        */ 00432000
*       3 SNEXINFO CHAR(24);      /* Specific node element extended     00433000
*                                    information                     */ 00434000
*                                                                       00435000
*     /* NED                                                         */ 00436000
* DCL 1 NED BDY(DWORD) BASED(NEDPTR), /* Node-Element Descriptor     */ 00437000
*       3 NEDFLAGS,               /* Flags                           */ 00438000
*         5 NEDFLDID BIT(2),      /* Field identifier                */ 00439000
*         5 NEDTOKEN BIT(1),      /* Token indicator                 */ 00440000
*         5 NEDSNIND BIT(1),      /* Serial number indicator         */ 00441000
*         5 NEDSUBSN BIT(1),      /* Substitute serial number           00442000
*                                    indicator                       */ 00443000
*         5 NEDRECON BIT(1),      /* Reconfiguration NED indicator   */ 00444000
*         5 NEDEMULA BIT(1),      /* Emulation NED indicator         */ 00445000
*         5 * BIT(1),             /* Reserved                        */ 00446000
*       3 NEDTYPE FIXED(8),       /* Type of node element described     00447000
*                                    by this NED                     */ 00448000
*       3 NEDCLASS FIXED(8),      /* I/O device class. Valid only for   00449000
*                                    I/O device type NEDs            */ 00450000
*       3 NEDFLAG2 FIXED(8),                                /*   @L3A*/ 00451000
*         5 * BIT(7),             /* Reserved                    @L3C*/ 00452000
*         5 NEDLEVEL BIT(1),      /* Level indicator             @L3C*/ 00453000
*       3 NEDID,                  /* Node element identifier         */ 00454000
*         5 NEDSRTID,             /* 26 byte node element identifier    00455000
*                                                                @03A*/ 00456000
*           7 NEDTYPEN CHAR(6),   /* Type number                 @03C*/ 00457000
*           7 NEDMODN CHAR(3),    /* Model number                @03C*/ 00458000
*           7 NEDMANUF CHAR(3),   /* Manufacturer                @03C*/ 00459000
*           7 NEDPMANU CHAR(2),   /* Plant of manufacture        @03C*/ 00460000
*           7 NEDSEQN CHAR(12),   /* Sequence number             @03C*/ 00461000
*         5 NEDTAG FIXED(16);     /* Tag                             */ 00462000
*     /* Values for NEDTYPE                                          */ 00463000
* DCL                                                                   00464000
*   NEDTUNSP FIXED(8) CONSTANT(0), /* Unspecified                    */ 00465000
*   NEDTIODV FIXED(8) CONSTANT(1), /* I/O device                     */ 00466000
*   NEDTCU   FIXED(8) CONSTANT(2); /* Control Unit                   */ 00467000
*     /* Values for NEDCLASS                                         */ 00468000
* DCL                                                                   00469000
*   NEDCUNSP FIXED(8) CONSTANT(0), /* Unspecified                    */ 00470000
*   NEDCDASD FIXED(8) CONSTANT(1), /* DASD                           */ 00471000
*   NEDCTAPE FIXED(8) CONSTANT(2), /* Magnetic tape                  */ 00472000
*   NEDCURIN FIXED(8) CONSTANT(3), /* Unit record (input)            */ 00473000
*   NEDCUROT FIXED(8) CONSTANT(4), /* Unit record (output)           */ 00474000
*   NEDCPRT  FIXED(8) CONSTANT(5), /* Printer                        */ 00475000
*   NEDCCOMM FIXED(8) CONSTANT(6), /* Communications controller      */ 00476000
*   NEDCFST  FIXED(8) CONSTANT(7), /* Full screen terminal           */ 00477000
*   NEDCLMT  FIXED(8) CONSTANT(8), /* Line mode terminal             */ 00478000
*   NEDCCTCA FIXED(8) CONSTANT(9), /* Channel-to-channel adapter     */ 00479000
*   NEDCSWIT FIXED(8) CONSTANT(10),/* Switch                         */ 00480000
*   NEDCCTRL FIXED(8) CONSTANT(12);/* Controller                 @P4A*/ 00481000
*     /* Values for GNEQFLDS                                     @L2A*/ 00482000
* DCL                                                                   00483000
*   GNEQITME FIXED(8) CONSTANT(1); /* Device dependent time out value   00484000
*                                     field offset               @L2A*/ 00485000
*/* End of PL/X Source                                               */ 00486000
* %IF IHACDR_LIST ^= 'NO' &                                             00487000
*    ZCBPRINT ^= 'NO' %THEN                                             00488000
*   %GOTO IHACDR_4;                                                     00489000
*   @LIST POP NOECHO;                                                   00490000
* %IHACDR_4:;                                                           00491000
* %END;                                                                 00492000
