*                                                                       00001000
* %DCL IHADWHDR_INCLUDED CHAR EXT;                                      00002000
* %DEACTIVATE IHADWHDR_INCLUDED;                                        00003000
* %IF IHADWHDR_INCLUDED = '' %THEN                                      00004000
* %DO;                                                                  00005000
*/* Macro made bi-lingual on 22125. CBGEN compile date 21138         */ 00006000
*% /*                                                                   00007000
         MACRO                                                          00008000
         IHADWHDR &DSECT=YES,&LIST=YES,&TITLE=YES,&DWHDR=YES,          *00009000
               &DWHDRDUMPCNTLSMAP=COND                                  00010000
         GBLC  &IHADWHDR_INCLUDED                                       00011000
         GBLC  &ZCBPRINT                                                00012000
&IHADWHDR_INCLUDED SETC 'YES'                                           00013000
         AIF   ('&LIST' EQ 'NONE').P0                                   00014000
         AIF   ('&TITLE' EQ 'NO').P5                                    00015000
 TITLE   'IHADWHDR  - Dump Writing Structure Dump Header         @P1C '*00016000
                                                                        00017000
.P5      ANOP                                                           00018000
**/ ;                                                                   00019000
*/* START OF SPECIFICATIONS ******************************************* 00020000
*                                                                       00021000
*01* SECURITY:                                                          00022000
* *01* PROPRIETARY STATEMENT=                                        */ 00023000
*/***PROPRIETARY_STATEMENT********************************************/ 00024000
*/*  Proprietary Statement =                                         */ 00025000
*/*  Licensed Materials - Property of IBM                            */ 00026000
*/*  5650-ZOS Copyright IBM Corp. 1993, 2021                         */ 00027000
*/*                                                                  */ 00028000
*/*  Status = HBB77D0                                                */ 00029000
*/*                                                              @L6C*/ 00030000
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 00031000
*/*                                                                     00032000
*02*  ACRONYM:  DWHDR                                                   00033000
*                                                                       00034000
*01* MACRO NAME:  IHADWHDR                                              00035000
*                                                                       00036000
*01* DESCRIPTIVE NAME: Dump Writing Structure Dump Header         @P1C  00037000
*                                                                       00038000
*01* DSECT NAME:                                                        00039000
*     DWHDR                                                             00040000
*     DwhdrDumpCntlsMap                                                 00041000
*                                                                       00042000
*01* COMPONENT:  SVC Dump (SCDMP)                                 @D3C  00043000
*                                                                       00044000
*01* EYE-CATCHER:  NONE                                                 00045000
*                                                                       00046000
*01* STORAGE ATTRIBUTES:                                                00047000
*02*  SUBPOOL:  N/A                                                     00048000
*02*  KEY:  N/A                                                         00049000
*02*  RESIDENCY:  N/A                                                   00050000
*                                                                       00051000
*01* SIZE:                                                              00052000
*     DWHDRDUMPCNTLSMAP -- X'0200' bytes                                00053000
*     DWHDR             -- X'2000' bytes                                00054000
*                                                                       00055000
*01* CREATED BY:  N/A                                                   00056000
*                                                                       00057000
*01* POINTED TO BY:                                                     00058000
*     N/A                                                               00059000
*                                                                       00060000
*01* SERIALIZATION:                                                     00061000
*     None required                                                     00062000
*                                                                       00063000
*01* FUNCTION:                                                          00064000
*02*  Provides a map of the dump header. There is one dump header per   00065000
*     structure in the dump.  It contains the structure controls,       00066000
*     dumping controls, dumping status, dump tailoring options, and the 00067000
*     associated request block.                                         00068000
*     In the dump dataset, the dump                                     00069000
*     header is located before the data associated with a given         00070000
*     structure.                                                        00071000
*01*  During write phase processing, a copy of the dump                 00072000
*     header is also in the buffer data space.                          00073000
*                                                                       00074000
*                                                                       00075000
*01* EXTERNAL CLASSIFICATION: GUPI                                      00076000
*01* END OF EXTERNAL CLASSIFICATION:                                    00077000
*                                                                       00078000
*01* METHOD OF ACCESS:                                                  00079000
*                                                                       00080000
*     ASM:                                                              00081000
*         IHADWHDR                                                      00082000
*     PL/AS:                                                            00083000
*         %dcl DumpHdrAttr char                                         00084000
*         %DumpHdrAttr = 'based/defined/via attributes'                 00085000
*         %INCLUDE SYSLIB(IHADWHDR)                                     00086000
*                                                                       00087000
*         If the DumpHdrAttr macro variable is not set,                 00088000
*         DWHDR will be declared as based.                         @P1C 00089000
*                                                                       00090000
*01* DELETED BY:  N/A                                                   00091000
*                                                                       00092000
*01* FREQUENCY:  N/A                                                    00093000
*                                                                       00094000
*01* DEPENDENCIES:  N/A                                                 00095000
*                                                                       00096000
*01* DISTRIBUTION LIBRARY:                                              00097000
*     AMACLIB                                                           00098000
*                                                                       00099000
*                                                                       00100000
*01* CHANGE ACTIVITY:                                                   00101000
*     $L0= SYSLKD  HBB5510 920812 PD00HX: Dumping for CF structures     00102000
*     $D1=DIG0032  HBB5510 921105 PD00LA: Externalize Dumping Mappings  00103000
*     $D2=DIG0036  HBB5510 930114 PD00FR: Architecture upgrade          00104000
*     $01=OW01117  HBB5510 931216 PDHT:   Prolog updates           @01A 00105000
*     $D3=DR20001  HBB6601 950907 PD00KV: Split from SC1CM         @D3A 00106000
*     $P1=PR20014  HBB6601 950918 PD00KV: Fix prolog               @P1A 00107000
*     $L1=AUTOR    HBB6608 980831 PD00GW: Auto Rebuild             @L1A 00108000
*     $L2=DUPLX    HBB7705 000823 PD00GW: CF Duplexing             @L2A 00109000
*     $L3=CFFLASH  HBB7790 120301 PD00C9: CF Flash                      00110000
*     $L4=CFCRYPT  HBB77B0 160324 PD00C9: CF Data Encryption (T112353)  00111000
*     $L5=OA56774  HBB77A0 190425 PD00C9: CF task monopolization        00112000
*     $L6=333129   HBB77D0 190930 PD00C9: V2R5                          00113000
*     $P2=379320   HBB77D0 200630 PD00C9: ISV                           00114000
*        =OA60650  HBB77B0 210405 PD00C9: Structure Full Threshold      00115000
*                                                                       00116000
* END OF SPECIFICATIONS *********************************************/  00117000
*% /*                                                                   00118000
.P0      ANOP                                                           00119000
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 00120000
         AIF   ('&LIST' EQ 'YES').P2                                    00121000
.P1      ANOP                                                           00122000
         PUSH  PRINT                                                    00123000
         PRINT OFF                                                      00124000
.P2      ANOP                                                           00125000
         AIF   ('&DWHDR' EQ 'NO').L0002                                 00126000
         AIF   ('&DSECT' EQ 'YES').L0003                                00127000
         AIF   ('&DWHDR' NE 'YES').L0002                                00128000
.L0003   ANOP                                                           00129000
*                                                                       00130000
* ****************************************************************** *  00131000
* *                                                                  *  00132000
* *                  Dump Writing Dump Header                        *  00133000
* *                                                                  *  00134000
* ****************************************************************** *  00135000
*                                                                       00136000
*                                                                       00137000
         AIF   ('&DSECT' EQ 'YES').L0004                                00138000
DWHDR    DS    0F        Mapping for dump header                        00139000
         AGO   .L0005                                                   00140000
.L0004   ANOP                                                           00141000
DWHDR    DSECT           Mapping for dump header                        00142000
.L0005   ANOP                                                           00143000
DWHDRSTRCONTROLS DS CL256 Structure controls                            00144000
DWHDROFFSET256 DS CL1    Byte 256                                       00145000
*  Bit definitions:                                                     00146000
DWHDRSTRMONOPSTATE EQU X'80' Dump-time monopolization state (DTMS). ON *00147000
                         indicates that the structure was in the       *00148000
                         monopolized state at the beginning of the     *00149000
                         dumping process (CFLEVEL24)                    00150000
         DS    CL255     Reserved bytes 257-511                         00151000
DWHDRDUMPCONTROLS DS CL512                                              00152000
DWHDRDUMPSTATUS DS CL32  Dumping status                                 00153000
         ORG   DWHDRDUMPSTATUS                                          00154000
DWHDRCAPCOMPCODE DS X    Capture-completion code X'00'                 *00155000
                         Capture-in-progress X'01' Normal completion   *00156000
                         X'02' Dump table full X'03' Serialization     *00157000
                         released                                       00158000
         DS    CL1       Reserved                                       00159000
DWHDRLASTOBJTYPE DS CL2  Last dumping-object type. Object type of the  *00160000
                         object specified by the LOID operand. Valid   *00161000
                         only when the last range object contains a    *00162000
                         nonzero value.                                 00163000
DWHDRLASTRANGE DS F      Last range value processed by a dump request. *00164000
                         Initialized to zero.                           00165000
DWHDRLASTOBJID DS F      Last object identifier (LOID) processed by a  *00166000
                         dump request Valid only when both last range  *00167000
                         nonzero and last dumping-object-type X'0302', *00168000
                         X'0401', or X'0402'                            00169000
DWHDRLASTDIBCT DS F      Last DIB count. Number of DIBs stored in the  *00170000
                         dump table for the object specified by the    *00171000
                         LOID. Valid only when last range nonzero.      00172000
DWHDRLASTELEMCT DS F     Last element count. Number of elements        *00173000
                         contained in the object specified by the      *00174000
                         LOID. Valid only when last range nonzero.      00175000
DWHDRLASTDTEN DS F       Last dump-table-entry number. Highest valued  *00176000
                         dump-table entry that contains a captured     *00177000
                         block.                                         00178000
         DS    CL8       Reserved                                       00179000
         DS    CL224     Reserved                                       00180000
DWHDRDUMPTLROPT DS CL8   Dumping-tailoring options                      00181000
         ORG   DWHDRDUMPTLROPT                                          00182000
DWHDRDUMPLISTLEN DS H    Dumping-list length. Number of ranges in the  *00183000
                         range list of a dump request                   00184000
         DS    CL1       Reserved                                       00185000
DWHDRDUMPCACHEID DS CL1  Identifier of an attached local-cache         *00186000
                         associated with the dump table. Zero => no    *00187000
                         local cache. Only maintained when the         *00188000
                         structure type is X'04'.                       00189000
         ORG   DWHDRDUMPCACHEID                                         00190000
         DS    CL1       Reserved for list                              00191000
         DS    CL4       Reserved                                       00192000
         DS    CL248     Reserved                                       00193000
DWHDREXTSTRCONTROLS DS CL512 Extended Structure Controls                00194000
DWHDRSCC DS    CL512     Structure Copy Controls                        00195000
DWHDRDUPLEXINGCONTROLS DS CL60 Duplexing Controls                       00196000
         DS    CL196     Reserved                                       00197000
DWHDREXTSTRCNTLS2 DS CL256 Extended Structure Controls 2 (CFLEVEL 25)   00198000
DWHDRUSRSTRCNTL2 DS CL512 User Structure Control2 (CFLEVEL 22)          00199000
         DS    CL512     Reserved                                       00200000
DWHDRASSOCREQBLK DS CL4096 Associated Request Block (ARB) Contains the *00201000
                         dumping information and list of               *00202000
                         object-identifier ranges to be included in    *00203000
                         the dump. Also contains the dumping-object    *00204000
                         type, adjunct-inclusion indicator, and        *00205000
                         DIB-exclusion indicator for each object-      *00206000
                         identifier range. The ARB is provided in the  *00207000
                         data block of the associate-dump-table        *00208000
                         command when the dump table is created, and   *00209000
                         is copied into the dump header by the capture  00210000
*                        process. To view the contents of this area,   *00211000
                         use the ARB mapping found in IHAARB macro      00212000
DWHDR_LEN EQU  *-DWHDR                                                  00213000
.L0002   ANOP                                                           00214000
         AIF   ('&DWHDRDUMPCNTLSMAP' EQ 'NO').L0006                     00215000
         AIF   ('&DSECT' EQ 'YES').L0007                                00216000
         AIF   ('&DWHDRDUMPCNTLSMAP' NE 'YES').L0006                    00217000
.L0007   ANOP                                                           00218000
*                                                                       00219000
* ****************************************************************** *  00220000
* *                                                                  *  00221000
* *              Mapping of the Dumping Controls                     *  00222000
* *                                                                  *  00223000
* ****************************************************************** *  00224000
*                                                                       00225000
*                                                                       00226000
         AIF   ('&DSECT' EQ 'YES').L0008                                00227000
DWHDRDUMPCNTLSMAP DS 0F  Mapping for dumping controls                   00228000
         AGO   .L0009                                                   00229000
.L0008   ANOP                                                           00230000
DWHDRDUMPCNTLSMAP DSECT   Mapping for dumping controls                  00231000
.L0009   ANOP                                                           00232000
DWHDRDUMPINFO DS CL128   Dumping Information                            00233000
         DS    CL128     Reserved                                       00234000
DWHDRDUMPAUTH DS CL16    Dumping authority. Zero => dumping controls   *00235000
                         available Nonzero => dumping controls in use   00236000
DWHDRDUMPSER DS CL16     Dumping serialization. Nonzero => Dumping     *00237000
                         serialization held on the structure            00238000
DWHDRDUMPTBLSIZE DS F    Dump-table size. Number of 4096-byte units of *00239000
                         CF storage assigned to the dump table.         00240000
DWHDRSTRTYPE DS CL1      Structure type                                 00241000
DWHDRFLAGS DS  CL1                                                      00242000
*  Bit definitions:                                                     00243000
DWHDRINITCOMP EQU X'80'  Initialization complete indicator              00244000
DWHDRRELEASEINPROG EQU X'40' Release in progress indicator              00245000
         DS    CL218     Reserved                                       00246000
*                                                                       00247000
*   Capture Complete Constants                                          00248000
*                                                                       00249000
*                                                                       00250000
DWHDRCAPCMPCIP EQU X'00' Capture is in progress                         00251000
DWHDRCAPCMPOK EQU X'01'  Normal completion                              00252000
DWHDRCAPCMPTABFULL EQU X'02' Dump table is full                         00253000
DWHDRCAPCMPSERREL EQU X'03' Dump serialization was released             00254000
DWHDRDUMPCNTLSMAP_LEN EQU *-DWHDRDUMPCNTLSMAP                           00255000
.L0006   ANOP                                                           00256000
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 00257000
         AIF   ('&LIST' EQ 'YES').P4                                    00258000
.P3      ANOP                                                           00259000
         POP   PRINT                                                    00260000
.P4      ANOP                                                           00261000
.P_EXIT  ANOP                                                           00262000
         MEND                                                           00263000
**/ ;                                                                   00264000
* %IHADWHDR_INCLUDED = 'YES';                                           00265000
* %DCL ZCBPRINT CHAR EXT;                                               00266000
* %DEACTIVATE ZCBPRINT;                                                 00267000
* %DCL IHADWHDR_LIST CHAR EXT;                                          00268000
* %DEACTIVATE IHADWHDR_LIST;                                            00269000
* %IF IHADWHDR_LIST = 'NO' !                                            00270000
*    ZCBPRINT = 'NO' %THEN                                              00271000
* %DO;                                                                  00272000
*   @LIST PUSH NOECHO;                                                  00273000
*   @LIST NOASSEMBLE NOECHO;                                            00274000
*   @LIST OFF C NOECHO;                                                 00275000
* %END;                                                                 00276000
*/* Start of PL/X Source                                             */ 00277000
*                                                                       00278000
* %IF DumpHdrAttr = '' %THEN                                            00279000
*   %DumpHdrAttr = 'based';                                             00280000
*                                                                       00281000
*/*******************************************************************/  00282000
*/*                                                                 */  00283000
*/*                  Dump Writing Dump Header                       */  00284000
*/*                                                                 */  00285000
*/*******************************************************************/  00286000
*declare                                                                00287000
* 1   DWHDR bdy(word) DumpHdrAttr,     /* Mapping for dump header    */ 00288000
*   3   DwhdrStrControls char(256),    /* Structure controls         */ 00289000
*   3   DwHdrOffset256   char(1),      /* Byte 256               @L5A*/ 00290000
*     5 DwhdrStrMonopState Bit(1),     /* Dump-time monopolization      00291000
*                                         state (DTMS). ON indicates    00292000
*                                         that the structure was in     00293000
*                                         the monopolized state at      00294000
*                                         the beginning of the dumping  00295000
*                                         process (CFLEVEL24)    @L5A*/ 00296000
*     5 * Bit(7),                      /* Reserved               @L5A*/ 00297000
*   3   *                char(255),    /* Reserved bytes 257-511 @L5C*/ 00298000
*   3   DwhdrDumpControls like(DwhdrDumpCntlsMap),                      00299000
*   3   DwhdrDumpStatus,               /* Dumping status             */ 00300000
*     5   DwhdrCapCompCode  fixed(8),  /* Capture-completion code       00301000
*                                        X'00' Capture-in-progress      00302000
*                                        X'01' Normal completion        00303000
*                                        X'02' Dump table full          00304000
*                                        X'03' Serialization released*/ 00305000
*     5   *                char(1),    /* Reserved                   */ 00306000
*     5   DwhdrLastObjType  char(2),   /* Last dumping-object type.     00307000
*                                        Object type of the object      00308000
*                                        specified by the LOID operand. 00309000
*                                        Valid only when the last range 00310000
*                                        object contains a nonzero      00311000
*                                        value.                      */ 00312000
*     5   DwhdrLastRange fixed(32),    /* Last range value processed by 00313000
*                                         a dump request.               00314000
*                                         Initialized to zero.       */ 00315000
*     5 DwhdrLastObjID fixed(32),      /* Last object identifier (LOID) 00316000
*                                        processed by a dump request    00317000
*                                        Valid only when                00318000
*                                        both last range nonzero and    00319000
*                                        last dumping-object-type       00320000
*                                        X'0302', X'0401', or X'0402'*/ 00321000
*     5   DwhdrLastDIBCt    fixed(32), /* Last DIB count.  Number of    00322000
*                                         DIBs stored in the dump table 00323000
*                                         for the object specified by   00324000
*                                         the LOID.  Valid only when    00325000
*                                         last range nonzero.        */ 00326000
*     5   DwhdrLastElemCt   fixed(32),/* Last element count.  Number of 00327000
*                                        elements contained in the      00328000
*                                        object specified by the LOID.  00329000
*                                        Valid only when last range     00330000
*                                        nonzero.                    */ 00331000
*     5   DwhdrLastDTEN     fixed(32), /* Last dump-table-entry number. 00332000
*                                         Highest valued dump-table     00333000
*                                         entry that contains a         00334000
*                                         captured block.            */ 00335000
*     5   *                char(8),    /* Reserved                   */ 00336000
*   3   *                char(224),    /* Reserved                   */ 00337000
*   3   DwhdrDumpTlrOpt,               /* Dumping-tailoring options  */ 00338000
*     5   DwhdrDumpListLen  fixed(16), /* Dumping-list length.  Number  00339000
*                                         of ranges in the range list   00340000
*                                         of a dump request          */ 00341000
*     5   *                char(1),    /* Reserved                   */ 00342000
*     5   DwhdrDumpCacheID  char(1),   /* Identifier of an attached     00343000
*                                         local-cache associated with   00344000
*                                         the dump table.               00345000
*                                         Zero => no local cache.       00346000
*                                         Only maintained when the      00347000
*                                         structure type is X'04'.   */ 00348000
*       7   *                char(1),  /* Reserved for list          */ 00349000
*     5   *                char(4),    /* Reserved                   */ 00350000
*   3   *                char(248),    /* Reserved               @L3C*/ 00351000
*   3   DwhdrExtStrControls char(512), /* Extended Structure            00352000
*                                         Controls               @L3A*/ 00353000
*   3   DwhdrScc         char(512),    /* Structure Copy Controls@L1A*/ 00354000
*   3   DwhdrDuplexingControls char(60), /* Duplexing Controls   @L2A*/ 00355000
*   3   *                char(196),    /* Reserved               @L6C*/ 00356000
*   3   DwhdrExtStrCntls2   char(256), /* Extended Structure            00357000
*                                         Controls 2                    00358000
*                                         (CFLEVEL 25)           @L6A*/ 00359000
*   3   DwhdrUsrStrCntl2 char(512),    /* User Structure Control2       00360000
*                                         (CFLEVEL 22)           @L4A*/ 00361000
*   3   *                 char(512),   /* Reserved               @L4C*/ 00362000
*   3   DwhdrAssocReqBlk  char(4096); /* Associated Request Block (ARB) 00363000
*                                        Contains the dumping           00364000
*                                        information and list of        00365000
*                                        object-identifier ranges to be 00366000
*                                        included in the dump.  Also    00367000
*                                        contains the dumping-object    00368000
*                                        type, adjunct-inclusion        00369000
*                                        indicator, and DIB-exclusion   00370000
*                                        indicator for each object-     00371000
*                                        identifier range.  The ARB is  00372000
*                                        provided in the data block of  00373000
*                                        the associate-dump-table       00374000
*                                        command when the dump table is 00375000
*                                        created, and is copied into    00376000
*                                        the dump header by the capture 00377000
*                                        process.  To view the contents 00378000
*                                        of this area, use the ARB      00379000
*                                        mapping found in IHAARB macro  00380000
*                                                                    */ 00381000
*@space;                                                                00382000
*                                                                       00383000
*                                                                       00384000
*/*******************************************************************/  00385000
*/*                                                                 */  00386000
*/*              Mapping of the Dumping Controls                    */  00387000
*/*                                                                 */  00388000
*/*******************************************************************/  00389000
*                                                                       00390000
*declare                                                                00391000
* 1   DwhdrDumpCntlsMap char(512) based bdy(word), /* Mapping for       00392000
*                                         dumping controls           */ 00393000
*   3   DwhdrDumpInfo     char(128),   /* Dumping Information        */ 00394000
*   3   *                 char(128),   /* Reserved                   */ 00395000
*   3   DwhdrDumpAuth     char(16),    /* Dumping authority.            00396000
*                                         Zero => dumping controls      00397000
*                                          available                    00398000
*                                         Nonzero => dumping controls   00399000
*                                          in use                    */ 00400000
*   3   DwhdrDumpSer      char(16),   /* Dumping serialization.         00401000
*                                        Nonzero => Dumping             00402000
*                                        serialization held on the      00403000
*                                        structure                   */ 00404000
*   3   DwhdrDumpTblSize  fixed(32),   /* Dump-table size.  Number of   00405000
*                                        4096-byte units of CF storage  00406000
*                                        assigned to the dump table. */ 00407000
*   3   DwhdrStrType    char(1),       /* Structure type             */ 00408000
*   3   DwhdrFlags,                                                     00409000
*     5   DwhdrInitComp     bit(1),    /* Initialization complete       00410000
*                                         indicator                  */ 00411000
*     5   DwhdrReleaseInProg bit(1),    /* Release in progress          00412000
*                                         indicator              @D2A*/ 00413000
*     5   *                 bit(6),    /* reserved               @D2C*/ 00414000
*   3    *                char(218);   /* Reserved                   */ 00415000
*@space;                                                                00416000
*                                                                       00417000
*/* Capture Complete Constants                                       */ 00418000
*Declare                                                                00419000
*   DwhdrCapCmpCIP bit(8)                                               00420000
*     constant('00'x),               /* Capture is in progress      */  00421000
*   DwhdrCapCmpOK bit(8)                                                00422000
*     constant('01'x),               /* Normal completion           */  00423000
*   DwhdrCapCmpTabFull bit(8)                                           00424000
*     constant('02'x),               /* Dump table is full          */  00425000
*   DwhdrCapCmpSerRel bit(8)                                            00426000
*     constant('03'x);               /* Dump serialization was          00427000
*                                         released                   */ 00428000
*/* End of PL/X Source                                               */ 00429000
* %IF IHADWHDR_LIST = 'NO' !                                            00430000
*    ZCBPRINT = 'NO' %THEN                                              00431000
* %DO;                                                                  00432000
*   @LIST POP NOECHO;                                                   00433000
* %END;                                                                 00434000
* %END;                                                                 00435000
