*/********************************************************************/ 00000100
*/*                                                                  */ 00000200
*/* $MAC(IHADCBE) COMP(28414):                                       */ 00000300
*/*                                                                  */ 00000400
*/*  MACRO NAME: IHADCBE                                             */ 00000500
*/*                                                                  */ 00000600
*/*  DESCRIPTION: Maps the DCB Extension (DCBE)                      */ 00000700
*/*                                                                  */ 00000800
*/*  STATUS: z/OS 2.5 DFSMS                                          */ 00000900
*/*                                                                  */ 00001000
*/*PROPRIETARY V3 STATEMENT                                          */ 00001100
*/*Licensed Materials - Property of IBM                              */ 00001200
*/*"Restricted Materials of IBM"                                     */ 00001300
*/*5650-ZOS                                                          */ 00001400
*/*Copyright IBM Corp. 1993,2019                                     */ 00001500
*/*END PROPRIETARY V3 STATEMENT                                      */ 00001600
*/*                                                                  */ 00001700
*/*  FUNCTION: The IHADCBE macro defines fields and flags within     */ 00001800
*/*            the DCBE which is expanded by the DCBE macro          */ 00001900
*/*            instruction.                                          */ 00002000
*/*                                                                  */ 00002100
*/*  NOTES:                                                          */ 00002200
*/*                                                                  */ 00002300
*/*    DEPENDENCIES: None                                            */ 00002400
*/*    RESTRICTIONS: None                                            */ 00002500
*/*                                                                  */ 00002600
*/*  MACRO:                                                          */ 00002700
*/*                                                                  */ 00002800
*/*    PROCESSOR: Assembler and PL/X.                                */ 00002900
*/*    DISTRIBUTION LIBRARY: AMACLIB                                 */ 00003000
*/*    ATTRIBUTES: INCLUDE                                           */ 00003100
*/*                                                                  */ 00003200
*/*  ENTRY POINT: IHADCBE                                            */ 00003300
*/*                                                                  */ 00003400
*/*    LINKAGE:                                                      */ 00003500
*/*        ASSEMBLER :                                               */ 00003600
*/*            IHADCBE VERSION={0!1}                             @L8C*/ 00003700
*/*            USING  DCBE,DCBEPTR                                   */ 00003800
*/*        PL/X :                                                    */ 00003900
*/*            %DCBE_VERSION={'0'!'1'}                           @L8C*/ 00004000
*/*            %DCBE_BASE = 'BASED(DCBDCBE)'                         */ 00004100
*/*            %INCLUDE SYSLIB(IHADCBE)                              */ 00004200
*/*                                                                  */ 00004300
*/*  EXIT NORMAL:                                                    */ 00004400
*/*                                                                  */ 00004500
*/*    Define the DCBE mapping.                                  @L8C*/ 00004600
*/*                                                                  */ 00004700
*/*  EXIT IF ERROR:                                                  */ 00004800
*/*    Error message and return code 8 if invalid VERSION value. @L8A*/ 00004900
*/*                                                                  */ 00005000
*/*  EXTERNAL REFERENCES:                                            */ 00005100
*/*                                                                  */ 00005200
*/*    MACROS:                                                       */ 00005300
*/*      None                                                        */ 00005400
*/*                                                                  */ 00005500
*/*  CHANGE ACTIVITY:                                                */ 00005600
*/*                                                                  */ 00005700
*/* $L0=STRIPE,JDZ1110,920107,SJPLCC: Striping support               */ 00005800
*/* $L1=XSAM,HDZ11C0,951108,SJPLCC: Support 8 byte DCBESIZE value@L1A*/ 00005900
*/* $L2=GT32K,HDZ11E0,971209,SJPLRK: BLOCK SIZE (DCBEBLKSI)      @L2A*/ 00006000
*/* $L3=OW49831,HDZ11F0,010720,SJPLWER: IBM 3590 capacity, perf. @L3A*/ 00006100
*/* $00=UNDERSC,HDZ11G0,010928,SJPLWER: Underscore in IHADCBE    @00A*/ 00006200
*/* $L4=EDI    ,HDZ11H0,020507,SJPLREB: EXTENDED DATA INTEGRITY  @L4A*/ 00006300
*/* $L5=LARGFMT,HDZ11K0,031203,SJPLWER: Large format data sets   @L5A*/ 00006400
*/* $01=OA08360,HDZ11J0,040620,SJPLCC: Support DCBE FIXED parm   @01A*/ 00006500
*/* $L6=BAMPERF,HDZ1190,060501,SVLPF: Support DCBE FIXED parm    @L6A*/ 00006600
*/* $LV=EAV    ,JDZ1A10,060234,SJPLJBC: Extended Address Vol. OK @P1C*/ 00006700
*/* $P0=K190263,HDZ1190,060821,SVLPF: Correct location of BENEFIX@P0A*/ 00006800
*/* $P1=K1A0560,HDZ1A10,070426,SVLPF: Correct change activity    @P1A*/ 00006900
*/* $L7=XTIOT,HDZ1C10,090311,SJPLLM: Add LOC=ANY bit             @L7A*/ 00007000
*/* $PU=PDSEVAL,HDZ1C10,100326,SJPLLM: PDSE Validation           @PUA*/ 00007100
*/* $03=OA35999,HDZ1D10,20110406,sjpllm:                         @03A*/ 00007200
*/*   1. DCBE_CONCURRENTRW                                           */ 00007300
*/* $MA=SM01921,HDZ2220,11082013,SJPLJAL: TAPE PERFORMANCE       @MAA*/ 00007400
*/* $L8=OA48124,HDZ2220,20150615,sjplccl:                        @L8A*/ 00007500
*/*   1. Bypass authority checking. Support version 1 DCBE       @L8A*/ 00007600
*/* $L9=ROAVOLS,HDZ2230,160404,MDCASAD: READ-ONLY VOLUMES        @L9A*/ 00007700
*/* $LA=ENCRYPT,HDZ2230,20160131,EZHOVA: SAM Encryption          @LAA*/ 00007800
*/* $04=OA51385,HDZ2230,20161004,sjpljrb:                        @04A*/ 00007900
*/*   1. SAM support for zHyperwrite                             @04A*/ 00008000
*/* $LB=260108,HDZ2240,20180704,ezhova:                          @LBA*/ 00008100
*/*   1. Update comment for DCBE_DS_ENCRYPTION bit               @LBA*/ 00008101
*/* $05=W314810,HDZ2240,20190617,TUCJRB: Basic/Large DS Encrypt  @05A*/ 00008102
*/* $LC=ENCRYPT,HDZ2240,20200606,TUCJRB:                         @LCA*/         
*/*   1. Basic/Large DS Encrypt non-prefixed block support       @LCA*/         
*/* $06=OA61271,HDZ2250,20210415,eseftel                         @06A*/         
*/*   1. Support for Bypass Extent Check                         @06A*/         
*/********************************************************************/ 00008200
*      %GOTO DCBEPLAS;                                                  00008300
               MACRO                                                    00008400
               IHADCBE &VERSION=0                                  @L8C 00008500
         AIF   ('&VERSION' EQ '0' OR '&VERSION' EQ '1').CONT1      @L8A 00008600
         IGGERMAC 205,'VERSION','0 OR 1'                           @L8A 00008700
         MEXIT                                                     @L8A 00008800
.CONT1   ANOP                                                      @L8A 00008900
DCBE     DSECT                                                          00009000
         DS    0D                                                       00009100
DCBEID   DS    CL4            DCBE eyecatcher 'DCBE'.                   00009200
DCBELEN  DS    H              Length of DCBE.                           00009300
DCBERSV1 DS    XL2            Reserved.                                 00009400
DCBEDCB  DS    A              DCB address. Set by system.               00009500
*                              Must be zero when OPEN is                00009600
*                              issued. Set to zero at CLOSE.            00009700
DCBERELA DS    CL4            Partitioned data set - Address            00009800
*                              (in the form TTRN) of member             00009900
*                              currently used.                          00010000
DCBEFLG1 DS    B              Flags set by system.                      00010100
DCBEOPEN EQU   X'80'          DCBE has been successfully                00010200
*                              opened.                                  00010300
DCBEMD31 EQU   X'40'          User may call access method in            00010400
*                              31-bit mode and, if QSAM, system         00010500
*                              will honor DCBEBU31. Set by              00010600
*                              system before DCB OPEN exit.             00010700
DCBESLBI EQU   X'20'          Before DCB OPEN exit: SAM supports   @L2A*00010800
                               large block interface if requested. @L3C*00010900
                               After OPEN: User requested LBI and  @L3C*00011000
                               SAM supports it.                    @L3C 00011100
DCBE_32BIT_INUSE EQU X'10'    Device using 32-bit block numbers,   @L3A*00011200
                               maybe due to CAPACITYMODE=XCAP      @L3A 00011300
DCBEBENEFIX EQU   X'08'       Performance would be benefited if    @L6A*00011400
                               the application program were to set @L6A*00011500
                               DCBEBFXU and fix all data pages.    @L6A*00011600
                               Requires authorization.  Set by     @L6A*00011700
                               system before DCB OPEN exit         @L6A 00011800
DCBE_DS_ENCRYPTION EQU X'04'  Data set is encrypted (DS1ENCRP=ON). @LAA*00011900
                               Sequential concatenation: only      @LBA*00012000
                               current data set.                   @LBA*00012100
                               Partitioned concatenation: all data @LBA*00012200
                               sets are encrypted                  @LBA 00012300
DCBE_HYPERWRITE_FB EQU X'02'  Set by system during OPEN after the  @04A 00012400
*                              DCB OPEN exit if HyperWrite was     @04A 00012500
*                              requested and honored.              @04A 00012600
DCBE_BYPASS_EXTENT_CHECK_FB EQU X'01' Set by system during OPEN    @06A         
*                              after DCB OPEN exit if BEC was      @06A         
*                              requested and honored.              @06A         
DCBEFLG2 DS    B              Flags set by user.                        00012700
DCBEBU31 EQU   X'80'          RMODE31=BUFF.                             00012800
*                              QSAM buffers may be above 16MB           00012900
*                              line and CLOSE will free them.           00013000
*                              System may test this during              00013100
*                              concatenation. This will be              00013200
*                              ignored for BSAM and user                00013300
*                              supplied buffers.                        00013400
DCBENEOD EQU   X'40'          PASTEOD=YES.                              00013500
*                              The HWM of the data set is to            00013600
*                              be ignored on input for striped          00013700
*                              data sets.                               00013800
DCBE_CONCURRENTRW EQU X'20'   CONCURRENTRW=YES                     @03A 00013900
*                              The data set may be read at the     @03A 00014000
*                              same time it is being written       @03A 00014100
DCBENVER EQU   X'10'          NOVER=YES.                                00014200
*                              OPEN is to bypass the verifica-          00014300
*                              tion of consistent stripes of a          00014400
*                              striped data set.                        00014500
DCBEGSIZ EQU   X'08'          GETSIZE=YES.                              00014600
*                              OPEN is to calculate the size of         00014700
*                              the data set (RBNs) and store            00014800
*                              this number in DCBESIZE.                 00014900
DCBEULBI EQU   X'04'          BLKSIZE specified on DCBE.  User     @L2A*00015000
                               requests SAM large block interface. @L2A 00015100
DCBE_REQST_XCAP EQU X'02'     CAPACITYMODE=XCAP.  Extended         @L3A*00015200
                               capacity.  Device to use 32-bit     @L3A*00015300
                               block identifiers if supported.     @L3A 00015400
DCBEEXPS EQU   X'01'          Bypass extended data integrity       @L4A*00015500
                               checking. user must be system key,  @L4A*00015600
                               supervisor state, or apf authorized @L4A*00015700
                               for this to have effect.            @L4A 00015800
DCBENSTR DS    H              The number of stripes for a               00015900
*                              striped data set. Zero if data           00016000
*                              set is not striped. Set by OPEN          00016100
*                              or when switching between data           00016200
*                              sets in a concatenation. Set             00016300
*                              before OPEN or EOV exit is               00016400
*                              called.                                  00016500
DCBEFLG3 DS    B              Flags set by user                    @L3A 00016600
DCBELARGE EQU  X'80'          BLOCKTOKENSIZE=LARGE.  BSAM/BPAM:    @L5A*00016700
                               NOTE/POINT use 4 bytes, not 3.      @L5A*00016800
                               EXCP: Program can handle >64 K trks @L5A 00016900
DCBEBFXU EQU   X'40'          FIXED=USER                                00017000
*                              No I/O pagefixing needed. User           00017100
*                              is responsible for passing               00017200
*                              fixed buffers. Auth callers only.   @L6C 00017300
DCBEEADSCBOK EQU X'20'        User supports 28-bit cylinder             00017400
*                              addressing/extended attributes      @LVA 00017500
DCBELOCANY EQU X'10'          User allows XTIOT and allows DSABs and    00017600
*                              UCBs to be in 31-bit storage        @L7A 00017700
DCBE_PDSEEXT_VALID EQU X'08'  DCBE_PDSEEXT is valid                @PUA 00017800
DCBESYNC_NONE   EQU X'07'     SYNC=NONE if all three bits are 1    @L3A 00017900
DCBESYNC_SYSTEM EQU X'01'     SYNC=SYSTEM if low 3 bits are 001.   @L3A*00018000
                              Other combinations are reserved.     @L3A 00018100
DCBEFLG5 DS    B              Flags                                @L9C 00018200
DCBE_BYPASS_EXTENT_CHECK EQU X'10' BYPASS_EXTENT_CHECK=YES         @06A         
DCBEDSENCNP EQU X'08'         1=No block in the data set has a     @LCA         
*                              prefix. Meaningful only during      @LCA         
*                              open for an encrypted basic or large@LCA         
*                              format data set. EXCP only, not     @LCA         
*                              allowed by BSAM or QSAM. First open @LCA         
*                              for output marks the data set as    @LCA         
*                              prefixed or not prefixed. With every@LCA         
*                              subsequent open, this bit must be   @LCA         
*                              consistent with how the data set was@LCA         
*                              marked. No DCBE keyword sets this.  @LCA         
DCBEDSENCRYPTOK EQU X'04'     DSENCRYPT=OK                         @05A 00018210
DCBE_HYPERWRITE EQU X'02'     HYPERWRITE=YES                       @04A 00018300
DCBETrackLock EQU X'01'       CONCURRENTRW=(YES,TRKLOCK)           @L9A 00018400
*                              specified. This means the           @L9A 00018500
*                              application can tolerate            @L9A 00018600
*                              inconsistent read data due to       @L9A 00018700
*                              concurrent writes to other tracks.  @L9A 00018800
*                              DCBETrackLock has an effect only    @L9A 00018900
*                              when the device is defined          @L9A 00019000
*                              read-only.                          @L9A 00019100
         DS    XL2            Reserved.                            @L9C 00019200
DCBEBLKSI8 DS  0XL8           Block size in 8 bytes                @L2A 00019300
         DS    F              Hi-order half of Block size          @L2A 00019400
DCBEBLKSI DS   F              Block size, valid only if            @L2A 00019500
*                              DCBESLBI is set.                    @L2A 00019600
DCBEXSIZ DS    0XL8           Number of blocks in current               00019700
*                              data set. Set by system when             00019800
*                              DCBEGSIZ is set.                    @L1A 00019900
DCBESIZ0 DS    F              High order word of DCBEXSIZ.         @L1C 00020000
DCBESIZE DS    F              Number of blocks in current               00020100
*                              data set. Set by system when             00020200
*                              DCBEGSIZ is set.                         00020300
DCBEEODA DS    A              Address of user provided end-             00020400
*                              of-data routine. May reside              00020500
*                              above or below the line. Used            00020600
*                              instead of DCBEODAD. Will be             00020700
*                              zero if no address is given.             00020800
DCBESYNA DS    A              Address of user provided SYNAD            00020900
*                              routine. May reside above or             00021000
*                              below the line. Used instead of          00021100
*                              DCBSYNAD. Will be zero if no address     00021200
*                              is given.                                00021300
DCBE_PDSEEXT   DS A           Address of PDSE DCBE extension       @PUA 00021400
DCBENMFL DS    H              Number tape files before synchronize @MAA 00021500
DCBEMACC DS    XL1            Accumulation number multiplier.           00021600
DCBEMSDN DS    XL1            Multiplier of System Determined NCP.      00021700
DCBEMINL EQU   *-DCBE         Minimum length of DCBE.  This label       00021800
*                              should never be moved.                   00021900
* End of DCBE Version 0                                            @L8A 00022000
         AIF   ('&VERSION' EQ '0').FINISH                          @L8A 00022100
DCBEFLG4 DS    B              Flags set by user                    @L8A 00022200
DCBE_BYPASS_AUTH  EQU X'80'   Bypass authority checking            @L8A 00022300
         DS    XL23           Reserved. Must be zero.              @L8A 00022400
DCBELENV1 EQU   *-DCBE        Length of DCBE version 1.            @L8A 00022500
* End of DCBE Version 1                                            @L8A 00022600
.FINISH  ANOP                                                      @L8A 00022700
DCBEEND  EQU   *              End of DCBE. this label shows             00022800
*                              the current length of a DCBE.            00022900
         MEND                                                           00023000
*%DCBEPLAS:;                                                            00023100
*%IF DCBE_VERSION = '' %THEN                                            00023200
*  %DCBE_VERSION = '0';                                          ] @L8A 00023300
*DECLARE  /*Data control block extension. Can be above 16 MB line.@L3C*/00023400
*  1  DCBE BASED(DCBDCBE) BDY(WORD),                                    00023500
*    3  DCBEID    CHAR(4),          /* DCBE eyecatcher 'DCBE'.       */ 00023600
*    3  DCBELEN   FIXED(16),        /* Length of DCBE.               */ 00023700
*    3  DCBERSV1  CHAR(2),          /* Reserved.                     */ 00023800
*    3  DCBEDCB   PTR(31),          /* DCB address. Set by system.      00023900
*                                      Must be zero when OPEN is        00024000
*                                      issued. Set to zero at CLOSE. */ 00024100
*    3  DCBERELA  CHAR(4),          /* Partitioned data set - Address   00024200
*                                      (in the form TTRN) of member     00024300
*                                      currently used.               */ 00024400
*    3  DCBEFLG1  CHAR(1),          /* Flags set by system.          */ 00024500
*      5  DCBEOPEN BIT(1),          /* DCBE has been successfully       00024600
*                                      opened.                       */ 00024700
*      5  DCBEMD31 BIT(1),          /* User may call access method in   00024800
*                                      31-bit mode and, if QSAM, system 00024900
*                                      will honor DCBEBU31. Set by      00025000
*                                      system before DCB OPEN exit.  */ 00025100
*      5  DCBESLBI BIT(1),          /* Before DCB OPEN exit: SAM sup-   00025200
*                                      ports large block interface if   00025300
*                                      requested.  After OPEN: LBI  @L2A00025400
*                                      requested and supported.   @L3C*/00025500
*      5 DCBE_32BIT_INUSE BIT(1),   /* Device using 32-bit block   @L3A 00025600
*                                      numbers, maybe due to       @L3A 00025700
*                                      CAPACITYMODE=XCAP.         @L3A*/00025800
*      5  DCBEBENEFIX BIT(1),  /*Performance would be benefited if@P0M  00025900
*                              the application program were to set@P0M  00026000
*                              DCBEBFXU and fix all data pages.   @P0M  00026100
*                              Requires authorization.  Set by    @P0M  00026200
*                              system before DCB OPEN exit       @P0M*/ 00026300
*      5  DCBE_DS_ENCRYPTION BIT(1), /* Data set is encrypted           00026400
*                              (DS1ENCRP=ON).                    @LAA   00026500
*                              Sequential concatenation: only    @LBA   00026600
*                              current data set.                 @LBA   00026700
*                              Partitioned concatenation: all    @LBA   00026800
*                              data sets are encrypted           @LBA*/ 00026900
*      5 DCBE_HYPERWRITE_FB BIT(1), /* Set by system on return from     00027000
*                                       OPEN, after the DCB OPEN        00027100
*                                       exit.                    @04A*/ 00027200
*      5 DCBE_BYPASS_EXTENT_CHECK_FB BIT(1),/* BYPASS_EXTENT_CHECK              
*                                       requested by user                       
*                                       and honored.             @06A*/         
*    3  DCBEFLG2  CHAR(1),          /* Flags set by user.            */ 00027400
*      5  DCBEBU31 BIT(1),          /* RMODE31=BUFF.                    00027500
*                                      QSAM buffers may be above 16MB   00027600
*                                      line and CLOSE will free them.   00027700
*                                      System may test this during      00027800
*                                      concatenation. This will be      00027900
*                                      ignored for BSAM and user        00028000
*                                      supplied buffers.             */ 00028100
*      5  DCBENEOD BIT(1),          /* PASTEOD=YES.                     00028200
*                                      The HWM of the data set is to    00028300
*                                      be ignored on input for striped  00028400
*                                      data sets.                    */ 00028500
*      5  DCBE_CONCURRENTRW Bit(1), /* The data set may be read at the  00028600
*                                      same time it is being written    00028700
*                                                                @03A*/ 00028800
*      5  DCBENVER BIT(1),          /* NOVER=YES.                       00028900
*                                      OPEN is to bypass the verifica-  00029000
*                                      tion of consistent stripes of a  00029100
*                                      striped data set.             */ 00029200
*      5  DCBEGSIZ BIT(1),          /* GETSIZE=YES.                     00029300
*                                      OPEN is to calculate the size of 00029400
*                                      the data set (RBNs) and store    00029500
*                                      this number in DCBESIZE.      */ 00029600
*      5  DCBEULBI BIT(1),          /* BLKSIZE specified on DCBE.       00029700
*                                      The application can use the SAM  00029800
*                                      large block interface.     @L2A*/00029900
*      5 DCBE_REQST_XCAP BIT(1),    /* CAPACITYMODE=XCAP.  Extended @L3A00030000
*                                    capacity. Device to use 32-bit @L3A00030100
*                                    block numbers if supported.  @L3A*/00030200
*      5 DCBEEXPS BIT(1),           /* Bypass extended data integrity   00030300
*                                      checking. User must be system key00030400
*                                      supervisor stage, or apf         00030500
*                                      authorized for this to have      00030600
*                                      effect.                    @L4A*/00030700
*    3  DCBENSTR  FIXED(16),        /* The number of stripes for a      00030800
*                                      striped data set. Zero if data   00030900
*                                      set is not striped. Set by OPEN  00031000
*                                      or when switching between data   00031100
*                                      sets in a concatenation. Set     00031200
*                                      before OPEN or EOV exit is       00031300
*                                      called.                       */ 00031400
*    3 DCBEFLG3 BIT(8),             /* Flags set by user          @L3A*/00031500
*      5 DCBELARGE BIT(1),          /*BLOCKTOKENSIZE=LARGE.  BSAM/BPAM  00031600
*                                      NOTE/POINT use 4 bytes, not 3.   00031700
*                                      EXCP: Pgm supports>64K trks@L5A*/00031800
*      5  DCBEBFXU BIT(1),          /* FIXED=USER                       00031900
*                                      No I/O pagefixing needed. User   00032000
*                                      is responsible for passing       00032100
*                                      fixed buffers. Auth callers only 00032200
*                                                                @L6C*/ 00032300
*      5  DCBEEADSCBOK BIT(1),      /* User supports 28-bit cylinder    00032400
*                                      addr/extended attributes   @LVA*/00032500
*      5  DCBELOCANY BIT(1),        /* User allows XTIOT and allows     00032600
*                                      DSABs and UCBs to be             00032700
*                                      in 31-bit storage          @L7A*/00032800
*      5 DCBE_PDSEEXT_VALID BIT(1), /* DCBE_PDSEEXT is valid      @PUA*/00032900
*      5 DCBESYNC BIT(3),           /* SYNC=. See constants below @L3A*/00033000
*    3 DCBEFLG5 BIT(8),             /* Flags                      @L9A*/00033100
*       5 *               BIT(3),   /* Reserved                   @06C*/        
*       5 DCBE_BYPASS_EXTENT_CHECK BIT(1),/*BYPASS_EXTENT_CHECK=YE@06A*/        
*       5 DCBEDSENCNP     BIT(1),   /* 1=No block in the data set @LCA*/        
*                                   /* has a prefix. Meaningful   @LCA*/        
*                                   /* only during open for an    @LCA*/        
*                                   /* encrypted basic or large   @LCA*/        
*                                   /* format data set. EXCP only,@LCA*/        
*                                   /* not allowed by BSAM or     @LCA*/        
*                                   /* QSAM. First open for output@LCA*/        
*                                   /* marks the data set as      @LCA*/        
*                                   /* prefixed or not prefixed.  @LCA*/        
*                                   /* With every subsequent open,@LCA*/        
*                                   /* this bit must be consistent@LCA*/        
*                                   /* with how the data set was  @LCA*/        
*                                   /* marked. No DCBE keyword    @LCA*/        
*                                   /* sets this.                 @LCA*/        
*       5 DCBEDSENCRYPTOK BIT(1),   /* DSENCRYPT=OK               @05A*/00033210
*       5 DCBE_HYPERWRITE BIT(1),   /* HYPERWRITE=YES             @04A*/00033300
*       5 DCBETrackLock   BIT(1),   /* CONCURRENTRW=(YES,TRKLOCK) @L9A*/00033400
*                                   /* specified. This means the  @L9A*/00033500
*                                   /* application can tolerate   @L9A*/00033600
*                                   /* inconsistent read data due @L9A*/00033700
*                                   /* to concurrent writes to    @L9A*/00033800
*                                   /* other tracks.              @L9A*/00033900
*                                   /* DCBETrackLock has an       @L9A*/00034000
*                                   /* effect only when the       @L9A*/00034100
*                                   /* device is defined read-    @L9A*/00034200
*                                   /* only.                      @L9A*/00034300
*    3  *         CHAR(2),          /* Reserved.                  @L9C*/00034400
*    3  DCBEBLKSI8 CHAR(8) BDY(WORD), /* Block size in 8 bytes   @L2A*/ 00034500
*       5 *       CHAR(4),          /* Block size hi-order word   @L2A*/00034600
*       5 DCBEBLKSI  FIXED(31),     /* Block size.  Valid only if       00034700
*                                       OPEN set DCBESLBI         @L2A*/00034800
*    3  DCBEXSIZ  CHAR(8) BDY(WORD),/* Number of blocks in current      00034900
*                                      data set. Set by system when     00035000
*                                      DCBEGSIZ is set.          @L1A*/ 00035100
*       5 DCBESIZ0 FIXED(31),       /* High order word of DCBEXSIZ.     00035200
*                                                                @L1C*/ 00035300
*       5 DCBESIZE FIXED(31),       /* Number of blocks in current      00035400
*                                      data set. Set by system when     00035500
*                                      DCBEGSIZ is set.              */ 00035600
*    3  DCBEEODA  PTR(31),          /* Address of user provided end-    00035700
*                                      of-data routine. May reside      00035800
*                                      above or below the line. Used    00035900
*                                      instead of DCBEODAD. Will be     00036000
*                                      zero if no address is given.  */ 00036100
*    3  DCBESYNA  PTR(31),          /* Address of user provided SYNAD   00036200
*                                      routine. May reside above or     00036300
*                                      below the line. Used instead of  00036400
*                                      DCBSYNAD. Will be zero if        00036500
*                                      no address is given.          */ 00036600
*    3  DCBE_PDSEEXT PTR(31),       /* Address of PDSE DCBE             00036700
*                                      extension                 @PUA*/ 00036800
*    3  DCBENMFL  FIXED(16),        /* Num tape files before sync@MAA*/ 00036900
*    3  DCBEMACC  FIXED(8),         /* Accumulation number multiplier*/ 00037000
*    3  DCBEMSDN  FIXED(8),         /* Multiplier of System determined  00037100
*                                      NCP.                          */ 00037200
*] End of DCBE Version 0                                           @L8A 00037300
*%IF DCBE_VERSION = '0' %THEN       ] If Version 0, then done      @L8A 00037400
*    %GOTO DCBEEND;                                              ] @L8A 00037500
*    3 DCBEFLG4 BIT(8),             /* Flags set by user          @L8A*/00037600
*      5 DCBE_BYPASS_AUTH BIT(1),   /* BYPASS_AUTH=YES. Bypass authority00037700
*                                      checking.                  @L8A*/00037800
*    3 *        CHAR(23),           /* Reserved.                  @L8A*/00037900
*] End of DCBE Version 1                                           @L8A 00038000
*%DCBEEND:;                                                      ] @L8A 00038100
*    3  DCBEEND   CHAR(0);          /* Current end of DCBE.          */ 00038200
*                                                                       00038300
*/* Constants for DCBE.                                           @L3A*/00038400
*                                                                       00038500
*/* Constants for DCBESYNC.  Other values are reserved for other  @L3A  00038600
*   types of synchronization.  000 means not coded.               @L3A*/00038700
 DECLARE                                                        /*@L3A*/00038800
    (DCBESYNC_SYSTEM CONSTANT('001'B), /*SYNC=SYSTEM              @L3A*/00038900
     DCBESYNC_NONE   CONSTANT('111'B)) /*SYNC=NONE                @L3A*/00039000
         BIT(3);                                                        00039100
 DECLARE                                                         ] @L8A 00039200
   DCBELENV0 CONSTANT(56),          ]Length of DCBE Version 0      @L8A 00039300
   DCBELENV1 CONSTANT(80);          ]Length of DCBE Version 1      @L8A 00039400
