*         %GOTO  DSABPLS1;             /*                               00010000
          MACRO                                                         00020000
          IHADSAB                                                       00030000
* */                                                                    00040000
* %DSABPLS1:  ;                                                         00050000
*/* START OF SPECIFICATIONS ******************************************/ 00060000
*/*                                                                  */ 00070000
*/*01* MACRO-NAME: IHADSAB                                       @L7C*/ 00080000
*/*                                                                  */ 00090000
*/*01* ACRONYM: DSAB                                             @L7C*/ 00100000
*/*                                                                  */ 00110000
*/*01* DESCRIPTIVE-NAME: DATA SET ASSOCIATION BLOCK              @L7C*/ 00120000
*/*                                                                  */ 00130000
*/*01* PROPRIETARY STATEMENT=                                        */ 00140000
*/***PROPRIETARY_STATEMENT********************************************/ 00150000
*/*                                                                  */ 00160000
*/*                                                                  */ 00170000
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00180000
*/* 5650-ZOS COPYRIGHT IBM CORP. 1977, 2015                          */ 00190004
*/*                                                                  */ 00200000
*/* STATUS= HBB77A0                                                  */ 00210004
*/*                                                                  */ 00220000
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 00230000
*/*                                                                  */ 00240000
*/*01* FUNCTION: THE DATA SET ASSOCIATION BLOCK, DSAB, AND ITS       */ 00250000
*/*            CORRESPONDING TIOT DD ENTRY CONTAIN INFORMATION       */ 00260000
*/*            WHICH SERVE AS AN INTERFACE BETWEEN ALLOCATION        */ 00270000
*/*            (BOTH STEP AND DYNAMIC) AND OTHER SYSTEM              */ 00280000
*/*            COMPONENTS.  DSABS ARE ELEMENTS OF A NON-             */ 00290000
*/*            CONTIGUOUS, DOUBLE-THREADED CHAIN. THE TIOT           */ 00300000
*/*            ENTRY IS ADDRESSED FROM THE DSAB FIELD DSABTIOT.  @L7C*/ 00310000
*/*                                                                  */ 00320000
*/*            The GETDSAB executable macro can be used to       @P3A*/ 00330000
*/*            obtain the DSAB addresses.                        @P3A*/ 00340000
*/*                                                                  */ 00350000
*/*01* EXTERNAL CLASSIFICATION:                                  @01A*/ 00360000
*/*02* DMTI: BASE                                                @01A*/ 00370000
*/*02* GUPI: FIELDS                                              @01A*/ 00380000
*/*          DSABSSNM                                            @01A*/ 00390000
*/*          DSABTIOT                                            @01A*/ 00400000
*/*01* END OF EXTERNAL CLASSIFICATION:                           @01A*/ 00410000
*/*                                                              @01A*/ 00420000
*/*                                                                  */ 00430000
*/*01* DEPENDENCIES: ANY CHANGES TO THIS MACRO SHOULD BE REFLECTED   */ 00440000
*/*                  IN THE IPCS MODEL IHAMDSAB.                 @L7C*/ 00450000
*/*                                                                  */ 00460000
*/*01* METHOD OF ACCESS:                                         @L7C*/ 00470000
*/*            ASM - IHADSAB                                     @P5C*/ 00480000
*/*                                                                  */ 00490000
*/*            PL/X - DCL DSABPTR PTR(31)                        @P5C*/ 00500000
*/*                   %INCLUDE SYSLIB(IHADSAB)                       */ 00510000
*/*                                                                  */ 00520000
*/*01* DSECT NAME : DSAB, DSABANMI                               @01C*/ 00530000
*/*                                                                  */ 00540000
*/*01* COMPONENT: Allocation (SC1B4)                             @LAC*/ 00550000
*/*                                                                  */ 00560000
*/*01* EYE-CATCHER: DSAB                                             */ 00570000
*/*02*   OFFSET: 0                                                   */ 00580000
*/*02*   LENGTH: 4                                                   */ 00590000
*/*                                                                  */ 00600000
*/*01* POINTED-TO-BY:                                                */ 00610000
*/*                                                                  */ 00620000
*/*        SIOTETIO in the IEFASIOT                                  */ 00630000
*/*                                                                  */ 00640000
*/*        JSCDSABQ -> Queue Descriptor Block(QDB)                   */ 00650000
*/*            (ie. QDB(QDBFELMP) -> first DSAB                      */ 00660000
*/*                 QDB(QDBLELMP) -> last DSAB, ...)                 */ 00670000
*/*                                                                  */ 00680000
*/*01* CREATED-BY:                                                   */ 00690000
*/*                                                                  */ 00700000
*/*02*   IEFAB428 - Build DSAB/TIOT Entry                            */ 00710000
*/*                                                                  */ 00720000
*/*01* DELETED-BY:                                                   */ 00730000
*/*                                                                  */ 00740000
*/*02*   IEFAB428 - Build DSAB/TIOT Entry                            */ 00750000
*/*                                                                  */ 00760000
*/*02*   IEFAB4FC - TIOT Manager Control Routine                     */ 00770000
*/*                                                                  */ 00780000
*/*01* SERIALIZATION: None                                           */ 00790000
*/*                                                                  */ 00800000
*/*01* STORAGE-ATTRIBUTES:                                           */ 00810000
*/*                                                                  */ 00820000
*/*02*   ALLOCATION-METHOD: CPOOL macro                              */ 00830000
*/*                                                                  */ 00840000
*/*02*   SUBPOOL/DATASPACE: SWA subpool                              */ 00850000
*/*                                                                  */ 00860000
*/*02*   KEY: 1                                                      */ 00870000
*/*                                                                  */ 00880000
*/*02*   RESIDENCY: Defaults to below, but is stored above if        */ 00890000
*/*                 requested via the S99DSABA bit in the SVC 99     */ 00900000
*/*                 parameter list.                                  */ 00910000
*/*                                                                  */ 00920000
*/*02*   SIZE: DSAB:  LENGTH(DSAB)                                   */ 00930000
*/*            DSABANMI: 1 + DSABANML                            @L8A*/ 00940000
*/*                                                                  */ 00950000
*/*01* FREQUENCY: 1 per data set requested for allocation            */ 00960000
*/*                                                                  */ 00970000
*/*01* NOTES: None                                                   */ 00980000
*/*                                                                  */ 00990000
*/*01* CHANGE-ACTIVITY: Y02670, ZD03010, OZ28413, L2,                */ 01000000
*/*                   G860P44,OZ60075, L3, D1, L4, P1, L5, T1        */ 01010000
*/*                   L6,L7                                      @L7C*/ 01020000
*/*  Flag LineItem FMID   DATE  ID  Comment                          */ 01030000
*/* $L2=ALLOCPER JBB1326 801001 PD2M: ALLOCATION PERFORMANCE     @L2C*/ 01040000
*/* $L3=ALLOCCAS JBB2125 840103 PDPB: ALLOC SUPPORT FOR CAS      @L3A*/ 01050000
*/* $D1=DCR93    JBB2220 850416 PD42: SMF DISABLED INTERFACE     @D1A*/ 01060000
*/* $L4=VLF      HBB3310 861216 PDPB: ALLOC SUPPORT FOR VLF      @L4A*/ 01070000
*/* $P1=PC42084  HBB3310 880127 PDN2: ADD JFCB CHANGE INDICATOR  @P1A*/ 01080000
*/* $L5=DCF      JBB31ZZ 890127 PDH4: DATASET CACHING            @L5A*/ 01090000
*/* $T1=OY26839  HBB3310 890831 PDE1: DD LIMIT SPE               @T1A*/ 01100000
*/* $L6=DYNAM    HBB4420 890918 PDN2: DYNAMIC I/O CONFIGURATION  @L6A*/ 01110000
*/* $L7=POSIX    HBB4430 911122 PDB6: Add hierarchical file          */ 01120000
*/*                                   indicator so that OPEN can     */ 01130000
*/*                                   determine whether the data set */ 01140000
*/*                                   is hierarchical            @L7A*/ 01150000
*/* $P2=PKB0300  HBB4430 920108 PDNM: Fix syntax in prolog       @P2A*/ 01160000
*/* $01=OW02917  HBB4420 940324 PDEV: Make DSABSSNM GUPI         @01A*/ 01170000
*/* $L8=UCBVP    HBB5520 940210 PDN1: Allocation support for         */ 01180000
*/*                                   UCBVS line item            @L8A*/ 01190000
*/* $02=OW03864  HBB4420 940426 PDG5: Define flag to indicate    @02A*/ 01200000
*/*                                   S99NORES (no dataset       @02A*/ 01210000
*/*                                   integrity) specified on    @02A*/ 01220000
*/*                                   dynamic allocation         @02A*/ 01230000
*/* $P3=PN70761  HBB5520 940728 PDEM: SHOWHDR updates            @P3A*/ 01240000
*/* $03=OW10686  JBB3313 951115 PDNN: Fixed DSABTCTL not large   @03A*/ 01250000
*/*                                   enough                     @03A*/ 01260000
*/* $L9=SIOTX    HBB7703 990831 PDOO: SIOT Extension Support     @L9A*/ 01270000
*/* $P4=PXD1020  HBB7703 000201 PDFD: Fix copyright              @P4A*/ 01280000
*/* $LA=ODSLM    HBB7705 001031 PDOO: Open Dataset Limit Relief  @LAA*/ 01290000
*/* $P5=ME13467  HBB7760 080530 PDQV: Check for DME before doing     */ 01300000
*/*                                   a DSAM_Delete.             @P5A*/ 01310000
*/* $P6=ME12270  HBB7760 080620 PDQV: Remove JOBCAT/STEPCAT      @P6A*/ 01320000
*/* $P7=ME13334  HBB7760 081231 PDTY: Misc Checker Failures      @P7A*/ 01330000
*/* $LB=ALLOPERF HBB7770 090831 PDQV: Allocation Performance:        */ 01340000
*/*                                   Smart Data Set Release     @LBA*/ 01350000
*/* $P8=ME17342  HBB7770 091011 PDHV: Skip rebuild for DSABs with    */ 01360000
*/*                                   DD Accounting suppressed   @P8A*/ 01370000
*/* $LC=SMSR13D  HBB7780 100331 PDHV: Support XTIOT/DSAB above       */ 01380000
*/*                                   for subsystem data sets    @LCA*/ 01390000
*/* $LD=ALC2MDS  HBB77A0 140430 PDHV: Alloc 2M open data sets        */ 01391005
*/*                                   Alloc with SYSZTIOT shared @LDA*/ 01392005
*/* $04=OA47824  HBB7780 150901 PDTA: Insulated Allocations      @04A*/ 01395005
*/*                                                                  */ 01400000
*/* A 000000-999999                                            Y02670*/ 01410000
*/*                                                                  */ 01420000
*/* END OF SPECIFICATIONS ********************************************/ 01430000
*/*  IHADSAB - A - Add DSABINSL flag.                            @04A*/ 01435000
*/*  IHADSAB - A - Add flags indicating if DSAB is on the BELOW or   */ 01440005
*/*                ANY queue.                                    @LDA*/ 01450005
*/*  IHADSAB - A - Add support for subsystem to pass back an         */ 01451005
*/*                indication of its support for XTIOTs, DSABs       */ 01452005
*/*                above the line and uncaptured (31-bit) UCBs.      */ 01460000
*/*                The flag will be copied to the DSAB and used by   */ 01470000
*/*                OPEN to ensure that subsystem DDs using the       */ 01480000
*/*                above functions are not opened unless they        */ 01490000
*/*                explicitly support them.                      @LCA*/ 01500000
*/*  IHADSAB - A - Added DSABDASP to indicate that DD Accounting     */ 01510000
*/*                has been suppressed by the SVC 99 invoker.        */ 01520000
*/*                No TCTIOT entry will exist for this DD.       @P8A*/ 01530000
*/*  IHADSAB - A - Added DSABBMAL to indicate that this DSAB can     */ 01540000
*/*                bypass multiple allocation checking in IEFDB4A1.  */ 01550000
*/*                                                              @LBA*/ 01560000
*/*  IHADSAB - C - Update copyright                              @P7A*/ 01570000
*/*  IHADSAB - C - Removed DSABJSCT because CATALOG no longer        */ 01580000
*/*                supports JOBCAT/STEPCAT as valid DD names.    @P6A*/ 01590000
*/*  IHADSAB - A - Added DSABDMED to indicate that this DSAB's DME   */ 01600000
*/*                has been deleted. It is turned ON whenever a DD   */ 01610000
*/*                is concatenated and turned OFF whenever it is     */ 01620000
*/*                deconcatenated.                               @P5A*/ 01630000
*/*  IHADSAB - A - Added 2 new forward and backward chain pointers   */ 01640000
*/*                (DSABFCHA and DSABBCHA) to contain addresses      */ 01650000
*/*                for DSABs above or below the 16MB line.  Added    */ 01660000
*/*                a new bit (DSABABOV) to indicate if the           */ 01670000
*/*                DSAB resides above the line.  Also updated        */ 01680000
*/*                the comments for the existing chain pointers      */ 01690000
*/*                (DSABFCHN and DSABBCHN) to indicate that they     */ 01700000
*/*                contain only below the line addresses.        @LAA*/ 01710000
*/*  IHADSAB - C - Fixed copyright/program number statements.    @P4A*/ 01720000
* /* IHADSAB - A - Defined two new fields:                           */ 01730000
* /*               DSABXSVA - SVA of the SIOT Extension              */ 01740000
* /*               DSABSIOX - Virtual Address of the SIOT            */ 01750000
* /*                          Extension                          @L9A*/ 01760000
* /* IHADSAB - A - Defined a new field, DSABTCT2, to show the        */ 01770000
* /*               offset of the corresponding look-up table entry   */ 01780000
* /*               from the beginning of the TCTIOT.  We will begin  */ 01790000
* /*               using this new 4-byte field when the first request*/ 01800000
* /*               requiring an XTIOT comes in.  From that point on  */ 01810000
* /*               DSABTCT2 will be used rather than DSABTCTL.   @03A*/ 01820000
* /*             - Added a new flag to the DSABFLG2 field (DSABATCT) */ 01830000
* /*               to indicate when DSABTCT2 must be used rather     */ 01840000
* /*               DSABTCTL.                                     @03A*/ 01850000
* /*             - Added 8 bytes to the end of the DSAB to make      */ 01860000
* /*               room for the new DSABTCT2 and allow a bit of      */ 01870000
* /*               extra space.                                  @03A*/ 01880000
*/* IHADSAB - C - Update prolog to document a GUPI way to access        01890000
*                 DSAB.                                          @P3A*/ 01900000
*/* IHADSAB - C - Define, in the flags restored by RESTART, a flag      01910000
*                 to indicate when S99NORES (no data set integrity      01920000
*                 requested) was specified on the dynamic allocation,   01930000
*                 to be valid only when DSABDALC is also set.           01940000
*                 Set by IEFDB413 and referenced by IEFDB4A1 when       01950000
*                 determining when to bypass data set integrity         01960000
*                 release on unallocation.                       @02A*/ 01970000
*/* IHADSAB - A - Added NOCAPTURE indicator DSABAUCB ("actual           01980000
*                 UCBs")                                         @L8A*/ 01990000
*/* IHADSAB - C - DSABSSNM is now a GUPI field.  This allows a          02000000
*                 program to determine the owning subsystem name        02010000
*                 for a data set.                                @01A*/ 02020000
*/* IHADSAB - C - Replaced asterisks and fixed end comment              02030000
*                 columns in prolog and change history           @P2A*/ 02040000
*/* IHADSAB - A - Added hierarchical file indicator DSABHIER     @L7A*/ 02050000
*/*               Also prolog has been updated                   @L7A*/ 02060000
*/* IHADSAB - A - Added DEPENDENCY note to change IPCS control block    02070000
*                 model when this mapping macro is changed       @L6A*/ 02080000
*/* IHADSAB - C - REMOVE REFERENCES TO GROUP IDS SINCE THEY MAY         02090000
*                 CHANGE BETWEEN ALLOCATION TO UNALLOCATION      @L6A*/ 02100000
*/* IHADSAB - A - XTIOT FLAG (DSABTIOX) AND LAST IN CONCATENATION    */ 02110000
*/*               INDICATOR (DSABLCAT)                           @T1A*/ 02120000
*/* IHADSAB - C - DEFINE DSABDEXT FOR DATASET CACHING            @L5A*/ 02130000
*/* IHADSAB - C - DEFINE DSABJCHG TO INDICATE THAT THE DSNAME    @P1A*/ 02140000
*/*               OR VOLSER HAS CHANGED IN THE JFCB              @P1A*/ 02150000
*/* IHADSAB - C - DEFINE DSABVLF FOR VIRTUAL LOOKASIDE FACILITY  @L4A*/ 02160000
*/* IHADSAB - C - ADD DSABTOKN FOR SMF DISABLED INTERFACE        @D1A*/ 02170000
*/* IHADSAB - C - DEFINE DSABCASL FOR CATALOG ADDRESS SPACE      @L3A*/ 02180000
*/* IHADSAB - C - DEFINE DSABVVDS FOR ICF CATALOG CONTROL    @ZA60075*/ 02190000
*/* IHADSAB - C - DEFINE DSABTCTL TO SHOW THE OFFSET OF THE CORRES-  */ 02200000
*/*               PONDING LOOK-UP TABLE ENTRY FROM THE BEGINNING OF  */ 02210000
*/*               THE TCTIOT                                 @G860P44*/ 02220000
*/* IHADSAB - C - DEFINE DSABGGID AND DSABGANM TO INDICATE THAT      */ 02230000
*/*               SEPARATE GETMAINS WERE DONE FOR DSABGIDL AND       */ 02240000
*/*               DSABANMI RESPECTIVELY                          @L2A*/ 02250000
*/* IHADSAB - C - MERGED BACK TO REL 3.7                     @ZA28413*/ 02260000
*/* C 031005, 064040                                         @ZD03010*/ 02270000
*        %GOTO DSABPLS2;              /*                                02280000
DSAB    DSECT                                                           02290000
         DS    0F                                                       02300000
DSABID   DS    CL4                     IN-CORE ID,CHARACTERS 'DSAB'     02310000
DSABFCHN DS    F                       NEXT BELOW THE LINE DSAB         02320000
*                                      POINTER, 0 IF LAST, OR IF        02330000
*                                      DSAB RESIDES ABOVE THE 16MB      02340000
*                                      LINE                        @LAC 02350000
DSABBCHN DS    F                       PREVIOUS BELOW THE LINE DSAB     02360000
*                                      POINTER, 0 IF FIRST, OR IF       02370000
*                                      DSAB RESIDES ABOVE THE 16MB      02380000
*                                      LINE                        @LAC 02390000
DSABLNTH DS    H                       LENGTH OF DSAB                   02400000
DSABOPCT DS    H                       OPEN DCB COUNT FOR TIOT DD ENTRY 02410000
DSABTIOT DS    F                       TIOT DD ENTRY PTR                02420000
DSABRS01 DS    C                       RESERVED                         02430000
DSABSSVA DS    CL3                     SWA VIRTUAL ADDRESS OF SIOT      02440000
DSABRS02 DS    C                       RESERVED                    @L9A 02450000
DSABXSVA DS    CL3                     SVA of XSIOT                @L9C 02460000
DSABANMP DS    F                       &NAME OR GDG-ALL DSNAME PTR,     02470000
*                                      0 IF NONE                        02480000
DSABORG  DS    0CL2                    DATA SET  ORGANIZATION           02490000
DSABORG1 DS    B                       1ST BYTE OF DSORG FLAGS          02500000
DSABIS   EQU   X'80'                   INDEXED SEQUENTIAL ORGANIZATION  02510000
DSABPS   EQU   X'40'                   PHYSICAL SEQUENTIAL ORGANIZATION 02520000
DSABDA   EQU   X'20'                   DIRECT ACCESS ORGANIZATION       02530000
DSABCX   EQU   X'10'                   COMMUNICATIONS LINE GROUP        02540000
DSABCQ   EQU   X'08'                   DIRECT ACCESS MESSAGE QUEUE      02550000
DSABMQ   EQU   X'04'                   PROBLEM PROGRAM MESSAGE QUEUE    02560000
DSABPO   EQU   X'02'                   PARTITIONED ORGANIZATION         02570000
DSABU    EQU   X'01'                   UNMOVEABLE                       02580000
DSABORG2 DS    B                       2ND BYTE OF DSORG FLAGS          02590000
DSABGS   EQU   X'80'                   GRAPHICS ORGANIZATION            02600000
DSABTX   EQU   X'40'                   TCAM LINE GROUP                  02610000
DSABTQ   EQU   X'20'                   TCAM MESSAGE QUEUE               02620000
DSABAM   EQU   X'08'                   VSAM                             02630000
DSABTR   EQU   X'04'                   TCAM 3705                        02640000
DSABFLG1 DS    B                       FLAGS-RESTORED BY RESTART        02650000
DSABDALC EQU   X'80'                   DYNAMICALLY ALLOCATED            02660000
DSABPALC EQU   X'40'                   PERMANENTLY ALLOCATED ATTRIBUTE  02670000
DSABDCNV EQU   X'20'                   DYNAMICALLY CONVERTED            02680000
DSABCONV EQU   X'10'                   CONVERTIBLE ATTRIBUTE            02690000
DSABDCAT EQU   X'08'                   DYNAMICALLY CONCATENATED         02700000
DSABPCAT EQU   X'04'                   PERMANENTLY CONCATENATED         02710000
DSABCATM EQU   X'02'                   CONCATENATED GROUP MEMBER        02720000
DSABNUSE EQU   X'01'                   IN-USE ATTRIBUTE                 02730000
DSABFLG2 DS    B                       FLAGS-RESTORED BY RESTART        02740000
DSABOPEN EQU   X'80'                   DATA SET HAS BEEN OPENED         02750000
DSABIRM  EQU   X'40'                   D.S. REVERSED MERGED FOR INPUT   02760000
DSABUNAL EQU   X'20'                   UNALLOCATE WHEN CLOSED           02770000
DSABVLF  EQU   X'10'                   VIRTUAL LOOKASIDE FACILITY  @L4A 02780000
DSABJCHG EQU   X'08'                   DSNAME OR VOLSER CHANGED IN @P1A 02790000
*                                      THE JFCB                    @P1A 02800000
DSABNODI EQU   X'04'                   When = 1, no dataset        @02A 02810000
*                                      integrity specified on      @02A 02820000
*                                      dynamic allocation. Valid   @02A 02830000
*                                      only if DSABDALC also set   @02A 02840000
DSABATCT EQU   X'02'                   Use alternate TCTIOT offset      02850000
*                                      contained in DSABTCT2 rather     02860000
*                                      than DSABTCTL               @03A 02870000
DSABINSL EQU   X'01'                   Insulated DD                @04C 02875000
DSABFLG3 DS    B                       FLAGS-NOT RESTORED BY RESTART    02880000
DSABDEFR EQU   X'80'                   DEFERRED MOUNTING                02890000
DSABPASS EQU   X'40'                   PASS/RETAIN IND         @ZD03010 02900000
DSABVAM  EQU   X'20'                   VIO DATA SET                     02910000
DSABVMSC EQU   X'10'                   VIO PAGING SPACE RELEASED        02920000
DSABCATL EQU   X'08'                   DATA SET IS A CATALOG            02930000
*        EQU   X'04'                   Reserved, was DSABJSCT      @P6C 02940000
DSABVVDS EQU   X'02'                   VVDS - ICF CATALOG      @ZA60075 02950000
DSABTIOX EQU   X'01'                   DSAB HAS XTIOT ENTRY (FOR        02960000
*                                      SYSTEM PROGRAM USE ONLY)    @T1A 02970000
DSABFLG4 DS    B                       FLAGS-NOT RESTORED BY RESTART    02980000
DSABCKDS EQU   X'80'                   THIS IS A CHECKPT DATA SET       02990000
DSABCKVL EQU   X'40'                   VOLUME CONTAINING CHECKPT        03000000
*                                      DATA SET IS SECURE               03010000
DSABCKSI EQU   X'20'                   SECURITY INTERFACE EXISTS FOR    03020000
*                                      THE CHECKPT DATA SET             03030000
DSABHIER EQU   X'10'                   HIERARCHICAL FILE INDICATOR @L7A 03040000
DSABGANM EQU   X'08'                   ALTERNATE NAME SECTION      @L2A 03050000
*                                      GETMAINED                   @L2A 03060000
DSABLCAT EQU   X'04'                   LAST DATASET IN DD               03070000
*                                      CONCATENATION               @T1A 03080000
DSABAUCB EQU   X'02'                   Actual UCBs are to be used       03090000
*                                      for this request            @L8A 03100000
DSABCASL EQU   X'01'                   DSAB TO BE COPIED INTO      @L3A 03110000
*                                      CATALOG ADDRESS SPACE (CAS) @L3A 03120000
DSABDEXT DS    H                       INDEX TO DEXT TABLE         @L5C 03130000
DSABTCBP DS    F                       TCB UNDER WHICH SET IN-USE       03140000
DSABPTTR DS    F                       RELATIVE TTR OF DATA SET         03150000
*                                      PASSWORD                         03160000
DSABSSNM DS    CL4                     SUB-SYSTEM NAME                  03170000
DSABSSCM DS    F                       SUB-SYSTEM COMMUNICATION         03180000
*                                      AREA POINTER                     03190000
DSABDCBM DS    CL6                     BIT MAP OF DCB FIELDS            03200000
DSABTCTL DS    H                       Offset of lookup entry from      03210000
*                                      beginning of TCTIOT.  If         03220000
*                                      DSABATCT is on, use DSABTCT2     03230000
*                                      instead                     @03C 03240000
DSABSIOT DS    F                       SIOT IN-CORE ADDRESS             03250000
DSABTOKN DS    F                       DD TOKEN                    @D1C 03260000
DSABTCT2 DS    F                       Offset of lookup entry from      03270000
*                                      beginning of TCTIOT - always     03280000
*                                      valid                       @03A 03290000
DSABSIOX DS    A                       Virtual address of SIOTX    @L9C 03300000
DSABFCHA DS    F                       NEXT ABOVE OR BELOW THE LINE     03310000
*                                      DSAB POINTER, 0 IF LAST     @LAA 03320000
DSABBCHA DS    F                       PREVIOUS ABOVE OR BELOW THE LINE 03330000
*                                      DSAB POINTER, 0 IF FIRST    @LAA 03340000
DSABFLG5 DS    B                       GENERAL USE FLAGS           @LAA 03350000
DSABABOV EQU   X'80'                   DSAB RESIDES ABOVE THE           03360000
*                                      16MB LINE                   @LAA 03370000
DSABDMED EQU   X'40'                   INDICATES THIS DSAB'S DME HAS    03380000
*                                      BEEN DELETED                @P5A 03390000
DSABBMAL EQU   X'20'                   INDICATES THIS DSAB CAN BYPASS   03400000
*                                      MULTIPLE ALLOCATION CHECKING IN  03410000
*                                      IEFDB4A1                    @LBA 03420000
DSABDASP EQU  X'10'                    Indicates this DSAB had its      03430000
*                                      DD Accounting information        03440000
*                                      suppressed and does not have     03450000
*                                      a TCTIOT entry              @P8A 03460000
DSABSSXT EQU   X'08'                   Indicates this DSAB is a         03470000
*                                      subsys DD, where the subsystem   03480000
*                                      supports the DynAlloc functions  03490000
*                                      of XTIOT, DSAB above the line    03500000
*                                      and uncaptured UCB.  Set by      03510000
*                                      IEFAB427, used by OPEN      @LCA 03520000
DSABNBTL EQU   X'04'                   Indicates this DSAB is pointed   03521005
*                                      to by a SIOT but is not on the   03522005
*                                      DSABQDB BelowTheLine DSAB queue  03523005
*                                                                  @LDA 03524005
DSABNATL EQU   X'02'                   Indicates this DSAB is pointed   03525005
*                                      to by a SIOT but is not on the   03526005
*                                      DSABQDB "above and below the     03527005
*                                      line queue.                 @LDA 03528005
DSABRS03 DS    CL7                     RESERVED                    @LAA 03530000
DSABL    EQU   *-DSAB                  LENGTH OF DSECT                  03540000
DSABANMI DSECT                         ALTERNATE DSNAME INFORMATION     03550000
DSABANML DS    FL1                     LENGTH OF ALTERNATE DSNAME       03560000
DSABANAM DS    C                       ALTERNATE  DSNAME                03570000
DSABANL  EQU   *-DSABANMI              LENGTH OF DSECT                  03580000
*                                                                 4@L6D 03590000
         MEND  ,  */                                                    03600000
* %DSABPLS2:   ;                                                        03610000
*                                                                       03620000
* DCL                                                                   03630000
*   1 DSAB BASED(DSABPTR) BDY(WORD),                                    03640000
*     2 DSABID CHAR(4),                /*IN-CORE ID, CHARACTERS DSAB */ 03650000
*     2 DSABFCHN PTR(31),              /*NEXT below the line DSAB       03660000
*                                        pointer, 0 if last, or         03670000
*                                        if DSAB resides above the      03680000
*                                        16MB line               @LAC*/ 03690000
*     2 DSABBCHN PTR(31),              /*Previous below the line DSAB   03700000
*                                        pointer, 0 if first, or        03710000
*                                        if DSAB resides above the      03720000
*                                        16MB line               @LAC*/ 03730000
*     2 DSABLNTH FIXED(15),            /*LENGTH OF DSAB              */ 03740000
*     2 DSABOPCT FIXED(15),            /*OPEN DCB COUNT FOR DD ENTRY */ 03750000
*     2 DSABTIOT PTR(31),              /*TIOT DD ENTRY PTR           */ 03760000
*     2 DSABRS01 CHAR(1),              /*RESERVED                    */ 03770000
*     2 DSABSSVA PTR(24),              /*SWA VIRTUAL ADDRESS OF SIOT */ 03780000
*     2 DSABRS02 CHAR(1),              /*RESERVED                @L9A*/ 03790000
*     2 DSABXSVA PTR(24),              /*SVA of SIOT Extension          03800000
*                                        Set by: IEFDB413,              03810000
*                                                IEFDB414,              03820000
*                                                IEFAB428        @L9C*/ 03830000
*     2 DSABANMP PTR(31),              /*&NAME OR GDG-ALL DSNAME PTR,   03840000
*                                        0 IF NONE                   */ 03850000
*     2 DSABORG CHAR(2) BDY(HWORD),    /*DATA SET ORGANIZATION       */ 03860000
*       3 DSABORG1 CHAR(1),            /*FIRST DSORG BYTE            */ 03870000
*         4 DSABIS BIT(1),             /*INDEXED SEQUENTIAL ORGANIZ. */ 03880000
*         4 DSABPS BIT(1),             /*PHYSICAL SEQUENTIAL ORGANIZ.*/ 03890000
*         4 DSABDA BIT(1),             /*DIRECT ACCESS ORGANIZATION  */ 03900000
*         4 DSABCX BIT(1),             /*COMMUNICATIONS LINE GROUP   */ 03910000
*         4 DSABCQ BIT(1),             /*DIRECT ACCESS MESSAGE QUEUE */ 03920000
*         4 DSABMQ BIT(1),             /*TELECOMMUNIC. MSG. QUEUE    */ 03930000
*         4 DSABPO BIT(1),             /*PARTITIONED ORGANIZATION    */ 03940000
*         4 DSABU BIT(1),              /*UNMOVEABLE                  */ 03950000
*       3 DSABORG2 CHAR(1),            /*SECOND DSORG BYTE           */ 03960000
*         4 DSABGS BIT(1),             /*GRAPHICS ORGANIZATION       */ 03970000
*         4 DSABTX BIT(1),             /*TCAM LINE GROUP             */ 03980000
*         4 DSABTQ BIT(1),             /*TCAM MESSAGE QUEUE          */ 03990000
*         4 * BIT(1),                  /*RESERVED                    */ 04000000
*         4 DSABAM BIT(1),             /*VSAM                        */ 04010000
*         4 DSABTR BIT(1),             /*TCAM 3705                   */ 04020000
*         4 * BIT(2),                  /*RESERVED                    */ 04030000
*     2 DSABFLG1 CHAR(1),              /*FLAGS-RESTORED BY RESTART   */ 04040000
*       3 DSABDALC BIT(1),             /*DYNAMICALLY ALLOCATED       */ 04050000
*       3 DSABPALC BIT(1),             /*PERMANENTLY ALLOCATED          04060000
*                                        ATTRIBUTE                   */ 04070000
*       3 DSABDCNV BIT(1),             /*DYNAMICALLY CONVERTED       */ 04080000
*       3 DSABCONV BIT(1),             /*CONVERTIBLE ATTRIBUTE       */ 04090000
*       3 DSABDCAT BIT(1),             /*DYNAMICALLY CONCATENATED    */ 04100000
*       3 DSABPCAT BIT(1),             /*PERMANENTLY CONCATENATED       04110000
*                                        ATTRIBUTE                   */ 04120000
*       3 DSABCATM BIT(1),             /*CONCATENATED GROUP MEMBER   */ 04130000
*       3 DSABNUSE BIT(1),             /*IN-USE ATTRIBUTE            */ 04140000
*     2 DSABFLG2 CHAR(1),              /*FLAGS-RESTORED BY RESTART   */ 04150000
*       3 DSABOPEN BIT(1),             /*DATA SET HAS BEEN OPENED    */ 04160000
*       3 DSABIRM BIT(1),              /*D.S. REVERSE MERGE FOR INPUT*/ 04170000
*       3 DSABUNAL BIT(1),             /*UNALLOCATED WHEN CLOSED     */ 04180000
*       3 DSABVLF  BIT(1),             /*VIRTUAL LOOKASIDE FAC.  @L4A*/ 04190000
*       3 DSABJCHG BIT(1),             /*DSNAME OR VOLSER CHANGED IN    04200000
*                                        THE JFCB                @P1A*/ 04210000
*       3 DSABNODI BIT(1),             /*When = 1, no dataset integrity 04220000
*                                        was requested on the dynamic   04230000
*                                        allocation represented by this 04240000
*                                        DSAB (S99NORES was set). Valid 04250000
*                                        ONLY if DSABDALC is set @02A*/ 04260000
*       3 DSABATCT BIT(1),             /*Use alternate TCTIOT offset    04270000
*                                        contained in DSABTCT2 rather   04280000
*                                        than DSABTCTL           @03A*/ 04290000
*       3 DSABINSL BIT(1),             /*Insulated DD            @04C*/ 04304990
*     2 DSABFLG3 CHAR(1),              /*FLAG-NOT RESTORED BY RESTART*/ 04310000
*       3 DSABDEFR BIT(1),             /*DEFERRED MOUNTING           */ 04320000
*       3 DSABPASS BIT(1),             /*PASS/RETAIN IND     @ZD03010*/ 04330000
*       3 DSABVAM  BIT(1),             /*VIO DATA SET                */ 04340000
*       3 DSABVMSC BIT(1),             /*VIO PAGING SPACE RELEASED   */ 04350000
*       3 DSABCATL BIT(1),             /*DATA SET IS A CATALOG       */ 04360000
*       3 *        BIT(1),             /*Reserved, was DSABJSCT  @P6C*/ 04370000
*       3 DSABVVDS BIT(1),             /*VVDS - ICF CATALOG  @ZA60075*/ 04380000
*       3 DSABTIOX BIT(1),             /*DSAB HAS XTIOT ENTRY (FOR      04390000
*                                        SYSTEM PROGRAM USE ONLY)       04400000
*                                                                @T1A*/ 04410000
*     2 DSABFLG4 CHAR(1),              /*FLAG-NOT RESTORED BY RESTART*/ 04420000
*       3 DSABCKDS BIT(1),             /*THIS IS A CHECKPT DATA SET  */ 04430000
*       3 DSABCKVL BIT(1),             /*VOLUME CONTAINING CHECKPT      04440000
*                                        DATA SET IS SECURE          */ 04450000
*       3 DSABCKSI BIT(1),             /*SECURITY INTERFACE EXISTS      04460000
*                                        FOR THE CHECKPT DATA SET    */ 04470000
*       3 DSABHIER BIT(1),             /*Hierarchical file indicator    04480000
*                                                                @L7C*/ 04490000
*       3 DSABGANM BIT(1),             /*ALTERNATE NAME SECTION         04500000
*                                        GETMAINED               @L2A*/ 04510000
*       3 DSABLCAT BIT(1),             /*LAST DATASET IN                04520000
*                                        CONCATENATION           @T1A*/ 04530000
*       3 DSABAUCB BIT(1),             /*Actual UCBs are to be used     04540000
*                                        for this request        @L8A*/ 04550000
*       3 DSABCASL BIT(1),             /*DSAB TO BE COPIED INTO (CAS)   04560000
*                                        CATALOG ADDRESS SPACE   @L3A*/ 04570000
*     2 DSABDEXT FIXED(16),            /*INDEX TO DEXT TABLE     @L5C*/ 04580000
*     2 DSABTCBP PTR(31),              /*TCB UNDER WHICH SET IN-USE  */ 04590000
*     2 DSABPTTR FIXED(31),            /*RELATIVE TTR OF DATA SET       04600000
*                                        PASSWORD                    */ 04610000
*     2 DSABSSNM CHAR(4),              /*SUB-SYSTEM NAME             */ 04620000
*     2 DSABSSCM PTR(31),              /*SUB-SYSTEM COMMUNICATION       04630000
*                                        AREA POINTER                */ 04640000
*     2 DSABDCBM CHAR(6),              /*BIT MAP OF DCB FIELDS       */ 04650000
*     2 DSABTCTL FIXED(16),            /*Offset of lookup entry from    04660000
*                                        beginning of TCTIOT.  If       04670000
*                                        DSABATCT is on, use DSABTCT2   04680000
*                                        instead                 @03C*/ 04690000
*     2 DSABSIOT PTR(31),              /*IN-CORE ADDRESS OF SIOT     */ 04700000
*     2 DSABTOKN FIXED(31),            /*DD TOKEN                @03C*/ 04710000
*     2 DSABTCT2 FIXED(31),            /*Offset of lookup entry from    04720000
*                                        beginning of TCTIOT - always   04730000
*                                        valid                   @03A*/ 04740000
*     2 DSABSIOX PTR(31),              /*Virtual Address of SIOTX       04750000
*                                        Set by:  IEFDB413,             04760000
*                                                 IEFAB3FE,             04770000
*                                                 IEFDB418,             04780000
*                                                 IEFDB402       @LAC*/ 04790000
*     2 DSABFCHA PTR(31),              /*Next above or below the        04800000
*                                        line DSAB, 0 if last    @LAA*/ 04810000
*     2 DSABBCHA PTR(31),              /*Previous above or below the    04820000
*                                        line DSAB, 0 if first   @LAA*/ 04830000
*     2 DSABFLG5 CHAR(1),              /*General use flags       @LAA*/ 04831005
*       3 DSABABOV BIT(1),            /*DSAB resides above the 16MB     04850000
*                                       line                     @LAA*/ 04860000
*       3 DSABDMED BIT(1),            /*Indicates this DSAB's DME has   04870000
*                                       been deleted.            @P5A*/ 04880000
*       3 DSABBMAL BIT(1),            /*Indicates this DSAB can bypass  04890000
*                                       multiple allocation  checking   04900000
*                                       in IEFDB4A1.             @LBA*/ 04910000
*       3 DSABDASP BIT(1),            /*Indicates this DSAB had its     04920000
*                                       DD Accounting information       04930000
*                                       suppressed and does not have    04940000
*                                       a TCTIOT entry           @P8A*/ 04950000
*       3 DSABSSXT BIT(1),            /*Indicates this DSAB is a        04960000
*                                       subsys DD, where the subsystem  04970000
*                                       supports the DynAlloc functions 04980000
*                                       of XTIOT, DSAB above the line   04990000
*                                       and uncaptured UCB.  Set by     05000000
*                                       IEFAB427, used by OPEN   @LCA*/ 05010000
*       3 DSABNBTL bit(1),            /*Indicates this DSAB is pointed  05011005
*                                       to by a SIOT but is not on the  05012002
*                                       DSABQDB BelowTheLine DSAB queue 05013002
*                                                                @LDA*/ 05014005
*       3 DSABNATL bit(1),            /*Indicates this DSAB is pointed  05015005
*                                       to by a SIOT but is not on the  05016002
*                                       DSABQDB "above and below the    05017003
*                                       line queue.              @LDA*/ 05018005
*       3 *        BIT(1),            /*reserved                 @LDC*/ 05018105
*     2 DSABRS03 CHAR(7);             /*reserved                 @LAA*/ 05019005
* DCL                                                                   05040000
*   1 DSABANMI BASED(DSABANMP),        /*ALTERNATE DSNAME INFORMATION*/ 05050000
*     2 DSABANML PTR(8),               /*LENGTH OF ALTERNATE DSNAME  */ 05060000
*     2 DSABANAM CHAR(*);              /*ALTERNATE DSNAME            */ 05070000
*/*                                                             3@L6D*/ 05080000
