*%       GOTO EPIEPLS1;  /*                                             00010000
         MACRO                                                          00020000
         IHAEPIE                                                        00030000
.*A000000-999999                                               @G860PPY 00040000
*                                                                    */ 00050000
*%EPIEPLS1 : ;                                                          00060000
*/** START OF SPECIFICATIONS *****************************************/ 00070000
*/*                                                                  */ 00080000
*/* PROPRIETARY STATEMENT:                                           */ 00090000
*/* 5650-ZOS                                                         */ 00100000
*/* COPYRIGHT IBM CORP. 2002,2021                                    */ 00110000
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00120000
*/*                                                                  */ 00130000
*/* STATUS = HBB77D0                                                 */ 00140000
*/*                                                                  */ 00150000
*/* EXTERNAL CLASSIFICATION: PI                                      */ 00160000
*/* END OF EXTERNAL CLASSIFICATION:                                  */ 00170000
*/*                                                                  */ 00180000
*/* MACRO NAME:  IHAEPIE                                             */ 00190000
*/*                                                                  */ 00200000
*/* DESCRIPTIVE NAME:  Extended Program Interruption Element         */ 00210000
*/*                                                                  */ 00220000
*/* DSECT NAME: EPIE                                                 */ 00230000
*/*                                                                  */ 00240000
*/* COMPONENT: Recovery Termination Manager (SCRTM)                  */ 00250000
*/*                                                                  */ 00260000
*/* EYE CATCHER: EPIE                                                */ 00270000
*/* OFFSET: X'0'                                                     */ 00280000
*/* LENGTH: 4                                                        */ 00290000
*/*                                                                  */ 00300000
*/* STORAGE ATTRIBUTES:                                              */ 00310000
*/*  SUBPOOL:  130 or 250                                            */ 00320000
*/*  KEY:  TCB Key                                                   */ 00330000
*/*                                                                  */ 00340000
*/* SIZE: 292 bytes                                              @L4C*/ 00350000
*/*                                                                  */ 00360000
*/* CREATED BY: IEAVTESP                                             */ 00370000
*/*                                                                  */ 00380000
*/* POINTED TO BY:                                                   */ 00390000
*/*     Register 1 upon entry to an ESPIE exit routine.  The EPIE    */ 00400000
*/*     can also be found via TCBPIE + 32 (The EPIE immediately      */ 00410000
*/*     follows the PIE in storage).                             @P2C*/ 00420000
*/*                                                                  */ 00430000
*/* SERIALIZATION: Task Active                                       */ 00440000
*/*                                                                  */ 00450000
*/* FUNCTION:                                                        */ 00460000
*/*     The EPIE is used to pass program interruption information    */ 00470000
*/*     to an ESPIE exit routine.                                    */ 00480000
*/*                                                                  */ 00490000
*/* METHOD OF ACCESS:                                                */ 00500000
*/* ASM:                                                             */ 00510000
*/*            IHAEPIE                                               */ 00520000
*/*                                                                  */ 00530000
*/* PLS:                                                             */ 00540000
*/*           DCL EPIEPTR PTR                                        */ 00550000
*/*           %INCLUDE SYSLIB(IHAEPIE)                               */ 00560000
*/*                                                                  */ 00570000
*/*                                                                  */ 00580000
*/* CHANGE ACTIVITY:                                                 */ 00590000
*/*     $01 = OY21512  HBB3310 890401 PDCK: PASS ARS                 */ 00600000
*/*     $02 = OY36454  HBB4410 901015 PDCK: ESPIE RETRY MODE         */ 00610000
*/*     $P1 = PIG2274  HBB5510 930806 PDKD: SHOWHDR                  */ 00620000
*/*$P2=PN70102  HBB5520 940106 PD16KD: Update 'POINTED TO BY'    @P2A*/ 00630000
*/*$P3=PN70279  HBB5520 940307 PDKD: Provide more field granularity  */ 00640000
*/*                                  no version change needed    @P3A*/ 00650000
*/*$P4=PR20011  HBB6601 950908 PDKD: SC1CM compid split          @P4A*/ 00660000
*/*$L1=IEEERTM  HBB6606 970807 PDXB: DXC                             */ 00670000
*/*$P5=PVT0427  HBB6606 980112 PDXB: EPIEIRSV                        */ 00680000
*/*$L2=64BITRTM HBB7703 971101 PDXB: 64-bit GPRs                     */ 00690000
*/*$P6=PYN0153  HBB7708 011231 PDKD: Updated POINTED TO BY to        */ 00700000
*/*                                  reflect removal of the SCA      */ 00710000
*/*$P7=ME02056  HBB7720 041008 PDKD: Update length info              */ 00720000
*/*$L3=ME05227  HBB7730 060303 PDKD: Resume key support              */ 00730000
*/*$L4=ME05227  HBB7730 060303 PDKD: Provide the BEA                 */ 00731000
*/*$03=OA17720  HBB7730 060810 PDXB: Fix reserved field length       */ 00732000
*/*$L5=RTMR12   HBB7770 090505 PDKD: LI1648 ESPIE percolation to RTM */ 00733000
*/*$P8=ME16318  HBB7770 090605 PDKD: (related to LI1648) Allow an    */ 00734000
*/*                                  ESPIE exit to request that it   */ 00735000
*/*                                  be reset both for resume/retry  */ 00736000
*/*                                  and percolation                 */ 00737000
*/*$L6=RMODE64  HBB7780 091101 PDXB: RMODE 64                        */ 00738000
*/*$L7=TX       HBB7790 110315 PDXB: TX                              */ 00739000
*/*$L8=TX       HBB77A0 141201 PDXB: TX                              */ 00740000
*/*$04=OA51375  HBB7790 160930 PDXB: EPIERSET behavior               */ 00740100
*/*$L9=W348144  HBB77D0 190615 PDXB: EpieRM64                        */ 00740200
*/*                                                                  */ 00741000
*/*** END OF SPECIFICATIONS ******************************************/ 00742000
*%       GOTO EPIEPLS;  /*                                              00743000
EPIE     DSECT                                                          00744000
EPIEEPIE DS    CL4                 EPIE CONTROL BLOCK IDENTIFIER       *00745000
                                   IN EBCDIC                            00746000
EPIEPARM DS    A                   PARAMETER LIST ADDRESS SPECIFIED    *00747000
                                   BY PARAM OPTION OF ESPIE MACRO       00748000
EPIEGPR  DS    0CL64               General purpose registers at time   *00749000
                                   of interruption. When EPIEPITX is   *00750000
                                   on, these are the registers that    *00760000
                                   resulted from the transaction abort *00770000
                                   due to the program interrupt    @L7C 00780000
EPIETX_ABORT_GPR DS 0CL64          Same as EPIEGPR                 @L8A 00790000
EPIEGPRA DS    0CL64               Same as EPIEGPR                 @L7A 00800000
EPIETX_ABORT_GPRA DS 0CL64         Same as EPIEGPR                 @L8A 00810000
EPIEGR00 DS    F -                 Register 0                      @P3A 00820000
EPIEGR01 DS    F -                 Register 1                      @P3A 00830000
EPIEGR02 DS    F -                 Register 2                      @P3A 00840000
EPIEGR03 DS    F -                 Register 3                      @P3A 00850000
EPIEGR04 DS    F -                 Register 4                      @P3A 00860000
EPIEGR05 DS    F -                 Register 5                      @P3A 00870000
EPIEGR06 DS    F -                 Register 6                      @P3A 00880000
EPIEGR07 DS    F -                 Register 7                      @P3A 00890000
EPIEGR08 DS    F -                 Register 8                      @P3A 00900000
EPIEGR09 DS    F -                 Register 9                      @P3A 00910000
EPIEGR10 DS    F -                 Register 10                     @P3A 00920000
EPIEGR11 DS    F -                 Register 11                     @P3A 00930000
EPIEGR12 DS    F -                 Register 12                     @P3A 00940000
EPIEGR13 DS    F -                 Register 13                     @P3A 00950000
EPIEGR14 DS    F -                 Register 14                     @P3A 00960000
EPIEGR15 DS    F -                 Register 15                     @P3A 00970000
EPIEPSW  DS    0CL8                EC MODE PROGRAM OLD PSW              00980000
*                                  When EPIEPITX is                     00990000
*                                  on, this is the PSW that             01000000
*                                  resulted from the transaction abort  01001000
*                                  due to the program interrupt    @L7C 01002000
EPIETX_ABORT_PSW DS 0CL8           Same as EPIEPSW                 @L8A 01003000
EPIEEMK1 DS    B                   Interrupt information masks     @P3A 01004000
EPIEMWP1 DS    B                   PSW key and 'M-W-P'             @P3A 01005000
EPIECCPM DS    B                   Condition code and program mask @P3A 01006000
         DS    B                   Reserved                        @P3A 01007000
EPIENXT1 DS    0F                  Address of the next instruction      01008000
*                                  to be executed                  @P3A 01009000
EPIEAMF1 DS    B                   Addressing mode flag            @P3A 01010000
EPIEMOD1 EQU   X'80'               Addressing mode of the next          01020000
*                                  instruction to be executed      @P3A 01030000
EPIEADD1 DS    CL3                 24 bit instruction address      @P3A 01040000
EPIEINT  DS    0CL4                Program interruption information     01050000
*                                  for EPIEPSW                     @P3C 01060000
EPIEIRSV DS    CL1                 Reserved                        @P5C 01070000
EPIEILC1 DS    B                   Instruction Length Code byte         01080000
*                                  (indicates the number of bytes in    01090000
*                                  the failing instruction)        @P3A 01100000
EPIEIL1  EQU   X'06'               Instruction Length Code Mask         01110000
*                                  (can be used to access the number    01120000
*                                  of halfwords in the failing          01130000
*                                  instruction)                    @P3A 01140000
EPIEINC1 DS    0CL2                Interrupt Code bytes            @P3A 01150000
EPIEICD0 DS    B                   PIC high byte                   @L7C 01160000
EPIEICD1 DS    B                   Program Interrupt Code          @P3A 01170000
EPIETEA  DS    A                   TRANSLATION EXCEPTION ADDRESS IF    *01180000
                                   EPIEINT FIELD CONTAINS A PAGE FAULT *01190000
                                   INTERRUPT CODE                       01200000
         ORG   EPIETEA                                             @L1A 01210000
         DS    XL3                                                 @L1A 01220000
EPIEDXC  DS    X                   Data exception code if EPIEINC1     *01230000
                                   indicates program interrupt 7   @L1A 01240000
EPIEAR   DS    0CL64               ACCESS REGISTERS AT TIME            *01250000
                                   OF INTERRUPTION                 @P3C 01260000
EPIEAR00 DS    F -                 Access Register 0               @P3A 01270000
EPIEAR01 DS    F -                 Access Register 1               @P3A 01280000
EPIEAR02 DS    F -                 Access Register 2               @P3A 01290000
EPIEAR03 DS    F -                 Access Register 3               @P3A 01300000
EPIEAR04 DS    F -                 Access Register 4               @P3A 01310000
EPIEAR05 DS    F -                 Access Register 5               @P3A 01320000
EPIEAR06 DS    F -                 Access Register 6               @P3A 01330000
EPIEAR07 DS    F -                 Access Register 7               @P3A 01340000
EPIEAR08 DS    F -                 Access Register 8               @P3A 01350000
EPIEAR09 DS    F -                 Access Register 9               @P3A 01360000
EPIEAR10 DS    F -                 Access Register 10              @P3A 01370000
EPIEAR11 DS    F -                 Access Register 11              @P3A 01380000
EPIEAR12 DS    F -                 Access Register 12              @P3A 01390000
EPIEAR13 DS    F -                 Access Register 13              @P3A 01400000
EPIEAR14 DS    F -                 Access Register 14              @P3A 01410000
EPIEAR15 DS    F -                 Access Register 15              @P3A 01420000
EPIEVERS DS    XL1                 EPIE VERSION INDICATOR          @02A 01430000
EPIEV1   EQU   1                   VERSION 1 INDICATOR             @02A 01440000
EPIEV2   EQU   2                   VERSION 2 INDICATOR             @L2A 01450000
EPIEV3   EQU   3                   VERSION 3 INDICATOR             @L4A 01460000
EPIEV4   EQU   4                   VERSION 4 INDICATOR             @L7A 01470000
EPIEFLGS DS    XL1                 EPIE FLAGS                      @02A 01480000
EPIERCTL EQU   X'80'               RETRY MODE FROM AN EXIT ROUTINE IS  *01490000
                                   CONTROLLED BY THE CORRESPONDING     *01500000
                                   BIT SETTINGS IN THE EPIEPSW FOR THE *01510000
                                   FOLLOWING CONDITION(S):             *01520000
                                   . BIT(17) - PRIMARY(0) VS AR(1) ASC *01530000
                                               MODES                   *01540000
                                   NOTE: ALL RESERVED BITS IN THE PSW  *01550000
                                         MUST REMAIN ZERO IN THE       *01560000
                                         EPIEPSW                   @02A 01570000
EPIEUP64 EQU   X'40'               If on, use the values in EPIEG64 to *01580000
                                   update the registers, rather than   *01590000
                                   those in EPIEGPR                @L2A 01600000
EPIEUKEY EQU   X'20'               If on, resume using the PSW key in  *01610000
                                   EPIEPSW instead of the one from     *01620000
                                   the time that the ESPIE exit was    *01630000
                                   established (if the requested key   *01640000
                                   is allowed by the PKM)          @L3A 01641000
EPIEPERC EQU   X'10'               An ESPIE exit may set this bit to   *01642000
                                   request that a program exception    *01643000
                                   be 'percolated' to RTM instead of   *01644000
                                   a resume taking place.  When this   *01645000
                                   function is requested, the ESPIE    *01646000
                                   exit must not alter the register    *01647000
                                   and AR contents in the EPIE.        *01648000
                                   Note that percolation to RTM        *01649000
                                   does NOT cause the ESPIE exit to    *01649100
                                   be deactivated.                 @L5A 01649200
EPIERSET EQU   X'08'               Set this bit to request an ESPIE    *01649300
                                   RESET while the system honors your  *01649400
                                   request to resume or to percolate   *01649500
                                   to RTM.  This mechanism should be   *01649600
                                   used instead of issuing ESPIE RESET *01649700
                                   from the ESPIE exit.                *01649800
                                   To RESET to a previous SPIE/ESPIE   *01649900
                                   exit, set this bit and place its    *01650000
                                   token in EPIERTOK before returning  *01651000
                                   to the system.                  @P8A 01652000
*                                  When specified with EPIEPERC, the   *01652100
                                   time of error PSWs in the SDWA      *01652200
                                   will show the program mask that     *01652300
                                   results from the reset, rather than *01652400
                                   the value at time of error      @04A 01652500
EPIERM64 EQU   X'04'               RMODE 64 retry. The system will use *01652600
                                   EPIEPS16 (not EPIEPSW)              *01652700
                                   for the retry information.          *01652800
                                   If the address >= 2G, AMODE 64 will *01652900
                                   be set. Otherwise, AMODE will be    *01653000
                                   determined from bits 31 and 32 of   *01653100
                                   EPIEPS16.                       @L9A 01653200
EPIEICX  DS    CL1                 Interrupt code extended info    @L7A 01653300
EPIEPITX EQU   X'02'                                               @L7A 01654000
         DS    CL1                 RESERVED                        @L7C 01655000
EPIERTOK DS    CL4                 Token to be used when EPIERSET has  *01656000
                                   been set.  This token was returned  *01657000
                                   when your program issued ESPIE SET  *01658000
                                   and is the same one that would be   *01659000
                                   specified when invoking ESPIE RESET.*01660000
                                   As with ESPIE RESET, a token value  *01660100
                                   of zero will cause all SPIE and     *01660200
                                   ESPIE exits to be deleted       @P8A 01660300
EPIEV0LEN EQU  *-EPIE              VERSION-0 LENGTH                     01660400
EPIEV1LEN EQU  *-EPIE              VERSION-1 LENGTH                     01660500
EPIEG64   DS   0CL128              64-bit GPRs at time of              *01660600
                                   interruption. When EPIEPITX is      *01660700
                                   of interruption. When EPIEPITX is   *01660800
                                   on, these are the registers that    *01660900
                                   resulted from the transaction abort *01661000
                                   due to the program interrupt    @L7C 01662000
EPIETX_ABORT_G64 DS 0CL128         Same as EPIEG64                 @L8A 01663000
EPIEG6400 DS   D -                 Register 0                      @L2A 01664000
EPIEG6401 DS   D -                 Register 1                      @L2A 01665000
EPIEG6402 DS   D -                 Register 2                      @L2A 01666000
EPIEG6403 DS   D -                 Register 3                      @L2A 01667000
EPIEG6404 DS   D -                 Register 4                      @L2A 01668000
EPIEG6405 DS   D -                 Register 5                      @L2A 01669000
EPIEG6406 DS   D -                 Register 6                      @L2A 01670000
EPIEG6407 DS   D -                 Register 7                      @L2A 01680000
EPIEG6408 DS   D -                 Register 8                      @L2A 01690000
EPIEG6409 DS   D -                 Register 9                      @L2A 01700000
EPIEG6410 DS   D -                 Register 10                     @L2A 01710000
EPIEG6411 DS   D -                 Register 11                     @L2A 01720000
EPIEG6412 DS   D -                 Register 12                     @L2A 01730000
EPIEG6413 DS   D -                 Register 13                     @L2A 01740000
EPIEG6414 DS   D -                 Register 14                     @L2A 01750000
EPIEG6415 DS   D -                 Register 15                     @L2A 01760000
EPIEV2LEN EQU  *-EPIE              VERSION-2 LENGTH                @L2A 01770000
EPIEBEA   DS   CL8                 Breaking Event Address          @L4A 01780000
EPIEPS16  DS  0CL16                16-byte error PSW.                   01790000
*                                  When EPIEPITX is                     01800000
*                                  on, this is the PSW that             01810000
*                                  resulted from the transaction abort  01820000
*                                  due to the program interrupt    @L7C 01830000
EPIETX_ABORT_PS16 DS CL16          Same as EPIEPS16                @L8A 01840000
          DS   CL8                 Reserved                        @L6C 01850000
EPIEV3LEN EQU  *-EPIE              VERSION-3 LENGTH                @L4A 01860000
          ORG  *-8                                                 @L7A 01861000
EPIETX_PITDB_PG64 DS 0CL128 When bit EPIEPITX is on, contains          *01862000
                              the 64-bit GRs at the time of the        *01862100
                              program interrupt (from the PITDB)   @L8A 01862200
EPIETXPG64 DS  CL128          Same as EPIETX_PITDB_PG64            @L7A 01862300
EPIETX_PITDB_PPSW16 DS 0CL16 When bit EPIEPITX is on, contains         *01862400
                              the 16-byte PSW at the time of the       *01862500
                              program interrupt (from the PITDB)   @L8A 01862600
EPIETXPPSW16 DS CL16          Same as EPIETX_PITDB_PPSW16          @L7A 01862700
          DS   CL8                 Reserved                        @L6C 01862800
EPIEV4LEN EQU  *-EPIE              VERSION-4 LENGTH                @L7A 01862900
EPIELEN  EQU   *-EPIE              CURRENT-VERSION LENGTH               01863000
         MEND  ,                                                     */ 01864000
*%EPIEPLS  :  ;                                                         01865000
*DECLARE                                                                01866000
*  1 EPIE BASED(EPIEPTR) BDY(DWORD),                                    01867000
*    3 EPIEEPIE CHAR(4),        /* EPIE CONTROL BLOCK IDENTIFIER        01868000
*                                  IN EBCDIC                         */ 01869000
*    3 EPIEPARM PTR(31),        /* PARAMETER LIST ADDRESS SPECIFIED     01870000
*                                  BY PARAM OPTION OF ESPIE MACRO    */ 01880000
*    3 EPIEGPRA,                /* GPR area                      @L7A*/ 01890000
*     4 EPIETX_ABORT_GPRA,      /* Same as EPIEGPRA              @L8A*/ 01900000
*      5 EPIEGPR(16) FIXED(31), /* General purpose registers at time    01910000
*                                  of interruption. When EPIEPITX is    01920000
*                                  on, these are the registers that     01930000
*                                  resulted from the transaction abort  01940000
*                                  due to the program interrupt  @L7C*/ 01950000
*      6 EPIETX_ABORT_GPR FIXED(31), /* Same as EPIEGPR          @L8A*/ 01960000
*    3 EPIEPSW CHAR(8) BDY(WORD),  /* EC mode Program Old PSW.          01970000
*                                  When EPIEPITX is                     01980000
*                                  on, this is the PSW that             01981000
*                                  resulted from the transaction abort  01982000
*                                  due to the program interrupt  @L7C*/ 01983000
*    4 EPIETX_ABORT_PSW CHAR(8) BDY(WORD), /* Same as EPIEPSW    @L8A*/ 01984000
*      5 EPIEEMK1 CHAR(1),      /* Interrupt information masks   @P3A*/ 01985000
*      5 EPIEMWP1 CHAR(1),      /* PSW key and 'M-W-P'           @P3A*/ 01986000
*      5 EPIECCPM CHAR(1),      /* Condition code and program mask      01987000
*                                                                @P3A*/ 01988000
*      5 *        CHAR(1),      /* Reserved                      @P3A*/ 01989000
*      5 EPIENXT1 PTR(31),      /* Address of the next instruction      01990000
*                                  to be executed                @P3A*/ 02000000
*        7 EPIEAMF1 CHAR(1),    /* Addressing mode flag byte     @P3A*/ 02010000
*          9 EPIEMOD1 BIT(1),   /* Addressing mode of the next          02020000
*                                  instruction to be executed    @P3A*/ 02030000
*        7 EPIEADD1 PTR(24),    /* 24 bit instruction address    @P3A*/ 02040000
*    3 EPIEINT CHAR(4),         /* Program interruption information     02050000
*                                  for EPIEPSW                   @P3C*/ 02060000
*      5 EPIEIRSV CHAR(1),      /* Reserved                      @P5C*/ 02070000
*      5 EPIEILC1  BIT(8),      /* Instruction length code byte         02080000
*                                  (indicates number of bytes in the    02090000
*                                  failing instruction)          @P3A*/ 02100000
*        7 *         BIT(5),    /* Reserved                      @P3A*/ 02110000
*        7 EPIEIL1   BIT(2),    /* Instruction length code              02120000
*                                  (indicates number of halfwords in    02130000
*                                  the failing instruction)      @P3A*/ 02140000
*        7 *         BIT(1),    /* Reserved                      @P3A*/ 02150000
*      5 EPIEINC1 CHAR(2),      /* Interrupt code bytes          @P3A*/ 02160000
*        7 EPIEICD0  BIT(8),    /* PIC high byte                 @L7C*/ 02170000
*        7 EPIEICD1  BIT(8),    /* Program Interrupt Code        @P3A*/ 02180000
*    3 EPIETEA PTR(31),         /* TRANSLATION EXCEPTION ADDRESS IF     02190000
*                                  EPIEINT FIELD CONTAINS A PAGE FAULT  02200000
*                                  INTERRUPT CODE                    */ 02210000
*      4 * CHAR(3),             /*                               @L1C*/ 02220000
*      4 EPIEDXC FIXED(8),      /* Data exception code if EPIEINC1      02230000
*                                  field indicates program interrupt    02240000
*                                  7                             @L1C*/ 02250000
*    3 EPIEAR(16) FIXED(31),    /* ACCESS REGISTERS AT TIME             02260000
*                                  OF INTERRUPTION               @01A*/ 02270000
*    3 EPIEVERS FIXED(8),       /* EPIE VERSION INDICATOR        @02A*/ 02280000
*    3 EPIEFLGS BIT(8),         /* EPIE FLAGS                    @02A*/ 02290000
*      5 EPIERCTL BIT(1),       /* RETRY MODE FROM AN EXIT ROUTINE IS   02300000
*                                  CONTROLLED BY THE CORRESPONDING      02310000
*                                  BIT SETTINGS IN THE EPIEPSW FOR THE  02320000
*                                  FOLLOWING CONDITION(S):              02330000
*                                  . BIT(17) - PRIMARY(0) VS AR(1) ASC  02340000
*                                              MODES                    02350000
*                                  NOTE: ALL RESERVED BITS IN THE PSW   02360000
*                                        MUST REMAIN ZERO IN THE        02370000
*                                        EPIEPSW                 @02A*/ 02380000
*      5 EPIEUP64 BIT(1),       /* If on, use the values in EPIEG64     02390000
*                                  to update the registers, rather      02400000
*                                  than those in EPIEGPR         @L2A*/ 02410000
*      5 EPIEUKEY BIT(1),       /* If on, resume using the PSW key in   02420000
*                                  EPIEPSW instead of the one from      02430000
*                                  the time that the ESPIE exit was     02440000
*                                  established (if the requested key    02450000
*                                  is allowed by the PKM)        @L3A*/ 02460000
*      5 EPIEPERC BIT(1),       /* An ESPIE exit may set this bit to    02461000
*                                  request that a program exception     02462000
*                                  be 'percolated' to RTM instead of    02463000
*                                  a resume taking place.  When this    02464000
*                                  function is requested, the ESPIE     02465000
*                                  exit must not alter the register     02466000
*                                  and AR contents in the EPIE.         02467000
*                                  Note that percolation to RTM         02468000
*                                  does NOT cause the ESPIE exit to     02469000
*                                  be deactivated.               @L5A*/ 02470000
*      5 EPIERSET BIT(1),      /*  Set this bit to request an ESPIE     02471000
*                                  RESET while the system honors your   02472000
*                                  request to resume or to percolate    02473000
*                                  to RTM.  This mechanism should be    02474000
*                                  used instead of issuing ESPIE RESET  02475000
*                                  from the ESPIE exit.                 02476000
*                                  To RESET to a previous SPIE/ESPIE    02477000
*                                  exit, set this bit and place its     02478000
*                                  token in EPIERTOK before returning   02479000
*                                  to the system.                       02480000
*                                  When specified with EPIEPERC, the    02480100
*                                  time of error PSWs in the SDWA       02480200
*                                  will show the program mask that      02480300
*                                  results from the reset, rather than  02480400
*                                  the value at time of error    @04A*/ 02480500
*      5 EPIERM64 BIT(1),       /* RMODE 64 retry. The system will use  02481000
*                                  EPIEPS16 (not EPIEPSW)               02481100
*                                  for the retry information.           02481200
*                                  If the address >= 2G, AMODE 64 will  02481300
*                                  be set. Otherwise, AMODE will be     02481400
*                                  determined from bits 31 and 32 of    02481500
*                                  EPIEPS16.                     @L9A*/ 02481600
*      5 *  BIT(2),             /* RESERVED                      @L9C*/ 02481700
*    3 EPIEICX CHAR(1),         /* Interrupt code extended info  @L7A*/ 02482000
*      5 * BIT(6),              /*                               @L7A*/ 02483000
*      5 EPIEPITX BIT(1),       /* RESERVED                      @L7A*/ 02484000
*      5 * BIT(1),              /*                               @L7A*/ 02485000
*    3 * CHAR(1),               /* RESERVED                      @L7A*/ 02486000
*    3 EPIERTOK CHAR(4),        /* Token to be used when EPIERSET has   02487000
*                                  been set.  This token was returned   02488000
*                                  when your program issued ESPIE SET   02489000
*                                  and is the same one that would be    02490000
*                                  specified when invoking ESPIE RESET. 02490100
*                                  As with ESPIE RESET, a token value   02490200
*                                  of zero will cause all SPIE and      02490300
*                                  ESPIE exits to be deleted     @P8A*/ 02490400
*    3 EPIEG64S CHAR(128) BDY(DWORD),  /* 64-bit GPRs at time of        02490500
*                                  interruption. When EPIEPITX is       02490600
*                                  on, these are the registers that     02490700
*                                  resulted from the transaction abort  02490800
*                                  due to the program interrupt  @L7C*/ 02490900
*     4 EPIETX_ABORT_G64S CHAR(128) BDY(DWORD), /* Same as EPIEG64S     02491000
*                                                                @L8A*/ 02492000
*      5 EPIEG64(16) CHAR(8) BDY(DWORD), /* 64-bit GPRs at time of      02493000
*                                  interruption                  @L2A*/ 02494000
*       6 EPIETX_ABORT_G64 CHAR(8) BDY(DWORD), /* Same as EPIEG64       02495000
*                                                                @L8A*/ 02496000
*    3 EPIEBEA  CHAR(8) BDY(DWORD),  /* Breaking Event Address   @L4A*/ 02497000
*    3 EPIEPS16 CHAR(16)        /* 16-byte error PSW. When EPIEPITX is  02498000
*                                  on, this is the PSW that             02499000
*                                  resulted from the transaction abort  02500000
*                                  due to the program interrupt  @L7C*/ 02510000
*     ,4 EPIETX_ABORT_PS16 CHAR(16) /* Same as EPIEPS16          @L8A*/ 02520000
*    ,3 EPIETX_PITDB_PG64 Char(128) Bdy(Dword) /*                       02521000
*                             When bit EPIEPITX is on, contains         02522000
*                             the 64-bit GRs at the time of the         02522100
*                             program interrupt (from the PITDB)        02522200
*                                                                @L8A*/ 02522300
*     ,4 EPIETXPG64 Char(128) Bdy(Dword) /* Same as                     02522400
*                             EPIETX_PITDB_PG64                  @L7A*/ 02522500
*    ,3 EPIETX_PITDB_PPSW16 Char(16) Bdy(Dword) /*                      02522600
*                             When bit EPIEPITX is on, contains         02522700
*                             the 16-byte PSW at the time of the        02522800
*                             program interrupt (from the PITDB)        02522900
*                                                                @L8A*/ 02523000
*     ,4 EPIETXPPSW16 Char(16) Bdy(Dword) /* Same as                    02523100
*                             EPIETX_PITDB_PPSW16                @L7A*/ 02523200
*    ,3 *       CHAR(8);        /* Reserved                      @L6A*/ 02523300
*  DECLARE                                                              02523400
*     EPIEV1 FIXED(8) CONSTANT(1);/* VERSION 1 INDICATOR         @02A*/ 02523500
*  DECLARE                                                              02523600
*     EPIEV2 FIXED(8) CONSTANT(2);/* VERSION 2 INDICATOR         @L2A*/ 02523700
*  DECLARE                                                              02523800
*     EPIEV3 FIXED(8) CONSTANT(3);/* VERSION 3 INDICATOR         @L4A*/ 02523900
*  DECLARE                                                              02524000
*     EPIEV4 FIXED(8) CONSTANT(4);/* VERSION 4 INDICATOR         @L7A*/ 02525000
