*        %GOTO PLSETD;   /*                                             00010000
         MACRO                                                          00020000
&NAME    IHAETD   &LIST=NO,&FORMAT=0                                    00030000
**/                                                                     00040000
*%PLSETD : ;                                                            00050000
*/****  START OF SPECIFICATIONS  *************************************/ 00060000
*/*                                                                  */ 00070000
*/*01*  MACRO NAME: IHAETD                                           */ 00080000
*/*                                                                  */ 00090000
*/*01*  DESCRIPTIVE-NAME:  Entry Table Description                   */ 00100000
*/*                                                                  */ 00110000
*/*01*  COPYRIGHT =                                                  */ 00120000
*/*      LICENSED MATERIALS - PROPERTY OF IBM                        */ 00130000
*/*      5650-ZOS COPYRIGHT IBM CORP. 1980, 2019                     */ 00140000
*/*                                                                  */ 00160000
*/*01*  STATUS =  HBB77C0                                            */ 00170000
*/*                                                                  */ 00180000
*/*01*  EXTERNAL CLASSIFICATION: PI                                  */ 00190000
*/*01*  END OF EXTERNAL CLASSIFICATION:                              */ 00200000
*/*                                                                  */ 00210000
*/*01*  FUNCTION =                                                   */ 00220000
*/*      Describes the entries to be assigned in the entry           */ 00230000
*/*      table created by the Entry Table Create service             */ 00240000
*/*      routine (IEAVXECR).                                         */ 00250000
*/*                                                                  */ 00260000
*/*01*  DSECT NAME:                                                  */ 00270000
*/*       ETD,                                                       */ 00280000
*/*       ETDELE                                                     */ 00290000
*/*                                                                  */ 00300000
*/*01*  Component: PC/AUTH (SCXMS)                                   */ 00310000
*/*                                                                  */ 00320000
*/*01*  EYE-CATCHER: None                                            */ 00330000
*/*                                                                  */ 00340000
*/*01*  STORAGE ATTRIBUTES:                                          */ 00350000
*/*02*    SUBPOOL: caller-supplied                                   */ 00360000
*/*02*    KEY: caller-supplied                                       */ 00370000
*/*02*    RESIDENCY: caller-supplied                                 */ 00380000
*/*                                                                  */ 00390000
*/*01*  SIZE: Header of 4 bytes plus up to 256 entries of:           */ 00400000
*/*             20 bytes each - format 0                             */ 00410000
*/*             40 bytes each - format 1                             */ 00420000
*/*                                                                  */ 00430000
*/*                                                                  */ 00440000
*/*01*  METHOD OF ACCESS                                             */ 00450000
*/*      BAL - A DSECT IS PRODUCED                                   */ 00460000
*/*            PERFORM USING ON ETD OR ETDELE.                       */ 00470000
*/*            THE OLD FORMAT ETD CAN BE OBTAINED BY CODING:         */ 00480000
*/*               IHAETD FORMAT=0      (THE DEFAULT FORMAT)          */ 00490000
*/*                                                                  */ 00500000
*/*            THE EXTENDED FORM IS OBTAINED BY CODING:              */ 00510000
*/*               IHAETD FORMAT=1                                    */ 00520000
*/*                                                                  */ 00530000
*/*      BAL LISTING -  SPECIFY LIST=YES ON MACRO CALL               */ 00540000
*/*                                                                  */ 00550000
*/*      PL/AS - ETD IS DECLARED AS A BASED STRUCTURE ON ETDPTR      */ 00560000
*/*             ETDELE IS DECLARED AS A BASED STRUCTURE ON ETDEPTR   */ 00570000
*/*            THE OLD FORMAT ETD CAN BE OBTAINED BY CODING:         */ 00580000
*/*               %ETDFORM='0'         (THE DEFAULT FORMAT)          */ 00590000
*/*               %INCLUDE SYSLIB(IHAETD)                            */ 00600000
*/*                                                                  */ 00610000
*/*            THE EXTENDED FORM IS OBTAINED BY CODING:              */ 00620000
*/*               %ETDFORM='1'                                       */ 00630000
*/*               %INCLUDE SYSLIB(IHAETD)                            */ 00640000
*/*                                                                  */ 00650000
*/*            VIA ATTRIBUTE - SPECIFY %IHAVIA='YES' BEFORE THE      */ 00660000
*/*                            INCLUDE.                              */ 00670000
*/*                            DECLARE ETDALET.                      */ 00680000
*/*                                                                  */ 00690000
*/*      PL/AS LISTING - %IHALIST='YES' BEFORE THE %INCLUDE          */ 00700000
*/*                                                                  */ 00710000
*/*01* CREATED BY:                                                   */ 00720000
*/*      Issuer of the ETDEF macro in any accessable storage         */ 00730000
*/*                                                                  */ 00740000
*/*01* DELETED BY:                                                   */ 00750000
*/*      Issuer of the ETDEF macro                                   */ 00760000
*/*                                                                  */ 00770000
*/*01* POINTED TO BY:                                                */ 00780000
*/*      The ETCRE parameter list                                    */ 00790000
*/*                                                                  */ 00800000
*/*01* SERIALIZATION:                                                */ 00810000
*/*      Provided by the caller of the Entry Table Create service    */ 00820000
*/*                                                                  */ 00830000
*/*01* DEPENDENCIES:                                                 */ 00840000
*/*      IF THE OFFSETS IN THIS MACRO CHANGE, THE 'SETA' SYMBOLS     */ 00850000
*/*      DEFINED UNDER "IHAETD OFFSETS" IN THE BAL SOURCE OF THE     */ 00860000
*/*      ETDEF MACRO MUST ALSO BE CHANGED.                           */ 00870000
*/*                                                                  */ 00880000
*/*01* COMPONENT: SCXMS (PC/AUTH)                                    */ 00890000
*/*                                                                  */ 00900000
*/*01* DISTRIBUTION LIBRARY: AMACLIB                                 */ 00910000
*/*                                                                  */ 00920000
*/****  END OF SPECIFICATIONS  ***************************************/ 00930000
*%GOTO PLSETD1; /*                                                 @L1C 00940000
.*                                                                      00950000
.*   CHANGE-ACTIVITY =          THIS MACRO IS NEW FOR OS/VS2 JBB1226.   00960000
.*                                                                      00970000
.*                              31-BIT VIRTUAL SUPPORT         @G860PXW 00980000
.*                                                                      00990000
.*  $L1=AR       HBB3310  850909  PD16LD:  ACCESS REGISTERS             01000000
.*  $L2=AR       HBB3310  860106  PD16Q9:  ACCESS REGISTERS             01010000
.*  $L3=ARREN    JBB3311  880418  PD16LD:  ARR Enhancements             01020000
.*  $01=OY55354  HBB4430  920625  PD16EJ:  Add ETDRCRD                  01030000
.*  $P1=PYN0828  HBB7708  021224  PD00XB:  ETDEAM                       01040000
.*  $L4=LXREU    HBB7709  030801  PD00XB:  ASN-and-LX-Reuse Facility    01050000
.*  $L5=ME24475  HBB7790  120720  PD00XB:  256 ETE's                    01051000
.*                                                                      01060000
.********************************************************************** 01070000
.*                                                                      01080000
.* THE FOLLOWING ARE THE NAMING CONVENTIONS USED FOR RESERVED AREAS:    01090000
.*                                                                      01100000
.*  1. RESERVED FIELDS ARE NAMED AS FOLLOWS:                            01110000
.*                                                                      01120000
.*           ETDRSXXX    DC   XLNNN'00'    RESERVED                     01130000
.*                XXX         IS THE OFFSET WITHIN THE ETD              01140000
.*                NNN         IS THE LENGTH OF THE RESERVED FIELD       01150000
.*                                                                      01160000
.********************************************************************** 01170000
.*                                                                      01180000
         PUSH   PRINT                                                   01190000
         AIF    ('&LIST' EQ 'YES').ETDLIST    Generate listing     @L1A 01200000
         PRINT  OFF                                                     01210000
.ETDLIST ANOP   ,                                                  @L1A 01220000
.*                                                                      01230000
         AIF    ('&FORMAT' EQ '0' OR '&FORMAT' EQ '1').ETD4        @L1A 01240000
         MNOTE 8,' FORMAT=&FORMAT NOT VALID - USE FORMAT=0 OR 1'   @L1A 01250000
         AGO    .ETDEXIT              NO MAPPING IS GENERATED      @L1A 01260000
.*---------------------------------------------------------------- @L1A 01270000
.ETD4    ANOP                 GENERATE BASE PORTION OF MAPPING     @L1A 01280000
ETD      DSECT                                                          01290000
         DS    0D             ENTRY TABLE DESCRIPTION LIST -       @L1C 01300000
*                             DESCRIBES THE INPUT LIST TO THE ETCRE     01310000
*                             MACRO                                     01320000
ETDFMT   DS    B              FORMAT NUMBER OF ETD.                @L1C 01330000
*                              0= ORIGINAL FORM - PRE HBB3310      @L1A 01340000
ETDFMTE  EQU   X'01'           1= EXTENDED FORM - HBB3310          @L1A 01350000
ETDHFLAG DS    B              All non-used bits must be zero.      @01C 01360000
ETDRCRD  EQU   X'80'          If bit is ON, NO recording of cross  @01A 01370000
*                             memory connections will be performed.     01380000
*                             If bit is OFF, recording will be done.    01390000
*                             Classification: DMTI                      01400000
*                             Notes: All other bits must be zero.       01410000
*                                                                       01420000
ETDFLGRS EQU   X'7F'          Non-used bits mask                   @01A 01430000
ETDNUM   DS    H              NUMBER OF ENTRY DESCRIPTIONS THAT FOLLOW  01440000
*                             (MAXIMUM OF 256 ENTRIES PER TABLE)   @L5C 01450000
ETDEND   EQU   *                                                        01460000
ETDLEN   EQU   ETDEND-ETD     LENGTH OF ETD HEADER                      01470000
*                                                                       01480000
*                                                                       01490000
ETDELE   DSECT                ELEMENT DESCRIPTION.  ONE FOR EACH   @L1C 01500000
         DS    0F              ENTRY TO BE ASSIGNED.               @L1A 01510000
ETDEX    DS    B              INDEX FOR THIS ENTRY                      01520000
ETDFLG   DS    B              FLAG BYTE                                 01530000
ETDSUP   EQU   X'80'          PROGRAM EXECUTION STATE                   01540000
*                              0= PROBLEM STATE                         01550000
*                              1= SUPERVISOR STATE.                @L1C 01560000
ETDXM    EQU   X'40'          CROSS MEMORY SPACE SWITCH.           @L1C 01570000
*                              0= ENTRY WILL NOT CAUSE A SPACE SWITCH   01580000
*                              1= THE PROGRAM WILL EXECUTE IN THE       01590000
*                               ADDRESS SPACE OF THE CREATOR OF THE     01600000
*                               ENTRY TABLE WITH THE AUTHORIZATION OF   01610000
*                               THAT ADDRESS SPACE.                     01620000
ETDBRS3F EQU   X'3F'          RESERVED. BITS 3-8 MUST BE ZERO.     @L2A 01630000
ETDRS002 DS    H              RESERVED. MUST BE ZERO               @L1C 01640000
ETDPRO   DS    0CL8           PROGRAM NAME TO BE INVOKED OR VIRTUAL     01650000
*                             ADDRESS OF PROGRAM ENTRY POINT.           01660000
*                             IF A PROGRAM NAME, THE NAMED PROGRAM      01670000
*                             MUST BE ON THE ACTIVE LPA QUEUE           01680000
*                             (FLPA OR MLPA) OR BE IN THE PLPA OR       01690000
*                             NUCLEUS.                             @L2A 01700000
*                             IF AN ADDRESS, ETDPRO1 MUST BE ZERO AND   01710000
*                             ETDPRO2 MUST BE THE ADDRESS.              01720000
ETDPRO1  DS    F              FIRST WORD OF ETDPRO                      01730000
ETDPRO2  DS    F              SECOND WORD OF ETDPRO                     01740000
ETDAMODE EQU   X'80'          IF PROGRAM ADDRESS IS SPECIFIED THIS      01750000
*                             BIT INDICATES AMODE : IF 1, PC ROUTINE    01760000
*                             EXECUTES IN 31-BIT MODE. IF 0, PC         01770000
*                             ROUTINE EXECUTES IN 24-BIT MODE  @G860PXW 01780000
ETDAKM   DS    H              16 BIT AUTHORIZED KEY MASK. BIT 0         01790000
*                             REPRESENTS KEY 0, ETC. IF A BIT IS ON,    01800000
*                             THE CORRESPONDING KEY IS AUTHORIZED TO    01810000
*                             CALL THIS ENTRY.                          01820000
ETDAK0   EQU   X'8000'        MASK FOR KEY 0                            01830000
ETDAK1   EQU   X'4000'        MASK FOR KEY 1                            01840000
ETDAK2   EQU   X'2000'        MASK FOR KEY 2                            01850000
ETDAK3   EQU   X'1000'        MASK FOR KEY 3                            01860000
ETDAK4   EQU   X'0800'        MASK FOR KEY 4                            01870000
ETDAK5   EQU   X'0400'        MASK FOR KEY 5                            01880000
ETDAK6   EQU   X'0200'        MASK FOR KEY 6                            01890000
ETDAK7   EQU   X'0100'        MASK FOR KEY 7                            01900000
ETDAK8   EQU   X'0080'        MASK FOR KEY 8                            01910000
ETDAK9   EQU   X'0040'        MASK FOR KEY 9                            01920000
ETDAKA   EQU   X'0020'        MASK FOR KEY 10                           01930000
ETDAKB   EQU   X'0010'        MASK FOR KEY 11                           01940000
ETDAKC   EQU   X'0008'        MASK FOR KEY 12                           01950000
ETDAKD   EQU   X'0004'        MASK FOR KEY 13                           01960000
ETDAKE   EQU   X'0002'        MASK FOR KEY 14                           01970000
ETDAKF   EQU   X'0001'        MASK FOR KEY 15                           01980000
ETDEKM   DS    H              16 BIT ENTRY KEY MASK. BIT 0              01990000
*                             REPRESENTS KEY 0, ETC. IF A BIT IS ON,    02000000
*                             THE CALLED PROGRAM WILL BE AUTHORIZED     02010000
*                             TO USE THE CORRESPONDING KEY.             02020000
ETDEK0   EQU   X'8000'        MASK FOR KEY 0                            02030000
ETDEK1   EQU   X'4000'        MASK FOR KEY 1                            02040000
ETDEK2   EQU   X'2000'        MASK FOR KEY 2                            02050000
ETDEK3   EQU   X'1000'        MASK FOR KEY 3                            02060000
ETDEK4   EQU   X'0800'        MASK FOR KEY 4                            02070000
ETDEK5   EQU   X'0400'        MASK FOR KEY 5                            02080000
ETDEK6   EQU   X'0200'        MASK FOR KEY 6                            02090000
ETDEK7   EQU   X'0100'        MASK FOR KEY 7                            02100000
ETDEK8   EQU   X'0080'        MASK FOR KEY 8                            02110000
ETDEK9   EQU   X'0040'        MASK FOR KEY 9                            02120000
ETDEKA   EQU   X'0020'        MASK FOR KEY 10                           02130000
ETDEKB   EQU   X'0010'        MASK FOR KEY 11                           02140000
ETDEKC   EQU   X'0008'        MASK FOR KEY 12                           02150000
ETDEKD   EQU   X'0004'        MASK FOR KEY 13                           02160000
ETDEKE   EQU   X'0002'        MASK FOR KEY 14                           02170000
ETDEKF   EQU   X'0001'        MASK FOR KEY 15                           02180000
ETDPAR   DS    CL4            PARAMETER TO BE PASSED TO THE CALLED      02190000
*                             PROGRAM.                                  02200000
.*             SKIP THE EXTENDED PORTION IF FORMAT(0)              @L1A 02210000
         AIF   ('&FORMAT' EQ '0').ETD5                             @L1A 02220000
ETDOPTB1 DS    B              ETD OPTIONS BYTE 1                   @L1A 02230000
ETDPCTC  EQU   X'80'          PC-TYPE CONTROL                      @L1A 02240000
*                              0= BASIC PC                         @L1A 02250000
*                              1= STACKING PC                      @L1A 02260000
ETDEAM   EQU   X'40'          Extended addressing mode             @P1A 02270000
*                              0= Not AMODE 64                     @P1A 02280000
*                              1= AMODE 64                         @P1A 02290000
ETDBRS20 EQU   X'20'          RESERVED. BIT MUST BE ZERO.          @P1A 02300000
ETDPKC   EQU   X'10'          PSW KEY CONTROL                      @L1A 02310000
*                              0= PSW KEY UNCHANGED                @L1A 02320000
*                              1= REPLACE PSW KEY WITH ETDEK       @L1A 02330000
ETDPKMC  EQU   X'08'          PSW KEY MASK CONTROL                 @L1A 02340000
*                              0= OR ETDEKM WITH PKM               @L1A 02350000
*                              1= REPLACE PKM WITH ETDEKM          @L1A 02360000
ETDEAXC  EQU   X'04'          EAX CONTROL                          @L1A 02370000
*                              0= NO EAX CHANGE                    @L1A 02380000
*                              1= REPLACE EAX WITH ETDEAX          @L1A 02390000
ETDASC   EQU   X'02'          ADDR SPACE CONTROL (PSW BITS 16-17)  @L1A 02400000
*                              0= PRIMARY MODE   (00)              @L1A 02410000
*                              1= AR MODE        (01)              @L1A 02420000
ETDSASNC EQU   X'01'          SASN CONTROL                         @L1A 02430000
*                              0= SET SASN TO OLD PASN             @L1A 02440000
*                              1= SET SASN TO NEW PASN             @L1A 02450000
ETDEK    DS    B              ENTRY KEY (HIGH ORDER 4 BITS)        @L1A 02460000
ETDEAX   DS    H              EXTENDED AUTHORIZATION INDEX         @L1A 02470000
ETDARR   DS    0CL8           ASSOCIATED RECOVERY ROUTINE NAME OR  @L2C 02480000
*                             ADDRESS OF ARR ENTRY POINT.               02490000
*                             IF AN ARR NAME, THE NAMED PROGRAM         02500000
*                             MUST BE ON THE ACTIVE LPA QUEUE           02510000
*                             (FLPA OR MLPA) OR BE IN THE PLPA OR       02520000
*                             NUCLEUS.                             @L2A 02530000
*                             IF AN ADDRESS, ETDARR1 MUST BE ZERO AND   02540000
*                             ETDARR2 MUST BE THE ADDRESS.              02550000
ETDARR1  DS    F              FIRST WORD OF ETDARR                 @L2A 02560000
ETDARR2  DS    F              SECOND WORD OF ETDARR                @L2A 02570000
ETDPAR2  DS    XL4            USER PARAMETER 2                     @L1A 02580000
ETDLPAFL DS    0F             FLAGS FOR LPA                        @L3A 02590000
ETDLPAB1 DS    B              FIRST BYTE OF FLAGS                  @L3A 02600000
ETDCANCL EQU   X'80'          CANCEL OPTION FOR ARR                @L3A 02610000
*                              0 => CANCEL=YES (DEFAULT).          @L3A 02620000
*                              1 => CANCEL=NO                      @L3A 02630000
ETDASYNC EQU   X'40'          ASYNCH OPTION FOR ARR                @L3A 02640000
*                              0 => ASYNCH=YES (DEFAULT).          @L3A 02650000
*                              1 => ASYNCH=NO                      @L3A 02660000
ETDARRC  EQU   X'20'          ARRCOND OPTION FOR ARR               @L4A 02670000
*                              0 => ARRCOND=NO (DEFAULT).          @L4A 02680000
*                              1 => ARRCOND=YES                    @L4A 02690000
ETDRS1   EQU   X'1F'          RESERVED - MUST BE ZERO.             @L4C 02700000
ETDLPAB2 DS    XL3            RESERVED - MUST BE ZERO              @L3C 02710000
.ETD5    ANOP                 GENERATE COMMON TRAILER PORTION      @L1A 02720000
ETDEEND  DS    0F             END OF ENTRY TABLE DESCRIPTOR        @L1C 02730000
ETDELEN  EQU   ETDEEND-ETDELE LENGTH OF ENTRY DESCRIPTOR ELEMENT        02740000
.ETDEXIT ANOP                 END OF BAL GENERATION                @L1A 02750000
         POP   PRINT                                               @L1A 02760000
         MEND  , */                                                     02770000
*%PLSETD1: ;                                                            02780000
*                                                                       02790000
*%IF IHAVIA='YES'  %THEN                                                02800000
*   %IHAALET='VIA(ETDALET)' ;     /* VIA attribute requested     @L2A*/ 02810000
* %ELSE                                                                 02820000
*     %IHAALET='';                /* Don't use VIA               @L2A*/ 02830000
*                                                                       02840000
*@LISTPUSH;                       /* Save list option            @L1A*/ 02850000
*%IF IHALIST='YES' %THEN          /* Generate listing            @L1A*/ 02860000
*   %GOTO ETDLIST;                /*                             @L1A*/ 02870000
*@LISTOFF;                        /* Do not generate listing     @L1A*/ 02880000
*%ETDLIST: ;                      /*                             @L1A*/ 02890000
*%IF ETDFORM='' %THEN             /* IF UNSPECIFIED FORMAT       @L1A*/ 02900000
*   %ETDFORM='0';                 /* DEFAULT TO BASE FORMAT      @L1A*/ 02910000
*%IF ETDFORM='0' %THEN            /* IF VALID BASE FORMAT        @L1A*/ 02920000
*   %GOTO PLSETD4;                /*                             @L1A*/ 02930000
*%IF ETDFORM='1' %THEN            /* IF VALID EXTENDED FORMAT    @L1A*/ 02940000
*   %GOTO PLSETD4;                /*                             @L1A*/ 02950000
*%PLSETD3: ;                      /* This unused label is needed        02960000
*                                    to enable the PLS compiler to      02970000
*                                    print the following comment @L1A*/ 02980000
*   /*****************************************************************/ 02990000
*   /*  THE %ETDFORM MACRO VARIABLE WAS INCORRECTLY SPECIFIED PRIOR  */ 03000000
*   /*  TO INCLUDING THE IHAETD MACRO. USE %ETDFORM='0' OR '1'.      */ 03010000
*   /*  NO TEXT IS GENERATED;                                    @L1A*/ 03020000
*   /*****************************************************************/ 03030000
*   %GOTO PLSETDX;                /*  NO MAPPING IS GENERATED    @L1A*/ 03040000
*%PLSETD4: ;                      /*                             @L1A*/ 03050000
* DCL 1 ETD BASED(ETDPTR) BDY(DWORD)  IHAALET, /* ENTRY TABLE           03060000
*                                    DESCRIPTION LIST.                  03070000
*                                    DESCRIBES THE INPUT LIST           03080000
*                                    TO THE ETCRE MACRO.         @L2C*/ 03090000
*         3 ETDFMT FIXED(8),      /* FORMAT NUMBER OF ETD.              03100000
*                                     0= ORIGINAL FORM - PRE HBB3310    03110000
*                                     1= EXTENDED FORM - HBB3310 @L1A*/ 03120000
*         3 ETDHFLAG FIXED(8),    /* All unused bits must be zero.      03130000
*                                                                @01C*/ 03140000
*           5  ETDRCRD BIT(1),    /* 0 = Record(YES) entry table        03150000
*                                    1 = Record(NO) entry table         03160000
*                                    Classification: DMTI        @01A*/ 03170000
*           5  ETDFLGRS BIT(7),   /* Reserved, must be zero.     @01A*/ 03180000
*         3 ETDNUM FIXED(16);     /* NUMBER OF ENTRY DESCRIPTIONS THAT  03190000
*                                     FOLLOW  (MAXIMUM OF 256           03200000
*                                     ENTRIES PER TABLE)         @L5C*/ 03210000
* /*                                                             @L1A*/ 03220000
* /*                                                             @L1A*/ 03230000
* DCL 1 ETDELE BASED(ETDEPTR) BDY(WORD)  IHAALET, /* ELEMENT            03240000
*                                    DESCRIPTION.  ONE FOR EACH ENTRY   03250000
*                                    TO BE ASSIGNED              @L2C*/ 03260000
*         3 ETDEX FIXED(8),       /* INDEX FOR THIS ENTRY (0 ORIGIN) */ 03270000
*         3 ETDFLG BIT(8),        /* FLAG BYTE                       */ 03280000
*           5 ETDSUP BIT(1),      /* PROGRAM EXECUTION STATE            03290000
*                                     0= PROBLEM STATE                  03300000
*                                     1= SUPERVISOR STATE.       @L1C*/ 03310000
*           5 ETDXM BIT(1),       /* CROSS MEMORY SPACE SWITCH.         03320000
*                                     0= THE ENTRY WILL NOT CAUSE A     03330000
*                                       SPACE SWITCH.                   03340000
*                                     1= THE PROGRAM WILL EXECUTE IN    03350000
*                                       THE ADDRESS SPACE OF THE        03360000
*                                       CREATOR OF THE ENTRY TABLE      03370000
*                                       WITH THE AUTHORIZATION OF       03380000
*                                       THAT ADDRESS SPACE.      @L1C*/ 03390000
*           5 ETDBRS3F BIT(6),    /* RESERVED. BITS 3-8 MUST BE         03400000
*                                    ZERO.                       @L2C*/ 03410000
*         3 ETDRS002 FIXED(16),   /* RESERVED. MUST BE ZERO      @L1C*/ 03420000
*         3 ETDPRO CHAR(8) BDY(WORD), /* PROGRAM NAME OR THE VIRTUAL    03430000
*                                    ADDRESS TO BE GIVEN CONTROL. IF A  03440000
*                                    PROGRAM NAME, THE NAMED PROGRAM    03450000
*                                    MUST BE ON THE ACTIVE LPA QUEUE    03460000
*                                    (FLPA OR MLPA) OR BE IN THE PLPA   03470000
*                                    OR NUCLEUS.                        03480000
*                                    IF AN ADDRESS, ETDPRO1 MUST BE     03490000
*                                    ZERO AND ETDPRO2 MUST BE THE       03500000
*                                    ADDRESS.                    @L2C*/ 03510000
*           5 ETDPRO1 FIXED(32),  /* FIRST WORD OF ETDPRO            */ 03520000
*           5 ETDPRO2   PTR(31),  /* SECOND WORD OF ETDPRO           */ 03530000
*             7 ETDAMODE BIT(1),  /* IF PROGRAM ADDRESS IS SPECIFIED    03540000
*                                    THIS BIT INDICATES AMODE : IF 1,   03550000
*                                    PC ROUTINE EXECUTES IN 31-BIT      03560000
*                                    MODE. IF 0, PC ROUTINE EXECUTES    03570000
*                                    IN 24-BIT MODE          @G860PXW*/ 03580000
*         3 ETDAKM BIT(16),       /* 16 BIT AUTHORIZED KEY MASK. BIT 0  03590000
*                                    REPRESENTS KEY 0, ETC. IF A BIT IS 03600000
*                                    ON, THE CORRESPONDING KEY IS       03610000
*                                    AUTHORIZED TO CALL THIS ENTRY   */ 03620000
*           5 ETDAK0  BIT(1),     /* BIT REPRESENTING KEY 0          */ 03630000
*           5 ETDAK1  BIT(1),     /* BIT REPRESENTING KEY 1          */ 03640000
*           5 ETDAK2  BIT(1),     /* BIT REPRESENTING KEY 2          */ 03650000
*           5 ETDAK3  BIT(1),     /* BIT REPRESENTING KEY 3          */ 03660000
*           5 ETDAK4  BIT(1),     /* BIT REPRESENTING KEY 4          */ 03670000
*           5 ETDAK5  BIT(1),     /* BIT REPRESENTING KEY 5          */ 03680000
*           5 ETDAK6  BIT(1),     /* BIT REPRESENTING KEY 6          */ 03690000
*           5 ETDAK7  BIT(1),     /* BIT REPRESENTING KEY 7          */ 03700000
*           5 ETDAK8  BIT(1),     /* BIT REPRESENTING KEY 8          */ 03710000
*           5 ETDAK9  BIT(1),     /* BIT REPRESENTING KEY 9          */ 03720000
*           5 ETDAKA  BIT(1),     /* BIT REPRESENTING KEY 10         */ 03730000
*           5 ETDAKB  BIT(1),     /* BIT REPRESENTING KEY 11         */ 03740000
*           5 ETDAKC  BIT(1),     /* BIT REPRESENTING KEY 12         */ 03750000
*           5 ETDAKD  BIT(1),     /* BIT REPRESENTING KEY 13         */ 03760000
*           5 ETDAKE  BIT(1),     /* BIT REPRESENTING KEY 14         */ 03770000
*           5 ETDAKF  BIT(1),     /* BIT REPRESENTING KEY 15         */ 03780000
*         3 ETDEKM BIT(16),       /* 16 BIT ENTRY KEY MASK. BIT 0       03790000
*                                    REPRESENTS KEY 0, ETC. IF A BIT    03800000
*                                    IS ON, THE CALLED PROGRAM IS       03810000
*                                    AUTHORIZED TO USE THE KEY.      */ 03820000
*           5 ETDEK0  BIT(1),     /* BIT REPRESENTING KEY 0          */ 03830000
*           5 ETDEK1  BIT(1),     /* BIT REPRESENTING KEY 1          */ 03840000
*           5 ETDEK2  BIT(1),     /* BIT REPRESENTING KEY 2          */ 03850000
*           5 ETDEK3  BIT(1),     /* BIT REPRESENTING KEY 3          */ 03860000
*           5 ETDEK4  BIT(1),     /* BIT REPRESENTING KEY 4          */ 03870000
*           5 ETDEK5  BIT(1),     /* BIT REPRESENTING KEY 5          */ 03880000
*           5 ETDEK6  BIT(1),     /* BIT REPRESENTING KEY 6          */ 03890000
*           5 ETDEK7  BIT(1),     /* BIT REPRESENTING KEY 7          */ 03900000
*           5 ETDEK8  BIT(1),     /* BIT REPRESENTING KEY 8          */ 03910000
*           5 ETDEK9  BIT(1),     /* BIT REPRESENTING KEY 9          */ 03920000
*           5 ETDEKA  BIT(1),     /* BIT REPRESENTING KEY 10         */ 03930000
*           5 ETDEKB  BIT(1),     /* BIT REPRESENTING KEY 11         */ 03940000
*           5 ETDEKC  BIT(1),     /* BIT REPRESENTING KEY 12         */ 03950000
*           5 ETDEKD  BIT(1),     /* BIT REPRESENTING KEY 13         */ 03960000
*           5 ETDEKE  BIT(1),     /* BIT REPRESENTING KEY 14         */ 03970000
*           5 ETDEKF  BIT(1),     /* BIT REPRESENTING KEY 15         */ 03980000
*%IF ETDFORM='1' %THEN            /* IF EXTENDED (FORMAT=1)      @L1A*/ 03990000
*   %GOTO PLSETD5;                /*                             @L1A*/ 04000000
*         3 ETDPAR CHAR(4);       /* PARAMETER TO BE PASSED TO THE      04010000
*                                    CALLED PROGRAM.                 */ 04020000
*%GOTO PLSETDX;                   /*                             @L1A*/ 04030000
*%PLSETD5: ;                      /* GENERATE EXTENDED VERSION   @L1A*/ 04040000
*        3 ETDPAR CHAR(4),        /* PARAMETER TO BE PASSED TO THE      04050000
*                                    CALLED PROGRAM.                 */ 04060000
*        3 ETDOPTB1 BIT(8),       /* ETD OPTIONS BYTE 1          @L1A*/ 04070000
*          5 ETDPCTC BIT(1),      /* PC-TYPE CONTROL:                   04080000
*                                     0= BASIC PC                       04090000
*                                     1= STACKING PC             @L1A*/ 04100000
*          5 ETDEAM BIT(1),       /* Extended addressing mode           04110000
*                                    0= not AMODE 64                    04120000
*                                    1= AMODE 64                 @P1A*/ 04130000
*          5 ETDBRS20 BIT(1),     /* RESERVED. BIT MUST                 04140000
*                                    BE ZERO.                    @P1C*/ 04150000
*          5 ETDPKC  BIT(1),      /* PSW KEY CONTROL:                   04160000
*                                     0= PSW KEY UNCHANGED              04170000
*                                     1= REPLACE PSW KEY                04180000
*                                        WITH ETDEK              @L1A*/ 04190000
*          5 ETDPKMC BIT(1),      /* PSW KEY MASK CONTROL:              04200000
*                                     0= OR ETDEKM WITH PKM             04210000
*                                     1= REPLACE PSW KEY MASK (PKM)     04220000
*                                        WITH ETDEKM             @L1A*/ 04230000
*          5 ETDEAXC BIT(1),      /* EAX CONTROL:                       04240000
*                                     0= NO EAX CHANGE                  04250000
*                                     1= REPLACE EAX WITH ETDEAX @L1A*/ 04260000
*          5 ETDASC BIT(1),       /* ADDR SPACE CONTROL (PSW BIT 16-17) 04270000
*                                     0= PRIMARY MODE   (00)            04280000
*                                     1= AR MODE        (01)     @L1A*/ 04290000
*          5 ETDSASNC BIT(1),     /* SASN CONTROL:                      04300000
*                                     0= SET SASN TO OLD PASN           04310000
*                                     1= SET SASN TO NEW PASN    @L1A*/ 04320000
*        3 ETDEK   BIT(8),        /* ENTRY KEY (HI ORDER 4 BITS) @L1A*/ 04330000
*        3 ETDEAX  BIT(16),       /* EXTENDED AUTH. INDEX        @L1A*/ 04340000
*        3 ETDARR CHAR(8) BDY(WORD), /* ASSOCIATED RECOVERY ROUTINE     04350000
*                                    NAME OR ADDRESS OF ARR ENTRY POINT 04360000
*                                    IF AN ARR NAME, THE NAMED PROGRAM  04370000
*                                    MUST BE ON THE ACTIVE LPA QUEUE    04380000
*                                    (FLPA OR MLPA) OR BE IN THE PLPA   04390000
*                                    OR NUCLEUS.                        04400000
*                                    IF AN ADDRESS, ETDARR1 MUST BE     04410000
*                                    ZERO AND ETDARR2 MUST BE THE       04420000
*                                    ADDRESS.                    @L2C*/ 04430000
*          5 ETDARR1 FIXED(32),   /* FIRST WORD OF ETDARR        @L2A*/ 04440000
*          5 ETDARR2   PTR(31),   /* SECOND WORD OF ETDARR       @L2A*/ 04450000
*        3 ETDPAR2 CHAR(4),       /* USER PARAMETER 2            @L1A*/ 04460000
*        3 ETDLPAFL CHAR(4),      /* FLAGS FOR LPA               @L3A*/ 04470000
*          5 ETDLPAB1 BIT(8),     /* FIRST BYTE OF FLAGS         @L3A*/ 04480000
*            7 ETDCANCL BIT(1),   /* CANCEL OPTION FOR ARR.      @L3A*/ 04490000
*/*                                    0 => CANCEL=YES (DEFAULT).    */ 04500000
*/*                                    1 => CANCEL=NO            @L3A*/ 04510000
*            7 ETDASYNC BIT(1),   /* ASYNCH OPTION FOR ARR.      @L3A*/ 04520000
*/*                                    0 => ASYNCH=YES (DEFAULT).    */ 04530000
*/*                                    1 => ASYNCH=NO            @L3A*/ 04540000
*            7 ETDARRC BIT(1),    /* ARRCOND OPTION FOR ARR.     @L4A*/ 04550000
*/*                                    0 => ARRCOND=NO (DEFAULT).    */ 04560000
*/*                                    1 => ARRCOND=YES          @L4A*/ 04570000
*            7 ETDRS1   BIT(5),   /* RESERVED - MUST BE ZERO     @L4C*/ 04580000
*          5 ETDLPAB2 CHAR(3),    /* RESERVED - MUST BE ZERO     @L3C*/ 04590000
*      2 ETDEEND  CHAR(0) BDY(WORD);  /* END OF ENTRY TABLE             04600000
*                                         ELEMENT DESCRIPTION    @L1A*/ 04610000
* DCL ETDFMTE FIXED(8) CONSTANT(01);  /* EXTENDED FORM OF ETD    @L1A*/ 04620000
*%PLSETDX: ;                      /* END GENERATION              @L1A*/ 04630000
*@LISTPOP;                        /* Restore list option         @L1A*/ 04640000
