*%       GOTO FRRSPLS1;  /*                                             00010000
         MACRO                                                          00020000
         IHAFRRS &DSECT=YES                                          */ 00030000
*%FRRSPLS1 : ;                                                          00040000
*/** START OF SPECIFICATIONS *****************************************/ 00050000
*/*                                                                  */ 00060000
*/* MACRO NAME:  IHAFRRS                                             */ 00070000
*/*                                                                  */ 00080000
*/* DESCRIPTIVE NAME:  FUNCTION RECOVERY ROUTINE STACK               */ 00090000
*/*                                                                  */ 00100000
*/* PROPRIETARY STATEMENT:                                           */ 00110000
*/*            5694-A01                                              */ 00120000
*/*            COPYRIGHT IBM CORP. 1980,2010                         */ 00140001
*/*            LICENSED MATERIALS - PROPERTY OF IBM                  */ 00150000
*/*                                                                  */ 00160000
*/* STATUS = HBB7770                                                 */ 00170001
*/*                                                                  */ 00180000
*/* EXTERNAL CLASSIFICATION:                                         */ 00190000
*/*                                                                  */ 00200000
*/* DMTI: BASE                                                       */ 00210000
*/* GUPI: INCLUDE                                                    */ 00220000
*/*                                                                  */ 00230000
*/* END OF EXTERNAL CLASSIFICATION:                                  */ 00240000
*/*                                                                  */ 00250000
*/* DSECT NAME: FRRS, FRRSXSTK, FRRSENTR, FRRSXENT                   */ 00260000
*/*                                                                  */ 00270000
*/* COMPONENT: RECOVERY TERMINATION MANAGER (SCRTM)                  */ 00280000
*/*                                                                  */ 00290000
*/* EYE CATCHER: NONE                                                */ 00300000
*/*                                                                  */ 00310000
*/* STORAGE ATTRIBUTES:                                              */ 00320000
*/*  SUBPOOL:  239                                                   */ 00330000
*/*  KEY:  0                                                         */ 00340000
*/*                                                                  */ 00350000
*/* SIZE: 856 BYTES OR LESS                                          */ 00360000
*/*                                                                  */ 00370000
*/* CREATED BY: IEAVNIP0 OR IEFVCPU                                  */ 00380000
*/*                                                                  */ 00390000
*/* POINTED TO BY:                                                   */ 00400000
*/*                                                                  */ 00410000
*/*   PSA DATA AREA FIELDS -                                         */ 00420000
*/*     PSACSTK  (CURRENT FRR STACK)                                 */ 00430000
*/*     PSANSTK  (NORMAL FRR STACK)                                  */ 00440000
*/*     PSASSTK  (SVC-I/O-DISPATCHER FRR STACK)                      */ 00450000
*/*     PSASSAV  (CURRENT FRR STACK SAVED BY SVC-I/O-DISPATCHER)     */ 00460000
*/*     PSAMSTK  (MACHINE CHECK FLIH FRR STACK)                      */ 00470000
*/*     PSAMSAV  (CURRENT FRR STACK AT TIME OF MACHINE CHECK)        */ 00480000
*/*     PSAPSTAK (PROGRAM CHECK FLIH FRR STACK)                      */ 00490000
*/*     PSAPSAV  (CURRENT FRR STACK AT TIME OF PROGRAM CHECK)        */ 00500000
*/*     PSAESTK1 (EXTERNAL FLIH1 FRR STACK)                          */ 00510000
*/*     PSAESAV1 (CURRENT FRR STACK AT TIME OF EXTERNAL INTERRUPT)   */ 00520000
*/*     PSAESTK2 (EXTERNAL FLIH2 FRR STACK)                          */ 00530000
*/*     PSAESAV2 (CURRENT FRR STACK AT TIME OF FIRST RECURSIVE       */ 00540000
*/*               EXTERNAL INTERRUPT)                                */ 00550000
*/*     PSAESTK3 (EXTERNAL FLIH3 FRR STACK)                          */ 00560000
*/*     PSAESAV3 (CURRENT FRR STACK AT TIME OF SECOND RECURSIVE      */ 00570000
*/*               EXTERNAL INTERRUPT)                                */ 00580000
*/*     PSARSTK  (RESTART FLIH FRR STACK)                            */ 00590000
*/*     PSARSAV  (CURRENT FRR STACK AT TIME OF RESTART INTERRUPT)    */ 00600000
*/*     PSATSTK  (RECOVERY TERMINATION MANAGER FRR STACK)            */ 00610000
*/*     PSATSAV  (ERROR STACK SAVED BY RTM PROCESSING)               */ 00620000
*/*     PSAASTK  (ALTERNATE CPU RECOVERY FRR STACK)                  */ 00630000
*/*     PSAASAV  (FRR STACK SAVED BY ACR PROCESSING)                 */ 00640000
*/*                                                                  */ 00650000
*/* SERIALIZATION:                                                   */ 00660000
*/*                                                                  */ 00670000
*/*     AT LEAST ONE OF THE FOLLOWING -                              */ 00680000
*/*                                                                  */ 00690000
*/*     DISABLEMENT, SRB MODE, ANY LOCK HELD, OR AN EUT=YES FRR      */ 00700000
*/*     IS ESTABLISHED AND HAS NOT BEEN DELETED                      */ 00710000
*/*                                                                  */ 00720000
*/* FUNCTION: MAPPING OF FRR STACK CONTENTS, USED WITH THE SETFRR    */ 00730000
*/*           MACRO TO DEFINE FRRS                                   */ 00740000
*/*                                                                  */ 00750000
*/* METHOD OF ACCESS:                                                */ 00760000
*/* --BAL--                                                          */ 00770000
*/*             IHAFRRS                                              */ 00780000
*/* NOTE -                                                           */ 00790000
*/*     TO OBTAIN ADDRESSABILITY TO THE FRRSXSTK CODE                */ 00800000
*/*            L     REG,FRRSXSTA                                    */ 00810000
*/*            USING FRRSXSTK,REG                                    */ 00820000
*/*                                                                  */ 00830000
*/* --PLS--                                                          */ 00840000
*/*             DCL FRRSPTR PTR                                      */ 00850000
*/*             %INCLUDE SYSLIB(IHAFRRS)                             */ 00860000
*/*                                                                  */ 00870000
*/* CHANGE ACTIVITY =                                                */ 00880000
*/*     MVS/SYSTEM PRODUCT RELEASE 2 - ADDED A 24 BYTE SAVE          */ 00890000
*/*               AREA, ENLARGED THE RTM1 WORK AREA, ADDED AN        */ 00900000
*/*               EXTENSION FOR EACH ENTRY FOR CROSS MEMORY          */ 00910000
*/*               INFORMATION, AND ADDED FLAGS IN THE SECOND WORD    */ 00920000
*/*               OF EACH ENTRY.                                     */ 00930000
*/*     MVS/SYSTEM PRODUCT VERSION 2 RELEASE 1               @G860P1S*/ 00940000
*/*  $L1=RASENH  ,JBB2220,840627,PDFO: FRR STACK RESTRUCTURE     @L1A*/ 00950000
*/*  $L2=RASENH  ,JBB2220,841116,PDPY: NESTED FRR RETRY          @L2A*/ 00960000
*/*  $L3=AR      ,HBB3310,850917,PDPY: ACCESS REGISTER SUPPORT   @L3A*/ 00970000
*/*  $D1=DCR0059 ,HBB3310,861029,PDU8: SUPPORT FOR DEFERRED CANCEL/  */ 00980000
*/*                                    DETACH PROCESSING         @D1A*/ 00990000
*/*  $P1=PR20011  HBB6601 950908 PDKD: SC1CM COMPID SPLIT - ALSO     */ 01000000
*/*                                    REWROTE PROLOG FOR SHOWHDR    */ 01010000
*/*  $P2=PR20013  HBB6601 950913 PDKD: INDICATE GUPI INCLUDE     @P2A*/ 01020000
*/*  $L4=LXREU    HBB7709 030801 PDXB: ASN-AND-LX-REUSE FACILITY     */ 01030000
*/*  $P3=PJK1264  HBB7709 031203 PDXB: FIELDS FOR FRRSCOPY           */ 01040000
*/*  $P4=PJK1345  HBB7709 031218 PDXB: ASSEMBLER FRRSXM RESTORE      */ 01050000
*/*  $L5=PEV      HBB7730 050415 PDXB: AMODE 64 FRR                  */ 01060000
*/*  $P5=ME17549  HBB7770 091023 PDKD: SDWALOC31 FOR FRRS            */ 01061003
*/** END OF SPECIFICATIONS *******************************************/ 01070000
*%       GOTO FRRSPLS;  /*                                              01080000
         AIF ('&DSECT' EQ 'YES').FRRS001                                01090000
FRRS     DS   0D -                                                      01100000
         AGO  .FRRS002                                                  01110000
.FRRS001 ANOP                                                           01120000
FRRSESZE EQU    32            LENGTH OF EACH FRR ENTRY                  01130000
FRRSEXSZ EQU    32            LENGTH OF EACH FRR EXTENSION        @L4C  01140000
FRRSNENT EQU    16            NUMBER OF FRR ENTRIES IN STACK  @ZM02352  01150000
FRRS     DSECT ,       FRRSPTR                                          01160000
.FRRS002 SPACE 2                                                        01170000
FRRSND   DS     0CL88         NON-DYNAMIC PART OF FRRS            @L3C  01180000
FRRSHEAD DS     0CL16         THE HEADER OF THE FRR STACK               01190000
FRRSEMP  DS     A             ADDRESS WHICH INDICATES AN EMPTY STACK    01200000
FRRSLAST DS     A             ADDRESS OF LAST ENTRY IN THE STACK        01210000
FRRSELEN DS     F             LENGTH OF EACH FRR ENTRY IN THE STACK     01220000
FRRSCP1P DS     0CL36         COPIED BY FRRSCOPY WHEN "PLUS1"     @P3A  01230000
FRRSCURR DS     A             ADDRESS OF CURRENT FRR ENTRY IN THE STACK 01240000
FRRSCPY1 DS     0CL32         COPIED BY FRRSCOPY                  @P3A  01250000
FRRSRSA  DS     CL24          SETFRR REG 14-3 SAVE AREA       @G381P2F  01260000
FRRSRTMW DS     CL4           RECURSION CONTROL DATA REMOVED FROM THE  X01270000
                              RT1W                                @L1C  01280000
FRRSENTL DS     H             LENGTH OF ENTRIES FOR FRRSCOPY      @L1A  01290000
FRRSEXTL DS     H             LENGTH OF EXTENSIONS FOR FRRSCOPY   @L1A  01300000
         DS     CL8           RESERVED FOR FUTURE USE             @L1A  01310000
FRRSRTMA DS     A             RTM1 WORK AREA ADDRESS              @L1A  01320000
FRRSXSTA DS     A             ADDRESS OF THE EXTENSIONS TO THE FRR      01330000
*                             ENTRIES (ACTUAL SIZE IS 16 TIME THE       01340000
*                             MAXIMUM NUMBER OF ENTRIES           @L1A  01350000
FRRSCPY2 DS     0CL24         COPIED BY FRRSCOPY                  @P3A  01360000
FRRSASA  DS     CL24          SETFRR AR 14-3 SAVE AREA            @L3A  01370000
FRRSENTS DS     CL(FRRSNENT*FRRSESZE) FRR ENTRIES IN STACK        @L1C  01380000
FRRSXSTK DSECT     ,  FRRSXSTA THE FRR EXTENSIONS                 @L1A  01390000
         DS     CL(FRRSNENT*FRRSEXSZ) ACTUAL SIZE                 @L1A  01400000
FRRSENTR DSECT     ,  FRREPTR THE MAPPING OF A FRR ENTRY                01410000
FRRSFRRA DS     0A            THE ADDRESS OF THE FRR                    01420000
         DS     CL3           HIGH ORDER 3 BYTES OF FRR ADDR  @G381P2F  01430000
FRRSFRA1 DS     CL1           LOW ORDER BYTE OF FRR ADDRESS   @G381P2F  01440000
FRRSXFLG EQU    X'01'         FLAG INDICATING FRRSFLGS INITIALIZED      01450000
*                             WHEN SETFRR WAS ISSUED          @G381P2F  01460000
FRRSFLGS DS     0CL4          FLAGS USED BY RTM DURING FRR PROCESSING   01470000
FRRSFLG1 DS     B             RECURSION FLAGS USED BY RTM               01480000
FRRSRCUR EQU    X'80'         RECURSION FLAG USED WHEN GIVING CONTROL   01490000
*                             TO FRR AND WHEN RECEIVING CONTROL BACK    01500000
*                             FROM FRR                                  01510000
FRRSNEST EQU    X'40'         FLAG INDICATING A NESTED FRR ENTRY        01520000
FRRSNLCL EQU    X'20'         FLAG INDICATING THAT NESTED FRR IS A     *01530000
                              MODE=LOCAL FRR                  @G382PPY  01540000
FRRSNGLB EQU    X'10'         FLAG INDICATING THAT NESTED FRR IS A     *01550000
                              MODE=GLOBAL FRR                 @G382PPY  01560000
FRRSNRTY EQU    X'08'         FRR RETRY INDICATOR. IF ON, FRR CANNOT   *01570000
                              RETRY                               @L2C  01580000
FRRSFLG2 DS     B             RESERVED                        @ZMB0248  01590000
FRRSFLG3 DS     B             RESULT OF IAC INSTRUCTION FROM TIME OF   *01600000
                              SETFRR                               @L3C 01610000
FRRSFLG4 DS     B             FLAGS TO INDICATE OPTIONS CHOSEN          01620000
*                             WHEN THE SETFRR WAS ISSUED      @ZMB0248  01630000
FRRSEUT  EQU    X'80'         ENABLED UNLOCKED TASK FRR (EUT=YES ON     01640000
*                             SETFRR)                         @G381P2F  01650000
FRRSNCNL EQU    X'40'         CANCEL=NO REQUESTED, ROUTINE RUNS        *01660000
                              PROTECTED FROM CANCELS AND DETACHES  @D1A 01670000
FRRSLO31 EQU    X'20'         THIS FRR CAN TOLERATE AN SDWA             01671001
*                             ABOVE THE 16M LINE                   @P5A 01672001
FRRSAM64 EQU    X'10'         AMODE 64 FRR                         @L5A 01680000
FRRSFULL EQU    X'08'         MODE=FULLXM WAS SPEC ON SETFRR  @G381P2F  01690000
FRRSPRIM EQU    X'04'         MODE=PRIMARY SPEC ON SETFRR     @G381P2F  01700000
FRRSLCL  EQU    X'02'         MODE=LOCAL WAS SPEC ON SETFRR   @G381P2F  01710000
FRRSGLB  EQU    X'01'         MODE=GLOBAL WAS SPEC ON SETFRR  @G381P2F  01720000
FRRSPARM DS     CL24          PARAMETER AREA PASSED TO FRR              01730000
FRRSXENT DSECT  ,FRRXPTR      THE MAPPING OF AN FRR ENTRY EXTENSION     01740000
*                                                             @G381P2F  01750000
         DS     D             RESERVED                            @P4A  01760000
FRREAX   DS     A             EAX VALUE AT SETFRR                 @L3A  01770000
FRRLS    DS     A             LINKAGE STACK AT SETFRR             @L3A  01780000
FRRSXM   DS     0CL16         CROSS MEMORY INFORMATION WHEN SETFRR      01790000
*                             WAS ISSUED                          @L4C  01800000
FRRSCR3  DS     0CL8          CONTROL REGISTER 3                  @L4C  01810000
FRRSSINS DS    F              SASTE INSTANCE#                     @L4A  01820000
FRRSKM   DS     CL2           KEY MASK                        @G381P2F  01830000
FRRSSAS  DS     CL2           SASID                           @G381P2F  01840000
FRRSCR4  DS     0CL8          CONTROL REGISTER 4                  @L4C  01850000
FRRSPINS DS    F              PASTE INSTANCE#                     @L4A  01860000
FRRSAX   DS     CL2           AUTHORIZATION INDEX             @G381P2F  01870000
FRRSPAS  DS     CL2           PASID                           @G381P2F  01880000
         MEND         */                                                01890000
*%FRRSPLS: ;                                                            01900000
* DCL FRRSESZE FIXED(31) CONSTANT(LENGTH(FRRSENTR)); /*                 01910000
*                                         LENGTH OF EACH FRR ENTRY   */ 01920000
* DCL FRRSEXSZ FIXED(31) CONSTANT(LENGTH(FRRSXENT)); /*                 01930000
*                                          LENGTH OF EACH FRR EXTENSION 01940000
*                                                                @L4C*/ 01950000
* DCL FRRSNENT FIXED(31) CONSTANT(16); /* NUMBER OF FRR ENTRIES IN      01960000
*                                         THE STACK          @ZM02352*/ 01970000
*DECLARE                                                                01980000
*  1 FRRS    BASED(FRRSPTR),                                            01990000
*    2 FRRSND     CHAR(88)  BDY(WORD), /* NON-DYNAMIC PART OF THE       02000000
*                                         FRR STACK              @L3C*/ 02010000
*      3 FRRSHEAD   CHAR(16) BDY(WORD),/* THE HEADER OF THE FRR         02020000
*                                         STACK                      */ 02030000
*        4 FRRSEMP     PTR(31),        /* ADDRESS WHICH INDICATES AN    02040000
*                                         EMPTY  STACK               */ 02050000
*        4 FRRSLAST    PTR(31),        /* ADDRESS OF LAST ENTRY IN      02060000
*                                         STACK                      */ 02070000
*        4 FRRSELEN   FIXED(31),       /* LENGTH OF EACH ENTRY IN       02080000
*                                         THE STACK                  */ 02090000
*        4 FRRSCURR    PTR(31),        /* ADDRESS OF CURRENT FRR        02100000
*                                         ENTRY IN THE STACK         */ 02110000
*      3 FRRSCPY1,                     /* COPIED BY FRRSCOPY     @P3A*/ 02120000
*        5 FRRSRSA   CHAR(24),         /* SETFRR REG 14-3 SAVE AREA     02130000
*                                                            @G381P2F*/ 02140000
*        5 FRRSRTMW CHAR(4) BDY(WORD), /* RECURSION CONTROL DATA        02150000
*                                          REMOVED FROM THE RT1W @L1C*/ 02160000
*        5 FRRSENTL FIXED(16),          /* RESERVED FOR FRRSCOPY MACRO  02170000
*                                          TO SAVE LENGTH OF ENTRIES    02180000
*                                          ACTUALLY COPIED       @L1A*/ 02190000
*        5 FRRSEXTL FIXED(16),          /* RESERVED FOR FRRSCOPY MACRO  02200000
*                                          TO SAVE LENGTH OF EXTENSIONS 02210000
*                                          ACTUALLY COPIED       @L1A*/ 02220000
*      3 *         CHAR(8),             /* RESERVED              @L1A*/ 02230000
*      3 FRRSRTMA  PTR(31),            /* ADDRESS OF RTM1 WORK AREA     02240000
*                                                                @L1A*/ 02250000
*      3 FRRSXSTA  PTR(31),            /* ADDRESS OF THE EXTENSIONS TO  02260000
*                                         THE FRR ENTRIES               02270000
*                                         (ACTUAL SIZE IS 16 TIMES THE  02280000
*                                         MAXIMUM NUMBER OF ENTRIES)    02290000
*                                                                @L1A*/ 02300000
*      3 FRRSCPY2,                     /* COPIED BY FRRSCOPY     @P3A*/ 02310000
*        5 FRRSASA   CHAR(24),         /* SETFRR ACCESS REGISTER        02320000
*                                         14-3 SAVE AREA         @L3A*/ 02330000
*    2 FRRSENTS    CHAR(FRRSNENT*FRRSESZE); /* THE FRR ENTRIES IN       02340000
*                                         THE STACK              @L1C*/ 02350000
*DECLARE                                                                02360000
*  FRRSXSTK CHAR(FRRSNENT*FRRSEXSZ) BASED(FRRSXSTA); /* FRR EXTENSIONS  02370000
*                                                                @L1A*/ 02380000
*DECLARE                                                                02390000
*  1 FRRSENTR    BASED(FRREPTR),       /* THE MAPPING OF A FRR          02400000
*                                         ENTRY                      */ 02410000
*    2 FRRSFRRA    PTR(31),            /* THE ADDRESS OF THE FRR     */ 02420000
*      3 *         CHAR(3),                               /* @G381P2F*/ 02430000
*      3 FRRSFRA1  CHAR(1),            /* LOW ORDER BYTE     @G381P2F*/ 02440000
*        4 *         BIT(7),                              /* @G381P2F*/ 02450000
*        4 FRRSXFLG  BIT(1),           /* FLAG INDICATING FRRSFLGS      02460000
*                                         INITIALIZED WHEN SETFRR WAS   02470000
*                                         ISSUED             @G381P2F*/ 02480000
*    2 FRRSFLGS    CHAR(4),            /* FLAGS USED BY RTM DURING      02490000
*                                         FRR PROCESSING             */ 02500000
*      3 FRRSFLG1  CHAR(1),            /* RECURSION USED BY RTM      */ 02510000
*        4 FRRSRCUR  BIT(1),           /* RECURSION FLAG USED WHEN      02520000
*                                         GIVING CONTROL TO FRR         02530000
*                                         AND WHEN RECEIVING CONTROL    02540000
*                                         BACK FROM FRR              */ 02550000
*        4 FRRSNEST  BIT(1),           /* FLAG INDICATING A NESTED      02560000
*                                         FRR ENTRY                  */ 02570000
*        4 FRRSNLCL  BIT(1),           /* FLAG INDICATING THAT NESTED   02580000
*                                         FRR IS A MODE=LOCAL FRR       02590000
*                                                            @G382PPY*/ 02600000
*        4 FRRSNGLB  BIT(1),           /* FLAG INDICATING THAT NESTED   02610000
*                                         FRR IS A MODE=GLOBAL FRR      02620000
*                                                            @G382PPY*/ 02630000
*        4 FRRSNRTY  BIT(1),           /* FRR RETRY INDICATOR. IF ON,   02640000
*                                         FRR CANNOT RETRY.      @L2C*/ 02650000
*      3 FRRSFLG2  CHAR(1),            /* RESERVED           @ZMB0248*/ 02660000
*      3 FRRSFLG3  CHAR(1),            /* RESULT OF IAC INSTRUCTION     02670000
*                                         FROM TIME OF SETFRR    @L3A*/ 02680000
*        4 * BIT(6),                   /*                        @L3A*/ 02690000
*        4 FRRSASC BIT(2),             /* ASC FLAGS              @L3A*/ 02700000
*      3 FRRSFLG4  CHAR(1),            /* FLAGS TO INDICATE OPTIONS     02710000
*                                         CHOSEN WHEN THE SETFRR WAS    02720000
*                                         ISSUED             @ZMB0248*/ 02730000
*        4 FRRSEUT   BIT(1),           /* ENABLED UNLOCKED TASK FRR     02740000
*                                        (EUT=YES ON SETFRR) @G381P2F*/ 02750000
*        4 FRRSNCNL  BIT(1),           /* CANCEL=NO FRR, PROTECTED      02760000
*                                         FROM CANCELS, DETACHES @D1A*/ 02770000
*        4 FRRSLO31  BIT(1),           /* THIS FRR CAN TOLERATE AN SDWA 02780001
*                                         ABOVE THE 16M LINE     @P5A*/ 02781001
*        4 FRRSAM64  BIT(1),           /* AMODE 64 FRR           @L5A*/ 02790000
*        4 FRRSFULL  BIT(1),           /* MODE=FULLXM WAS SPEC ON THE   02800000
*                                         SETFRR             @G381P2F*/ 02810000
*        4 FRRSPRIM  BIT(1),           /* MODE=PRIMARY WAS SPEC ON      02820000
*                                         THE SETFRR         @G381P2F*/ 02830000
*        4 FRRSLCL   BIT(1),           /* MODE=LOCAL WAS SPEC ON THE    02840000
*                                         SETFRR             @G381P2F*/ 02850000
*        4 FRRSGLB   BIT(1),           /* MODE=GLOBAL WAS SPEC ON THE   02860000
*                                         SETFRR             @G381P2F*/ 02870000
*    2 FRRSPARM     CHAR(24);          /* PARAMETER AREA PASSED TO      02880000
*                                         FRR                        */ 02890000
*    DCL FRRSCP1P CHAR(LENGTH(FRRSCPY1)+LENGTH(FRRSCURR))               02900000
*                 DEF(FRRSCURR);       /* COPIED BY FRRSCOPY WHEN       02910000
*                                         "PLUS1"                @P3A*/ 02920000
*DECLARE                                                                02930000
*  1 FRRSXENT    BASED,                /* THE MAPPING OF AN FRR         02940000
*                                         ENTRY EXTENSION    @G381P2F*/ 02950000
*    2 * CHAR(8),                      /* RESERVED               @L4C*/ 02960000
*    2 FRREAX PTR(31),                 /* EAX VALUE AT SETFRR    @L3A*/ 02970000
*    2 FRRLS PTR(31),                  /*LINKAGE STACK AT SETFRR @L3A*/ 02980000
*    2 FRRSXM     CHAR(16) BDY(DWORD), /* CROSS MEMORY INFO WHEN        02990000
*                                         SETFRR WAS ISSUED      @L4C*/ 03000000
*      3 FRRSCR3     CHAR(8),          /* CONTROL REGISTER 3 WHEN       03010000
*                                         SETFRR WAS ISSUED      @L4C*/ 03020000
*        4 * CHAR(4),                  /* HIGH HALF OF CR3       @L4C*/ 03030000
*        4 FRRSKM    CHAR(2),          /* KEY MASK           @G381P2F*/ 03040000
*        4 FRRSSAS   CHAR(2),          /* SASID              @G381P2F*/ 03050000
*      3 FRRSCR4     CHAR(8),          /* CONTROL REGISTER 4 WHEN       03060000
*                                         SETFRR WAS ISSUED      @L4C*/ 03070000
*        4 * CHAR(4),                  /* HIGH HALF OF CR4       @L4C*/ 03080000
*        4 FRRSAX    CHAR(2),          /*AUTHORIZATION INDEX @G381P2F*/ 03090000
*        4 FRRSPAS   CHAR(2);          /* PASID                  @L3C*/ 03100000
