*                                                                       00001000
* %DCL IHAFPRET_INCLUDED CHAR EXT;                                      00002000
* %DEACTIVATE IHAFPRET_INCLUDED;                                        00003000
* %IF IHAFPRET_INCLUDED = '' %THEN                                      00004000
* %DO;                                                                  00005000
*/* Macro made bi-lingual on 14206. CBGEN compile date 12258         */ 00006000
*% /*                                                                   00007000
         MACRO                                                          00008000
         IHAFPRET &DSECT=YES,&LIST=YES,&TITLE=YES                       00009000
         GBLC  &IHAFPRET_INCLUDED                                       00010000
         GBLC  &ZCBPRINT                                                00011000
&IHAFPRET_INCLUDED SETC 'YES'                                           00012000
         AIF   ('&LIST' EQ 'NONE').P0                                   00013000
         AIF   ('&TITLE' EQ 'NO').P5                                    00014000
 TITLE   'IHAFPRET  - IEAFP Return Information                       '  00015000
.P5      ANOP                                                           00016000
**/ IHAFPRET_1:;                                                        00017000
*/* START OF SPECIFICATIONS ******************************************* 00018000
*                                                                       00019000
*  **PROPRIETARY_STATEMENT********************************************  00020000
***01* PROPRIETARY STATEMENT=                                        *  00021000
*                                                                    *  00022000
*                                                                    *  00023000
*   LICENSED MATERIALS - PROPERTY OF IBM                             *  00024000
*   5650-ZOS COPYRIGHT IBM CORP. 1998, 2013                          *  00025000
*                                                                    *  00026000
*   STATUS= HBB7790                                                  *  00027000
*                                                                    *  00028000
*  **END_OF_PROPRIETARY_STATEMENT*************************************  00029000
*                                                                       00030000
*01* DESCRIPTIVE NAME:  IEAFP Return Information                        00031000
*02*  ACRONYM:  FPRET                                                   00032000
*                                                                       00033000
*01* MACRO NAME:  IHAFPRET                                              00034000
*                                                                       00035000
*01* EXTERNAL CLASSIFICATION: GUPI                                      00036000
*01* END OF EXTERNAL CLASSIFICATION:                                    00037000
*                                                                       00038000
*01* DSECT NAME:                                                        00039000
*     NONE                                                              00040000
*                                                                       00041000
*01* COMPONENT:  Supervisor Control (SC1C5)                             00042000
*                                                                       00043000
*01* EYE-CATCHER:  NONE                                                 00044000
*                                                                       00045000
*01* STORAGE ATTRIBUTES:                                                00046000
*02*  SUBPOOL:  N/A                                                     00047000
*02*  KEY:  N/A                                                         00048000
*02*  RESIDENCY:  N/A                                                   00049000
*                                                                       00050000
*01* SIZE:  N/A                                                         00051000
*                                                                       00052000
*01* CONTROL BLOCK CHANGES:                                             00053000
*02*  IHAFPRET                                                          00054000
*02*   6.0.6                                                            00055000
*03*    New                                                             00056000
*03*    Migration Considerations: NONE                                  00057000
*01* END CONTROL BLOCK CHANGES                                          00058000
*                                                                       00059000
*01* CREATED BY:                                                        00060000
*     N/A                                                               00061000
*                                                                       00062000
*01* POINTED TO BY:                                                     00063000
*     N/A                                                               00064000
*                                                                       00065000
*01* SERIALIZATION:                                                     00066000
*     None required                                                     00067000
*                                                                       00068000
*01* FUNCTION:                                                          00069000
*02* Equates for IEAFP return and reason codes                          00070000
*                                                                       00071000
*01* METHOD OF ACCESS:                                                  00072000
*02*  ASM:                                                              00073000
*      IHAFPRET                                                         00074000
*                                                                       00075000
*02*  PL/AS:                                                            00076000
*      %INCLUDE SYSLIB(IHAFPRET)                                        00077000
*                                                                       00078000
*01* DELETED BY:  N/A                                                   00079000
*                                                                       00080000
*01* FREQUENCY:  N/A                                                    00081000
*                                                                       00082000
*01* DEPENDENCIES:  None                                                00083000
*                                                                       00084000
*01* DISTRIBUTION LIBRARY:  AMACLIB                                     00085000
*                                                                       00086000
*01* CHANGE ACTIVITY:                                                   00087000
*   $L0=IEEECBG  ,HBB6606,970825,PD00XB: IEEE FP                        00088000
*   $L1=IEEESUP  ,HBB6606,970825,PD00XB: IEEE FP                        00089000
*   $L2=OA43704  ,HBB7790,140601,PD00XB: IEAFP START                    00090000
*                                                                       00091000
* END OF SPECIFICATIONS *********************************************/  00092000
*% /*                                                                   00093000
.P0      ANOP                                                           00094000
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 00095000
         AIF   ('&LIST' EQ 'YES').P2                                    00096000
.P1      ANOP                                                           00097000
         PUSH  PRINT                                                    00098000
         PRINT OFF                                                      00099000
.P2      ANOP                                                           00100000
*                                                                       00101000
*    *****************************************************************  00102000
*    *                                                               *  00103000
*    * Return Code Information It is guaranteed that no reason code  *  00104000
*    * will be reused (i.e., the same reason code will not be used   *  00105000
*    * for more than one return code). Also note carefully that bits *  00106000
*    * 0-15 of the reason code may contain component-diagnostic data *  00107000
*    * and must not be assumed to be 0.                              *  00108000
*    *                                                               *  00109000
*    *****************************************************************  00110000
*                                                                       00111000
*                                                                       00112000
IEAFPRSNCODEMASK EQU X'0000FFFF' Use this mask to isolate the non      *00113000
                         component-diagnostic portion of the reason    *00114000
                         code.                                          00115000
*                                                                       00116000
*   IEAFP Return and Reason Code definitions                            00117000
*                                                                       00118000
*                                                                       00119000
IEAFPRC_OK EQU X'00000000' Meaning: IEAFP request successful. Action:  *00120000
                         None required.                                 00121000
IEAFPRC_INVPARM EQU X'00000008' Meaning: IEAFP request specifies       *00122000
                         parmeters that are not valid. Action: Refer   *00123000
                         to the action provided with the specific      *00124000
                         reason code.                                   00125000
IEAFPRSNBADFUNCTION EQU X'00000801' Meaning: Incorrect value passed to *00126000
                         target routine. Action: Check for possible    *00127000
                         storage overlay.                               00128000
IEAFPRC_ENV EQU X'0000000C' Meaning: Environmental error Action: Refer *00129000
                         to the action provided with the specific      *00130000
                         reason code.                                   00131000
IEAFPRSNFROMASYNCHEXIT EQU X'00000C01' Meaning: IEAFP was issued from  *00132000
                         an asynchronous exit routine. Action: Avoid   *00133000
                         issuing IEAFP from an asynchronous exit       *00134000
                         routine.                                       00135000
IEAFPRSNFROMNONPREEMPTIBLESRB EQU X'00000C02' Meaning: IEAFP START was *00136000
                         issued from an SRB that was a non-preemptible *00137000
                         SRB. Action: Avoid issuing IEAFP from a       *00138000
                         non-preemptible SRB.                           00139000
IEAFPRSNFROMNOTBITCB EQU X'00000C03' Meaning: IEAFP START was issued   *00140000
                         from a task that was not the jobstep program  *00141000
                         task nor a subtask of that task. Action: When *00142000
                         using IEAFP START from a task, do so only     *00143000
                         from the jobstep program task or a subtask of *00144000
                         that task.                                     00145000
IEAFPRSNLOCKED EQU X'00000C04' Meaning: IEAFP START was issued when    *00146000
                         holding a lock other than the LOCAL lock.     *00147000
                         Action: Avoid using IEAFP START when holding  *00148000
                         a lock other than the LOCAL lock.              00149000
IEAFPRSNNOSTORAGE EQU X'00000C05' Meaning: Necessary system storage    *00150000
                         could not be obtained. For a task mode        *00151000
                         request, it is LSQA storage. For an SRB mode  *00152000
                         request, it is ESQA storage. Action: If       *00153000
                         issued in task mode, use IEAFP START at an    *00154000
                         earlier time in the jobstep. If issued in SRB *00155000
                         mode, arrange for some current user of ESQA   *00156000
                         storage to release it or run this after a     *00157000
                         re-IPL after ensuring additional ESQA storage *00158000
                         availability for that IPL.                     00159000
IEAFPRSNSUPERBIT EQU X'00000C06' Meaning: IEAFP START was issued from  *00160000
                         a work unit with at least one bit on in the   *00161000
                         PSASUPER word. A DIE is one such kind of work *00162000
                         unit. Action: Avoid issuing IEAFP from a DIE  *00163000
                         or any other work unit running with PSASUPER  *00164000
                         on.                                            00165000
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 00166000
         AIF   ('&LIST' EQ 'YES').P4                                    00167000
.P3      ANOP                                                           00168000
         POP   PRINT                                                    00169000
.P4      ANOP                                                           00170000
.P_EXIT  ANOP                                                           00171000
         MEND                                                           00172000
**/ IHAFPRET_2:;                                                        00173000
* %IHAFPRET_INCLUDED = 'YES';                                           00174000
* %DCL ZCBPRINT CHAR EXT;                                               00175000
* %DEACTIVATE ZCBPRINT;                                                 00176000
* %DCL IHAFPRET_LIST CHAR EXT;                                          00177000
* %DEACTIVATE IHAFPRET_LIST;                                            00178000
* %IF IHAFPRET_LIST ^= 'NO' &                                           00179000
*    ZCBPRINT ^= 'NO' %THEN                                             00180000
*   %GOTO IHAFPRET_3;                                                   00181000
*   @LIST PUSH NOECHO;                                                  00182000
*   @LIST NOASSEMBLE NOECHO;                                            00183000
*   @LIST OFF C NOECHO;                                                 00184000
* %IHAFPRET_3:;                                                         00185000
*/* Start of PL/X Source                                             */ 00186000
*                                                                       00187000
*    /* Return Code Information                                      */ 00188000
*                                                                       00189000
*    /* It is guaranteed that                                           00190000
*       no reason code will be reused (i.e., the same reason code       00191000
*       will not be used for more than one return code).            */  00192000
*                                                                       00193000
*    /* Also note carefully that bits 0-15 of the reason code           00194000
*       may contain component-diagnostic data and must not be           00195000
*       assumed to be 0.                                            */  00196000
*                                                                       00197000
*Dcl IeafpRsnCodeMask Bit(32) Constant('0000FFFF'X); /* Use this        00198000
*               mask to isolate the non component-diagnostic            00199000
*               portion of the reason code.                      @L1A*/ 00200000
*/* IEAFP Return and Reason Code definitions                         */ 00201000
*DCL IeafpRc_OK Bit(32) Constant('00000000'X) ; /*                      00202000
*                        Meaning: IEAFP request successful.             00203000
*                        Action: None required.                      */ 00204000
*DCL IeafpRc_InvParm Bit(32) Constant('00000008'X) ; /*                 00205000
*                        Meaning: IEAFP request specifies parmeters     00206000
*                        that are not valid.                            00207000
*                        Action: Refer to the action provided with the  00208000
*                        specific reason code.                       */ 00209000
*DCL IeafpRsnBadFunction Bit(32) Constant('00000801'X) ; /*             00210000
*                        Meaning: Incorrect value passed to target      00211000
*                        routine.                                       00212000
*                        Action: Check for possible storage overlay. */ 00213000
*DCL IeafpRc_Env Bit(32) Constant('0000000C'X) ; /*                     00214000
*                        Meaning: Environmental error                   00215000
*                        Action: Refer to the action provided with the  00216000
*                        specific reason code.                       */ 00217000
*DCL IeafpRsnFromAsynchExit Bit(32) Constant('00000C01'X) ; /*          00218000
*                        Meaning: IEAFP was issued from an asynchronous 00219000
*                        exit routine.                                  00220000
*                        Action: Avoid issuing IEAFP from an            00221000
*                        asynchronous exit routine.                  */ 00222000
*DCL IeafpRsnFromNonPreemptibleSRB Bit(32) Constant('00000C02'X) ; /*   00223000
*                        Meaning: IEAFP START was issued from an SRB    00224000
*                        that was a non-preemptible SRB.                00225000
*                        Action: Avoid issuing IEAFP from a             00226000
*                        non-preemptible SRB.                    @L2A*/ 00227000
*DCL IeafpRsnFromNotBITCB Bit(32) Constant('00000C03'X) ; /*            00228000
*                        Meaning: IEAFP START was issued from a task    00229000
*                        that was not the jobstep program task nor a    00230000
*                        subtask of that task.                          00231000
*                        Action: When using IEAFP START from a task, do 00232000
*                        so only from the jobstep program task or a     00233000
*                        subtask of that task.                   @L2A*/ 00234000
*DCL IeafpRsnLocked Bit(32) Constant('00000C04'X) ; /*                  00235000
*                        Meaning: IEAFP START was issued when holding a 00236000
*                        lock other than the LOCAL lock.                00237000
*                        Action: Avoid using IEAFP START when holding a 00238000
*                        lock other than the LOCAL lock.         @L2A*/ 00239000
*DCL IeafpRsnNoStorage Bit(32) Constant('00000C05'X) ; /*               00240000
*                        Meaning: Necessary system storage could not be 00241000
*                        obtained. For a task mode request, it is LSQA  00242000
*                        storage. For an SRB mode request, it is ESQA   00243000
*                        storage.                                       00244000
*                        Action: If issued in task mode, use IEAFP      00245000
*                        START at an earlier time in the jobstep. If    00246000
*                        issued in SRB mode, arrange for some current   00247000
*                        user of ESQA storage to release it or run this 00248000
*                        after a re-IPL after ensuring additional ESQA  00249000
*                        storage availability for that IPL.      @L2A*/ 00250000
*DCL IeafpRsnSuperBit Bit(32) Constant('00000C06'X) ; /*                00251000
*                        Meaning: IEAFP START was issued from a work    00252000
*                        unit with at least one bit on in the PSASUPER  00253000
*                        word. A DIE is one such kind of work unit.     00254000
*                        Action: Avoid issuing IEAFP from a DIE or any  00255000
*                        other work unit running with PSASUPER on.      00256000
*                                                                @L2A*/ 00257000
*/* End of IEAFP Return and Reason Code definitions                  */ 00258000
*/* End of PL/X Source                                               */ 00259000
* %IF IHAFPRET_LIST ^= 'NO' &                                           00260000
*    ZCBPRINT ^= 'NO' %THEN                                             00261000
*   %GOTO IHAFPRET_4;                                                   00262000
*   @LIST POP NOECHO;                                                   00263000
* %IHAFPRET_4:;                                                         00264000
* %END;                                                                 00265000
