*%       GOTO FRRSOPLS1; /*                                             00050000
         MACRO                                                          00100000
         IHAFRRSO &DSECT=YES                                         */ 00150000
*%FRRSOPLS1 : ;                                                         00200000
*/** START OF SPECIFICATIONS *****************************************/ 00250000
*/*                                                                  */ 00300000
*/* MACRO NAME:  IHAFRRSO                                            */ 00350000
*/*                                                                  */ 00400000
*/* DESCRIPTIVE NAME:  OLD IHAFRRS                                   */ 00450000
*/*                                                                  */ 00500000
*/* PROPRIETARY STATEMENT:                                           */ 00550000
*/*            5694-A01                                              */ 00600000
*/*            LICENSED MATERIALS - PROPERTY OF IBM                  */ 00650000
*/*            (C) COPYRIGHT IBM CORP. 2004                          */ 00700000
*/*                                                                  */ 00750000
*/* STATUS = HBB7709                                                 */ 00800000
*/*                                                                  */ 00850000
*/* EXTERNAL CLASSIFICATION: NOTPI                                   */ 00900000
*/* END OF EXTERNAL CLASSIFICATION:                                  */ 01150000
*/*                                                                  */ 01200000
*/* DSECT NAME: FRRSO, FRRSOXSTK, FRRSOENTR, FRRSOXENT               */ 01250000
*/*                                                                  */ 01300000
*/* COMPONENT: RECOVERY TERMINATION MANAGER (SCRTM)                  */ 01350000
*/*                                                                  */ 01400000
*/* EYE CATCHER: NONE                                                */ 01450000
*/*                                                                  */ 01500000
*/* STORAGE ATTRIBUTES:                                              */ 01550000
*/*  SUBPOOL:  239                                                   */ 01600000
*/*  KEY:  0                                                         */ 01650000
*/*                                                                  */ 01700000
*/* SIZE: 856 BYTES OR LESS                                          */ 01750000
*/*                                                                  */ 01800000
*/* CREATED BY: IEAVNIP0 OR IEFVCPU                                  */ 01850000
*/*                                                                  */ 01900000
*/* POINTED TO BY:                                                   */ 01950000
*/*                                                                  */ 02000000
*/*   PSA DATA AREA FIELDS -                                         */ 02050000
*/*     PSACSTK  (CURRENT FRR STACK)                                 */ 02100000
*/*     PSANSTK  (NORMAL FRR STACK)                                  */ 02150000
*/*     PSASSTK  (SVC-I/O-DISPATCHER FRR STACK)                      */ 02200000
*/*     PSASSAV  (CURRENT FRR STACK SAVED BY SVC-I/O-DISPATCHER)     */ 02250000
*/*     PSAMSTK  (MACHINE CHECK FLIH FRR STACK)                      */ 02300000
*/*     PSAMSAV  (CURRENT FRR STACK AT TIME OF MACHINE CHECK)        */ 02350000
*/*     PSAPSTAK (PROGRAM CHECK FLIH FRR STACK)                      */ 02400000
*/*     PSAPSAV  (CURRENT FRR STACK AT TIME OF PROGRAM CHECK)        */ 02450000
*/*     PSAESTK1 (EXTERNAL FLIH1 FRR STACK)                          */ 02500000
*/*     PSAESAV1 (CURRENT FRR STACK AT TIME OF EXTERNAL INTERRUPT)   */ 02550000
*/*     PSAESTK2 (EXTERNAL FLIH2 FRR STACK)                          */ 02600000
*/*     PSAESAV2 (CURRENT FRR STACK AT TIME OF FIRST RECURSIVE       */ 02650000
*/*               EXTERNAL INTERRUPT)                                */ 02700000
*/*     PSAESTK3 (EXTERNAL FLIH3 FRR STACK)                          */ 02750000
*/*     PSAESAV3 (CURRENT FRR STACK AT TIME OF SECOND RECURSIVE      */ 02800000
*/*               EXTERNAL INTERRUPT)                                */ 02850000
*/*     PSARSTK  (RESTART FLIH FRR STACK)                            */ 02900000
*/*     PSARSAV  (CURRENT FRR STACK AT TIME OF RESTART INTERRUPT)    */ 02950000
*/*     PSATSTK  (RECOVERY TERMINATION MANAGER FRR STACK)            */ 03000000
*/*     PSATSAV  (ERROR STACK SAVED BY RTM PROCESSING)               */ 03050000
*/*     PSAASTK  (ALTERNATE CPU RECOVERY FRR STACK)                  */ 03100000
*/*     PSAASAV  (FRR STACK SAVED BY ACR PROCESSING)                 */ 03150000
*/*                                                                  */ 03200000
*/* SERIALIZATION:                                                   */ 03250000
*/*                                                                  */ 03300000
*/*     AT LEAST ONE OF THE FOLLOWING -                              */ 03350000
*/*                                                                  */ 03400000
*/*     DISABLEMENT, SRB MODE, ANY LOCK HELD, OR AN EUT=YES FRR      */ 03450000
*/*     IS ESTABLISHED AND HAS NOT BEEN DELETED                      */ 03500000
*/*                                                                  */ 03550000
*/* FUNCTION: MAPPING OF FRR STACK CONTENTS, USED WITH THE SETFRR    */ 03600000
*/*           MACRO TO DEFINE FRRSO                                  */ 03650000
*/*                                                                  */ 03700000
*/* METHOD OF ACCESS:                                                */ 03750000
*/* --BAL--                                                          */ 03800000
*/*             IHAFRRSO                                             */ 03850000
*/* NOTE -                                                           */ 03900000
*/*     TO OBTAIN ADDRESSABILITY TO THE FRRSOXSTK CODE               */ 03950000
*/*            L     REG,FRRSOXSTA                                   */ 04000000
*/*            USING FRRSOXSTK,REG                                   */ 04050000
*/*                                                                  */ 04100000
*/* --PLS--                                                          */ 04150000
*/*             DCL FRRSOPTR PTR                                     */ 04200000
*/*             %INCLUDE SYSLIB(IHAFRRSO)                            */ 04250000
*/*                                                                  */ 04300000
*/* CHANGE ACTIVITY =                                                */ 04350000
*/*     MVS/SYSTEM PRODUCT RELEASE 2 - ADDED A 24 BYTE SAVE          */ 04400000
*/*               AREA, ENLARGED THE RTM1 WORK AREA, ADDED AN        */ 04450000
*/*               EXTENSION FOR EACH ENTRY FOR CROSS MEMORY          */ 04500000
*/*               INFORMATION, AND ADDED FLAGS IN THE SECOND WORD    */ 04550000
*/*               OF EACH ENTRY.                                     */ 04600000
*/*     MVS/SYSTEM PRODUCT VERSION 2 RELEASE 1               @G860P1S*/ 04650000
*/*  $L1=RASENH  ,JBB2220,840627,PDFO: FRR STACK RESTRUCTURE     @L1A*/ 04700000
*/*  $L2=RASENH  ,JBB2220,841116,PDPY: NESTED FRR RETRY          @L2A*/ 04750000
*/*  $L3=AR      ,HBB3310,850917,PDPY: ACCESS REGISTER SUPPORT   @L3A*/ 04800000
*/*  $D1=DCR0059 ,HBB3310,861029,PDU8: SUPPORT FOR DEFERRED CANCEL/  */ 04850000
*/*                                    DETACH PROCESSING         @D1A*/ 04900000
*/*  $P1=PR20011  HBB6601 950908 PDKD: SC1CM COMPID SPLIT - ALSO     */ 04950000
*/*                                    REWROTE PROLOG FOR SHOWHDR    */ 05000000
*/*  $P2=PR20013  HBB6601 950913 PDKD: INDICATE GUPI INCLUDE     @P2A*/ 05050000
*/*  $L4=LXREU    HBB7709 030801 PDXB: ASN-AND-LX-REUSE FACILITY     */ 05100000
*/** END OF SPECIFICATIONS *******************************************/ 05150000
*%       GOTO FRRSOPLS; /*                                              05200000
         AIF ('&DSECT' EQ 'YES').FRRSO001                               05250000
FRRSO    DS   0D -                                                      05300000
         AGO  .FRRSO002                                                 05350000
.FRRSO001 ANOP                                                          05400000
FRRSOESZE EQU   32            LENGTH OF EACH FRR ENTRY                  05450000
FRRSOEXSZ EQU   16            LENGTH OF EACH FRR EXTENSION        @L3C  05500000
FRRSONENT EQU   16            NUMBER OF FRR ENTRIES IN STACK  @ZM02352  05550000
FRRSOTLEN EQU   856           TOTAL LENGTH OF NORMAL FRR STACK    @L3C  05600000
FRRSO    DSECT ,       FRRSOPTR                                         05650000
.FRRSO002 SPACE 2                                                       05700000
FRRSOND  DS     0CL88         NON-DYNAMIC PART OF FRRSO           @L3C  05750000
FRRSOHEAD DS    0CL16         THE HEADER OF THE FRR STACK               05800000
FRRSOEMP DS     A             ADDRESS WHICH INDICATES AN EMPTY STACK    05850000
FRRSOLAST DS    A             ADDRESS OF LAST ENTRY IN THE STACK        05900000
FRRSOELEN DS    F             LENGTH OF EACH FRR ENTRY IN THE STACK     05950000
FRRSOCURR DS    A             ADDRESS OF CURRENT FRR ENTRY IN THE STACK 06000000
FRRSORSA DS     CL24          SETFRR REG 14-3 SAVE AREA       @G381P2F  06050000
FRRSORTMW DS    CL4           RECURSION CONTROL DATA REMOVED FROM THE  X06100000
                              RT1W                                @L1C  06150000
FRRSOENTL DS    H             LENGTH OF ENTRIES FOR FRRSOCOPY     @L1A  06200000
FRRSOEXTL DS    H             LENGTH OF EXTENSIONS FOR FRRSOCOPY  @L1A  06250000
         DS     CL8           RESERVED FOR FUTURE USE             @L1A  06300000
FRRSORTMA DS    A             RTM1 WORK AREA ADDRESS              @L1A  06350000
FRRSOXSTA DS    A             ADDRESS OF THE EXTENSIONS TO THE FRR      06400000
*                             ENTRIES (ACTUAL SIZE IS 16 TIME THE       06450000
*                             MAXIMUM NUMBER OF ENTRIES           @L1A  06500000
FRRSOASA DS     CL24          SETFRR AR 14-3 SAVE AREA            @L3A  06550000
FRRSOENTS DS    CL(FRRSONENT*FRRSOESZE) FRR ENTRIES IN STACK      @L1C  06600000
FRRSOXSTK DSECT    ,  FRRSOXSTA THE FRR EXTENSIONS                @L1A  06650000
         DS     CL(FRRSONENT*FRRSOEXSZ) ACTUAL SIZE               @L1A  06700000
FRRSOENTR DSECT    ,  FRROEPTR THE MAPPING OF A FRR ENTRY               06750000
FRRSOFRRA DS    0A            THE ADDRESS OF THE FRR                    06800000
         DS     CL3           HIGH ORDER 3 BYTES OF FRR ADDR  @G381P2F  06850000
FRRSOFRA1 DS    CL1           LOW ORDER BYTE OF FRR ADDRESS   @G381P2F  06900000
FRRSOXFLG EQU   X'01'         FLAG INDICATING FRRSOFLGS INITIALIZED     06950000
*                             WHEN SETFRR WAS ISSUED          @G381P2F  07000000
FRRSOFLGS DS    0CL4          FLAGS USED BY RTM DURING FRR PROCESSING   07050000
FRRSOFLG1 DS    B             RECURSION FLAGS USED BY RTM               07100000
FRRSORCUR EQU   X'80'         RECURSION FLAG USED WHEN GIVING CONTROL   07150000
*                             TO FRR AND WHEN RECEIVING CONTROL BACK    07200000
*                             FROM FRR                                  07250000
FRRSONEST EQU   X'40'         FLAG INDICATING A NESTED FRR ENTRY        07300000
FRRSONLCL EQU   X'20'         FLAG INDICATING THAT NESTED FRR IS A     *07350000
                              MODE=LOCAL FRR                  @G382PPY  07400000
FRRSONGLB EQU   X'10'         FLAG INDICATING THAT NESTED FRR IS A     *07450000
                              MODE=GLOBAL FRR                 @G382PPY  07500000
FRRSONRTY EQU   X'08'         FRR RETRY INDICATOR. IF ON, FRR CANNOT   *07550000
                              RETRY                               @L2C  07600000
FRRSOFLG2 DS    B             RESERVED                        @ZMB0248  07650000
FRRSOFLG3 DS    B             RESULT OF IAC INSTRUCTION FROM TIME OF   *07700000
                              SETFRR                               @L3C 07750000
FRRSOFLG4 DS    B             FLAGS TO INDICATE OPTIONS CHOSEN          07800000
*                             WHEN THE SETFRR WAS ISSUED      @ZMB0248  07850000
FRRSOEUT EQU    X'80'         ENABLED UNLOCKED TASK FRR (EUT=YES ON     07900000
*                             SETFRR)                         @G381P2F  07950000
FRRSONCNL EQU   X'40'         CANCEL=NO REQUESTED, ROUTINE RUNS        *08000000
                              PROTECTED FROM CANCELS AND DETACHES  @D1A 08050000
FRRSOFULL EQU   X'08'         MODE=FULLXM WAS SPEC ON SETFRR  @G381P2F  08100000
FRRSOPRIM EQU   X'04'         MODE=PRIMARY SPEC ON SETFRR     @G381P2F  08150000
FRRSOLCL EQU    X'02'         MODE=LOCAL WAS SPEC ON SETFRR   @G381P2F  08200000
FRRSOGLB EQU    X'01'         MODE=GLOBAL WAS SPEC ON SETFRR  @G381P2F  08250000
FRRSOPARM DS    CL24          PARAMETER AREA PASSED TO FRR              08300000
FRRSOXENT DSECT ,FRRXPTR      THE MAPPING OF AN FRR ENTRY EXTENSION     08350000
*                                                             @G381P2F  08400000
FRRSOXM  DS     0CL8          CROSS MEMORY INFORMATION WHEN SETFRR      08450000
*                             WAS ISSUED                      @G381P2F  08500000
FRRSOCR3 DS     0CL4          CONTROL REGISTER 3              @G381P2F  08550000
FRRSOKM  DS     CL2           KEY MASK                        @G381P2F  08600000
FRRSOSAS DS     CL2           SASID                           @G381P2F  08650000
FRRSOCR4 DS     0CL4          CONTROL REGISTER 4              @G381P2F  08700000
FRRSOAX  DS     CL2           AUTHORIZATION INDEX             @G381P2F  08750000
FRRSOPAS DS     CL2           PASID                           @G381P2F  08800000
FRROEAX  DS     A             EAX VALUE AT SETFRR                 @L3A  08850000
FRROLS   DS     A             LINKAGE STACK AT SETFRR             @L3A  08900000
         MEND         */                                                08950000
*%FRRSOPLS: ;                                                           09000000
* DCL FRRSOESZE FIXED(31) CONSTANT(32); /* LENGTH OF EACH FRR ENTRY  */ 09050000
* DCL FRRSOEXSZ FIXED(31) CONSTANT(16); /* LENGTH OF EACH FRR EXTENSION 09100000
*                                                                @L3C*/ 09150000
* DCL FRRSONENT FIXED(31) CONSTANT(16); /* NUMBER OF FRR ENTRIES IN     09200000
*                                         THE STACK          @ZM02352*/ 09250000
* DCL FRRSOTLEN FIXED(31) CONSTANT(856); /*TOTAL LENGTH OF NORMAL FRR   09300000
*                                         STACK                  @L3C*/ 09350000
*DECLARE                                                                09400000
*  1 FRRSO   BASED(FRRSOPTR),                                           09450000
*    2 FRRSOND    CHAR(88)  BDY(WORD), /* NON-DYNAMIC PART OF THE       09500000
*                                         FRR STACK              @L3C*/ 09550000
*      3 FRRSOHEAD  CHAR(16) BDY(WORD),/* THE HEADER OF THE FRR         09600000
*                                         STACK                      */ 09650000
*        4 FRRSOEMP    PTR(31),        /* ADDRESS WHICH INDICATES AN    09700000
*                                         EMPTY  STACK               */ 09750000
*        4 FRRSOLAST   PTR(31),        /* ADDRESS OF LAST ENTRY IN      09800000
*                                         STACK                      */ 09850000
*        4 FRRSOELEN  FIXED(31),       /* LENGTH OF EACH ENTRY IN       09900000
*                                         THE STACK                  */ 09950000
*        4 FRRSOCURR   PTR(31),        /* ADDRESS OF CURRENT FRR        10000000
*                                         ENTRY IN THE STACK         */ 10050000
*      3 FRRSORSA    CHAR(24),         /* SETFRR REG 14-3 SAVE AREA     10100000
*                                                            @G381P2F*/ 10150000
*      3 FRRSORTMW CHAR(4) BDY(WORD),  /* RECURSION CONTROL DATA        10200000
*                                          REMOVED FROM THE RT1W @L1C*/ 10250000
*      3 FRRSOENTL FIXED(16),           /* RESERVED FOR FRRSOCOPY MACRO 10300000
*                                          TO SAVE LENGTH OF ENTRIES    10350000
*                                          ACTUALLY COPIED       @L1A*/ 10400000
*      3 FRRSOEXTL FIXED(16),           /* RESERVED FOR FRRSOCOPY MACRO 10450000
*                                          TO SAVE LENGTH OF EXTENSIONS 10500000
*                                          ACTUALLY COPIED       @L1A*/ 10550000
*      3 *         CHAR(8),             /* RESERVED              @L1A*/ 10600000
*      3 FRRSORTMA PTR(31),            /* ADDRESS OF RTM1 WORK AREA     10650000
*                                                                @L1A*/ 10700000
*      3 FRRSOXSTA PTR(31),            /* ADDRESS OF THE EXTENSIONS TO  10750000
*                                         THE FRR ENTRIES               10800000
*                                         (ACTUAL SIZE IS 16 TIMES THE  10850000
*                                         MAXIMUM NUMBER OF ENTRIES)    10900000
*                                                                @L1A*/ 10950000
*      3 FRRSOASA    CHAR(24),         /* SETFRR ACCESS REGISTER        11000000
*                                         14-3 SAVE AREA         @L3A*/ 11050000
*    2 FRRSOENTS   CHAR(FRRSONENT*FRRSOESZE); /* THE FRR ENTRIES IN     11100000
*                                         THE STACK              @L1C*/ 11150000
*DECLARE                                                                11200000
*  FRRSOXSTK CHAR(FRRSONENT*FRRSOEXSZ)                                  11250000
*            BASED(FRRSOXSTA);          /* FRR EXTENSIONS            */ 11300000
*DECLARE                                                                11350000
*  1 FRRSOENTR   BASED(FRROEPTR),      /* THE MAPPING OF A FRR          11400000
*                                         ENTRY                      */ 11450000
*    2 FRRSOFRRA   PTR(31),            /* THE ADDRESS OF THE FRR     */ 11500000
*      3 *         CHAR(3),                               /* @G381P2F*/ 11550000
*      3 FRRSOFRA1 CHAR(1),            /* LOW ORDER BYTE     @G381P2F*/ 11600000
*        4 *         BIT(7),                              /* @G381P2F*/ 11650000
*        4 FRRSOXFLG BIT(1),           /* FLAG INDICATING FRRSOFLGS     11700000
*                                         INITIALIZED WHEN SETFRR WAS   11750000
*                                         ISSUED             @G381P2F*/ 11800000
*    2 FRRSOFLGS   CHAR(4),            /* FLAGS USED BY RTM DURING      11850000
*                                         FRR PROCESSING             */ 11900000
*      3 FRRSOFLG1 CHAR(1),            /* RECURSION USED BY RTM      */ 11950000
*        4 FRRSORCUR BIT(1),           /* RECURSION FLAG USED WHEN      12000000
*                                         GIVING CONTROL TO FRR         12050000
*                                         AND WHEN RECEIVING CONTROL    12100000
*                                         BACK FROM FRR              */ 12150000
*        4 FRRSONEST BIT(1),           /* FLAG INDICATING A NESTED      12200000
*                                         FRR ENTRY                  */ 12250000
*        4 FRRSONLCL BIT(1),           /* FLAG INDICATING THAT NESTED   12300000
*                                         FRR IS A MODE=LOCAL FRR       12350000
*                                                            @G382PPY*/ 12400000
*        4 FRRSONGLB BIT(1),           /* FLAG INDICATING THAT NESTED   12450000
*                                         FRR IS A MODE=GLOBAL FRR      12500000
*                                                            @G382PPY*/ 12550000
*        4 FRRSONRTY BIT(1),           /* FRR RETRY INDICATOR. IF ON,   12600000
*                                         FRR CANNOT RETRY.      @L2C*/ 12650000
*      3 FRRSOFLG2 CHAR(1),            /* RESERVED           @ZMB0248*/ 12700000
*      3 FRRSOFLG3 CHAR(1),            /* RESULT OF IAC INSTRUCTION     12750000
*                                         FROM TIME OF SETFRR    @L3A*/ 12800000
*        4 * BIT(6),                   /*                        @L3A*/ 12850000
*        4 FRRSOASC BIT(2),            /* ASC FLAGS              @L3A*/ 12900000
*      3 FRRSOFLG4 CHAR(1),            /* FLAGS TO INDICATE OPTIONS     12950000
*                                         CHOSEN WHEN THE SETFRR WAS    13000000
*                                         ISSUED             @ZMB0248*/ 13050000
*        4 FRRSOEUT  BIT(1),           /* ENABLED UNLOCKED TASK FRR     13100000
*                                        (EUT=YES ON SETFRR) @G381P2F*/ 13150000
*        4 FRRSONCNL BIT(1),           /* CANCEL=NO FRR, PROTECTED      13200000
*                                         FROM CANCELS, DETACHES @D1A*/ 13250000
*        4 *         BIT(2),           /* RESERVED               @D1C*/ 13300000
*        4 FRRSOFULL BIT(1),           /* MODE=FULLXM WAS SPEC ON THE   13350000
*                                         SETFRR             @G381P2F*/ 13400000
*        4 FRRSOPRIM BIT(1),           /* MODE=PRIMARY WAS SPEC ON      13450000
*                                         THE SETFRR         @G381P2F*/ 13500000
*        4 FRRSOLCL  BIT(1),           /* MODE=LOCAL WAS SPEC ON THE    13550000
*                                         SETFRR             @G381P2F*/ 13600000
*        4 FRRSOGLB  BIT(1),           /* MODE=GLOBAL WAS SPEC ON THE   13650000
*                                         SETFRR             @G381P2F*/ 13700000
*    2 FRRSOPARM    CHAR(24);          /* PARAMETER AREA PASSED TO      13750000
*                                         FRR                        */ 13800000
*DECLARE                                                                13850000
*  1 FRRSOXENT   BASED,                /* THE MAPPING OF AN FRR         13900000
*                                         ENTRY EXTENSION    @G381P2F*/ 13950000
*    2 FRRSOXM    CHAR(8) BDY(WORD),   /* CROSS MEMORY INFO WHEN        14000000
*                                         SETFRR WAS ISSUED  @G381P2F*/ 14050000
*      3 FRRSOCR3    CHAR(4),          /* CONTROL REGISTER 3 WHEN       14100000
*                                         SETFRR WAS ISSUED  @G381P2F*/ 14150000
*        4 FRRSOKM   CHAR(2),          /* KEY MASK           @G381P2F*/ 14200000
*        4 FRRSOSAS  CHAR(2),          /* SASID              @G381P2F*/ 14250000
*      3 FRRSOCR4    CHAR(4),          /* CONTROL REGISTER 4 WHEN       14300000
*                                         SETFRR WAS ISSUED  @G381P2F*/ 14350000
*        4 FRRSOAX   CHAR(2),          /*AUTHORIZATION INDEX @G381P2F*/ 14400000
*        4 FRRSOPAS  CHAR(2),          /* PASID                  @L3C*/ 14450000
*    2 FRROEAX PTR(31),                /* EAX VALUE AT SETFRR    @L3A*/ 14500000
*    2 FRROLS PTR(31);                 /*LINKAGE STACK AT SETFRR @L3A*/ 14550000
