*                                                                       00001000
* %DCL IHAGSRET_INCLUDED CHAR EXT;                                      00002000
* %DEACTIVATE IHAGSRET_INCLUDED;                                        00003000
* %IF IHAGSRET_INCLUDED = '' %THEN                                      00004000
* %DO;                                                                  00005000
*/* Macro made bi-lingual on 16180. CBGEN compile date 15295         */ 00006000
*% /*                                                                   00007000
         MACRO                                                          00008000
         IHAGSRET &DSECT=YES,&LIST=YES,&TITLE=YES                       00009000
         GBLC  &IHAGSRET_INCLUDED                                       00010000
         GBLC  &ZCBPRINT                                                00011000
&IHAGSRET_INCLUDED SETC 'YES'                                           00012000
         AIF   ('&LIST' EQ 'NONE').P0                                   00013000
         AIF   ('&TITLE' EQ 'NO').P5                                    00014000
 TITLE   'IHAGSRET  - IEAGSF Return Information                      '  00015000
.P5      ANOP                                                           00016000
**/ IHAGSRET_1:;                                                        00017000
*/* START OF SPECIFICATIONS ******************************************* 00018000
*                                                                       00019000
*  **PROPRIETARY_STATEMENT********************************************  00020000
***01* PROPRIETARY STATEMENT=                                        *  00021000
*                                                                    *  00022000
*                                                                    *  00023000
*   LICENSED MATERIALS - PROPERTY OF IBM                             *  00024000
*   5650-ZOS COPYRIGHT IBM CORP. 2017                                *  00025000
*                                                                    *  00026000
*   STATUS= HBB77B0                                                  *  00027000
*                                                                    *  00028000
*  **END_OF_PROPRIETARY_STATEMENT*************************************  00029000
*                                                                       00030000
*01* DESCRIPTIVE NAME:  IEAGSF Return Information                       00031000
*02*  ACRONYM:  GSRET                                                   00032000
*                                                                       00033000
*01* MACRO NAME:  IHAGSRET                                              00034000
*                                                                       00035000
*01* EXTERNAL CLASSIFICATION: GUPI                                      00036000
*01* END OF EXTERNAL CLASSIFICATION:                                    00037000
*                                                                       00038000
*01* DSECT NAME:                                                        00039000
*     NONE                                                              00040000
*                                                                       00041000
*01* COMPONENT:  Supervisor Control (SC1C5)                             00042000
*                                                                       00043000
*01* EYE-CATCHER:  NONE                                                 00044000
*                                                                       00045000
*01* STORAGE ATTRIBUTES:                                                00046000
*02*  SUBPOOL:  N/A                                                     00047000
*02*  KEY:  N/A                                                         00048000
*02*  RESIDENCY:  N/A                                                   00049000
*                                                                       00050000
*01* SIZE:  N/A                                                         00051000
*                                                                       00052000
*01* CONTROL BLOCK CHANGES:                                             00053000
*02*  IHAGSRET                                                          00054000
*02*   z/OS 2.3                                                         00055000
*03*    New                                                             00056000
*03*    Migration Considerations: NONE                                  00057000
*01* END CONTROL BLOCK CHANGES                                          00058000
*                                                                       00059000
*01* CREATED BY:                                                        00060000
*     N/A                                                               00061000
*                                                                       00062000
*01* POINTED TO BY:                                                     00063000
*     N/A                                                               00064000
*                                                                       00065000
*01* SERIALIZATION:                                                     00066000
*     None required                                                     00067000
*                                                                       00068000
*01* FUNCTION:                                                          00069000
*02* Equates for IEAGSF return and reason codes                         00070000
*                                                                       00071000
*01* METHOD OF ACCESS:                                                  00072000
*02*  ASM:                                                              00073000
*      IHAGSRET                                                         00074000
*                                                                       00075000
*02*  PL/AS:                                                            00076000
*      %INCLUDE SYSLIB(IHAGSRET)                                        00077000
*                                                                       00078000
*01* DELETED BY:  N/A                                                   00079000
*                                                                       00080000
*01* FREQUENCY:  N/A                                                    00081000
*                                                                       00082000
*01* DEPENDENCIES:  None                                                00083000
*                                                                       00084000
*01* DISTRIBUTION LIBRARY:  AMACLIB                                     00085000
*                                                                       00086000
*01* CHANGE ACTIVITY:                                                   00087000
*   $L0=GSF       HBB77B0 150730 PD00KD: GSF                            00088000
*                                                                       00089000
* END OF SPECIFICATIONS *********************************************/  00090000
*% /*                                                                   00091000
.P0      ANOP                                                           00092000
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 00093000
         AIF   ('&LIST' EQ 'YES').P2                                    00094000
.P1      ANOP                                                           00095000
         PUSH  PRINT                                                    00096000
         PRINT OFF                                                      00097000
.P2      ANOP                                                           00098000
*                                                                       00099000
*    *****************************************************************  00100000
*    *                                                               *  00101000
*    * Return Code Information It is guaranteed that no reason code  *  00102000
*    * will be reused (i.e., the same reason code will not be used   *  00103000
*    * for more than one return code). Also note carefully that bits *  00104000
*    * 0-15 of the reason code may contain component-diagnostic data *  00105000
*    * and must not be assumed to be 0.                              *  00106000
*    *                                                               *  00107000
*    *****************************************************************  00108000
*                                                                       00109000
*                                                                       00110000
IEAGSFRSNCODEMASK EQU X'0000FFFF' Use this mask to isolate the non     *00111000
                         component-diagnostic portion of the reason    *00112000
                         code.                                          00113000
*                                                                       00114000
*   IEAGSF Return and Reason Code definitions                           00115000
*                                                                       00116000
*                                                                       00117000
IEAGSFRC_OK EQU X'00000000' Meaning: IEAGSF request successful.        *00118000
                         Action: None required.                         00119000
IEAGSFRC_INVPARM EQU X'00000008' Meaning: IEAGSF request specified     *00120000
                         parameters that are not valid. Action: Refer  *00121000
                         to the action provided with the specific      *00122000
                         reason code.                                   00123000
IEAGSFRSNBADFUNCTION EQU X'00000801' Meaning: Incorrect value passed   *00124000
                         to target routine. Action: Check for possible *00125000
                         storage overlay.                               00126000
IEAGSFRSNUPDATETCBBAD EQU X'00000802' Meaning: The TCB specified by    *00127000
                         the TTOKEN for an IEAGSF UPDATE request is no *00128000
                         longer valid, or is terminating, or is        *00129000
                         neither the jobstep program task nor a        *00130000
                         subtask of the jobstep program task. Action:  *00131000
                         N/A                                            00132000
IEAGSFRC_ENV EQU X'0000000C' Meaning: Environmental error Action:      *00133000
                         Refer to the action provided with the         *00134000
                         specific reason code.                          00135000
IEAGSFRSNFROMASYNCHEXIT EQU X'00000C01' Meaning: IEAGSF was issued     *00136000
                         from an asynchronous exit routine (IRB).      *00137000
                         Action: Avoid issuing IEAGSF from an          *00138000
                         asynchronous exit routine.                     00139000
IEAGSFRSNFROMSRB EQU X'00000C02' Meaning: IEAGSF was issued from an    *00140000
                         SRB. Action: Avoid issuing IEAGSF from an SRB  00141000
IEAGSFRSNFROMNOTBITCB EQU X'00000C03' Meaning: IEAGSF START was issued *00142000
                         for a task that was neither the jobstep       *00143000
                         program task nor a subtask of the jobstep     *00144000
                         program task. Action: Only issue IEAGSF from  *00145000
                         the jobstep program task or a subtask of that *00146000
                         task.                                          00147000
IEAGSFRSNLOCKED EQU X'00000C04' Meaning: IEAGSF START was issued while *00148000
                         holding a lock other than the Local lock.     *00149000
                         Action: Avoid using IEAGSF while holding a    *00150000
                         lock other than the Local lock.                00151000
IEAGSFRSNNOSTORAGE EQU X'00000C05' Meaning: Necessary system storage   *00152000
                         could not be obtained from LSQA. Action: Use  *00153000
                         IEAGSF START at an earlier time in the        *00154000
                         jobstep.                                       00155000
IEAGSFRSNSUPERBIT EQU X'00000C06' Meaning: IEAGSF START was issued     *00156000
                         from a workunit with at least one bit on in   *00157000
                         the PSASUPER word. Action: Avoid issuing      *00158000
                         IEAGSF from a workunit with a PSASUPER bit    *00159000
                         on.                                            00160000
IEAGSFRSNNOTAVAILABLE EQU X'00000C07' Meaning: The Guarded-Storage     *00161000
                         facility is not available on this system.     *00162000
                         Action: Ensure that the hardware supports the *00163000
                         facility.                                      00164000
IEAGSFRSNUPDATEINXM EQU X'00000C08' Meaning: IEAGSF UPDATE has been    *00165000
                         called with a Primary address space that is   *00166000
                         different than the Home address space.        *00167000
                         Action: Only invoke IEAGSF UPDATE with the    *00168000
                         Primary address space equal to the Home       *00169000
                         address space.                                 00170000
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 00171000
         AIF   ('&LIST' EQ 'YES').P4                                    00172000
.P3      ANOP                                                           00173000
         POP   PRINT                                                    00174000
.P4      ANOP                                                           00175000
.P_EXIT  ANOP                                                           00176000
         MEND                                                           00177000
**/ IHAGSRET_2:;                                                        00178000
* %IHAGSRET_INCLUDED = 'YES';                                           00179000
* %DCL ZCBPRINT CHAR EXT;                                               00180000
* %DEACTIVATE ZCBPRINT;                                                 00181000
* %DCL IHAGSRET_LIST CHAR EXT;                                          00182000
* %DEACTIVATE IHAGSRET_LIST;                                            00183000
* %IF IHAGSRET_LIST ^= 'NO' &                                           00184000
*    ZCBPRINT ^= 'NO' %THEN                                             00185000
*   %GOTO IHAGSRET_3;                                                   00186000
*   @LIST PUSH NOECHO;                                                  00187000
*   @LIST NOASSEMBLE NOECHO;                                            00188000
*   @LIST OFF C NOECHO;                                                 00189000
* %IHAGSRET_3:;                                                         00190000
*/* Start of PL/X Source                                             */ 00191000
*                                                                       00192000
*    /* Return Code Information                                      */ 00193000
*                                                                       00194000
*    /* It is guaranteed that                                           00195000
*       no reason code will be reused (i.e., the same reason code       00196000
*       will not be used for more than one return code).            */  00197000
*                                                                       00198000
*    /* Also note carefully that bits 0-15 of the reason code           00199000
*       may contain component-diagnostic data and must not be           00200000
*       assumed to be 0.                                            */  00201000
*                                                                       00202000
*Dcl IeaGsfRsnCodeMask Bit(32) Constant('0000FFFF'X); /* Use this       00203000
*               mask to isolate the non component-diagnostic            00204000
*               portion of the reason code.                          */ 00205000
*/* IEAGSF Return and Reason Code definitions                        */ 00206000
*DCL IeaGsfRc_OK Bit(32) Constant('00000000'X) ; /*                     00207000
*                        Meaning: IEAGSF request successful.            00208000
*                        Action: None required.                      */ 00209000
*DCL IeaGsfRc_InvParm Bit(32) Constant('00000008'X) ; /*                00210000
*                        Meaning: IEAGSF request specified parameters   00211000
*                        that are not valid.                            00212000
*                        Action: Refer to the action provided with the  00213000
*                        specific reason code.                       */ 00214000
*DCL IeaGsfRsnBadFunction Bit(32) Constant('00000801'X) ; /*            00215000
*                        Meaning: Incorrect value passed to target      00216000
*                        routine.                                       00217000
*                        Action: Check for possible storage overlay. */ 00218000
*DCL IeaGsfRsnUpdateTcbBad Bit(32) Constant('00000802'X) ; /*           00219000
*                        Meaning: The TCB specified by the TTOKEN for   00220000
*                        an IEAGSF UPDATE request is no longer valid,   00221000
*                        or is terminating, or is neither the jobstep   00222000
*                        program task nor a subtask of the jobstep      00223000
*                        program task.                                  00224000
*                        Action: N/A                                 */ 00225000
*DCL IeaGsfRc_Env Bit(32) Constant('0000000C'X) ; /*                    00226000
*                        Meaning: Environmental error                   00227000
*                        Action: Refer to the action provided with the  00228000
*                        specific reason code.                       */ 00229000
*DCL IeaGsfRsnFromAsynchExit Bit(32) Constant('00000C01'X) ; /*         00230000
*                        Meaning: IEAGSF was issued from an             00231000
*                        asynchronous exit routine (IRB).               00232000
*                        Action: Avoid issuing IEAGSF from an           00233000
*                        asynchronous exit routine.                  */ 00234000
*DCL IeaGsfRsnFromSRB Bit(32) Constant('00000C02'X) ; /*                00235000
*                        Meaning: IEAGSF was issued from an SRB.        00236000
*                        Action: Avoid issuing IEAGSF from an SRB    */ 00237000
*DCL IeaGsfRsnFromNotBITCB Bit(32) Constant('00000C03'X) ; /*           00238000
*                        Meaning: IEAGSF START was issued for a task    00239000
*                        that was neither the jobstep program task      00240000
*                        nor a subtask of the jobstep program task.     00241000
*                        Action: Only issue IEAGSF from the jobstep     00242000
*                        program task or a subtask of that task.     */ 00243000
*DCL IeaGsfRsnLocked Bit(32) Constant('00000C04'X) ; /*                 00244000
*                        Meaning: IEAGSF START was issued while holding 00245000
*                        a lock other than the Local lock.              00246000
*                        Action: Avoid using IEAGSF while holding a     00247000
*                        lock other than the Local lock.             */ 00248000
*DCL IeaGsfRsnNoStorage Bit(32) Constant('00000C05'X) ; /*              00249000
*                        Meaning: Necessary system storage could not    00250000
*                        be obtained from LSQA.                         00251000
*                        Action: Use IEAGSF START at an earlier         00252000
*                        time in the jobstep.                        */ 00253000
*DCL IeaGsfRsnSuperBit Bit(32) Constant('00000C06'X) ; /*               00254000
*                        Meaning: IEAGSF START was issued from a        00255000
*                        workunit with at least one bit on in the       00256000
*                        PSASUPER word.                                 00257000
*                        Action: Avoid issuing IEAGSF from a workunit   00258000
*                        with a PSASUPER bit on.                     */ 00259000
*DCL IeaGsfRsnNotAvailable Bit(32) Constant('00000C07'X) ; /*           00260000
*                        Meaning: The Guarded-Storage facility is       00261000
*                        not available on this system.                  00262000
*                        Action: Ensure that the hardware supports      00263000
*                        the facility.                               */ 00264000
*DCL IeaGsfRsnUpdateInXM   Bit(32) Constant('00000C08'X) ; /*           00265000
*                        Meaning: IEAGSF UPDATE has been called with    00266000
*                        a Primary address space that is different      00267000
*                        than the Home address space.                   00268000
*                        Action: Only invoke IEAGSF UPDATE with the     00269000
*                        Primary address space equal to the Home        00270000
*                        address space.                              */ 00271000
*/* End of IEAGSF Return and Reason Code definitions                 */ 00272000
*/* End of PL/X Source                                               */ 00273000
* %IF IHAGSRET_LIST ^= 'NO' &                                           00274000
*    ZCBPRINT ^= 'NO' %THEN                                             00275000
*   %GOTO IHAGSRET_4;                                                   00276000
*   @LIST POP NOECHO;                                                   00277000
* %IHAGSRET_4:;                                                         00278000
* %END;                                                                 00279000
