*        %GOTO IQEPLS1;                                             /*  00050000
         MACRO                                                          00100000
         IHAIQE                                                         00150000
*                                                                    */ 00154500
*%IQEPLS1 : ;                                                           00159000
*/* START OF SPECIFICATIONS ******************************************* 00160005
*                                                                       00161005
*01* DESCRIPTIVE NAME:  Interruption Queue Element                      00162005
*                                                                       00163005
*01* MACRO NAME:  IHAIQE                                                00163105
*                                                                       00163205
*01* PROPRIETARY STATEMENT:                                             00163306
*        LICENSED MATERIALS - PROPERTY OF IBM                           00163406
*        5750-ZOS COPYRIGHT IBM CORPORATION 1981, 2021                  00163505
*                                                                       00163905
*01* STATUS= HBB77D0                                                    00164005
*                                                                       00164105
*01* EXTERNAL CLASSIFICATION:                                           00164205
*01* NOTPI: BASE                                                        00164305
*01* PI: FIELDS                                                         00164405
*        IQEPARAM IQEIRB IQETCB                                         00164505
*01* END OF EXTERNAL CLASSIFICATION:                                    00164605
*                                                                       00164705
*01* DSECT NAME:                                                        00164805
*     IQE                                                               00164905
*                                                                       00165005
*01* PROPRIETARY STATEMENT:                                             00165105
*01* METHOD OF ACCESS:                                                  00165205
*                                                                       00165305
*01* COMPONENT:  Supervisor Control (SC1C5)                             00165405
*                                                                       00165505
*01* EYE-CATCHER:  None                                                 00165605
*                                                                       00165705
*01* STORAGE ATTRIBUTES:                                                00165805
*02*  Subpool:  253                                                     00165905
*                                                                       00166005
*01* SIZE:                                                              00166105
*      24 bytes                                                         00166205
*                                                                       00166305
*01* CREATED BY:                                                        00166405
*     Caller of stage 2 exit effector                                   00166505
*                                                                       00166605
*01* POINTED TO BY:                                                     00166705
*     ASXBFIQE field of the ASXB data area                              00166805
*     ASXBLIQE field of the ASXB data area                              00166905
*     IQELINK field of the IQE data area                                00167005
*     RBIQE field of the IRB data area (first IQE)                      00167105
*     TAXELNK field of the TAXE data area (next IQE)                    00167205
*     TAXEIQE field of the TAXE data area (next available IQE)          00167305
*     TCBIQE field of the TCB data area (EXTR scheduling IQE)           00167405
*                                                                       00167505
*01* SERIALIZATION:                                                     00167605
*     LOCAL lock                                                        00167705
*                                                                       00167805
*01* FUNCTION:                                                          00167905
*02* Represents request to schedule an asynchronous exit                00168005
*    routine via an IRB.                                                00168105
*                                                                       00168205
*02* CHANGE-ACTIVITY=                                                   00168305
*    $D1=DCR0047  JBB2125  830409  PD162M:  SET TIMER MULTIPLE TQE      00168405
*                                           SUPPORT                     00168505
*    OY39934 - SAVEAREA AND PARAMETER STORAGE KEY SUPPORT FOR           00168605
*              OY39382                                       @YA39934   00168705
*    $L1=DELAYIRB HBB77D0  191226  PD00XB:  IQEPS                       00168805
*  END OF SPECIFICATIONS                                             */ 00168905
*        %GOTO IQEPLS2;                                              /* 00244500
IQESECT  DSECT , IQEPTR                                                 00250000
IQELNK   DS    0AL4     .WORD REFERENCE FOR IQELNKA                     00300000
IQESTAT1 DS    B        .1 BYTE RESERVED                                00350000
IQELNKA  DS    AL3      .ADDR NEXT IQE                                  00400000
IQEPARAM DS    A        .PARMS TO BE PASSED TO ASYN EXIT RTN            00450000
IQEIRB   DS    0AL4     .WORD REFERENCE FOR IQEIRBA                     00500000
IQEFLAGS DS    B        .FLAG FIELD                                     00550000
IQEPURGE EQU   X'80'    .THIS IQE MUST NOT BE SCHEDULED                 00600000
IQETIMER EQU   X'40'    .STIMERM OR STIMER REQUEST           @YA39934   00616600
IQEPS    EQU   X'10'    .STIMER(M) PROBLEM STATE BIT             @L1A   00616702
IQEKEY   EQU   X'0F'    .STIMER(M) KEY                       @YA39934   00633200
IQEUKEY  EQU   X'08'    .IF ON, USER KEY                         @L1A   00633302
IQEIRBA  DS    AL3      .ADDR IRB TO BE SCHEDULED                       00650000
IQETCB   DS    0AL4     .WORD REFERENCE FOR IQETCBA                     00700000
IQESTAT2 DS    B        .1 BYTE RESERVED                                00750000
IQETCBA  DS    AL3      .ADDR TCB ASSOCIATED WITH THIS IQE              00800000
**      THE FOLLOWING IS IN BEHALF OF S.M.F.                            00850000
IQEDCB   DS    A        .ADDR OF DCB                                    00900000
IQEOUTLM DS    A        .ADDR OF OUTPUT LIMIT                           00950000
IQEEND   DS    0C       .END OF IQE                                     01000000
IQELEN   EQU   IQEEND-IQESECT .LENGTH OF IQE                            01050000
         MEND  , */                                                     01100000
*%IQEPLS2 :  ;                                                          01150000
*DECLARE                                                                01250000
*  1 IQESECT  BASED(IQEPTR) BDY(WORD),   /* .                @G860PXL*/ 01300000
*   2 IQELNK      PTR(31),               /* .WORD REFERENCE FOR         01350000
*                                           IQELNKA          @G860PXL*/ 01400000
*    3 IQESTAT1    CHAR(1),              /* .1 BYTE RESERVED         */ 01450000
*    3 IQELNKA     PTR(24),              /* .ADDR NEXT IQE   @G860PXL*/ 01500000
*   2 IQEPARAM    PTR(31),               /* .PARMS TO BE PASSED TO      01550000
*                                           ASYN EXIT RTN            */ 01600000
*   2 IQEIRB      PTR(31),               /* .WORD REFERENCE FOR         01650000
*                                           IQEIRBA          @G860PXL*/ 01700000
*    3 IQEFLAGS    CHAR(1),              /* .FLAG FIELD              */ 01750000
*     4 IQEPURGE BIT(1),                 /* .THIS IQE MUST NOT BE       01800000
*                                           SCHEDULED                */ 01850000
*     4 IQETIMER BIT(1),                 /* .STIMERM OR STIMER          01900000
*                                           REQUEST          @YA39934*/ 01950000
*     4 *        BIT(1),                 /* RESERVED             @L1C*/ 02000002
*     4 IQEPS    BIT(1),                 /* STIMER(M) PROBLEM STATE BIT 02001000
*                                                                @L1A*/ 02002002
*     4 IQEKEY   BIT(4),                 /* STIMER(M) KEY    @YA39934*/ 02050000
*       5 IQEUKEY BIT(1),                /* IF ON, USER KEY      @L1A*/ 02060002
*    3 IQEIRBA     PTR(24),              /* .ADDR IRB TO BE             02250000
*                                           SCHEDULED        @G860PXL*/ 02300000
*   2 IQETCB      PTR(31),               /* .WORD REFERENCE FOR         02350000
*                                           IQETCBA          @G860PXL*/ 02400000
*    3 IQESTAT2    CHAR(1),              /* .1 BYTE RESERVED         */ 02450000
*    3 IQETCBA     PTR(24),              /* .ADDR TCB ASSOCIATED        02500000
*                                           WITH THIS IQE    @G860PXL*/ 02550000
*/*     THE FOLLOWING IS IN BEHALF OF S.M.F.                         */ 02600000
*   2 IQEDCB      PTR(31),               /* .ADDR OF DCB             */ 02650000
*   2 IQEOUTLM    PTR(31),               /* .ADDR OF OUTPUT LIMIT    */ 02700000
*   2 IQEEND  CHAR(0);                   /* .                @G860PXL*/ 02750000
*                                        /* .END OF IQE              */ 02850000
