*                                                                       00001000
* %DCL IHAIPA_INCLUDED CHAR EXT;                                        00002000
* %DEACTIVATE IHAIPA_INCLUDED;                                          00003000
* %IF IHAIPA_INCLUDED = '' %THEN                                        00004000
* %DO;                                                                  00005000
*/* Macro made bi-lingual on 22120. CBGEN compile date 21138         */ 00006000
*% /*                                                                   00007000
         MACRO                                                          00008000
         IHAIPA &DSECT=YES,&LIST=YES,&TITLE=YES,&IPA=YES,&IPAPDE=COND, *00009000
               &IPAPLI=COND                                             00010000
         GBLC  &IHAIPA_INCLUDED                                         00011000
         GBLC  &ZCBPRINT                                                00012000
&IHAIPA_INCLUDED SETC 'YES'                                             00013000
         AIF   ('&LIST' EQ 'NONE').P0                                   00014000
         AIF   ('&TITLE' EQ 'NO').P5                                    00015000
 TITLE   'IHAIPA  - Initialization Parameter Area                   '   00016000
.P5      ANOP                                                           00017000
**/ ;                                                                   00018000
*/** START OF SPECIFICATIONS *****************************************  00019000
*                                                                       00020000
***** PROPRIETARY_STATEMENT ****************************************    00021000
*01* PROPRIETARY STATEMENT =                                            00022000
*                                                                       00023000
*    LICENSED MATERIALS - PROPERTY OF IBM                               00024000
*    5650-ZOS COPYRIGHT IBM CORP. 1996, 2019                            00025000
*                                                                       00026000
**** END_OF_PROPRIETARY_STATEMENT *********************************     00027000
*01* ACRONYM: IPA                                                       00028000
*01* EXTERNAL CLASSIFICATION: PI                                        00029000
*01* END OF EXTERNAL CLASSIFICATION:                                    00030000
*                                                                       00031000
*01* STATUS: HBB77C0                                                    00032000
*                                                                       00033000
*01* MACRO NAME: IHAIPA                                                 00034000
*                                                                       00035000
*01* DESCRIPTIVE NAME: Initialization Parameter Area                    00036000
*02*  ACRONYM:  IPA                                                     00037000
*                                                                       00038000
*01* DSECT NAME: IPA                                                    00039000
*                IPAPDE                                                 00040000
*                IPAPLI                                                 00041000
*                                                                       00042000
*01* COMPONENT: Nucleus Initialization Program (SC1C8)                  00043000
*                                                                       00044000
*01* EYE CATCHER: IPA                                                   00045000
*02*  OFFSET: 0                                                         00046000
*02*  LENGTH: 4                                                         00047000
*                                                                       00048000
*01* STORAGE ATTRIBUTES:                                                00049000
*02*  SUBPOOL: 241                                                      00050000
*02*  KEY:  0                                                           00051000
*02*  RESIDENCY: Above 16M virtual                                      00052000
*                                                                       00053000
*02* MAIN STORAGE:  NO                                                  00054000
*02* AUXILIARY STORAGE:  YES                                            00055000
*02* VIRTUAL STORAGE:  YES                                              00056000
*02* DATA SPACE: NO                                                     00057000
*                                                                       00058000
*01* SIZE:                                                              00059000
*      IPA    -- X'0BE8' bytes                                          00060000
*      IPAPDE -- X'0008' bytes                                          00061000
*      IPAPLI -- X'0040' bytes                                          00062000
*                                                                       00063000
*01* CREATED BY: IEAVNIPX                                               00064000
*                                                                       00065000
*01* POINTED TO BY: ECVTIPA                                             00066000
*                                                                       00067000
*01* SERIALIZATION: NONE                                                00068000
*                                                                       00069000
*01* FUNCTION:                                                          00070000
*                                                                       00071000
*      The IPA contains system initialization parameters defined in:    00072000
*                                                                       00073000
*          1) the load parameter used to IPL.                           00074000
*                                                                       00075000
*          2) the LOADxx member used to IPL.                            00076000
*                                                                       00077000
*          3) all IEASYSxx members used to IPL.                         00078000
*                                                                       00079000
*      Each set of parameter information is mapped by dsect IPAPDE.     00080000
*                                                                       00081000
*01* NOTES:                                                             00082000
*                                                                       00083000
*      The actual size of the IPA will range from 4096-16384 bytes      00084000
*      (beginning on a page boundary), depending on the combined        00085000
*      lengths of all parameter strings as specified in the             00086000
*      IEASYSxx members used to IPL.                                    00087000
*                                                                       00088000
*01* METHOD OF ACCESS:                                                  00089000
*                                                                       00090000
*      HLASM --                                                         00091000
*        IHAIPA                                                         00092000
*          DSECT=YES!NO  -- Request DSECT definition                    00093000
*          IPA=YES!NO!COND -- Request IPA mapping                       00094000
*                           USING on IPA                                00095000
*          IPAPDE=YES!NO!COND -- Request IPA entry mapping              00096000
*                           USING on IPAPDE                             00097000
*          IPAPLI=YES!NO!COND -- Request IPA parmlib entry mapping      00098000
*                           USING on IPAPLI                             00099000
*                                                                       00100000
*               L     Rx,ECVTIPA                                        00101000
*               USING IPA,Rx                                            00102000
*               L     Ry,IPAPDES                                        00103000
*               USING IPAPDE,Ry                                         00104000
*               ...                                                     00105000
*                                                                       00106000
*     Default: DSECT=YES,IPA=YES,IPAPDE=COND,IPAPLI=COND                00107000
*     Notes: name=YES  => expand                                        00108000
*            name=NO   => do not expand                                 00109000
*            name=COND => expand only if DSECT=YES                      00110000
*                                                                       00111000
*      PL/X  -- A structure based on ECVTIPA is always built.           00112000
*                                                                       00113000
*01* DELETED BY: Never                                                  00114000
*                                                                       00115000
*01* DISTRIBUTION LIBRARY: AMACLIB                                      00116000
*                                                                       00117000
*01* CHANGE ACTIVITY:                                                   00118000
*                                                                       00119000
*   $L0=PARMC002 JBB6602  950411  PD00KI: Concatenated PARMLIB          00120000
*   $L1=PARMC003 JBB6602  950509  PD00KI: Concatenated PARMLIB          00121000
*   $P1=PSD0150  JBB6602  950509  PD00KI: Correct SYSCAT card image     00122000
*   $L2=PARMC004 JBB6602  950606  PD00KI: Concatenated PARMLIB          00123000
*   $L3=OMVSxxx  HBB6603  950803  PD15EJ: OpenMVS                       00124000
*   $L4=PR603    HBB6603  951012  B7VBXZ: Restore to HBB6603            00125000
*   $L5=RTLS_NIP JBB6604  960808  PD00XB: RTLS                          00126000
*   $L6=64BITNIP HBB7703  980106  PD00XB: NUCXID                        00127000
*   $P2=PXD0213  HBB7703  990713  PD00XB: More parmlib datasets         00128000
*   $L7=XSLM1NIP JBB7713  000307  PD00XB: ILMMODE, ILMLIB               00129000
*   $01=OW44581  HBB6608  000518  PD00XB: UNICODE                       00130000
*   $02=OW45443  HBB6606  000717  PD00XB: MTLSHARE                      00131000
*   $L8=TSODB    HBB7706  000129  U2IAXZ: IKJTSO                        00132000
*   $LA=V64B3    HBB7708  010731  PD00SE: HVSHARE                       00133000
*   $LB=XSLM1    HBB7708  020131  PD00XB: ILM                           00134000
*   $03=OW54468  HBB7703  020507  U2IAXZ: IPAILTOD                      00135000
*   $P3= PYN0810,HBB7708,02351,PDE1: Restore ability to parameterize    00136000
*        scope and storage class for PL/X users.  This was added but    00137000
*        not properly flagged in HBB7706                                00138000
*   $LC=XRCLOG   HBB7720  031210  U2IAXZ: DRMODE                        00139000
*   $LD=RTOP     HBB7720  031210  U2IAXZ: CEE                           00140000
*   $04=OA09649  HBB7707  050328  PDHC:   IPAPRCPU                      00141000
*   $LE=LARGEPG  HBB7740  060915  PD002D: LFArea                        00142000
*   $LF=ME09933  HBB7750  070419  PD00BS: CEA                           00143000
*   $LG=64COMMON HBB7750  070725  PD00FX: HVCOMMON                      00144000
*   $LH=ME12406  HBB7750  071215  PD00XB: AXR                           00145000
*   $LI=zAAPzIIP HBB7760  080501  PD00XB: zAAPzIIP                      00146000
*   $LJ=IQP      HBB7760  080501  PD00XB: IQP                           00147000
*   $LK=DDMINF   HBB7760  080721  PD00JK: DDM Support                   00148000
*   $05=OA25908  JBB772S  080601  PD00XB: CPCR                          00149000
*   $LL=AUTOR    HBB7770  081225  PD00SS: Auto Reply support            00150000
*   $LM=ME18569  HBB7770  100225  PD00XB: IPANumPDEs                    00151000
*   $LN=NORTLS   HBB7780  091101  PD00XB: Remove RTLS                   00152000
*   $LO=ME18353  HBB7780  100208  PD00XB: CATALOG, IXGCNF               00153000
*   $LP=ME19233  HBB7780  100430  PDHC:   ME19233                       00154000
*   $LQ=ME21107  HBB7780  110301  PD00XB: WARNUND                       00155000
*   $06=OA37211  HBB7780  110803  PD002C: Reserve space                 00156000
*   $LR=GENTRKR  HBB7790  110301  PD00XB: HZS, GTZ                      00157000
*   $LS=ME22719  HBB7790  111012  PD00XB: HZSPROC                       00158000
*   $LT=ME23580  HBB7790  120215  PD00XB: MACHMIG                       00159000
*   $LU=SMFLIM   HBB77A0  141105  PD00XB: SMFLIM                        00160000
*   $LV=IEFOPZ   HBB77A0  141203  PD00XB: IEFOPZ                        00161000
*   $LW=RACF     HBB77B0  150501  PD00XB: RACF                          00162000
*   $LX=W117925  HBB77B0  160601  PD00XB: FXE                           00163000
*   $LY=W133138  HBB77B0  160901  PD00XB: IZU                           00164000
*   $07=OA52828  HBB77A0  171201  PD00XB: SMFTBUFF                      00165000
*   $LZ=zCBP     HBB77C0  171027  PD00NJ: zCBP                          00166000
*   $09=OA54807  HBB7790  180330  PD00XB: OA54807 / OA54589             00167000
*   $0A=OA55378  HBB77B0  171204  PDGA:   ICSF                          00168000
*   $0B=OA56180  HBB77C0  181001  PD002C: UKCSA - RUCSA                 00169000
*   $0C=FB       HBB77B0  190131  PD00XB: FB                            00170000
*   $0D=W387508  HBB77B0  201101  PD00XB: SOLUT                         00171000
*   $0E=OA61395  HBB77C0  211001  PD00XB: CRYPCTRS                      00172000
*                                                                       00173000
*******************************                                         00174000
*                                                                       00175000
*   N O T E :                                                           00176000
*                                                                       00177000
*   New fields in IHAIPA generally are done in conjunction with changes 00178000
*   to IEAPPNIP and associated parts.                                   00179000
*                                                                       00180000
*   New fields in IHAIPA require a change to IEAVNIPX.                  00181000
*                                                                       00182000
*   New LOADxx parameters and new parmlib members identified in         00183000
*   IEASYSxx require changes to SPPPACK.                                00184000
*                                                                       00185000
*   Length changes to IHAIPA require recompiles of                      00186000
*   - IEAIPAMD                                                          00187000
*   - IEAIPASR                                                          00188000
*   - BLSAIPIN                                                          00189000
*                                                                       00190000
**** END OF SPECIFICATIONS *******************************************/ 00191000
*% /*                                                                   00192000
.P0      ANOP                                                           00193000
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 00194000
         AIF   ('&LIST' EQ 'YES').P2                                    00195000
.P1      ANOP                                                           00196000
         PUSH  PRINT                                                    00197000
         PRINT OFF                                                      00198000
.P2      ANOP                                                           00199000
         AIF   ('&IPA' EQ 'NO').L0002                                   00200000
         AIF   ('&DSECT' EQ 'YES').L0003                                00201000
         AIF   ('&IPA' NE 'YES').L0002                                  00202000
IPA      DS    0D        Initialization Parameter Area                  00203000
         AGO   .L0004                                                   00204000
.L0003   ANOP                                                           00205000
IPA      DSECT           Initialization Parameter Area                  00206000
.L0004   ANOP                                                           00207000
IPAHEAD  DS    CL96      Header section                                 00208000
         ORG   IPAHEAD                                                  00209000
IPAID    DS    CL4       Eye-catcher                                    00210000
IPALEN   DS    H         Length                                         00211000
IPASP    DS    X         Subpool                                        00212000
IPAVER   DS    X         Version number                                 00213000
IPAICTOD DS    CL8       TOD at completion of system initialization     00214000
IPALPARM DS    CL8       IPL load parameter                             00215000
         ORG   IPALPARM                                                 00216000
IPAIODFU DS    CL4       IODF unit address                              00217000
IPALOADS DS    CL2       LOADxx suffix                                  00218000
IPAPROMT DS    CL1       Operator prompt flag. See equates IPAPRxxx     00219000
IPANUCID DS    CL1       Nucleus ID                                     00220000
IPANAMES DS    CL24      System name values                             00221000
         ORG   IPANAMES                                                 00222000
IPAHWNAM DS    CL8       HWNAME value                                   00223000
IPALPNAM DS    CL8       LPARNAME value                                 00224000
IPAVMNAM DS    CL8       VMUSERID value                                 00225000
IPALPDSN DS    CL44      IPL load parameter dataset name                00226000
IPALPDDV DS    CL4       IPL load parameter dataset device number       00227000
IPALOAD  DS    CL2056    LOADxx section                                 00228000
         ORG   IPALOAD                                                  00229000
IPAIODF  DS    CL64      IODF card image                                00230000
         ORG   IPAIODF                                                  00231000
IPAIOSUF DS    CL2       IODF dataset name suffix                       00232000
         DS    CL1       Reserved                                       00233000
IPAIOHLQ DS    CL8       IODF dataset name high-level qualifier         00234000
         DS    CL1       Reserved                                       00235000
IPAIOCFG DS    CL8       Operating system configuration identifier      00236000
         DS    CL1       Reserved                                       00237000
IPAIOEDT DS    CL2       EDT identifier                                 00238000
         DS    CL1       Reserved                                       00239000
IPAIODDS DS    CL1       Load all device support modules ("Y"="        *00240000
                         ", or "N")                                     00241000
         ORG   IPAIODF+64                                               00242000
IPASPARM DS    CL64      SYSPARM card image                             00243000
         ORG   IPASPARM                                                 00244000
IPASPSUF DS    CL2       IEASYSxx suffix                                00245000
         ORG   IPASPARM                                                 00246000
IPASPLST DS    CL63      List of IEASYSxx suffixes in parentheses       00247000
         ORG   IPASPARM+64                                              00248000
IPASCAT  DS    CL64      SYSCAT card image                              00249000
         ORG   IPASCAT                                                  00250000
IPASCVOL DS    CL6       Master catalog VOLSER                          00251000
IPASCTYP DS    CL1       Master catalog type (" "=VSAM, "1"=ICF,       *00252000
                         "2"=ICF and SYS%-SYS1 conversion)              00253000
IPASCANL DS    CL1       Alias name level                               00254000
IPASCCAS DS    CL2       CAS service task lower limit ("18" to "B4")    00255000
IPASCDSN DS    CL44      Master catalog dataset name                    00256000
IPASCHLQ DS    CL8       HLQ of master cat                              00257000
         ORG   IPASCAT+64                                               00258000
IPASYM   DS    CL64      IEASYM card image                              00259000
         ORG   IPASYM                                                   00260000
IPASYSUF DS    CL2       IEASYMxx suffix                                00261000
         ORG   IPASYM                                                   00262000
IPASYLST DS    CL63      List of IEASYMxx suffixes in parentheses       00263000
         ORG   IPASYM+64                                                00264000
IPAPLEX  DS    CL64      SYSPLEX card image                             00265000
         ORG   IPAPLEX                                                  00266000
IPASXNAM DS    CL8       SYSPLEX name                                   00267000
         DS    CL1       Reserved                                       00268000
IPASXSCU DS    CL1       SYSCLONE uniquenes indicator                   00269000
         ORG   IPAPLEX+64                                               00270000
IPAPLIB  DS    CL64      PARMLIB card images                            00271000
         ORG   IPAPLIB                                                  00272000
IPAPLDSN DS    CL44      PARMLIB dataset name                           00273000
         DS    CL1       Reserved                                       00274000
IPAPLVOL DS    CL6       PARMLIB VOLSER                                 00275000
         DS    CL12      Reserved                                       00276000
IPAPLFLG DS    B         PARMLIB usage flags                            00277000
*  Bit definitions:                                                     00278000
IPAPLUSE EQU   X'80'     PARMLIB in use                                 00279000
IPAPLDEF EQU   X'40'     Default PARMLIB                                00280000
IPAPLCAT EQU   X'20'     IPAPLVOL found from catalog                    00281000
IPAPLLCF EQU   X'08'     PARMLIB not used - LOCATE failed               00282000
IPAPLMNF EQU   X'04'     PARMLIB not used - MOUNT failed                00283000
IPAPLOPF EQU   X'02'     PARMLIB not used - OPEN failed                 00284000
         ORG   IPAPLIB+1088                                             00285000
IPASTMTMM DS   CL64      This is not part of the programming           *00286000
                         interface.                                     00287000
         ORG   IPASTMTMM+192                                            00288000
IPASTMT  DS    CL64      Reserved, use from the end in case we need to *00289000
                         add more MACHMIG statements                    00290000
         ORG   IPASTMT+384                                              00291000
         DS    CL40      Reserved                                       00292000
IPAILTOD DS    CL8       Local time at completion of system            *00293000
                         initialization, in TOD format.                 00294000
IPAMACHMIGADDR DS A      Address of MACHMIG statements. This is an     *00295000
                         array of 64-character card images. The number *00296000
                         of array entries is indicated by              *00297000
                         IPANumMachmigs                                 00298000
IPANUMMACHMIGS DS H      Number of MACHMIG statements                   00299000
IPAPLNUMX DS   H         Number of PARMLIB card images. The card       *00300000
                         images must be found by using field IPAPLIB@. *00301000
                         This field will be 0 (as will IPAPLIB@) on    *00302000
                         older systems where IPAPLNUMX is not          *00303000
                         functional.                                    00304000
IPAPLIB@ DS    A         Address of PARMLIB card images when IPAPLNUMX *00305000
                         is non-zero. The card images are contiguous.  *00306000
                         Each PARMLIB card is mapped by DSECT IPAPLI    00307000
IPANUMPDES DS  H         Number of parameter descriptor elements in    *00308000
                         IPASYS                                         00309000
IPAMTLSH DS    CL1       MTLSHARE VALUE                                 00310000
IPAARCHL DS    CL1       Architecture Level                             00311000
IPANUCL  DS    CL4       NUCLST information                             00312000
         ORG   IPANUCL                                                  00313000
IPANLID  DS    CL2       NUCLSTxx member used                           00314000
IPANUCW  DS    CL1       Load wait state if NUCLSTxx INCLUDE member    *00315000
                         not found                                      00316000
         DS    CL1       Reserved                                       00317000
IPAPLNUM DS    H         Number of PARMLIB card images. You can find   *00318000
                         the PARMLIB images in the IPAPLIB field of    *00319000
                         this mapping. This is the "old" field. It is  *00320000
                         preferred that you use IPAPLNUMX. If the      *00321000
                         number of user-specifiable parmlibs ever      *00322000
                         exceeds 16 (which could mean that there are   *00323000
                         17 total parmlibs, if the system has added    *00324000
                         SYS1.PARMLIB), IPAPLNUM will never exceed 17. *00325000
                         At such a time, IPAPLNUMX and IPAPLIB would   *00326000
                         have to be used to get the entire list.        00327000
IPALFLAG DS    B         LOADxx usage flags                             00328000
*  Bit definitions:                                                     00329000
IPAJCLP  EQU   X'80'     Master JCL came from PARMLIB                   00330000
IPAUJCL  EQU   X'40'     Use Master JCL IEFPARMs instead of LOADxx     *00331000
                         PARMLIBs                                       00332000
IPANUCXID DS   CL1       Nucleus extension ID                           00333000
IPASYS   DS    CL896     IEASYSxx section                               00334000
         ORG   IPASYS                                                   00335000
IPAPDES  DS    CL8       Parameter descriptor elements                  00336000
         ORG   IPASYS                                                   00337000
IPAPDESC DS    CL896     Individual parameter descriptors               00338000
         ORG   IPAPDESC                                                 00339000
IPAALLOC DS    CL8                                                      00340000
*                                                                       00341000
*                                      PDE for ALLOC                    00342000
*                                                                       00343000
IPAAPF   DS    CL8                                                      00344000
*                                                                       00345000
*                                      PDE for APF                      00346000
*                                                                       00347000
IPAAPG   DS    CL8                                                      00348000
*                                                                       00349000
*                                      PDE for APG                      00350000
*                                                                       00351000
IPABLDL  DS    CL8                                                      00352000
*                                                                       00353000
*                                      PDE for BLDL                     00354000
*                                                                       00355000
IPABLDLF DS    CL8                                                      00356000
*                                                                       00357000
*                                      PDE for BLDLF                    00358000
*                                                                       00359000
IPACLOCK DS    CL8                                                      00360000
*                                                                       00361000
*                                      PDE for CLOCK                    00362000
*                                                                       00363000
IPACLPA  DS    CL8                                                      00364000
*                                                                       00365000
*                                      PDE for CLPA                     00366000
*                                                                       00367000
IPACMB   DS    CL8                                                      00368000
*                                                                       00369000
*                                      PDE for CMB                      00370000
*                                                                       00371000
IPACMD   DS    CL8                                                      00372000
*                                                                       00373000
*                                      PDE for CMD                      00374000
*                                                                       00375000
IPACON   DS    CL8                                                      00376000
*                                                                       00377000
*                                      PDE for CON                      00378000
*                                                                       00379000
IPACONT  DS    CL8                                                      00380000
*                                                                       00381000
*                                      PDE for CONT                     00382000
*                                                                       00383000
IPACOUPL DS    CL8                                                      00384000
*                                                                       00385000
*                                      PDE for COUPLE                   00386000
*                                                                       00387000
IPACPQE  DS    CL8                                                      00388000
*                                                                       00389000
*                                      PDE for CPQE                     00390000
*                                                                       00391000
IPACSA   DS    CL8                                                      00392000
*                                                                       00393000
*                                      PDE for CSA                      00394000
*                                                                       00395000
IPACSCBL DS    CL8                                                      00396000
*                                                                       00397000
*                                      PDE for CSCBLOC                  00398000
*                                                                       00399000
IPACVIO  DS    CL8                                                      00400000
*                                                                       00401000
*                                      PDE for CVIO                     00402000
*                                                                       00403000
IPADEVSU DS    CL8                                                      00404000
*                                                                       00405000
*                                      PDE for DEVSUP                   00406000
*                                                                       00407000
IPADIAG  DS    CL8                                                      00408000
*                                                                       00409000
*                                      PDE for DIAG                     00410000
*                                                                       00411000
IPADUMP  DS    CL8                                                      00412000
*                                                                       00413000
*                                      PDE for DUMP                     00414000
*                                                                       00415000
IPADUPLE DS    CL8                                                      00416000
*                                                                       00417000
*                                      PDE for DUPLEX                   00418000
*                                                                       00419000
IPAEXIT  DS    CL8                                                      00420000
*                                                                       00421000
*                                      PDE for EXIT                     00422000
*                                                                       00423000
IPAFIX   DS    CL8                                                      00424000
*                                                                       00425000
*                                      PDE for FIX                      00426000
*                                                                       00427000
IPAGRS   DS    CL8                                                      00428000
*                                                                       00429000
*                                      PDE for GRS                      00430000
*                                                                       00431000
IPAGRSCN DS    CL8                                                      00432000
*                                                                       00433000
*                                      PDE for GRSCNF                   00434000
*                                                                       00435000
IPAGRSRN DS    CL8                                                      00436000
*                                                                       00437000
*                                      PDE for GRSRNL                   00438000
*                                                                       00439000
IPAICS   DS    CL8                                                      00440000
*                                                                       00441000
*                                      PDE for ICS                      00442000
*                                                                       00443000
IPAIOS   DS    CL8                                                      00444000
*                                                                       00445000
*                                      PDE for IOS                      00446000
*                                                                       00447000
IPAIPS   DS    CL8                                                      00448000
*                                                                       00449000
*                                      PDE for IPS                      00450000
*                                                                       00451000
IPALNK   DS    CL8                                                      00452000
*                                                                       00453000
*                                      PDE for LNK                      00454000
*                                                                       00455000
IPALNKAU DS    CL8                                                      00456000
*                                                                       00457000
*                                      PDE for LNKAUTH                  00458000
*                                                                       00459000
IPALOGCL DS    CL8                                                      00460000
*                                                                       00461000
*                                      PDE for LOGCLS                   00462000
*                                                                       00463000
IPALOGLM DS    CL8                                                      00464000
*                                                                       00465000
*                                      PDE for LOGLMT                   00466000
*                                                                       00467000
IPALOGRE DS    CL8                                                      00468000
*                                                                       00469000
*                                      PDE for LOGREC                   00470000
*                                                                       00471000
IPALPA   DS    CL8                                                      00472000
*                                                                       00473000
*                                      PDE for LPA                      00474000
*                                                                       00475000
IPAMAXCA DS    CL8                                                      00476000
*                                                                       00477000
*                                      PDE for MAXCAD                   00478000
*                                                                       00479000
IPAMAXUS DS    CL8                                                      00480000
*                                                                       00481000
*                                      PDE for MAXUSER                  00482000
*                                                                       00483000
IPAMLPA  DS    CL8                                                      00484000
*                                                                       00485000
*                                      PDE for MLPA                     00486000
*                                                                       00487000
IPAMSTRJ DS    CL8                                                      00488000
*                                                                       00489000
*                                      PDE for MSTRJCL                  00490000
*                                                                       00491000
IPANONVI DS    CL8                                                      00492000
*                                                                       00493000
*                                      PDE for NONVIO                   00494000
*                                                                       00495000
IPANSYSL DS    CL8                                                      00496000
*                                                                       00497000
*                                      PDE for NSYSLX                   00498000
*                                                                       00499000
IPANUCMA DS    CL8                                                      00500000
*                                                                       00501000
*                                      PDE for NUCMAP                   00502000
*                                                                       00503000
IPAOMVS  DS    CL8                                                      00504000
*                                                                       00505000
*                                      PDE for OMVS                     00506000
*                                                                       00507000
IPAOPI   DS    CL8                                                      00508000
*                                                                       00509000
*                                      PDE for OPI                      00510000
*                                                                       00511000
IPAOPT   DS    CL8                                                      00512000
*                                                                       00513000
*                                      PDE for OPT                      00514000
*                                                                       00515000
IPAPAGEO DS    CL8                                                      00516000
*                                                                       00517000
*                                      PDE for PAGE                     00518000
*                                      (operator-specified              00519000
*                                                                       00520000
IPAPAGEP DS    CL8                                                      00521000
*                                                                       00522000
*                                      PDE for PAGE                     00523000
*                                      (IEASYSxx-specified              00524000
*                                                                       00525000
IPAPAGNU DS    CL8                                                      00526000
*                                                                       00527000
*                                      PDE for PAGNUM                   00528000
*                                                                       00529000
IPAPAGTO DS    CL8                                                      00530000
*                                                                       00531000
*                                      PDE for PAGTOTL                  00532000
*                                                                       00533000
IPAPAK   DS    CL8                                                      00534000
*                                                                       00535000
*                                      PDE for PAK                      00536000
*                                                                       00537000
IPAPLEXC DS    CL8                                                      00538000
*                                                                       00539000
*                                      PDE for PLEXCFG                  00540000
*                                                                       00541000
IPAPRODP DS    CL8                                                      00542000
*                                                                       00543000
*                                      PDE for PRODP                    00544000
*                                                                       00545000
IPAPROG  DS    CL8                                                      00546000
*                                                                       00547000
*                                      PDE for PROG                     00548000
*                                                                       00549000
IPAPURGE DS    CL8                                                      00550000
*                                                                       00551000
*                                      PDE for PURGE                    00552000
*                                                                       00553000
IPARDE   DS    CL8                                                      00554000
*                                                                       00555000
*                                      PDE for RDE                      00556000
*                                                                       00557000
IPAREAL  DS    CL8                                                      00558000
*                                                                       00559000
*                                      PDE for REAL                     00560000
*                                                                       00561000
IPARER   DS    CL8                                                      00562000
*                                                                       00563000
*                                      PDE for RER                      00564000
*                                                                       00565000
IPARSU   DS    CL8                                                      00566000
*                                                                       00567000
*                                      PDE for RSU                      00568000
*                                                                       00569000
IPARSVNO DS    CL8                                                      00570000
*                                                                       00571000
*                                      PDE for RSVNONR                  00572000
*                                                                       00573000
IPARSVST DS    CL8                                                      00574000
*                                                                       00575000
*                                      PDE for RSVSTRT                  00576000
*                                                                       00577000
IPASCH   DS    CL8                                                      00578000
*                                                                       00579000
*                                      PDE for SCH                      00580000
*                                                                       00581000
IPASMF   DS    CL8                                                      00582000
*                                                                       00583000
*                                      PDE for SMF                      00584000
*                                                                       00585000
IPASMS   DS    CL8                                                      00586000
*                                                                       00587000
*                                      PDE for SMS                      00588000
*                                                                       00589000
IPASQA   DS    CL8                                                      00590000
*                                                                       00591000
*                                      PDE for SQA                      00592000
*                                                                       00593000
IPASSN   DS    CL8                                                      00594000
*                                                                       00595000
*                                      PDE for SSN                      00596000
*                                                                       00597000
IPASVC   DS    CL8                                                      00598000
*                                                                       00599000
*                                      PDE for SVC                      00600000
*                                                                       00601000
IPASWAP  DS    CL8                                                      00602000
*                                                                       00603000
*                                      PDE for SWAP                     00604000
*                                                                       00605000
IPASYSNA DS    CL8                                                      00606000
*                                                                       00607000
*                                      PDE for SYSNAME                  00608000
*                                                                       00609000
IPASYSP  DS    CL8                                                      00610000
*                                                                       00611000
*                                      PDE for SYSP                     00612000
*                                                                       00613000
IPAVAL   DS    CL8                                                      00614000
*                                                                       00615000
*                                      PDE for VAL                      00616000
*                                                                       00617000
IPAVIODS DS    CL8                                                      00618000
*                                                                       00619000
*                                      PDE for VIODSN                   00620000
*                                                                       00621000
IPAVRREG DS    CL8                                                      00622000
*                                                                       00623000
*                                      PDE for VRREGN                   00624000
*                                                                       00625000
IPARTLSP DS    CL8                                                      00626000
*                                                                       00627000
*                                      Support for RTLS has been        00628000
*                                      withdrawn                        00629000
*                                                                       00630000
IPAUNIP  DS    CL8                                                      00631000
*                                                                       00632000
*                                      PDE for UNI                      00633000
*                                                                       00634000
IPAILML  DS    CL8                                                      00635000
*                                                                       00636000
*                                      Support for ILM has been         00637000
*                                      withdrawn                        00638000
*                                                                       00639000
IPAILMOD DS    CL8                                                      00640000
*                                                                       00641000
*                                      Support for ILM has been         00642000
*                                      withdrawn                        00643000
*                                                                       00644000
IPATSO   DS    CL8                                                      00645000
*                                                                       00646000
*                                      PDE for IKJTSO                   00647000
*                                                                       00648000
IPALIC   DS    CL8                                                      00649000
*                                                                       00650000
*                                      PDE for LICENSE 010409           00651000
*                                                                       00652000
         DS    CL8                                                      00653000
IPAHVSHARE DS  CL8       PDE for VSHAR                                  00654000
IPAILM   DS    CL8                                                      00655000
*                                                                       00656000
*                                      Support for ILM has been         00657000
*                                      withdrawn                        00658000
*                                                                       00659000
IPADRMOD DS    CL8                                                      00660000
*                                                                       00661000
*                                      PDE for DRMODE                   00662000
*                                                                       00663000
IPACEE   DS    CL8                                                      00664000
*                                                                       00665000
*                                      PDE for CEE                      00666000
*                                                                       00667000
IPAPRCPU DS    CL8                                                      00668000
*                                                                       00669000
*                                      PDE for PRESCPU                  00670000
*                                                                       00671000
IPALFAREA DS   CL8       PDE for LFAREA                                 00672000
IPACEA   DS    CL8                                                      00673000
*                                                                       00674000
*                                      PDE for CEA                      00675000
*                                                                       00676000
IPAHVCOMMON DS CL8       PDE for VCOMM                                  00677000
IPAAXR   DS    CL8                                                      00678000
*                                                                       00679000
*                                      PDE for AXR                      00680000
*                                                                       00681000
IPAZAAPZIIP DS CL8       PDE for zAAPzIIP (ZZ)                          00682000
IPAIQP   DS    CL8                                                      00683000
*                                                                       00684000
*                                      PDE for IQP                      00685000
*                                                                       00686000
IPACPCR  DS    CL8                                                      00687000
*                                                                       00688000
*                                      PDE for CPCR                     00689000
*                                                                       00690000
IPADDM   DS    CL8                                                      00691000
*                                                                       00692000
*                                      PDE for DDM                      00693000
*                                                                       00694000
IPAAUTOR DS    CL8                                                      00695000
*                                                                       00696000
*                                      PDE for AUTOR                    00697000
*                                                                       00698000
IPACATALOG DS  CL8       PDE for CATALOG                                00699000
IPAIXGCNF DS   CL8       PDE for IXGCNF                                 00700000
IPAPAGESCM DS  CL8       PDE for PAGESCM                                00701000
IPAWARNUND DS  CL8       PDE for WARNUND                                00702000
IPAHZS   DS    CL8                                                      00703000
*                                                                       00704000
*                                      PDE for HZS                      00705000
*                                                                       00706000
IPAGTZ   DS    CL8                                                      00707000
*                                                                       00708000
*                                      PDE for GTZ                      00709000
*                                                                       00710000
IPAHZSPROC DS  CL8       PDE for HZSPROC                                00711000
IPASMFLIM DS   CL8       PDE for SMFLIM                                 00712000
IPAIEFOPZ DS   CL8       PDE for IEFOPZ                                 00713000
IPARACF  DS    CL8                                                      00714000
*                                                                       00715000
*                                      PDE for RACF                     00716000
*                                                                       00717000
IPAFXE   DS    CL8                                                      00718000
*                                                                       00719000
*                                      PDE for FXE                      00720000
*                                                                       00721000
IPAIZU   DS    CL8                                                      00722000
*                                                                       00723000
*                                      PDE for IZU                      00724000
*                                                                       00725000
IPASMFTBUFF DS CL8       PDE for SMFTBUFF                               00726000
IPASOLUT DS    CL8                                                      00727000
*                                                                       00728000
*                                      PDE for SOLUT                    00729000
*                                                                       00730000
IPAOSPROTECT DS CL8      PDE for OSPROTECT                              00731000
IPAICSF  DS    CL8                                                      00732000
*                                                                       00733000
*                                      PDE for ICSF                     00734000
*                                                                       00735000
IPAICSFPROC DS CL8       PDE for ICSFPROC                               00736000
IPARUCSA DS    CL8                                                      00737000
*                                                                       00738000
*                                      PDE for RUCSA                    00739000
*                                                                       00740000
IPABOOST DS    CL8                                                      00741000
*                                                                       00742000
*                                      PDE for BOOST                    00743000
*                                                                       00744000
IPACRYPCTRS DS CL8       PDE for CRYPCTRS                               00745000
IPAPDESC_END DS 0C                                                      00746000
IPAEND   DS    0C        End of IPA. The number of elements in         *00747000
                         IPAPDESC must be less than or equal to the    *00748000
                         dimension of IPAPDES.                          00749000
*                                                                       00750000
*  ?ASAXMAC ASSERT(Dim(IPAPDES)*Length(IPAPDE),EQ,Length(IPAPDESC))     00751000
*                                                                       00752000
*                                                                       00753000
*                                      ?ASAXMAC ASSERT(Dim(IPAPDES)*L   00754000
*                                      ength(IPAPDE),EQ,Length(IPAPDE   00755000
*                                      SC))                             00756000
*                                                                       00757000
ASSERT_EQ1_1 EQU 0                                                      00758000
ASSERT_EQ2_1 EQU 0                                                      00759000
*                                                                       00760000
*                                                                       00761000
*                                                                       00762000
*    *****************************************************************  00763000
*    *                                                               *  00764000
*    * Constants for IPAHEAD                                         *  00765000
*    *                                                               *  00766000
*    *****************************************************************  00767000
*                                                                       00768000
*                                                                       00769000
IPAIPA   EQU   C'IPA '   Eye-catcher                                    00770000
IPASPN   EQU   241       IPA subpool                                    00771000
IPACVN   EQU   1         IPA current version                            00772000
*                                                                       00773000
*    *****************************************************************  00774000
*    *                                                               *  00775000
*    * Constants for IPAPROMT (the last three letters of the name    *  00776000
*    * indicate the effects of IPLing with that prompt value: the    *  00777000
*    * sixth letter indicates whether ("Y") or not ("N") the master  *  00778000
*    * catalog prompt is issued, the seventh letter indicates whether*  00779000
*    * or not the system parameters prompt is issued, and the eighth *  00780000
*    * letter indicates whether or not IPL messages are displayed)   *  00781000
*    *                                                                  00782000
*    *                                                               *  00783000
*    *****************************************************************  00784000
*                                                                       00785000
*                                                                       00786000
IPAPRYYY EQU   C'A'                                                     00787000
IPAPRYYN EQU   C'P'                                                     00788000
IPAPRNNY EQU   C'M'                                                     00789000
IPAPRNNN EQU   C' '                                                     00790000
IPAPRYNN EQU   C'C'                                                     00791000
IPAPRYNY EQU   C'D'                                                     00792000
IPAPRNYN EQU   C'S'                                                     00793000
IPAPRNYY EQU   C'T'                                                     00794000
IPA_LEN  EQU   *-IPA                                                    00795000
.L0002   ANOP                                                           00796000
         AIF   ('&IPAPDE' EQ 'NO').L0005                                00797000
         AIF   ('&DSECT' EQ 'YES').L0006                                00798000
         AIF   ('&IPAPDE' NE 'YES').L0005                               00799000
IPAPDE   DS    0D        Parameter descriptor element                   00800000
         AGO   .L0007                                                   00801000
.L0006   ANOP                                                           00802000
IPAPDE   DSECT           Parameter descriptor element                   00803000
.L0007   ANOP                                                           00804000
IPAPDESA DS    A         Address of parameter string (will be zero if  *00805000
                         the parameter was not specified and has no    *00806000
                         default value)                                 00807000
IPAPDESL DS    H         Length of parameter string, not including     *00808000
                         trailing null ('00'X) delimiter (will be zero *00809000
                         if the parameter was not specified and has no *00810000
                         default value)                                 00811000
IPAPDEDO DS    H         Source of parameter string (default value or  *00812000
                         from operator)                                 00813000
         ORG   IPAPDEDO                                                 00814000
IPAPDESS DS    CL2       Source of parameter string (IEASYSxx member)   00815000
*                                                                       00816000
*    *****************************************************************  00817000
*    *                                                               *  00818000
*    * Constants for IPAPDEDO                                        *  00819000
*    *                                                               *  00820000
*    *****************************************************************  00821000
*                                                                       00822000
*                                                                       00823000
IPAPDEDF EQU   0         Parameter was not specified and its default   *00824000
                         value was used by system initialization        00825000
IPAPDEOP EQU   -1        Operator provided the parameter value          00826000
IPAPDE_LEN EQU *-IPAPDE                                                 00827000
.L0005   ANOP                                                           00828000
         AIF   ('&IPAPLI' EQ 'NO').L0008                                00829000
         AIF   ('&DSECT' EQ 'YES').L0009                                00830000
         AIF   ('&IPAPLI' NE 'YES').L0008                               00831000
IPAPLI   DS    0X        Parmlib card image                             00832000
         AGO   .L000A                                                   00833000
.L0009   ANOP                                                           00834000
IPAPLI   DSECT           Parmlib card image                             00835000
.L000A   ANOP                                                           00836000
IPAPLIDSN DS   CL44      PARMLIB dataset name                           00837000
         DS    CL1       Reserved                                       00838000
IPAPLIVOL DS   CL6       PARMLIB VOLSER                                 00839000
         DS    CL12      Reserved                                       00840000
IPAPLIFLG DS   B         PARMLIB usage flags                            00841000
*  Bit definitions:                                                     00842000
IPAPLIUSE EQU  X'80'     PARMLIB in use                                 00843000
IPAPLIDEF EQU  X'40'     Default PARMLIB                                00844000
IPAPLICAT EQU  X'20'     IPAPLIVOL found from catalog                   00845000
IPAPLILCF EQU  X'08'     PARMLIB not used - LOCATE failed               00846000
IPAPLIMNF EQU  X'04'     PARMLIB not used - MOUNT failed                00847000
IPAPLIOPF EQU  X'02'     PARMLIB not used - OPEN failed                 00848000
         ORG   IPAPLI+64                                                00849000
IPAPLI_LEN EQU *-IPAPLI                                                 00850000
.L0008   ANOP                                                           00851000
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 00852000
         AIF   ('&LIST' EQ 'YES').P4                                    00853000
.P3      ANOP                                                           00854000
         POP   PRINT                                                    00855000
.P4      ANOP                                                           00856000
.P_EXIT  ANOP                                                           00857000
         MEND                                                           00858000
**/ ;                                                                   00859000
* %IHAIPA_INCLUDED = 'YES';                                             00860000
* %DCL ZCBPRINT CHAR EXT;                                               00861000
* %DEACTIVATE ZCBPRINT;                                                 00862000
* %DCL IHAIPA_LIST CHAR EXT;                                            00863000
* %DEACTIVATE IHAIPA_LIST;                                              00864000
* %IF IHAIPA_LIST = 'NO' !                                              00865000
*    ZCBPRINT = 'NO' %THEN                                              00866000
* %DO;                                                                  00867000
*   @LIST PUSH NOECHO;                                                  00868000
*   @LIST NOASSEMBLE NOECHO;                                            00869000
*   @LIST OFF C NOECHO;                                                 00870000
* %END;                                                                 00871000
*/* Start of PL/X Source                                             */ 00872000
*%IF IHAIPA_BASE = '' %THEN            /* Default scope/storage  @P3A*/ 00873000
*  %IHAIPA_BASE = 'Based(ECVTIPA)';    /* Scope/storage class    @P3A*/ 00874000
*Dcl 1 IPA IHAIPA_BASE Bdy(Dword),     /* Initialization Parameter      00875000
*                                         Area                   @P3C*/ 00876000
*      3 IPAHEAD Bdy(Dword),           /* Header section             */ 00877000
*        5 IPAID          Char(4),     /* Eye-catcher                */ 00878000
*        5 IPALEN         Fixed(15),   /* Length                     */ 00879000
*        5 IPASP          Fixed(8),    /* Subpool                    */ 00880000
*        5 IPAVER         Fixed(8),    /* Version number             */ 00881000
*        5 IPAICTOD       Char(8),     /* TOD at completion of          00882000
*                                         system initialization      */ 00883000
*        5 IPALPARM       Char(8),     /* IPL load parameter         */ 00884000
*          7 IPAIODFU     Char(4),     /* IODF unit address          */ 00885000
*          7 IPALOADS     Char(2),     /* LOADxx suffix              */ 00886000
*          7 IPAPROMT     Char(1),     /* Operator prompt flag.         00887000
*                               See equates IPAPRxxx                 */ 00888000
*          7 IPANUCID     Char(1),     /* Nucleus ID                 */ 00889000
*        5 IPANAMES,                   /* System name values         */ 00890000
*          7 IPAHWNAM     Char(8),     /* HWNAME value               */ 00891000
*          7 IPALPNAM     Char(8),     /* LPARNAME value             */ 00892000
*          7 IPAVMNAM     Char(8),     /* VMUSERID value             */ 00893000
*        5 IPALPDSN       Char(44),    /* IPL load parameter            00894000
*                                         dataset name               */ 00895000
*        5 IPALPDDV       Char(4),     /* IPL load parameter            00896000
*                                         dataset device number      */ 00897000
*      3 IPALOAD Bdy(Dword),           /* LOADxx section             */ 00898000
*        5 IPAIODF        Char(64),    /* IODF card image            */ 00899000
*          7 IPAIOSUF     Char(2),     /* IODF dataset name suffix   */ 00900000
*          7 *            Char(1),     /* Reserved                   */ 00901000
*          7 IPAIOHLQ     Char(8),     /* IODF dataset name             00902000
*                                         high-level qualifier       */ 00903000
*          7 *            Char(1),     /* Reserved                   */ 00904000
*          7 IPAIOCFG     Char(8),     /* Operating system              00905000
*                                         configuration identifier   */ 00906000
*          7 *            Char(1),     /* Reserved                   */ 00907000
*          7 IPAIOEDT     Char(2),     /* EDT identifier             */ 00908000
*          7 *            Char(1),     /* Reserved                   */ 00909000
*          7 IPAIODDS     Char(1),     /* Load all device support       00910000
*                                         modules ("Y"=" ", or "N")  */ 00911000
*        5 IPASPARM       Char(64) Union,                               00912000
*                                      /* SYSPARM card image     @L2C*/ 00913000
*          7 IPASPSUF   Char(2),       /* IEASYSxx suffix        @L2C*/ 00914000
*          7 IPASPLST   Char(63),      /* List of IEASYSxx suffixes     00915000
*                                         in parentheses         @L2C*/ 00916000
*        5 IPASCAT        Char(64),    /* SYSCAT card image          */ 00917000
*          7 IPASCVOL     Char(6),     /* Master catalog VOLSER      */ 00918000
*          7 IPASCTYP     Char(1),     /* Master catalog type           00919000
*                                         (" "=VSAM, "1"=ICF,           00920000
*                                          "2"=ICF and SYS%-SYS1        00921000
*                                          conversion)               */ 00922000
*          7 IPASCANL     Char(1),     /* Alias name level           */ 00923000
*          7 IPASCCAS     Char(2),     /* CAS service task lower        00924000
*                                         limit ("18" to "B4")       */ 00925000
*          7 IPASCDSN     Char(44),    /* Master catalog dataset name*/ 00926000
*          7 IPASCHLQ     Char(8),     /* HLQ of master cat          */ 00927000
*        5 IPASYM         Char(64) Union,                               00928000
*                                      /* IEASYM card image      @L2C*/ 00929000
*          7 IPASYSUF   Char(2),       /* IEASYMxx suffix        @L2C*/ 00930000
*          7 IPASYLST   Char(63),      /* List of IEASYMxx suffixes     00931000
*                                         in parentheses         @L2C*/ 00932000
*        5 IPAPLEX        Char(64),    /* SYSPLEX card image         */ 00933000
*          7 IPASXNAM     Char(8),     /* SYSPLEX name               */ 00934000
*          7 *            Char(1),     /* Reserved                   */ 00935000
*          7 IPASXSCU     Char(1),     /* SYSCLONE uniquenes            00936000
*                                         indicator                  */ 00937000
*        5 IPAPLIB(17)    Char(64),    /* PARMLIB card images    @P2C*/ 00938000
*          7 IPAPLDSN     Char(44),    /* PARMLIB dataset name       */ 00939000
*          7 *            Char(1),     /* Reserved                   */ 00940000
*          7 IPAPLVOL     Char(6),     /* PARMLIB VOLSER             */ 00941000
*          7 *            Char(12),    /* Reserved                   */ 00942000
*          7 IPAPLFLG     Bit(8),      /* PARMLIB usage flags        */ 00943000
*            9 IPAPLUSE   Bit(1),      /* PARMLIB in use             */ 00944000
*            9 IPAPLDEF   Bit(1),      /* Default PARMLIB            */ 00945000
*            9 IPAPLCAT   Bit(1),      /* IPAPLVOL found from catalog*/ 00946000
*            9 *          Bit(1),      /* Reserved                   */ 00947000
*            9 IPAPLLCF   Bit(1),      /* PARMLIB not used -            00948000
*                                         LOCATE failed              */ 00949000
*            9 IPAPLMNF   Bit(1),      /* PARMLIB not used -            00950000
*                                         MOUNT failed               */ 00951000
*            9 IPAPLOPF   Bit(1),      /* PARMLIB not used -            00952000
*                                         OPEN failed                */ 00953000
*            9 *          Bit(1),      /* Reserved                   */ 00954000
*        5 IPASTMTMM(3)   Char(64),    /* This is not part of the       00955000
*                           programming interface.               @LTA*/ 00956000
*        5 IPASTMT(6)     Char(64),    /* Reserved, use from the        00957000
*                           end in case we need to add more MACHMIG     00958000
*                           statements                           @LTC*/ 00959000
*        5 * CHAR(40),                 /* Reserved               @03C*/ 00960000
*        5 IPAILTOD CHAR(8),           /* Local time at completion of   00961000
*                                         system initialization, in     00962000
*                                         TOD format.            @03A*/ 00963000
*        5 IPAMachmigAddr Ptr(31),     /* Address of MACHMIG            00964000
*                           statements. This is an array of             00965000
*                           64-character card images. The number of     00966000
*                           array entries is indicated by               00967000
*                           IPANumMachmigs                       @LTA*/ 00968000
*        5 IPANumMachMigs Fixed(15),   /* Number of MACHMIG statements  00969000
*                                                                @LTA*/ 00970000
*        5 IPAPLNUMX      Fixed(15),   /* Number of PARMLIB card        00971000
*                           images. The card images must be found       00972000
*                           by using field IPAPLIB@. This field will    00973000
*                           be 0 (as will IPAPLIB@) on older systems    00974000
*                           where IPAPLNUMX is not functional.   @P2A*/ 00975000
*        5 IPAPLIB@       Ptr(31),     /* Address of PARMLIB card       00976000
*                           images when IPAPLNUMX is non-zero.          00977000
*                           The card images are contiguous.             00978000
*                           Each PARMLIB card is mapped by DSECT        00979000
*                           IPAPLI                               @P2A*/ 00980000
*        5 IPANumPDEs     Fixed(15),   /* Number of parameter           00981000
*                           descriptor elements in IPASYS        @LMA*/ 00982000
*        5 IPAMTLSH       CHAR(1),     /* MTLSHARE VALUE         @02A*/ 00983000
*        5 IPAARCHL       Char(1),     /* Architecture Level     @L6A*/ 00984000
*        5 IPANUCL        Char(4),     /* NUCLST information         */ 00985000
*          7 IPANLID      Char(2),     /* NUCLSTxx member used       */ 00986000
*          7 IPANUCW      Char(1),     /* Load wait state if NUCLSTxx   00987000
*                                         INCLUDE member not found   */ 00988000
*          7 *            Char(1),     /* Reserved                   */ 00989000
*        5 IPAPLNUM       Fixed(15),   /* Number of PARMLIB card        00990000
*                           images. You can find the PARMLIB images     00991000
*                           in the IPAPLIB field of this mapping.       00992000
*                           This is the "old" field. It is preferred    00993000
*                           that you use IPAPLNUMX. If the number       00994000
*                           of user-specifiable parmlibs ever exceeds   00995000
*                           16 (which could mean that there are 17      00996000
*                           total parmlibs, if the system has added     00997000
*                           SYS1.PARMLIB), IPAPLNUM will never          00998000
*                           exceed 17. At such a time, IPAPLNUMX        00999000
*                           and IPAPLIB@ would have to be used to get   01000000
*                           the entire list.                     @P2C*/ 01001000
*        5 IPALFLAG       Bit(8),      /* LOADxx usage flags     @L6C*/ 01002000
*          7 IPAJCLP      Bit(1),      /* Master JCL came from          01003000
*                                         PARMLIB                @L2A*/ 01004000
*          7 IPAUJCL      Bit(1),      /* Use Master JCL IEFPARMs       01005000
*                                         instead of LOADxx PARMLIBs    01006000
*                                                                @L2A*/ 01007000
*          7 *            Bit(6),      /*                        @L6C*/ 01008000
*        5 IPANucxID      CHAR(1),     /* Nucleus extension ID   @L6A*/ 01009000
*      3 IPASYS  Union Bdy(Dword),     /* IEASYSxx section           */ 01010000
*        5 IPAPDES(112)   Char(Length(IPAPDE)) Like(IPAPDE) Bdy(Dword)  01011000
*                         ,            /* Parameter descriptor          01012000
*                                         elements               @0EC*/ 01013000
*        5 IPAPDESC Bdy(Dword),        /* Individual parameter          01014000
*                                         descriptors                */ 01015000
*          7 IPAALLOC     Char(Length(IPAPDE)) Like(IPAPDE) Bdy(Dword), 01016000
*                                      /* PDE for ALLOC              */ 01017000
*          7 IPAAPF       Char(Length(IPAPDE)) Like(IPAPDE) Bdy(Dword), 01018000
*                                      /* PDE for APF                */ 01019000
*          7 IPAAPG       Char(Length(IPAPDE)) Like(IPAPDE) Bdy(Dword), 01020000
*                                      /* PDE for APG                */ 01021000
*          7 IPABLDL      Char(Length(IPAPDE)) Like(IPAPDE) Bdy(Dword), 01022000
*                                      /* PDE for BLDL               */ 01023000
*          7 IPABLDLF     Char(Length(IPAPDE)) Like(IPAPDE) Bdy(Dword), 01024000
*                                      /* PDE for BLDLF              */ 01025000
*          7 IPACLOCK     Char(Length(IPAPDE)) Like(IPAPDE) Bdy(Dword), 01026000
*                                      /* PDE for CLOCK              */ 01027000
*          7 IPACLPA      Char(Length(IPAPDE)) Like(IPAPDE) Bdy(Dword), 01028000
*                                      /* PDE for CLPA               */ 01029000
*          7 IPACMB       Char(Length(IPAPDE)) Like(IPAPDE) Bdy(Dword), 01030000
*                                      /* PDE for CMB                */ 01031000
*          7 IPACMD       Char(Length(IPAPDE)) Like(IPAPDE) Bdy(Dword), 01032000
*                                      /* PDE for CMD                */ 01033000
*          7 IPACON       Char(Length(IPAPDE)) Like(IPAPDE) Bdy(Dword), 01034000
*                                      /* PDE for CON                */ 01035000
*          7 IPACONT      Char(Length(IPAPDE)) Like(IPAPDE) Bdy(Dword), 01036000
*                                      /* PDE for CONT               */ 01037000
*          7 IPACOUPL     Char(Length(IPAPDE)) Like(IPAPDE) Bdy(Dword), 01038000
*                                      /* PDE for COUPLE             */ 01039000
*          7 IPACPQE      Char(Length(IPAPDE)) Like(IPAPDE) Bdy(Dword), 01040000
*                                      /* PDE for CPQE               */ 01041000
*          7 IPACSA       Char(Length(IPAPDE)) Like(IPAPDE) Bdy(Dword), 01042000
*                                      /* PDE for CSA                */ 01043000
*          7 IPACSCBL     Char(Length(IPAPDE)) Like(IPAPDE) Bdy(Dword), 01044000
*                                      /* PDE for CSCBLOC            */ 01045000
*          7 IPACVIO      Char(Length(IPAPDE)) Like(IPAPDE) Bdy(Dword), 01046000
*                                      /* PDE for CVIO               */ 01047000
*          7 IPADEVSU     Char(Length(IPAPDE)) Like(IPAPDE) Bdy(Dword), 01048000
*                                      /* PDE for DEVSUP             */ 01049000
*          7 IPADIAG      Char(Length(IPAPDE)) Like(IPAPDE) Bdy(Dword), 01050000
*                                      /* PDE for DIAG               */ 01051000
*          7 IPADUMP      Char(Length(IPAPDE)) Like(IPAPDE) Bdy(Dword), 01052000
*                                      /* PDE for DUMP               */ 01053000
*          7 IPADUPLE     Char(Length(IPAPDE)) Like(IPAPDE) Bdy(Dword), 01054000
*                                      /* PDE for DUPLEX             */ 01055000
*          7 IPAEXIT      Char(Length(IPAPDE)) Like(IPAPDE) Bdy(Dword), 01056000
*                                      /* PDE for EXIT               */ 01057000
*          7 IPAFIX       Char(Length(IPAPDE)) Like(IPAPDE) Bdy(Dword), 01058000
*                                      /* PDE for FIX                */ 01059000
*          7 IPAGRS       Char(Length(IPAPDE)) Like(IPAPDE) Bdy(Dword), 01060000
*                                      /* PDE for GRS                */ 01061000
*          7 IPAGRSCN     Char(Length(IPAPDE)) Like(IPAPDE) Bdy(Dword), 01062000
*                                      /* PDE for GRSCNF             */ 01063000
*          7 IPAGRSRN     Char(Length(IPAPDE)) Like(IPAPDE) Bdy(Dword), 01064000
*                                      /* PDE for GRSRNL             */ 01065000
*          7 IPAICS       Char(Length(IPAPDE)) Like(IPAPDE) Bdy(Dword), 01066000
*                                      /* PDE for ICS                */ 01067000
*          7 IPAIOS       Char(Length(IPAPDE)) Like(IPAPDE) Bdy(Dword), 01068000
*                                      /* PDE for IOS                */ 01069000
*          7 IPAIPS       Char(Length(IPAPDE)) Like(IPAPDE) Bdy(Dword), 01070000
*                                      /* PDE for IPS                */ 01071000
*          7 IPALNK       Char(Length(IPAPDE)) Like(IPAPDE) Bdy(Dword), 01072000
*                                      /* PDE for LNK                */ 01073000
*          7 IPALNKAU     Char(Length(IPAPDE)) Like(IPAPDE) Bdy(Dword), 01074000
*                                      /* PDE for LNKAUTH            */ 01075000
*          7 IPALOGCL     Char(Length(IPAPDE)) Like(IPAPDE) Bdy(Dword), 01076000
*                                      /* PDE for LOGCLS             */ 01077000
*          7 IPALOGLM     Char(Length(IPAPDE)) Like(IPAPDE) Bdy(Dword), 01078000
*                                      /* PDE for LOGLMT             */ 01079000
*          7 IPALOGRE     Char(Length(IPAPDE)) Like(IPAPDE) Bdy(Dword), 01080000
*                                      /* PDE for LOGREC             */ 01081000
*          7 IPALPA       Char(Length(IPAPDE)) Like(IPAPDE) Bdy(Dword), 01082000
*                                      /* PDE for LPA                */ 01083000
*          7 IPAMAXCA     Char(Length(IPAPDE)) Like(IPAPDE) Bdy(Dword), 01084000
*                                      /* PDE for MAXCAD             */ 01085000
*          7 IPAMAXUS     Char(Length(IPAPDE)) Like(IPAPDE) Bdy(Dword), 01086000
*                                      /* PDE for MAXUSER            */ 01087000
*          7 IPAMLPA      Char(Length(IPAPDE)) Like(IPAPDE) Bdy(Dword), 01088000
*                                      /* PDE for MLPA               */ 01089000
*          7 IPAMSTRJ     Char(Length(IPAPDE)) Like(IPAPDE) Bdy(Dword), 01090000
*                                      /* PDE for MSTRJCL            */ 01091000
*          7 IPANONVI     Char(Length(IPAPDE)) Like(IPAPDE) Bdy(Dword), 01092000
*                                      /* PDE for NONVIO             */ 01093000
*          7 IPANSYSL     Char(Length(IPAPDE)) Like(IPAPDE) Bdy(Dword), 01094000
*                                      /* PDE for NSYSLX             */ 01095000
*          7 IPANUCMA     Char(Length(IPAPDE)) Like(IPAPDE) Bdy(Dword), 01096000
*                                      /* PDE for NUCMAP             */ 01097000
*          7 IPAOMVS      Char(Length(IPAPDE)) Like(IPAPDE) Bdy(Dword), 01098000
*                                      /* PDE for OMVS           @L3A*/ 01099000
*          7 IPAOPI       Char(Length(IPAPDE)) Like(IPAPDE) Bdy(Dword), 01100000
*                                      /* PDE for OPI                */ 01101000
*          7 IPAOPT       Char(Length(IPAPDE)) Like(IPAPDE) Bdy(Dword), 01102000
*                                      /* PDE for OPT                */ 01103000
*          7 IPAPAGEO     Char(Length(IPAPDE)) Like(IPAPDE) Bdy(Dword), 01104000
*                                      /* PDE for PAGE                  01105000
*                                         (operator-specified        */ 01106000
*          7 IPAPAGEP     Char(Length(IPAPDE)) Like(IPAPDE) Bdy(Dword), 01107000
*                                      /* PDE for PAGE                  01108000
*                                         (IEASYSxx-specified        */ 01109000
*          7 IPAPAGNU     Char(Length(IPAPDE)) Like(IPAPDE) Bdy(Dword), 01110000
*                                      /* PDE for PAGNUM             */ 01111000
*          7 IPAPAGTO     Char(Length(IPAPDE)) Like(IPAPDE) Bdy(Dword), 01112000
*                                      /* PDE for PAGTOTL            */ 01113000
*          7 IPAPAK       Char(Length(IPAPDE)) Like(IPAPDE) Bdy(Dword), 01114000
*                                      /* PDE for PAK                */ 01115000
*          7 IPAPLEXC     Char(Length(IPAPDE)) Like(IPAPDE) Bdy(Dword), 01116000
*                                      /* PDE for PLEXCFG            */ 01117000
*          7 IPAPRODP     Char(Length(IPAPDE)) Like(IPAPDE) Bdy(Dword), 01118000
*                                      /* PDE for PRODP              */ 01119000
*          7 IPAPROG      Char(Length(IPAPDE)) Like(IPAPDE) Bdy(Dword), 01120000
*                                      /* PDE for PROG               */ 01121000
*          7 IPAPURGE     Char(Length(IPAPDE)) Like(IPAPDE) Bdy(Dword), 01122000
*                                      /* PDE for PURGE              */ 01123000
*          7 IPARDE       Char(Length(IPAPDE)) Like(IPAPDE) Bdy(Dword), 01124000
*                                      /* PDE for RDE                */ 01125000
*          7 IPAREAL      Char(Length(IPAPDE)) Like(IPAPDE) Bdy(Dword), 01126000
*                                      /* PDE for REAL               */ 01127000
*          7 IPARER       Char(Length(IPAPDE)) Like(IPAPDE) Bdy(Dword), 01128000
*                                      /* PDE for RER                */ 01129000
*          7 IPARSU       Char(Length(IPAPDE)) Like(IPAPDE) Bdy(Dword), 01130000
*                                      /* PDE for RSU                */ 01131000
*          7 IPARSVNO     Char(Length(IPAPDE)) Like(IPAPDE) Bdy(Dword), 01132000
*                                      /* PDE for RSVNONR            */ 01133000
*          7 IPARSVST     Char(Length(IPAPDE)) Like(IPAPDE) Bdy(Dword), 01134000
*                                      /* PDE for RSVSTRT            */ 01135000
*          7 IPASCH       Char(Length(IPAPDE)) Like(IPAPDE) Bdy(Dword), 01136000
*                                      /* PDE for SCH                */ 01137000
*          7 IPASMF       Char(Length(IPAPDE)) Like(IPAPDE) Bdy(Dword), 01138000
*                                      /* PDE for SMF                */ 01139000
*          7 IPASMS       Char(Length(IPAPDE)) Like(IPAPDE) Bdy(Dword), 01140000
*                                      /* PDE for SMS                */ 01141000
*          7 IPASQA       Char(Length(IPAPDE)) Like(IPAPDE) Bdy(Dword), 01142000
*                                      /* PDE for SQA                */ 01143000
*          7 IPASSN       Char(Length(IPAPDE)) Like(IPAPDE) Bdy(Dword), 01144000
*                                      /* PDE for SSN                */ 01145000
*          7 IPASVC       Char(Length(IPAPDE)) Like(IPAPDE) Bdy(Dword), 01146000
*                                      /* PDE for SVC                */ 01147000
*          7 IPASWAP      Char(Length(IPAPDE)) Like(IPAPDE) Bdy(Dword), 01148000
*                                      /* PDE for SWAP               */ 01149000
*          7 IPASYSNA     Char(Length(IPAPDE)) Like(IPAPDE) Bdy(Dword), 01150000
*                                      /* PDE for SYSNAME            */ 01151000
*          7 IPASYSP      Char(Length(IPAPDE)) Like(IPAPDE) Bdy(Dword), 01152000
*                                      /* PDE for SYSP               */ 01153000
*          7 IPAVAL       Char(Length(IPAPDE)) Like(IPAPDE) Bdy(Dword), 01154000
*                                      /* PDE for VAL                */ 01155000
*          7 IPAVIODS     Char(Length(IPAPDE)) Like(IPAPDE) Bdy(Dword), 01156000
*                                      /* PDE for VIODSN             */ 01157000
*          7 IPAVRREG     Char(Length(IPAPDE)) Like(IPAPDE) Bdy(Dword), 01158000
*                                      /* PDE for VRREGN             */ 01159000
*          7 IPARTLSP     Char(Length(IPAPDE)) Like(IPAPDE) Bdy(Dword)  01160000
*                        ,             /* Support for RTLS has been     01161000
*                                         withdrawn              @LNC*/ 01162000
*          7 IPAUNIP      Char(Length(IPAPDE)) Like(IPAPDE) Bdy(Dword), 01163000
*                                      /* PDE for UNI            @01A*/ 01164000
*          7 IPAILML      Char(Length(IPAPDE)) Like(IPAPDE) Bdy(Dword)  01165000
*                        ,             /* Support for ILM has been      01166000
*                                         withdrawn              @LNC*/ 01167000
*          7 IPAILMOD     Char(Length(IPAPDE)) Like(IPAPDE) Bdy(Dword)  01168000
*                        ,             /* Support for ILM has been      01169000
*                                         withdrawn              @LNC*/ 01170000
*          7 IPATSO       Char(Length(IPAPDE)) Like(IPAPDE) Bdy(Dword), 01171000
*                                      /* PDE for IKJTSO         @L8A*/ 01172000
*          7 IPALIC       Char(Length(IPAPDE)) Like(IPAPDE) Bdy(Dword), 01173000
*                                      /* PDE for LICENSE      010409*/ 01174000
*          7 *            Char(Length(IPAPDE)) Like(IPAPDE) Bdy(Dword), 01175000
*          7 IPAHVSHARE   Char(Length(IPAPDE)) Like(IPAPDE) Bdy(Dword), 01176000
*                                      /* PDE for VSHAR          @LAA*/ 01177000
*          7 IPAILM       Char(Length(IPAPDE)) Like(IPAPDE) Bdy(Dword)  01178000
*                        ,             /* Support for ILM has been      01179000
*                                         withdrawn              @LNC*/ 01180000
*          7 IPADRMOD     Char(Length(IPAPDE)) Like(IPAPDE) Bdy(Dword), 01181000
*                                      /* PDE for DRMODE         @LCA*/ 01182000
*          7 IPACEE       Char(Length(IPAPDE)) Like(IPAPDE) Bdy(Dword), 01183000
*                                      /* PDE for CEE            @LDA*/ 01184000
*          7 IPAPRCPU     Char(Length(IPAPDE)) Like(IPAPDE) Bdy(Dword), 01185000
*                                      /* PDE for PRESCPU        @04A*/ 01186000
*          7 IPALFAREA    Char(Length(IPAPDE)) Like(IPAPDE) Bdy(Dword), 01187000
*                                      /* PDE for LFAREA         @LEC*/ 01188000
*          7 IPACEA       Char(Length(IPAPDE)) Like(IPAPDE) Bdy(Dword), 01189000
*                                      /* PDE for CEA            @LFA*/ 01190000
*          7 IPAHVCOMMON  Char(Length(IPAPDE)) Like(IPAPDE) Bdy(Dword), 01191000
*                                      /* PDE for VCOMM          @LGA*/ 01192000
*          7 IPAAXR       Char(Length(IPAPDE)) Like(IPAPDE) Bdy(Dword), 01193000
*                                      /* PDE for AXR            @LHA*/ 01194000
*          7 IPAzAAPzIIP  Char(Length(IPAPDE)) Like(IPAPDE) Bdy(Dword)  01195000
*                         ,            /* PDE for zAAPzIIP (ZZ)  @LIA*/ 01196000
*          7 IPAIQP       Char(Length(IPAPDE)) Like(IPAPDE) Bdy(Dword)  01197000
*                         ,            /* PDE for IQP            @LJA*/ 01198000
*          7 IPACPCR      Char(Length(IPAPDE)) Like(IPAPDE) Bdy(Dword)  01199000
*                         ,            /* PDE for CPCR           @05A*/ 01200000
*          7 IPADDM       Char(Length(IPAPDE)) Like(IPAPDE) Bdy(Dword)  01201000
*                         ,            /* PDE for DDM            @LKA*/ 01202000
*          7 IPAAutor     Char(Length(IPAPDE)) Like(IPAPDE) Bdy(Dword), 01203000
*                                      /* PDE for AUTOR          @LLA*/ 01204000
*          7 IPACatalog   Char(Length(IPAPDE)) Like(IPAPDE) Bdy(Dword), 01205000
*                                      /* PDE for CATALOG        @LOA*/ 01206000
*          7 IPAIXGCNF    Char(Length(IPAPDE)) Like(IPAPDE) Bdy(Dword), 01207000
*                                      /* PDE for IXGCNF         @LOA*/ 01208000
*          7 IPAPAGESCM   Char(Length(IPAPDE)) Like(IPAPDE) Bdy(Dword), 01209000
*                                      /* PDE for PAGESCM        @06C*/ 01210000
*          7 IPAWARNUND   Char(Length(IPAPDE)) Like(IPAPDE) Bdy(Dword), 01211000
*                                      /* PDE for WARNUND        @LQA*/ 01212000
*          7 IPAHZS       Char(Length(IPAPDE)) Like(IPAPDE) Bdy(Dword), 01213000
*                                      /* PDE for HZS            @LRA*/ 01214000
*          7 IPAGTZ       Char(Length(IPAPDE)) Like(IPAPDE) Bdy(Dword), 01215000
*                                      /* PDE for GTZ            @LRA*/ 01216000
*          7 IPAHZSPROC   Char(Length(IPAPDE)) Like(IPAPDE) Bdy(Dword), 01217000
*                                      /* PDE for HZSPROC        @LSA*/ 01218000
*          7 IPASMFLIM    Char(Length(IPAPDE)) Like(IPAPDE) Bdy(Dword), 01219000
*                                      /* PDE for SMFLIM         @LUA*/ 01220000
*          7 IPAIEFOPZ    Char(Length(IPAPDE)) Like(IPAPDE) Bdy(Dword), 01221000
*                                      /* PDE for IEFOPZ         @LVA*/ 01222000
*          7 IPARACF      Char(Length(IPAPDE)) Like(IPAPDE) Bdy(Dword), 01223000
*                                      /* PDE for RACF           @LWA*/ 01224000
*          7 IPAFXE       Char(Length(IPAPDE)) Like(IPAPDE) Bdy(Dword), 01225000
*                                      /* PDE for FXE            @LXA*/ 01226000
*          7 IPAIZU       Char(Length(IPAPDE)) Like(IPAPDE) Bdy(Dword), 01227000
*                                      /* PDE for IZU            @LYA*/ 01228000
*          7 IPASMFTBUFF  Char(Length(IPAPDE)) Like(IPAPDE) Bdy(Dword), 01229000
*                                      /* PDE for SMFTBUFF       @07A*/ 01230000
*          7 IPASOLUT     Char(Length(IPAPDE)) Like(IPAPDE) Bdy(Dword), 01231000
*                                      /* PDE for SOLUT          @0DA*/ 01232000
*          7 IPAOSPROTECT Char(Length(IPAPDE)) Like(IPAPDE) Bdy(Dword), 01233000
*                                      /* PDE for OSPROTECT      @09A*/ 01234000
*          7 IPAICSF      Char(Length(IPAPDE)) Like(IPAPDE) Bdy(Dword), 01235000
*                                      /* PDE for ICSF           @0AA*/ 01236000
*          7 IPAICSFPROC  Char(Length(IPAPDE)) Like(IPAPDE) Bdy(Dword), 01237000
*                                      /* PDE for ICSFPROC       @0AA*/ 01238000
*          7 IPARUCSA     Char(Length(IPAPDE)) Like(IPAPDE) Bdy(Dword), 01239000
*                                      /* PDE for RUCSA          @0BA*/ 01240000
*          7 IPABOOST     Char(Length(IPAPDE)) Like(IPAPDE) Bdy(Dword)  01241000
*              ,                       /* PDE for BOOST          @0CA*/ 01242000
*          7 IPACRYPCTRS  Char(Length(IPAPDE)) Like(IPAPDE) Bdy(Dword), 01243000
*                                      /* PDE for CRYPCTRS       @0EA*/ 01244000
*          7 IPAPDESC_END CHAR(0),     /*                        @LDA*/ 01245000
*      3 IPAEND CHAR(0);               /* End of IPA. The number of     01246000
*                                         elements in IPAPDESC must be  01247000
*                                         less than or equal to the     01248000
*                                         dimension of IPAPDES.  @L4A*/ 01249000
*                                                                       01250000
*?ASAXMAC ASSERT(Dim(IPAPDES)*Length(IPAPDE),EQ,Length(IPAPDESC))       01251000
*           ;                                                /* @LQA*/  01252000
*     /* Constants for IPAHEAD                                       */ 01253000
*Dcl IPAIPA   Char(4) Constant('IPA ');/* Eye-catcher                */ 01254000
*Dcl IPASPN   Fixed(31) Constant(241); /* IPA subpool                */ 01255000
*Dcl IPACVN   Fixed(31) Constant(1);   /* IPA current version        */ 01256000
*                                                                       01257000
*     /* Constants for IPAPROMT (the last three letters of the name     01258000
*        indicate the effects of IPLing with that prompt value:         01259000
*        the sixth letter indicates whether ("Y") or not ("N")          01260000
*        the master catalog prompt is issued, the seventh letter        01261000
*        indicates whether or not the system parameters prompt          01262000
*        is issued, and the eighth letter indicates whether or          01263000
*        not IPL messages are displayed)                         @L2A*/ 01264000
*Dcl IPAPRYYY Char(1) Constant('A');   /*                        @L2A*/ 01265000
*Dcl IPAPRYYN Char(1) Constant('P');   /*                        @L2A*/ 01266000
*Dcl IPAPRNNY Char(1) Constant('M');   /*                        @L2A*/ 01267000
*Dcl IPAPRNNN Char(1) Constant(' ');   /*                        @L2A*/ 01268000
*Dcl IPAPRYNN Char(1) Constant('C');   /*                        @L2A*/ 01269000
*Dcl IPAPRYNY Char(1) Constant('D');   /*                        @L2A*/ 01270000
*Dcl IPAPRNYN Char(1) Constant('S');   /*                        @L2A*/ 01271000
*Dcl IPAPRNYY Char(1) Constant('T');   /*                        @L2A*/ 01272000
*                                                                       01273000
*Dcl 1 IPAPDE Based Bdy(Dword),        /* Parameter descriptor          01274000
*                                         element                    */ 01275000
*      3 IPAPDESA         Ptr(31),     /* Address of parameter          01276000
*                                         string (will be zero if       01277000
*                                         the parameter was not         01278000
*                                         specified and has no          01279000
*                                         default value)             */ 01280000
*      3 IPAPDESL         Fixed(15),   /* Length of parameter           01281000
*                                         string, not including         01282000
*                                         trailing null ('00'X)         01283000
*                                         delimiter (will be zero if    01284000
*                                         the parameter was not         01285000
*                                         specified and has no          01286000
*                                         default value)             */ 01287000
*      3 IPAPDEDO         Fixed(15),   /* Source of parameter           01288000
*                                         string (default value or      01289000
*                                         from operator)             */ 01290000
*        5 IPAPDESS       Char(2);     /* Source of parameter           01291000
*                                         string (IEASYSxx member)   */ 01292000
*     /* Constants for IPAPDEDO                                      */ 01293000
*Dcl IPAPDEDF Fixed(15) Constant(0);   /* Parameter was not specified   01294000
*                                         and its default value was     01295000
*                                         used by system                01296000
*                                         initialization             */ 01297000
*Dcl IPAPDEOP Fixed(15) Constant(-1);  /* Operator provided the         01298000
*                                         parameter value            */ 01299000
*%IF SYSVERSION(1:5) ^= 'PL/AS' %THEN                         /* @P2A*/ 01300000
*%DO;                                                         /* @P2A*/ 01301000
*Dcl 1 IPAPLIBXAREA Based(IPA.IPAPLIB@),                                01302000
*  3 IPAPLIBX(17) ISA(IPAPLI);         /* The parmlib card              01303000
*                             images. The number of images is           01304000
*                             indicated by IPAPLNUMX, not IPAPLNUM.     01305000
*                                                                @P2A*/ 01306000
*Dcl 1 IPAPLI Type Char(64),           /* Parmlib card image     @P2A*/ 01307000
*          3 IPAPLIDSN    Char(44),    /* PARMLIB dataset name   @P2A*/ 01308000
*          3 *            Char(1),     /* Reserved               @P2A*/ 01309000
*          3 IPAPLIVOL    Char(6),     /* PARMLIB VOLSER         @P2A*/ 01310000
*          3 *            Char(12),    /* Reserved               @P2A*/ 01311000
*          3 IPAPLIFLG    Bit(8),      /* PARMLIB usage flags    @P2A*/ 01312000
*            5 IPAPLIUSE  Bit(1),      /* PARMLIB in use         @P2A*/ 01313000
*            5 IPAPLIDEF  Bit(1),      /* Default PARMLIB        @P2A*/ 01314000
*            5 IPAPLICAT  Bit(1),      /* IPAPLIVOL found from          01315000
*                                         catalog                @P2A*/ 01316000
*            5 *          Bit(1),      /* Reserved               @P2A*/ 01317000
*            5 IPAPLILCF  Bit(1),      /* PARMLIB not used -            01318000
*                                         LOCATE failed          @P2A*/ 01319000
*            5 IPAPLIMNF  Bit(1),      /* PARMLIB not used -            01320000
*                                         MOUNT failed           @P2A*/ 01321000
*            5 IPAPLIOPF  Bit(1),      /* PARMLIB not used -            01322000
*                                         OPEN failed            @P2A*/ 01323000
*            5 *          Bit(1);      /* Reserved               @P2A*/ 01324000
*DCL                                 /*                          @P4A*/ 01325000
*   1 IPAMachmigArea based(IPAMachmigAddr)                    /* @LTA*/ 01326000
*   ,2 IPAMachMigs(*) Char(64)         /* Columns 10-72 plus a blank    01327000
*                                                                @LTA*/ 01328000
*   ;                                                                   01329000
*%END;                                                        /* @P2A*/ 01330000
*@LOGIC;                                                                01331000
*#PRAGMA TOOL=CBGEN.                                                    01332000
*#USEORG.                                                               01333000
*#LINE.%INCLUDE SYSLIB(IHAIPA);                                         01334000
*#NOMAP.                                                                01335000
*#LINE.DCL ECVTIPA Ptr Based;                                           01336000
*#MAP.                                                                  01337000
*#DELETE.IPAPLIBXAREA                                                   01338000
*#DELETE.IPAMACHMIGAREA                                                 01339000
*#EPRAGMA.                                                              01340000
*@ENDLOGIC;                                                             01341000
*/* End of PL/X Source                                               */ 01342000
* %IF IHAIPA_LIST = 'NO' !                                              01343000
*    ZCBPRINT = 'NO' %THEN                                              01344000
* %DO;                                                                  01345000
*   @LIST POP NOECHO;                                                   01346000
* %END;                                                                 01347000
* %END;                                                                 01348000
