*/********************************************************************/ 00050000
*/*                                                                  */ 00100000
*/* $MAC(IHAPEXT) COMP(28414):                                       */ 00150000
*/*                                                                  */ 00200000
*/*  MACRO NAME: IHAPEXT                                             */ 00250000
*/*                                                                  */ 00300000
*/*  DESCRIPTION: Maps the PDSE DCBE Extension (PEXT)                */ 00350000
*/*                                                                  */ 00400000
*/*  STATUS: z/OS 1.12 DFSMS                                         */ 00450000
*/*                                                                  */ 00500000
*/*PROPRIETARY V3 STATEMENT                                          */ 00810001
*/*Licensed Materials - Property of IBM                              */ 00820001
*/*"Restricted Materials of IBM"                                     */ 00830001
*/*5650-ZOS                                                          */ 00840001
*/*Copyright IBM Corp. 2010,2015                                     */ 00841001
*/*END PROPRIETARY V3 STATEMENT                                      */ 00842001
*/*                                                                  */ 00850000
*/*  FUNCTION: The IHAPEXT macro defines fields and flags within     */ 00900000
*/*            the PEXT                                              */ 00950000
*/*                                                                  */ 01000000
*/*  NOTES:                                                          */ 01050000
*/*                                                                  */ 01100000
*/*    DEPENDENCIES: None                                            */ 01150000
*/*    RESTRICTIONS: None                                            */ 01200000
*/*                                                                  */ 01250000
*/*  MACRO:                                                          */ 01300000
*/*                                                                  */ 01350000
*/*    PROCESSOR: Assembler and PL/X.                                */ 01400000
*/*    DISTRIBUTION LIBRARY: AMACLIB                                 */ 01450000
*/*    ATTRIBUTES: INCLUDE                                           */ 01500000
*/*                                                                  */ 01550000
*/*  ENTRY POINT: IHAPEXT                                            */ 01600000
*/*                                                                  */ 01650000
*/*    LINKAGE:                                                      */ 01700000
*/*        ASSEMBLER :                                               */ 01750000
*/*            IHAPEXT                                               */ 01800000
*/*            USING  PEXT,PEXTPTR                                   */ 01850000
*/*        PLAS :                                                    */ 01900000
*/*            %INCLUDE SYSLIB(IHAPEXT)                              */ 01950000
*/*            RFY PEXT BASED(DCBE_PDSEEXT_WA)                       */ 02000000
*/*                                                                  */ 02050000
*/*  EXIT NORMAL:                                                    */ 02100000
*/*                                                                  */ 02150000
*/*    No errors detected, mapping macro only.                       */ 02200000
*/*                                                                  */ 02250000
*/*  EXTERNAL REFERENCES:                                            */ 02300000
*/*                                                                  */ 02350000
*/*    MACROS:                                                       */ 02400000
*/*      None                                                        */ 02450000
*/*                                                                  */ 02500000
*/*  CHANGE ACTIVITY:                                                */ 02550000
*/*                                                                  */ 02600000
*/* $PU=PDSEVAL,HDZ1C10,100326,SJPLLM: PDSE Validation           @PUA*/ 02650000
*/* $01=OA47786,HDZ2220,20150514,JerryDearing:                   @01A*/ 02660000
*/*   1. Add New PerformPendingDelete options                        */ 02670000
*/********************************************************************/ 02700000
*      %GOTO PEXTPLAS;                                                  02750000
               MACRO                                                    02800000
               IHAPEXT                                                  02850000
PEXT     DSECT                                                          02900000
         DS    0D                                                       02950000
PEXTID   DS    CL8            PEXT eyecatcher 'IHAPEXT '                03000000
PEXTLEN  DS    F              Length of PEXT                            03050000
PEXTLVL  DS    XL1            Level 1                                   03100000
PEXTRES  DS    XL3            Reserved - must be zeros                  03150000
PEXTIF1  DS    AL1            Input flags byte 1                        03200000
PEXT_VALIDATE EQU X'80'       Validate PDSE on connect directory        03250000
PEXTIF2  DS    AL1            Input flags byte 2                        03300000
PEXT_MSG_SUP EQU X'80'        Supress WTO of messages                   03350000
PEXT_MSG_RET EQU X'40'        Return messages in message buffer         03400000
PEXT_DONT_FLUSH_CACHE EQU X'20' Dont flush the directory cache before  *03450000
                               validate                                 03500000
PEXT_DUMP_ON_ERROR EQU X'10'  Dump if error                             03550000
PEXT_PerformPendingDelete EQU X'08'  Pending delete requested      @01A 03570000
PEXTOF1  DS    AL1            Output flags byte 1                       03600000
PEXT_VAL_DONE EQU X'80'       Set if validation processing is done      03650000
PEXTOF2  DS    AL1            Output flags byte 2                       03700000
         DS    F              Reserved - must be zeros                  03750000
PEXT_RETCD DS  F              Return code from validation               03800000
PEXT_RSNCD DS  F              Reason code from validation               03850000
         DS    F              Reserved for hi word of following         03900000
*                              address - must be zeros                  03950000
PEXT_MSG_ADDR  DS F           Address of message buffer                 04019900
PEXT_MSG_END   DS F           Address of last msg buffer                04039900
PEXT_NumberPendingDeletes DS F                                     @01A 04059900
PEXT_NumberDeletePendingDeletes DS F                               @01A 04079900
         DS    3F             Reserved - must be zeros             @01C 04099900
PEXTEND  EQU   *              End of PEXT. This label shows             04150000
*                              the current length of a PEXT             04200000
         MEND                                                           04250000
*%PEXTPLAS:;                                                            04300000
*DECLARE  /*PDSE DCBE extension                                      */ 04350000
*  1  PEXT BASED BDY(DWORD),                                            04400000
*    3  PEXTID    CHAR(8),          /* PEXT eyecatcher 'IHAPEXT '    */ 04450000
*    3  PEXTLEN   FIXED(31),        /* Length of PEXT                */ 04500000
*    3  PEXTLVL   FIXED(8),         /* Level 1                       */ 04550000
*    3  *         CHAR(3),          /* Reserved - must be zero       */ 04600000
*    3  PEXTIF1   BIT(8),           /* Input flags byte 1            */ 04650000
*       5 PEXT_VALIDATE BIT(1),     /* Validate PDSE on connect         04700000
*                                      directory                     */ 04750000
*    3  PEXTIF2   BIT(8),           /* Input flags byte 2            */ 04800000
*       5 PEXT_MSG_SUP BIT(1),      /* Supress WTO of messages       */ 04850000
*       5 PEXT_MSG_RET BIT(1),      /* Return messages in message       04900000
*                                      buffer                        */ 04950000
*       5 PEXT_DONT_FLUSH_CACHE Bit(1),  /* Dont flush the directory    05000000
*                                      cache before validae          */ 05050000
*       5 PEXT_DUMP_ON_ERROR Bit(1),  /* Dump if error               */ 05100000
*       5 PEXT_PerformPendingDelete Bit(1), /* Pending delete           05110000
*                                      processing should be performed   05120000
*                                                                @01A*/ 05130000
*    3  PEXTOF1   BIT(8),           /* Output flags byte 1           */ 05150000
*       5 PEXT_VAL_DONE BIT(1),     /* Set if validation processing     05200000
*                                      is done                       */ 05250000
*    3  PEXTOF2   BIT(8),           /* Output flags byte 2           */ 05300000
*    3  *         CHAR(4),          /* Reserved - must be zeros      */ 05350000
*    3  PEXT_RETCD PTR(31),         /* Return code from validation   */ 05400000
*    3  PEXT_RSNCD PTR(31),         /* Reason code from validation   */ 05450000
*    3  *         CHAR(4),          /* Reserved for hi word of          05500000
*                                      following address - must be      05550000
*                                      zeros                         */ 05600000
*    3  PEXT_MSG_ADDR PTR(31),      /* Address of message buffer     */ 05650000
*    3  PEXT_MSG_END  PTR(31),      /* Address of last msg buffer    */ 05700000
*    3  PEXT_NumberPendingDeletes Fixed(31), /* Number of pending       05757900
*                                        Deletes before cleanup  @01A*/ 05765900
*    3  PEXT_NumberDeletePendingDeletes Fixed(31), /* Number of         05773900
*                                      pending deletes removed   @01A*/ 05781900
*    3  *(3)      Fixed(31),        /* Reserved - must be zeros  @01C*/ 05789900
*    3  PEXTEND   CHAR(0);          /* Current end of PEXT.          */ 05800000
*                                                                       05850000
*/* Constants for PEXT                                               */ 05900000
*DECLARE                                                                05950000
* PEXTIDC CHAR(8) CONSTANT('IHAPEXT '),  /* ID                       */ 06000000
* PEXTLVLC FIXED(8) CONSTANT(1);    /* Level                         */ 06050000
*DECLARE  /*PDSE DCBE extension                                      */ 06100000
*  1  PEXTM TYPE BDY(DWORD),                                            06150000
*   2  PEXTMHDR   CHAR(16) BDY(DWORD),                                  06200000
*    3  PEXTMID   CHAR(8),         /* PEXTM eyecatcher 'PEXTM'       */ 06250000
*    3  PEXTMLEN  FIXED(31),       /* Length of PEXTM                */ 06300000
*    3  PEXTMLVL  FIXED(8),        /* Level 1                        */ 06350000
*    3  *         CHAR(3),         /* Reserved - must be zero        */ 06400000
*   2  PEXTM_NEXT PTR(31),         /* Pointer to next PEXTM or zero  */ 06450000
*   2  PEXTM_MLEN FIXED(15),       /* Length of message              */ 06500000
*   2  PEXTM_TEXT CHAR(*);         /* Message text                   */ 06550000
*/* Constants for PEXTM                                              */ 06600000
*DECLARE                                                                06650000
* PEXTMIDC CHAR(8) CONSTANT('PEXTM   '),  /* ID                      */ 06700000
* PEXTMLVLC FIXED(8) CONSTANT(1);   /* Level                         */ 06750000
