*%       GOTO  RMPLBSL1;  /*                                            00010000
         MACRO                                                          00020000
         IHARMPL &DSECT=YES                                          */ 00030000
*%RMPLBSL1 : ;                                                          00040000
*/** START OF SPECIFICATIONS *****************************************/ 00050000
*/*                                                                  */ 00060000
*/* PROPRIETARY STATEMENT:                                           */ 00070000
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00080000
*/* 5650-ZOS COPYRIGHT IBM CORP. 1980, 2021                          */ 00100000
*/*                                                                  */ 00120000
*/* STATUS = HBB77D0                                                 */ 00130000
*/*                                                                  */ 00140000
*/* EXTERNAL CLASSIFICATION:                                         */ 00150000
*/*  DMTI: BASE                                                      */ 00160000
*/*  GUPI: FIELDS                                                    */ 00170000
*/*  RMPLASCB  RMPLASID  RMPLJST   RMPLTCBA                          */ 00180000
*/*  RMPLTERM  RMPLTYPE                                              */ 00190000
*/*                                                                  */ 00200000
*/* END OF EXTERNAL CLASSIFICATION:                                  */ 00210000
*/*                                                                  */ 00220000
*/* MACRO NAME:  IHARMPL                                             */ 00230000
*/*                                                                  */ 00240000
*/* DESCRIPTIVE NAME:  RESOURCE MANAGER PARAMETER LIST               */ 00250000
*/*                                                                  */ 00260000
*/* DSECT NAME: RMPL                                                 */ 00270000
*/*                                                                  */ 00280000
*/* COMPONENT: RECOVERY TERMINATION MANAGER (SCRTM)                  */ 00290000
*/*                                                                  */ 00300000
*/* EYE CATCHER: NONE                                                */ 00310000
*/*                                                                  */ 00320000
*/* STORAGE ATTRIBUTES:                                              */ 00330000
*/*  SUBPOOL:  255                                                   */ 00340000
*/*  KEY:  0                                                         */ 00350000
*/*  RESIDENCY:  BELOW THE 16M LINE                                  */ 00360000
*/*                                                                  */ 00370000
*/* SIZE: 24 BYTES                                                   */ 00380000
*/*                                                                  */ 00390000
*/* CREATED BY: IEAVTRT2                                             */ 00400000
*/*                                                                  */ 00410000
*/* POINTED TO BY: REGISTER 1 UPON ENTRY TO A RESOURCE MANAGER.      */ 00420000
*/*     THE RMPL CAN ALSO BE FOUND VIA THE RTM2RMPL FIELD OF THE     */ 00430000
*/*     RTM2WA DATA AREA.                                            */ 00440000
*/*                                                                  */ 00450000
*/* SERIALIZATION: NONE                                              */ 00460000
*/*                                                                  */ 00470000
*/* FUNCTION:                                                        */ 00480000
*/*     THE RESOURCE MANAGER PARAMETER LIST IS THE                   */ 00490000
*/*     COMMUNICATION AREA BETWEEN TASK/MEMORY TERMINATION           */ 00500000
*/*     AND THE USER/SYSTEM DEFINED RESOURCE MANAGERS.               */ 00510000
*/*                                                                  */ 00520000
*/* METHOD OF ACCESS:                                                */ 00530000
*/*   METHOD OF ACCESS                                               */ 00540000
*/*      BAL - DSECT IS PRODUCED UNLESS DSECT=NO IS SPECIFIED.       */ 00550000
*/*            USING ON RMPL GIVES ADDRESSABILITY TO ALL SYMBOLS.    */ 00560000
*/*      PLS - RMPL IS NOT BASED AND CAN BE USED AS A PARAMETER      */ 00570000
*/*            ON THE PROC OR ENTRY STATEMENT.  AN EXAMPLE OF        */ 00580000
*/*            THIS USE FOLLOWS:                                     */ 00590000
*/*              MGR: PROC(RMPL)                                     */ 00600000
*/*              %INCLUDE SYSLIB(IHARMPL)                            */ 00610000
*/*                                                                  */ 00620000
*/*          - IF RMPL IS TO BE USED AS A BASED STRUCTURE,           */ 00630000
*/*            CODE THE MACRO ASSIGNMENT %RMPLBASE='BASED( )'        */ 00640000
*/*            BEFORE INVOKING IHARMPL.  AN EXAMPLE OF THIS USE      */ 00650000
*/*            FOLLOWS:                                              */ 00660000
*/*              %RMPLBASE='BASED(RMPLPTR)'                          */ 00670000
*/*              %INCLUDE SYSLIB(IHARMPL)                            */ 00680000
*/*              DCL RMPLPTR PTR(31)                                 */ 00690000
*/*                                                                  */ 00700000
*/*          - NOTE THAT CALLING SEQUENCE TO RESOURCE MANAGERS       */ 00710000
*/*            POINTS REGISTER 1 TO A FULL WORD WHICH CONTAINS THE   */ 00720000
*/*            ADDRESS OF THE RMPL.                                  */ 00730000
*/*                                                                  */ 00740000
*/*          - PLS MACRO VARIABLE 'RMPLWALN' MAY BE USED TO          */ 00750000
*/*            DETERMINE THE NUMBER OF FULLWORDS ALLOCATED FOR THE   */ 00760000
*/*            RESOURCE MANAGERS WORK AREA.                          */ 00770000
*/*                                                                  */ 00780000
*/*   CHANGE ACTIVITY                                                */ 00790000
*/*          - @G860P1C  SUPPORT FOR RMPLMTC BIT TO INDICATE THAT    */ 00800000
*/*            RESOURCE MANAGER CALL WAS MADE BY IEAVTMTC    @G860P1C*/ 00810000
*/*  OY37208 - RMPLIOPG ADDED                                @YA37208*/ 00820000
*/*$P1=PN70102 ,HBB5520,940106,PD16KD: SHOWHDR SUPPORT           @P1A*/ 00830000
*/*$P2=PN70773  HBB5520 940601 PDKD: CORRECTED FIELD CLASSIFICATIONS */ 00840000
*/*                                  IN PROLOG                   @P2A*/ 00850000
*/*$P3=PR20011  HBB6601 950908 PDKD: SC1CM COMPID SPLIT          @P3A*/ 00860000
*/*$P4=ME12316  HBB7750 071219 PDRY: ADD RMPLEQPG                @P4A*/ 00861000
*/*$01=OA55657  HBB7790 180601 PDXB: EARLY CALL TO IEA0TC0A          */ 00862000
*/*** END OF SPECIFICATIONS ******************************************/ 00870000
*/*A-000000-999999                                            @Y02702*/ 00880000
*%       GOTO  RMPLBSL;  /*                                             00890000
         AIF  ('&DSECT' EQ 'YES').RMPL001                               00900000
RMPL     DS   0D -                                                      00910000
         AGO  .RMPL002                                                  00920000
.RMPL001 ANOP                                                           00930000
RMPL     DSECT ,        RMPLPTR                                         00940000
.RMPL002 SPACE 2                                                        00950000
         IEZBITS                                                        00960000
RMPLFLG1 DS    B       FLAGS INDICATING TYPE OF TERMINATION             00970000
RMPLTYPE EQU   BIT0    ON,INDICATES ABNORMAL TERMINATION                00980000
*                      OFF,INDICATES NORMAL TERMINATION                 00990000
RMPLTERM EQU   BIT1    ON,INDICATES MEMORY TERMINATION                  01000000
*                      OFF,INDICATES TASK TERMINATION                   01010000
RMPLRBPP EQU   BIT2    ON,INDICATES RB RELATED PURGE                    01020000
RMPLIPUF EQU   BIT3    ON,INHIBITING PAGE UNFIXES                       01030000
RMPLRCOV EQU   BIT4    ON, INDICATES TASK RECOVERY PORTION OF RTM2 IS   01040000
*                      THE CALLER                                       01050000
RMPLJST  EQU   BIT5    ON, INDICATES THAT TERMINATING TASK IS           01060000
*                      JOB STEP TCB                                     01070000
RMPLWT1M EQU   BIT6    ON, INDICATES TYPE 1 MSG TABLE ENTRIES ARE       01080000
*                      TO BE WRITTEN                                    01090000
RMPLMTC  EQU   BIT7    ON, INDICATES CALL TO RESOURCE MANAGER  @G860P1C 01100000
*                      WAS MADE BY THE MEMORY TERMINATION      @G860P1C 01110000
*                      CONTROLLER-MODULE IEAVTMTC              @G860P1C 01120000
RMPLIOPG EQU   BIT7    ON WHEN RMPLTERM IS OFF INDICATES TO THE         01130000
*                      CONTENTS RESOURCE MANAGER THAT I/O HAS           01140000
*                      BEEN PURGED                             @YA37208 01150000
RMPLEQPG EQU   BIT7    ON WHEN RMPLTERM IS OFF INDICATES TO THE GRS     01151000
*                      RESOURCE MANAGER THAT PENDING ENQS FOR THIS      01152000
*                      TASK/ASID MUST BE PURGED AS PART OF EARLY        01153000
*                      RTM2 NON-RETRIABLE ERROR PROCESSING         @P4A 01154000
RMPLFLG2 DS    B       MORE FLAGS                                  @01C 01162000
RMPLUKO  EQU   X'80'   IBM USE ONLY -- USER KEY PROCESSING ONLY    @01A 01163000
RMPLASID DS    CL2     ASID ASSOCIATED WITH THE TERMINATING TASK OR     01170000
*                      MEMORY                                           01180000
RMPLASCB DS    A       ADDRESS OF ASCB ASSOCIATED WITH TERMINATING      01190000
*                      TASK OR MEMORY                                   01200000
RMPLTCBA DS    A       ADDRESS OF TERMINATING TCB(ZEROES IF MEMORY      01210000
*                      TERMINATION)                                     01220000
RMPLRBPA DS    A       ADDRESS OF TERMINATING RB                        01230000
RMPLRMWA DS    A       ADDRESS OF 64-BYTE RESOURCE MANAGERS WORK AREA   01240000
RMPLDCBL DS    A       ADDRESS OF DCB LIST USED BY DATA MGR             01250000
*                      TASK CLOSE ROUTINE FOR RB RELATED PURGES         01260000
RMPLWALN EQU   16      NUMBER OF FULLWORDS COMPRISING RESOURCE          01270000
*                      MANAGERS WORK AREA                               01280000
         MEND  ,   */                                                   01290000
*%RMPLBSL : ;                                                           01300000
*  %IF RMPL9999^=',' %THEN                                  /* 200121*/ 01301000
*    %RMPLEND_SEMI = 'YES';                                 /* 200121*/ 01302000
*  %IF RMPLLVL^='' %THEN                                                01360000
*    %GOTO RMPLBSL2;                                                    01370000
*  %IF RMPLBASE='' %THEN                                                01380000
*    %RMPLBASE='';                                                      01390000
*  %IF IBM_CBGENC = 'YES' %THEN                                         01391000
*    %RMPLBASE='BASED';                                                 01392000
*DECLARE                                                                01400000
*   1 RMPL RMPLBASE,                                                    01410000
*  %GOTO RMPLBSL3;                                                      01420000
*%RMPLBSL2: ;                                                           01430000
*   RMPLLVL RMPL,                                                       01440000
*%RMPLBSL3:;                                                            01450000
*     4 RMPLFLG1   CHAR(1),             /* FLAGS INDICATING TYPE OF     01460000
*                                          TERMINATION               */ 01470000
*      8 RMPLTYPE  BIT(1),             /* ON,INDICATES ABNORMAL         01480000
*                                          TERMINATION               */ 01490000
*                                       /* OFF,INDICATES NORMAL         01500000
*                                          TERMINATION               */ 01510000
*      8 RMPLTERM   BIT(1),             /* ON,INDICATES MEMORY          01520000
*                                          TERMINATION                  01530000
*                                          OFF,INDICATES TASK           01540000
*                                          TERMINATION               */ 01550000
*       8 RMPLRBPP   BIT(1),            /* ON,INDICATES RB RELATED      01560000
*                                          PURGE                     */ 01570000
*       8 RMPLIPUF   BIT(1),            /* ON,INHIBITING PAGE           01580000
*                                          UNFIXES                   */ 01590000
*       8 RMPLRCOV   BIT(1),            /* ON,INDICATES THAT TASK       01600000
*                                          RECOVERY PORTION OF RTM2     01610000
*                                          IS THE CALLER             */ 01620000
*       8 RMPLJST    BIT(1),            /* ON,INDICATES THAT TERM-      01630000
*                                          INATING TASK IS A JOBSTEP */ 01640000
*       8 RMPLWT1M   BIT(1),            /* ON, INDICATES TYPE 1 MSG     01650000
*                                          TABLE ENTRIES ARE TO         01660000
*                                          BE WRITTEN                */ 01670000
*       8 RMPLMTC    BIT(1),            /* ON, INDICATES CALL TO        01680000
*                                          RESOURCE MANAGER WAS MADE BY 01690000
*                                          THE MEMORY TERMINATION       01700000
*                                          CONTROLLER-MODULE IEAVTMTC   01710000
*                                                            @G860P1C*/ 01720000
*          9 RMPLIOPG    BIT(1),        /* ON WHEN RMPLTERM IS OFF      01730000
*                                          INDICATES TO THE CONTENTS    01740000
*                                          RESOURCE MANAGER THAT I/O    01750000
*                                          HAS BEEN PURGED   @YA37208*/ 01760000
*             10 RMPLEQPG BIT(1),       /* ON WHEN RMPLTERM IS OFF      01761000
*                                          INDICATES TO THE GRS         01761200
*                                          RESOURCE MANAGER THAT        01762000
*                                          PENDING ENQS FOR THIS        01762100
*                                          TASK/ASID MUST BE PURGED     01762200
*                                          AS PART OF EARLY RTM2        01763000
*                                          NON-RETRIABLE ERROR          01763100
*                                          PROCESSING            @P4A*/ 01763300
*     4 RMPLFLG2   CHAR(1),             /* MORE FLAGS            @01C*/ 01772000
*       8 RMPLUKO BIT(1),               /* IBM USE ONLY -- USER KEY     01773000
*                                          PROCESSING ONLY       @01A*/ 01774000
*     4 RMPLASID   CHAR(2),             /* ASID ASSOCIATED WITH THE     01780000
*                                          TERMINATING TASK OR MEMORY*/ 01790000
*     4 RMPLASCB   PTR(31),             /* ADDRESS OF ASCB ASSOCIATED   01800000
*                                          WITH TERMINATING TASK OR     01810000
*                                          MEMORY                    */ 01820000
*     4 RMPLTCBA    PTR(31) ,           /* ADDRESS OF TERMINATING       01830000
*                                          TCB (ZEROES IF MEMORY        01840000
*                                          TERMINATION)              */ 01850000
*     4 RMPLRBPA    PTR(31),            /* ADDRESS OF TERMINATING       01860000
*                                          RB                        */ 01870000
*     4 RMPLRMWA    PTR(31),            /* ADDRESS OF 64-BYTE RESOURCE  01880000
*                                          MANAGERS WORK AREA        */ 01890000
* %IF RMPLEND_SEMI = 'YES' %THEN %GOTO RMPLPLS1; /*            930831*/ 01900000
*     4 RMPLDCBL    PTR(31),            /* ADDRESS OF DCB LIST USED     01910000
*                                          BY DATA MGR TASK CLOSE       01920000
*                                          FOR RB RELATED PURGES     */ 01930000
* %GOTO RMPLPLS2;                                                       01940000
* %RMPLPLS1:;                                                           01950000
*     4 RMPLDCBL    PTR(31);            /* ADDRESS OF DCB LIST USED     01960000
*                                          BY DATA MGR TASK CLOSE       01970000
*                                          FOR RB RELATED PURGES     */ 01980000
* %RMPLPLS2:;                                                           01990000
* %DCL RMPLWALN FIXED;                                                  02000000
* %RMPLWALN = 16;                          /* NUMBER OF FULLWORDS       02010000
*                                          COMPRISING RESOURCE MANAGERS 02020000
*                                          WORK AREA                 */ 02030000
