*         %GOTO PLSSVT1;             /*                                         
         MACRO                                                                  
&SVTNAME IHASVT &CSECT=NO,&LIST=NO                                 @H2C         
**/                                                                             
*%PLSSVT1:;                                                                     
*/* START OF SPECIFICATIONS ******************************************/         
*/**** PROPRIETARY_STATEMENT *****************************************/         
*/*01* PROPRIETARY STATEMENT =                                   @LFC*/         
*/*                                                                  */         
*/*      LICENSED MATERIALS - PROPERTY OF IBM                        */         
*/*      5650-ZOS COPYRIGHT IBM CORP. 1977, 2021                     */         
*/*                                                                  */         
*/**** END_OF_PROPRIETARY_STATEMENT **********************************/         
*/*                                                                  */         
*/*01* STATUS:  HBB77D0                                              */         
*/*                                                                  */         
*/*01* DESCRIPTIVE NAME:  Supervisor Vector Table                    */         
*/*02*  ACRONYM:  SVT                                                */         
*/*                                                                  */         
*/*01* MACRO NAME:  IHASVT                                           */         
*/*                                                                  */         
*/*01* EXTERNAL CLASSIFICATION:                                      */         
*/*02* NOTPI: BASE                                                   */         
*/*02* PI:   FIELDS                                                  */         
*/*                  SVT_Accum_Entitle_Consumed                  @0JA*/         
*/*                  SVT_Accum_Entitle_CR_Earned                 @MDA*/         
*/*                  SVT_Accum_Entitle_Earned                    @0JA*/         
*/*                  SVT_Accum_Entitle_Earned_Redeposited        @0JA*/         
*/*                  SVT_CORE_WAIT_CPUMASK_ADDR                  @0JA*/         
*/*                  SVT_CPEngineSpeed                           @0UA*/         
*/*                  SVT_CpuProjection                               */         
*/*                  SVT_CriticalPaging                          @MAA*/         
*/*                  SVT_Disp_IFACrossoverHP                     @Q2A*/         
*/*                  SVT_Disp_SUPHonorPriority                   @Q2A*/         
*/*                  SVT_Disp_zIIPHonorPriority                  @NBA*/         
*/*                  SVT_Disp_zCBPCrossoverHP                    @NBA*/         
*/*                  SVT_Entitlement_Percent                     @0JA*/         
*/*                  SVT_Hyperswap_In_Progress                   @MAA*/         
*/*                  SVT_IFA_Normalization                           */         
*/*                  SVT_Normalization_Divide                    @Q3A*/         
*/*                  SVT_Normalization_Shift                     @Q3A*/         
*/*                  SVT_SpecialtyEngineSpeed                    @0UA*/         
*/*                  SVT_SUP_Normalization                           */         
*/*                  SVT_Thread_Wait_CpuMask_Addr                @0JA*/         
*/*                  SVT_Waiting_Processor_Mask_Addr             @N6A*/         
*/*                  SVT_zIIP_Normalization                      @NBA*/         
*/*                  SVT_zIIPzAAP_Flags                              */         
*/*                  SVT_zCBP_Normalization                      @NBA*/         
*/*                  SvtCoreIdCpuIdShift                         @0UA*/         
*/*                  SVTCR_Word                                  @MDA*/         
*/*                  SVTIFAFlags                                     */         
*/*                  SVTSSTSV                                        */         
*/*01* END OF EXTERNAL CLASSIFICATION:                               */         
*/*01*                                                               */         
*/*01* DSECT NAME:                                                   */         
*/*     SVT                                                          */         
*/*                                                                  */         
*/*01* COMPONENT:  Supervisor Control (SC1C5)                        */         
*/*                                                                  */         
*/*01* EYE-CATCHER:  None                                            */         
*/*                                                                  */         
*/*01* STORAGE ATTRIBUTES:                                           */         
*/*02*  RESIDENCY:  Nucleus                                          */         
*/*                                                                  */         
*/*01* SIZE:  Offset of SVTEND minus offset of SVT                   */         
*/*                                                                  */         
*/*01* CREATED BY:                                                   */         
*/*     IEAVESVT                                                     */         
*/*                                                                  */         
*/*01* POINTED TO BY:                                                */         
*/*     CVTSVT field of the CVT data area                            */         
*/*     PSASVT field of the PSA data area                            */         
*/*                                                                  */         
*/*01* SERIALIZATION:                                                */         
*/*     SVTDSREQ - Dispatcher lock                                   */         
*/*     SVTGSMQ, GSPL, LSMQ - Compare & Swap                     @LJC*/         
*/*     SVTWAS - Test and Set (TS)                               @LJC*/         
*/*     SVTDACTV - No longer used                                    */         
*/*     SVT_DISPATCHER_ACTIVE - No longer used                       */         
*/*     SVTPWAIT - No longer used                                    */         
*/*     SVT_PROCESSOR_WAITING - No longer used                       */         
*/*     SVT_WAITING_PROCESSOR_MASK - Compare and Swap                */         
*/*                                                                  */         
*/*01* FUNCTION:                                                     */         
*/*02*  Contains service routine addresses and control blocks used   */         
*/*     by Supervisor Control.                                       */         
*/*                                                                  */         
*/*01* METHOD OF ACCESS:                                             */         
*/*02*  ASM:                                                         */         
*/*      DSECT is always produced unless CSECT=YES is specified on   */         
*/*      macro call.                                                 */         
*/*      Specify LIST=YES on Macro call for listing.                 */         
*/*02*  PL/AS:                                                       */         
*/*      Is Based on PSASVT.                                         */         
*/*      Below is a list of macro variable and their effects on  @MLA*/         
*/*      the mapping macro generated.                            @MLA*/         
*/*                                                                  */         
*/*        %IHALIST='YES' will generate a PL/AS listing.         @MLC*/         
*/*        %SVT_CPUDUALPATH='YES' to get dual path support for   @MLC*/         
*/*          CPU infrastructure fields.                          @MLC*/         
*/*        %SVT_UsePsaDeclares='YES' to get PSA field names      @MLA*/         
*/*          included in the macro.                              @MLA*/         
*/*                                                                  */         
*/*  The global macro variable SVT_CPUDUALPATH was added to support  */         
*/*  code which can run on multiple z/OS releases.  In z/OS V1R11,   */         
*/*  for each CPU related array / bitmask, a pointer for that CPU    */         
*/*  related bitmask / array was added.  On z/OS V1R10 and below,    */         
*/*  the old CPU array / bitmask must continue to be used.  So for   */         
*/*  code which can run on multiple z/OS releases set SVT_CPUDUALPATH*/         
*/*  to YES to get dual path support.  Here are the fields affected  */         
*/*  in this macro and which field should be used in a given z/OS    */         
*/*  release:                                                        */         
*/*                                                                  */         
*/*  z/OS V1R10 and Below             z/OS V1R11 or higher           */         
*/* *SVTWAS_OLD                       SVTWAS_ADDR                    */         
*/*  SVT_CPUS_CAUSING_SPIN_OLD        SVT_CPUS_CAUSING_SPIN_ADDR     */         
*/*  SVT_WAITING_PROCESSOR_MASK       SVT_WAITING_PROCESSOR_MASK_ADDR*/         
*/*  SVT_WAITING_PROCESSOR_MASK0TO31  SVT_WAITING_PROCESSOR_MASK_ADDR*/         
*/*  SVT_WAITING_PROCESSOR_MASK32TO63 SVT_WAITING_PROCESSOR_MASK_ADDR*/         
*/*  SVT_short_wait_CPUPA_Old         SVT_short_wait_CPUPA_ADDR      */         
*/*                                                                  */         
*/*  SVTWAS_ADDR was removed in z/OS V2R1.                       @MMA*/         
*/*                                                                  */         
*/*01* DEPENDENCIES:                                                 */         
*/*      For any field additions/modifications to the IHASVT macro:  */         
*/*                                                                  */         
*/*      1) IEASVTP (SVT dump formatter) should be updated           */         
*/*         appropriately.                                       @0WA*/         
*/*                                                                  */         
*/*01* DISTRIBUTION LIBRARY:  AMACLIB                                */         
*/*                                                                  */         
*/*01* CHANGE ACTIVITY:                                              */         
*/*  $L7=PR313    JBB3313  891128  PD16EI:  SHOWHDR format complete  */         
*/*                                                                  */         
*/* END OF SPECIFICATIONS ********************************************/         
*%GOTO PLSSVT2;            /*                                                   
.*                                                                              
.*********************************************************************          
.*   CHANGE ACTIVITY =                                                          
.*                                                                              
.*  $H1=ADVPROC2  JBB2133  821013  PD16F5:  AXP                                 
.*  $H2=VF        JBB2214  840227  PD16XK:  VECTOR FEATURE                      
.*  $D1=DCR0017   JBB2214  841017  PD16H4:  DELETE THE IEAVVRCV VCON            
.*  $L1=TRQ       JBB2217  850325  PD16FN:  TRUE READY QUEUE                    
.*  $L2=RASENH    JBB2220  840618  PD16XK:  RAS ENHANCEMENTS FOR RTM            
.*  $D2=DCR0026   JBB2220  840914  PD16R8:  IEEVEXSN INTERFACE CHANGE           
.*  $01=OY02544   JBB2217  861101  PD16H4:  FINDSRB PERFORMANCE                 
.*  $02=OY08578   JBB2220  861231  PD16H5:  TCB AND SRB TIMING SUPPORT          
.*  $L3=AR        HBB3310  850903  PD16Q9:  ACCESS REGISTERS                    
.*  $L4=CONSVSCR  HBB3310  860416  PD16H5:  CONSOLE VSCR SUPPORT                
.*  $D3=DCR0011   HBB3310  860630  PD16LD:  NULL LINKAGE STACK SUPPORT          
.*  $L5=AR        HBB3310  861027  PD16AH:  REUSABLE EAX                        
.*  $L6=DATASPAC  HBB3310  861027  PD16AG:  DATA SPACES                         
.*  $D4=DCR0147   HBB3310  871602  PD16BN:  EXCESSIVE SPIN IMPROVEMENT          
.*  $D5=DCR0220   HBB3310  870216  PD16FH:  REDUCED PREEMPTION                  
.*  $D6=DCR0228   HBB3310  870216  PD16FH:  INCREASED SAVEAREA SIZE             
.*                                          FOR IEAVESTS                        
.*  OY08963 - CHANGE NUMBER OF SYSTEM LXS (SVTNSLX)            @YA08963         
.*  $03=OY11015   HBB3310  880115  PD16BN:  INCREASE SVTMCBCT FROM              
.*                                          X'7FFF0010' TO X'7FFF0050'          
.*  OY10908 - Integrity                                        @YA10908         
.*                                                                              
.*  OY13926 - DECREASE SVTMCBCT FROM X'7FFF0050' TO X'7FFF0003'                 
.*                                                             @YA13926         
.*  $L8=LOCKR     HBB4410  870316  PD16Q4:  LOCK RESTRUCTURE                    
.*  $L9=LOCKR     HBB4410  870831  PD16Q9:  LOCK RESTRUCTURE                    
.*  $LA=COUPL     HBB4410  880711  PD16Q4:  XCF SUPPORT                         
.*  $04=OY20822   JBB3311  890227  PD16BN:  Common Area Data Space              
.*                                          Support SPE                         
.*  $05=OY29197   HBB3310  900201  PD16CV:  HIGH PERFORMANCE PARALLEL           
.*                                          INTERFACE SUPPORT (AKA HSC)         
.*  $06=OY27050   JBB3313  890403  PD16ES:  ENCRYPTION ASYMMETRIC               
.*                                          FEATURE SUPPORT                     
.*  $07=OY58195   HBB4430  920915  PD16H5:  Alternate Wait Management           
.*  $LB=DISPR     HBB5510  930801  PD16EJ:  Dispatcher Restructure              
.*  $LC=DISPR     HBB5510  930801  PDAG:    Dispatcher Restructure              
.*  $LD=DISPR     HBB5510  930801  PD16XZ:  Dispatcher Restructure              
.*  $LE=DISPR     HBB5510  930801  PD16CU:  Dispatcher Restructure              
.*  $08=OW02794   HBB5510  931207  PD162M:  XES performance support             
.*  $LF=ENCLV     HBB5520  940210  PD16AA:  ENCLAVE support                     
.*  $LG=ENCLV     HBB5520  940210  PD16XZ:  ENCLAVE support                     
.*  $09=OW05328   HBB5510  940629  PD16GD:  XES performance support             
.*  $0A=OW19665   HBB5510  960506  R4GAXZ:  CMSET DIE entry points              
.*  $0B=OW22516   HBB5510  960918  R4GAXZ:  Increase NSLX to 165.               
.*  $LH=IEEESUP   HBB6606  971001  PD00XB:  Larger SVTSSTSV                     
.*  $P1=PWK0260   HBB6608  981012  R4GAXZ:  Delete SVTSSRBE/M/C/P/S/A           
.*  $0C=OW33027   HBB5520  980518  R4GAXZ:  Increase SSRBM from 22              
.*                                          to 80. **This fix does              
.*                                          not roll into HBB6608.              
.*                                          This function was                   
.*                                          redesigned in HBB6608.**            
.*  $LI=64BITSUP  HBB7703  971101  PD00XB:  Larger SVTSSTSV                     
.*  $P2=PYN0593   HBB7708  020809  PD00K1:  AleservP ADDGRS support             
.*  $LJ=GT16WAY   HBB7709  021010  PD6U:    Greater than 16 CPUs   @LJA         
.*  $LK=LXREU     HBB7709  030714  PD00XB:  ASN-and-LX-Reuse Facility           
.*  $P3=PJK0686   HBB7709  030722  PD00XB:  Larger STSV                         
.*  $P4=PJK1098   HBB7709  031030  U2IAXZ:  Change default for SVTMCADS         
.*                                          from 25 to 50.                      
.*  $H3=IFA       HBB7709  031205  PD00XB:  IFA support                         
.*  $P5=PJK1526   HBB7709  040301  PD00XB:  2 bytes for crossover limit         
.*  $P6=PJK1542   HBB7709  040303  PD00XB:  More IFA fields                     
.*  $LL=WILDB     HBB7720  040303  PD00XB:  Larger STSV                         
.*  $0D=OA07169   HBB7709  040421  PD00XB:  SVTDSBCM                            
.*  $P7=PDE0219   HBB7720  040503  U2IAXZ:  Update SVTALMAX#.                   
.*  $LM=zXML      HBB7720  040706  PD00XB:  SVT_IEAVIFAP                        
.*  $P8=ME02159   HBB7720  041020  PD00GD:  Support 64 CPUs                     
.*  $0F=OA09113   HBB7709  050112  PD00GD:  IFA Short wait                      
.*  $0G=OA.....   HBB7709  050301  PD00GD:  IFA Help improvements               
.*  $LN=AFFDISP   HBB7730  050311  PD00GD:  Affinity Dispatcher                 
.*  $LO=64CPUS    HBB7730  050401  PD00GD:  Support 64 CPUs                     
.*  $P9=ME04248   HBB7730  050810  PDGD:    VCM Forced change support           
.*  $H4=SUP       HBB7730  051109  PD00QR:  SUP support                         
.*  $PA=ME05341   HBB7730  051230  PD00XB:  Always produce CMSET names          
.*  $0H=OA15188   HBB7730  050926  PD00BP:  1 short waiter                      
.*  $LP=ME06126   HBB7730  060310  PD00QR:  zIIP code review update             
.*  $LQ=ME06249   HBB7740  060209  PD00QR:  VCM support                         
.*  $LR=PROMOTE   HBB7730  050809  PD00GD:  Enhanced promotion                  
.*     =PROMO19   HBB7740  060515  GONGSU:  Rebase for 1.9                      
.*  $LS=ME06938   HBB7740  060606  PD00QR:  VCM need help improvement           
.*  $LT=ME07178   HBB7740  060712  PD00QR:  Adding SVTAPCP & SVTWPSCT           
.*  $LU=PROMOTE   HBB7740  061012  PD00XB:  SVT_Trickle_Time                    
.*  $LV=ME08249   HBB7740  061026  PD00QR:  VCM=yes enhancement                 
.*  $PS=ME08285   HBB7740  061107  PD00D0:  Added SVTMAXQL                      
.*  $LW=ME08554   HBB7740  061113  PD00QR:  ME08249 code review changes         
.*  $H5=P001      HBB7740  070215  PD00XB:  P001                                
.*  $PT=ME09120   HBB7740  070215  PD00BS:  Hang after VCM transitions          
.*  $PU=ME09191   HBB7740  070129  PD00BS:  Bit for IEAVESPN to call            
.*                                          global recovery in EGRT             
.*  $LZ=FRRSDWA   HBB7740  070131  PD00KD:  Larger STSV                         
.*  $PV=ME09370   HBB7740  070312  PD00D0:  Add SvtVcmAcrUnpark                 
.*                                          (For ME08696)                       
.*  $PW=ME09671   HBB7740  070316  PD00D0:  Add SvtVcmEgrForceNonAff            
.*  $0I=OA20633   JBB772S  070501  PD00D0:                                      
.*                                          Add SvtVcmInDegradedState,          
.*                                          SvtLogicalCpuGoingOffline           
.*                                                                              
.*  $M1=SVAJOS    HBB7750  070816  PDHC:    AutoIPL.  Add SVTD308               
.*  $M2=ME12370   HBB7750  080117  PD00BS:  WUQ Expansion                       
.*  $M3=G64CPU    HBB7760  070720  PD00BS:  Greater than 64 CPU support         
.*  $M4=DYNCP     HBB7750  080301  PD00XB:  Dynamic CPU Addition                
.*  $0J=OA23767   JBB772S  080501  PD00XB:  zIIP Entitlement                    
.*  $PX=ME12744   HBB7750  080229  PD00D0:  SVTHDInTransition                   
.*  $M5=G64CPU    HBB7760  080317  PD00BS:  Cache Alignment of CPU ptrs         
.*  $M6=zAAPzIIP  HBB7760  080401  PD00XB:  zAAP on zIIP                        
.*  $M7=MANYSRB   HBB7760  080310  PD00XZ:  Too many SRBs                       
.*  $PY=ME24086   HBB7760  080530  PD00XZ:  Change                              
.*                                          SvtInitialPromotionCount            
.*                                          from 200 to 50.                     
.*  $0K=OA25908   JBB772S  080601  PD00XB:  CPCR                                
.*  $M8=DEFSWTCH  HBB7760  081101  PD00XB:  Deferred switch from                
.*  $M9=MANYSRB   HBB7760  081102  PD00XZ:  Change                              
.*                                          SvtInitialPromotionCount            
.*                                          to 200.                             
.*  $0M=OA26310   JBB772S  080826  PD00D0:  SVT Short Minor Slice. Add          
.*                                         SVT_Tiny_ND_CPUs_Short_Minor         
.*                                     SVT_Not_Tiny_ND_CPUs_Short_Minor         
.*                                         SVTMINHL                             
.*  $MA=RSMHSR    HBB7770  090123  PD00OH:  Hyperswap Resiliency. Add           
.*                                          SVT_CriticalPaging and              
.*                                          SVT_Hyperswap_In_Progress           
.*                                          (Feature ME15296)                   
.*  $MB=DTS       HBB7770  090120  PD00BS:  Discretionary Timeslice             
.*  $MC=CACHEOPT  HBB7770  090510  PD00IN:  Cache optimization                  
.*  $PZ=ME16113   HBB7770  090511  PD00BS:  Move SuperSlice Block               
.*  $MD=HDCPCR    HBB7770  090420  PD00BS:  HDCPCR                              
.*  $ME=PERFSERV  HBB7770  090531  PD00D0:  Perf Serviceability                 
.*  $0N=OA28744   HBB7730  090417  PD00D0:  HD=YES Lock Promote Short           
.*                                          minors                              
.*  $MF=ME17184   HBB7770  090915  PD00XB:  ProcType2or5NowInstalled            
.*  $MG=ME17081   HBB7770  090909  PD00BS:  HDCPCR Part 2                       
.*  $0O=DEFSWTCH  HBB7740  090601  PD00XB:  Deferred switch from 75%            
.*  $MH=ME17539   HBB7770  091022  PD00XB:  zAAP_On_zIIP off reason             
.*  $Q1=ME17619   HBB7770  091031  PD00D0:  Perf Improvements                   
.*  $0Q=OA30158   HBB7740  100422  PD00D0:  Define SIGP Governor Field          
.*  $0R=OA32383   HBB7740  100512  PD00D0:  Global SIGP Governor                
.*                                          Support - SIGP Shift                
.*                                          constants.                          
.*  $0S=OA30476   HBB7750  091031  PD00D0:  SVTCR_Flags                         
.*  $MI=RMODE64   HBB7780  091101  PD00XB:  Remove SVTDIAG                      
.*  $MJ=SPNINST   HBB7780  100226  PD00BS:  Spin Lock Instrumentation           
.*  $MK=READYQ    HBB7780  100801  PD00D0:  Ready Queue Management              
.*                                          (RQM)                               
.*  $ML=CPC       HBB7790  110313  PD00D0:  CPC support                         
.*  $MM=CPUINFR1  HBB7790  110531  PD00D0:  CPUINFR1 support                    
.*  $MN=SRBTERM   HBB7790  110616  PD00KD:  SvtSrbIdSeq#                        
.*  $MO=WARNTRAK  HBB7790  110801  PD00D0:  WarnTrak Support                    
.*  $MP=SIM4I     HBB7790  120415  PD00BS:  SIM4I                               
.*  $MQ=ME24034   HBB7790  120501  PD00XB:  zAAPs+zIIPs                         
.*  $MR=ME20209   HBB7780  101025  PD00XB:  SVTRNALV                            
.*  $MS=SIM4I     HBB7790  120531  PD00D0:  SIM4I support                       
.*  $MT=ME24369   HBB7790  120515  PD00BS:  SMF30 Counter Section               
.*  $MU=ME24718   HBB7790  120905  PD00JA:  SvtCaptInstrCtrSTCK                 
.*  $MV=SIM4I     HBB7790  120905  PD00D0:  SIM4I support Cont                  
.*  $MW=ME24913   HBB7790  121101  PD00XB:  ME24913                             
.*  $MX=ZZSIM2    HBB77A0  121203  PD00D0:  ZZSIM2 support Cont                 
.*  $0T=OA39413   HBB7790  130125  PD00KP:  SvtEgrNoActiveHdWUQs                
.*  $MY=ZZSIM2    HBB77A0  130220  PD00D0:  ZZSIM2 support                      
.*  $Q2=ME25880   HBB7790  130227  PD00D0:  Mark HonorPriority PI               
.*  $MZ=ZZSIM2    HBB77A0  130508  PD0AAA:  New fields in SVT                   
.*  $Q3=ME26354   HBB77A0  130608  PD00D0:  Normalization fields PI             
.*  $N1=ZZSIM2    HBB77A0  130624  PD0AAA:  HIS timer task error bit            
.*  $N2=ZZSIM2    HBB77A0  130702  PD0AAA:  SVT_Diag588                         
.*  $N3=ZZSIM2    HBB77A0  130723  PD0AAA:  SVT_Diag588 update                  
.*  $N4=NLC       HBB77A0  131115  PD00D0:  NLC Support                         
.*  $N5=ZZSIM2    HBB77A0  140123  PD0AAA:  Moved SvtProcAsCore to SVT.         
.*  $N6=ZZSIM2    HBB77A0  140115  PD00D0:  ZZSIM2 support                      
.*  $N7=NLC       HBB77A0  141109  PD00D0:  NLC Dev Only Improvements           
.*  $N8=ME27148   HBB77A0  141226  PD00KP:  Remove OA39413 (UR1 of              
.*                                          OA44390)                            
.*  $0U=OA43366   HBB77A0  131029  PD0AAA:  ZZSIM2 rollup                       
.*  $N9=GSF       HBB77B0  150707  PD00KD:  GSF                                 
.*  $0V=OA48571   HBB77A0  150713  PD0AAA:  HFTS instrumentation data           
.*     =OA48571   HBB77A0  160330  PD00JI:  HFTS support                        
.*  $0W=OA48571   HBB77A0  151130  PD00NJ:  HFTS Address Space Ctrs             
.*  $NA=HDEXT     HBB77B0  170227  PD00NJ:  HDEXT                               
.*  $0X=OA53617   HBB7790  170701  PD00XB:  IEAVDEBL                            
.*  $0Y=OA54807   HBB7790  180330  PD00XB:  OA54807                             
.*  $NB=zCBP      HBB77C0  170825  PD00NJ:  zCBP                                
.*  $0Z=FB        HBB77B0  190131  PD00XB:  FB                                  
.*  $NC=W377825   HBB77D0  200615  PD00XB:  SVTSSJS                             
.*  $10=OA60036   HBB77C0  211012  PD00D0:  z16                                 
.*  $11=OA62783   HBB77D0  230307  PD00XB:  Validated Boot                      
.*                                                                              
.*********************************************************************          
.*                                                                              
.*********************************************************************          
.*                                                                              
.* THE FOLLOWING ARE THE NAMING CONVENTIONS USED FOR RESERVED AREAS             
.*     1. RESERVED FIELDS ARE NAMED AS FOLLOWS                                  
.*                        SVTRXXX  DC    XLNNN'00' - RESERVED.                  
.*                            XXX IS THE OFFSET WITHIN THE SVT                  
.*                            NNN IS THE LENGTH OF THE RESERVED FIELD           
.*                                A VALUE FROM 1 TO 256 INCLUSIVE               
.*                                                                              
.*     2. PL/S - RESERVED FIELDS DEFINED AS BIT STRINGS WHICH ARE NOT           
.*               MULTIPLES OF 8 OR DO NOT START ON A BYTE BOUNDARY              
.*               ARE NOT NAMED.                                                 
.*                                                                              
.*********************************************************************          
         PUSH  PRINT                                               @H2A         
         GBLC  &SVT_CPUDUALPATH                                    @M3A         
         AIF   ('&LIST' EQ 'YES').SVTLIST                          @H2A         
         PRINT OFF                                                 @H2A         
.SVTLIST ANOP                                                      @H2A         
         SPACE 1                                                                
         AIF ('&CSECT' EQ 'NO').A1                                              
&SVTNAME CSECT                                                                  
         AGO   .A2                                                              
.A1      ANOP                                                                   
SVT      DSECT                                                                  
.A2      ANOP                                                                   
SVTISECT DC    V(IEAVEINT)         ADDRESS OF INTERSECT ROUTINE                 
SVTGSCH1 DC    V(IEAVESC3)         ADDRESS OF GLOBAL SCHEDULE ROUTINE           
*                                  FOR ENABLED USERS                            
SVTGSCH2 DC    V(IEAVESC4)         ADDRESS OF GLOBAL SCHEDULE ROUTINE           
*                                  FOR DISABLED USERS                           
SVTAWUQ  DC    A(0)                 Address of the AWUQ            @LNC         
*                                   SERIALIZATION: None                         
*                                   OWNERSHIP: Supervisor Control               
SVTAFFON EQU   X'80'                Affinity dispatching is active @LNA         
SVTWEEF  DC    A(0)                 Address of the first WEB      @LBA          
*                                   Extent Element Pool.                        
*                                   SERIALIZATION: Compare and Swap or          
*                                   Global Recovery protocols.                  
*                                   OWNERSHIP: Supervisor Control               
SVTRSCS  DC    V(IEAVRSCS)         RESUME CONDITIONAL ENTRY PT @G387PXU         
SVTJSTEQ DC    F'0'                JOB STEP TIME EXCEEDED QUE                   
SVTDSREQ DS    0F                  DISPATCHER SERIALIZATION REQUIRED            
SVTSRQ1  DC    XL1'0'              FIRST BYTE OF SVTDSREQ                       
SVTDSG4  EQU   X'80'               SIGNAL WAITING PROCESSORS                    
SVTDFLT  EQU   X'40'               DEFAULT GLOBAL INTERSECT                     
SVTSRQ2  DC    XL1'0'              SECOND BYTE OF SVTDSREQ                      
SVTDSG3  EQU   X'80'               SIGNAL WAITING PROCESSORS                    
SVTSRM1  EQU   X'02'               SRM IS INTERSECTING                          
SVTQVER  EQU   X'01'               Q VERIFICATION INTERSECTING                  
SVTSRQ3  DC    XL1'0'              THIRD BYTE OF SVTDSREQ                       
SVTDSG2  EQU   X'80'               SIGNAL WAITING PROCESSORS                    
SVTRCTI  EQU   X'40'               RCT INTERSECTING            @ZM48358         
SVTTCBV  EQU   X'20'               TCB VERIFICATION INTERSECTING                
SVTACHA  EQU   X'10'               ASCB CHAP INTERSECTING                       
SVTMTER  EQU   X'04'               MEMTERM INTERSECTING                         
SVTMINI  EQU   X'02'               MEMORY INIT INTERSECTING                     
SVTCBVE  EQU   X'01'               CONTROL BLOCK VERIFICATION INTER             
SVTSRQ4  DC    XL1'0'              FOURTH BYTE OF SVTDSREQ                      
SVTDSG1  EQU   X'80'               SIGNAL WAITING WAITING PROCESSORS            
SVTDETA  EQU   X'40'               DETACH INTERSECTING                          
SVTATTA  EQU   X'20'               ATTACH INTERSECTING                          
SVTRTM2  EQU   X'10'               RTM2 INTERSECTING                            
SVTRTM1  EQU   X'08'               RTM1 INTERSECTING                            
SVTCHAP  EQU   X'04'               TCB CHAP INTERSECTING                        
SVTSTAT  EQU   X'02'               STATUS INTERSECTING                          
SVTPURD  EQU   X'01'               PURGE DQ INTERSECTING                        
SVTGSRB  DS    0D                  GLOBAL SRB QUEUES                            
SVTGSMQ  DC    F'0'                GLOBAL SERVICE MANAGEMENT QUEUE              
         AIF   ('&CSECT' EQ 'NO').B1                                            
IEAGSMQ  EQU   SVTGSMQ                                                          
         ENTRY IEAGSMQ                                                          
.B1      ANOP                                                                   
SVTGSPL  DC    XL4'FFFFFFFF'        No longer used. Must remain    @LBC         
*                                   x'FFFFFFFF'.                                
*                                   SERIALIZATION: None                         
*                                   OWNERSHIP: Supervisor Control               
         AIF   ('&CSECT' EQ 'NO').C1                                            
IEAGSPL  EQU   SVTGSPL                                                          
         ENTRY IEAGSPL                                                          
.C1      ANOP                                                                   
SVTLSMQ  DC    F'0'                LOCAL SERVICE MANAGEMENT QUEUE               
         AIF   ('&CSECT' EQ 'NO').D1                                            
IEALSMQ  EQU   SVTLSMQ                                                          
         ENTRY IEALSMQ                                                          
.D1      ANOP                                                                   
SVTR02C  DC    XL64'00'                                            @M3C         
         AIF   ('&SVT_CPUDUALPATH' NE 'YES').F1                    @M3A         
*  These will be removed in a future release, when the old fields               
*  will no longer be supported.  Use the new pointers exclusively               
*  to access fields for code being run on HBB7760 and higher       @M3A         
         ORG  SVTR02C                                              @M3A         
SVTWAS_OLD   DC    XL64'00'        WAIT ADDRESS SPACE VECTOR USED               
*                                  TO SIGP MEMORY SWITCH TO WAITING             
*                                  PROCESSOR. 1 byte per CPU.      @M3C         
*                                                                               
*  End of fields that will be removed in a future release          @M3A         
*                                                                               
.F1      ANOP                                                      @M3A         
         DS    0F                                              @G860PXD         
         DC    XL4'FFFFFFFF'       PREVIOUSLY SVTDACTV -       @G860PXD         
*                                  MUST ALWAYS REMAIN NONZERO  @G860PXD         
SVTAPCP  DC    H'4'                Initial value for the number of @LTA         
*                                  WEBs that must be on a WUQ      @LTA         
*                                  as a gating factor for AWM SIGP @LTA         
*                                  SERIALIZATION: NONE             @LTA         
*                                  OWNERSHIP: SRM                  @LTA         
SVTMAXQL DC    H'7'                The maximum number of WEBs 1 CP     X        
                                   can dispatch in a timely fashion.   X        
                                   Serialization: NONE                 X        
                                   Ownership: Supervisor/SRM       @MEC         
SVTMINHL DC    H'7'                When a CP chooses another CPU for   X        
                                   help, the minimum number of         X        
                                   dispatches which will be done for   X        
                                   help.                               X        
                                   Serialization: NONE                 X        
                                   Ownership: Supervisor/SRM       @MEC         
SVT_ShortMinHdYesLockPromote DC XL1'30' Number of short minors lock    X        
                                   promote can occur for in HD=YES.    X        
                                   This field is dynamically updated   X        
                                   in IEAVMPWQ                     @0NA         
SVT_ShortMinHdYesLockProMax EQU 255 Maximum number of short minors for X        
                                   lock promote                    @0NA         
SVT_MajorsHdYesLockPromote EQU 3   Number of majors for lock promote   X        
                                                                   @0NA         
SVTEGRT  DC    XL1'0'              Global Recovery Test bits                    
*                                  SERIALIZATION: NONE             @PUA         
SVTInvokeGrOnSpin EQU   X'80'      When on, next invoker of IEAVESPN            
*                                  will invoke global recovery     @PUA         
SVTCRSCR DC    V(IEAVCRSC)         Address of the Supervisor       @LDA         
*                                  Checkpoint/Restart SRB Check    @LDA         
*                                  Routine.                        @LDA         
         DC    XL4'FFFFFFFF'       PREVIOUSLY SVTPWAIT -       @G860PXD         
*                                  MUST ALWAYS REMAIN NONZERO  @G860PXD         
SVTWPSCT DC    F'0' -              Count of SIGPs to waiting processors         
*                                  due to timeout between waits    @LTA         
*                                  SERIALIZATION: NONE             @LTA         
*                                  OWNERSHIP: SRM                  @LTA         
SVTR084  DC    XL4'00'             Reserved. Formerly SVTMSWCT     @M5C         
         AIF   ('&CSECT' EQ 'YES').D2                              @02A         
SVTACTR  DC    V(IEAVRT05)         ADDRESS OF ACCUMULATED CPU TIME @02A         
*                                  SERVICE ROUTINE USED BY TIMEUSED             
*                                  MACRO                                        
         AGO   .D3                                                 @02A         
.D2      ANOP                                                      @02A         
         EXTRN IEAVRT05                                            @02A         
SVTACTR  DC    A(X'80000000'+IEAVRT05) ADDRESS OF ACCUMULATED CPU  @02A         
*                                  TIME SERVICE ROUTINE USED BY                 
*                                  TIMEUSED MACRO                               
.D3      ANOP                                                      @02A         
SVTISECR DC    V(IEAVEINR)         INTERSECT RESET ROUTINE                      
SVTXASCB DC    F'0'                ADDRESS OF PC/AUTH ASCB.    @G387PXU         
SVTXMD   DC    F'0'                ADDRESS OF CROSS MEMORY     @G387PXU         
*                                  DIRECTORY (XMD)             @G387PXU         
*                                  (IN PC/AUTH ADDRESS SPACE). @G387PXU         
SVTGSPH  DC    V(IEASTKH)          ADDRESS OF GLOBAL STACK     @G387PXU         
*                                  POOL HEADER FOR PCLINK      @G387PXU         
*                                  SERVICE.                    @G387PXU         
SVTMCADS DC    H'50'               MAXIMUM NUMBER OF ALE SLOTS IN  @P4C         
*                                  A PASN ACCESS LIST RESERVED FOR              
*                                  CADS. INITIALIZED TO 50. MAY BE              
*                                  CHANGED BY IEAVNP09.                         
SVTMPALE DC    H'0'                NUMBER OF NON-CADS PASN ACCESS  @04A         
*                                  LIST ENTRIES. INITIALIZED BY                 
*                                  IEAVNP09.                                    
SVTBBR   DC    V(IEAVEBBR)         ADDRESS OF THE BIND BREAK   @G387PXU         
*                                  ROUTINE.                    @G387PXU         
         AIF   ('&CSECT' EQ 'NO').SVT001A                          @LIA         
         WXTRN IEAVLACB                                            @LIA         
SVTLASCB DC    A(IEAVLACB)         ADDRESS OF LOCASCB SERVICE  @G387PXU         
         AGO   .SVT001B                                            @LIA         
.SVT001A ANOP                                                      @LIA         
SVTLASCB DS    A                   ADDRESS OF LOCASCB SERVICE  @G387PXU         
.SVT001B ANOP                                                      @LIA         
*                                  ROUTINE.                    @G387PXU         
SVTCMCKM DC    X'80000000'         CMSET CONSTANT FOR ICMA     @G387PXU         
*                                  CHECK.                      @G387PXU         
         AIF   ('&CSECT' EQ 'NO').SVT002A                          @LIA         
         WXTRN IEAVCMS1                                            @LIA         
SVTCMST1 DC    A(IEAVCMS1)         ADDRESS OF CMSET SET        @G387PXU         
*                                  No longer used                  @LKC         
         AGO   .SVT002B                                            @LIA         
.SVT002A ANOP                                                      @LIA         
SVTCMST1 DS    A                   ADDRESS OF CMSET SET        @G387PXU         
*                                  No longer used                  @LKC         
.SVT002B ANOP                                                      @LIA         
*                                  ROUTINE.                    @G387PXU         
         AIF   ('&CSECT' EQ 'NO').SVT003A                          @LIA         
         WXTRN IEAVCMR1                                            @LIA         
SVTCMRT1 DC    A(IEAVCMR1)         ADDRESS OF CMSET RESET,     @G387PXU         
*                                  No longer used                  @LKC         
         AGO   .SVT003B                                            @LIA         
.SVT003A ANOP                                                      @LIA         
SVTCMRT1 DS    A                   ADDRESS OF CMSET RESET,     @G387PXU         
*                                  No longer used                  @LKC         
.SVT003B ANOP                                                      @LIA         
*                                  CHKAUTH=YES ROUTINE.        @G387PXU         
         AIF   ('&CSECT' EQ 'NO').SVT004A                          @LIA         
         WXTRN IEAVCMR2                                            @LIA         
SVTCMRT2 DC    A(IEAVCMR2)         ADDRESS OF CMSET RESET,     @G387PXU         
*                                  No longer used                  @LKC         
         AGO   .SVT004B                                            @LIA         
.SVT004A ANOP                                                      @LIA         
SVTCMRT2 DS    A                   ADDRESS OF CMSET RESET,     @G387PXU         
*                                  No longer used                  @LKC         
.SVT004B ANOP                                                      @LIA         
*                                  CHKAUTH=NO ROUTINE.         @G387PXU         
         AIF   ('&CSECT' EQ 'NO').SVT005A                          @LIA         
         WXTRN IEAVCMST                                            @LIA         
SVTCMSTR DC    A(IEAVCMST)         ADDRESS OF CMSET SSARTO     @G387PXU         
*                                  No longer used                  @LKC         
         AGO   .SVT005B                                            @LIA         
.SVT005A ANOP                                                      @LIA         
SVTCMSTR DS    A                   ADDRESS OF CMSET SSARTO     @G387PXU         
*                                  No longer used                  @LKC         
.SVT005B ANOP                                                      @LIA         
*                                  ROUTINE.                    @G387PXU         
         AIF   ('&CSECT' EQ 'NO').SVT006A                          @LIA         
         WXTRN IEAVCMSB                                            @LIA         
SVTCMSBR DC    A(IEAVCMSB)         ADDRESS OF CMSET SSARBACK   @G387PXU         
*                                  No longer used                  @LKC         
         AGO   .SVT006B                                            @LIA         
.SVT006A ANOP                                                      @LIA         
SVTCMSBR DS    A                   ADDRESS OF CMSET SSARBACK   @G387PXU         
*                                  No longer used                  @LKC         
.SVT006B ANOP                                                      @LIA         
*                                  ROUTINE.                    @G387PXU         
         AIF   ('&CSECT' EQ 'NO').SVT007A                          @LIA         
         WXTRN IEAVCDEN                                            @LIA         
SVTCDSPE DC    A(IEAVCDEN)         ADDRESS OF CALLDISP ROUTINE @G387PXU         
         AGO   .SVT007B                                            @LIA         
.SVT007A ANOP                                                      @LIA         
SVTCDSPE DS    A                   ADDRESS OF CALLDISP ROUTINE @G387PXU         
.SVT007B ANOP                                                      @LIA         
*                                  FOR ENABLED CALLERS.        @G387PXU         
         AIF   ('&CSECT' EQ 'NO').SVT008A                          @LIA         
         WXTRN IEAVCDDS                                            @LIA         
SVTCDSPD DC    A(IEAVCDDS)         ADDRESS OF CALLDISP ROUTINE @G387PXU         
         AGO   .SVT008B                                            @LIA         
.SVT008A ANOP                                                      @LIA         
SVTCDSPD DS    A                   ADDRESS OF CALLDISP ROUTINE @G387PXU         
.SVT008B ANOP                                                      @LIA         
*                                  FOR DISABLED CALLERS.       @G387PXU         
SVTSRBSV DC    V(IEAVESTS)         ADDRESS OF SRBSTAT SAVE     @G387PXU         
*                                  ROUTINE.                    @G387PXU         
SVTSRBRS DC    V(IEAVESTR)         ADDRESS OF SRBSTAT RESTORE  @G387PXU         
*                                  ROUTINE.                    @G387PXU         
SVTAFFST DC    V(IEAVESAS)         ADDRESS OF SSAFF SET        @G387PXU         
*                                  ROUTINE.                    @G387PXU         
SVTAFFOB DC    V(IEAVESAF)         ADDRESS OF SSAFF OBTAIN     @G387PXU         
*                                  ROUTINE.                    @G387PXU         
SVTSRBG  DC    V(IEAVSPM1)         ADDRESS OF GETSRB ROUTINE.  @G387PXU         
SVTSSRBG DC    V(IEAVSPM2)         ADDRESS OF GETSSRB ROUTINE. @G387PXU         
SVTSRBF  DC    V(IEAVSPM3)         ADDRESS OF FREESRB ROUTINE. @G387PXU         
SVTSSRBF DC    V(IEAVSPM4)         ADDRESS OF FREESSRB ROUTINE @G387PXU         
SVTSRBP  DS    0D                  SUPERVISOR SRB POOL HEADER. @G387PXU         
*                                  SERIALIZATION - CDS.        @G387PXU         
SVTSRBS  DC    F'0'                SRB POOL ELEMENT SYNC COUNT @G387PXU         
SVTSRBA  DC    F'0'                ADDRESS OF FIRST AVAILABLE  @G387PXU         
*                                  SRB.                        @G387PXU         
SVTSRBE  DS    0F                  SRB POOL EXTENT COUNTS.     @G387PXU         
*                                  SERIALIZATION - SALLOC.     @G387PXU         
SVTSRBM  DC    H'3'                MAX SRB POOL EXTENTS.           @LAC         
SVTSRBC  DC    H'0'                CURRENT SRB POOL EXTENTS.   @G387PXU         
SVTR0F4  DC    XL12'00'            Reserved. Formerly SVTWTSS_IFA,              
*                                  SVTSSRBP/S/A                    @M5C         
SVTSVT   DC    CL4'SVT '           SVT ACRONYM.                @G387PXU         
SVTRSUA  DC    V(IEAVRSUA)         ADDRESS OF RESUME ROUTINE   @G387PXU         
*                                  FOR ASYNCHRONOUS            @G387PXU         
*                                  UNCONDITIONAL OPTION.       @G387PXU         
SVTRSCA  DC    V(IEAVRSCA)         ADDRESS OF RESUME ROUTINE   @G387PXU         
*                                  FOR ASYNCHRONOUS            @G387PXU         
*                                  CONDITIONAL OPTION.         @G387PXU         
SVTRSUS  DC    V(IEAVRSUS)         ADDRESS OF RESUME ROUTINE   @G387PXU         
*                                  FOR SYNCHRONOUS             @G387PXU         
*                                  UNCONDITIONAL OPTION        @G387PXU         
*                                  WITH ASCB SPECIFIED.        @G387PXU         
SVTDSBCT DS    0XL4 -              MAXIMUM NUMBER OF WEBs the      @07C         
*                                  DISPATCHER CAN PROCESS BEFORE   @07C         
*                                  INVOKING RECOVERY.              @07C         
*                                                                               
*   1FFF0026 is the initial value of SVTDSBCT, but will be replaced by          
*   the SRM RIM, during NIP.  The low half of the value is an                   
*   approximation of the number of instructions required during the             
*   dispatcher work search processing to look at one WEB                        
*   from the WUQ.  The high half of this value is used only until this          
*   value is replaced, and serves just to make this a large number.             
*                                                                               
*   Due to the use of bits 0-2, the maximum value that can be used              
*   for DSBCT is 2**29-1 which can accommodate about a 14 BIP UP.               
*   If we approach that limitation, we would need to change                     
*   something.                                                                  
*                                                                               
         DC    XL1'1F' -                                           @P6C         
SVTCHKWP EQU   X'80'               CHECK WAITING PROCESSOR IF ON   @07A         
SVTWPCP  EQU   X'40'               Waiting processor is CP         @P6A         
SVTWPIFA EQU   X'20'               Waiting processor is IFA        @P6A         
SVTDSBCM EQU   X'1FFFFFFF'         Mask to AND with SVTDSBCT to    @0DA         
*                                  isolate the count               @0DA         
         DC    XL2'FF00' -                                         @07A         
         DC    XL1'26' -                                           @07A         
SVTAWM   EQU   X'01'               ALTERNATE WAIT MANAGEMENT       @07A         
*                                  ENABLED FLAG (SVTDSBCT LOW BIT) @07A         
*                                  SET BY SRM                      @07A         
*                                  SERIALIZATION: NONE             @07A         
SVTMCBCT DC    X'7FFF0003' -       Maximum number of times to      @LBC         
*                                  loop on a locked WEB before                  
*                                  invoking Global Recovery.  The last          
*                                  byte of this field should be equal           
*                                  to the number of instructions                
*                                  executed by the dispatcher in its            
*                                  worksearch loop used to lock a WEB.          
*                                  SERIALIZATION: None                          
*                                  OWNERSHIP: SRM                               
SVTFW1   DS    0F                  FULLWORD SERIALIZED BY CS.  @G387PXU         
SVTCS1   DC    X'00'               FIRST BYTE OF CS WORD.      @G387PXU         
SVTXMSOP EQU   X'80'               PC/AUTH SERVICE ROUTINES    @G387PXU         
*                                  OPERABLE.                   @G387PXU         
SVTXMSUP EQU   X'40'               PC/AUTH ADDRESS SPACE       @G387PXU         
*                                  INITIALIZED.                @G387PXU         
SVTXMCMF EQU   X'20'               CROSS MEMORY CONNECTIONS        @L5A         
*                                  MANAGER HAS FAILED.             @L5A         
*                                  REUSABILITY FUNCTIONS ARE NOT   @L5A         
*                                  OPERATIONAL.  SERIALIZED BY     @L5A         
*                                  PC/AUTH LOCAL LOCK.  SET BY     @L5A         
*                                  IEAVXMCM RECOVERY.              @L5A         
*                                                                 1@LID         
*                                                              @YA10908         
SVTAWUQE EQU   X'10'               Supervisor AWUQ error, affinity     -        
                                   nodes must be rebuilt           @P9A         
SVTCPCRN EQU   X'08'                                               @0KA         
SVT_CRITICALPAGING EQU X'04'       On when hardening critical address           
*                                  spaces against pagefaults.  Note:            
*                                  If dynamically turned on, currently          
*                                  'paged-out' storage will NOT be              
*                                  paged-in for critical address                
*                                  spaces                          @MAA         
SVT_HYPERSWAP_IN_PROGRESS EQU X'02'  On when a Hyperswap process is in          
*                                  progress                        @MAA         
SvtCoreModeError EQU X'01'         Error detected for MT mode of 1 or           
*                                  more cores                      @0UA         
SVTCS2   DC    XL1'00'             SECOND BYTE OF CS WORD.         @N1A         
SVTForceCoreMode_1 EQU X'80' Supervisor error:unable to continue in MT          
*                        mode>1. Set bit ON to tell WLM to change MT            
*                        mode to 1 for all processor classes for the            
*                        remaining life of this IPL. Bit is not turned          
*                        OFF. Forced to stay in MT mode 1 since error           
*                        is not correctable.                       @0UA         
SVTR11A  DC    XL2'00'             RESERVED.                       @N1C         
*                                  SERIALIZATION - CS.             @N1C         
SVTDSPC  DC    V(IEAVDSPC)         ADDRESS OF DISPATCHER ENTRY @G387PXU         
*                                  POINT FOR STOP ROUTINE      @G387PXU         
*                                  CALLERS.                    @G387PXU         
SVTAFTR  DC    F'0'                VIRTUAL ADDRESS OF ADDRESS  @G387PXU         
*                                  SPACE FIRST TABLE (AFT)     @G387PXU         
*                                  CONTAINING REAL ADDRESSES.  @G387PXU         
SVTAFTV  DC    F'0'                VIRTUAL ADDRESS OF ADDRESS  @G387PXU         
*                                  SPACE FIRST TABLE (AFT)     @G387PXU         
*                                  CONTAINING VIRTUAL          @G387PXU         
*                                  ADDRESSES.                  @G387PXU         
SVTSSEM  DC    V(IEAVESSE)         ADDRESS OF SPACE SWITCH     @G387PXU         
*                                  EVENT MANAGER.              @G387PXU         
SVTISSAT DC    V(IEAISSAT)         ADDRESS OF INITIAL          @G387PXU         
*                                  SUBSYSTEM AFFINITY TABLE    @G387PXU         
*                                  FOR ALL TASKS.              @G387PXU         
SVTSSTSV DC    F'2128'             LENGTH REQUIRED FOR             @NBC         
*                                  SRB STATUS SAVE AREA.                        
SVTWTSS  DC    F'0'                Short time slice wait time      @LSC         
*                                  Ownership: SRM                               
*                                  Serialization: SRMLOCK                       
SVTMDLQ  DC    F'0'                MEMORY DELETE QUEUE HEADER  @G387PXU         
*                                  FOR ASCBS THAT CANNOT BE    @G387PXU         
*                                  FREED.                      @G387PXU         
SVTSLWLN DC    F'0'                SLIP/PER WORK AREA LENGTH   @G387PXU         
*                                  REQUIRED FOR EACH PROCESSOR @G387PXU         
SVTSRBMD DC    V(IEAVESTM)         ADDRESS OF SRBSTAT MODIFY   @G387PXU         
*                                  ROUTINE.                    @G387PXU         
SVTIFA   DS    0XL2                IFA info                        @H3A         
SVT_AWUQ_help_limit_prty DC AL2(203) Help limit priority for alternate          
*                                  WUQs                            @LPC         
         ORG   SVT_AWUQ_help_limit_prty                                         
SVT_ASWUQ_help_limit_prty DS XL2   Limit priority for IFA help     @H4C         
SVTNSLX  DC    H'165'              NUMBER OF SYSTEM LXS BEYOND     @0BC         
*                                  THE HIGHEST SYSTEM FUNCTION                  
*                                  TABLE LX.                                    
SVTSET1  DC    V(IEAVSET1)         ADDRESS OF STATUS ENTRY     @G387PXU         
*                                  POINT TO SIGPCPUS ROUTINE.  @G387PXU         
SVTISECG DC    V(IEAVEING)         ADDRESS OF INTERSECT GLOBAL @G860PXH         
*                                  ENTRY POINT                 @G860PXH         
SVTISECL DC    V(IEAVEINL)         ADDRESS OF INTERSECT LOCAL  @G860PXH         
*                                  ENTRY POINT                 @G860PXH         
SVTSWUQ  DC    0XL4                 System WUQ (SWUQ) header       @LVC         
*                                   address.                                    
*                                   INITIALIZED: IEAVINIT/IEAVMPWQ              
*                                   SERIALIZATION: WEB Lock Protocol            
*                                   OWNERSHIP: Supervisor Control               
SVTHPWUQ DC    A(0)                 The system WUQ is used as the  @LVA         
*                                   high priority WUQ in HD=YES                 
*                                   mode                                        
*                                   This value is zero in HD=NO    @LWA         
*                                   INITIALIZED: IEAVINIT/IEAVMPWQ              
*                                   SERIALIZATION: WEB Lock Protocol            
*                                   OWNERSHIP: Supervisor Control               
         AIF   ('&CSECT' EQ 'NO').SVT009A                          @LIA         
         WXTRN IEAVCMS2                                            @LIA         
SVTCMST2 DC    A(IEAVCMS2)         Address of CMSET SET,DIE=YES    @0AC         
*                                  No longer used                  @LKC         
         AGO   .SVT009B                                            @LIA         
.SVT009A ANOP                                                      @LIA         
SVTCMST2 DS    A                   Address of CMSET SET,DIE=YES    @0AC         
*                                  No longer used                  @LKC         
.SVT009B ANOP                                                      @LIA         
*                                  routine.                                     
SVTBEST@ DC    A(0)                Address of XES Back End         @08A         
*                                  Schedule Table (BEST).                       
*                                  SERIALIZATION: XES-determined                
*                                  protocol                                     
*                                  OWNERSHIP: XES                               
         DS    0D                  INSURE DOUBLEWORD BDY       @G860PXD         
         DC    16XL1'0'            Reserved: was SVTDACTV          @LJC         
         DS    0D                  INSURE DOUBLEWORD BDY       @G860PXD         
         DC    16XL1'0'            Reserved: was SVTPWAIT          @LJC         
         DC    F'0'                Reserved: was SVTWPBM           @LJC         
         DC    F'0'                Reserved: was SVTSNCT2          @LJC         
         AIF   ('&CSECT' EQ 'NO').SVT010A                          @LIA         
         WXTRN IEAVCMR3                                            @LIA         
SVTCMRT3 DC    A(IEAVCMR3)         Address of CMSET RESET,         @0AC         
*                                  No longer used                  @LKC         
         AGO   .SVT010B                                            @LIA         
.SVT010A ANOP                                                      @LIA         
SVTCMRT3 DS    A                   Address of CMSET RESET,         @0AC         
*                                  No longer used                  @LKC         
.SVT010B ANOP                                                      @LIA         
*                                  CHKAUTH=YES,DIE=YES routine.                 
         AIF   ('&CSECT' EQ 'NO').SVT011A                          @LIA         
         WXTRN IEAVCMR4                                            @LIA         
SVTCMRT4 DC    A(IEAVCMR4)         Address of CMSET RESET,         @0AC         
*                                  No longer used                  @LKC         
         AGO   .SVT011B                                            @LIA         
.SVT011A ANOP                                                      @LIA         
SVTCMRT4 DS    A                   Address of CMSET RESET,         @0AC         
*                                  No longer used                  @LKC         
.SVT011B ANOP                                                      @LIA         
*                                  CHKAUTH=NO,DIE=YES routine.                  
SVTSUSC  DC    V(IEAVSUSC)         GENERALIZED STOP ENTRY POINT    @H2A         
*                                  ADDRESS                                      
SVTRSTC  DC    V(IEAVRSTC)         GENERALIZED RESET ENTRY POINT   @H2A         
*                                  ADDRESS                                      
SVTCBLS  DC    V(IEAVCBLS)         ADDRESS OF CONTROL BLOCK LENGTH @H2A         
*                                  TABLE.                                       
*                                  OWNERSHIP - SUPERVISOR CONTROL               
*                                  SERIALIZATION - N/A                          
SVT_zCBP_Normalization DC 0X'00000100' Normalization factor for zCBP            
*                                  time values.  Multiply zCBP time by          
*                                  this value and divide by 256 to get          
*                                  the equivalent time on a CP     @NBA         
SVT_IFA_Normalization DC X'00000100'  Normalization factor for IFA.             
*                                  Multiply IFA time by this value              
*                                  and divide by 256 to get the                 
*                                  equivalent time on a CP         @H3A         
SVT_zIIP_Normalization DC 0X'00000100' Normalization factor for zIIPs.          
*                                  Multiply zIIP time by this value             
*                                  and divide by 256 to get the                 
*                                  equivalent time on a CP         @NBA         
SVT_SUP_Normalization DC X'00000100'  Same as SVT_zIIP_Normalization            
*                                                                  @NBC         
SVT_Normalization_Shift EQU 8      Amount to shift by to accomplish    X        
                                   the divide.                     @Q3C         
SVT_Normalization_Divide EQU 256   Amount to divide by             @Q3A         
SVT_IFA_Normalization_Shift EQU 8  Amount to shift by to accomplish             
*                                  the divide. Not an interface    @H4C         
SVT_zAAP_Normalization_Divide EQU 256 Amount to divide by.                      
*                                  Not an interface                @M8A         
SVT_SUP_Normalization_Shift EQU 8 Amount to shift by to accomplish              
*                                  the divide. Not an interface    @H4C         
         DC    12XL1'0'            Reserved: was SVTSPCP           @H4C         
SVTLSLO  DC    V(IEAVLSLO)         ADDRESS OF THE LINKAGE STACK    @L3A         
*                                  MANAGER LOCAL OBTAIN ROUTINE.                
SVTLSLR  DC    V(IEAVLSLR)         ADDRESS OF THE LINKAGE STACK    @L3A         
*                                  MANAGER LOCAL RETURN ROUTINE.                
SVTLSGO  DC    V(IEAVLSGO)         ADDRESS OF THE LINKAGE STACK    @L3A         
*                                  MANAGER GLOBAL OBTAIN ROUTINE.               
SVTLSGR  DC    V(IEAVLSGR)         ADDRESS OF THE LINKAGE STACK    @L3A         
*                                  MANAGER GLOBAL RETURN ROUTINE.               
SVTMPWQA DC    V(IEAVMPWQ)         Address of IEAVMPWQ             @H3C         
SVTLSIO  DC    V(IEAVLSIO)         ADDRESS OF THE LINKAGE STACK    @L3A         
*                                  MANAGER INTERRUPT HANDLER LS OBTAIN          
*                                  ROUTINE.                                     
SVTLSIR  DC    V(IEAVLSIR)         ADDRESS OF THE LINKAGE STACK    @L3A         
*                                  MANAGER INTERRUPT HANDLER LS RETURN          
*                                  ROUTINE.                                     
SVTLEIGA DC    XL4'FFBAD000'       Initial Guardpage Address     000607         
SVTGLAL  DS    0D                  GLOBAL ACCESS LIST POOL HEADER  @L3A         
*                                   - SERIALIZATION CDS.                        
SVTGLALP DC    A(0)                ADDRESS OF FIRST AVAILABLE      @L3A         
*                                  GLOBAL POOL ACCESS LIST.                     
SVTGALPS DC    F'0'                SYNC COUNT FIELD FOR COMPARE    @L3A         
*                                  DOUBLE AND SWAP OF SVTGLALP.                 
SVTGLPMX DC    X'00000C00'         MAXIMUM NUMBER OF BYTES BY      @L3A         
*                                  WHICH GLOBAL ACCESS LIST POOL MAY            
*                                  BE EXPANDED.                                 
SVTXAPM1 DC    V(IEAVXAPM)         ADDRESS OF ACCESS LIST POOL     @L3A         
*                                  MANAGER EXPAND (IEAVXAPM) SERVICE.           
SVTXAPM2 DC    V(IEAVXAP2)         ADDRESS OF ACCESS LIST POOL     @L3A         
*                                  MANAGER RETURN (IEAVXAP2) SERVICE.           
SVTINIT  DC    V(IEAVINIT)         ADDRESS OF IEAVINIT.            @L3A         
SVTXAACR DC    V(IEAVXAAC)         ADDRESS OF ALET TO ASCB         @L3A         
*                                  CONVERSION ROUTINE (IEAVXAAC).               
SVTOENTY DC    A(0)                ORIGIN OF THE ASVT ENTRY TABLE  @L3A         
*                                  OF ASCB'S.                                   
SVTSTKN  DC    A(0)                ADDRESS OF THE STKN TABLE.      @L3A         
SVTSTKNE DC    A(0)                LAST ENTRY OF STKN TABLE.       @L3A         
SVTMEOUT DC    F'0'                SYSTEM SPIN LOOP TIMEOUT VALUE  @D4C         
*                                  IN SECONDS, INITIALIZED BY                   
*                                  IEEVESAI                                     
SVTNALD  DC    A(0)                NULL ACCESS LIST REAL ADDRESS   @L3A         
*                                  AND LENGTH. BITS 0-25 WITH SIX               
*                                  ZEROS APPENDED ON THE RIGHT FORM             
*                                  THE ADDRESS. BITS 26-31 REPRESENT            
*                                  THE NUMBER OF 128 BYTE ACCESS LISTS,         
*                                  MINUS ONE.                                   
SVTNALV  DC    A(0)                NULL ACCESS LIST VIRTUAL        @L3A         
*                                  ADDRESS.                                     
SVTDS0E1 DC    A(0)                ADDRESS OF DISPATCHER           @L3A         
*                                  DIAGNOSTIC EXIT-1 (GIVEN CONTROL             
*                                  FOR UNLOCKED TASK DISPATCHES).               
SVTDS0E2 DC    A(0)                ADDRESS OF DISPATCHER           @L3A         
*                                  DIAGNOSTIC EXIT-2 (GIVEN CONTROL             
*                                  FOR LOCKED TASK DISPATCHES).                 
SVTDS0E3 DC    A(0)                ADDRESS OF DISPATCHER           @L3A         
*                                  DIAGNOSTIC EXIT-3 (GIVEN CONTROL             
*                                  FOR SRB DISPATCHES).                         
SVTDS0E4 DC    A(0)                ADDRESS OF DISPATCHER           @L3A         
*                                  DIAGNOSTIC EXIT-4 (GIVEN CONTROL             
*                                  FOR SSRB DISPATCHES).                        
SVTDS0E5 DC    A(0)                ADDRESS OF DISPATCHER           @L3A         
*                                  DIAGNOSTIC EXIT-5 (GIVEN CONTROL             
*                                  FOR WAIT TASK DISPATCHES).                   
SVTASECT DC    A(0)                ADDRESS OF THE ASE CONTROL      @L3A         
*                                  TABLE.                                       
SVTEXP3  DC    V(IEAVEXP3)         ADDRESS OF IEAVEXP3 SUBROUTINE  @L3A         
*                                  IN EXIT PROLOGUE (LSED COMPARISON            
*                                  ROUTINE).                                    
         AIF   ('&CSECT' EQ 'YES').E1                              @L4A         
SVTEMRQ  DC    V(IEAVEMRQ)         ADDRESS OF MEMORY REQUEST       @L4A         
         AGO   .E1A                                                @L4A         
.E1      ANOP                                                      @L4A         
         EXTRN IEAVEMRQ                                            @L4A         
SVTEMRQ  DC    A(X'80000000'+IEAVEMRQ)  ADDRESS OF MEMORY REQUEST  @L4A         
.E1A     ANOP                                                      @L4A         
         AIF   ('&CSECT' EQ 'YES').E2                              @L4A         
SVTLSCO  DC    V(IEAVLSCO)         ADDRESS OF LS CONSTANTS TABLE   @L4A         
         AGO   .E2A                                                @L4A         
.E2      ANOP                                                      @L4A         
         WXTRN IEAVLSCO                                            @L4A         
SVTLSCO  DC    A(IEAVLSCO)         ADDRESS OF LS CONSTANTS TABLE   @L4A         
.E2A     ANOP                                                      @L4A         
SVTLSLC  DC    V(IEAVLSLC)         ADDRESS OF THE LINKAGE STACK    @L4A         
*                                  LOCATE SERVICE ROUTINE.                      
SVTNLSSD DC    V(IEAVNLSD)         ADDRESS OF NULL LS LSSD         @D3A         
SVTNLSDP DC    V(IEAVNLSP)         ADDRESS OF NULL LS LSED         @D3A         
SVTQV4   DC    V(IEAVEQV4)         ADDRESS OF SINGLE SPACE DOUBLE  @L6A         
*                                  LINKED QUEUE VERIFICATION ROUTINE.           
SVTQV5   DC    V(IEAVEQV5)         ADDRESS OF MULTIPLE SPACE       @L6A         
*                                  DOUBLE LINKED QUEUE VERIFICATION             
*                                  ROUTINE.                                     
SVTCASTE DC    A(0)                VIRTUAL ADDRESS OF THE BLOCK OF @04C         
*                                  CADS ASTES. INITIALIZED BY IEAVNP09.         
SVTGSCH9 DC    V(IEAVESC9)         ADDRESS OF GLOBAL SCHEDULE WITH @L8A         
*                                  STOKEN ENTRY POINT FOR ENABLED               
*                                  CALLERS.                                     
SVTGSCHA DC    V(IEAVESCA)         ADDRESS OF GLOBAL SCHEDULE WITH @L8A         
*                                  STOKEN ENTRY POINT FOR DISABLED              
*                                  CALLERS.                                     
SVTLSCHB DC    V(IEAVESCB)         ADDRESS OF LOCAL SCHEDULE WITH  @L8A         
*                                  STOKEN ENTRY POINT FOR ENABLED               
*                                  CALLERS.                                     
SVTLSCHC DC    V(IEAVESCC)         ADDRESS OF LOCAL SCHEDULE WITH  @L8A         
*                                  STOKEN ENTRY POINT FOR DISABLED              
*                                  CALLERS.                                     
SVTQV6   DC    V(IEAVEQV6)         ADDRESS OF THE SINGLE SPACE     @L8A         
*                                  SINGLE LINKED QUEUE VERIFICATION             
*                                  ROUTINE.                                     
SVTESCD  DC    V(IEAVESCD)         ADDRESS OF IEAVESCD, THE NEW    @06A         
*                                  SCHEDULE ENTRY POINT FOR FEATURE             
*                                  (ENABLED GLOBAL).                            
SVTESCE  DC    V(IEAVESCE)         ADDRESS OF IEAVESCE, THE NEW    @06A         
*                                  SCHEDULE ENTRY POINT FOR FEATURE             
*                                  (DISABLED GLOBAL).                           
SVTESCF  DC    V(IEAVESCF)         ADDRESS OF IEAVESCF, THE NEW    @06A         
*                                  SCHEDULE ENTRY POINT FOR FEATURE             
*                                  (ENABLED LOCAL).                             
SVTESCG  DC    V(IEAVESCG)         ADDRESS OF IEAVESCG, THE NEW    @06A         
*                                  SCHEDULE ENTRY POINT FOR FEATURE             
*                                  (DISABLED LOCAL).                            
SVTCPUF DC     V(IEAVCPUF) -       ADDRESS OF IEAMCPUF SERVICE     @05A         
*                                  ROUTINE (IEAVCPUF).                          
*                                  OWNERSHIP: SUPERVISOR CONTROL.               
*                                  SERIALIZATION: NONE.                         
SVTERMF DC     V(IEAVERMF) -       ADDRESS OF IEAMRMF3 SERVICE     @06A         
*                                  ROUTINE (IEAVERMF).                          
*                                  OWNERSHIP: SUPERVISOR CONTROL.               
*                                  SERIALIZATION: NONE.                         
SVTEFCN DC     V(IEAVEFCN) -       ADDRESS OF IEAMFCNT SERVICE     @06A         
*                                  ROUTINE (IEAVEFCN).                          
*                                  OWNERSHIP: SUPERVISOR CONTROL.               
*                                  SERIALIZATION: NONE.                         
*                                                                               
         AIF   ('&CSECT' EQ 'YES').P2                              @LBA         
SVTTWRM DC     V(IEAVTWRM) -       ADDRESS OF THE TAWQ WEB         @LBA         
*                                  ADDRESS SPACE RESOURCE                       
*                                  MANAGER ROUTINE (IEAVTWRM).                  
*                                  OWNERSHIP: SUPERVISOR CONTROL.               
*                                  SERIALIZATION: NONE.                         
         AGO   .P3                                                 @LBA         
.P2      ANOP                                                      @LBA         
         EXTRN IEAVTWRM                                            @LBA         
SVTTWRM  DC    A(X'80000000'+IEAVTWRM) ADDRESS OF THE TAWQ WEB     @LBA         
*                                  ADDRESS SPACE RESOURCE                       
*                                  MANAGER ROUTINE (IEAVTWRM).                  
*                                  OWNERSHIP: SUPERVISOR CONTROL.               
*                                  SERIALIZATION: NONE.                         
.P3      ANOP                                                      @LBA         
SVTCPTM  DC    A(1500*4096)        Count down timer start value    @07A         
*                                  4096 for bit 51, 4K mics = 4 ms @07A         
SVTTODDL DC    A(3000*4096)        TOD time to check for SIGP      @07A         
SVTZ1    DS    0F                                                  @MWA         
SVTMcesaVT DC  A(0)                 Address of MCESA VT,                        
*                                   each entry of which is the virtual          
*                                   address of the online processor's           
*                                   MCESA (0 if not online)        @LFA         
         DS    0D                  Align to double word boundary   @LJC         
*                                                                13@LOD         
SVT_entitle_overrun_limit    DC D'0'                               @MDA         
SVT_entitle_overrun EQU X'80'                                      @MDA         
*                                                                17@LOD         
SVT_accum_entitle_CR_earned  DC XL16'0' An array, each entry is 8      X        
                                   bytes, for a total of 2 entries @MDC         
SVTR298  DC    XL48'0'             Reserved, do not use            @MDA         
SVT_entitle_overrun_limit_count DC D'0'                            @MDA         
         DC    XL24'0'                                             @10C         
SVT_Diag2E8 DS 0XL24               Diagnostic data for IBM use only    X        
                                                                   @10A         
         DC    XL4'00000000'                                       @10A         
         DC    XL4'00000000'                                       @10A         
         DC    XL4'00064000'                                       @10A         
         DC    XL4'0004B000'                                       @10A         
         DC    XL4'00000000'                                       @10A         
         DC    XL4'00000000'                                       @10A         
SVTR300  DC    XL72'0'                                             @11C         
         AIF   ('&SVT_CPUDUALPATH' NE 'YES').G1                    @M3A         
*  These will be removed in a future release, when the old fields               
*  will no longer be supported.  Use the new pointers exclusively               
*  to access fields for code being run on HBB7760 and higher       @M3A         
         ORG  SVTR300                                              @11C         
SVT_CPUS_CAUSING_SPIN_OLD DC XL64'00' CPUS CAUSING EXCESSIVE SPIN               
*                                  OWNERSHIP - RECONFIGURATION                  
*                                  SERIALIZATION - DISABLEMENT     @M3C         
SVT_WAITING_PROCESSOR_MASK DC D'0' WAITING PROCESSOR BIT MASK, BIT              
*                                  POSITION CORRESPONDS TO CPU ID.              
*                                  A bit being on means the CPU is              
*                                  waiting and has not been signalled.          
*                                  All 64 bits are used.           @LOC         
*                                  OWNERSHIP - SUPERVISOR CONTROL               
*                                  SERIALIZATION - COMPARE AND SWAP             
         ORG   SVT_WAITING_PROCESSOR_MASK                          @LOA         
SVT_WAITING_PROCESSOR_MASK0TO31 DS F                               @P8A         
SVT_WAITING_PROCESSOR_MASK32TO63 DS F                              @P8A         
*                                                                               
*  End of fields that will be removed in a future release          @M3A         
*                                                                               
.G1      ANOP                                                                   
         AIF   ('&CSECT' EQ 'NO').SVT902A                          @LKA         
         WXTRN IEAVC9S1                                            @LKA         
SVTC9ST1 DC    A(IEAVC9S1)         ADDRESS OF CMSET SET            @LKA         
         AGO   .SVT902B                                            @LKA         
.SVT902A ANOP                                                      @LKA         
SVTC9ST1 DS    A                   ADDRESS OF CMSET SET            @LKA         
.SVT902B ANOP                                                      @LKA         
*                                  ROUTINE.                        @LKA         
         AIF   ('&CSECT' EQ 'NO').SVT909A                          @LKA         
         WXTRN IEAVC9S2                                            @LKA         
SVTC9ST2 DC    A(IEAVC9S2)         Address of CMSET SET,DIE=YES    @LKA         
         AGO   .SVT909B                                            @LKA         
.SVT909A ANOP                                                      @LKA         
SVTC9ST2 DS    A                   Address of CMSET SET,DIE=YES    @LKA         
.SVT909B ANOP                                                      @LKA         
         AIF   ('&CSECT' EQ 'NO').SVT903A                          @LKA         
         WXTRN IEAVC9R1                                            @LKA         
SVTC9RT1 DC    A(IEAVC9R1)         ADDRESS OF CMSET RESET,         @LKA         
         AGO   .SVT903B                                            @LKA         
.SVT903A ANOP                                                      @LKA         
SVTC9RT1 DS    A                   ADDRESS OF CMSET RESET,         @LKA         
.SVT903B ANOP                                                      @LKA         
*                                  CHKAUTH=YES ROUTINE.            @LKA         
         AIF   ('&CSECT' EQ 'NO').SVT904A                          @LKA         
         WXTRN IEAVC9R2                                            @LKA         
SVTC9RT2 DC    A(IEAVC9R2)         ADDRESS OF CMSET RESET,         @LKA         
         AGO   .SVT904B                                            @LKA         
.SVT904A ANOP                                                      @LKA         
SVTC9RT2 DS    A                   ADDRESS OF CMSET RESET,         @LKA         
.SVT904B ANOP                                                      @LKA         
         AIF   ('&CSECT' EQ 'NO').SVT910A                          @LKA         
         WXTRN IEAVC9R3                                            @LKA         
SVTC9RT3 DC    A(IEAVC9R3)         Address of CMSET RESET,         @LKA         
         AGO   .SVT910B                                            @LKA         
.SVT910A ANOP                                                      @LKA         
SVTC9RT3 DS    A                   Address of CMSET RESET,         @LKA         
.SVT910B ANOP                                                      @LKA         
*                                  CHKAUTH=YES,DIE=YES routine.    @LKA         
         AIF   ('&CSECT' EQ 'NO').SVT911A                          @LKA         
         WXTRN IEAVC9R4                                            @LKA         
SVTC9RT4 DC    A(IEAVC9R4)         Address of CMSET RESET,         @LKA         
         AGO   .SVT911B                                            @LKA         
.SVT911A ANOP                                                      @LKA         
SVTC9RT4 DS    A                   Address of CMSET RESET,         @LKA         
.SVT911B ANOP                                                      @LKA         
*                                  CHKAUTH=NO ROUTINE.             @LKA         
         AIF   ('&CSECT' EQ 'NO').SVT905A                          @LKA         
         WXTRN IEAVC9ST                                            @LKA         
SVTC9STR DC    A(IEAVC9ST)         ADDRESS OF CMSET SSARTO         @LKA         
         AGO   .SVT905B                                            @LKA         
.SVT905A ANOP                                                      @LKA         
SVTC9STR DS    A                   ADDRESS OF CMSET SSARTO         @LKA         
.SVT905B ANOP                                                      @LKA         
*                                  ROUTINE.                        @LKA         
         AIF   ('&CSECT' EQ 'NO').SVT906A                          @LKA         
         WXTRN IEAVC9SB                                            @LKA         
SVTC9SBR DC    A(IEAVC9SB)         ADDRESS OF CMSET SSARBACK       @LKA         
         AGO   .SVT906B                                            @LKA         
.SVT906A ANOP                                                      @LKA         
SVTC9SBR DS    A                   ADDRESS OF CMSET SSARBACK       @LKA         
.SVT906B ANOP                                                      @LKA         
*                                  CHKAUTH=NO,DIE=YES routine.     @LKA         
SVTASWUQ DC    A(0)                Special processor SWUQ header   @H3A         
SVTSWUQA DC    A(0)                SVTSWUQ or SVTASWUQ                          
*                                  The latter only if there are                 
*                                  special processors configured.  @H3A         
SVTIFAFlags DC X'82'               Processor Flags - not just IFAs.    X        
                                   This byte is a programming interfaceX        
                                   for bit SVT_CpuProjection only               
SVT_Disp_IFACrossoverOK EQU X'80'                                  @H3A         
SVT_IFASwitchImmediate EQU X'40'                                   @H3A         
SVT_IFAInConfiguration EQU X'20'                                   @H3A         
SVT_ByLPAR_zCBPInConfiguration EQU X'20' zCBPs are installed or        X        
                                   could be installed by dynamic CPU   X        
                                   addition. Could be                  X        
                                   online or offline.              @NBA         
SVT_ByLPAR_IFAInConfiguration EQU X'20'                            @H5A         
SVT_ByLPAR_zAAPInConfiguration EQU X'20' zAAPs are installed or        X        
                                   could be installed by dynamic CPU   X        
                                   addition. Could be                  X        
                                   online or offline.              @H5A         
SVT_Disp_zCBPCrossoverHP EQU X'10'                                 @NBA         
SVT_Disp_IFACrossoverHP EQU X'10'                                  @0GA         
SVT_CPUProjection  EQU X'08'       Project the CPU usage for both               
*                                  IFAs and SUPs                   @H4A         
SVT_SUPInConfiguration EQU X'04'   zIIPs are installed or              X        
                                   could be installed by dynamic CPU   X        
                                   addition. The zIIPs could be        X        
                                   online or offline.              @H4A         
SVT_ByLPAR_SUPInConfiguration EQU X'04' zIIPs are installed or         X        
                                   could be installed by dynamic CPU   X        
                                   addition. The zIIPs could be        X        
                                   online or offline.              @H5A         
SVT_ByLPAR_zIIPInConfiguration EQU X'04' zIIPs are installed or        X        
                                   could be installed by dynamic CPU   X        
                                   addition. The zIIPs could be        X        
                                   online or offline.              @H5A         
SVT_Disp_zIIPHonorPriority EQU X'02' Honor Priority is enabled for              
*                                  zIIPs                           @NBA         
SVT_Disp_SUPHonorPriority EQU X'02' same as SVT_Disp_zIIPHonorPriority          
*                                                                  @NBC         
SVTIfaFlags_Rsvd EQU X'01'         Reserved, do not use            @H5A         
SVTDiag371 DC  XL1'00'             Diagnostic for IBM use only     @NBC         
SVTHDFlags1 DS 0XL1                Flags for HD related information    X        
                                   SERIALIZATION - CS.             @MKC         
SVTVCMFlags DC XL1'00'             Flags for HD related                X        
                                   information                         X        
                                   SERIALIZATION - CS.             @MKC         
SVTVCMBeenActivated EQU X'80'      On when HD transition has                    
*                                  occurred                        @PTA         
SvtVcmAcrUnpark     EQU X'40'      On when IEAVTACR is unparking       X        
                                   processors as a result of ACR       X        
                                   running.                        @PVA         
SvtVcmEgrForceNonAff EQU X'20'     When on IEAVEGR must rebuild for    X        
                                   non-affinity mode. IEAVEGR assumes  X        
                                   this is set only by IEAVMPWQ    @PWA         
SvtVcmInDegradedState EQU X'10'    When on, HD is running in a         X        
                                   degraded state because WLM passed a X        
                                   MPWQ parameter list with only       X        
                                   discretionary CPs.  This is a       X        
                                   transient condition until the next  X        
                                   topology change occurs.         @0IA         
SVTHDInTransition EQU X'08'        When on, the system is switching    X        
                                   from HiperDispatch=YES!NO to        X        
                                   HiperDispatch=NO!YES.           @PXA         
SVT_HDNoCPUOverride EQU X'04'                                      @MCA         
SVTHDFlags_Rsvd     EQU X'02'      Reserved - do not use           @MKC         
SVT_WarningTrackReg EQU X'01'      System has successfully             X        
                                   registered for warning track        X        
                                   interrupts                      @MOA         
SVT_zIIPzAAP_Flags DC XL1'00'      More zIIP/zAAP Flags            @M4A         
*                                  Serialization: CS               @M4A         
*                                  Owner: Supervisor               @M4A         
SVT_ByLPAR_zIIP_NowInstalled EQU   X'80'  There currently is                    
*                      at least one zIIP installed. It need not be              
*                      online. This bit may change from "off" to                
*                      "on" during the life of the IPL             @M4A         
SVT_ByLPAR_zCBP_NowInstalled EQU   X'40'  There currently is                    
*                      at least one zCBP installed. It need not be              
*                      online. This bit may change from "off" to                
*                      "on" during the life of the IPL             @NBA         
SVT_ByLPAR_zAAP_NowInstalled EQU   X'40'  There currently is                    
*                      at least one zAAP installed. It need not be              
*                      online. This bit may change from "off" to                
*                      "on" during the life of the IPL             @M4A         
SVT_zAAP_On_zIIP EQU X'20'         When 1, zAAPzIIP=YES was specified           
*                      or defaulted via IEASYSxx and is still in                
*                      effect                                      @M6A         
SVT_ProcType2or5NowInstalled EQU X'10'  Encountered a processor type of         
*                      2 (zAAP) or 5 (zIIP) within the recognized               
*                      processor info                              @MFA         
SVT_ZZ_Off_zAAP_On_Machine   EQU X'08' Same as next equate                      
SVT_ZZ_Off_Too_Many_Machine_ZZs EQU X'08' When 1, zAAP on zIIP was              
*                      deactivated since there are more zAAPs+zIIPs             
*                      than CPs on the machine                     @MQA         
SVT_ZZ_Off_Info_Unavail EQU X'04' When 1, zAAP on zIIP was                      
*                      deactivated since this LPAR is not allowed               
*                      to get machine-wide information             @MHA         
SVT_ZZ_Off_No_zIIPs EQU X'02'      When 1, zAAP on zIIP was                     
*                      deactivated since there are no zIIPs and                 
*                      dynamic CPU addition is not enabled so that              
*                      no zIIPs can be added after IPL             @MHA         
SVT_DeferSwitchFrom_Pct_Lim DC H'75' No deferral if use of zAAP exceeds*        
                                   this percent                    @OOC         
         DS    0CL6                Fields for 'too many SRBs'      @M7A         
SvtPromoteTrigger DC H'3'          When this many WEBs with the same   -        
                                   3-byte priority and same            -        
                                   WebPriorityID have been skipped,    -        
                                   consider promoting this WEB.    @M7A         
SvtTurnOnPromotionTrigger DC H'200' When this many WEBs with the same  -        
                                   3-byte priority and same            -        
                                   WebPriorityID have been skipped,    -        
                                   turn on promotion.              @M7A         
SvtInitialPromotionCount DC H'200' The number of WEBs to promote when  -        
                                   turning on promotion.           @M9C         
SVT_IEAVIFAP DC  V(IEAVSVTI)                                       @LMA         
SVT_PRIORITY_RANGES_AREA DC XL3'00'                                @0VA         
             ORG SVT_PRIORITY_RANGES_AREA                                       
SVT_PRIORITY_RANGES DC 3X'00'      Priority range end for high,                 
*                                  medium, and low priorities                   
*                                  Owner: SRM                      @0VC         
SVT_kHiPriorityBucketIndex EQU 1   Index to the high priority bucket            
*                                  defined by dispatch priorities               
*                                  between x'FF' and                            
*                                  SVT_PRIORITY_RANGES(1) inclusive             
*                                                                  @0VA         
SVT_kMedPriorityBucketIndex EQU 2 Index to the medium priority bucket           
*                                  defined by dispatch priorities               
*                                  between SVT_PRIORITY_RANGES(1)-1 and         
*                                  SVT_PRIORITY_RANGES(2) inclusive             
*                                                                  @0VA         
SVT_kLowPriorityBucketIndex EQU 3 Index to the low priority bucket              
*                                  defined by dispatch priorities               
*                                  between SVT_PRIORITY_RANGES(2)-1 and         
*                                  SVT_PRIORITY_RANGES(3) inclusive             
*                                                                  @0VA         
SVT_kDiscPriorityBucketIndex EQU 4 Index to the discretionary priority          
*                                  bucket defined by dispatch                   
*                                  priorities between                           
*                                  SVT_PRIORITY_RANGES(3)-1 and x'C0'           
*                                  inclusive                       @0VA         
SVT_kPriorityBucketFirstIndex EQU 1                                @0VA         
SVT_kPriorityBucketLastIndex EQU 4                                 @0VA         
SVT_TRICKLE_PRIORITY DC X'00'      Trickle Promotion priority      @LRC         
*                                  Owner: SRM                                   
SVT_PRIORITY_INDEXES DC 4X'00'     Round robin priority based                   
*                                  indexes for supervisor work                  
*                                  assignment                      @LNA         
SVT_Generic_Help_Token DC F'0'     Token used to indicate that                  
*                                  an affinity node needs generic               
*                                  help                            @LNA         
SVT_Generic_Help_Limit DC H'1'     Help count where generic                     
*                                  help should be requested        @P9C         
SvtLogicalCpuGoingOffline DC H'0'  The logical CPU id which is         X        
                                   going offline while the CPU it      X        
                                   represents is on in CSD_CPU_Alive.  X        
                                   Once this logical CPU is removed    X        
                                   from CSD_CPU_Alive, this value      X        
                                   will contain the last logical CPU   X        
                                   id which has gone offline.          X        
                                   Serialization: SYSZVARY.CPU ENQ and X        
                                   dispatcher lock.                @0IA         
SVTHELP_SUP   DC F'0'              SUP Help count - updated in                  
*                                  IEAVEJST                        @H4A         
SVTHELP_SUPQ DC F'0'               SUP Need help -   queue length  @H4A         
SVT_zIIPAWMT_Count_Timer DC 0A(1500*4096)                                       
*                                  AWMT Count Down Timer for zIIP               
*                                  Analog of SVTCPTM                            
*                                  OWNERSHIP: SRM                  @NBA         
SVT_SupAWMT_Count_Timer DC A(1500*4096)                                         
*                                  AWMT Count Down Timer for SUP                
*                                  Analog of SVTCPTM                            
*                                  OWNERSHIP: SRM                  @H4A         
SVT_zIIPAWMT_Elapsed_Timer DC 0A(3000*4096)                                     
*                                  AWMT Elapsed Timer for zIIP     @NBA         
*                                  Analog of SVTTODDL                           
*                                  OWNERSHIP: SRM                  @NBA         
SVT_SupAWMT_Elapsed_Timer DC A(3000*4096)                                       
*                                  AWMT Elapsed Timer for SUP      @LPC         
*                                  Analog of SVTTODDL                           
*                                  OWNERSHIP: SRM                  @H4A         
SVTSWUQS DC    A(0)                SVTSWUQ or SVTSSWUQ                          
*                                  The latter only if there are                 
*                                  SUP processors configured.      @H4A         
SVTSSWUQ  DC    A(0)               SUP System WUQ (SWUQ) header    @H4C         
*                                   address.                                    
*                                   INITIALIZED: IEAVINIT                       
*                                   SERIALIZATION: WEB Lock Protocol            
*                                   OWNERSHIP: Supervisor Control               
SVT_zCBPAWMT_Count_Timer DC 0A(1500*4096)                                       
*                                  AWMT Count Down Timer for zCBP               
*                                  Analog of SVTCPTM                            
*                                  OWNERSHIP: SRM                  @NBA         
SVT_IFAAWMT_Count_Timer DC A(1500*4096)                                         
*                                  AWMT Count Down Timer for IFA                
*                                  Analog of SVTCPTM                            
*                                  OWNERSHIP: SRM                  @H4A         
SVT_zCBPAWMT_Elapsed_Timer DC 0A(3000*4096)                                     
*                                  AWMT Count Down Timer for zCBP               
*                                  Analog of SVTTODDL                           
*                                  OWNERSHIP: SRM                  @NBA         
SVT_IFAAWMT_Elapsed_Timer DC A(3000*4096)                                       
*                                  AWMT Count Down Timer for IFA                
*                                  Analog of SVTTODDL                           
*                                  OWNERSHIP: SRM                  @H4A         
SVTR3B0  DC    XL6'00'                                             @M3C         
         AIF   ('&SVT_CPUDUALPATH' NE 'YES').H1                    @M3A         
*  These will be removed in a future release, when the old fields               
*  will no longer be supported.  Use the new pointers exclusively               
*  to access fields for code being run on HBB7760 and higher       @M3A         
         ORG  SVTR3B0                                              @M3A         
SVT_short_wait_CPUPA_Old DC H'0'   Physical address of last CP to  @0HA         
*                                  enter wait with a short slice                
*        The following two fields are referenced without using their            
*        names.                                                                 
SVT_short_wait_IFAPA DC H'0'       Physical address of last IFA to @0HA         
*                                  enter wait with a short slice                
SVT_short_wait_SUPPA DC H'0'       Physical address of last SUP to @0HA         
*                                  enter wait with a short slice                
*                                                                               
*  End of fields that will be removed in a future release          @M3A         
*                                                                               
.H1      ANOP                                                      @M3A         
SVTMFLGS   DC   X'00'              Miscellaneous flags                          
*                                  Serialization: CS               @MCC         
SVTD308    EQU   X'80'             DIAGNOSE 308 supported          @M1A         
*                                  SERIALIZATION: set during NIP   @M1A         
SVT_CPUG64_NowInstalled EQU X'40'   CPU id greater than 64 is                   
*                                   installed now                  @MCA         
SVTMFLGS_Diag EQU X'20'            Diagnostic for IBM use only     @MMA         
SVT_CML_promotion_prty DC X'FF'    Priority giving to the WEB with a            
*                                  lower priority when CML promotion            
*                                  occurs.  Note there is code that             
*                                  depends on this priority to be FFx           
*                                  (like IEAVEEXT)                 @LVC         
SVT_BASE_PERCENT_CALC_TIME DC XL8'00'                                           
*                                  Base time used to calculate the              
*                                  percentage values                            
*                                  OWNERSHIP: SRM                  @LQA         
SVT_Trickle_Time DC XL4'00'        Low 32 bits of 64-bit STCK-format   *        
                                   time to be given to a trickled work *        
                                   unit                            @LUA         
SVT_Tiny_ND_CPUs_Short_Minor DC H'150' The length of a short minor     X        
                                   timeslice in mics for a processor   X        
                                   class with a tiny number of         X        
                                   non-discretionary CPUs              X        
                                   OWNERSHIP: SRM                      X        
                                   Serialization: None             @0MA         
SVT_Not_Tiny_ND_CPUs_Short_Minor DC H'50' The length of a short minor  X        
                                   timeslice in mics for a processor   X        
                                   class without a tiny number of      X        
                                   non-discretionary CPUs              X        
                                   OWNERSHIP: SRM                      X        
                                   Serialization: None             @0MA         
Svt_Accum_Entitle_Earned_Redeposited DC D'0'                       @0JA         
SVT_accum_entitle_values DS 0XL16                                  @0JA         
SVT_accum_entitle_earned DC D'0'                                   @0JA         
SVT_accum_entitle_consumed DC D'0'                                 @0JA         
SVT_accum_entitle_base_values DS 0XL16                             @0JA         
* The following two fields must be contiguous on a quadword boundary            
SVT_accum_entitle_earned_base DC D'0'                              @0JA         
SVT_accum_entitle_consumed_base DC D'0'                            @0JA         
SVT_entitlement_percent DC  F'0'                                   @0JA         
SVT_entitlement_percent_Byte3 EQU SVT_Entitlement_Percent+3        @0JA         
SVT_entitlement_withdrawal DC A(400*4096)                          @0JA         
SVT_entitlement_suff_join_help DC A(800*4096) withdrawal amount    @0JA         
*                           for a zIIP to start helping            @0JA         
SVT_entitlement_suff_wakeup DC A(2000*4096) withdrawal amount to   @0JA         
*                           wake up a zIIP to start helping        @0JA         
SVT_ROBLOCK_400 DS 0XL256          Primarily readonly block        @M5A         
SVTCR_Word DS 0XL4                 Serialization: Compare and Swap @MDA         
SVTCR      DC  XL1'0'                                              @MDA         
SVTR401  DC    XL2'0'                                              @MDA         
SVTCR_Misc DC  XL1'0'                                              @MDA         
SVTHDCPR EQU   X'80'                                               @MDA         
SVTLGACT EQU   X'40'                                               @MDA         
SVTSWCPR EQU  X'08'                                                @0YA         
SVTHWCPR EQU  X'04'                                                @0YA         
SVTKeepLgAct EQU X'02'                                             @0ZC         
SVTZBA   EQU  X'01'                                                @0ZA         
SVT_Reluctant_Help_Start DC XL2'03' The initial countdown value for             
*                                  when a CPU is reluctantly helping            
*                                  another CPU                     @MDA         
SVTCR_Flags DC XL1'0'              Serialization: CS               @0SA         
SVTCR_Flags_TempPriWUQHPWUQ EQU X'80'  Indicates the system was forced X        
                                   to use a primary WUQ of the HPWUQ   X        
                                   temporarily                     @0SA         
SVTCR_Flags_Rsvd EQU X'40'         Reserved for IBM use only       @0UA         
SVTHDFlags2 DC XL1'00'             HiperDispatch flags byte 2          X        
                                   Serialization: CS               @MKA         
Svt_SrbEnclaveRQM EQU X'80'        Enclave SRB ready queue management  X        
                                   (RQM) must be done when the system  X        
                                   is in HD=YES.                   @MKA         
Svt_IsOrWasSrbEnclaveRQM EQU X'40' Enclave SRB ready queue management  X        
                                   (RQM) was done at some point during X        
                                   the life of the system.         @MKA         
SvtEgrNoActiveHdWUQs EQU X'20'     When on, global recovery had to     X        
                                   rebuild the WUQs for HD=Y, but      X        
                                   found no active HD=Y WUQs to queue  X        
                                   work                            @0TA         
*                                                                  @N8D         
SvtHdFlags2_Rsvd EQU X'0E'         Reserved for IBM use only       @NAC         
SVT_WUQH_WEE_Header DC A(0)        First WEE in WUQH WEE pool.                  
*                                  Used for verifying the queue in              
*                                  global recovery.                @M2A         
SVTCPUD  DC A(0)                   Pointer to CPU Dependent Area   @M5M         
SVT_WAITING_PROCESSOR_MASK_ADDR DC A(0) Address of Waiting Processor            
*                                  bit mask. Each bit position                  
*                                  corresponds to a CPU address. Points         
*                                  to a bitmask on a double word                
*                                  boundary (for compare and swap) that         
*                                  is ECVTMaxMPNumBytesInMask bytes             
*                                  long where the first (CVTMAXMP+1)            
*                                  bits are valid.                              
*                                  OWNERSHIP - SUPERVISOR CONTROL               
*                                  SERIALIZATION - COMPARE AND                  
*                                  SWAP on the bitmask.            @M3A         
         ORG   SVT_WAITING_PROCESSOR_MASK_ADDR                                  
SVT_CORE_WAIT_CPUMASK_ADDR DC A(0) Address of the waiting core CPU mask         
*                        and is used in all configurations         @0UA         
SVT_CPUS_CAUSING_SPIN_ADDR DC A(0) Address to an array where each               
*                                  entry is the logical ID of the               
*                                  CPU causing causing excessive                
*                                  spin for that CPU entry. The number          
*                                  of entries in the array is                   
*                                  (CVTMAXMP+1), or 1 entry for                 
*                                  each CPU.  Each entry is 2 bytes.            
*                                  OWNERSHIP     - RECONFIGURATION.             
*                                  SERIALIZATION - DISABLEMENT.                 
*                                                                  @MMC         
SVTR418_DNR DC XL4'7FFFFBAD'       Was SVTWAS_Addr which was an        X        
                                   address to an array, each entry     X        
                                   being 1 byte where the value        X        
                                   is either '00'x or 'FF'x. 'FF'x     X        
                                   means there is a pending SIGP       X        
                                   memory switch for that CPU entry.   X        
                                   The number of entries in the array  X        
                                   is (CVTMAXMP+1), or 1 entry for     X        
                                   each CPU.  Designed to cause abend  X        
                                   for anyone referencing this pointer.X        
                                   Do not reuse.                   @MMC         
SVT_short_wait_CPUPA_ADDR DC A(0)  Address to an array where each      X        
                                   entry is the physical ID of the     X        
                                   last standard CP to wait with a     X        
                                   short slice in a 64 bit CPU block.  X        
                                   There are only 2 entries in this    X        
                                   array and each entry is 2 bytes.    X        
                                                                   @MMC         
SVT_zCBPMAXQL DC  0H'7'            The maximum number of WEBs 1 zCBP   X        
                                   can dispatch in a timely fashion.   X        
                                   Serialization: NONE                 X        
                                   Ownership: Supervisor/SRM       @NBA         
SVT_zAAPMAXQL DC   H'7'            The maximum number of WEBs 1 zAAP   X        
                                   can dispatch in a timely fashion.   X        
                                   Serialization: NONE                 X        
                                   Ownership: Supervisor/SRM       @MEA         
SVT_zCBPMINHL DC  0H'7'            When a zCBP chooses another CPU for X        
                                   help, the minimum number of         X        
                                   dispatches which will be done for   X        
                                   help.                               X        
                                   Serialization: NONE                 X        
                                   Ownership: Supervisor/SRM       @NBA         
SVT_zAAPMINHL DC   H'7'            When a zAAP chooses another CPU for X        
                                   help, the minimum number of         X        
                                   dispatches which will be done for   X        
                                   help.                               X        
                                   Serialization: NONE                 X        
                                   Ownership: Supervisor/SRM       @MEA         
SVT_zIIPMAXQL DC   H'7'            The maximum number of WEBs 1 zIIP   X        
                                   can dispatch in a timely fashion.   X        
                                   Serialization: NONE                 X        
                                   Ownership: Supervisor/SRM       @MEA         
SVT_zIIPMINHL DC   H'7'            When a zIIP chooses another CPU for X        
                                   help, the minimum number of         X        
                                   dispatches which will be done for   X        
                                   help.                               X        
                                   Serialization: NONE                 X        
                                   Ownership: Supervisor/SRM       @MEA         
SVT_SuperSlice DS 0XL5             Super slice block               @PZM         
SVT_SuperSlice_Qualifier_Low DC XL2'C0' Low bound priority that        X        
                                   qualifies for a super slice,        X        
                                   inclusive.                          X        
                                   Serialization: NONE                 X        
                                   Ownership: SRM                  @MBA         
SVT_SuperSlice_Qualifier_High  DC XL2'C0' High bound priority that     X        
                                   qualifies for a super slice,        X        
                                   inclusive.                          X        
                                   Serialization: NONE                 X        
                                   Ownership: SRM                  @MBA         
SVT_SuperSlice_ExtraMajors DC X'40'  The number of major time slices   X        
                                   that make up a super slice          X        
                                   Serialization: NONE                 X        
                                   Ownership: SRM                  @MBA         
SVT_SubBucket_Ranges_Area DC XL3'080401'                           @0WA         
             ORG SVT_SubBucket_Ranges_Area                                      
SVT_SubBucket_Ranges DS 3X                    Ranges of CPU consumption         
*                    percentages used to sub-divide HFTS priority               
*                    bucket output into sub buckets. Values represent           
*                    units of 0.5% CPU utilization, and range from 1 to         
*                    199 coresponding to 0.5% to 99.5%. For example 1 =         
*                    0.5%, 2 = 1.0%, 3 = 1.5% ....                              
*                                                                               
*                    SVT_SubBucket_Ranges(1) = 8 representing 4.0%,             
*                    SVT_SubBucket_Ranges(2) = 2 representing 1.0%,             
*                    SVT_SubBucket_Ranges(3) = 1 representing 0.5%.@0WA         
SVTDiag2 DC    XL8'00'             Diagnostic data. This field is for  X        
                                   IBM use only                    @MGA         
         AIF   ('&CSECT' EQ 'NO').Q2                               @MJA         
         EXTRN IEAVESLI                                            @MJA         
SVT_PerfInstSp_Addr DC A(IEAVESLI) Pointer to PerfInst_Sp in macro     X        
                                   IHAPERFI. IEAVESLI is in IEAVESLA.  X        
                                   Serialization: NONE                 X        
                                   Ownership: Supervisor               X        
                                                                   @MJA         
         AGO   .Q3                                                 @MJA         
.Q2      ANOP                                                      @MJA         
SVT_PerfInstSp_Addr DS A           Pointer to PerfInst_Sp in macro     X        
                                   IHAPERFI. IEAVESLI is in IEAVESLA.  X        
                                   Serialization: NONE                 X        
                                   Ownership: Supervisor               X        
                                                                   @MJA         
.Q3      ANOP                                                      @MJA         
SvtLTodSigpGovCp DC XL4'00190000' When the system is                   X        
                            in HD=YES, this value is a low order TOD   X        
                            that indicates how much time must pass     X        
                            between SIGPs for CPs in the same          X        
                            affinity node.                             X        
                            SvtLTodSigpGovCp is a                      X        
                            percentage of SVTCPTM (can be greater than X        
                            100%).                                 @N7A         
         ORG   SvtLTodSigpGovCp                                    @N7A         
SVT_HD_LTOD_Hi_Node_Sigp_Gov DC F'0' When non-zero and the system is   X        
                            in HD=YES, this value is a low order TOD   X        
                            that indicates how much time must pass     X        
                            between SIGPs for CPs in the same          X        
                            affinity node.                             X        
                            SVT_HD_LTOD_Hi_Node_Sigp_Gov is a          X        
                            percentage of SVTCPTM (can be greater than X        
                            100%). For zAAPs/zIIPs, the governor is    X        
                            calculated by applying the percent to      X        
                            SVT_IFAAWMT_COUNT_TIMER /                  X        
                            SVT_SUPAWMT_COUNT_TIMER                @0RC         
SvtSigpGovCoreReactiveShift EQU 2 How much to shift the SIGP           X        
                            governor for cores and reactive SIGPs  @0UC         
SvtSigpGovCoreProactiveShift EQU 3 How much to shift the SIGP          X        
                            governor for cores and proactive SIGPs @0UC         
SvtSigpGovCoreHpwuqShift EQU 4 How much to shift the SIGP              X        
                            governor for cores and HPWUQ SIGPs     @0UC         
SvtSigpGovThreadReactiveShift EQU 1 Additional number of bits to       X        
                            shift the SIGP governor for threads        X        
                            and reactive SIGPs                     @0UA         
SvtSigpGovThreadProactiveShift EQU 1 Additional number of bits to      X        
                            shift the SIGP governor for threads        X        
                            and proactive SIGPs                    @0UA         
SvtSigpGovThreadHpwuqShift EQU 0 Additional number of bits to          X        
                            shift the SIGP governor for threads        X        
                            and HPWUQ SIGPs                        @0UA         
SvtSigpGovHpwuqLTodFloor EQU X'00019000' HPWUQ SIGP governor           X        
                            floor (25 us)                          @0UA         
SVT_WUQA_RQM_MajCanSuppress DC F'35' The number of major task time     X        
                            slices IEAVWUQA will allow a unit of work  X        
                            being affected by RQM to wait for          X        
                            access to CPU.  How long a unit of work    X        
                            may wait for access to CPU is              X        
                            determined by wall clock (not execution)   X        
                            time.                                  @MKA         
SVT_WDI_RQM_LTOD_CanSuppress DC X'3D090000' The low order word of a    X        
                            TOD that indicates how long IEAVEWDI will  X        
                            allow a unit of work being affected by RQM X        
                            to wait for access to CPU.             @MKA         
SVT_MajorTimeSlice DS F'0'  The low 32 bits of a 64-bit STCK format    X        
                            time which represents the length of a      X        
                            major task time slice                  @MKA         
SVTRNALD DC    A(0)         Really Null Access List real address and   *        
                            length. Bits 0-25 with 6 zeroes appended   *        
                            on the right form the address. Bits 26-31  *        
                            represent the number of 128-byte access    *        
                            lists minus one                        @MRA         
SVTRNALV DC    A(0)         Really Null Access List virtual addr   @MRA         
SVT_HdAnSMPerByProcClassArea DC XL3'141414' The percent of             X        
                            non-discretionary CP/zAAP/zIIP per         X        
                            affinity node that must be assigned a      X        
                            short minor                            @MLA         
SVTR457  DC    XL1'00'      Reserved (primarily readonly)          @MMC         
SVT_Diag458 DC XL10'00'     Diagnostic data for IBM use only       @MMA         
SvtCoreFlgs DS XL1'00'                                                          
*  Bit definitions:                                                             
SvtProcAsCore EQU X'80'     A processor resource is viewed as a CPU             
*                           Core. This is equivalent to the                     
*                           CvtProcAsCore bit                      @N5A         
SvtMultiCpusPerCore EQU X'40' When SvtProcAsCore is on, this indicates          
*                        there are multiple CPUs defined within a CPU           
*                        Core (on MT capable hardware). This is                 
*                        equivalent to the CvtMultiCpusPerCore bit              
SvtCoreFlgs_Rsvd EQU X'30'  For IBM use only.                      @0UA         
SVTR463 DS XL1'00'       Reserved (primarily readonly)             @0UA         
SvtCoreIdCpuIdShift DS H When SvtProcAsCore is on, the number of bits           
*                        to shift when converting between a CPU Id and          
*                        a CPU Core Id. When SvtProcAsCore is off,              
*                        this will be set to 0                                  
SvtCoreMode_Max DS H     When SvtProcAsCore is on, the maximum number           
*                        of CPUs that can be used on a CPU Core. When           
*                        SvtProcAsCore is off, this will be set to 1.           
SvtCoreModeByProcClass DS 0H                                       @0UA         
SvtCoreMode_CP DS H      The number of CPUs that are active on a CP             
*                        Core. 1 <= SvtCoreMode_CP <= SvtCoreMode_Max           
SvtCoreMode_zCBP DS 0H   The number of CPUs that are active on a zCBP           
*                        Core. 1 <= SvtCoreMode_zCBP<=SvtCoreMode_Max           
*                                                                  @NBA         
SvtCoreMode_zAAP DS H    The number of CPUs that are active on a zAAP           
*                        Core. 1 <= SvtCoreMode_zAAP<=SvtCoreMode_Max           
SvtCoreMode_zIIP DS H    The number of CPUs that are active on a zIIP           
*                        Core. 1 <= SvtCoreMode_zIIP<=SvtCoreMode_Max           
SVTCoreMode_1 EQU 1      1 thread per core                                      
SVTCoreMode_2 EQU 2      2 threads per core                                     
SVT_Diag46E DC XL2'0002' Diagnostic data for IBM use only          @10C         
SVT_Thread_Wait_CpuMask_Addr DS A The address of the thread wait CPU            
*                        mask. This field is non-zero when PROCVIEW             
*                        CORE was specified on hardware that supports           
*                        MT. Otherwise this field is zero          @0UA         
SVT_CoreVT_Addr DS A     The address of the CORE vector table. This             
*                        field is non-zero when PROCVIEW CORE was               
*                        specified on hardware that supports MT.                
*                        Otherwise this field is zero              @0UA         
SvtCanCaptInstrCtrSTCK DC D'0' The STCK time of when the                        
*                           SvtCanCaptInstrCtr bit was last turned              
*                           on                                     @MTA         
SVTInstrFlgs DC  XL4'00'    Instruction Count related flags                     
*                           Serialization: CS                      @MTA         
SvtCanCaptInstrCtr    EQU X'80' The instruction count can be                    
*                           successfully extracted                 @MTA         
SvtCaptInstrCtr       EQU X'40' The installation wants to collect               
*                           instruction counts for SMFPRMxx parameter           
*                           SMF30COUNT                             @0WC         
SvtCaptHFTSCtrs       EQU X'20' The installation wants to collect               
*                           counts counts for SMFPRMxx parameter                
*                           HFTSINTVL                              @0WA         
SvtHFTSExitActive     EQU X'10' The Supervisor HFTS exit is active @NAA         
SVT_Diag484 DC XL8'0010001000100000' Diagnostic data for IBM use only  X        
                                                                   @MVA         
SVT_Diag48C DS 0XL8                  Diagnostic data for IBM use only  X        
                                                                   @10C         
         DC    XL2'0007'                                           @10C         
         DC    XL2'000F'                                           @10C         
         DC    XL2'0016'                                           @10C         
         DC    XL2'0002'                                           @10C         
SVT_Diag494 DC XL4'0D090705'         Diagnostic data for IBM use only  X        
                                                                   @0UC         
SvtCaptInstrCtrSTCK DC D'0' The STCK time of when the                           
*                           SvtCaptInstrCtr bit was last turned                 
*                           on                                     @MUA         
SVT_CPEngineSpeed DS F   Standard CP Engine Speed (cycles per                   
*                        microsecond) When 0, the speed is not                  
*                        available                                 @0UA         
SVT_SpecialtyEngineSpeed DS F Specialty Engine Speed (cycles per                
*                        microsecond) When 0, the speed is not                  
*                        available.                                @0UA         
SVT_HisCounter_Seqnums DS 0CL8 Sequence numbers to test validity of    X        
                            HIS counters                           @0WA         
SVT_BasicCounter_SeqNum DS F Sequence number of changes to the basic   X        
                            counter set. Incremented when the basic    X        
                            counters are turned on or off. Also        X        
                            incremented when the basic counters are    X        
                            requested for SMF30COUNT (SvtCaptInstrCtr  X        
                            turned on or off) or HFTSINTVL             X        
                            (SvtCaptHFTSCtrs turned on or off)         X        
                            SERIALIZATION: CS                          X        
                            OWNERSHIP: Supervisor Control          @0WA         
SVT_CaptHFTSCtrs_SeqNum DS F Sequence number of changes to             X        
                            SvtCaptHFTSCtrs bit. Incremented when      X        
                            collection of counters for HFTS is enabled X        
                            or disabled.                               X        
                            SERIALIZATION: CS                          X        
                            OWNERSHIP: Supervisor Control          @0WA         
SVT_Diag4B0 DC XL16'00'     Diagnostic data for IBM use only       @0UA         
SVT_WindowIntervalMics DC H'500' Minimum time before window can be     X        
                            opened in IEAMWIN (in microseconds).       X        
                            For zSphinx or later hardware.             X        
                            Value stored in microseconds so            X        
                            that window interval isn't                 X        
                            greatly affected on an overlay         @0UA         
SvtNumCpuIDsInCore DC H'0'  The maximum number of CPUs that can "fit"  X        
                            on a core. This doesn't mean all of the    X        
                            CPUs can be active. This can be looked at  X        
                            as how many IDs exist between thread       X        
                            0 of two contiguous cores. When            X        
                            CvtProcAsCore is off, this will be 1.  @NAA         
SVTDEBL  DC    V(IEAVDEBL)  Address of IEAVDEBL                    @0XA         
SVTSSJS  DC    V(IEAVSSJS)  Address of IEAVSSJS                    @NCC         
*                      For use by a routine that owns a space-switch            
*                      PC when its jobstep task will terminate but              
*                      before freeing storage and/or modules that               
*                      might be used in the flow of a space-switch PC.          
*                      This could include subtasks that load modules            
*                      called by the PC or obtain data owned by the             
*                      subtask referenced by the PC flow.                       
*                      - Caller must be AMODE 31, key 0, supervisor             
*                        state, enabled for I/O and external                    
*                        interrupts, holding no locks.                          
*                      - Task mode.                                             
*                      - Primary ASC mode.                                      
*                      - P=S=H                                                  
*                      - There is no need to set any reg other than 0           
*                        and 15 prior to calling (including 13)                 
*                      - Load this address into GR 15,                          
*                      - Issue BASR 14,15                                       
*                      - 31-bit GRs 2-13, high halves 2-14, and                 
*                        ARs 2-14 will be preserved via BAKR                    
*                      - On entry R0 should contain 0                           
*                      - There are no return codes                              
SVT_Diag4CC DC 0XL4         Diagnostic data for IBM use only       @10C         
         DC    XL4'00000000'                                       @10A         
SvtLTodSigpGovzCBP DC 0XL4'00190000' When the system is                X        
                            in HD=YES, this value is a low order TOD   X        
                            that indicates how much time must pass     X        
                            between SIGPs for zCBPs in the same        X        
                            affinity node.                             X        
                            SvtLTodSigpGovzCBP is a                    X        
                            percentage of SVT_zCBPAWMT_COUNT_TIMER     X        
                            (can be greater than 100%).            @NBA         
SvtLTodSigpGovZaap DC XL4'00190000' When the system is                 X        
                            in HD=YES, this value is a low order TOD   X        
                            that indicates how much time must pass     X        
                            between SIGPs for zAAPs in the same        X        
                            affinity node.                             X        
                            SvtLTodSigpGovZaap is a                    X        
                            percentage of SVT_IFAAWMT_COUNT_TIMER      X        
                            (can be greater than 100%).            @N7C         
SvtLTodSigpGovZiip DC XL4'00190000' When the system is                 X        
                            in HD=YES, this value is a low order TOD   X        
                            that indicates how much time must pass     X        
                            between SIGPs for zIIPs in the same        X        
                            affinity node.                             X        
                            SvtLTodSigpGovZiip is a                    X        
                            percentage of SVT_SUPAWMT_COUNT_TIMER      X        
                            (can be greater than 100%).            @N7C         
SvtMaskCpusPerCore DC XL8'00' Left aligned mask of CPUs that can "fit" X        
                        on a core.  This doesn't mean that all the     X        
                        CPUs can be active.  It can be looked at as    X        
                        the mask of CPUs (1 bit per CPU) between       X        
                        thread 0 of two contiguous cores.              X        
                        When CvtProcAsCore is                          X        
                        off, this mask will have                       X        
                        only the leftmost bit on.                  @NAA         
SVT_PreemptHPWUQIntvLTod DC XL4'00014000' Preempt for HPWUQ                     
*                                  interval - Time in TOD units in              
*                                  which the system may keep work               
*                                  queued in the HPWUQ before it can            
*                                  preempt executing work.  Default 20          
*                                  microseconds                    @NAA         
SVT_kDefaultPreemptHPWUQIntvLTod EQU X'00014000'                   @NAA         
SVT_Diag4E4 DS 0XL16    Diagnostic data for IBM use only           @10C         
         DC    XL4'000F8000'                                       @10C         
         DC    XL4'00096000'                                                    
         DC    XL2'0002'                                           @10C         
         DC    XL2'0008'                                           @10C         
         DC    XL2'0004'                                           @10C         
         DC    XL2'0006'                                           @10C         
*                                                                  @10D         
SVTCASTEL DC   XL4'00'                                             @0YA         
SVTUNALV DC    A(0)                                                @0YA         
SVTUNALD DC    A(0)                                                @0YA         
SVT_RWBLOCK_500 DS 0XL256          read-write block                @MGA         
SVT_Diag500 DC XL128'00'           Diagnostic data. This field is for  X        
                                   IBM use only                    @MSC         
SvtSrbIdSeq# DS XL8'00'      System-wide wrapping counter used to      X        
                             create an SrbIdToken                      X        
                             SERIALIZATION: CSG                        X        
                             OWNERSHIP: Supervisor Control         @MMA         
SVT_TOD_ExtractCoreCtrs DS CL8 Time (set by HISNTIMR) after which core          
*                        counters can be extracted by IEAVEJST     @0UA         
SVTCoreModeTransition DS F This word is used to indicate to recovery            
*                        that a Core or CoreMode Transition is in               
*                        progress or has occurred. Serialized by CS.            
*                                                                  @0UA         
         ORG   SVTCoreModeTransition                                            
SVTCoreModeTransition_ReconfigFlags DS XL1 Flags related to                     
*                        reconfiguration processing.               @0UA         
*  Bit definitions:                                                             
SvtCoreModeTransition_Active EQU X'80' Indicates that a Core or                 
*                        CoreMode reconfiguration is in progress. This          
*                        bit should only be turned ON when                      
*                        SYSZVARY.CPU is ENQueued. Not abnormal                 
*                        because the bit is set ON/OFF using CS on the          
*                        SvtCoreModeTransition word.               @0UA         
SVTCoreModeTransition_ReconfigError EQU X'40' Indicates that                    
*                        reconfiguration processing had an error. This          
*                        bit is turned ON to tell IEAVELCR not to               
*                        collect doc because it was already collected           
*                        as part of reconfiguration error recovery.             
*                        Not abnormal because the bit is set ON/OFF             
*                        using CS on the SvtCoreModeTransition word.            
*                        recovery.                                 @0UA         
SVTR591 DS XL1                    RESERVED.                        @0UA         
SvtCoreModeTransition_Seq# DS H Current sequence number.           @0UA         
SVTCoreModeSeqNum_CP DS F Sequence number for each procclass. It is             
*                        incremented by IEEVCPR when MT mode of a               
*                        procclass is changed. Serialization:                   
*                        SYSZVARY.CPU ENQ obtained by IEECB927.    @0UA         
SVTCoreModeSeqNum_zCBP DS 0F See description for SVTCoreModeSeqNum_CP           
*                                                                  @NBA         
SVTCoreModeSeqNum_zAAP DS F See description for SVTCoreModeSeqNum_CP            
*                                                                  @0UA         
SVTCoreModeSeqNum_zIIP DS F See description for SVTCoreModeSeqNum_CP            
*                                                                  @0UA         
SVTR5A0  DC    XL92'00'            Reserved (read-write)           @11C         
SVTVBAA  DC    A(0)         Validated Boot Area Address            @11C         
*                             0: VB not done. No VBA                            
*                            <0: VB not active any longer. VBA exists           
*                            >0: VB active. VBA exists                          
SVTVBA_Inactive EQU X'80'   When on, VBA exists, but VB activity   @11A         
*                           is no longer ongoing                   @11A         
SVTEND   DS    0D                  END OF SVT.                     @LBA         
         POP   PRINT                                               @H2A         
         MEND                                                                   
* */                                                                            
*%PLSSVT2:;                                                                     
*                                                                               
*  @LISTPUSH;                                                  /*@H2A*/         
*  %IF IHALIST='YES' %THEN                                     /*@H2A*/         
*     %GOTO SVTLIST;                                           /*@H2A*/         
*  @LISTOFF;                                                   /*@H2A*/         
*  %SVTLIST:;                                                  /*@H2A*/         
*                                                                               
* DECLARE                                                                       
*   1 SVT BASED(PSASVT) BDY(DWORD), /* SUPERVISOR VECTOR TABLE       */         
*     3 SVTISECT PTR(31),           /* ADDRESS OF INTERSECT                     
*                                      ROUTINE, IEAVEINT.    @G387PXU*/         
*     3 SVTGSCH1 PTR(31),           /* ADDRESS OF GLOBAL SCHEDULE               
*                                      ROUTINE FOR ENABLED USERS     */         
*     3 SVTGSCH2 PTR(31),           /* ADDRESS OF GLOBAL SCHEDULE               
*                                      ROUTINE FOR DISABLED USERS    */         
*     3 SVTAWUQ  PTR(31),           /* Address of the AWUQ                      
*                                      SERIALIZATION: None                      
*                                      OWNERSHIP: Supervisor Control            
*                                                                @LNC*/         
*       4 SVTAFFON BIT(1),          /* Affinity dispatching is active           
*                                                                @LNA*/         
*     3 SVTWEEF  PTR(31),           /* Address of the first WEB                 
*                                      Extent Element Pool.                     
*                                      SERIALIZATION: CS or Global              
*                                        Recovery protocols.                    
*                                      OWNERSHIP: Supervisor Control            
*                                                                @LBA*/         
*     3 SVTRSCS  PTR(31),           /* RESUME CONDITIONAL ENTRY                 
*                                      POINT, IEAVRSCS.      @G387PXU*/         
*     3 SVTJSTEQ PTR(31),           /* JOB STEP TIME EXCEEDED QUEUE  */         
*     3 SVTDSREQ BIT(32) BDY(WORD), /* DISPATCHER SERIALIZATION                 
*                                      REQUIRED                      */         
*       4 SVTSRQ1 BIT(8),           /* FIRST BYTE OF SVTDSREQ        */         
*         5 SVTDSG4  BIT(1),        /* SIGNAL WAITING PROCESSOR      */         
*         5 SVTDFLT  BIT(1),        /* DEFAULT INTERSECT             */         
*         5 *        BIT(6),        /* RESERVED.                     */         
*       4 SVTSRQ2 BIT(8),           /* SECOND BYTE OF SVTDSREQ       */         
*         5 SVTDSG3  BIT(1),        /* SIGNAL WAITING PROCESSOR      */         
*         5 *        BIT(5),        /* RESERVED.                     */         
*         5 SVTSRM1  BIT(1),        /* SRM INTERSECTING              */         
*         5 SVTQVER  BIT(1),        /* Q VERIFICATION INTERSECTING   */         
*       4 SVTSRQ3 BIT(8),           /* THIRD BYTE OF SVTDSREQ        */         
*         5 SVTDSG2  BIT(1),        /* SIGNAL WAITING PROCESSOR      */         
*         5 SVTRCTI  BIT(1),        /* RCT INTERSECTING      @ZM48358*/         
*         5 SVTTCBV  BIT(1),        /* TCB VERIFICATION INTERSECT    */         
*         5 SVTACHA  BIT(1),        /* ASCB CHAP INTERSECTING        */         
*         5 *        BIT(1),        /* RESERVED.                     */         
*         5 SVTMTER  BIT(1),        /* MEMTERM INTERSECTING          */         
*         5 SVTMINI  BIT(1),        /* MEMORY INIT INTERSECTING      */         
*         5 SVTCBVE  BIT(1),        /* CONTROL BLOCK VERIFICATION               
*                                      INTERSECTING                  */         
*       4 SVTSRQ4 BIT(8),           /* FOURTH BYTE OF SVTDSREQ       */         
*         5 SVTDSG1  BIT(1),        /* SIGNAL WAITING PROCESSOR      */         
*         5 SVTDETA  BIT(1),        /* DETACH INTERSECTING           */         
*         5 SVTATTA  BIT(1),        /* ATTACH INTERSECTING           */         
*         5 SVTRTM2  BIT(1),        /* RTM2 INTERSECTING             */         
*         5 SVTRTM1  BIT(1),        /* RTM1 INTERSECTING             */         
*         5 SVTCHAP  BIT(1),        /* TCB CHAP  INTERSECTING        */         
*         5 SVTSTAT  BIT(1),        /* STATUS INTERSECTING           */         
*         5 SVTPURD  BIT(1),        /* PURGE DQ VERIFICATION         */         
*     3 SVTGSRB CHAR(8) BDY(DWORD), /* GLOBAL SRB QUEUES.    @G387PXU*/         
*       4 SVTGSMQ FIXED(31),        /* GLOBAL SERVICE MANAGEMENT Q   */         
*       4 SVTGSPL FIXED(31),        /* Must be x'FFFFFFFF'.                     
*                                      SERIALIZATION: None.                     
*                                      OWNERSHIP: Supervisor Control            
*                                                                @LBC*/         
*     3 SVTLSMQ FIXED(31),          /* LOCAL SERVICE MANAGEMENT Q    */         
*     3 SVTR02C CHAR(64) BDY(WORD),       /*                     @0WC*/         
* %IF SYSVERSION = '' %THEN %GOTO SVTPLS99;                                     
* %IF SYSRULESMOD='PL/S-III ' %THEN %GOTO SVTPLS99;                             
* %IF SVT_CPUDUALPATH='YES' %THEN                             /* @M3A*/         
* %GOTO SVTPLS99;                                             /* @M3A*/         
* /*                                                                            
*  These will be removed in a future release, when the old fields               
*  will no longer be supported.  Use the new pointers exclusively               
*  to access fields for code being run on HBB7760 and higher     @LAA*/         
*    4 SVTWAS_OLD CHAR(64) BDY(WORD), /* WAIT ADDRESS SPACE VECTOR USED         
*                                      TO SIGP MEMORY SWITCH TO                 
*                                      WAITING PROCESSOR - 1 BYTE               
*                                      PER PROCESSOR             @M3C*/         
* /*                                                                            
*  End of fields that will be removed in a future release        @M3A*/         
* %SVTPLS99:;                                                 /* @M3A*/         
*     3 * CHAR(4),                  /* RESERVED FIELD - FORMERLY                
*                                      SVTDACTV - MUST ALWAYS REMAIN            
*                                      NONZERO               @G860PXD*/         
*     3 SVTAPCP  FIXED(15),         /* Initial value for the number of          
*                                      WEBs that must be on a WUQ               
*                                      as a gating factor for AWM SIGP          
*                                      SERIALIZATION: NONE                      
*                                      OWNERSHIP: SRM            @LTA*/         
*     3 SVTMAXQL FIXED(15),         /* The maximum number of WEBs 1 CP          
*                                      can dispatch in a timely                 
*                                      fashion.                                 
*                                      Serialization: NONE.                     
*                                      Ownership: Supervisor/SRM                
*                                                                @MEC*/         
*     3 SVTMINHL FIXED(15),         /* When a CP chooses another CPU            
*                                      for help,                                
*                                      the minimum number of dispatches         
*                                      which will be done for help.             
*                                      Serialization: NONE.                     
*                                      Ownership: Supervisor/SRM                
*                                                                @MEC*/         
*     3 *       CHAR(1),            /*                           @0NA*/         
*%IF SYSVERSION = '' %THEN          /*                           @0NA*/         
*    %GOTO SVT077;                  /*                           @0NA*/         
*%IF SYSRULESMOD='PL/S-III ' %THEN                            /* @0NA*/         
*    %GOTO SVT077;                  /*                           @0NA*/         
*       5 SVT_ShortMinHdYesLockPromote FIXED(8), /* Number of short             
*                                      minors lock promote can occur            
*                                      for in HD=YES.  This field is            
*                                      dynamically updated in                   
*                                      IEAVMPWQ.                 @0NA*/         
*%SVT077:;                          /*                           @0NA*/         
*     3 SVTEGRT CHAR(1),            /* Global Recovery Test bits                
*                                      SERIALIZATION: NONE       @PUA*/         
*%IF SYSVERSION = '' %THEN          /*                           @PUA*/         
*    %GOTO SVT078;                  /*                           @PUA*/         
*%IF SYSRULESMOD='PL/S-III ' %THEN                            /* @PUA*/         
*    %GOTO SVT078;                  /*                           @PUA*/         
*       5 SVTInvokeGrOnSpin BIT(1), /* When on, next invoker                    
*                                      of IEAVESPN will invoke                  
*                                      global recovery           @PUA*/         
*%SVT078:;                          /*                           @PUA*/         
*     3 SVTCRSCR PTR(31),           /* Address of the Supervisor                
*                                      Checkpoint/Restart SRB Check             
*                                      Routine.                  @LDA*/         
*     3 * CHAR(4),                  /* RESERVED FIELD - FORMERLY                
*                                      SVTPWAIT - MUST ALWAYS REMAIN            
*                                      NONZERO               @G860PXD*/         
*     3 SVTWPSCT FIXED(32),         /* Count of SIGPs to waiting                
*                                      processors due to timeout                
*                                      between waits.                           
*                                      SERIALIZATION: NONE                      
*                                      OWNERSHIP: SRM            @LTA*/         
*     3 SVTR084 CHAR(4),            /* Reserved. Formerly SVTMSWCT              
*                                                                @M5C*/         
*     3 SVTACTR PTR(31),            /* ADDRESS OF ACCUMULATED CPU TIME          
*                                      SERVICE ROUTINE USED BY                  
*                                      TIMEUSED MACRO            @02A*/         
*     3 SVTISECR PTR(31),           /* INTERSECT RESET ROUTINE       */         
*     3 SVTXASCB PTR(31),           /* ADDRESS OF PC/AUTH                       
*                                      ASCB.                 @G387PXU*/         
*     3 SVTXMD  PTR(31),            /* ADDRESS OF CROSS MEMORY                  
*                                      DIRECTORY (XMD) (IN PC/AUTH              
*                                      ADDRESS SPACE).       @G387PXU*/         
*     3 SVTGSPH  PTR(31),           /* ADDRESS OF GLOBAL STACK                  
*                                      POOL HEADER FOR PCLINK                   
*                                      SERVICE, IEASTKH.     @G387PXU*/         
*     3 SVTMCADS FIXED(15),         /* MAXIMUM NUMBER OF ALE SLOTS IN           
*                                      A PASN ACCESS LIST RESERVED FOR          
*                                      CADS. INITIALIZED TO 50. MAY BE          
*                                      CHANGED BY IEAVNP09.      @04C*/         
*     3 SVTMPALE FIXED(15),         /* NUMBER OF NON-CADS PASN ACCESS           
*                                      LIST ENTRIES. INITIALIZED BY             
*                                      IEAVNP09.                 @04A*/         
*     3 SVTBBR PTR(31),             /* ADDRESS OF BIND BREAK                    
*                                      ROUTINE, IEAVEBBR.    @G387PXU*/         
*     3 SVTLASCB PTR(31),           /* ADDRESS OF LOCASCB                       
*                                      SERVICE ROUTINE,                         
*                                      IEAVLACB.             @G387PXU*/         
*     3 SVTCMCKM FIXED(32),         /* CMSET CONSTANT FOR ICMA                  
*                                      CHECK, X'80000000'.   @G387PXU*/         
*     3 SVTCMST1 PTR(31),           /* ADDRESS OF CMSET SET                     
*                                      ROUTINE, IEAVCMS1.                       
*                                      No longer used.           @LKC*/         
*     3 SVTCMRT1 PTR(31),           /* ADDRESS OF CMSET RESET                   
*                                      CHKAUTH(YES) ROUTINE,                    
*                                      IEAVCMR1.                                
*                                      No longer used.           @LKC*/         
*     3 SVTCMRT2 PTR(31),           /* ADDRESS OF CMSET RESET                   
*                                      CHKAUTH(NO) ROUTINE,                     
*                                      IEAVCMR2.                                
*                                      No longer used.           @LKC*/         
*     3 SVTCMSTR PTR(31),           /* ADDRESS OF CMSET SSARTO                  
*                                      ROUTINE, IEAVCMST.                       
*                                      No longer used.           @LKC*/         
*     3 SVTCMSBR PTR(31),           /* ADDRESS OF CMSET                         
*                                      SSARBACK ROUTINE,                        
*                                      IEAVCMSB.                                
*                                      No longer used.           @LKC*/         
*     3 SVTCDSPE PTR(31),           /* ADDRESS OF CALLDISP                      
*                                      ROUTINE FOR ENABLED                      
*                                      CALLERS, IEAVCDEN.    @G387PXU*/         
*     3 SVTCDSPD PTR(31),           /* ADDRESS OF CALLDISP                      
*                                      ROUTINE FOR DISABLED                     
*                                      CALLERS, IEAVCDDS.    @G387PXU*/         
*     3 SVTSRBSV PTR(31),           /* ADDRESS OF SRBSTAT SAVE                  
*                                      ROUTINE, IEAVESTS.    @G387PXU*/         
*     3 SVTSRBRS PTR(31),           /* ADDRESS OF SRBSTAT                       
*                                      RESTORE ROUTINE,                         
*                                      IEAVESTR.             @G387PXU*/         
*     3 SVTAFFST PTR(31),           /* ADDRESS OF SSAFF SET                     
*                                      ROUTINE, IEAVESAS.    @G387PXU*/         
*     3 SVTAFFOB PTR(31),           /* ADDRESS OF SSAFF OBTAIN                  
*                                      ROUTINE, IEAVESAF.    @G387PXU*/         
*     3 SVTSRBG PTR(31),            /* ADDRESS OF GETSRB                        
*                                      ROUTINE, IEAVSPM1.    @G387PXU*/         
*     3 SVTSSRBG PTR(31),           /* ADDRESS OF GETSSRB                       
*                                      ROUTINE, IEAVSPM2.    @G387PXU*/         
*     3 SVTSRBF PTR(31),            /* ADDRESS OF FREESRB                       
*                                      ROUTINE, IEAVSPM3.    @G387PXU*/         
*     3 SVTSSRBF PTR(31),           /* ADDRESS OF FREESSRB                      
*                                      ROUTINE, IEAVSPM4.    @G387PXU*/         
*     3 SVTSRBP BDY(DWORD),         /* SUPERVISOR SRB POOL                      
*                                      HEADER.                                  
*                                      SERIALIZATION - CDS.  @G387PXU*/         
*       4 SVTSRBS FIXED(31),        /* SRB POOL ELEMENT                         
*                                      SYNC COUNT.           @G387PXU*/         
*       4 SVTSRBA PTR(31),          /* ADDRESS OF FIRST                         
*                                      AVAILABLE SRB.        @G387PXU*/         
*     3 SVTSRBE BDY(WORD),          /* SRB POOL EXTENT                          
*                                      COUNTS.                                  
*                                      SERIALIZATION -SALLOC.@G387PXU*/         
*       4 SVTSRBM FIXED(15),        /* MAX SRB POOL EXTENTS. @G387PXU*/         
*       4 SVTSRBC FIXED(15),        /* CURRENT SRB POOL                         
*                                      EXTENTS.              @G387PXU*/         
*     3 SVTR0F4 CHAR(12),           /* Reserved. Formerly SVTWTSS_IFA,          
*                                      SVTSSRBP/S/A              @M5C*/         
*     3 SVTSVT   CHAR(4),           /* SVT ACRONYM.          @G387PXU*/         
*     3 SVTRSUA  PTR(31),           /* ADDRESS OF RESUME                        
*                                      UNCONDITIONAL,ASYNC=Y                    
*                                      ROUTINE, IEAVRSUA.    @G387PXU*/         
*     3 SVTRSCA  PTR(31),           /* ADDRESS OF RESUME                        
*                                      CONDITIONAL,ASYNC=Y                      
*                                      ROUTINE, IEAVRSCA.    @G387PXU*/         
*     3 SVTRSUS  PTR(31),           /* ADDRESS OF RESUME                        
*                                      UNCONDITIONAL,ASYNC=N                    
*                                      ROUTINE FOR ASCB                         
*                                      SPECIFIED, IEAVRSUS.  @G387PXU*/         
*     3 SVTDSBCT FIXED(31),         /* Maximum number of WEBs the               
*                                   Dispatcher can process before               
*                                      INVOKING RECOVERY.        @07C*/         
*            /* -- See SVTDSBCM for a mask field @0DA*/                         
*       4 SVTCHKWP BIT(1),          /* CHECK WAITING PROCESSOR                  
*                                      IF ON                     @07A*/         
*       4 SVTWPCP BIT(1),           /* Waiting processor is CP   @P6A*/         
*       4 SVTWPIFA BIT(1),          /* Waiting processor is IFA  @P6A*/         
*       4 *      BIT(28),                                     /* @P6C*/         
*       4 SVTAWM BIT(1),            /* ALTERNATE WAIT MANAGEMENT                
*                                      ENABLED FLAG (SVTDSBCT LOW BIT)          
*                                      SET BY SRM.                              
*                                      SERIALIZATION: NONE       @07A*/         
*     3 SVTMCBCT FIXED(31),         /* Maximum number of times to loop          
*                                   on a locked WEB before invoking             
*                                   WUQ Global Recovery.  The last byte         
*                                   of this field should be equal to            
*                                   the number of instructions executed         
*                                   by the Dispatcher in its worksearch         
*                                   loop used to lock a WEB.                    
*                                      SERIALIZATION: None                      
*                                      OWNERSHIP: SRM                           
*                                                                @LBC*/         
*     3 SVTFW1 FIXED(32),           /* FULLWORD SERIALIZED                      
*                                      BY CS.                @G387PXU*/         
*       4 SVTCS1 BIT(8),            /* FIRST BYTE OF CS WORD.@G387PXU*/         
*         5 SVTXMSOP BIT(1) ABNL,   /* PC/AUTH SERVICE ROUTINES                 
*                                      OPERABLE.             @G387PXU*/         
*         5 SVTXMSUP BIT(1) ABNL,   /* PC/AUTH ADDRESS SPACE                    
*                                      INITIALIZED.          @G387PXU*/         
*         5 SVTXMCMF BIT(1) ABNL,   /* CROSS MEMORY CONNECTIONS                 
*                                      MANAGER HAS FAILED.                      
*                                      REUSABILITY FUNCTIONS ARE NOT            
*                                      OPERATIONAL. SERIALIZED BY               
*                                      PC/AUTH LOCAL LOCK.                      
*                                      SET BY IEAVXMCM RECOVERY.                
*                                                                @L5A*/         
*         5 SVTAWUQE BIT(1) ABNL,   /* Supervisor AWUQ error, affinity          
*                                      nodes must be rebuilt     @P9A*/         
*         5 SVTCPCRN BIT(1),        /* Set only during NIP       @0KA*/         
*%IF SYSVERSION = '' %THEN          /*                           @MDA*/         
*    %GOTO SVT119;                  /*                           @MDA*/         
*%IF SYSRULESMOD='PL/S-III ' %THEN                            /* @MDA*/         
*    %GOTO SVT119;                  /*                           @MDA*/         
*         5 SVT_CRITICALPAGING BIT(1) ABNL,  /* On when hardening               
*                                      critical address spaces against          
*                                      pagefaults.  Note: If                    
*                                      dynamically turned on,                   
*                                      currently 'paged-out' storage            
*                                      will NOT be paged-in for                 
*                                      critical address spaces   @MAA*/         
*         5 SVT_HYPERSWAP_IN_PROGRESS BIT(1) ABNL,  /* On when a                
*                                      Hyperswap process is in                  
*                                      progress                  @MAA*/         
*         5 SvtCoreModeError Bit(1) ABNL, /* Error detected for                 
*                                   MT mode of 1 or more cores.  @0UA*/         
*%SVT119:;                          /*                           @MDA*/         
*       4 SVTCS2 BIT(8),            /* SECOND BYTE OF CS WORD.   @N1A*/         
*%IF SYSVERSION = '' %THEN          /*                           @0UA*/         
*    %GOTO SVT120;                  /*                           @0UA*/         
*%IF SYSRULESMOD='PL/S-III ' %THEN                            /* @0UA*/         
*    %GOTO SVT120;                  /*                           @0UA*/         
*         5 SVTForceCoreMode_1 Bit(1) ABNL, /* Supervisor error:unable          
*                                   to continue in MT mode>1. Set bit           
*                                   ON to tell WLM to change MT mode            
*                                   to 1 for all processor classes              
*                                   for the remaining life of this IPL.         
*                                   Bit is not turned OFF. Forced to            
*                                   stay in MT mode 1 since error is            
*                                   not correctable.             @0UA*/         
*%SVT120:;                          /*                           @0UA*/         
*       4 SVTR11A CHAR(2),          /* RESERVED.                                
*                                      SERIALIZATION - CS.       @N1C*/         
*     3 SVTDSPC PTR(31),            /* ADDRESS OF DISPATCHER                    
*                                      ENTRY POINT FOR STOP                     
*                                      ROUTINE CALLERS.      @G387PXU*/         
*     3 SVTAFTR PTR(31),            /* VIRTUAL ADDRESS OF ADDRESS               
*                                      SPACE FIRST TABLE (AFT)                  
*                                      CONTAINING REAL                          
*                                      ADDRESSES.            @G387PXU*/         
*     3 SVTAFTV PTR(31),            /* VIRTUAL ADDRESS OF                       
*                                      ADDRESS SPACE FIRST                      
*                                      TABLE (AFT) CONTAINING                   
*                                      VIRTUAL ADDRESSES.    @G387PXU*/         
*     3 SVTSSEM PTR(31),            /* ADDRESS OF SPACE SWITCH                  
*                                      EVENT MANAGER, IEAVESSE.                 
*                                                            @G387PXU*/         
*     3 SVTISSAT PTR(31),           /* ADDRESS OF INITIAL                       
*                                      SUBSYSTEM AFFINITY                       
*                                      TABLE FOR ALL TASKS,                     
*                                      IEAISSAT.             @G387PXU*/         
*     3 SVTSSTSV FIXED(31),         /* LENGTH REQUIRED FOR                      
*                                      SRB STATUS SAVE AREA.     @L9C*/         
*     3 SVTWTSS  FIXED(31),         /* Short time slice wait time               
*                                      Ownership: SRM                           
*                                      Serialization: SRMLOCK    @PXC*/         
*     3 SVTMDLQ  PTR(31),           /* MEMORY DELETE QUEUE                      
*                                      HEADER FOR ASCBS THAT                    
*                                      CANNOT BE FREED.      @G387PXU*/         
*     3 SVTSLWLN FIXED(31),         /* SLIP/PER WORK AREA                       
*                                      LENGTH REQUIRED FOR                      
*                                      EACH PROCESSOR.       @G387PXU*/         
*     3 SVTSRBMD PTR(31),           /* ADDRESS OF SRBSTAT                       
*                                      MODIFY ROUTINE,                          
*                                      IEAVESTM.             @G387PXU*/         
*     3 SVTIFA CHAR(2) BDY(WORD),   /* IFA info                  @P5C*/         
*%IF SYSVERSION = '' %THEN          /*                           @H3A*/         
*    %GOTO SVT12;                   /*                           @H3A*/         
*%IF SYSRULESMOD='PL/S-III ' %THEN                            /* @H3A*/         
*    %GOTO SVT12;                   /*                           @H3A*/         
*     5 SVT_AWUQ_help_limit_prty FIXED(15), /* Help limit priority for          
*                                      alternate WUQ             @LPC*/         
*       7 SVT_ASWUQ_help_limit_prty FIXED(15), /* Limit priority for            
*                                      IFA help                  @0GC*/         
*%SVT12:;                           /*                           @H3A*/         
*     3 SVTNSLX  FIXED(16),         /* NUMBER OF SYSTEM LXS                     
*                                      BEYOND THE HIGHEST                       
*                                      SYSTEM FUNCTION TABLE                    
*                                      LX.                   @G387PXU*/         
*     3 SVTSET1 PTR(31),            /* ADDRESS OF STATUS ENTRY                  
*                                      POINT TO SIGPCPUS                        
*                                      ROUTINE.              @G387PXU*/         
*     3 SVTISECG PTR(31),           /* ADDRESS OF INTERSECT                     
*                                      GLOBAL ENTRY POINT.   @G860PXH*/         
*     3 SVTISECL PTR(31),           /* ADDRESS OF INTERSECT                     
*                                      LOCAL ENTRY POINT.    @G860PXH*/         
*     3 SVTSWUQ PTR(31),            /* System WUQ (SWUQ) header                 
*                                      address.                                 
*                                      SERIALIZATION: WEB Lock Protocol         
*                                      OWNERSHIP: Supervisor Control            
*                                                                @LBC*/         
*       5 SVTHPWUQ PTR(31),         /* The system WUQ is used as the            
*                                      high priority WUQ in HD=YES              
*                                      mode                                     
*                                      This value is zero in HD=NO              
*                                      SERIALIZATION: WEB Lock Protocol         
*                                      OWNERSHIP: Supervisor Control            
*                                                                @LWC*/         
*     3 SVTCMST2 PTR(31),           /* Address of CMSET SET,DIE=YES             
*                                      routine.                                 
*                                      No longer used.           @LKC*/         
*     3 SVTBEST@ PTR(31),           /* Address of XES Back End Schedule         
*                                      Table (BEST).                            
*                                      SERIALIZATION: XES-determined            
*                                      protocol                                 
*                                      OWNERSHIP: XES            @08C*/         
*     3 * CHAR(16) BDY(DWORD),      /* Reserved: was SVTDACTV    @LJC*/         
*                                   /* FIELD REDEFINITION       5@LJM*/         
*     3 * CHAR(16) BDY(DWORD),      /* Reserved: was SVTPWAIT    @LJC*/         
*                                   /* REDEFINITION             5@LJM*/         
*     3 * CHAR(4),                  /* Reserved: was SVTWPBM     @LJC*/         
*     3 * CHAR(4),                  /* Reserved: was SVTSNCT2    @LJC*/         
*     3 SVTCMRT3 PTR(31),           /* Address of CMSET RESET,                  
*                                      CHKAUTH=YES,DIE=YES routine.             
*                                      No longer used.           @LKC*/         
*     3 SVTCMRT4 PTR(31),           /* Address of CMSET RESET,                  
*                                      CHKAUTH=NO,DIE=YES routine.              
*                                      No longer used.           @LKC*/         
*     3 SVTSUSC  PTR(31),           /* GENERALIZED STOP ENTRY POINT             
*                                      ADDRESS                   @H2A*/         
*     3 SVTRSTC  PTR(31),           /* GENERALIZED RESET ENTRY POINT            
*                                      ADDRESS                   @H2A*/         
*     3 SVTCBLS  PTR(31),           /* ADDRESS OF CONTROL BLOCK                 
*                                      LENGTH TABLE.                            
*                                      OWNERSHIP - SUPERVISOR CONTROL           
*                                      SERIALIZATION - N/A       @H2A*/         
*   3 * CHAR(4) BDY(WORD),          /* Not defined in PL/S       @H3A*/         
*%IF SYSVERSION = '' %THEN          /*                           @H3A*/         
*    %GOTO SVT11;                   /*                           @H3A*/         
*%IF SYSRULESMOD='PL/S-III ' %THEN                            /* @H3A*/         
*    %GOTO SVT11;                   /*                           @H3A*/         
*    5 SVT_zCBP_Normalization FIXED(31), /* Normalization factor for            
*                                      zCBP time values. Multiply zCBP          
*                                      time by this value and divide by         
*                                      256 to get the equivalent time           
*                                      on a CP.                                 
*                                      Owner: SRM/WLM                           
*                                                                @NBA*/         
*      7 SVT_IFA_Normalization FIXED(31), /* Normalization factor for           
*                                      IFA. Multiply IFA time by this           
*                                      value and divide by 256 to get           
*                                      the equivalent time on a CP.             
*                                      Owner: SRM/WLM                           
*                                                                @NBC*/         
*%SVT11:;                           /*                           @H3A*/         
*   3 * CHAR(4) BDY(WORD),          /* Not defined in PL/S       @H4A*/         
*%IF SYSVERSION = '' %THEN          /*                           @H4A*/         
*    %GOTO SVT14;                   /*                           @H4A*/         
*%IF SYSRULESMOD='PL/S-III ' %THEN                            /* @H4A*/         
*    %GOTO SVT14;                   /*                           @H4A*/         
*   5 SVT_zIIP_Normalization FIXED(31), /* Normalization factor for             
*                                      zIIP. Multiply zIIP time by this         
*                                      value and divide by 256 to get           
*                                      the equivalent time on a CP.             
*                                      Owner: SRM/WLM                           
*                                                                @NBA*/         
*     7 SVT_SUP_Normalization FIXED(31), /* Normalization factor for            
*                                      SUP. Multiply SUP time by this           
*                                      value and divide by 256 to get           
*                                      the equivalent time on a CP.             
*                                      Owner: SRM/WLM                           
*                                                                @H4A*/         
*%SVT14:;                           /*                           @H4A*/         
*     3 *       CHAR(12),           /* Reserved: was SVTSPCP     @H4C*/         
*     3 SVTLSLO PTR(31),            /* ADDRESS OF THE LINKAGE STACK             
*                                      MANAGER LOCAL OBTAIN ROUTINE.            
*                                                                @L3A*/         
*     3 SVTLSLR PTR(31),            /* ADDRESS OF THE LINKAGE STACK             
*                                      MANAGER LOCAL RETURN ROUTINE.            
*                                                                @L3A*/         
*     3 SVTLSGO PTR(31),            /* ADDRESS OF THE LINKAGE STACK             
*                                      MANAGER GLOBAL OBTAIN ROUTINE.           
*                                                                @L3A*/         
*     3 SVTLSGR PTR(31),            /* ADDRESS OF THE LINKAGE STACK             
*                                      MANAGER GLOBAL RETURN ROUTINE.           
*                                                                @L3A*/         
*     3 SVTMPWQA PTR(31),           /* Address of IEAVMPWQ       @H3C*/         
*     3 SVTLSIO PTR(31),            /* ADDRESS OF THE LINKAGE STACK             
*                                      MANAGER INTERRUPT HANDLER LS             
*                                      OBTAIN ROUTINE.           @L3A*/         
*     3 SVTLSIR PTR(31),            /* ADDRESS OF THE LINKAGE STACK             
*                                      MANAGER INTERRUPT HANDLER LS             
*                                      RETURN ROUTINE.           @L3A*/         
*     3 SVTLEIGA PTR(31),           /* Initial Guardpage Address                
*                                      used by LE                               
*                                      Owner: Supervisor                        
*                                      Serialization: NONE     000607*/         
*     3 SVTGLAL CHAR(8) BDY(WORD),  /* GLOBAL ACCESS LIST POOL HEADER -         
*                                      SERIALIZATION CDS.        @L3A*/         
*       5 SVTGLALP PTR(31),         /* ADDRESS OF THE FIRST AVAILABLE           
*                                      GLOBAL POOL ACCESS LIST.  @L3A*/         
*       5 SVTGALPS FIXED(32),       /* SYNC COUNT FIELD FOR COMPARE             
*                                      DOUBLE AND SWAP OF SVTGLALP.             
*                                                                @L3A*/         
*     3 SVTGLPMX FIXED(32),         /* MAXIMUM NUMBER OF BYTES BY WHICH         
*                                      GLOBAL ACCESS LIST POOL MAY BE           
*                                      EXPANDED.                 @L3A*/         
*     3 SVTXAPM1 PTR(31),           /* ADDRESS OF ACCESS LIST POOL              
*                                      MANAGER EXPAND (IEAVXAPM)                
*                                      SERVICE.                  @L3A*/         
*     3 SVTXAPM2 PTR(31),           /* ADDRESS OF ACCESS LIST POOL              
*                                      MANAGER RETURN (IEAVXAP2)                
*                                      SERVICE.                  @L3A*/         
*     3 SVTINIT  PTR(31),           /* ADDRESS OF IEAVINIT.      @L3A*/         
*     3 SVTXAACR PTR(31),           /* ADDRESS OF ALET TO ASCB.                 
*                                      CONVERSION ROUTINE (IEAVXAAC).           
*                                                                @L3A*/         
*     3 SVTOENTY PTR(31),           /* ORIGIN OF THE ASVT ENTRY TABLE           
*                                      OF ASCB'S.                @L3A*/         
*     3 SVTSTKN  PTR(31),           /* ADDRESS OF THE STKN TABLE @L3A*/         
*     3 SVTSTKNE PTR(31),           /* LAST ENTRY OF STKN TABLE. @L3A*/         
*     3 SVTMEOUT FIXED(32),         /* SYSTEM SPIN LOOP TIMEOUT                 
*                                      VALUE IN SECONDS, INITIALIZED BY         
*                                      IEEVESAI                  @D4C*/         
*     3 SVTNALD  PTR(31),           /* NULL ACCESS LIST REAL ADDRESS            
*                                      AND LENGTH. BITS 0-25 WITH SIX           
*                                      ZEROS APPENDED ON THE RIGHT,             
*                                      FORM THE ADDRESS. BITS 26-31             
*                                      REPRESENT THE NUMBER OF 128 BYTE         
*                                      ACCESS LISTS, MINUS ONE.  @L3A*/         
*     3 SVTNALV  PTR(31),           /* NULL ACCESS LIST VIRTUAL                 
*                                      ADDRESS.                  @L3A*/         
*     3 SVTDS0E1 PTR(31),           /* ADDRESS OF DISPATCHER DIAGNOSTIC         
*                                      EXIT-1 (GIVEN CONTROL FOR                
*                                      UNLOCKED TASK DISPATCHES. @L3A*/         
*     3 SVTDS0E2 PTR(31),           /* ADDRESS OF DISPATCHER DIAGNOSTIC         
*                                      EXIT-2 (GIVEN CONTROL FOR LOCKED         
*                                      TASK DISPATCHES).         @L3A*/         
*     3 SVTDS0E3 PTR(31),           /* ADDRESS OF DISPATCHER DIAGNOSTIC         
*                                      EXIT-3 (GIVEN CONTROL FOR SRB            
*                                      DISPATCHES).              @L3A*/         
*     3 SVTDS0E4 PTR(31),           /* ADDRESS OF DISPATCHER DIAGNOSTIC         
*                                      EXIT-4 (GIVEN CONTROL FOR SSRB           
*                                      DISPATCHES).              @L3A*/         
*     3 SVTDS0E5 PTR(31),           /* ADDRESS OF DISPATCHER DIAGNOSTIC         
*                                      EXIT-5 (GIVEN CONTROL FOR WAIT           
*                                      TASK DISPATCHES).         @L3A*/         
*     3 SVTASECT PTR(31),           /* ADDRESS OF THE ASE CONTROL               
*                                      TABLE.                    @L3A*/         
*     3 SVTEXP3  PTR(31),           /* ADDRESS OF IEAVEXP3 SUBROUTINE           
*                                      IN EXIT PROLOGUE (LSED                   
*                                      COMPARISON ROUTINE).      @L3A*/         
*     3 SVTEMRQ  PTR(31),           /* ADDRESS OF MEMORY REQUEST @L4A*/         
*     3 SVTLSCO  PTR(31),           /* ADDRESS OF LS CONSTANTS TABLE            
*                                                                @L4A*/         
*     3 SVTLSLC  PTR(31),           /* ADDRESS OF THE LINKAGE STACK             
*                                      LOCATE SERVICE ROUTINE    @L4A*/         
*     3 SVTNLSSD PTR(31),           /* ADDRESS OF NULL LS LSSD   @D3A*/         
*     3 SVTNLSDP PTR(31),           /* ADDRESS OF NULL LS LSED   @D3A*/         
*     3 SVTQV4   PTR(31),           /* ADDRESS OF SINGLE SPACE DOUBLE           
*                                      LINKED QUEUE VERIFICATION                
*                                      ROUTINE.                  @L6A*/         
*     3 SVTQV5   PTR(31),           /* ADDRESS OF MULTIPLE SPACE DOUBLE         
*                                      LINKED QUEUE VERIFICATION                
*                                      ROUTINE.                  @L6A*/         
*     3 SVTCASTE PTR(31),           /* VIRTUAL ADDRESS OF THE BLOCK OF          
*                                      CADS ASTES. INITIALIZED BY               
*                                      IEAVNP09.                 @04C*/         
*     3 SVTGSCH9 PTR(31),           /* ADDRESS OF GLOBAL SCHEDULE WITH          
*                                      STOKEN ROUTINE FOR ENABLED               
*                                      CALLERS. (IEAVESC9)       @L8A*/         
*     3 SVTGSCHA PTR(31),           /* ADDRESS OF GLOBAL SCHEDULE WITH          
*                                      STOKEN ROUTINE FOR DISABLED              
*                                      CALLERS. (IEAVESCA)       @L8A*/         
*     3 SVTLSCHB PTR(31),           /* ADDRESS OF LOCAL SCHEDULE WITH           
*                                      STOKEN ROUTINE FOR ENABLED               
*                                      CALLERS. (IEAVESCB)       @L8A*/         
*     3 SVTLSCHC PTR(31),           /* ADDRESS OF LOCAL SCHEDULE WITH           
*                                      STOKEN ROUTINE FOR DISABLED              
*                                      CALLERS. (IEAVESCC)       @L8A*/         
*     3 SVTQV6   PTR(31),           /* ADDRESS OF SINGLE SPACE SINGLE           
*                                      LINKED QUEUE VERIFICATION                
*                                      ROUTINE.                  @L8A*/         
*     3 SVTESCD  PTR(31),           /* ADDRESS OF IEAVESCD, THE NEW             
*                                      SCHEDULE ENTRY POINT FOR FEATURE         
*                                      (ENABLED GLOBAL).         @06A*/         
*     3 SVTESCE  PTR(31),           /* ADDRESS OF IEAVESCE, THE NEW             
*                                      SCHEDULE ENTRY POINT FOR FEATURE         
*                                      (DISABLED GLOBAL).        @06A*/         
*     3 SVTESCF  PTR(31),           /* ADDRESS OF IEAVESCF, THE NEW             
*                                      SCHEDULE ENTRY POINT FOR FEATURE         
*                                      (ENABLED LOCAL).          @06A*/         
*     3 SVTESCG  PTR(31),           /* ADDRESS OF IEAVESCG, THE NEW             
*                                      SCHEDULE ENTRY POINT FOR FEATURE         
*                                      (DISABLED LOCAL).         @06A*/         
*     3 SVTCPUF  PTR(31),           /* ADDRESS OF IEAMCPUF SERVICE              
*                                      ROUTINE (IEAVCPUF).                      
*                                      OWNERSHIP: SUPERVISOR                    
*                                                 CONTROL.                      
*                                      SERIALIZATION: NONE.      @05A*/         
*     3 SVTERMF  PTR(31),           /* ADDRESS OF IEAMRMF3 SERVICE              
*                                      ROUTINE (IEAVERMF).                      
*                                      OWNERSHIP: SUPERVISOR                    
*                                                 CONTROL.                      
*                                      SERIALIZATION: NONE.      @06A*/         
*     3 SVTEFCN  PTR(31),           /* ADDRESS OF IEAMFCNT SERVICE              
*                                      ROUTINE (IEAVEFCN).                      
*                                      OWNERSHIP: SUPERVISOR                    
*                                                 CONTROL.                      
*                                      SERIALIZATION: NONE.      @06A*/         
*     3 SVTTWRM  PTR(31),           /* ADDRESS OF THE TAWQ WEB                  
*                                      ADDRESS SPACE                            
*                                      RESOURCE MANAGER ROUTINE                 
*                                      (IEAVTWRM).                              
*                                      OWNERSHIP: SUPERVISOR                    
*                                                 CONTROL.                      
*                                      SERIALIZATION: NONE.      @LBA*/         
*     3 SVTCPTM FIXED(32),          /* Count down timer start value             
*                                                                @07A*/         
*     3 SVTTODDL FIXED(32),         /* TOD time to check for SIGP@07A*/         
*   2 * CHAR(84) BDY(DWORD,5),                                /* @MWC*/         
*%IF SYSVERSION = '' %THEN %GOTO SVT2A4;                      /* @MDA*/         
*%IF SYSRULESMOD='PL/S-III ' %THEN  %GOTO SVT2A4;             /* @MDA*/         
*     3 SVTMcesaVT Ptr(31),           /* Address of MCESA VT,                   
*                                   each entry of which is the virtual          
*                                   address of the online processor's           
*                                   MCESA (0 if not online)      @LFA*/         
*       5 SVTZ1 PTR(31),            /*                           @MWA*/         
*     3 SVT_entitle_overrun_limit Char(8),                    /* @MDA*/         
*       5 SVT_entitle_overrun Bit(1),                         /* @MDA*/         
*     3 SVT_accum_entitle_CR_earned(2) Char(8) Bdy(Dword),    /* @MDC*/         
*     3 SVTR298 Char(48),           /* Reserved, do not use      @MDA*/         
*     3 SVT_entitle_overrun_limit_count Char(8) Bdy(Dword),   /* @MDA*/         
*%SVT2A4:;                                                    /* @MDA*/         
*                                                        /*    10@LOD*/         
*   2 * CHAR(24),                                        /*      @DPC*/         
*                                                        /*    10@LOD*/         
*   2 * CHAR(24),                                             /* @DPA*/         
*%IF SYSVERSION = '' %THEN %GOTO SVT300;                      /* @11C*/         
*%IF SYSRULESMOD='PL/S-III ' %THEN  %GOTO SVT300;             /* @11C*/         
*     3 SVT_Diag2E8 Char(24),       /* Diagnostic data for IBM use              
*                                      only                      @DPA*/         
*%SVT300:;                                                    /* @11C*/         
*   2 SVTR300 CHAR(72) BDY(DWORD),  /*                           @11C*/         
* %IF SVT_CPUDUALPATH='YES' %THEN                             /* @M3A*/         
* %GOTO SVTPLS98;                                             /* @M3A*/         
* /*                                                                            
*  These will be removed in a future release, when the old fields               
*  will no longer be supported.  Use the new pointers exclusively               
*  to access fields for code being run on HBB7760 and higher     @LAA*/         
*%IF SYSVERSION = '' %THEN %GOTO SVTPLS4;  /* PL/S or PL/X ?     @LJA*/         
*%IF SYSRULESMOD='PL/S-III ' %THEN %GOTO SVTPLS4;             /* @M3C*/         
*     3 SVT_CPUS_CAUSING_SPIN_OLD(0:63) BIT(8), /* CPUs causing                 
*                                      excessive spin.                          
*                                      OWNERSHIP     - RECONFIGURATION.         
*                                      SERIALIZATION - DISABLEMENT.             
*                                                                @M3C*/         
*                                                             /*5@M3D*/         
*     3 SVT_WAITING_PROCESSOR_MASK BIT(64), /* Waiting Processor                
*                                      bit mask. Each bit position              
*                                      corresponds to a CPU address.            
*                                      OWNERSHIP - SUPERVISOR CONTROL           
*                                      SERIALIZATION - COMPARE AND              
*                                      SWAP.                     @0DC*/         
*       4 SVT_WAITING_PROCESSOR_MASK0TO31 BIT(32), /*            @0DC*/         
*       4 SVT_WAITING_PROCESSOR_MASK32TO63 BIT(32), /*           @0DC*/         
*%SVTPLS4:;                         /* end for PL/X compiler     @0DA*/         
* /*                                                                            
*  End of fields that will be removed in a future release        @M3A*/         
* %SVTPLS98:;                                                 /* @M3A*/         
*   2 SVTC9ST1 PTR(31),             /* ADDRESS OF CMSET SET                     
*                                      ROUTINE, IEAVCMS1.        @LKA*/         
*   2 SVTC9ST2 PTR(31),             /* Address of CMSET SET,DIE=YES             
*                                      routine.                  @LKA*/         
*   2 SVTC9RT1 PTR(31),             /* ADDRESS OF CMSET RESET                   
*                                      CHKAUTH(YES) ROUTINE,                    
*                                      IEAVCMR1.                 @LKA*/         
*   2 SVTC9RT2 PTR(31),             /* ADDRESS OF CMSET RESET                   
*                                      CHKAUTH(NO) ROUTINE,                     
*                                      IEAVCMR2.                 @LKA*/         
*   2 SVTC9RT3 PTR(31),             /* Address of CMSET RESET,                  
*                                      CHKAUTH=YES,DIE=YES routine.             
*                                                                @LKA*/         
*   2 SVTC9RT4 PTR(31),             /* Address of CMSET RESET,                  
*                                      CHKAUTH=NO,DIE=YES routine.              
*                                                                @LKA*/         
*   2 SVTC9STR PTR(31),             /* ADDRESS OF CMSET SSARTO                  
*                                      ROUTINE, IEAVCMST.        @LKA*/         
*   2 SVTC9SBR PTR(31),             /* ADDRESS OF CMSET                         
*                                      SSARBACK ROUTINE,                        
*                                      IEAVCMSB.                 @LKA*/         
*   2 SVTASWUQ PTR(31),             /* IFA processor System WUQ                 
*                                      header address                           
*                                      SERIALIZATION: WEB Lock Protocol         
*                                      OWNERSHIP: Supervisor Control            
*                                                                @H3C*/         
*   2 SVTSWUQA PTR(31)              /* SVTSWUQ or SVTASWUQ.                     
*                                      The latter only if there are             
*                                      special processors configured.           
*                                                                @H3A*/         
*%IF SYSVERSION = '' %THEN          /*                           @P5A*/         
*    %GOTO SVT13;                   /*                           @P5A*/         
*%IF SYSRULESMOD='PL/S-III ' %THEN                            /* @P5A*/         
*    %GOTO SVT13;                   /*                           @P5A*/         
*  ,2 SVTIFAFlags BIT(8),           /* Processor Flags - not just IFAs          
*                                                                @H4C*/         
*    3 SVT_Disp_IFACrossoverOK BIT(1), /*                        @P5M*/         
*    3 SVT_IFASwitchImmediate BIT(1),  /*                        @P5M*/         
*    3 SVT_IFAInConfiguration BIT(1),  /*                        @P5M*/         
*      5 SVT_ByLPAR_zCBPInConfiguration BIT(1), /* zCBPs are                    
*                                     installed or could be installed           
*                                     by dynamic CPU addition. The              
*                                     zCBPs could be online or offline.         
*                                                                @NBA*/         
*        7 SVT_ByLPAR_IFAInConfiguration BIT(1), /*              @NBC*/         
*          9 SVT_ByLPAR_zAAPInConfiguration BIT(1), /* zAAPs are                
*                                     installed or could be installed           
*                                     by dynamic CPU addition. The              
*                                     zAAPs could be online or offline.         
*                                                                @NBC*/         
*    3 SVT_Disp_zCBPCrossoverHP BIT(1), /*                       @NBA*/         
*      5 SVT_Disp_IFACrossoverHP BIT(1), /*                      @NBC*/         
*    3 SVT_CPUProjection      BIT(1),  /* Project the CPU usage for             
*                                         both IFAs and SUPs     @H4A*/         
*    3 SVT_SUPInConfiguration BIT(1), /* zIIPs are installed or could           
*                                     be installed by dynamic CPU               
*                                     addition. The zIIPs could be              
*                                     online or offline.         @H5A*/         
*      4 SVT_ByLPAR_SUPInConfiguration BIT(1),                /* @H5A*/         
*        5 SVT_ByLPAR_zIIPInConfiguration BIT(1),             /* @H5A*/         
*    3 SVT_Disp_zIIPHonorPriority BIT(1),/* Honor Priority is enabled           
*                                         for zIIPs              @NBA*/         
*      5 SVT_Disp_SUPHonorPriority BIT(1),/* same as                            
*                                     SVT_Disp_zIIPHonorPriority @NBC*/         
*    3 SVTIfaFLags_Rsvd Bit(1),     /* Reserved, do not use      @H5A*/         
*   2 SVTDiag371 BIT(8),            /* Diagnostic for IBM use only              
*                                                                @NBC*/         
*   2 SVTHDFlags1 BIT(8) ABNORMAL,  /* Flags for HD related                     
*                                      information                              
*                                      SERIALIZATION - CS.       @MKC*/         
*    3 SVTVCMFlags BIT(8) ABNORMAL, /* Flags for VCM related                    
*                                      information                              
*                                      SERIALIZATION - CS.       @PTA*/         
*     4 SVTVCMBeenActivated BIT(1), /* On when HD transition has                
*                                      occurred                  @PTA*/         
*     4 SvtVcmAcrUnpark     Bit(1), /* On when IEAVTACR is unparking            
*                                      processors as a result of ACR            
*                                      running.                  @PVA*/         
*     4 SvtVcmEgrForceNonAff Bit(1), /* When on IEAVEGR must rebuild            
*                                      for non-affinity mode. IEAVEGR           
*                      assumes this is set only by IEAVMPWQ      @PWA*/         
*     4 SvtVcmInDegradedState Bit(1), /* When on, HD is running in a            
*                                      degraded state because WLM               
*                                      passed a MPWQ parameter list             
*                                      with only discretionary CPs.             
*                                      This is a transient                      
*                                      condition until the next                 
*                                      topology change occurs.   @0IA*/         
*     4 SVTHDInTransition Bit(1),   /* When on, the system is switching         
*                                      from HiperDispatch=YES!NO to             
*                                      HiperDispatch=NO!YES.     @PXA*/         
*     4 SVT_HDNoCPUOverride Bit(1),                      /*      @MCA*/         
*     4 SVTHDFlags_Rsvd     Bit(1), /* Reserved, do not use      @MKC*/         
*     4 SVT_WarningTrackReg Bit(1), /* System has successfully                  
*                                      registered for warning track             
*                                      interrupts                @MOA*/         
*   2 SVT_zIIPzAAP_Flags CHAR(1) ABNORMAL,  /* More zIIP/zAAP flags             
*                      Serialization: CS                                        
*                      Owner: Supervisor                         @M4A*/         
*     3 SVT_ByLPAR_zIIP_NowInstalled BIT(1), /* There currently is              
*                      at least one zIIP installed. It need not be              
*                      online. This bit may change from "off" to                
*                      "on" during the life of the IPL           @M4A*/         
*     3 SVT_ByLPAR_zCBP_NowInstalled BIT(1), /* There currently is              
*                      at least one zCBP installed. It need not be              
*                      online. This bit may change from "off" to                
*                      "on" during the life of the IPL           @NBA*/         
*       5 SVT_ByLPAR_zAAP_NowInstalled BIT(1), /* There currently is            
*                      at least one zAAP installed. It need not be              
*                      online. This bit may change from "off" to                
*                      "on" during the life of the IPL           @NBC*/         
*     3 SVT_zAAP_On_zIIP Bit(1),      /* When 1, zAAPzIIP=YES was               
*                      specified or defaulted via IEASYSxx                      
*                      and is still in effect                    @M6A*/         
*     3 SVT_ProcType2or5NowInstalled Bit(1), /*                                 
*                      Encountered a processor type                             
*                      of 2 (zAAP) or 5 (zIIP) within the recognized            
*                      processor info                            @MFA*/         
*     3 SVT_ZZ_Off_Too_Many_Machine_ZZs Bit(1),  /* When 1, zAAP on             
*                      zIIP was deactivated since there are more                
*                      zAAPs+zIIPs than CPs on the machine       @MQC*/         
*       5 SVT_ZZ_Off_zAAP_On_Machine Bit(1), /* Same as previous     */         
*     3 SVT_ZZ_Off_Info_Unavail Bit(1),     /* When 1, zAAP on zIIP             
*                      was deactivated since there are no zIIPs and             
*                      dynamic CPU addition is not enabled       @MHA*/         
*     3 SVT_ZZ_Off_No_zIIPs Bit(1),         /* When 1, zAAP on zIIP             
*                      was deactivated since there are no zIIPs and             
*                      dynamic CPU addition is not enabled so                   
*                      that no zIIPs can be added after IPL      @MHA*/         
*   2 SVT_DeferSwitchFrom_Pct_Lim Fixed(15) Unsigned,  /* No deferral           
*                                      if use of zAAP exceeds this              
*                                      percent                   @M8A*/         
*   2 * ,                           /* Constants for 'too many SRBs'            
*                                                                @M7A*/         
*     3 SvtPromoteTrigger fixed(15), /* When this many WEBs with the            
*                                      same 3-byte priority and same            
*                                      WebPriorityID have been                  
*                                      skipped, consider promoting              
*                                      this WEB.                 @M7A*/         
*     3 SvtTurnOnPromotionTrigger fixed(15), /* When this many WEBs             
*                                      with the same 3-byte priority            
*                                      and same WebPriorityID have              
*                                      been skipped, turn on                    
*                                      promotion.                @M7A*/         
*     3 SvtInitialPromotionCount fixed(15), /* The number of WEBs to            
*                                      promote when turning on                  
*                                      promotion.                @M7A*/         
*   2 SVT_IEAVIFAP PTR(31),         /*                           @LMA*/         
*   2 SVT_PRIORITY_RANGES_Area,                               /* @0VA*/         
*    3 SVT_PRIORITY_RANGES(3) FIXED(8), /* Priority range end for high,         
*                                      medium, and low priorities               
*                                      Owner: SRM                @0VC*/         
*   2 SVT_Trickle_Priority FIXED(8), /* Trickle Promotion priority              
*                                      Owner: SRM                @LRC*/         
*   2 SVT_PRIORITY_INDEXES(4) FIXED(8), /* Round robin priority based           
*                                      indexes for supervisor work              
*                                      assignment                @LNA*/         
*   2 SVT_Generic_Help_Token Fixed(32), /* Token used to indicate that          
*                                      an affinity node needs generic           
*                                      help                      @LNA*/         
*   2 SVT_Generic_Help_Limit Fixed(15), /* Help count where generic             
*                                      help should be requested  @LNA*/         
*   2 SvtLogicalCpuGoingOffline Fixed(15), /*                                   
*                                      The logical CPU id which is              
*                                      going offline while the CPU              
*                                      it represents is on in                   
*                                      CSD_CPU_Alive.  One this logical         
*                                      CPU is removed from                      
*                                      CSD_CPU_Alive, this value                
*                                      will contain the last                    
*                                      logical CPU id which has                 
*                                      gone offline.                            
*                                      Serialization: SYSZVARY.CPU ENQ          
*                                      and dispatcher lock       @0IA*/         
*   2 SVTHELP_SUP FIXED(32),        /* SUP Help count - updated in              
*                                      IEAVEJST                  @H4A*/         
*   2 SVTHELP_SUPQ FIXED(32),       /* SUP Need help -                          
*                                      queue length              @H4A*/         
*   2 SVT_zIIPAWMT_Count_Timer FIXED(32), /* zIIP AWMT Count Down Timer         
*                                         Analog of SVTCPTM                     
*                                         OWNERSHIP: SRM         @NBA*/         
*     4 SVT_SupAWMT_Count_Timer FIXED(32), /* SUP AWMT Count Down Timer         
*                                         Analog of SVTCPTM                     
*                                         OWNERSHIP: SRM         @H4A*/         
*   2 SVT_zIIPAWMT_Elapsed_Timer FIXED(32),/* zIIP AWMT Elapsed Timer           
*                                         Analog of SVTTODDL                    
*                                         OWNERSHIP: SRM         @NBA*/         
*     4 SVT_SupAWMT_Elapsed_Timer FIXED(32),/* SUP AWMT Elapsed Timer           
*                                         Analog of SVTTODDL                    
*                                         OWNERSHIP: SRM         @H4A*/         
*   2 SVTSWUQS PTR(31),             /* SVTSWUQ or SVTSSWUQ.                     
*                                      The latter only if there are             
*                                      SUP processors configured.               
*                                                                @H4A*/         
*   2 SVTSSWUQ PTR(31),             /* SUP processor System WUQ                 
*                                      header address                           
*                                      SERIALIZATION: WEB Lock Protocol         
*                                      OWNERSHIP: Supervisor Control            
*                                                                @H4C*/         
*   2 SVT_zCBPAWMT_Count_Timer FIXED(32), /* zCBP AWMT Count Down Timer         
*                                         Analog of SVTCPTM                     
*                                         OWNERSHIP: SRM         @NBA*/         
*     4 SVT_IFAAWMT_Count_Timer FIXED(32), /* IFA AWMT Count Down Timer         
*                                         Analog of SVTCPTM                     
*                                         OWNERSHIP: SRM         @NBC*/         
*   2 SVT_zCBPAWMT_Elapsed_Timer FIXED(32),/* zCBP AWMT Elapsed Timer           
*                                         Analog of SVTTODDL                    
*                                         OWNERSHIP: SRM         @NBA*/         
*     4 SVT_IFAAWMT_Elapsed_Timer FIXED(32),/* IFA AWMT Elapsed Timer           
*                                         Analog of SVTTODDL                    
*                                         OWNERSHIP: SRM         @NBC*/         
*   2 SVTR3B0 CHAR(6) BDY(WORD),    /*                           @M3C*/         
* %IF SVT_CPUDUALPATH='YES' %THEN                             /* @M3A*/         
* %GOTO SVTPLS97;                                             /* @M3A*/         
* /*                                                                            
*  These will be removed in a future release, when the old fields               
*  will no longer be supported.  Use the new pointers exclusively               
*  to access fields for code being run on HBB7760 and higher     @LAA*/         
*   3 SVT_short_wait_CPUPA_Old FIXED(16), /* Physical addr of last CP           
*                                     to wait with a short slice @0HA*/         
*   3 SVT_short_wait_IFAPA FIXED(16), /* Physical addr of last IFA              
*                                     to wait with a short slice @0HA*/         
*   3 SVT_short_wait_SUPPA FIXED(16), /* Physical addr of last SUP              
*                                     to wait with a short slice @0HA*/         
* /*                                                                            
*  End of fields that will be removed in a future release        @M3A*/         
* %SVTPLS97:;                                                 /* @M3A*/         
*   2 SVTMFLGS  CHAR(1) ABNORMAL,     /* Miscellaneous flags                    
*                                        Serialization: CS       @MCC*/         
*     3 SVTD308   Bit(1),             /* DIAGNOSE 308 supported                 
*                                        SERIALIZATION: set during              
*                                        NIP                     @M1A*/         
*     3 SVT_CPUG64_NowInstalled Bit(1),   /*CPU id greater than 64 is           
*                                           installed now        @MCA*/         
*     3 SVTMFLGS_Diag Bit(1),         /* Diagnostic for IBM use only            
*                                                                @MMA*/         
*   2 SVT_CML_promotion_prty Fixed(8),/* Priority giving to the WEB             
*                                      with a lower priority when CML           
*                                      promotion occurs.                        
*                                      Note there is code that                  
*                                      depends on this priority to be           
*                                      FFx (like IEAVEEXT)       @LVC*/         
*   2 SVT_BASE_PERCENT_CALC_TIME CHAR(8), /* Base time used to                  
*                                      calculate the percentage values          
*                                      OWNERSHIP: SRM            @LQA*/         
*   2 SVT_Trickle_Time CHAR(4),     /* Low 32 bits of 64-bit                    
*                                      STCK-format time to be given to          
*                                      a trickled work unit      @LUA*/         
*   2 SVT_Tiny_ND_CPUs_Short_Minor Fixed(16), /* The length of a                
*                                      short minor timeslice in mics            
*                                      for a processor class with               
*                                      a tiny number of                         
*                                      non-discretionary CPUs                   
*                                      OWNERSHIP: SRM                           
*                                      Serialization: None       @0MA*/         
*   2 SVT_Not_Tiny_ND_CPUs_Short_Minor Fixed(16), /* The length of a            
*                                      short minor timeslice in mics            
*                                      for a processor class without            
*                                      a tiny number of                         
*                                      non-discretionary CPUs                   
*                                      OWNERSHIP: SRM                           
*                                      Serialization: None       @0MA*/         
*   2 SVT_Entitlement Bdy(Dword)               /*                               
*                                      Entitlement information   @0JA*/         
*  ,5 Svt_Accum_Entitle_Earned_Redeposited Char(8)            /* @0JA*/         
*  ,5 SVT_accum_entitle_values       /* This must be on a quadword              
*                                boundary                        @0JA*/         
*    ,7 SVT_accum_entitle_earned Char(8)        /*               @0JA*/         
*    ,7 SVT_accum_entitle_consumed Char(8)      /*               @0JA*/         
*  ,5 SVT_accum_entitle_base_values  /* This must be on a quadword              
*                                boundary                        @0JA*/         
*    ,7 SVT_accum_entitle_earned_base Char(8)   /*               @0JA*/         
*    ,7 SVT_accum_entitle_consumed_base Char(8)  /*              @0JA*/         
*  ,5 SVT_entitlement_percent FIXED(31)         /*               @0JA*/         
*    ,7 * Char(3)                               /*               @0JA*/         
*    ,7 SVT_entitlement_percent_Byte3 Fixed(8)  /*               @0JA*/         
*  ,5 SVT_entitlement_withdrawal FIXED(31)  /* amount of consumed               
*                              to withdraw for a zIIP to use     @0JA*/         
*  ,5 SVT_entitlement_suff_join_help FIXED(31) /* withdrawal amount             
*                  for a zIIP to start helping                   @0JA*/         
*  ,5 SVT_entitlement_suff_wakeup FIXED(31) /* withdrawal amount                
*                    to wake up a zIIP to start helping          @0JA*/         
*  ,2 SVT_ROBLOCK_400 CHAR(256) BDY(DWORD) /* Primarily readonly block          
*                                                                @M5A*/         
*    ,5 SVTCR_Word Char(4) Abnormal /* Serialization: Compare and               
*                                      swap                      @MDA*/         
*      ,7 SVTCR Bit(8)                                        /* @MDA*/         
*      ,7 SVTR401 Char(2)                                     /* @MDA*/         
*      ,7 SVTCR_Misc Char(1)                                  /* @MDA*/         
*        ,9 SVTHDCPR Bit(1)                                   /* @MDA*/         
*        ,9 SVTLGACT Bit(1)                                   /* @MDA*/         
*        ,9 * Bit(2)                                          /* @0YA*/         
*        ,9 SVTSWCPR Bit(1)                                   /* @0YA*/         
*        ,9 SVTHWCPR Bit(1)                                   /* @0YA*/         
*        ,9 SVTKeepLgAct Bit(1)                               /* @0ZA*/         
*        ,9 SVTZBA Bit(1)                                     /* @0ZA*/         
*    ,5 SVT_Reluctant_Help_Start Fixed(16) /* The initial countdown             
*                                      value for when a CPU is                  
*                                      reluctantly helping another CPU          
*                                                                @MDA*/         
*    ,5 SVTCR_Flags Bit(8) Abnormal /* Serialization CS          @0SA*/         
*      ,7 SVTCR_Flags_TempPriWUQHPWUQ Bit(1) /* Indicates the system            
*                                      was forced to use a primary WUQ          
*                                      of the HPWUQ temporarily  @0SA*/         
*      ,7 SVTCR_Flags_Rsvd Bit(1)   /* Reserved for IBM use only @0UA*/         
*    ,5 SVTHDFlags2 Bit(8) Abnormal /* HiperDispatch flags byte 2               
*                                      Serialization: CS         @MKA*/         
*     ,7 Svt_SrbEnclaveRQM Bit(1) Abnormal /* Enclave SRB ready queue           
*                                      management (RQM) must be done            
*                                      when the system is in HD=YES.            
*                                                                @MKA*/         
*     ,7 Svt_IsOrWasSrbEnclaveRQM Bit(1) Abnormal /* Enclave SRB ready          
*                                      queue management (RQM) was               
*                                      done at some point during the            
*                                      life of the system        @MKA*/         
*     ,7 SvtEgrNoActiveHdWUQs Bit(1) /* When on, global recovery had to         
*                                      rebuild the WUQs for HD=Y, but           
*                                      found no active HD=Y WUQs to             
*                                      queue work                @0TA*/         
*     ,7 * Bit(1)                   /* Reserved                  @N8C*/         
*     ,7 SvtHdFlags2_Rsvd Bit(3)    /* Reserved for IBM use only @NAC*/         
*    ,5 SVT_WUQH_WEE_Header PTR(31) /* First WEE in WUQH WEE pool.              
*                                      Used for verifying the queue in          
*                                      global recovery.          @M2A*/         
*    ,5 SVTCPUD PTR(31)             /* Pointer to CPU Dependent Area            
*                                                                @M5M*/         
*    ,5 SVT_WAITING_PROCESSOR_MASK_ADDR PTR(31)  /* Address of Waiting          
*                                      Processor bit mask. Points to a          
*                                      mask that represents all                 
*                                      online CPUs that are in a wait           
*                                      in a non MT environment.  @0UC*/         
*      ,7 SVT_CORE_WAIT_CPUMASK_ADDR Ptr(31) /* Address of Waiting              
*                                      Core CPU bit mask. When                  
*                                      PROCVIEW=CORE and HW supports            
*                                      MT, this points to a mask that           
*                                      represents all online cores that         
*                                      are in a wait.            @0UA*/         
*                                   /* Common comment: Each bit                 
*                                      position corresponds to a CPU            
*                                      address. Points to a bitmask             
*                                      on a double word boundary (for           
*                                      compare and swap) that is                
*                                      ECVTMaxMPNumBytesInMask bytes            
*                                      long where the first                     
*                                      (CVTMAXMP+1) bits are valid.             
*                                      OWNERSHIP - SUPERVISOR CONTROL           
*                                      SERIALIZATION - COMPARE AND              
*                                      SWAP on the bitmask.      @0UM*/         
*    ,5 SVT_CPUS_CAUSING_SPIN_ADDR PTR(31) /* Address to an array where         
*                                      each entry is the logical ID of          
*                                      the CPU causing causing                  
*                                      excessive spin for that CPU. The         
*                                      number of entries in the array           
*                                      is (CVTMAXMP+1), or 1 entry for          
*                                      each CPU.  Mapped by                     
*                                      SVT_CPUS_CAUSING_SPIN.                   
*                                      SERIALIZATION - DISABLEMENT.             
*                                                                @M3C*/         
*    ,5 SVTR418 Ptr(31) BDY(WORD)   /* Was SVTWAS_Addr which was an             
*                                      address to an array, each                
*                                      entry being 1 byte where the             
*                                      value is either '00'x or 'FF'x.          
*                                      'FF'x means there is a pending           
*                                      SIGP memory switch for that CPU          
*                                      entry. The number of entries in          
*                                      in the is (CVTMAXMP+1), or 1             
*                                      entry for each CPU.  Must                
*                                      remain 0.  Do not reuse.  @MMC*/         
*    ,5 SVT_short_wait_CPUPA_ADDR PTR(31)  /* Address to an array where         
*                                      each entry is the physical ID of         
*                                      the last standard CP to wait             
*                                      with a short slice in its 64 bit         
*                                      CPU block.  There are only 2             
*                                      entries in this array and each           
*                                      entry is 2 bytes.                        
*                                      Mapped by SVT_short_wait_CPUPA           
*                                                                @MMC*/         
*    ,5 SVT_zCBPMAXQL Fixed(15)     /* The maximum number of WEBs 1             
*                                      zCBP can dispatch in a                   
*                                      timely fashion.                          
*                                      Serialization: NONE                      
*                                      Ownership: Supervisor/SRM @NBA*/         
*      ,7 SVT_zAAPMAXQL Fixed(15)   /* The maximum number of WEBs 1             
*                                      zAAP can dispatch in a                   
*                                      timely fashion.                          
*                                      Serialization: NONE                      
*                                      Ownership: Supervisor/SRM @NBC*/         
*    ,5 SVT_zCBPMINHL Fixed(15)     /* When a zCBP chooses another CPU          
*                                      for help, the minimum number of          
*                                      dispatches which will be done            
*                                      for help.                                
*                                      Serialization: NONE                      
*                                      Ownership: Supervisor/SRM @NBA*/         
*      ,7 SVT_zAAPMINHL Fixed(15)   /* When a zAAP chooses another CPU          
*                                      for help, the minimum number of          
*                                      dispatches which will be done            
*                                      for help.                                
*                                      Serialization: NONE                      
*                                      Ownership: Supervisor/SRM @NBC*/         
*    ,5 SVT_zIIPMAXQL Fixed(15)     /* The maximum number of WEBs 1             
*                                      zIIP can dispatch in a                   
*                                      timely fashion.                          
*                                      Serialization: NONE                      
*                                      Ownership: Supervisor/SRM @MEA*/         
*    ,5 SVT_zIIPMINHL Fixed(15)     /* When a zIIP chooses another CPU          
*                                      for help, the minimum number of          
*                                      dispatches which will be done            
*                                      for help.                                
*                                      Serialization: NONE                      
*                                      Ownership: Supervisor/SRM @MEA*/         
*    ,5 SVT_SuperSlice CHAR(5)      /* Super slice block         @PZM*/         
*      ,7 SVT_SuperSlice_Qualifier_Low CHAR(2) /* Low bound priority            
*                                      that qualifies for a super               
*                                      slice, inclusive.                        
*                                      Serialization: NONE                      
*                                      Ownership: SRM            @MBA*/         
*      ,7 SVT_SuperSlice_Qualifier_High CHAR(2) /* High bound priority          
*                                      that qualifies for a super               
*                                      slice, inclusive.                        
*                                      Serialization: NONE                      
*                                      Ownership: SRM            @MBA*/         
*      ,7 SVT_SuperSlice_ExtraMajors FIXED(8) /* The number of major            
*                                      time slices that make up a               
*                                      super slice                              
*                                      Serialization: NONE                      
*                                      Ownership: SRM            @MBA*/         
*    ,5 SVT_SubBucket_Ranges_Area   /*                           @0WA*/         
*      ,7 SVT_SubBucket_Ranges(3) FIXED(8) /* Ranges of CPU consumption         
*                    percentages used to sub-divide HFTS priority               
*                    bucket output into sub buckets. Values represent           
*                    units of 0.5% CPU utilization, and range from 1 to         
*                    199 coresponding to 0.5% to 99.5%. For example 1 =         
*                    0.5%, 2 = 1.0%, 3 = 1.5% ....                              
*                                                                               
*                    SVT_SubBucket_Ranges(1) = 8 representing 4.0%,             
*                    SVT_SubBucket_Ranges(2) = 2 representing 1.0%,             
*                    SVT_SubBucket_Ranges(3) = 1 representing 0.5%.             
*                                                                @0WA*/         
*    ,5 SVTDiag2 Char(8)            /* Diagnostic data. This field is           
*                                      for IBM use only          @MGA*/         
*    ,5 SVT_PerfInstSp_Addr Ptr(31) /* Pointer to PerfInst_Sp in                
*                                      macro IHAPERFI.                          
*                                      Serialization: NONE                      
*                                      Ownership: Supervisor                    
*                                                                @MJA*/         
*    ,5 SvtLTodSigpGovCp Fixed(32) /* When the                                  
*                    system in HD=YES, this value is a low order TOD            
*                    that indicates how much time must pass between             
*                    SIGPs for CPs in the same affinity node.                   
*                    SvtLTodSigpGovCp is a percentage of                        
*                    SVTCPTM (can be greater than 100%).         @N7C*/         
*      ,7 SVT_HD_LTOD_Hi_Node_Sigp_Gov Fixed(32) /*                             
*                    When non-zero and the                                      
*                    system in HD=YES, this value is a low order TOD            
*                    that indicates how much time must pass between             
*                    SIGPs for CPs in the same affinity node.                   
*                    SVT_HD_LTOD_Hi_Node_Sigp_Gov is a percentage of            
*                    SVTCPTM (can be greater than 100%).  For                   
*                    zAAPs/zIIPs the governor is calculated by applying         
*                    the percent to SVT_IFAAWMT_COUNT_TIMER /                   
*                    SVT_SUPAWMT_COUNT_TIMER                     @0RC*/         
*    ,5 SVT_WUQA_RQM_MajCanSuppress Fixed(31) /* The number of major            
*                    task time slices IEAVWUQA will allow a unit of             
*                    work being affected by RQM to wait for access              
*                    to CPU.  How long a unit of work may wait                  
*                    for access to CPU is determined by wall clock              
*                    (not execution) time.                       @MKA*/         
*    ,5 SVT_WDI_RQM_LTOD_CanSuppress Fixed(32) /* The low order word of         
*                    a TOD that indicates how long IEAVEWDI will allow          
*                    a unit of work being affected by RQM to wait               
*                    for access to CPU.                          @MKA*/         
*    ,5 SVT_MajorTimeSlice Fixed(32) /* The low 32 bits of a 64-bit             
*                    STCK format time which represents the length of a          
*                    major task time slice                       @MKA*/         
*    ,5 SVTRNALD PTR(31)            /* Really Null Access List real             
*                    address. Bits 0-25 with 6 zeroes on the right              
*                    form the address. Bits 26-31 represent the number          
*                    of 128-byte access lists, minus one         @MRA*/         
*    ,5 SVTRNALV PTR(31)            /* Really Null Access List virtual          
*                                      address                   @MRA*/         
*%IF Translate(SVT_UsePsaDeclares) = 'YES' %Then              /* @MLA*/         
*  %SVT_ProcclassArrayBounds='PSAProcClass_CP:PSAMaxProcClassIndex'; /*         
*                                                                @0UC*/         
*%ELSE                                                        /* @MLA*/         
*  %SVT_ProcclassArrayBounds='0:2';                           /* @0UC*/         
*                                                                               
*    ,5 SVT_HdAnSMPerByProcClassArea                                            
*            Char(  Length(SVT_HdAnSMPerByProcClass)                            
*                 * (  HBound(SVT_HdAnSMPerByProcClass)                         
*                    - LBound(SVT_HdAnSMPerByProcClass)                         
*                    + 1                                                        
*                )  ) /* See SVT_HdAnSMPerByProcClass description               
*                                                                @MLA*/         
*      ,7 SVT_HdAnSMPerByProcClass(SVT_ProcclassArrayBounds)                    
*             Fixed(8) /* An array by                                           
*                    processor class index (0 to PSAMaxProcClassIndex)          
*                    that contains the percent of non-discretionary             
*                    CPUs per processor class per affinity node that            
*                    must be assigned a short minor              @0UC*/         
*    ,5 SVTR457 CHAR(1)             /* Reserved                  @MMA*/         
*    ,5 SVT_Diag458 Char(10) Bdy(Word) /* Diagnostic data for IBM               
*                                      use only                  @MMA*/         
*    ,5 SvtCoreFlgs Bit(8)                                                      
*      ,7 SvtProcAsCore Bit(1)      /* A processor resource is viewed           
*                                      as a CPU Core. This is                   
*                                      equivalent to the                        
*                                      CvtProcAsCore bit         @N5A*/         
*      ,7 SvtMultiCpusPerCore Bit(1) /* When SvtProcAsCore is on,               
*                    this indicates there are multiple CPUs defined             
*                    within a CPU Core (on MT capable hardware).                
*                    This is                                                    
*                    equivalent to the CvtMultiCpusPerCore bit   @0UA*/         
*      ,7 SvtCoreFlgs_Rsvd Bit(2)   /* For IBM use only.         @0UA*/         
*    ,5 SVTR463 CHAR(1)             /* Reserved (primarily readonly)            
*                                                                @0UA*/         
*    ,5 SvtCoreIdCpuIdShift Fixed(16) /* When SvtProcAsCore is on,              
*                    the number of bits to shift when converting                
*                    between a CPU Id and a CPU Core Id. When                   
*                    SvtProcAsCore is off, this will be set to 0 @0UA*/         
*    ,5 SvtCoreMode_Max  Fixed(16) /* When SvtProcAsCore is on,                 
*                    the maximum number of CPUs that can be used on             
*                    a CPU Core. When SvtProcAsCore is off, this                
*                    will be set to 1.                           @0UA*/         
*    ,5 * Union                                                                 
*      ,7 SvtCoreModeByProcClass(SVT_ProcclassArrayBounds) Fixed(16) /*         
*                    An array by                                                
*                    processor class index (0 to PSAMaxProcClassIndex)          
*                    that contains the MT mode.                  @0UA*/         
*      ,7 SvtCoreModeArea Char(  Length(SvtCoreModeByProcClass)                 
*                * (  HBound(SvtCoreModeByProcClass)                            
*                   - LBound(SvtCoreModeByProcClass)                            
*                   + 1                                                         
*               )  ) Bdy(HWord)                               /* @0UA*/         
*        ,9 SvtCoreMode_CP   Fixed(16) /* The number of CPUs that are           
*                    active on a CP Core.                                       
*                         1 <= SvtCoreMode_CP <= SvtCoreMode_Max @0UC*/         
*        ,9 SvtCoreMode_zCBP Fixed(16) /* The number of CPUs that               
*                    are active on a zCBP Core.                                 
*                         1 <= SvtCoreMode_zCBP<=SvtCoreMode_Max @NBA*/         
*          ,11 SvtCoreMode_zAAP Fixed(16) /* The number of CPUs that            
*                    are active on a zAAP Core.                                 
*                         1 <= SvtCoreMode_zAAP<=SvtCoreMode_Max @NBC*/         
*        ,9 SvtCoreMode_zIIP Fixed(16) /* The number of CPUs that are           
*                    active on a zIIP Core.                                     
*                         1 <= SvtCoreMode_zIIP<=SvtCoreMode_Max @0UC*/         
*    ,5 SVT_Diag46E Char(2) /* Diagnostic data for IBM use only  @10A*/         
*    ,5 SVT_Thread_Wait_CpuMask_Addr Ptr(31) /* The address of the              
*                                   thread wait CPU mask.  This                 
*                                   field is non-zero when                      
*                                   PROCVIEW CORE was specified on              
*                                   hardware that supports MT.                  
*                                   Otherwise this field is zero @0UA*/         
*    ,5 SVT_CoreVT_Addr Ptr(31)  /* The address of the                          
*                                   CORE vector table.  This                    
*                                   field is non-zero when                      
*                                   PROCVIEW CORE was specified on              
*                                   hardware that supports MT.                  
*                                   Otherwise this field is zero @0UA*/         
*    ,5 SvtCanCaptInstrCtrSTCK Char(8) Bdy(Dword) /* The STCK time of           
*                                      when the SvtCanCaptInstrCtr              
*                                      bit was last turned on    @MTA*/         
*    ,5 SVTInstrFlgs Char(4) Bdy(Word) Abnormal /* Instruction count            
*                                      related flags.                           
*                                      Serialization: CS         @MTA*/         
*      ,7 SvtCanCaptInstrCtr Bit(1) /* The instruction count can be             
*                                      collected.                @MTA*/         
*      ,7 SvtCaptInstrCtr Bit(1)    /* The installation wants to                
*                           collect instruction counts for SMFPRMxx             
*                           parameter SMF30COUNT                 @0WC*/         
*      ,7 SvtCaptHFTSCtrs Bit(1)    /* The installation wants to                
*                           collect counts for SMFPRMxx parmaeter               
*                           HFTSINTVL                            @0WA*/         
*      ,7 SvtHFTSExitActive Bit(1)  /* The Supervisor HFTS exit is              
*                                      active                    @NAA*/         
*    ,5 SVT_Diag484 CHAR(8)         /* Diagnostic data for IBM use              
*                                      only                      @MVA*/         
*    ,5 SVT_Diag48C CHAR(8)         /* Diagnostic data for IBM use              
*                                      only                      @N4A*/         
*    ,5 SVT_Diag494 CHAR(4)         /* Diagnostic data for IBM use              
*                                      only                      @0UA*/         
*    ,5 SvtCaptInstrCtrSTCK Char(8) Bdy(Dword) /* The STCK time of              
*                                      when the SvtCaptInstrCtr                 
*                                      bit was last turned on    @MUA*/         
*    ,5 SVT_CPEngineSpeed Fixed(31) /* Standard CP Engine Speed                 
*                                         (cycles per microsecond)              
*                                         When 0, the speed is not              
*                                         available              @0UA*/         
*    ,5 SVT_SpecialtyEngineSpeed Fixed(31) /* Specialty Engine Speed            
*                                         (cycles per microsecond)              
*                                         When 0, the speed is not              
*                                         available.             @0UA*/         
*    ,5 SVT_HisCounter_SeqNums Char(8) Bdy(DWord) /* Sequence numbers           
*                           to test validity of HIS counters     @0WA*/         
*      ,7 SVT_BasicCounter_SeqNum Fixed(32) /* Sequence number of               
*                           changes to the basic counter set.                   
*                           Incremented when basic counters turned on           
*                           or off. Also incremented when the basic             
*                           counters are requested for SMF30COUNT               
*                           (SvtCaptInstrCtr turned on or off) or               
*                           HFTSINTVL (SvtCaptHFTSCtrs turned on or             
*                           off)                                                
*                           SERIALIZATION: CS                                   
*                           OWNERSHIP: Supervisor Control        @0WA*/         
*      ,7 SVT_CaptHFTSCtrs_SeqNum Fixed(32) /* Sequence number of               
*                           changes to SvtCaptHFTSCtrs bit. Incremented         
*                           when collection of counters for HFTS is             
*                           enabled or disabled.                                
*                           SERIALIZATION: CS                                   
*                           OWNERSHIP: Supervisor Control        @0WA*/         
*    ,5 SVT_Diag4B0 Char(16)        /* Diagnostic data for IBM use              
*                                      only                      @0UA*/         
*    ,5 SVT_WindowIntervalMics Fixed(15) /* Minimum time before window          
*                                      can be opened in IEAMWIN                 
*                                      (in microseconds). For                   
*                                      zSphinx or later hardware.               
*                                      Value stored in microseconds so          
*                                      that window interval isn't               
*                                      greatly affected on an overlay           
*                                                                @0UA*/         
*    ,5 SvtNumCpuIDsInCore Fixed(16) /* The maximum number of CPUs              
*                    that can "fit" on a CPU Core. This doesn't mean            
*                    all of them can be active. This can be looked at           
*                    as how many IDs exist between thread 0 of two              
*                    contiguous cores.                                          
*                    When CvtProcAsCore is off, this will be 1.  @NAA*/         
*    ,5 SVTDEBL PTR(31)             /* Address of IEAVDEBL       @0XA*/         
*    ,5 SVTSSJS PTR(31)             /* Address of IEAVSSJS.                     
*                    See assembler definition for more info.                    
*                    Entry declare ENTRY_SSJS is provided below.                
*                    Use "CALL ENTRY_SSJS(SVTSSJS_SetSSJS)"      @NCC*/         
*    ,5 SVT_Diag4CC Char(4)         /* Diagnostic data for IBM use              
*                                      only                      @10C*/         
*    ,5 SvtLTodSigpGovzCBP Fixed(32) /* When the system is in HD=YES,           
*                    this value is a low order TOD that indicates how           
*                    much time must pass between SIGPs for zCBPs in the         
*                    same affinity node.  SvtLTodSigpGovzCBP is a               
*                    percentage of SVT_zCBPAWMT_COUNT_TIMER (can be             
*                    greater than 100%).                         @NBA*/         
*      ,7 SvtLTodSigpGovZaap Fixed(32) /* When the                              
*                    system is in HD=YES, this value is a low order TOD         
*                    that indicates how much time must pass between             
*                    SIGPs for zAAPs in the same affinity node.                 
*                    SvtLTodSigpGovZaap is a                                    
*                    percentage of SVT_IFAAWMT_COUNT_TIMER                      
*                    (can be greater than 100%).                 @NBC*/         
*    ,5 SvtLTodSigpGovZiip Fixed(32) /* When the                                
*                    system in HD=YES, this value is a low order TOD            
*                    that indicates how much time must pass between             
*                    SIGPs for zIIPs in the same affinity node.                 
*                    SvtLTodSigpGovZiip is a                                    
*                    percentage of SVT_SUPAWMT_COUNT_TIMER                      
*                    (can be greater than 100%).                 @N7C*/         
*    ,5 SvtMaskCpusPerCore Bit(64) Bdy(Dword) /* Left aligned mask of           
*                    CPUs that can "fit" on a core.  This doesn't mean          
*                    that all the CPUs can be active.  It can be                
*                    looked at as the mask of CPUs (1 bit per CPU)              
*                    between thread 0 of 2 contiguous cores.  When              
*                    CvtProcAsCore is off, this                                 
*                    mask will have the only leftmost bit on.    @NAA*/         
*    ,5 SVT_PreemptHPWUQIntvLTod Fixed(32) /* Preempt for HPWUQ                 
*                    interval - Time in TOD units in which the system           
*                    may keep work queued in the HPWUQ before it                
*                    can preempt executing work.                                
*                    Default 20 microseconds                     @NAA*/         
*    ,5 SVT_Diag4E4 Char(16) /* Diagnostic data for IBM use only @10C*/         
*                                                             /* @10D*/         
*    ,5 SVTCASTEL Fixed(31)                                   /* @0YA*/         
*    ,5 SVTUNALV PTR(31)                                      /* @0YA*/         
*    ,5 SVTUNALD PTR(31)                                      /* @0YA*/         
*  ,2 SVT_RWBLOCK_500 CHAR(256) BDY(DWORD) /* read-write block   @MGA*/         
*    ,5 SVT_Diag500 Char(128)       /* Diagnostic data. This field is           
*                                      for IBM use only          @MSC*/         
*    ,5 SvtSrbIdSeq# bit(64) bdy(dword) /* System-wide wrapping counter         
*                                      used to create an SrbIdToken             
*                                      SERIALIZATION: CSG                       
*                                      OWNERSHIP: Supervisor Control            
*                                                                @MMA*/         
*    ,5 SVT_TOD_ExtractCoreCtrs Char(8) Bdy(Dword)          /*                  
*                                   Time (set by HISNTIMR) after                
*                                   which core counters can be                  
*                                   extracted by IEAVEJST        @0UA*/         
*    ,5 SVTCoreModeTransition Fixed(31) Unsigned /* This word is used           
*                                   to indicate to recovery that a              
*                                   Core or CoreMode Transition is in           
*                                   progress or has occurred.                   
*                                   Serialized by CS.            @0UA*/         
*      ,7 SVTCoreModeTransition_ReconfigFlags Bit(8)  /*                        
*                                   Flags related to reconfiguration            
*                                   processing.                  @0UA*/         
*         ,9 SvtCoreModeTransition_Active Bit(1) /*                             
*                                   Indicates that a Core or CoreMode           
*                                   reconfiguration is in progress.             
*                                   This bit should only be turned ON           
*                                   when SYSZVARY.CPU is ENQueued. Not          
*                                   abnormal because the bit is set             
*                                   ON/OFF using CS on the                      
*                                   SvtCoreModeTransition word.  @0UA*/         
*         ,9 SVTCoreModeTransition_ReconfigError Bit(1) /*                      
*                                   Indicates that reconfiguration              
*                                   processing had an error.  This bit          
*                                   is turned ON to tell IEAVELCR not           
*                                   to collect doc because it was               
*                                   already collected as part of                
*                                   reconfiguration error recovery. Not         
*                                   abnormal because the bit is set             
*                                   ON/OFF using CS on the                      
*                                   SvtCoreModeTransition word.                 
*                                   recovery.                    @0UA*/         
*      ,7 SVTR591 CHAR(1)           /* Reserved                  @0UA*/         
*      ,7 SvtCoreModeTransition_Seq# Fixed(16) /* Current                       
*                                   sequence number.             @0UA*/         
*    ,5 SVTCoreModeSeqNum_CP Fixed(32) /*                                       
*                                   Sequence number for each procclass.         
*                                   It is incremented by IEEVCPR when           
*                                   MT mode of a procclass is changed.          
*                                   Serialization: SYSZVARY.CPU ENQ             
*                                   obtained by IEECB927.        @0UA*/         
*    ,5 SVTCoreModeSeqNum_zCBP Fixed(32) /* See description for                 
*                                   SVTCoreModeSeqNum_CP         @NBA*/         
*      ,7 SVTCoreModeSeqNum_zAAP Fixed(32) /* See description for               
*                                   SVTCoreModeSeqNum_CP         @NBC*/         
*    ,5 SVTCoreModeSeqNum_zIIP Fixed(32) /* See description for                 
*                                   SVTCoreModeSeqNum_CP         @0UA*/         
*    ,5 SVTR5A0 Char(92)            /* Reserved (read-write)     @11C*/         
*    ,5 SVTVBAA PTR(31)           /* Validated Boot Area Address.               
*                          0: VB not done. No VBA                               
*                         <0: VB not active any longer. VBA exists              
*                         >0: VB active. VBA exists              @11A*/         
*      ,7 SVTVBAA_posneg Fixed(31) /* Can use this declare to see if            
*                          VB was in effect but no longer is, by                
*                          checking for <= 0. Do not use SVTVBAA                
*                          for such a check (since it's a pointer,              
*                          the compiler might do a logical compare              
*                          which would not give the desired result)             
*                                                                @11A*/         
*        ,9 SVTVBA_Inactive Bit(1) /* When on, VBA exists, but VB               
*                           activity is no longer ongoing        @11A*/         
*%SVT13:;                           /*                           @P5A*/         
*  ,2 SVTEND CHAR(0) BDY(DWORD);    /* END OF SVT.               @M2C*/         
*                                                                               
*%IF SYSVERSION = '' %THEN          /*                           @LIA*/         
*    %GOTO SVT09;                   /*                           @LIA*/         
*%IF SYSRULESMOD='PL/S-III ' %THEN                            /* @LIA*/         
*    %GOTO SVT09;                   /*                           @LIA*/         
* DCL MCESA Char(2048) Based Bdy(Dword);                      /* @N9C*/         
* DCL MCESAVT(*) PTR(31) Based(SVTMCESAVT);  /* Virtual address of              
*                              each online processor's MCESA.                   
*                              Obtained by IEAVNIP0, IEEVCPRA.   @LFA*/         
*DCL SVT_CPUS_CAUSING_SPIN(0:*)                                                 
*           BASED(SVT_CPUS_CAUSING_SPIN_ADDR) FIXED(16); /* Based               
*                                      structure for cpu array   @M3A*/         
*                                                            /* 2@MMD*/         
*DCL SVTAL#rsv Constant(2);         /* Number of reserved entries               
*                               (these are entries 0/1)          @LIA*/         
*DCL SVTALMAX# Constant(512-SvtAl#Rsv); /* Access list Max taking into          
*                               account reserved entries 0/1     @P7C*/         
*DCL SVT#RsmCads Constant(2);       /* RSM CADS                  @LIA*/         
*DCL SVT#RsvdSysAS Constant(1);     /* Number of reserved PASN-AL               
*                                      entries for system address               
*                                      spaces                    @P2A*/         
*DCL SVT_Normalization_Shift Constant(8);   /* Amount to shift by               
*                                      to accomplish the divide for             
*                                      SVT_IFA_Normalization and                
*                                      SVT_SUP_Normalization     @H4A*/         
*DCL SVT_Normalization_Divide Constant(256);   /* Amount to divide by           
*                                                                @M8A*/         
*DCL SVT_IFA_Normalization_Shift                                                
*              Constant(SVT_Normalization_Shift);            /*  @H4C*/         
*DCL SVT_zAAP_Normalization_Divide                                              
*              Constant(SVT_Normalization_Divide);           /*  @M8A*/         
*DCL SVT_SUP_Normalization_Shift                                                
*              Constant(SVT_Normalization_Shift);            /*  @H4A*/         
*DCL SVTDSBCM Bit(32) Constant('1FFFFFFF'x);  /* Mask to AND with               
*                                      SVTDSBCT to isolate the count            
*                                                                @0DA*/         
*Dcl SVT_ShortMinHdYesLockProMax Fixed(31) Constant(255); /* Maximum            
*                                      number of short minors for lock          
*                                      promote                   @0NA*/         
*Dcl SVT_MajorsHdYesLockPromote  Fixed(31) Constant(3); /* Number of            
*                                      majors for lock promote   @0NA*/         
*Dcl SvtSigpGovCoreReactiveShift Fixed(31) Constant(2)  /* How much to          
*                      shift the SIGP governor for cores and                    
*                      reactive SIGPs                            @0UC*/         
*   ,SvtSigpGovCoreProactiveShift Fixed(31) Constant(3)  /* How much to         
*                      shift the SIGP governor for cores                        
*                      and proactive SIGPs                       @0UC*/         
*   ,SvtSigpGovCoreHpwuqShift Fixed(31) Constant(4)  /* How much to             
*                      shift the SIGP governor for cores and                    
*                      HPWUQ SIGPs                               @0UC*/         
*   ,SvtSigpGovThreadReactiveShift Fixed(31) Constant(1) /*                     
*                      Additional number of bits to                             
*                      shift the SIGP governor for threads                      
*                      and reactive SIGPs                        @0UA*/         
*   ,SvtSigpGovThreadProactiveShift Fixed(31) Constant(1) /*                    
*                      Additional number of bits to                             
*                      shift the SIGP governor for threads                      
*                      and proactive SIGPs                       @0UA*/         
*   ,SvtSigpGovThreadHpwuqShift Fixed(31) Constant(0) /*                        
*                      Additional number of bits to                             
*                      shift the SIGP governor for threads                      
*                      and HPWUQ SIGPs                           @0UA*/         
*   ,SvtSigpGovHpwuqLTodFloor Fixed(31) Constant('00019000'x) /*                
*                      HPWUQ SIGP Governor floor (25 us)         @0UA*/         
*   ;                                                                           
* Dcl SVTCoreMode_1 Fixed(15) Constant(1); /* 1 thread per core  @0UA*/         
* Dcl SVTCoreMode_2 Fixed(15) Constant(2); /* 2 threads per core @0UA*/         
*                                                                               
* Dcl SVT_kHiPriorityBucketIndex Constant(1); /* Index to the                   
*                      high priority bucket defined by dispatch                 
*                      priorities between x'FF' and                             
*                      SVT_PRIORITY_RANGES(1) inclusive          @0VA*/         
* Dcl SVT_kMedPriorityBucketIndex Constant(2); /* Index to the                  
*                      medium priority bucket defined by dispatch               
*                      priorities between SVT_PRIORITY_RANGES(1)-1              
*                      and SVT_PRIORITY_RANGES(2) inclusive      @0VA*/         
* Dcl SVT_kLowPriorityBucketIndex Constant(3); /* Index to the                  
*                      low priority bucket defined by dispatch                  
*                      priorities between SVT_PRIORITY_RANGES(2)-1              
*                      and SVT_PRIORITY_RANGES(3) inclusive      @0VA*/         
* Dcl SVT_kDiscPriorityBucketIndex Constant(4); /* Index to the                 
*                      discretionary priority bucket defined by                 
*                      dispatch priorities between                              
*                      SVT_PRIORITY_RANGES(3)-1 and x'C0' inclusive             
*                                                                @0VA*/         
* Dcl SVT_kPriorityBucketFirstIndex                                             
*                  Constant(SVT_kHiPriorityBucketIndex);      /* @0VA*/         
* Dcl SVT_kPriorityBucketLastIndex                                              
*                  Constant(SVT_kDiscPriorityBucketIndex);    /* @0VA*/         
* Dcl SVT_kDefaultPreemptHPWUQIntvLTod                                          
*                  Constant(20*4096); /* 20 Microseconds         @NAA*/         
*                                                                               
*%SVT09:;                           /*                           @LIA*/         
*%IF SYSVERSION = '' %THEN %GOTO SVT10; /* PL/S or PL/X ?        @LJA*/         
*%IF SYSRULESMOD='PL/S-III ' %THEN %GOTO SVT10;               /* @LJA*/         
*                                                                               
*%DCL SYSAM64 CHAR EXT;                                                         
*?SYSSTATE (TEST);                                                              
*%IF SYSAM64 = 'YES' %THEN %GOTO SVT64_1A;                                      
*%SVTAMRM = 'AMODE(ANY) RMODE(24)';                                             
*%GOTO SVT64_1B;                                                                
*%SVT64_1A:;                                                                    
*%SVTAMRM = 'AMODE(31) RMODE(ANY)';                                             
*%SVT64_1B:;                                                                    
* %DCL ASAXMAC_ISITPLX CHAR EXT;                              /* @NCA*/         
* ?ASAXMAC IsItPLX;                                           /* @NCA*/         
* %IF ASAXMAC_ISITPLX ^= 'YES' %THEN %GOTO SVT_2;             /* @NCA*/         
*Dcl SVTSSJS_SetSSJS Constant(0);                             /* @NCA*/         
*Dcl Entry_SSJS Entry (Function:=Fixed(31) Inreg(0) Byvalue)                    
*      Based(SVTSSJS) Valrg(*) Options(AMODE(31));            /* @NCA*/         
*%SVT_2:;                                                     /* @NCA*/         
*   DCL IEAVCMS1 ENTRY BASED(SVTCMST1) VALRG(*) OPTIONS(SVTAMRM);               
*                                      /* CMSET ENTRY POINT.     @L3C*/         
*   DCL IEAVCMR1 ENTRY BASED(SVTCMRT1) VALRG(*) OPTIONS(SVTAMRM);               
*                                      /* CMSET RESET CHKAUTH(YES)              
*                                      ENTRY POINT               @L3C*/         
*   DCL IEAVCMR2 ENTRY BASED(SVTCMRT2) VALRG(*) OPTIONS(SVTAMRM);               
*                                      /* CMSET RESET NOAUTH                    
*                                      CHKAUTH(NO) ENTRY PT.     @L3C*/         
*   DCL IEAVCMS2 ENTRY BASED(SVTCMST2) VALRG(*) OPTIONS(SVTAMRM)                
*                    ;                 /* CMSET SET DIE(YES) EP  @0AA*/         
*   DCL IEAVCMR3 ENTRY BASED(SVTCMRT3) VALRG(*) OPTIONS(SVTAMRM)                
*                    ;                 /* CMSET RESET DIE(YES)                  
*                                         CHKAUTH(YES) EP        @0AA*/         
*   DCL IEAVCMR4 ENTRY BASED(SVTCMRT4) VALRG(*) OPTIONS(SVTAMRM)                
*                    ;                 /* CMSET RESET DIE(YES)                  
*                                         CHKAUTH(NO) EP         @0AA*/         
*   DCL IEAVCMST ENTRY BASED(SVTCMSTR) VALRG(*) OPTIONS(SVTAMRM);               
*                                      /* CMSET SSARTO                          
*                                      ENTRY POINT.              @L3C*/         
*   DCL IEAVCMSB ENTRY BASED(SVTCMSBR) VALRG(*) OPTIONS(SVTAMRM);               
*                                      /* CMSET SSARBACK                        
*                                      ENTRY POINT.              @L3C*/         
*   DCL IEAVC9S1 ENTRY BASED(SVTC9ST1) VALRG(*) OPTIONS(AMODE(ANY)              
*          RMODE(24));                 /* CMSET ENTRY POINT.     @LKA*/         
*%IF SVTENTS='NO'  % THEN           /*                           @PAM*/         
*    %GOTO SVT10A;                  /*                           @PAA*/         
*   DCL IEAVC9R1 ENTRY BASED(SVTC9RT1) VALRG(*) OPTIONS(AMODE(ANY)              
*          RMODE(24));                 /* CMSET RESET CHKAUTH(YES)              
*                                      ENTRY POINT               @LKA*/         
*   DCL IEAVC9R2 ENTRY BASED(SVTC9RT2) VALRG(*) OPTIONS(AMODE(ANY)              
*          RMODE(24));                 /* CMSET RESET NOAUTH                    
*                                      CHKAUTH(NO) ENTRY PT.     @LKA*/         
*%SVT10A:;                          /*                           @PAA*/         
*   DCL IEAVC9S2 ENTRY BASED(SVTC9ST2) VALRG(*) OPTIONS(AMODE(ANY)              
*          RMODE(24));                 /* CMSET SET DIE(YES) EP  @LKA*/         
*   DCL IEAVC9R3 ENTRY BASED(SVTC9RT3) VALRG(*) OPTIONS(AMODE(ANY)              
*          RMODE(24));                 /* CMSET RESET DIE(YES)                  
*                                         CHKAUTH(YES) EP        @LKA*/         
*   DCL IEAVC9R4 ENTRY BASED(SVTC9RT4) VALRG(*) OPTIONS(AMODE(ANY)              
*          RMODE(24));                 /* CMSET RESET DIE(YES)                  
*                                         CHKAUTH(NO) EP         @LKA*/         
*%IF SVTENTS_LCR = 'NO' %THEN       /*                           @PAA*/         
*    %GOTO SVT10;                   /*                           @PAA*/         
*   DCL IEAVC9ST ENTRY BASED(SVTC9STR) VALRG(*) OPTIONS(AMODE(ANY)              
*          RMODE(24));                 /* CMSET SSARTO                          
*                                      ENTRY POINT.              @LKA*/         
*   DCL IEAVC9SB ENTRY BASED(SVTC9SBR) VALRG(*) OPTIONS(AMODE(ANY)              
*          RMODE(24));                 /* CMSET SSARBACK                        
*                                      ENTRY POINT.              @LKA*/         
*%IF SVTENTS='NO'  % THEN           /*                           @PAA*/         
*    %GOTO SVT10;                   /*                           @PAA*/         
*   DCL IEAVCDEN ENTRY BASED(SVTCDSPE) VALRG(*) OPTIONS(SVTAMRM);               
*                                      /* CALLDISP ENABLED                      
*                                      ENTRY POINT.              @L3C*/         
*   DCL IEAVCDDS ENTRY BASED(SVTCDSPD) VALRG(*) OPTIONS(SVTAMRM);               
*                                      /* CALLDISP DISABLED                     
*                                      ENTRY POINT.              @L3C*/         
*   DCL IEAVSPM1 ENTRY BASED(SVTSRBG) VALRG(*) OPTIONS(SVTAMRM);                
*                                      /* GETSRB ROUTINE                        
*                                      ENTRY POINT.              @L3C*/         
*   DCL IEAVSPM2 ENTRY BASED(SVTSSRBG) VALRG(*) OPTIONS(SVTAMRM);               
*                                      /* GETSSRB ROUTINE                       
*                                      ENTRY POINT.              @L3C*/         
*   DCL IEAVSPM3 ENTRY BASED(SVTSRBF) VALRG(*) OPTIONS(SVTAMRM);                
*                                      /* FREESRB ROUTINE                       
*                                      ENTRY POINT.              @L3C*/         
*   DCL IEAVSPM4 ENTRY BASED(SVTSSRBF) VALRG(*) OPTIONS(SVTAMRM);               
*                                      /* FREESSRB ROUTINE                      
*                                      ENTRY POINT.              @L3C*/         
*   DCL IEAVINT ENTRY BASED(SVTINIT) VALRG(*) OPTIONS(AMODE(31));               
*                                      /* NULL ACCESS LIST AND SRB AND          
*                                      IH DUCT INITIALIZATION ROUTINE           
*                                      ENTRY POINT.  USE FOR IEAVINIT           
*                                                                @L3A*/         
*   DCL IEAVXAAC ENTRY BASED(SVTXAACR) VALRG(*) OPTIONS(AMODE(31));             
*                                      /* ALET TO ASCB CONVERSION               
*                                      ROUTINE ENTRY POINT.      @L3A*/         
*   DCL IEAVEXP3 ENTRY BASED(SVTEXP3) VALRG(*) OPTIONS(SVTAMRM);                
*                                      /* LSED COMPARISON ROUTINE               
*                                      ENTRY POINT.              @L3A*/         
*   DCL IEAVMRQ  ENTRY BASED(SVTEMRQ) VALRG(*) OPTIONS(AMODE(31,*));            
*                                      /* IEAVEMRQ ENTRY POINT   @L4A*/         
*   DCL IEAVEQV4 ENTRY BASED(SVTQV4)  VALRG(*) OPTIONS(AMODE(31,*));            
*                                      /* QUEUE VERIFICATION ROUTINE            
*                                         FOR DOUBLE THREADED SINGLE            
*                                         SPACE QUEUES.          @L6A*/         
*   DCL IEAVEQV5 ENTRY BASED(SVTQV5)  VALRG(*) OPTIONS(AMODE(31,*));            
*                                      /* QUEUE VERIFICATION ROUTINE            
*                                         FOR DOUBLE THREADED MULTIPLE          
*                                         SPACE QUEUES.          @L6A*/         
*   DCL IEAVEQV6 ENTRY BASED(SVTQV6)  VALRG(*) OPTIONS(AMODE(31,*));            
*                                      /* QUEUE VERIFICATION ROUTINE            
*                                         FOR SINGLE THREADED SINGLE            
*                                         SPACE QUEUES.          @L8A*/         
*   DCL IEATWRM ENTRY BASED(SVTTWRM) VALRG(*) OPTIONS(AMODE(31)                 
*                                                   RMODE(ANY));                
*                                      /* ENTRY POINT OF THE                    
*                                         TAWQ WEB ADDRESS                      
*                                         SPACE RESOURCE MANAGER                
*                                         ROUTINE (IEAVTWRM).    @LBA*/         
*%SVT10 : ;                            /*                        @SJK*/         
*  @LISTPOP;                                                   /*@H2A*/         
