*        %GOTO  PLSSRB1;           /*                                   00010001
         MACRO                                                          00020001
         IHASRB &LIST=YES                                               00030001
**/                                                                     00040001
*%PLSSRB1:;                                                             00050001
* %If IHASRB_PLXMAP = 'YES' %then                             /* @L7A*/ 00052003
*   %GOTO PLSSRB2;                                            /* @L7A*/ 00053003
*/* START OF SPECIFICATIONS ******************************************/ 00060001
*/*                                                                  */ 00070001
*/*01* PROPRIETARY STATEMENT =                                   @L6C*/ 00080001
*/*          LICENSED MATERIALS - PROPERTY OF IBM                    */ 00090001
*/*          5694-A01 COPYRIGHT IBM CORP. 1977, 2011                 */ 00100001
*/*                                                                  */ 00110001
*/*01* STATUS:  HBB7780                                          @L6C*/ 00120001
*/*                                                                  */ 00130001
*/*01* DESCRIPTIVE NAME:  Service Request Block                      */ 00140001
*/*02*  ACRONYM:  SRB                                                */ 00150001
*/*                                                                  */ 00160001
*/*01* EXTERNAL CLASSIFICATION:                                      */ 00170001
*/*02*         DMTI:BASE                                             */ 00180001
*/*02*         GUPI:FIELDS                                           */ 00190001
*/*                  SRBASCB                                         */ 00200001
*/*                  SRBCPAFF                                        */ 00210001
*/*                  SRBEP                                           */ 00220001
*/*                  SRBFRRA                                         */ 00230001
*/*                  SRBID                                           */ 00240001
*/*                  SRBPARM                                         */ 00250001
*/*                  SRBPASID                                        */ 00260001
*/*                  SRBPKF                                          */ 00270001
*/*                  SRBPTCB                                         */ 00280001
*/*                  SRBRMTR                                         */ 00290001
*/*01* END OF EXTERNAL CLASSIFICATION:                               */ 00300001
*/*                                                                  */ 00310001
*/*01* MACRO NAME:  IHASRB                                           */ 00320001
*/*                                                                  */ 00330001
*/*01* DSECT NAME:                                                   */ 00340001
*/*     SRBSECT                                                      */ 00350001
*/*                                                                  */ 00360001
*/*01* COMPONENT:  SUPERVISOR CONTROL (SC1C5)                        */ 00370001
*/*                                                                  */ 00380001
*/*01* EYE-CATCHER:  SRB                                             */ 00390001
*/*02*  OFFSET:  0                                                   */ 00400001
*/*02*  LENGTH:  4                                                   */ 00410001
*/*                                                                  */ 00420001
*/*01* STORAGE ATTRIBUTES:                                           */ 00430001
*/*02*  SUBPOOL:  Common, Fixed Storage                              */ 00440001
*/*02*  KEY:  0                                                      */ 00450001
*/*02*  RESIDENCY:  ABOVE OR BELOW THE 16M LINE                      */ 00460001
*/*                                                                  */ 00470001
*/*01* SIZE:  44 BYTES                                               */ 00480001
*/*                                                                  */ 00490001
*/*01* CREATED BY:                                                   */ 00500001
*/*     Control program routines                                     */ 00510001
*/*                                                                  */ 00520001
*/*01* POINTED TO BY:                                                */ 00530001
*/*     Built and initialized in user-allocated storage and          */ 00540001
*/*     passed as a parameter to the SCHEDULE macro.                 */ 00550001
*/*                                                                  */ 00560001
*/*     Pointed to by register 0 on entry to the SRB routine         */ 00570001
*/*     whose address is in SRBEP.                                   */ 00580001
*/*                                                                  */ 00590001
*/*     ASCBXMPQ FIELD OF THE ASCB DATA AREA                         */ 00600001
*/*     ASXBFSRB FIELD OF THE ASXB DATA AREA                         */ 00610001
*/*     ASXBLSRB FIELD OF THE ASXB DATA AREA                         */ 00620001
*/*     IOSSRB FIELD OF THE IOSB DATA AREA                           */ 00630001
*/*     PCBSRB FIELD OF THE PCB DATA AREA                            */ 00640001
*/*     SRBFLNK FIELD OF THE SRB DATA AREA                           */ 00650001
*/*     SVTGSMQ FIELD OF THE SVT DATA AREA                           */ 00660001
*/*     SVTLSMQ FIELD OF THE SVT DATA AREA                           */ 00670001
*/*     SVTSRBA FIELD OF THE SVT DATA AREA                           */ 00680001
*/*     TQESRB FIELD OF THE TQE DATA AREA                            */ 00690001
*/*     TVCSSRBA FIELD OF THE TVCS DATA AREA                         */ 00700001
*/*     WEBUPTR field of the WEB data area                           */ 00710001
*/*                                                                  */ 00720001
*/*01* SERIALIZATION:                                                */ 00730001
*/*     Owner-serialized.                                            */ 00740001
*/*                                                                  */ 00750001
*/*01* FUNCTION:                                                     */ 00760001
*/*     Used as input to the SCHEDULE macro when scheduling a        */ 00770001
*/*     routine for asynchronous execution.                          */ 00780001
*/*                                                                  */ 00790001
*/*01* METHOD OF ACCESS =                                            */ 00800001
*/*                                                                  */ 00810001
*/*     BAL- DSECT  ALWAYS PRODUCED, PERFORM USING ON SRBSECT        */ 00820001
*/*     BAL LISTING  - SPECIFY LIST=YES OR NO ON MACRO CALL          */ 00830001
*/*                                                                  */ 00840001
*/*     PL/S  - SRBSECT WILL BE BASED(SRBPTR) .                      */ 00850001
*/*        1. IF YOU WISH TO APPEND THE SRB TO THE END OF            */ 00860001
*/*           ANOTHER CONTROL BLOCK, SET %SRBLEVEL='N'               */ 00870001
*/*           WHERE N IS AN INTEGER BETWEEN 2 AND 3,INCLUSIVE.       */ 00880001
*/*           SRBSECT WILL THEN BE AN UNBASED LEVEL N  VARIABLE.     */ 00890001
*/*        2. IF YOU WISH TO APPEND ANOTHER CONTROL BLOCK TO THE END */ 00900001
*/*           OF THE SRB, SET %SRB9999=',', AND THE SEMICOLON AT     */ 00910001
*/*           THE END OF THE SRB WILL BE REPLACED WITH A COMMA.      */ 00920001
*/*                                                                  */ 00930001
*/*      EXAMPLE OF PLACING SRB BETWEEN TWO OTHER BLOCKS:            */ 00940001
*/*         %SRBLEVEL='2'                                            */ 00950001
*/*         %SRB9999=','                                             */ 00960001
*/*     DECLARE  1 MYBLOCK,                                          */ 00970001
*/*         2 MYFIELD,                                               */ 00980001
*/*        %INCLUDE SYSLIB(IHASRB)                                   */ 00990001
*/*         2 MYFIELD2                                               */ 01000001
*/*                                                                  */ 01010001
*/*      PL/S LISTING - SPECIFY %IHALIST='YES' BEFORE %INCLUDE       */ 01020001
*/*                                                                  */ 01030001
*/*01* COMPONENT = SC1C5 (SUPERVISOR CONTROL)                        */ 01040001
*/*                                                                  */ 01050001
*/*01* DISTRIBUTION LIBRARY = AMACLIB                                */ 01060004
*/*                                                                  */ 01070001
*/* END OF SPECIFICATIONS ********************************************/ 01080001
*        %GOTO PLSSRB2;              /*                                 01090001
.*                                                                      01100001
.********************************************************************** 01110001
.*   CHANGE ACTIVITY =                                                  01120001
.*                                                                      01130001
.*   G860PXX - HBB2102 SUPPORT                               @G860PXK   01140001
.*  $L1=LOCKR    JBB3320  871102  PD16FH:  SRB POOL ABOVE 16 MEG LINE   01150001
.*  $D1=DCR0075  HBB4410  880715  PD16Q4:  SUSPEND SRB WITH TOKEN       01160001
.*  $L2=APPC1    HBB4420  900122  PD16EJ:  SCHEDULE WITH ADDRESSABILITY 01170001
.*  $P1=PKB0125  HBB4430  911101  PD16ES:  LSSA SUPPORT                 01180001
.*  $L3=DISPR    HBB5510  930503  PD16EJ:  Dispatcher Restructure       01190001
.*  $P2=PIG1436  HBB5510  930505  PY12AG:  XES SUPPORT                  01200001
.*  $L4=DISPR    HBB5510  930601  PD16XZ:  Dispatcher Restructure       01210001
.*  $L5=DISPR    HBB5510  930909  PD16XZ:  Delete SRBQCHEK              01220001
.*  $L6=ENCLV    HBB5520  931109  PD16EI:  Enclave Support              01230001
.*                                         Delete SRBSCHA, SRBLSSAF,    01240001
.*                                         and SRBSUST                  01250001
.*                                         Add SRB1STS                  01260001
.*  $P3=PQC2916  HBB6603  961210  B7HGH5:  Add SRBMSCHD (TRSQ APAR      01270001
.*                                         OW23802)                     01280001
.*  $01=OW32277  HBB5520  980319  R4GAXZ:  Add SrbToknP                 01290001
.*  $P4=ME17828  HBB7770  091202  PD00KD:  SDWALOC31 for SRB's FRR      01300001
.*  $P5=ME19792  HBB7780  100823  PD00BS:  SRB's RMTR can get called    01310001
.*                                         with the local lock          01320001
.*  $L7=ME20842  HBB7780  110121  U2IAXZ:  PLXMAP                       01320101
.*                                                                      01321001
.********************************************************************** 01322001
.*                                                                      01323001
.* THE FOLLOWING ARE THE NAMING CONVENTIONS USED FOR RESERVED AREAS     01324001
.*     1. RESERVED FIELDS ARE NAMED AS FOLLOWS                          01325001
.*                         SRBXXX  DC    XLNNN'00' - RESERVED.          01326001
.*                            XXX IS THE OFFSET WITHIN THE SRB          01327001
.*                            NNN IS THE LENGTH OF THE RESERVED FIELD   01328001
.*                                A VALUE FROM 1 TO 256 INCLUSIVE       01329001
.*                                                                      01330001
.*     2. PL/S - RESERVED FIELDS DEFINED AS BIT STRINGS WHICH ARE NOT   01340001
.*               MULTIPLES OF EIGHT OR DO NOT START ON A BYTE           01350001
.*               BOUNDARY ARE NOT NAMED.                                01360001
.*                                                                      01370001
.*********************************************************************  01380001
         PUSH  PRINT                                               @L1A 01390001
         AIF   ('&LIST' EQ 'YES').SRBLST                           @L1A 01400001
         PRINT OFF                                                 @L1A 01410001
.SRBLST  ANOP                                                           01420001
SRBSECT  DSECT                                                          01430001
SRB      DS    0A                                                       01440001
SRBID    DS    CL4                      EBCDIC ACRONYM FOR SRB @G381PXU 01450001
*                                       OR SSRB.               @G381PXU 01460001
SRBFLNK  DS    A                        FORWARD CHAIN FIELD             01470001
SRBASCB  DS    0A                       PTR TO ASCB OF ADDRESS SPACE   -01480001
                                        SRB IS TO BE DISPATCHED TO @L3C 01490001
         DS    X                        RESERVED. DO NOT USE.      @L3A 01500001
SRBASC24 DS    AL3                      24-bit ASCB address        @L3A 01510001
SRBFLC   DS    0CL8                     SRB AREA MOVED TO LOW CORE      01520001
SRBCPAFF DS    BL2                      CPU AFFINITY MASK               01530001
SRBPASID DS    H                        PURGEDQ ASID IDENTIFIER         01540001
SRBPTCB  DS    A                        PURGEDQ TCB IDENTIFIER          01550001
SRBEP    DS    0A                       ENTRY POINT OF ROUTINE @G860PXH 01560001
SRBEPA   DS    A                        ADDRESS OF ENTRY POINT @G860PXH 01570001
*                                        (31-BIT USERS)        @G860PXH 01580001
SRBMODE  EQU   X'80'                    ADDRESSING MODE INDICATOR       01590001
*                                                              @G860PXH 01600001
SRBRMTR  DS    0A                       ADDRESS OF RESOURCE MANAGER     01610001
*                                        ROUTINE               @G860PXH 01620001
SRBRMTRA DS    0A                       ADDRESS OF RESOURCE MANAGER     01630001
*                                       ROUTINE (31-BIT USERS)     @P5C 01640001
SRBRMTR0 DS    X                    Byte 0 of SRBRMTR              @P5A 01650001
SRBRMODE EQU   X'80'                    ADDRESSING MODE INDICATOR       01660001
         DS   2X                                                   @P5A 01670001
SRBRMTR3 DS    X                    Byte 3 of SRBRMTR              @P5A 01680001
SRBRMTLL EQU   X'01'                When on, the local lock will be     01690001
*                                   held when control is given to the   01700001
*                                   RMTR. The RMTR is allowed to        01710001
*                                   release the local lock before       01720001
*                                   returning, but is not required to   01730001
*                                   do so.                         @P5A 01731001
*                                                              @G860PXH 01732001
SRBPARM  DS    A                        USER PARAMETER                  01733001
SRBWEB   DS   0A                    Address of this SRB's WEB.     @L3A 01734001
*                                   SERIALIZATION: None                 01735001
*                                   OWNERSHIP: Supervisor Control       01736001
SRBSAVE  DS    A                    Reserved. Must be Zero.        @L3C 01737001
*                                   SERIALIZATION: None                 01738001
*                                   OWNERSHIP: Supervisor Control       01739001
SRBPKF   DS    B                        PROTECT KEY INDICATION          01740001
SRBPRIOR DS    0B                       PRIORITY LEVEL INDIC   @G50DPXE 01750001
SRBFLGS  DS    B                        SRB OPTION FLAGS       @G50DPXE 01760001
SRBLLREQ EQU   X'80'                    LOCAL LOCK REQUIRED    @G50DPXE 01770001
SRBLLHLD EQU   X'40'                    LOCAL LOCK HELD        @G50DPXE 01780001
SRBFRREQ EQU   X'20'                    FRR REQUESTED          @G50DPXE 01790001
SRBFRRCL EQU   X'10'                    THIS BIT IS OBSOLETE   @G386PXV 01800001
*                                       SINCE FRR PARM AREA    @G386PXV 01810001
*                                       ALWAYS CLEARED BY      @G386PXV 01820001
*                                       DISPATCHER. RETAINED   @G386PXV 01830001
*                                       FOR COMPATIBILITY.     @G386PXV 01840001
SRBSUSP  EQU   X'08'                    SUSPENDED SRB ONLY ON FOR       01850001
*                                       SSRB                   @G50DPXE 01860001
SRBPNONQ EQU   X'04'                    NON QUIESCABLE SRB     @G50DPXE 01870001
SRBPSYS  EQU   X'00'                    SYSTEM PRIORITY LEVEL  @G50DPXE 01880001
SRBHLHI  DS    BL1                      INDICATION OF SUSPEND LOCKS     01890001
*                                       HELD AT SRB SUSPENSION @G50DPXE 01900001
SRBFLGS1 DS    B                        SRB TYPE FLAGS.        @G381PXU 01910001
SRBMAIN  EQU   X'80'                    SRB/SSRB MUST BE       @G381PXU 01920001
*                                       FREEMAINED.            @G381PXU 01930001
SRBSP245 EQU   X'40'                    SRB/SSRB FROM SUBPOOL  @G381PXU 01940001
*                                       245.                   @G381PXU 01950001
SRBBLK24 EQU   X'20'                    SRB BELOW THE LINE         @L1A 01960001
SRBXESF  EQU   X'10'                    Mode=primary FRR - only    @L6C 01970001
*                                       meaningful if SRBFRREQ is set.  01980001
SRB1STS  EQU   X'08'                    This SSRB represents the        01990001
*                                       initial schedule of a workunit  02000001
*                                       and has never been dispatched.  02010001
*                                                                  @L6A 02020001
SRBPMCS  EQU   X'04'                    This SRB is in process-must     02030001
*                                       complete mode              @L6A 02040001
SRBMSCHD EQU   X'02'                    This SRB was schduled via the   02050001
*                                       IEAMSCHD macro             @P3C 02060001
SRBTOKNP EQU   X'01'                    This SSRB belongs to the   @01A 02070001
*                                       pool created for SUSPEND with   02080001
*                                       SPTOKEN.                        02090001
SRBFRRA  DS    0A                       FRR ROUTINE ADDRESS    @G50DPXE 02100001
         DS    CL3                      High three bytes of addr   @P4A 02110001
SRBFRRA3 DS    CL1                      Low order byte of address  @P4A 02120001
SRBSD31  EQU   X'01'                    Set this flag to indicate  @P4A 02130001
*                                       that the FRR can tolerate an    02140001
*                                       SDWA in 31-bit storage.  This   02150001
*                                       is equivalent to the SETFRR     02160001
*                                       SDWALOC31=YES parameter         02170001
SRBEND   DS    0F                       END OF SRB             @G381PXU 02180001
SRBSIZE  EQU   SRBEND-SRBSECT           SIZE OF SRB                     02190001
         POP   PRINT                                               @L1A 02200001
         MEND                                                           02210001
* */                                                                    02220001
*%PLSSRB2:;                                                             02230001
*                                                                       02240001
* @LISTPUSH;                                                   /*@L1A*/ 02250001
* %IF IHALIST='YES' %THEN                                      /*@L1A*/ 02260001
*    %GOTO SRBLST;                                             /*@L1A*/ 02270001
* @LISTOFF;                                                    /*@L1A*/ 02280001
* %SRBLST:;                                                    /*@L1A*/ 02290001
*                                                                       02300001
* %IF  SRBLEVEL=''                                                      02310001
*   %THEN %SRBBASE='BASED(SRBPTR)' ;                                    02320001
*   %ELSE %SRBBASE='' ;                                                 02330001
*                                                                       02340001
* %IF SRBLEVEL=''                                                       02350001
*   %THEN %SRBLEVEL='DECLARE  1  '  ;                                   02360001
*                                                                       02370001
*   SRBLEVEL SRBSECT  SRBBASE BDY(WORD),                                02380001
*                                                                       02390001
*      4  SRB ,                                                         02400001
*                                                                       02410001
*        6 SRBID CHAR(4),               /* EBCDIC ACRONYM FOR SRB       02420001
*                                          OR SSRB.         @G381PXU*/  02430001
*        6 SRBFLNK  PTR(31),            /*FORWARD CHAIN FIELD       */  02440001
*                                                                       02450001
*        6 SRBASCB  PTR(31),            /*ADDRESS SPACE TO BE           02460001
*                                         DISPATCHED                */  02470001
*          8  *         CHAR(1),        /*                      @L3A*/  02480001
*          8  SRBASC24 PTR(24),         /* 24-bit ASCB address  @L3A*/  02490001
*        6 SRBFLC BDY(WORD),            /*SRB AREA MOVED TO LOW CORE*/  02500001
*                                                                       02510001
*          8   SRBCPAFF  BIT(16),       /*CPU AFFINITY MASK         */  02520001
*                                                                       02530001
*          8   SRBPASID  FIXED(15),     /*PURGEDQ ASID              */  02540001
*                                                                       02550001
*          8   SRBPTCB   PTR(31),       /*PURGEDQ TCB ADDRESS       */  02560001
*                                                                       02570001
*        6 SRBEP  PTR(31),              /* ENTRY POINT ADDRESS OF       02580001
*                                           ASYNCHRONOUS ROUTINE    */  02590001
*                                                                       02600001
*          8  SRBEPA PTR(31),           /* ENTRY POINT ADDRESS          02610001
*                                          (31-BIT USERS)   @G860PXH*/  02620001
*                                                                       02630001
*            10  SRBMODE BIT(1),        /* ADDRESSING MODE INDICATOR    02640001
*                                                           @G860PXH*/  02650001
*                                                                       02660001
*        6 SRBRMTR  PTR(31),            /*  ADDRESS OF RESOURCE MGR     02670001
*                                            TERMINATION ROUTINE FOR    02680001
*                                            PURGEDQ                */  02690001
*                                                                       02700001
*          8  SRBRMTRA PTR(31),         /* ADDRESS OF RESOURCE MGR      02710001
*                                            TERMINATION ROUTINE FOR    02720001
*                                            PURGEDQ (31-BIT USERS)     02730001
*                                                           @G860PXH*/  02740001
*           9 SRBRMTR0 CHAR(1),         /* Byte 0 of SRBRMTR    @P5A*/  02750001
*            10  SRBRMODE BIT(1),       /* ADDRESSING MODE INDICATOR    02760001
*                                                           @G860PXH*/  02770001
*           9 *        CHAR(2),                             /* @P5A*/   02780001
*           9 SRBRMTR3 CHAR(1),         /* Byte 3 of SRBRMTR    @P5A*/  02781001
*            10 * BIT(7),                                    /* @P5A*/  02782001
*            10 SRBRMTLL   BIT(1),      /* When on, the local lock      02783001
*                            will be held when control is given to      02784001
*                            the RMTR. The RMTR is allowed to release   02785001
*                            the local lock before returning, but is    02786001
*                            not required to do so.             @P5A*/  02787001
*        6 SRBPARM  PTR(31),            /* USER PARAMETER           */  02788001
*                                                                       02789001
*        6 SRBWEB   PTR(31),        /* Address of this SRB's WEB.       02790001
*                                      SERIALIZATION: None.             02800001
*                                      OWNERSHIP: Supervisor Control    02810001
*                                                                @L3A*/ 02820001
*         7 SRBSAVE  PTR(31),       /* Reserved. Must be Zero.          02830001
*                                      SERIALIZATION: None.             02840001
*                                      OWNERSHIP: Supervisor Control    02850001
*                                                                @L3C*/ 02860001
*        6 SRBPKF   BIT(8) ,            /* PROTECT KEY IN HIGH ORDER    02870001
*                                          4 BITS, LOW ORDER BITS 0 */  02880001
*                                                                       02890001
*        6 SRBPRIOR PTR(8) ,            /* PRIORITY LEVEL           */  02900001
*         7 SRBFLGS PTR(8),            /* SRB OPTION FLAGS   @G50DPXE*/ 02910001
*          8 SRBLLREQ BIT(1),          /* LOCAL LOCK REQUEST @G50DPXE*/ 02920001
*          8 SRBLLHLD BIT(1),          /* LOCAL LOCK HELD    @G50DPXE*/ 02930001
*          8 SRBFRREQ BIT(1),          /* FRR REQUESTED      @G50DPXE*/ 02940001
*          8 SRBFRRCL BIT(1),          /* THIS BIT IS OBSOLETE SINCE    02950001
*                                         FRR PARM AREA IS ALWAYS       02960001
*                                         CLEARED BY DISPATCHER.        02970001
*                                         RETAINED FOR COMPATIBILITY    02980001
*                                                            @G386PXV*/ 02990001
*          8 SRBSUSP BIT(1),           /* SUSPENDED SRB      @G50DPXE*/ 03000001
*          8 SRBPNONQ BIT(1),          /* NONQUIESCABLE SRB  @G50DPXE*/ 03010001
*          8 *        BIT(2),          /* RESERVED.              @L6C*/ 03020001
* %DCL  SRBPSYS FIXED;                 /* SYSTEM PRIORITY          */   03030001
* %SRBPSYS=0;                                                           03040001
*                                                                       03050001
*        6 SRBHLHI CHAR(1),            /* INDICATION OF LOCKS HELD AT   03060001
*                                         SRB SUSPENSION     @G50DPXE*/ 03070001
*        6 SRBFLGS1 BIT(8),            /* SRB TYPE FLAGS.    @G381PXU*/ 03080001
*          8 SRBMAIN BIT(1),           /* SRB/SSRB MUST BE FREEMAINED.  03090001
*                                                            @G381PXU*/ 03100001
*          8 SRBSP245 BIT(1),          /* SRB/SSRB FROM SUBPOOL 245.    03110001
*                                                            @G381PXU*/ 03120001
*          8 SRBBLK24 BIT(1),          /* SRB BELOW THE LINE     @L1A*/ 03130001
*          8 SRBXESF BIT(1),           /* Mode=primary FRR - only       03140001
*                                         meaningful if SRBFRREQ is     03150001
*                                         set.                   @L6C*/ 03160001
*          8 SRB1STS BIT(1),           /* This SSRB represents the      03170001
*                                         initial schedule of a         03180001
*                                         workunit and has never been   03190001
*                                         dispatched.            @L6A*/ 03200001
*          8 SRBPMCS BIT(1),           /* This SRB is in process        03210001
*                                         must complete mode     @LxA*/ 03220001
*          8 SRBMSCHD BIT(1),          /* This SRB was scheduled via    03230001
*                                         the IEAMSCHD macro     @P3C*/ 03240001
*          8 SRBTOKNP BIT(1),          /* This SSRB belongs to the      03250001
*                                         pool created for SUSPEND      03260001
*                                         with SPTOKEN.          @01A*/ 03270001
*        6 SRBFRRA PTR(31),             /* FRR ROUTINE ADDR  @G381PXU*/ 03280001
*          8 *     CHAR(3),                                 /*   @P4A*/ 03290001
*          8 SRBFRRA3 CHAR(1),                              /*   @P4A*/ 03300001
*            9 *       BIT(7),                              /*   @P4A*/ 03310001
*            9 SRBSD31 BIT(1),          /* Set this flag to indicate    03311001
*                                          that the FRR can tolerate an 03312001
*                                          SDWA in 31-bit storage. This 03313001
*                                          is equivalent to the SETFRR  03314001
*                                          SDWALOC31(YES) parameter     03315001
*                                                                @P4A*/ 03316001
* %IF SRB9999=',' %THEN                                    /*@G860PXK*/ 03317001
*     %GOTO SRB90;                                         /*@G860PXK*/ 03318001
*        6 SRBEND CHAR(0) BDY(WORD);    /* END OF SRB        @G860PXK*/ 03319001
* %GOTO SRB99;                                             /*@G860PXK*/ 03320001
* %SRB90:;                                                 /*@G860PXK*/ 03330001
*        6 SRBEND CHAR(0) BDY(WORD),    /* END OF SRB        @G860PXK*/ 03340001
* %SRB99:;                                                 /*@G860PXK*/ 03350001
*  @LISTPOP;                                                   /*@L1A*/ 03360001
