*                                                                       00001000
* %DCL IHASAVER_INCLUDED CHAR EXT;                                      00002000
* %DEACTIVATE IHASAVER_INCLUDED;                                        00003000
* %IF IHASAVER_INCLUDED = '' %THEN                                      00004000
* %DO;                                                                  00005000
*/* Macro made bi-lingual on 21014. CBGEN compile date 20027         */ 00006000
*% /*                                                                   00007000
         MACRO                                                          00008000
         IHASAVER &DSECT=YES,&LIST=YES,&TITLE=YES,&SAVER=YES,          *00009000
               &SAVF4SA=COND,&SAVF5SA=COND,&SAVF7SA=COND,&SAVF8SA=COND  00010000
                GBLC  &IHASAVER_INCLUDED                                00011000
                GBLC  &ZCBPRINT                                         00012000
&IHASAVER_INCLUDED SETC 'YES'                                           00013000
                AIF   ('&LIST' EQ 'NONE').P0                            00014000
                AIF   ('&TITLE' EQ 'NO').P5                             00015000
 TITLE          'IHASAVER  - General Purpose Registers Save Area       *00016000
                    '                                                   00017000
.P5             ANOP                                                    00018000
**/ IHASAVER_1:;                                                        00019000
*/* START OF SPECIFICATIONS ******************************************* 00020000
*                                                                       00021000
*  **PROPRIETARY_STATEMENT********************************************  00022000
***01* PROPRIETARY STATEMENT=                                        *  00023000
*                                                                    *  00024000
*                                                                    *  00025000
*   LICENSED MATERIALS - PROPERTY OF IBM                             *  00026000
*   5650-ZOS COPYRIGHT IBM CORP. 1992,2021                           *  00027000
*                                                                    *  00028000
*   STATUS= HBB77D0                                                  *  00029000
*                                                                    *  00030000
*  **END_OF_PROPRIETARY_STATEMENT*************************************  00031000
*                                                                       00032000
*01* DESCRIPTIVE NAME:  General Purpose Registers Save Area             00033000
*02*  ACRONYM:  SAV                                                     00034000
*                                                                       00035000
*01* MACRO NAME:  IHASAVER                                              00036000
*                                                                       00037000
*01* EXTERNAL CLASSIFICATION: PI                                        00038000
*01* END OF EXTERNAL CLASSIFICATION:                                    00039000
*                                                                       00040000
*01* DSECT NAME:                                                        00041000
*     SAVER                                                             00042000
*     SAVF4SA                                                           00043000
*     SAVF5SA                                                           00044000
*     SAVF7SA                                                           00045000
*     SAVF8SA                                                           00046000
*                                                                       00047000
*01* COMPONENT:  Supervisor Control (SC1C5)                             00048000
*                                                                       00049000
*01* EYE-CATCHER:  None                                                 00050000
*                                                                       00051000
*01* STORAGE ATTRIBUTES:                                                00052000
*                                                                       00053000
*02*  SUBPOOL:  Caller-supplied except SAVF5SA/SAVF8SA where it is      00054000
*               determined by called routine                            00055000
*                                                                       00056000
*02*  KEY:  Caller-supplied except SAVF5SA/SAVF8SA where it is          00057000
*           determined by called routine                                00058000
*                                                                       00059000
*02*  RESIDENCY:  Caller-supplied except SAVF5SA/SAVF8SA where it is    00060000
*                 determined by called routine                          00061000
*                                                                       00062000
*01* SIZE:                                                              00063000
*           SAVER   -- X'0048' bytes                                    00064000
*           SAVF4SA -- X'0090' bytes                                    00065000
*           SAVF5SA -- X'00D8' bytes                                    00066000
*           SAVF7SA -- X'00D8' bytes                                    00067000
*           SAVF8SA -- X'0120' bytes                                    00068000
*                                                                       00069000
*01* CREATED BY:                                                        00070000
*     Caller except for SAVF5SA/SAVF8SA which is created by             00071000
*     called routine                                                    00072000
*                                                                       00073000
*01* POINTED TO BY:                                                     00074000
*     R13 on input to a called routine or getmained by called routine   00075000
*                                                                       00076000
*01* SERIALIZATION:                                                     00077000
*     None required                                                     00078000
*                                                                       00079000
*01* FUNCTION:                                                          00080000
*02* Maps the save area                                                 00081000
*                                                                       00082000
*01* METHOD OF ACCESS:                                                  00083000
*02*  ASM:                                                              00084000
*      IHASAVER                                                         00085000
*           DSECT=YES!NO                                                00086000
*                                                                       00087000
*           DSECT=YES is the default and will produce the SAVER         00088000
*                 as a DSECT                                            00089000
*           DSECT=NO will produce the SAVER as a continuation of        00090000
*                 defined storage. (No DSECT card produced)             00091000
*                                                                       00092000
*02*  ASM:                                                              00093000
*      IHASAVER                                                         00094000
*           DSECT=YES!NO  -- Request DSECT definition                   00095000
*           SAVER=YES!NO!COND -- Request mapping of 72-byte save area   00096000
*                            USING on SAVER                             00097000
*           SAVF4SA=YES!NO!COND -- Request mapping of 144-byte save     00098000
*                            area                                       00099000
*                            USING on SAVF4SA                           00100000
*           SAVF5SA=YES!NO!COND -- Request mapping of 216-byte save     00101000
*                            area                                       00102000
*                            USING on SAVF5SA                           00103000
*           SAVF7SA=YES!NO!COND -- Request mapping of 216-byte save     00104000
*                            area                                       00105000
*                            USING on SAVF7SA                           00106000
*           SAVF8SA=YES!NO!COND -- Request mapping of 288-byte save     00107000
*                            area                                       00108000
*                            USING on SAVF8SA                           00109000
*     Default: DSECT=YES,SAVER=YES,SAVF4SA=COND,SAVF5SA=COND,           00110000
*              SAVF7SA=COND,SAVF8SA=COND                                00111000
*     Notes: name=YES  => expand                                        00112000
*            name=NO   => do not expand                                 00113000
*            name=COND => expand only if DSECT=YES                      00114000
*02*  PL/X:                                                             00115000
*      %INCLUDE SYSLIB(IHASAVER)                                        00116000
*                                                                       00117000
*01* DELETED BY:  Caller                                                00118000
*                                                                       00119000
*01* FREQUENCY:  N/A                                                    00120000
*                                                                       00121000
*01* DEPENDENCIES:  None                                                00122000
*                                                                       00123000
*01* DISTRIBUTION LIBRARY:  AMACLIB                                     00124000
*                                                                       00125000
*01* CHANGE ACTIVITY:                                                   00126000
*   $L0=PR606    ,HBB6606,980321,PD00XB:                                00127000
*   $L1=PR706    ,HBB7706,010418,PD00XB: F4SA,F5SA                      00128000
*   $L2=PR770    ,HBB7770 090601 PD00XB: F8SA                           00129000
*                                                                       00130000
* END OF SPECIFICATIONS *********************************************/  00131000
*% /*                                                                   00132000
.P0             ANOP                                                    00133000
                AIF   ('&ZCBPRINT' EQ 'NO').P1                          00134000
                AIF   ('&LIST' EQ 'YES').P2                             00135000
.P1             ANOP                                                    00136000
                PUSH  PRINT                                             00137000
                PRINT OFF                                               00138000
.P2             ANOP                                                    00139000
                AIF   ('&SAVER' EQ 'NO').L0002                          00140000
                AIF   ('&DSECT' EQ 'YES').L0003                         00141000
                AIF   ('&SAVER' NE 'YES').L0002                         00142000
SAVER           DS    0F                                                00143000
                AGO   .L0004                                            00144000
.L0003          ANOP                                                    00145000
SAVER           DSECT                                                   00146000
.L0004          ANOP                                                    00147000
SAVPLI          DS    A            USED BY PL/I LANG. PRGM              00148000
SAVPREV         DS    A            ADDR OF PREVIOUS SAVEAREA            00149000
SAVNEXT         DS    A            ADDR OF NEXT SAVE AREA               00150000
SAVGRS14        DS    A            REGISTER 14                          00151000
SAVGRS15        DS    A            REGISTER 15                          00152000
SAVGRS0         DS    A            REGISTER 0                           00153000
SAVGRS1         DS    A            REGISTER 1                           00154000
SAVGRS2         DS    A            REGISTER 2                           00155000
SAVGRS3         DS    A            REGISTER 3                           00156000
SAVGRS4         DS    A            REGISTER 4                           00157000
SAVGRS5         DS    A            REGISTER 5                           00158000
SAVGRS6         DS    A            REGISTER 6                           00159000
SAVGRS7         DS    A            REGISTER 7                           00160000
SAVGRS8         DS    A            REGISTER 8                           00161000
SAVGRS9         DS    A            REGISTER 9                           00162000
SAVGRS10        DS    A            REGISTER 10                          00163000
SAVGRS11        DS    A            REGISTER 11                          00164000
SAVGRS12        DS    A            REGISTER 12                          00165000
SAVER_LEN       EQU   *-SAVER                                           00166000
.L0002          ANOP                                                    00167000
                AIF   ('&SAVF4SA' EQ 'NO').L0005                        00168000
                AIF   ('&DSECT' EQ 'YES').L0006                         00169000
                AIF   ('&SAVF4SA' NE 'YES').L0005                       00170000
.L0006          ANOP                                                    00171000
*                                                                       00172000
* ********************************************************************  00173000
* * Mapping of F4SA savearea for use in saving/restoring 64-bit GPRs *  00174000
* ********************************************************************  00175000
*                                                                       00176000
*                                                                       00177000
                AIF   ('&DSECT' EQ 'YES').L0007                         00178000
SAVF4SA         DS    0D                                                00179000
                AGO   .L0008                                            00180000
.L0007          ANOP                                                    00181000
SAVF4SA         DSECT                                                   00182000
.L0008          ANOP                                                    00183000
SAVF4SALANG     DS    A            USED BY LANGUAGES                    00184000
SAVF4SAID       DS    CL4          'F4SA'                               00185000
SAVF4SAG64RS14  DS    CL8          REGISTER 14                          00186000
SAVF4SAG64RS15  DS    CL8          REGISTER 15                          00187000
SAVF4SAG64RS0   DS    CL8          REGISTER 0                           00188000
SAVF4SAG64RS1   DS    CL8          REGISTER 1                           00189000
SAVF4SAG64RS2   DS    CL8          REGISTER 2                           00190000
SAVF4SAG64RS3   DS    CL8          REGISTER 3                           00191000
SAVF4SAG64RS4   DS    CL8          REGISTER 4                           00192000
SAVF4SAG64RS5   DS    CL8          REGISTER 5                           00193000
SAVF4SAG64RS6   DS    CL8          REGISTER 6                           00194000
SAVF4SAG64RS7   DS    CL8          REGISTER 7                           00195000
SAVF4SAG64RS8   DS    CL8          REGISTER 8                           00196000
SAVF4SAG64RS9   DS    CL8          REGISTER 9                           00197000
SAVF4SAG64RS10  DS    CL8          REGISTER 10                          00198000
SAVF4SAG64RS11  DS    CL8          REGISTER 11                          00199000
SAVF4SAG64RS12  DS    CL8          REGISTER 12                          00200000
SAVF4SAPREV     DS    CL8          ADDR OF PREVIOUS SAVEAREA            00201000
SAVF4SANEXT     DS    CL8          ADDR OF NEXT SAVE AREA               00202000
SAVF4SAID_VALUE EQU   C'F4SA'                                           00203000
SAVF4SA_LEN     EQU   *-SAVF4SA                                         00204000
.L0005          ANOP                                                    00205000
                AIF   ('&SAVF5SA' EQ 'NO').L0009                        00206000
                AIF   ('&DSECT' EQ 'YES').L000A                         00207000
                AIF   ('&SAVF5SA' NE 'YES').L0009                       00208000
.L000A          ANOP                                                    00209000
*                                                                       00210000
* ********************************************************************  00211000
* * Mapping of F5SA savearea for use in saving/restoring 64-bit GPRs *  00212000
* * while also saving the caller's high halves "here"                *  00213000
* ********************************************************************  00214000
*                                                                       00215000
*                                                                       00216000
                AIF   ('&DSECT' EQ 'YES').L000B                         00217000
SAVF5SA         DS    0D                                                00218000
                AGO   .L000C                                            00219000
.L000B          ANOP                                                    00220000
SAVF5SA         DSECT                                                   00221000
.L000C          ANOP                                                    00222000
SAVF5SALANG     DS    A            USED BY LANGUAGES                    00223000
SAVF5SAID       DS    CL4          'F5SA'                               00224000
SAVF5SAG64RS14  DS    CL8          REGISTER 14                          00225000
SAVF5SAG64RS15  DS    CL8          REGISTER 15                          00226000
SAVF5SAG64RS0   DS    CL8          REGISTER 0                           00227000
SAVF5SAG64RS1   DS    CL8          REGISTER 1                           00228000
SAVF5SAG64RS2   DS    CL8          REGISTER 2                           00229000
SAVF5SAG64RS3   DS    CL8          REGISTER 3                           00230000
SAVF5SAG64RS4   DS    CL8          REGISTER 4                           00231000
SAVF5SAG64RS5   DS    CL8          REGISTER 5                           00232000
SAVF5SAG64RS6   DS    CL8          REGISTER 6                           00233000
SAVF5SAG64RS7   DS    CL8          REGISTER 7                           00234000
SAVF5SAG64RS8   DS    CL8          REGISTER 8                           00235000
SAVF5SAG64RS9   DS    CL8          REGISTER 9                           00236000
SAVF5SAG64RS10  DS    CL8          REGISTER 10                          00237000
SAVF5SAG64RS11  DS    CL8          REGISTER 11                          00238000
SAVF5SAG64RS12  DS    CL8          REGISTER 12                          00239000
SAVF5SAPREV     DS    CL8          ADDR OF PREVIOUS SAVEAREA            00240000
SAVF5SANEXT     DS    CL8          ADDR OF NEXT SAVE AREA               00241000
SAVF5SAG64HS0   DS    A            High half of caller's R0             00242000
SAVF5SAG64HS1   DS    A            High half of caller's R1             00243000
SAVF5SAG64HS2   DS    A            High half of caller's R2             00244000
SAVF5SAG64HS3   DS    A            High half of caller's R3             00245000
SAVF5SAG64HS4   DS    A            High half of caller's R4             00246000
SAVF5SAG64HS5   DS    A            High half of caller's R5             00247000
SAVF5SAG64HS6   DS    A            High half of caller's R6             00248000
SAVF5SAG64HS7   DS    A            High half of caller's R7             00249000
SAVF5SAG64HS8   DS    A            High half of caller's R8             00250000
SAVF5SAG64HS9   DS    A            High half of caller's R9             00251000
SAVF5SAG64HS10  DS    A            High half of caller's R10            00252000
SAVF5SAG64HS11  DS    A            High half of caller's R11            00253000
SAVF5SAG64HS12  DS    A            High half of caller's R12            00254000
SAVF5SAG64HS13  DS    A            High half of caller's R13            00255000
SAVF5SAG64HS14  DS    A            High half of caller's R14            00256000
SAVF5SAG64HS15  DS    A            High half of caller's R15            00257000
                DS    CL8          Undefined                            00258000
SAVF5SAID_VALUE EQU   C'F5SA'                                           00259000
SAVF5SA_LEN     EQU   *-SAVF5SA                                         00260000
.L0009          ANOP                                                    00261000
                AIF   ('&SAVF7SA' EQ 'NO').L000D                        00262000
                AIF   ('&DSECT' EQ 'YES').L000E                         00263000
                AIF   ('&SAVF7SA' NE 'YES').L000D                       00264000
.L000E          ANOP                                                    00265000
*                                                                       00266000
* ********************************************************************  00267000
* * Mapping of F7SA savearea for use in saving/restoring 64-bit GPRs *  00268000
* * and ARs                                                          *  00269000
* ********************************************************************  00270000
*                                                                       00271000
*                                                                       00272000
                AIF   ('&DSECT' EQ 'YES').L000F                         00273000
SAVF7SA         DS    0D                                                00274000
                AGO   .L0010                                            00275000
.L000F          ANOP                                                    00276000
SAVF7SA         DSECT                                                   00277000
.L0010          ANOP                                                    00278000
SAVF7SALANG     DS    A            USED BY LANGUAGES                    00279000
SAVF7SAID       DS    CL4          'F7SA'                               00280000
SAVF7SAG64RS14  DS    CL8          REGISTER 14                          00281000
SAVF7SAG64RS15  DS    CL8          REGISTER 15                          00282000
SAVF7SAG64RS0   DS    CL8          REGISTER 0                           00283000
SAVF7SAG64RS1   DS    CL8          REGISTER 1                           00284000
SAVF7SAG64RS2   DS    CL8          REGISTER 2                           00285000
SAVF7SAG64RS3   DS    CL8          REGISTER 3                           00286000
SAVF7SAG64RS4   DS    CL8          REGISTER 4                           00287000
SAVF7SAG64RS5   DS    CL8          REGISTER 5                           00288000
SAVF7SAG64RS6   DS    CL8          REGISTER 6                           00289000
SAVF7SAG64RS7   DS    CL8          REGISTER 7                           00290000
SAVF7SAG64RS8   DS    CL8          REGISTER 8                           00291000
SAVF7SAG64RS9   DS    CL8          REGISTER 9                           00292000
SAVF7SAG64RS10  DS    CL8          REGISTER 10                          00293000
SAVF7SAG64RS11  DS    CL8          REGISTER 11                          00294000
SAVF7SAG64RS12  DS    CL8          REGISTER 12                          00295000
SAVF7SAPREV     DS    CL8          ADDR OF PREVIOUS SAVEAREA            00296000
SAVF7SANEXT     DS    CL8          ADDR OF NEXT SAVE AREA               00297000
SAVF7SAAR14     DS    F            AR 14                                00298000
SAVF7SAAR15     DS    F            AR 15                                00299000
SAVF7SAAR0      DS    F            AR 0                                 00300000
SAVF7SAAR1      DS    F            AR 1                                 00301000
SAVF7SAAR2      DS    F            AR 2                                 00302000
SAVF7SAAR3      DS    F            AR 3                                 00303000
SAVF7SAAR4      DS    F            AR 4                                 00304000
SAVF7SAAR5      DS    F            AR 5                                 00305000
SAVF7SAAR6      DS    F            AR 6                                 00306000
SAVF7SAAR7      DS    F            AR 7                                 00307000
SAVF7SAAR8      DS    F            AR 8                                 00308000
SAVF7SAAR9      DS    F            AR 9                                 00309000
SAVF7SAAR10     DS    F            AR 10                                00310000
SAVF7SAAR11     DS    F            AR 11                                00311000
SAVF7SAAR12     DS    F            AR 12                                00312000
SAVF7SAAR13     DS    F            ALET of previous save area or       *00313000
                                   undefined                            00314000
SAVF7SAASC      DS    F            ASC mode of caller                   00315000
                DS    CL4          Undefined                            00316000
SAVF7SAID_VALUE EQU   C'F7SA'                                           00317000
SAVF7SA_LEN     EQU   *-SAVF7SA                                         00318000
.L000D          ANOP                                                    00319000
                AIF   ('&SAVF8SA' EQ 'NO').L0011                        00320000
                AIF   ('&DSECT' EQ 'YES').L0012                         00321000
                AIF   ('&SAVF8SA' NE 'YES').L0011                       00322000
.L0012          ANOP                                                    00323000
*                                                                       00324000
* ********************************************************************  00325000
* * Mapping of F8SA savearea for use in saving/restoring 64-bit      *  00326000
* * GPRs and ARs, while also saving the caller's high halves "here"  *  00327000
* ********************************************************************  00328000
*                                                                       00329000
*                                                                       00330000
                AIF   ('&DSECT' EQ 'YES').L0013                         00331000
SAVF8SA         DS    0D                                                00332000
                AGO   .L0014                                            00333000
.L0013          ANOP                                                    00334000
SAVF8SA         DSECT                                                   00335000
.L0014          ANOP                                                    00336000
SAVF8SALANG     DS    A            USED BY LANGUAGES                    00337000
SAVF8SAID       DS    CL4          'F8SA'                               00338000
SAVF8SAG64RS14  DS    CL8          REGISTER 14                          00339000
SAVF8SAG64RS15  DS    CL8          REGISTER 15                          00340000
SAVF8SAG64RS0   DS    CL8          REGISTER 0                           00341000
SAVF8SAG64RS1   DS    CL8          REGISTER 1                           00342000
SAVF8SAG64RS2   DS    CL8          REGISTER 2                           00343000
SAVF8SAG64RS3   DS    CL8          REGISTER 3                           00344000
SAVF8SAG64RS4   DS    CL8          REGISTER 4                           00345000
SAVF8SAG64RS5   DS    CL8          REGISTER 5                           00346000
SAVF8SAG64RS6   DS    CL8          REGISTER 6                           00347000
SAVF8SAG64RS7   DS    CL8          REGISTER 7                           00348000
SAVF8SAG64RS8   DS    CL8          REGISTER 8                           00349000
SAVF8SAG64RS9   DS    CL8          REGISTER 9                           00350000
SAVF8SAG64RS10  DS    CL8          REGISTER 10                          00351000
SAVF8SAG64RS11  DS    CL8          REGISTER 11                          00352000
SAVF8SAG64RS12  DS    CL8          REGISTER 12                          00353000
SAVF8SAPREV     DS    CL8          ADDR OF PREVIOUS SAVEAREA            00354000
SAVF8SANEXT     DS    CL8          ADDR OF NEXT SAVE AREA               00355000
SAVF8SAAR14     DS    F            AR 14                                00356000
SAVF8SAAR15     DS    F            AR 15                                00357000
SAVF8SAAR0      DS    F            AR 0                                 00358000
SAVF8SAAR1      DS    F            AR 1                                 00359000
SAVF8SAAR2      DS    F            AR 2                                 00360000
SAVF8SAAR3      DS    F            AR 3                                 00361000
SAVF8SAAR4      DS    F            AR 4                                 00362000
SAVF8SAAR5      DS    F            AR 5                                 00363000
SAVF8SAAR6      DS    F            AR 6                                 00364000
SAVF8SAAR7      DS    F            AR 7                                 00365000
SAVF8SAAR8      DS    F            AR 8                                 00366000
SAVF8SAAR9      DS    F            AR 9                                 00367000
SAVF8SAAR10     DS    F            AR 10                                00368000
SAVF8SAAR11     DS    F            AR 11                                00369000
SAVF8SAAR12     DS    F            AR 12                                00370000
SAVF8SAAR13     DS    F            ALET of previous save area or       *00371000
                                   undefined                            00372000
SAVF8SAASC      DS    F            ASC mode of caller                   00373000
                DS    CL4          Undefined                            00374000
SAVF8SAG64HS0   DS    A            High half of caller's R0             00375000
SAVF8SAG64HS1   DS    A            High half of caller's R1             00376000
SAVF8SAG64HS2   DS    A            High half of caller's R2             00377000
SAVF8SAG64HS3   DS    A            High half of caller's R3             00378000
SAVF8SAG64HS4   DS    A            High half of caller's R4             00379000
SAVF8SAG64HS5   DS    A            High half of caller's R5             00380000
SAVF8SAG64HS6   DS    A            High half of caller's R6             00381000
SAVF8SAG64HS7   DS    A            High half of caller's R7             00382000
SAVF8SAG64HS8   DS    A            High half of caller's R8             00383000
SAVF8SAG64HS9   DS    A            High half of caller's R9             00384000
SAVF8SAG64HS10  DS    A            High half of caller's R10            00385000
SAVF8SAG64HS11  DS    A            High half of caller's R11            00386000
SAVF8SAG64HS12  DS    A            High half of caller's R12            00387000
SAVF8SAG64HS13  DS    A            High half of caller's R13            00388000
SAVF8SAG64HS14  DS    A            High half of caller's R14            00389000
SAVF8SAG64HS15  DS    A            High half of caller's R15            00390000
                DS    CL8          Undefined                            00391000
SAVF8SAID_VALUE EQU   C'F8SA'                                           00392000
SAVF8SA_LEN     EQU   *-SAVF8SA                                         00393000
.L0011          ANOP                                                    00394000
                AIF   ('&ZCBPRINT' EQ 'NO').P3                          00395000
                AIF   ('&LIST' EQ 'YES').P4                             00396000
.P3             ANOP                                                    00397000
                POP   PRINT                                             00398000
.P4             ANOP                                                    00399000
.P_EXIT         ANOP                                                    00400000
                MEND                                                    00401000
**/ IHASAVER_2:;                                                        00402000
* %IHASAVER_INCLUDED = 'YES';                                           00403000
* %DCL ZCBPRINT CHAR EXT;                                               00404000
* %DEACTIVATE ZCBPRINT;                                                 00405000
* %DCL IHASAVER_LIST CHAR EXT;                                          00406000
* %DEACTIVATE IHASAVER_LIST;                                            00407000
* %IF IHASAVER_LIST = 'NO' !                                            00408000
*    ZCBPRINT = 'NO' %THEN                                              00409000
* %DO;                                                                  00410000
*   @LIST PUSH NOECHO;                                                  00411000
*   @LIST NOASSEMBLE NOECHO;                                            00412000
*   @LIST OFF C NOECHO;                                                 00413000
* %END;                                                                 00414000
*/* Start of PL/X Source                                             */ 00415000
*        % IF SAVBASE = ''                                              00416000
*        %    THEN                                                      00417000
*        %      SAVBASE = 'BASED';                                      00418000
* DCL  1 SAVER SAVBASE BDY(WORD),                                       00419000
*        2 SAVPLI   PTR(31),            /* USED BY PL/I LANG. PRGM   */ 00420000
*        2 SAVPREV  PTR(31),            /* ADDR OF PREVIOUS SAVEAREA */ 00421000
*        2 SAVNEXT  PTR(31),            /* ADDR OF NEXT SAVE AREA    */ 00422000
*        2 SAVGRS14 PTR(31),            /* REGISTER 14               */ 00423000
*        2 SAVGRS15 PTR(31),            /* REGISTER 15               */ 00424000
*        2 SAVGRS0  PTR(31),            /* REGISTER 0                */ 00425000
*        2 SAVGRS1  PTR(31),            /* REGISTER 1                */ 00426000
*        2 SAVGRS2  PTR(31),            /* REGISTER 2                */ 00427000
*        2 SAVGRS3  PTR(31),            /* REGISTER 3                */ 00428000
*        2 SAVGRS4  PTR(31),            /* REGISTER 4                */ 00429000
*        2 SAVGRS5  PTR(31),            /* REGISTER 5                */ 00430000
*        2 SAVGRS6  PTR(31),            /* REGISTER 6                */ 00431000
*        2 SAVGRS7  PTR(31),            /* REGISTER 7                */ 00432000
*        2 SAVGRS8  PTR(31),            /* REGISTER 8                */ 00433000
*        2 SAVGRS9  PTR(31),            /* REGISTER 9                */ 00434000
*        2 SAVGRS10 PTR(31),            /* REGISTER 10               */ 00435000
*        2 SAVGRS11 PTR(31),            /* REGISTER 11               */ 00436000
*        2 SAVGRS12 PTR(31);            /* REGISTER 12               */ 00437000
*%IF SYSVERSION = '' %THEN %GOTO IHASAVER_PLS;                /*     */ 00438000
*%IF SYSRULESMOD='PL/S-III ' %THEN %GOTO IHASAVER_PLS;        /*     */ 00439000
*/********************************************************************/ 00440000
*/* Mapping of F4SA savearea for use in saving/restoring 64-bit GPRs */ 00441000
*/********************************************************************/ 00442000
* ?ASAXMAC SetEsameInfo;                                                00443000
* DCL  1 SAVF4SA SAVBASE BDY(DWORD),                                    00444000
*        2 SAVF4SALANG PTR(31),         /* USED BY LANGUAGES         */ 00445000
*        2 SAVF4SAID CHAR(4),           /* 'F4SA'                    */ 00446000
*        2 SAVF4SAG64RS14 AsaxmacP64,   /* REGISTER 14               */ 00447000
*        2 SAVF4SAG64RS15 AsaxmacP64,   /* REGISTER 15               */ 00448000
*        2 SAVF4SAG64RS0 AsaxmacP64,    /* REGISTER 0                */ 00449000
*        2 SAVF4SAG64RS1 AsaxmacP64,    /* REGISTER 1                */ 00450000
*        2 SAVF4SAG64RS2 AsaxmacP64,    /* REGISTER 2                */ 00451000
*        2 SAVF4SAG64RS3 AsaxmacP64,    /* REGISTER 3                */ 00452000
*        2 SAVF4SAG64RS4 AsaxmacP64,    /* REGISTER 4                */ 00453000
*        2 SAVF4SAG64RS5 AsaxmacP64,    /* REGISTER 5                */ 00454000
*        2 SAVF4SAG64RS6 AsaxmacP64,    /* REGISTER 6                */ 00455000
*        2 SAVF4SAG64RS7 AsaxmacP64,    /* REGISTER 7                */ 00456000
*        2 SAVF4SAG64RS8 AsaxmacP64,    /* REGISTER 8                */ 00457000
*        2 SAVF4SAG64RS9 AsaxmacP64,    /* REGISTER 9                */ 00458000
*        2 SAVF4SAG64RS10 AsaxmacP64,   /* REGISTER 10               */ 00459000
*        2 SAVF4SAG64RS11 AsaxmacP64,   /* REGISTER 11               */ 00460000
*        2 SAVF4SAG64RS12 AsaxmacP64,   /* REGISTER 12               */ 00461000
*        2 SAVF4SAPREV AsaxmacP64,      /* ADDR OF PREVIOUS SAVEAREA */ 00462000
*        2 SAVF4SANEXT AsaxmacP64;      /* ADDR OF NEXT SAVE AREA    */ 00463000
* DCL  SAVF4SAID_VALUE CHAR(LENGTH(SAVF4SA.SAVF4SAID))                  00464000
*            CONSTANT('F4SA');                                          00465000
*/********************************************************************/ 00466000
*/* Mapping of F5SA savearea for use in saving/restoring 64-bit GPRs */ 00467000
*/* while also saving the caller's high halves "here"                */ 00468000
*/********************************************************************/ 00469000
* DCL  1 SAVF5SA SAVBASE BDY(DWORD),                                    00470000
*        2 SAVF5SALANG PTR(31),         /* USED BY LANGUAGES         */ 00471000
*        2 SAVF5SAID CHAR(4),           /* 'F5SA'                    */ 00472000
*        2 SAVF5SAG64RS14 AsaxmacP64,   /* REGISTER 14               */ 00473000
*        2 SAVF5SAG64RS15 AsaxmacP64,   /* REGISTER 15               */ 00474000
*        2 SAVF5SAG64RS0 AsaxmacP64,    /* REGISTER 0                */ 00475000
*        2 SAVF5SAG64RS1 AsaxmacP64,    /* REGISTER 1                */ 00476000
*        2 SAVF5SAG64RS2 AsaxmacP64,    /* REGISTER 2                */ 00477000
*        2 SAVF5SAG64RS3 AsaxmacP64,    /* REGISTER 3                */ 00478000
*        2 SAVF5SAG64RS4 AsaxmacP64,    /* REGISTER 4                */ 00479000
*        2 SAVF5SAG64RS5 AsaxmacP64,    /* REGISTER 5                */ 00480000
*        2 SAVF5SAG64RS6 AsaxmacP64,    /* REGISTER 6                */ 00481000
*        2 SAVF5SAG64RS7 AsaxmacP64,    /* REGISTER 7                */ 00482000
*        2 SAVF5SAG64RS8 AsaxmacP64,    /* REGISTER 8                */ 00483000
*        2 SAVF5SAG64RS9 AsaxmacP64,    /* REGISTER 9                */ 00484000
*        2 SAVF5SAG64RS10 AsaxmacP64,   /* REGISTER 10               */ 00485000
*        2 SAVF5SAG64RS11 AsaxmacP64,   /* REGISTER 11               */ 00486000
*        2 SAVF5SAG64RS12 AsaxmacP64,   /* REGISTER 12               */ 00487000
*        2 SAVF5SAPREV AsaxmacP64,      /* ADDR OF PREVIOUS SAVEAREA */ 00488000
*        2 SAVF5SANEXT AsaxmacP64,      /* ADDR OF NEXT SAVE AREA    */ 00489000
*        2 SAVF5SAG64HS0 PTR(31),       /* High half of caller's R0  */ 00490000
*        2 SAVF5SAG64HS1 PTR(31),       /* High half of caller's R1  */ 00491000
*        2 SAVF5SAG64HS2 PTR(31),       /* High half of caller's R2  */ 00492000
*        2 SAVF5SAG64HS3 PTR(31),       /* High half of caller's R3  */ 00493000
*        2 SAVF5SAG64HS4 PTR(31),       /* High half of caller's R4  */ 00494000
*        2 SAVF5SAG64HS5 PTR(31),       /* High half of caller's R5  */ 00495000
*        2 SAVF5SAG64HS6 PTR(31),       /* High half of caller's R6  */ 00496000
*        2 SAVF5SAG64HS7 PTR(31),       /* High half of caller's R7  */ 00497000
*        2 SAVF5SAG64HS8 PTR(31),       /* High half of caller's R8  */ 00498000
*        2 SAVF5SAG64HS9 PTR(31),       /* High half of caller's R9  */ 00499000
*        2 SAVF5SAG64HS10 PTR(31),      /* High half of caller's R10 */ 00500000
*        2 SAVF5SAG64HS11 PTR(31),      /* High half of caller's R11 */ 00501000
*        2 SAVF5SAG64HS12 PTR(31),      /* High half of caller's R12 */ 00502000
*        2 SAVF5SAG64HS13 PTR(31),      /* High half of caller's R13 */ 00503000
*        2 SAVF5SAG64HS14 PTR(31),      /* High half of caller's R14 */ 00504000
*        2 SAVF5SAG64HS15 PTR(31),      /* High half of caller's R15 */ 00505000
*        2 * CHAR(8);                   /* Undefined                 */ 00506000
* DCL  SAVF5SAID_VALUE CHAR(LENGTH(SAVF5SA.SAVF5SAID))                  00507000
*            CONSTANT('F5SA');                                          00508000
*/********************************************************************/ 00509000
*/* Mapping of F7SA savearea for use in saving/restoring 64-bit GPRs */ 00510000
*/* and ARs                                                          */ 00511000
*/********************************************************************/ 00512000
* ?ASAXMAC SetEsameInfo;                                                00513000
* DCL  1 SAVF7SA SAVBASE BDY(DWORD),                                    00514000
*        2 SAVF7SALANG PTR(31),         /* USED BY LANGUAGES         */ 00515000
*        2 SAVF7SAID CHAR(4),           /* 'F7SA'                    */ 00516000
*        2 SAVF7SAG64RS14 AsaxmacP64,   /* REGISTER 14               */ 00517000
*        2 SAVF7SAG64RS15 AsaxmacP64,   /* REGISTER 15               */ 00518000
*        2 SAVF7SAG64RS0 AsaxmacP64,    /* REGISTER 0                */ 00519000
*        2 SAVF7SAG64RS1 AsaxmacP64,    /* REGISTER 1                */ 00520000
*        2 SAVF7SAG64RS2 AsaxmacP64,    /* REGISTER 2                */ 00521000
*        2 SAVF7SAG64RS3 AsaxmacP64,    /* REGISTER 3                */ 00522000
*        2 SAVF7SAG64RS4 AsaxmacP64,    /* REGISTER 4                */ 00523000
*        2 SAVF7SAG64RS5 AsaxmacP64,    /* REGISTER 5                */ 00524000
*        2 SAVF7SAG64RS6 AsaxmacP64,    /* REGISTER 6                */ 00525000
*        2 SAVF7SAG64RS7 AsaxmacP64,    /* REGISTER 7                */ 00526000
*        2 SAVF7SAG64RS8 AsaxmacP64,    /* REGISTER 8                */ 00527000
*        2 SAVF7SAG64RS9 AsaxmacP64,    /* REGISTER 9                */ 00528000
*        2 SAVF7SAG64RS10 AsaxmacP64,   /* REGISTER 10               */ 00529000
*        2 SAVF7SAG64RS11 AsaxmacP64,   /* REGISTER 11               */ 00530000
*        2 SAVF7SAG64RS12 AsaxmacP64,   /* REGISTER 12               */ 00531000
*        2 SAVF7SAPREV AsaxmacP64,      /* ADDR OF PREVIOUS SAVEAREA */ 00532000
*        2 SAVF7SANEXT AsaxmacP64,      /* ADDR OF NEXT SAVE AREA    */ 00533000
*        2 SAVF7SAAR14 Fixed(32),       /* AR 14                     */ 00534000
*        2 SAVF7SAAR15 Fixed(32),       /* AR 15                     */ 00535000
*        2 SAVF7SAAR0 Fixed(32),        /* AR 0                      */ 00536000
*        2 SAVF7SAAR1 Fixed(32),        /* AR 1                      */ 00537000
*        2 SAVF7SAAR2 Fixed(32),        /* AR 2                      */ 00538000
*        2 SAVF7SAAR3 Fixed(32),        /* AR 3                      */ 00539000
*        2 SAVF7SAAR4 Fixed(32),        /* AR 4                      */ 00540000
*        2 SAVF7SAAR5 Fixed(32),        /* AR 5                      */ 00541000
*        2 SAVF7SAAR6 Fixed(32),        /* AR 6                      */ 00542000
*        2 SAVF7SAAR7 Fixed(32),        /* AR 7                      */ 00543000
*        2 SAVF7SAAR8 Fixed(32),        /* AR 8                      */ 00544000
*        2 SAVF7SAAR9 Fixed(32),        /* AR 9                      */ 00545000
*        2 SAVF7SAAR10 Fixed(32),       /* AR 10                     */ 00546000
*        2 SAVF7SAAR11 Fixed(32),       /* AR 11                     */ 00547000
*        2 SAVF7SAAR12 Fixed(32),       /* AR 12                     */ 00548000
*        2 SAVF7SAAR13 Fixed(32),       /* ALET of previous save area   00549000
*                                          or undefined              */ 00550000
*        2 SAVF7SAASC Fixed(32),        /* ASC mode of caller        */ 00551000
*        2 * CHAR(4);                   /* Undefined                 */ 00552000
* DCL  SAVF7SAID_VALUE CHAR(LENGTH(SAVF7SA.SAVF7SAID))                  00553000
*            CONSTANT('F7SA');                                          00554000
*/********************************************************************/ 00555000
*/* Mapping of F8SA savearea for use in saving/restoring 64-bit      */ 00556000
*/* GPRs and ARs, while also saving the caller's high halves "here"  */ 00557000
*/********************************************************************/ 00558000
* DCL  1 SAVF8SA SAVBASE BDY(DWORD),                          /* @L2A*/ 00559000
*        2 SAVF8SALANG PTR(31),         /* USED BY LANGUAGES         */ 00560000
*        2 SAVF8SAID CHAR(4),           /* 'F8SA'                    */ 00561000
*        2 SAVF8SAG64RS14 AsaxmacP64, /* REGISTER 14                 */ 00562000
*        2 SAVF8SAG64RS15 AsaxmacP64, /* REGISTER 15                 */ 00563000
*        2 SAVF8SAG64RS0 AsaxmacP64,    /* REGISTER 0                */ 00564000
*        2 SAVF8SAG64RS1 AsaxmacP64,    /* REGISTER 1                */ 00565000
*        2 SAVF8SAG64RS2 AsaxmacP64,    /* REGISTER 2                */ 00566000
*        2 SAVF8SAG64RS3 AsaxmacP64,    /* REGISTER 3                */ 00567000
*        2 SAVF8SAG64RS4 AsaxmacP64,    /* REGISTER 4                */ 00568000
*        2 SAVF8SAG64RS5 AsaxmacP64,    /* REGISTER 5                */ 00569000
*        2 SAVF8SAG64RS6 AsaxmacP64,    /* REGISTER 6                */ 00570000
*        2 SAVF8SAG64RS7 AsaxmacP64,    /* REGISTER 7                */ 00571000
*        2 SAVF8SAG64RS8 AsaxmacP64,    /* REGISTER 8                */ 00572000
*        2 SAVF8SAG64RS9 AsaxmacP64,    /* REGISTER 9                */ 00573000
*        2 SAVF8SAG64RS10 AsaxmacP64, /* REGISTER 10                 */ 00574000
*        2 SAVF8SAG64RS11 AsaxmacP64, /* REGISTER 11                 */ 00575000
*        2 SAVF8SAG64RS12 AsaxmacP64, /* REGISTER 12                 */ 00576000
*        2 SAVF8SAPREV AsaxmacP64,      /* ADDR OF PREVIOUS SAVEAREA */ 00577000
*        2 SAVF8SANEXT AsaxmacP64,      /* ADDR OF NEXT SAVE AREA    */ 00578000
*        2 SAVF8SAAR14 Fixed(32),       /* AR 14                     */ 00579000
*        2 SAVF8SAAR15 Fixed(32),       /* AR 15                     */ 00580000
*        2 SAVF8SAAR0 Fixed(32),        /* AR 0                      */ 00581000
*        2 SAVF8SAAR1 Fixed(32),        /* AR 1                      */ 00582000
*        2 SAVF8SAAR2 Fixed(32),        /* AR 2                      */ 00583000
*        2 SAVF8SAAR3 Fixed(32),        /* AR 3                      */ 00584000
*        2 SAVF8SAAR4 Fixed(32),        /* AR 4                      */ 00585000
*        2 SAVF8SAAR5 Fixed(32),        /* AR 5                      */ 00586000
*        2 SAVF8SAAR6 Fixed(32),        /* AR 6                      */ 00587000
*        2 SAVF8SAAR7 Fixed(32),        /* AR 7                      */ 00588000
*        2 SAVF8SAAR8 Fixed(32),        /* AR 8                      */ 00589000
*        2 SAVF8SAAR9 Fixed(32),        /* AR 9                      */ 00590000
*        2 SAVF8SAAR10 Fixed(32),       /* AR 10                     */ 00591000
*        2 SAVF8SAAR11 Fixed(32),       /* AR 11                     */ 00592000
*        2 SAVF8SAAR12 Fixed(32),       /* AR 12                     */ 00593000
*        2 SAVF8SAAR13 Fixed(32),       /* ALET of previous save area   00594000
*                                          or undefined              */ 00595000
*        2 SAVF8SAASC Fixed(32),        /* ASC mode of caller        */ 00596000
*        2 * CHAR(4),                   /* Undefined                 */ 00597000
*        2 SAVF8SAG64HS0 PTR(31),       /* High half of caller's R0  */ 00598000
*        2 SAVF8SAG64HS1 PTR(31),       /* High half of caller's R1  */ 00599000
*        2 SAVF8SAG64HS2 PTR(31),       /* High half of caller's R2  */ 00600000
*        2 SAVF8SAG64HS3 PTR(31),       /* High half of caller's R3  */ 00601000
*        2 SAVF8SAG64HS4 PTR(31),       /* High half of caller's R4  */ 00602000
*        2 SAVF8SAG64HS5 PTR(31),       /* High half of caller's R5  */ 00603000
*        2 SAVF8SAG64HS6 PTR(31),       /* High half of caller's R6  */ 00604000
*        2 SAVF8SAG64HS7 PTR(31),       /* High half of caller's R7  */ 00605000
*        2 SAVF8SAG64HS8 PTR(31),       /* High half of caller's R8  */ 00606000
*        2 SAVF8SAG64HS9 PTR(31),       /* High half of caller's R9  */ 00607000
*        2 SAVF8SAG64HS10 PTR(31),      /* High half of caller's R10 */ 00608000
*        2 SAVF8SAG64HS11 PTR(31),      /* High half of caller's R11 */ 00609000
*        2 SAVF8SAG64HS12 PTR(31),      /* High half of caller's R12 */ 00610000
*        2 SAVF8SAG64HS13 PTR(31),      /* High half of caller's R13 */ 00611000
*        2 SAVF8SAG64HS14 PTR(31),      /* High half of caller's R14 */ 00612000
*        2 SAVF8SAG64HS15 PTR(31),      /* High half of caller's R15 */ 00613000
*        2 * CHAR(8);                   /* Undefined                 */ 00614000
* DCL  SAVF8SAID_VALUE CHAR(LENGTH(SAVF8SA.SAVF8SAID))                  00615000
*            CONSTANT('F8SA');                                          00616000
* @LOGIC;                                                               00617000
* #PRAGMA TOOL=CBGEN.                                                   00618000
* #USEORG.                                                              00619000
* #ALIGNOP.                                                             00620000
* #EPRAGMA.                                                             00621000
* @ENDLOGIC;                                                            00622000
*%IHASAVER_PLS:;                                                        00623000
*/* End of PL/X Source                                               */ 00624000
* %IF IHASAVER_LIST = 'NO' !                                            00625000
*    ZCBPRINT = 'NO' %THEN                                              00626000
* %DO;                                                                  00627000
*   @LIST POP NOECHO;                                                   00628000
* %END;                                                                 00629000
* %END;                                                                 00630000
