*        %GOTO SCBBSL1;                                              /* 00010000
         MACRO                                                          00020000
         IHASCB &DSECT=YES                                           */ 00030000
*%SCBBSL1 : ;                                                           00040000
*/** START OF SPECIFICATIONS *****************************************/ 00050000
*/*                                                                  */ 00060000
*/* PROPRIETARY STATEMENT:                                           */ 00070000
*/* 5694-A01                                                         */ 00080000
*/* COPYRIGHT IBM CORP. 1980,2010                                    */ 00090000
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00100000
*/*                                                                  */ 00110000
*/* STATUS = HBB7770                                                 */ 00120000
*/*                                                                  */ 00130000
*/*01* EXTERNAL CLASSIFICATION:                                      */ 00140000
*/*02* NOTPI: BASE                                                   */ 00150000
*/*02* PI: INCLUDE                                                   */ 00160000
*/*01* END OF EXTERNAL CLASSIFICATION:                               */ 00161000
*/*                                                                  */ 00162000
*/* MACRO NAME:  IHASCB                                              */ 00163000
*/*                                                                  */ 00164000
*/* DESCRIPTIVE NAME:  STAE Control Block                            */ 00165000
*/*                                                                  */ 00166000
*/* DSECT NAME: SCB, SCBX                                            */ 00167000
*/*                                                                  */ 00168000
*/* COMPONENT: Recovery Termination Manager (SCRTM)                  */ 00168100
*/*                                                                  */ 00168200
*/* EYE CATCHER: None                                                */ 00168300
*/*                                                                  */ 00168400
*/* STORAGE ATTRIBUTES:                                              */ 00168500
*/*  SUBPOOL:  255                                                   */ 00168600
*/*  KEY:  0                                                         */ 00168700
*/*                                                                  */ 00168800
*/* SIZE: 48 bytes                                                   */ 00168900
*/*                                                                  */ 00169000
*/* CREATED BY: IEAVSTA0, IEAVSTA1                                   */ 00170000
*/*                                                                  */ 00171000
*/* POINTED TO BY:                                                   */ 00172000
*/*     TCBSTABB field of the TCB data area                          */ 00173000
*/*     SCBCHAIN field of the SCB data area                          */ 00174000
*/*                                                                  */ 00174100
*/* SERIALIZATION: Task Active                                       */ 00174200
*/*                                                                  */ 00174300
*/* FUNCTION:                                                        */ 00174400
*/*     The SCB is used to make STAE/ESTAE/ESTAEX recovery routines  */ 00174500
*/*     known to the system.                                         */ 00174600
*/*                                                                  */ 00174700
*/* METHOD OF ACCESS:                                                */ 00174800
*/* ASM:                                                             */ 00174900
*/*            IHASCB                                                */ 00175000
*/*                                                                  */ 00176000
*/* PLS:                                                             */ 00177000
*/*           DCL SCBPTR PTR                                         */ 00178000
*/*           %INCLUDE SYSLIB(IHASCB)                                */ 00179000
*/*                                                                  */ 00180000
*/* NOTE - THE FIRST FOUR BITS IN SCBFLGS1 INDICATE WHICH TYPE       */ 00180100
*/*        OF EXIT THE SCB REPRESENTS,                               */ 00180200
*/*          TYPE OF EXIT -->  STAE  STAI  ESTAE ESTAI       @G860P38*/ 00180300
*/*                 SCBSTAI      0     1     0     1         @G860P38*/ 00180400
*/*                 SCBESTAE     0     0     1     1         @G860P38*/ 00180500
*/*                                                                  */ 00180600
*/* CHANGE ACTIVITY:                                                 */ 00180700
*/*                 - SCP3 ,ADDED SCBTOKEN                   @G91CP2F*/ 00180800
*/*                 - MVS/SYSTEM PRODUCT RELEASE 2 ,ADDED AN         */ 00180900
*/*                   EXTENSION TO STORE THE KEYMASK AND A           */ 00181000
*/*                   POINTER TO THAT EXTENSION.             @G381P2F*/ 00182000
*/*                   ADDED SCBSTAUT.                        @G382P1Q*/ 00183000
*/*                   EXTENSION ADDED TO STORE TOKEN VALUE . @G38AP38*/ 00184000
*/*                 - MVS/SYSTEM PRODUCT VERSION 2 RELEASE  1        */ 00185000
*/*                                                          @G860P38*/ 00186000
*/* $L1=AR     ,HBB3310,850916,PDA8: SUPPORT FOR ARs             @L1A*/ 00186100
*/* $D1=DCR0059,HBB3310,861029,PDU8: SUPPORT FOR DEFERRED CANCEL/    */ 00186200
*/*                                  DETACH PROCESSING           @D1A*/ 00186300
*/* $P1=PC40445,HBB3310,861229,PDU8: SWAP SCBPC AND SCBASCM BIT  @P1A*/ 00186400
*/* $P2=PC40499,HBB3310,861229,PDU8: SWAP SCBDUMMY AND SCBNCNL       */ 00186500
*/*                                  BITS                        @P2A*/ 00186600
*/* $01=OY04773,HBB3310,870603,PDA8: Fix Storage Fragmentation       */ 00186700
*/* $P3=PR20011 HBB6601 950908 PDKD: SC1CM compid split - also       */ 00186800
*/*                                  rewrote prolog for SHOWHDR  @P3A*/ 00186900
*/* $P4=PR20013 HBB6601 950914 PDKD: Update CDPI                 @P4A*/ 00187000
*/* $L2=64BITRTM HBB7703 971031 PDKD: Support for 64-bit             */ 00188000
*/* $02=OW57742  HBB7705 021230 PDKD: SCBPERCD                       */ 00189000
*/* $L3=LXREU    HBB7709 030801 PDXB: ASN-and-LX-Reuse Facility      */ 00190000
*/* $P5=PJK1269  HBB7709 031203 PDXB: Make $L3 change compatible     */ 00190100
*/* $P6=ME12247  HBB7750 071231 PDKD: Make it more clear where the   */ 00190200
*/*                                   parm address is kept when      */ 00190300
*/*                                   an Estaex is set in AMODE64    */ 00190400
*/* $L4=RTMR12   HBB7770 090505 PDKD: SPIEOVERRIDE                   */ 00190505
*/*                                                                  */ 00190600
*/** END OF SPECIFICATIONS *******************************************/ 00190700
*        %GOTO SCBBSL;                                              /*  00190800
         AIF  ('&DSECT' EQ 'YES').SCB001                                00190900
SCB      DS   0D -                                                      00191000
         AGO  .SCB002                                                   00191100
.SCB001  ANOP                                                           00192000
SCB      DSECT ,        SCBPTR                                          00193000
.SCB002  SPACE 2                                                        00194000
SCBCHAIN DS    A        POINTER TO NEXT SCB ON CHAIN                    00195000
SCBEXIT  DS    A        POINTER TO USER WRITTEN EXIT ROUTINE            00196000
SCBPARM  DS    0A       ADDRESS OF PARAMETER LIST FOR STA EXIT          00197000
SCBFLGS1 DS    B        FIRST FLAG BYTE                                 00198000
SCBSTAI  EQU   X'80'    STAI SCB                                        00199000
SCBASCM  EQU   X'40'    ADDRESS SPACE CONTROL MODE FOR EXIT ROUTINE     00200000
*                       0 = PRIMARY,1 = AR MODE                    @P1M 00210000
SCBNCNL  EQU   X'20'    NO CANCEL - ROUTINE RUNS PROTECTED FROM    @P2M 00220000
*                       CANCELS AND DETACHES                       @P2M 00230000
SCBESTAE EQU   X'10'    ESTAE INDICATOR                                 00240000
SCBTOKEN EQU   X'08'    ESTAE ESTABLISHED WITH TOKEN         @G91CP2F   00250000
SCBASYNC EQU   X'04'    ALLOW ASYNCHRONOUS INTERRUPTS                   00260000
SCBIOPRC EQU   X'03'    I/O PROCESSING OPTION, BITS 6 AND 7--           00270000
*                           00 - QUIESCE I/O                            00280000
*                           01 - HALT I/O                               00290000
*                           10 - BYPASS I/O INTERVENTION                00300000
*                           11 - (RESERVED)                             00310000
SCBNOIOP EQU   X'02'    BYPASS I/O INTERVENTION                         00320000
SCBHALT  EQU   X'01'    HALT I/O                                        00330000
SCBPARMA DS    AL3      24 bit user parameter list address used for     00340000
*                       FESTAE only - otherwise non-FESTAE flags   @02C 00350000
SCBAM64  EQU   X'80'    Extended AMODE - 64. Only valid            @L2A 00360000
*                       when this is not a STAE/STAI.                   00370000
SCBPERCD EQU   X'40'    The recovery routine represented by this SCB    00380000
*                       has percolated                             @02A 00390000
SCBOWNR  DS    0A       TCB/RB ADDRESS CONTROLLING THIS SCB             00400000
SCBFLGS2 DS    B        SECOND FLAG BYTE                                00410000
SCBAMODE EQU   X'80'    USER IN 31 BIT ADDRESSING MODE         @G860P38 00420000
SCBAM31  EQU   X'80'    USER IN 31 BIT ADDRESSING MODE             @L2A 00430000
SCBXCTL2 EQU   X'40'    RETAIN THIS SCB ACROSS XCTL                     00440000
SCBARRFL EQU   X'20'    ON, THIS SCB WAS CREATED BY RTM2 TO MANAGE AN   00450000
*        ASSOCIATED RECOVERY ROUTINE FROM THE LINKAGE STACK        @L1A 00460000
SCBINUSE EQU   X'10'    THIS SCB IS IN USE OR HAS PERCOLATED OR ABENDED 00470000
SCBLO31 EQU    X'08'    SDWA is LOC 31                             @L2A 00480000
SCBPC    EQU   X'04'    PC ESTAE TYPE SCB                          @P1M 00490000
SCBKEY0  EQU   X'02'    USER IN KEY 0                                   00500000
SCBSUPER EQU   X'01'    USER IN SUPERVISOR MODE                         00510000
SCBOWNRA DS    AL3      RB ADDRESS IF STAE,                             00520000
*                       TCB ADDRESS IF STAI.                            00530000
SCBDATA  DS    0A       FLAGS AND DATA FIELD                            00540000
SCBFLGS3 DS    B        OPTION FLAGS                                    00550000
SCBSTAUT EQU   X'80'    STAE REQUESTOR IS AUTHORIZED           @G382P1Q 00560000
SCBTERMI EQU   X'40'    AUTHORIZED FOR TERM PROCESSING                  00570000
SCBRECRD EQU   X'20'    ERROR RECORD TO BE WRITTEN TO SYS1.LOGREC       00580000
SCBDUMMY EQU   X'10'    DUMMY SCB - (WILL NOT BE SCHEDULED)        @P2M 00590000
SCBPRNTR EQU   X'08'    SCB PREVIOUSLY ENTERED                          00600000
SCBBRNTR EQU   X'04'    FESTAE                                          00610000
SCBRB    EQU   X'02'    SAVED STATUS OF RBSCB                      @L1A 00620000
SCBUNSS  EQU   X'01'    UNSTACK SUPPRESS STATUS OF THE LINKAGE STACK    00630000
*                       ENTRY THAT WAS CURRENT WHEN THIS SCB WAS        00640000
*                       CREATED.                                        00650000
*                       1 - UNSTACK SUPPRESS WAS ACTIVE                 00660000
*                       0 - UNSTACK SUPPRESS WAS INACTIVE          @L1A 00670000
SCBPKEY  DS    C        PROGRAM KEY                                     00680000
SCBID    DS    C        SCB IDENTIFIER                                  00690000
SCBPCFLG DS    XL1      PC ESTAE USER FLAGS, VALID IF SCBPC IS ON  @L1C 00700000
SCBXPTR  DS    A        POINTER TO SCB EXTENSION             @G381P2F   00710000
SCBFTIME EQU   X'80'    SCB WAS IN THE FIRST GETMAIN               @01A 00720000
SCBLEN   EQU   *-SCB    LENGTH OF SCB                                   00730000
         SPACE 2                                             @G381P2F   00740000
SCBX     DSECT ,        SCBXPTR - SCB EXTENSION              @G381P2F   00750000
         DS    XL8      Reserved                                 @P5C   00760000
SCBXTOKN DS    F        ESTAE TOKEN VALUE                        @L1A   00770000
SCBXPRMS DS    0CL8     64 bit user parameter list address       @P6A   00780000
SCBXPARM DS    A        31 BIT USER PARAMETER LIST ADDRESS   @G860P38   00790000
SCBXALET DS    F        ALET ASSOCIATED WITH PARAM VALUE         @L1A   00800000
SCBXLSEA DS    A        LINKAGE STACK ENTRY ADDRESS              @L1A   00810000
SCBXCR34 DS    0CL16    CONTROL REGISTERS 3 AND 4 (WITH EAX)     @P5M   00820000
SCBXSINS DS    F        Secondary ASTE Instance#                 @P5M   00830000
SCBXKMSK DS    CL2      KEYMASK                                  @P5M   00840000
SCBXSASN DS    CL2      SECONDARY ASN                            @P5M   00850000
SCBXPINS DS    F        Primary ASTE Instance#                   @P5M   00860000
SCBXEAX  DS    CL2      EXTENDED AUTH. INDEX                     @P5M   00870000
SCBXPASN DS    CL2      PRIMARY   ASN                            @P5M   00880000
SCBXLEN  EQU   *-SCBX   LENGTH OF SCB EXTENSION              @G381P2F   00890000
SCBTLEN  EQU   SCBLEN+SCBXLEN   TOTAL LENGTH FOR GETMAIN     @G381P2F   00900000
         MEND  , */                                                     00910000
*%SCBBSL  :  ;                                                          00920000
*DECLARE                                                                00930000
*  1 SCB BDY(DWORD) BASED(SCBPTR), /*                            @L1C*/ 00940000
*   2 SCBCHAIN PTR(31),            /* POINTER TO NEXT SCB ON CHAIN   */ 00950000
*   2 SCBEXIT  PTR(31),            /* POINTER TO USER WRITTEN EXIT      00960000
*                                     ROUTINE                        */ 00970000
*   2 SCBPARM  PTR(31),            /* ADDRESS OF PARAMETER LIST FOR     00980000
*                                     STA EXIT                       */ 00990000
*    3 SCBFLGS1 CHAR(1),           /* FIRST FLAG BYTE                */ 01000000
*     4 SCBSTAI  BIT(1),           /* STAI SCB                       */ 01010000
*     4 SCBASCM  BIT(1),           /* ADDRESS SPACE CONTROL MODE FOR    01020000
*                                     EXIT ROUTINE (0 = PRIMARY,        01030000
*                                     1 = AR MODE.               @P1M*/ 01040000
*     4 SCBNCNL  BIT(1),           /* NO CANCEL - ROUTINE RUNS          01050000
*                                     PROTECTED FROM CANCELS AND        01060000
*                                     DETACHES                   @P2M*/ 01070000
*     4 SCBESTAE BIT(1),           /* ESTAE INDICATOR                */ 01080000
*     4 SCBTOKEN BIT(1),           /* ESTAE ESTABLISHED WITH TOKEN      01090000
*                                                            @G91CP2F*/ 01100000
*     4 SCBASYNC BIT(1),           /* ALLOW ASYNCHRONOUS INTERRUPTS  */ 01110000
*     4 SCBIOPRC BIT(2),           /* I/O PROCESSING OPTION, BITS 6 & 7 01120000
*                                     00 - QUIESCE I/O                  01130000
*                                     01 - HALT I/O                     01140000
*                                     10 - BYPASS I/O INTERVENTION      01150000
*                                     11 - (RESERVED)                */ 01160000
*      5 SCBNOIOP BIT(1),          /* BYPASS I/O INTERVENTION        */ 01170000
*      5 SCBHALT  BIT(1),          /* HALT I/O                       */ 01180000
*    3 SCBPARMA PTR(24) BDY(WORD,2), /* 24 bit user parameter list      01190000
*                                     address used for FESTAE only -    01200000
*                                     otherwise non-FESTAE flags @02C*/ 01210000
*      5 SCBAM64 BIT(1),           /* Extended AMODE - 64. Only valid   01220000
*                                     when this is not a STAE/STAI      01230000
*                                     and not a FESTAE                  01240000
*                                                                @L2A*/ 01250000
*      5 SCBPERCD BIT(1),          /* The recovery routine represented  01260000
*                                     by this SCB has percolated @02A*/ 01270000
*   2 SCBOWNR  PTR(31),            /* TCB/RB ADDRESS CONTROLLING SCB */ 01280000
*    3 SCBFLGS2 CHAR(1),           /* SECOND FLAG BYTE               */ 01290000
*     4 SCBAMODE BIT(1),           /* USER IN 31 BIT ADDRESSING MODE    01300000
*                                                            @G860P38*/ 01310000
*       5 SCBAM31 BIT(1),          /* USER IN 31 BIT ADDRESSING MODE    01320000
*                                                                @L2A*/ 01330000
*     4 SCBXCTL2 BIT(1),           /* RETAIN THIS SCB ACROSS XCTL    */ 01340000
*     4 SCBARRFL BIT(1),           /* THIS SCB WAS CREATED BY RTM2 TO   01350000
*                                     MANAGE AN ASSOCIATED RECOVERY     01360000
*                                 ROUTINE FROM THE LINKAGE STACK @L1A*/ 01370000
*     4 SCBINUSE BIT(1),           /* THIS SCB IN USE                */ 01380000
*     4 SCBLO31 BIT(1),            /* SDWA is LOC 31             @L2A*/ 01390000
*     4 SCBPC    BIT(1),           /* PC ESTAE TYPE SCB          @P1M*/ 01400000
*     4 SCBKEY0  BIT(1),           /* USER IN KEY 0-7                */ 01410000
*     4 SCBSUPER BIT(1),           /* USER IN SUPERVISOR MODE        */ 01420000
*    3 SCBOWNRA  PTR(24)  BDY(WORD,2), /* RB ADDRESS IF STAE,           01430000
*                                         TCB ADDRESS IF STAI.       */ 01440000
*   2 SCBDATA  PTR(31),            /* FLAGS AND DATA FIELD           */ 01450000
*    3 SCBFLGS3 CHAR(1),           /* OPTION FLAGS                   */ 01460000
*     4 SCBSTAUT BIT(1),           /* STAE REQUESTOR IS AUTHORIZED      01470000
*                                                            @G382P1Q*/ 01480000
*     4 SCBTERMI BIT(1),           /* AUTHORIZED FOR SPECIAL TERM       01490000
*                                     PROCESSING                     */ 01500000
*     4 SCBRECRD BIT(1),           /* ON INDICATES ERROR RECORD IS TO   01510000
*                                     BE WRITTEN TO SYS1.LOGREC      */ 01520000
*     4 SCBDUMMY BIT(1),           /* DUMMY SCB - (WILL NOT BE          01530000
*                                     SCHEDULED).                @P2M*/ 01540000
*     4 SCBPRNTR BIT(1),           /* SCB PREVIOUSLY ENTERED         */ 01550000
*     4 SCBBRNTR BIT(1),           /* FESTAE                         */ 01560000
*     4 SCBRB    BIT(1),           /* SAVED STATUS OF RBSCB      @L1A*/ 01570000
*     4 SCBUNSS  BIT(1),           /* UNSTACK SUPPRESS STATUS OF THE    01580000
*                                     LINKAGE STACK ENTRY THAT WAS      01590000
*                                     CURRENT WHEN THIS SCB WAS CREATED 01600000
*                                     1 - UNSTACK SUPPRESS WAS ACTIVE   01610000
*                                     0 - UNSTACK SUPPRESS WAS INACTIVE 01620000
*                                                                @L1A*/ 01630000
*    3 SCBPKEY  CHAR(1),           /* PROGRAM KEY                    */ 01640000
*    3 SCBID    CHAR(1),           /* SCB IDENTIFIER                 */ 01650000
*    3 SCBPCFLG BIT(8),            /* PC ESTAE USER FLAGS, VALID IF     01660000
*                                     SCBPC IS ON                @L1C*/ 01670000
*     4 SCBPTERM BIT(1),           /* Request for TERM ESTAE     @L1A*/ 01680000
*     4 SCBPREC  BIT(1),           /* Request for RECORDing      @L1A*/ 01690000
*     4 SCBPXCTL BIT(1),           /* Request for XCTL           @L1A*/ 01700000
*     4 SCBPNCNL BIT(1),           /* Request for CANCEL=NO      @D1C*/ 01710000
*     4 SCBSPOV  BIT(1),           /* SPIEOVERRIDE requested     @L4C*/ 01720004
*     4 SCBPASYN BIT(1),           /* Request for ASYNCH         @L1A*/ 01730000
*     4 SCBPIO   BIT(2),           /* I/O request bits                  01740000
*                                     00 - QUIESCE I/O                  01750000
*                                     01 - HALT I/O                     01760000
*                                     10 - BYPASS I/O INTERVENTION      01770000
*                                     11 - (RESERVED)            @L1A*/ 01780000
*       5 SCBPNOIO BIT(1),         /* Bypass I/O intervention    @L1A*/ 01790000
*       5 SCBPHALT BIT(1),         /* Halt I/O                   @L1A*/ 01800000
*   2 SCBXPTR  PTR(31),            /* POINTER TO SCB EXTENSION          01810000
*                                                            @G381P2F*/ 01820000
*     3 SCBFTIME BIT(1),           /* SCB WAS IN THE FIRST GETMAIN      01830000
*                                                                @01A*/ 01840000
* 1 SCBX BASED(SCBXPTR) BDY(DWORD),/* SCB EXTENSION              @L1C*/ 01850000
*   3 * CHAR(8),                   /* Reserved                   @P5C*/ 01860000
*   3 SCBXTOKN BIT(32),            /* ESTAE TOKEN VALUE          @L1C*/ 01870000
*   3 SCBXPRMS,                    /* 64 bit user parameter list        01880000
*                                     address                    @P6C*/ 01890000
*     5 SCBXPARM PTR(31),          /* 31 BIT USER PARAMETER LIST        01900000
*                                     ADDRESS                @G860P38*/ 01910000
*     5 SCBXALET PTR(31),          /* ALET ASSOCIATED WITH PARAM @L1A*/ 01920000
*   3 SCBXLSEA PTR(31),            /* LINKAGE STACK ENTRY ADDR   @L1A*/ 01930000
*   3 SCBXCR34 CHAR(16) BDY(DWORD),/* CONTROL REGISTERS 3 AND 4  @P5M*/ 01940000
*     5 SCBXSINS FIXED(32),        /* Secondary ASTE Instance#   @P5M*/ 01950000
*     5 SCBXKMSK CHAR(2),          /* KEYMASK                    @P5M*/ 01960000
*     5 SCBXSASN CHAR(2),          /* SECONDARY ASN              @P5M*/ 01970000
*     5 SCBXPINS FIXED(32),        /* Primary ASTE Instance#     @P5M*/ 01980000
*     5 SCBXEAX    CHAR(2),        /* EXTENDED AUTH. INDEX       @P5M*/ 01990000
*     5 SCBXPASN CHAR(2);          /* PRIMARY   ASN              @P5M*/ 02000000
*%SCBLEN='LENGTH(SCB)';            /* LENGTH OF SCB                  */ 02010000
*%SCBXLEN='LENGTH(SCBX)';          /* LENGTH OF SCB EXTENSION           02020000
*                                                            @G381P2F*/ 02030000
*%SCBTLEN='(LENGTH(SCB)+LENGTH(SCBX))'; /* TOTAL LENGTH OF SCB FOR      02040000
*                                     GETMAIN                    @01C*/ 02050000
*%SCB_ID='''DB''X';                /* SCB identifier             @L1A*/ 02060000
