*                                                                       00001000
* %DCL IHASDEXI_INCLUDED CHAR EXT;                                      00002000
* %DEACTIVATE IHASDEXI_INCLUDED;                                        00003000
* %IF IHASDEXI_INCLUDED = '' %THEN                                      00004000
* %DO;                                                                  00005000
*/* Macro made bi-lingual on 20293. CBGEN compile date 20027         */ 00006000
*% /*                                                                   00007000
         MACRO                                                          00008000
         IHASDEXI &DSECT=YES,&LIST=YES,&TITLE=YES,&SDEXI=YES,          *00009000
               &SDEXIALST=COND,&SDEXIDRPX=COND,&SDEXIDRPX64=COND        00010000
         GBLC  &IHASDEXI_INCLUDED                                       00011000
         GBLC  &ZCBPRINT                                                00012000
&IHASDEXI_INCLUDED SETC 'YES'                                           00013000
         AIF   ('&LIST' EQ 'NONE').P0                                   00014000
         AIF   ('&TITLE' EQ 'NO').P5                                    00015000
 TITLE   'IHASDEXI  - SDUMP Exit information                         '  00016000
.P5      ANOP                                                           00017000
**/ IHASDEXI_1:;                                                        00018000
*/* START OF SPECIFICATIONS ******************************************* 00019000
*                                                                       00020000
* $MAC(IHASDEXI) COMP(SCDMP) PROD(HBB77A0):                             00021000
**/                                                                     00022000
*/*01* PROPRIETARY STATEMENT=                                        */ 00023000
*/***PROPRIETARY_STATEMENT********************************************/ 00024000
*/*  Proprietary Statement =                                         */ 00025000
*/*                                                                  */ 00026000
*/*              LICENSED MATERIALS - PROPERTY OF IBM                */ 00027000
*/*              5650-ZOS COPYRIGHT IBM CORP 1993, 2019              */ 00028000
*/*                                                                  */ 00029000
*/*  Status = HBB77C0                                                */ 00030000
*/*                                                              @L6C*/ 00031000
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 00032000
*/*                                                                     00033000
*01* DESCRIPTIVE NAME:  SDUMP Exit information                          00034000
*02*  ACRONYM:  SDEXI                                                   00035000
*                                                                       00036000
*01* MACRO NAME:  IHASDEXI                                              00037000
*                                                                       00038000
*01* EXTERNAL CLASSIFICATION: PI                                        00039000
*01* END OF EXTERNAL CLASSIFICATION:                                    00040000
*                                                                       00041000
*01* DSECT NAME:                                                        00042000
*02*  SDEXI                                                             00043000
*02*  SDEXIALST                                                         00044000
*02*  SDEXIDRPX                                                         00045000
*                                                                       00046000
*01* COMPONENT:  SDUMP (SCDMP)                                     @D1C 00047000
*                                                                       00048000
*01* EYE-CATCHER:  NONE                                                 00049000
*                                                                       00050000
*01* STORAGE ATTRIBUTES:                                                00051000
*02*  SUBPOOL:  231                                                     00052000
*02*  KEY:  0                                                           00053000
*02*  RESIDENCY:  Above 16M                                             00054000
*                                                                       00055000
*01* SIZE:                                                              00056000
*                SDEXIDRPX64 -- X'0040' bytes                           00057000
*                SDEXI       -- X'0070' bytes                           00058000
*                SDEXIWORK -- X'00C8' bytes                             00059000
*                SDEXISAVE -- X'0048' bytes                             00060000
*                SDEXIALST   -- X'0004' bytes                           00061000
*                SDEXIDRPX   -- X'0040' bytes                           00062000
*                SDEXIUTokenArea -- X'0100' bytes                @L9A   00063000
*                                                                       00064000
*01* CREATED BY:                                                        00065000
*     Created by SDUMP, passed to SDUMP local/global exit(s)            00066000
*                                                                       00067000
*01* POINTED TO BY:                                                     00068000
*     R1 on entry to SDUMP local/global exit(s)                         00069000
*                                                                       00070000
*01* SERIALIZATION:                                                     00071000
*     None required                                                     00072000
*                                                                       00073000
*01* FUNCTION:                                                          00074000
*02* Maps the information needed by the SDUMP local/global exit(s)      00075000
*                                                                       00076000
*01* METHOD OF ACCESS:                                                  00077000
*02*  ASM:                                                              00078000
*      IHASDEXI                                                         00079000
*           DSECT=YES!NO  -- Request DSECT definition                   00080000
*           SDEXI=YES!NO!COND -- Request mapping of parameter           00081000
*                            information                                00082000
*                            USING on SDEXI                             00083000
*           SDEXIALST=YES!NO!COND -- Mapping of Asid list               00084000
*           SDEXIDRPX=YES!NO!COND -- Mapping of DRPX                    00085000
*     Default: DSECT=YES,SDEXI=YES,                                     00086000
*              SDEXIALST=COND,                                          00087000
*              SDEXIDRPX=COND                                           00088000
*02*  PL/AS:                                                            00089000
*      %INCLUDE SYSLIB(IHASDEXI)                                        00090000
*                                                                       00091000
*01* DELETED BY:  SDUMP                                                 00092000
*                                                                       00093000
*01* FREQUENCY:  One per call to SDUMP local/global exit                00094000
*                                                                       00095000
*01* DEPENDENCIES:  None                                                00096000
*                                                                       00097000
*01* DISTRIBUTION LIBRARY:  AMACLIB                                     00098000
*                                                                       00099000
*01* CHANGE ACTIVITY:                                                   00100000
*   $L0=SDMPECBG ,HBB5510,921217,PD00XB: Local/Global exit              00101000
*   $L1=SDMPE    ,HBB5510,921217,PD00XB: Local/Global exit              00102000
*   $01=OW01117  ,HBB5510,931217,PDHT:   Update prolog             @01A 00103000
*   $P1=PN71270  ,HBB5520,941006,PDHT:   Update SDATA options      @P1A 00104000
*   $D1=DR20001   HBB6601 950907 PD00KV: Split from SC1CM          @D1A 00105000
*   $L2=TSVCD    ,JBB6607,980413,PDHT:   Tailored SVC Dump         @L2A 00106000
*   $L3=64BITNIP HBB7703 981204 PD00XB: ESAME                      @L3A 00107000
*   $L4=64BITSDU HBB7703 000113 PDHT:   DRPX v2 support            @L4A 00108000
*   $L5=ME04648  HBB7730 060201 PDPG:   64bit Exit Capture         @L5A 00109000
*   $L6=ME09110  HBB7740 070122 PDKV:   Pass REMOTE dump indicator      00110000
*      =ME10023  HBB7750 070509 PDE1:   IPLAW prolog cleanup            00111000
*      =ME15050  HBB7760 081119 PDKV:   SdexiOrAd only for PASN=HASN    00112000
*   $L7=SDHCSA   HBB77A0 131121 PDPS:   HVCOMMON solution (ME26734)     00113000
*                                        Define new SDATA options for   00114000
*                                        high CSA                       00115000
*   $L8=SDUTKN   HBB77A0 140405 PDPS:   UserToken solution (ME27196)    00116000
*                                        Define an address to pass in   00117000
*                                        a pointer to UTOKEN area       00118000
*   $L9=SDUTKN   HBB77A0 150220 PDPS:   UserToken support for Exits     00119000
*                                       (ME28370 - Available to global  00120000
*                                        exits only)                    00121000
*   $A2=OA57570  HBB77B0 150220 PDPS:   Allow Exits to mark their       00122000
*                                       storage's sensitive attributes  00123000
*      =W360237  HBB77D0 201020,PDTY:   Add comment on SensitivityAttr  00124000
*                                                                       00125000
* END OF SPECIFICATIONS *********************************************/  00126000
*% /*                                                                   00127000
.P0      ANOP                                                           00128000
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 00129000
         AIF   ('&LIST' EQ 'YES').P2                                    00130000
.P1      ANOP                                                           00131000
         PUSH  PRINT                                                    00132000
         PRINT OFF                                                      00133000
.P2      ANOP                                                           00134000
         AIF   ('&SDEXI' EQ 'NO').L0002                                 00135000
         AIF   ('&DSECT' EQ 'YES').L0003                                00136000
         AIF   ('&SDEXI' NE 'YES').L0002                                00137000
.L0003   ANOP                                                           00138000
*                                                                       00139000
*   Start of PL/X Source                                                00140000
*                                                                       00141000
*                                                                       00142000
         AIF   ('&DSECT' EQ 'YES').L0004                                00143000
SDEXI    DS    0F        SVC Dump exit parameter list fields for use   *00144000
                         by, or to be filled in by, exit                00145000
         AGO   .L0005                                                   00146000
.L0004   ANOP                                                           00147000
SDEXI    DSECT           SVC Dump exit parameter list fields for use   *00148000
                         by, or to be filled in by, exit                00149000
.L0005   ANOP                                                           00150000
SDEXICOMM DS   CL12      Data common to SDEXP and SDEXI - maintained   *00151000
                         for consistency reasons                        00152000
         ORG   SDEXICOMM                                                00153000
SDEXICOM1 DS   CL10      Reserved                                       00154000
SDEXIFLAG1 DS  CL1       MISC flags                                     00155000
*  Bit definitions:                                                     00156000
SDEXISENSITIVE EQU X'20' If set, it indicates that that Exit has       *00157000
                         requested to tag their storage as             *00158000
                         sensitive=yes. This means, it will be         *00159000
                         redacted when the dump, captured on a         *00160000
                         qualifing processor, is post-processed.        00161000
SDEXINOTSENSITIVE EQU X'10' If set, it indicates that that Exit has    *00162000
                         requested to tag their storage as             *00163000
                         sensitive=no. This means, it will be not be   *00164000
                         redacted if the dump, captured on a           *00165000
                         qualifying processor, is post-processed.       00166000
SDEXIFLAG2 DS  CL1       MISC flags                                     00167000
SDEXIBFAD DS   A         Address of data buffer. Set by SVC Dump. For  *00168000
                         use by exit.                                   00169000
SDEXIBFLN DS   F         Length of data buffer (4096 bytes). For use   *00170000
                         by exit.                                       00171000
SDEXIORAD DS   A         Address of output routine. Set by SVC Dump.   *00172000
                         For use by exit. Interface to routine:        *00173000
                         AMODE=31. PASN=HASN=SASN Task mode. Enabled,  *00174000
                         no locks held, no EUT FRRs. Key 0, Supervisor *00175000
                         State. R1 - address of SDEXI. R13 - address   *00176000
                         of 72-byte save area. R14 - return address.   *00177000
                         R15 - entry point address.                     00178000
SDEXIKEYS DS   CL2       Storage keys for moved data. Must be set by   *00179000
                         exit if bit SdexiDRPS is not set.              00180000
         ORG   SDEXIKEYS                                                00181000
SDEXIFKEY DS   CL1       Storage key of first 2K of data (Key must be  *00182000
                         in bits 0-3, not 4-7 of the byte)              00183000
SDEXISKEY DS   CL1       Storage key of second 2K of data (Key must be *00184000
                         in bits 0-3, not 4-7 of the byte)              00185000
SDEXIASID DS   CL2       ASID of data moved to buffer. Must be set by  *00186000
                         exit if bit SdexiDRPS is not set.              00187000
         DS    CL4       Contains no information for use by the exit.   00188000
SDEXICDAD DS   A         Address of data in buffer. Must be set by     *00189000
                         exit if bit SdexiDRPS is not set. This        *00190000
                         address should be on a page boundary, and the *00191000
                         buffer should contain 4096 bytes of data      *00192000
                         representing the contents of the entire page.  00193000
         DS    CL8       Contains no information for use by the exit.   00194000
SDEXISVAD DS   A         Address of 72-byte save area. Set by SVC      *00195000
                         Dump. For use by exit.                         00196000
         DS    CL4       Contains no information for use by the exit.   00197000
SDEXIWKAD DS   A         Address of work area. Set by SVC Dump. For    *00198000
                         use by exit. Length is in SdexiWKLN (AT LEAST *00199000
                         200 BYTES)                                     00200000
SDEXIWKLN DS   F         Length of work area pointed to by SdexiWKAD    00201000
SDEXIDRPA DS   A         Address of dump record prefix to be filled in *00202000
                         by exit                                        00203000
*  Bit definitions:                                                     00204000
SDEXIDRPS EQU  X'80'     If on, then the dump record prefix was filled *00205000
                         in by the exit. This bit is set by the exit,  *00206000
                         and checked by SVC Dump. It is initially off   00207000
SDEXIALP DS    A         Pointer to the ASID list - Set by SVC Dump.   *00208000
                         For use by exit.                               00209000
SDEXISDAO DS   CL8       SDATA OPTIONS                                  00210000
         ORG   SDEXISDAO                                                00211000
SDEXISDTA DS   CL2       SDATA OPTION FLAGS                             00212000
         ORG   SDEXISDTA                                                00213000
SDEXISDT1 DS   CL1       1ST BYTE OF OPTIONS                            00214000
*  Bit definitions:                                                     00215000
SDEXIAPSA EQU  X'80'     DUMP ALL PSA'S                                 00216000
SDEXIPSA EQU   X'40'     DUMP CURRENT PSA                               00217000
SDEXINUC EQU   X'20'     DUMP THE NUCLEUS                               00218000
SDEXISQA EQU   X'10'     DUMP SQA                                       00219000
SDEXILSQA EQU  X'08'     DUMP LSQA                                      00220000
SDEXIRGN EQU   X'04'     DUMP RGN-PRIVATE AREA                          00221000
SDEXILPA EQU   X'02'     DUMP LPA MOD. FOR RGN                          00222000
SDEXITRT EQU   X'01'     DUMP TRACE DATA                                00223000
SDEXISDT2 DS   CL1       SECOND BYTE SDATA FLGS                         00224000
*  Bit definitions:                                                     00225000
SDEXICSA EQU   X'80'     DUMP CSA                                       00226000
SDEXISWA EQU   X'40'     DUMP SWA                                       00227000
SDEXISMDM EQU  X'20'     DUMP SUMMARY DUMP DATA                         00228000
SDEXINSMD EQU  X'10'     DON'T DUMP SUMMARY DUMP                        00229000
SDEXINAPS EQU  X'08'     DO NOT DUMP ALL PSA                            00230000
SDEXINASQ EQU  X'04'     DO NOT DUMP SQA                                00231000
SDEXIANUC EQU  X'02'     DUMP ALL NUCLEUS                               00232000
SDEXIDEFS EQU  X'01'     DEFAULTS                                       00233000
         ORG   SDEXISDTA+2                                              00234000
SDEXISDA2 DS   CL4       EXTENDED SDATA OPTIONS                         00235000
         ORG   SDEXISDA2                                                00236000
SDEXIEXIT1 DS  B         SDATA OPTIONS EXIT ROUTINES                    00237000
*  Bit definitions:                                                     00238000
SDEXIGRSQ EQU  X'80'     SDATA=GRSQ                                     00239000
SDEXICOUPLE EQU X'10'    SDATA=COUPLE                                   00240000
SDEXIXESDATA EQU X'08'   SDATA=XESDATA                                  00241000
SDEXIWLMDATA EQU X'02'   SDATA=WLMDATA                                  00242000
SDEXIEXIT2 DS  B         SDATA OPTIONS EXIT ROUTINES                    00243000
*  Bit definitions:                                                     00244000
SDEXISERVERS EQU X'20'   SDATA=SERVERS                                  00245000
SDEXISDT3 DS   B         SDATA OPTIONS                                  00246000
*  Bit definitions:                                                     00247000
SDEXINDEF EQU  X'80'     NODEFAULTS                                     00248000
SDEXIIO  EQU   X'40'     DO I/O AREAS                                   00249000
SDEXIHCAS EQU  X'20'     Dump HCSA by ASID                              00250000
SDEXIHCNO EQU  X'10'     Dump No Owner HCSA                             00251000
SDEXIHCSY EQU  X'08'     Dump System owned HCSA                         00252000
SDEXISDT4 DS   B         SDATA OPTIONS                                  00253000
         DS    CL2       Reserved                                       00254000
SDEXIFLAGS DS  B                                                        00255000
*  Bit definitions:                                                     00256000
SDEXIADDRESSRANGE EQU X'80' An address range has been provided,        *00257000
                         instead of placing the data into the provided *00258000
                         buffer. The data must be in the current       *00259000
                         primary space or be addressable by an ALET    *00260000
                         that is currently on the DU-AL or the PASN    *00261000
                         AL. This may only be used if bit SdexiDRPS is *00262000
                         off or (if it is on) if creating an address   *00263000
                         space or data space record. When SdexiDRPS is *00264000
                         off, the storage range must represent the     *00265000
                         primary address space, with start address in   00266000
*                        SdexiCDAD and end address in SdexiRangeEnd.   *00267000
                         When SdexiDRPS is on for address space        *00268000
                         storage, the start address is in              *00269000
                         SdexiDrpxLAD, the end address in              *00270000
                         SdexiRangeEnd, and the ALET is in             *00271000
                         SdexiRangeALET. Use an ALET of 0 for the      *00272000
                         primary address space. When SdexiDRPS is on   *00273000
                         for data space storage, the start address is  *00274000
                         in SdexiDrpxLAD, the end address in           *00275000
                         SdexiRangeEnd, and the ALET is in              00276000
*                        SdexiRangeALET. In all cases, the start       *00277000
                         address will be rounded down to the nearest   *00278000
                         page boundary. The end address will be        *00279000
                         rounded up to the last byte of the page       *00280000
                         containing the input end address. For 64bit   *00281000
                         ranges, set the start address in              *00282000
                         SdexiDrpx64LAD or SdexiCDAD64 following the   *00283000
                         above rules. Then, instead of providing an    *00284000
                         end address in SdexiRangeEnd (which can only  *00285000
                         hold a 31bit address), set the                 00286000
*                        SdexiRangeLengthInPages bit, then provide a   *00287000
                         count of the number of pages to capture in    *00288000
                         SdexiRangePageCount. Keep in mind that the    *00289000
                         starting address will be rounded down to a    *00290000
                         page boundary if it is not supplied on a page *00291000
                         boundary - this may have an adverse affect on *00292000
                         your page range. There is a hard 8T limit on  *00293000
                         the exit buffer, so the page count cannot be  *00294000
                         bigger than 7FFFFFFF.                          00295000
SDEXIADDRESS64 EQU X'40' A 64-bit address has been provided in         *00296000
                         SdexiCDAD64.                                   00297000
SDEXIRANGELENGTHINPAGES EQU X'20' If set and processing an address     *00298000
                         range, the SdexiRangePageCount field will be  *00299000
                         used as the number of pages to capture        *00300000
                         instead of SdexiRangeEnd                       00301000
SDEXIFLAG3 EQU X'10'     Reserved                                       00302000
SDEXIFLAG4 EQU X'08'     Reserved                                       00303000
SDEXIFLAG5 EQU X'04'     Reserved                                       00304000
SDEXIUTOKENPROVIDED EQU X'02' If set, it indicates that Exit has       *00305000
                         provided UtokenPtr in SdexiUtokenPtr field.   *00306000
                         Exits intending to exploit Utoken support     *00307000
                         must populate the UtokenArea as expected in   *00308000
                         addition to setting this flag to request      *00309000
                         DUMPSRV to capture global storage associated  *00310000
                         with supplied usertoken(s).                    00311000
SDEXIREMOTE EQU X'01'    This remote dump resulted from a Remote dump  *00312000
                         request                                        00313000
         DS    CL3       RESERVED                                       00314000
SDEXIRANGEEND DS A       The entire page containing this byte will be  *00315000
                         dumped.                                        00316000
         ORG   SDEXIRANGEEND                                            00317000
SDEXIRANGEPAGECOUNT DS F The number of pages to capture                 00318000
SDEXIRANGEALET DS F                                                     00319000
SDEXIPROBDESC@ DS A      Address of ProbDesc area for dump. 0 if no    *00320000
                         such area exists.                              00321000
SDEXIINTOKEN@ DS A       Address of 32-byte incident token for dump.    00322000
SDEXICDAD64 DS CL8       64-bit address of data in buffer. Must be set *00323000
                         by exit if bit SdexiDRP2 is set. This address *00324000
                         should be on a page boundary, and the buffer  *00325000
                         should contain 4096 bytes of data             *00326000
                         representing the contents of the entire page.  00327000
SDEXIUTOKENPTR DS A      Address of DUMPSRV supplied Utoken area. Set  *00328000
                         by SDUMP. Exits intending to use this area    *00329000
                         must also set SdexiUtokenProvided.             00330000
         DS    CL4       Available                                      00331000
SDEXI_LEN EQU  *-SDEXI                                                  00332000
.L0002   ANOP                                                           00333000
         AIF   ('&SDEXIALST' EQ 'NO').L0006                             00334000
         AIF   ('&DSECT' EQ 'YES').L0007                                00335000
         AIF   ('&SDEXIALST' NE 'YES').L0006                            00336000
SDEXIALST DS   0H        LIST OF ASID WHICH ARE INCLUDED IN THE DUMP.  *00337000
                         IT IS BUILT BY SDUMP AND USED BY THE EXITS     00338000
         AGO   .L0008                                                   00339000
.L0007   ANOP                                                           00340000
SDEXIALST DSECT          LIST OF ASID WHICH ARE INCLUDED IN THE DUMP.  *00341000
                         IT IS BUILT BY SDUMP AND USED BY THE EXITS     00342000
.L0008   ANOP                                                           00343000
SDEXIALST# DS  H         NUMBER OF ENTRIES                              00344000
SDEXIALST_ARRAY DS CL2   An array of ASIDs, the number of which is     *00345000
                         indicated by SdexiALST#                        00346000
         ORG   SDEXIALST_ARRAY                                          00347000
SDEXIALST_ENTRY DS H     An ASID within the array.                      00348000
SDEXIMAXA EQU  64        MAXIMUM NUMBER OF ENTRIES IN THE ASID LIST     00349000
SDEXIALST_LEN EQU *-SDEXIALST                                           00350000
.L0006   ANOP                                                           00351000
         AIF   ('&SDEXIDRPX' EQ 'NO').L0009                             00352000
         AIF   ('&DSECT' EQ 'YES').L000A                                00353000
         AIF   ('&SDEXIDRPX' NE 'YES').L0009                            00354000
.L000A   ANOP                                                           00355000
*                                                                       00356000
*                                                                       00357000
*    The dump record prefix can be set to indicate a data space,        00358000
*    an address space, or a component record.                           00359000
*    Fields that must be set by an exit which turns on bit SdexiDRPS    00360000
*    are:                                                               00361000
*    For a data space record:                                           00362000
*       SdexiDrpxAST set to 'DS',                                       00363000
*       SdexiDrpxAS1 set to the owning ASID                             00364000
*       SdexiDrpxASC set to the data space name                         00365000
*       SdexiDrpxTypd_DS_KEY set to the storage key                     00366000
*       SdexiDrpxLAD set to the logical address                         00367000
*       SdexiDrpxTypd_DS_Stoken set to the data space's STOKEN.         00368000
*       The system will fill in SdexiDrpxTypd_DS_ASTE to the            00369000
*       ASTE real address for the                                       00370000
*       data space, provided that that field is                         00371000
*       not 0 (i.e., was set by the exit).                              00372000
*    For an address space record:                                       00373000
*       SdexiDrpxAST set to 'CV',                                       00374000
*       SdexiDrpxAS1 set to X'FFFFFFFF'                                 00375000
*       SdexiDrpxAS2 set to the ASID                                    00376000
*       SdexiDrpxTypd_CV_KEY set to the storage key                     00377000
*       SdexiDrpxLAD set to the logical address                         00378000
*    For a CompData record:                                             00379000
*       SdexiDrpxAST set to 'SC',                                       00380000
*       SdexiDrpxASC set to the component identifier                    00381000
*       You should make sure that the component records can             00382000
*       be distinguished from each other. The SdexiDrpxLad field        00383000
*       could be used for this purpose, since the "address" is          00384000
*       only to be understood by the component itself, not by           00385000
*       dump processing or IPCS.                                        00386000
*    In all of these cases, the ID, LEN, and SEQ fields are set by      00387000
*    the system and should not be modified by the exit.                 00388000
*                                                                       00389000
*   ******************************************************************  00390000
*    64-bit address DRPX Notes:                                         00391000
*   ******************************************************************  00392000
*    64-bit addresses can be specified by using a version 2 DRPX, or    00393000
*    by supplying the address in SdexiCDAD64 and setting                00394000
*    SdexiAddress64.                                                    00395000
*                                                                       00396000
*    SdexiDrpxTypd_DS_ASTE and SdexiDrpxTypd_DS_STOKEN should not be    00397000
*    be supplied for 64-bit address DRPX records.                       00398000
*                                                                       00399000
*                                                                       00400000
*                                                                       00401000
         AIF   ('&DSECT' EQ 'YES').L000B                                00402000
SDEXIDRPX DS   0F        Dump record prefix to be filled in by the     *00403000
                         exit                                           00404000
         AGO   .L000C                                                   00405000
.L000B   ANOP                                                           00406000
SDEXIDRPX DSECT          Dump record prefix to be filled in by the     *00407000
                         exit                                           00408000
.L000C   ANOP                                                           00409000
SDEXIDRPXID DS CL3       Set by SDUMP. Exit should not change.          00410000
         ORG   SDEXIDRPXID                                              00411000
         DS    CL2       DRPX identifier                                00412000
SDEXIDRPXIDV DS CL1      DRPX version                                   00413000
SDEXIDRPXLEN DS X        Set by SDUMP. Exit should not change.          00414000
SDEXIDRPXAS DS CL16      ASCB information                               00415000
         ORG   SDEXIDRPXAS                                              00416000
SDEXIDRPXAST DS CL2      Address space type code. See Constants        *00417000
                         SdexiDrpxAST_xxx                               00418000
SDEXIDRPXASH DS H                                                       00419000
SDEXIDRPXAS1 DS F                                                       00420000
SDEXIDRPXASC DS CL8      Qualifier 2                                    00421000
         ORG   SDEXIDRPXASC                                             00422000
SDEXIDRPXAS2 DS F                                                       00423000
SDEXIDRPXAS3 DS F                                                       00424000
SDEXIDRPXLAD DS A        Logical address. This should be on a page     *00425000
                         boundary.                                      00426000
SDEXIDRPXSEQ DS F        Set by SDUMP. Exit should not change.          00427000
         DS    CL8       Set by SDUMP. Exit should not change.          00428000
SDEXIDRPXTYPD DS CL28    Record type specific data.                     00429000
         ORG   SDEXIDRPXTYPD                                            00430000
         DS    CL7                                                      00431000
SDEXIDRPXSENSITIVEATTR DS X Sensitivity attributes of the page         *00432000
                         Unknown=0, Sensitive=1, NotSensitive=2         00433000
         ORG   SDEXIDRPXTYPD+28                                         00434000
SDEXIDRPXSENSITIVE EQU 1 Sensitive=yes                                  00435000
SDEXIDRPXNOTSENSITIVE EQU 2 Sensitive=no                                00436000
SDEXIDRPX_LEN EQU *-SDEXIDRPX                                           00437000
         ORG   SDEXIDRPXTYPD                                            00438000
SDEXIDRPXTYPD_CV DS 0X                                                  00439000
SDEXIDRPXTYPD_CV_KEY DS B Key should be in bits 0-3 of the field, not  *00440000
                         bits 4-7                                       00441000
SDEXIDRPXTYPD_CV_LEN EQU *-SDEXIDRPXTYPD_CV                             00442000
         ORG   SDEXIDRPXTYPD                                            00443000
SDEXIDRPXTYPD_DS DS 0X                                                  00444000
SDEXIDRPXTYPD_DS_KEY DS B Key should be in bits 0-3 of the field, not  *00445000
                         bits 4-7                                       00446000
         DS    CL5       Reserved                                       00447000
         DS    CL2       Reserved                                       00448000
SDEXIDRPXTYPD_DS_ASTE DS A Set by SDUMP. Exit should not change.        00449000
SDEXIDRPXTYPD_DS_STOKEN DS CL8 STOKEN                                   00450000
SDEXIDRPXTYPD_DS_LEN EQU *-SDEXIDRPXTYPD_DS                             00451000
         ORG   SDEXIDRPXTYPD                                            00452000
SDEXIDRPXTYPD_SC DS 0X                                                  00453000
SDEXIDRPXTYPD_SC_KEY DS B Key should be in bits 0-3 of the field, not  *00454000
                         bits 4-7                                       00455000
         DS    CL5       Reserved                                       00456000
SDEXIDRPXTYPD_SC_STYP DS B Storage Type                                 00457000
*  Bit definitions:                                                     00458000
SDEXIDRPXTYPD_SC_COMM EQU X'80' Storage is in common                    00459000
SDEXIDRPXTYPD_SC_AAFLAG EQU X'40' Absolute address supplied in         *00460000
                         SdexiDrpxTypd_SC_AAPtr                         00461000
         DS    CL1       Reserved                                       00462000
SDEXIDRPXTYPD_SC_AAPTR DS A Absolute address                            00463000
SDEXIDRPXTYPD_SC_LEN EQU *-SDEXIDRPXTYPD_SC                             00464000
         ORG   ,                                                        00465000
.L0009   ANOP                                                           00466000
         AIF   ('&SDEXIDRPX64' EQ 'NO').L000D                           00467000
         AIF   ('&DSECT' EQ 'YES').L000E                                00468000
         AIF   ('&SDEXIDRPX64' NE 'YES').L000D                          00469000
SDEXIDRPX64 DS 0F        Dump record prefix v2 to be filled in by the  *00470000
                         exit                                           00471000
         AGO   .L000F                                                   00472000
.L000E   ANOP                                                           00473000
SDEXIDRPX64 DSECT        Dump record prefix v2 to be filled in by the  *00474000
                         exit                                           00475000
.L000F   ANOP                                                           00476000
         DS    CL20                                                     00477000
SDEXIDRPX64LAD DS CL8    Logical address. This should be on a page     *00478000
                         boundary.                                      00479000
         ORG   SDEXIDRPX64LAD                                           00480000
SDEXIDRPX64LADHI DS A    High-order word of LAD                         00481000
SDEXIDRPX64LADLO DS A    Low-order word of LAD                          00482000
         DS    CL32                                                     00483000
SDEXIDRPXAST_ADDRSPAC EQU C'CV' Address space                           00484000
SDEXIDRPXAST_DATASPAC EQU C'DS' Data space                              00485000
SDEXIDRPXAST_COMPDATA EQU C'SC' Component data                          00486000
SDEXIUTOKENAREASIZE EQU 256 Size of SdexiUtokenArea                     00487000
MAXXUTOKENENTRIES EQU 20 Maximum Utoken entries allowed in             *00488000
                         SDexiUtokenArea                                00489000
         ORG   SDEXIDRPX64+64                                           00490000
SDEXIDRPX64_LEN EQU *-SDEXIDRPX64                                       00491000
.L000D   ANOP                                                           00492000
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 00493000
         AIF   ('&LIST' EQ 'YES').P4                                    00494000
.P3      ANOP                                                           00495000
         POP   PRINT                                                    00496000
.P4      ANOP                                                           00497000
.P_EXIT  ANOP                                                           00498000
         MEND                                                           00499000
**/ IHASDEXI_2:;                                                        00500000
* %IHASDEXI_INCLUDED = 'YES';                                           00501000
* %DCL ZCBPRINT CHAR EXT;                                               00502000
* %DEACTIVATE ZCBPRINT;                                                 00503000
* %DCL IHASDEXI_LIST CHAR EXT;                                          00504000
* %DEACTIVATE IHASDEXI_LIST;                                            00505000
* %IF IHASDEXI_LIST = 'NO' !                                            00506000
*    ZCBPRINT = 'NO' %THEN                                              00507000
* %DO;                                                                  00508000
*   @LIST PUSH NOECHO;                                                  00509000
*   @LIST NOASSEMBLE NOECHO;                                            00510000
*   @LIST OFF C NOECHO;                                                 00511000
* %END;                                                                 00512000
*/* Start of PL/X Source                                             */ 00513000
*/* Start of PL/X Source                                             */ 00514000
*  DCL 1 SDEXI BASED BDY(WORD),      /* SVC Dump exit parameter list    00515000
*                                      fields for use by, or to be      00516000
*                                      filled in by, exit        @L1A*/ 00517000
*        2 SdexiComm Char(12),       /* Data common to SDEXP and SDEXI  00518000
*                                      - maintained for consistency     00519000
*                                       reasons                  @A2C*/ 00520000
*          4 SdexiCom1   Char(10),   /* Reserved                 @A2A*/ 00521000
*          4 SdexiFlag1 Char(1),     /* MISC flags               @A2A*/ 00522000
*            6 * Bit(2),             /* Reserved                 @A2A*/ 00523000
*            6 SdexiSensitive Bit(1), /* If set, it indicates that      00524000
*                   that Exit has requested to tag their storage        00525000
*                   as sensitive=yes. This means, it will be            00526000
*                   redacted when the dump, captured on a qualifing     00527000
*                   processor, is post-processed.                @A2A*/ 00528000
*            6 SdexiNotSensitive  Bit(1), /* If set, it indicates that  00529000
*                   that Exit has requested to tag their storage        00530000
*                   as sensitive=no. This means, it will be not be      00531000
*                   redacted if the dump, captured on a qualifying      00532000
*                   processor, is post-processed.                @A2A*/ 00533000
*            6  * Bit(4),            /* Reserved                 @A2A*/ 00534000
*          4 SdexiFlag2 Char(1),     /* MISC flags               @A2A*/ 00535000
*        2 SdexiBFAD PTR(31),        /* Address of data buffer.         00536000
*                                      Set by SVC Dump.                 00537000
*                                      For use by exit.          @L1A*/ 00538000
*        2 SdexiBFLN FIXED(31),      /* Length of data buffer           00539000
*                                      (4096 bytes).                    00540000
*                                      For use by exit.          @L1A*/ 00541000
*        2 SdexiORAD PTR(31),        /* Address of output routine.      00542000
*                      Set by SVC Dump. For use by exit.                00543000
*                      Interface to routine:                            00544000
*                               AMODE=31.                               00545000
*                               PASN=HASN=SASN                          00546000
*                               Task mode.                              00547000
*                               Enabled, no locks held, no EUT FRRs.    00548000
*                               Key 0, Supervisor State.                00549000
*                               R1  - address of SDEXI.                 00550000
*                               R13 - address of 72-byte save area.     00551000
*                               R14 - return address.                   00552000
*                               R15 - entry point address.              00553000
*                                                                @L1A*/ 00554000
*        2 SdexiKEYS CHAR(2),        /* Storage keys for moved data.    00555000
*                                      Must be set by exit if bit       00556000
*                                      SdexiDRPS is not set.     @L1A*/ 00557000
*          3 SdexiFKEY CHAR(1),      /* Storage key of first 2K of data 00558000
*                  (Key must be in bits 0-3, not 4-7 of the byte)       00559000
*                                                                @L1A*/ 00560000
*          3 SdexiSKEY CHAR(1),      /* Storage key of second 2K of     00561000
*                  data (Key must be in bits 0-3, not 4-7 of the byte)  00562000
*                                                                @L1A*/ 00563000
*        2 SdexiASID CHAR(2),        /* ASID of data moved to buffer.   00564000
*                                      Must be set by exit if bit       00565000
*                                      SdexiDRPS is not set.     @L1A*/ 00566000
*        2 * CHAR(4),                /* Contains no information for     00567000
*                                      use by the exit.          @L1A*/ 00568000
*        2 SdexiCDAD PTR(31),        /* Address of data in buffer.      00569000
*                    Must be set by exit if bit SdexiDRPS is not set.   00570000
*                    This address should be on a page boundary, and     00571000
*                    the buffer should contain 4096 bytes of data       00572000
*                    representing the contents of the entire page.      00573000
*                                                                @L1A*/ 00574000
*        2 * CHAR(8),                /* Contains no information for     00575000
*                                      use by the exit.          @L1A*/ 00576000
*        2 SdexiSVAD PTR(31),        /* Address of 72-byte save area.   00577000
*                                      Set by SVC Dump.                 00578000
*                                      For use by exit.          @L1A*/ 00579000
*        2 * CHAR(4),                /* Contains no information for     00580000
*                                      use by the exit.          @L1A*/ 00581000
*        2 SdexiWKAD PTR(31),        /* Address of work area.           00582000
*                                      Set by SVC Dump.                 00583000
*                                      For use by exit. Length is       00584000
*                                      in SdexiWKLN (AT LEAST 200       00585000
*                                      BYTES)                    @L1A*/ 00586000
*        2 SdexiWKLN FIXED(31),      /* Length of work area pointed     00587000
*                                       to by SdexiWKAD          @L1A*/ 00588000
*        2 SdexiDRPA PTR(31),       /* Address of dump record prefix    00589000
*                                      to be filled in by exit   @L1A*/ 00590000
*          3 SdexiDRPS BIT(1),      /* If on, then the dump record      00591000
*                                      prefix was filled in by the      00592000
*                                      exit. This bit is set by         00593000
*                                      the exit, and checked by SVC     00594000
*                                      Dump. It is initially off @L1a*/ 00595000
*        2 SdexiALP PTR(31),        /* Pointer to the ASID list -       00596000
*                                      Set by SVC Dump.                 00597000
*                                      For use by exit.          @L1A*/ 00598000
*        2 SdexiSDAO  CHAR(8),        /*SDATA OPTIONS            @L1A*/ 00599000
*          4 SdexiSDTA CHAR(2),       /*SDATA OPTION FLAGS       @L1A*/ 00600000
*            6 SdexiSDT1     CHAR(1), /* 1ST BYTE OF OPTIONS     @L1A*/ 00601000
*              7 SdexiAPSA    BIT(1), /* DUMP ALL PSA'S          @L1A*/ 00602000
*              7 SdexiPSA     BIT(1), /* DUMP CURRENT PSA        @L1A*/ 00603000
*              7 SdexiNUC     BIT(1), /* DUMP THE NUCLEUS        @L1A*/ 00604000
*              7 SdexiSQA     BIT(1), /* DUMP SQA                @L1A*/ 00605000
*              7 SdexiLSQA    BIT(1), /* DUMP LSQA               @L1A*/ 00606000
*              7 SdexiRGN     BIT(1), /* DUMP RGN-PRIVATE AREA   @L1A*/ 00607000
*              7 SdexiLPA     BIT(1), /* DUMP LPA MOD. FOR RGN   @L1A*/ 00608000
*              7 SdexiTRT     BIT(1), /* DUMP TRACE DATA         @L1A*/ 00609000
*            6 SdexiSDT2     CHAR(1), /*SECOND BYTE SDATA FLGS   @L1A*/ 00610000
*              7 SdexiCSA     BIT(1), /* DUMP CSA                @L1A*/ 00611000
*              7 SdexiSWA     BIT(1), /* DUMP SWA                @L1A*/ 00612000
*              7 SdexiSMDM    BIT(1), /* DUMP SUMMARY DUMP DATA  @L1A*/ 00613000
*              7 SdexiNSMD    BIT(1), /* DON'T DUMP SUMMARY DUMP @L1A*/ 00614000
*              7 SdexiNAPS    BIT(1), /* DO NOT DUMP ALL PSA     @L1A*/ 00615000
*              7 SdexiNASQ    BIT(1), /* DO NOT DUMP SQA         @L1A*/ 00616000
*              7 SdexiANUC    BIT(1), /* DUMP ALL NUCLEUS        @L1A*/ 00617000
*              7 SdexiDEFS    BIT(1), /* DEFAULTS                @L1A*/ 00618000
*          4 SdexiSDA2 CHAR(4),  /*EXTENDED SDATA OPTIONS        @L1A*/ 00619000
*            6 SdexiEXIT1 BIT(8), /*SDATA OPTIONS EXIT ROUTINES  @L1A*/ 00620000
*              7 SdexiGRSQ BIT(1),   /* SDATA=GRSQ               @L1A*/ 00621000
*              7 * BIT(2),           /* Reserved                 @L1A*/ 00622000
*              7 SdexiCouple BIT(1), /* SDATA=COUPLE             @L1A*/ 00623000
*              7 SdexiXESDATA BIT(1),  /* SDATA=XESDATA          @L1A*/ 00624000
*              7 * BIT(1),           /* Reserved                 @P1C*/ 00625000
*              7 SdexiWLMDATA BIT(1),  /* SDATA=WLMDATA          @P1A*/ 00626000
*              7 * BIT(1),           /* Reserved                 @P1A*/ 00627000
*            6 SdexiEXIT2 BIT(8), /*SDATA OPTIONS EXIT ROUTINES  @L1A*/ 00628000
*              7 * BIT(2),           /* Reserved                 @L2A*/ 00629000
*              7 SdexiSERVERS BIT(1),  /* SDATA=SERVERS          @L2A*/ 00630000
*              7 * BIT(5),           /* Reserved                 @L2C*/ 00631000
*            6 SdexiSDT3   BIT(8),   /* SDATA OPTIONS            @L1A*/ 00632000
*              7 SdexiNDEF BIT(1),   /* NODEFAULTS               @L1A*/ 00633000
*              7 SdexiIO   BIT(1),   /* DO I/O AREAS             @L1A*/ 00634000
*              7 SdexiHCAS BIT(1),   /* Dump HCSA by ASID        @L7A*/ 00635000
*              7 SdexiHCNO BIT(1),   /* Dump No Owner HCSA       @L7A*/ 00636000
*              7 SdexiHCSY BIT(1),   /* Dump System owned HCSA   @L7A*/ 00637000
*              7 *         BIT(3),   /* Available                @L7C*/ 00638000
*            6  SdexiSDT4  BIT(8),    /* SDATA OPTIONS           @L1A*/ 00639000
*          4 * CHAR(2),          /*  Reserved                    @L1A*/ 00640000
*          2 SdexiFlags BIT(8),   /*                             @L1A*/ 00641000
*            6 SdexiAddressRange BIT(1),  /* An address range           00642000
*                   has been provided, instead of placing the           00643000
*                   data into the provided buffer. The data must        00644000
*                   be in the current primary space or be               00645000
*                   addressable by an ALET that is currently on the     00646000
*                   DU-AL or the PASN AL. This may only be used if      00647000
*                   bit SdexiDRPS is off or (if it is on) if            00648000
*                   creating an address space or data space             00649000
*                   record. When SdexiDRPS is off, the storage range    00650000
*                   must represent the primary address space,           00651000
*                   with start address in                               00652000
*                   SdexiCDAD and end address in SdexiRangeEnd.         00653000
*                   When SdexiDRPS is on for address space storage,     00654000
*                   the start address is in SdexiDrpxLAD,               00655000
*                   the end address in SdexiRangeEnd, and the ALET      00656000
*                   is in SdexiRangeALET. Use an ALET of 0 for          00657000
*                   the primary address space.                          00658000
*                   When SdexiDRPS is on for data space storage,        00659000
*                   the start address is in SdexiDrpxLAD,               00660000
*                   the end address in SdexiRangeEnd, and the ALET      00661000
*                   is in SdexiRangeALET.                               00662000
*                   In all cases, the start address will be             00663000
*                   rounded down to the nearest page boundary.          00664000
*                   The end address will be rounded up to the last      00665000
*                   byte of the page containing the input end           00666000
*                   address.                                            00667000
*                   For 64bit ranges, set the start address in          00668000
*                   SdexiDrpx64LAD or SdexiCDAD64 following the         00669000
*                   above rules. Then, instead of providing an          00670000
*                   end address in SdexiRangeEnd (which can only        00671000
*                   hold a 31bit address), set the                      00672000
*                   SdexiRangeLengthInPages bit, then provide a         00673000
*                   count of the number of pages to capture in          00674000
*                   SdexiRangePageCount. Keep in mind that the          00675000
*                   starting address will be rounded down to            00676000
*                   a page boundary if it is not supplied on            00677000
*                   a page boundary - this may have an adverse          00678000
*                   affect on your page range. There is a hard          00679000
*                   8T limit on the exit buffer, so the page count      00680000
*                   cannot be bigger than 7FFFFFFF.              @L5C*/ 00681000
*            6 SdexiAddress64 BIT(1),  /* A 64-bit address has been     00682000
*                   provided in SdexiCDAD64.                     @L4A*/ 00683000
*            6 SdexiRangeLengthInPages Bit(1), /* If set and processing 00684000
*                   an address range, the SdexiRangePageCount field     00685000
*                   will be used as the number of pages to capture      00686000
*                   instead of SdexiRangeEnd                     @L5A*/ 00687000
*            6 SdexiFlag3 BIT(1),     /* Reserved                @L6A*/ 00688000
*            6 SdexiFlag4 BIT(1),     /* Reserved                @L6A*/ 00689000
*            6 SdexiFlag5 BIT(1),     /* Reserved                @L6A*/ 00690000
*            6 SdexiUtokenProvided BIT(1), /* If set, it indicates      00691000
*                   that Exit has provided UtokenPtr in                 00692000
*                   SdexiUtokenPtr field. Exits intending to exploit    00693000
*                   Utoken support must populate the UtokenArea as      00694000
*                   expected in addition to setting this flag to        00695000
*                   request DUMPSRV to capture global storage           00696000
*                   associated with supplied usertoken(s).       @L9A*/ 00697000
*            6 SdexiRemote BIT(1),    /* This remote dump resulted from 00698000
*                   a Remote dump request                        @L6A*/ 00699000
*          2 * CHAR(3),           /*RESERVED                     @L1A*/ 00700000
*          2 SdexiRangeEnd PTR(31),   /* The entire page containing     00701000
*                   this byte will be dumped.                    @L1A*/ 00702000
*            4 SdexiRangePageCount Fixed(31),   /* The number of        00703000
*                   pages to capture                             @L5A*/ 00704000
*          2 SdexiRangeALET FIXED(32),    /*                     @L1A*/ 00705000
*          2 SdexiProbDesc@ PTR(31),  /* Address of ProbDesc area       00706000
*                 for dump. 0 if no such area exists.            @L1A*/ 00707000
*          2 SdexiIntoken@ PTR(31),   /* Address of 32-byte             00708000
*                 incident token for dump.                       @L1A*/ 00709000
*          2 SdexiCDAD64 Char(8), /* 64-bit address of data in buffer.  00710000
*                    Must be set by exit if bit SdexiDRP2 is set.       00711000
*                    This address should be on a page boundary, and     00712000
*                    the buffer should contain 4096 bytes of data       00713000
*                    representing the contents of the entire page.      00714000
*                                                                @L4A*/ 00715000
*          2 SdexiUtokenPtr Ptr(31), /* Address of DUMPSRV supplied     00716000
*                    Utoken area.  Set by SDUMP. Exits intending to     00717000
*                    use this area must also set SdexiUtokenProvided.   00718000
*                                                                @L9A*/ 00719000
*          2 * Char(4),              /* Available                @L9A*/ 00720000
*          2 * CHAR(0);           /*RESERVED                     @L1A*/ 00721000
*DCL SdexiSAVE CHAR(72) BASED(SdexiSVAD)                                00722000
*                      BDY(WORD);       /* SAVE AREA USED ONLY BY EXIT  00723000
*                                                                @L1A*/ 00724000
*DCL SdexiWORK CHAR(200) BASED(SdexiWKAD)                               00725000
*                       BDY(WORD);       /* WORK AREA USED ONLY         00726000
*                                               BY EXIT          @L1A*/ 00727000
*DCL 1 SdexiALST BASED(SdexiALP),        /* LIST OF ASID WHICH ARE      00728000
*                                           INCLUDED IN THE DUMP.  IT   00729000
*                                           IS BUILT BY SDUMP AND USED  00730000
*                                           BY THE EXITS         @L1A*/ 00731000
*      3 SdexiALST# FIXED(15),           /* NUMBER OF ENTRIES    @L1A*/ 00732000
*      3 SdexiALST_ARRAY(*),             /* An array of ASIDs, the      00733000
*               number of which is indicated by SdexiALST#       @L1A*/ 00734000
*        5 SdexiALST_ENTRY Fixed(15);    /* An ASID within the          00735000
*               array.                                           @L1A*/ 00736000
*DCL SdexiMAXA FIXED(15) CONSTANT(64);    /* MAXIMUM NUMBER OF ENTRIES  00737000
*                                      IN THE ASID LIST          @L1A*/ 00738000
* /*                                                                    00739000
*    The dump record prefix can be set to indicate a data space,        00740000
*    an address space, or a component record.                           00741000
*    Fields that must be set by an exit which turns on bit SdexiDRPS    00742000
*    are:                                                               00743000
*    For a data space record:                                           00744000
*       SdexiDrpxAST set to 'DS',                                       00745000
*       SdexiDrpxAS1 set to the owning ASID                             00746000
*       SdexiDrpxASC set to the data space name                         00747000
*       SdexiDrpxTypd_DS_KEY set to the storage key                     00748000
*       SdexiDrpxLAD set to the logical address                         00749000
*       SdexiDrpxTypd_DS_Stoken set to the data space's STOKEN.         00750000
*       The system will fill in SdexiDrpxTypd_DS_ASTE to the            00751000
*       ASTE real address for the                                       00752000
*       data space, provided that that field is                         00753000
*       not 0 (i.e., was set by the exit).                              00754000
*    For an address space record:                                       00755000
*       SdexiDrpxAST set to 'CV',                                       00756000
*       SdexiDrpxAS1 set to X'FFFFFFFF'                                 00757000
*       SdexiDrpxAS2 set to the ASID                                    00758000
*       SdexiDrpxTypd_CV_KEY set to the storage key                     00759000
*       SdexiDrpxLAD set to the logical address                         00760000
*    For a CompData record:                                             00761000
*       SdexiDrpxAST set to 'SC',                                       00762000
*       SdexiDrpxASC set to the component identifier                    00763000
*       You should make sure that the component records can             00764000
*       be distinguished from each other. The SdexiDrpxLad field        00765000
*       could be used for this purpose, since the "address" is          00766000
*       only to be understood by the component itself, not by           00767000
*       dump processing or IPCS.                                        00768000
*    In all of these cases, the ID, LEN, and SEQ fields are set by      00769000
*    the system and should not be modified by the exit.                 00770000
*                                        @L1A*/                         00771000
*                                                                       00772000
* /*******************************************************************/ 00773000
* /* 64-bit address DRPX Notes:                                      */ 00774000
* /*******************************************************************/ 00775000
* /* 64-bit addresses can be specified by using a version 2 DRPX, or    00776000
*    by supplying the address in SdexiCDAD64 and setting                00777000
*    SdexiAddress64.                                                    00778000
*                                                                       00779000
*    SdexiDrpxTypd_DS_ASTE and SdexiDrpxTypd_DS_STOKEN should not be    00780000
*    be supplied for 64-bit address DRPX records.                       00781000
*                                                                @L4A*/ 00782000
*DCL 1 SdexiDRPX CHAR(64) BDY(WORD)                                     00783000
*                BASED(SdexiDRPA),       /* Dump record prefix          00784000
*                to be filled in by the exit                     @L1A*/ 00785000
*      2 SdexiDrpxID CHAR(3),            /* Set by SDUMP. Exit should   00786000
*                                           not change.          @L1A*/ 00787000
*        3 *         CHAR(2),            /* DRPX identifier      @L4A*/ 00788000
*        3 SdexiDrpxIDV Char(1),         /* DRPX version         @L4A*/ 00789000
*      2 SdexiDrpxLen FIXED(8),          /* Set by SDUMP. Exit should   00790000
*                                           not change.          @L1A*/ 00791000
*      2 SdexiDrpxAS Char(16) Bdy(Word), /* ASCB information     @L1A*/ 00792000
*        3 SdexiDrpxAST Char(2),         /* Address space type          00793000
*                     code. See Constants SdexiDrpxAST_xxx       @L1A*/ 00794000
*        3 SdexiDrpxASH Fixed(16),       /*                      @L1A*/ 00795000
*        3 SdexiDrpxAS1 Fixed(32),       /*                      @L1A*/ 00796000
*        3 SdexiDrpxASC CHAR(8) BDY(WORD),  /* Qualifier 2       @L1A*/ 00797000
*          4 SdexiDrpxAS2 FIXED(32),     /*                      @L1A*/ 00798000
*          4 SdexiDrpxAS3 FIXED(32),     /*                      @L1A*/ 00799000
*      2 SdexiDrpxLAD PTR(31),           /* Logical address. This       00800000
*              should be on a page boundary.                     @L1A*/ 00801000
*      2 SdexiDrpxSEQ FIXED(32),         /* Set by SDUMP. Exit should   00802000
*                                           not change.          @L1A*/ 00803000
*      2 * CHAR(8),                      /* Set by SDUMP. Exit should   00804000
*                                           not change.          @L1A*/ 00805000
*      2 SdexiDrpxTYPD CHAR(28) Bdy(Word),  /* Record type specific     00806000
*                                           data.                @L1A*/ 00807000
*        3 * Char(7),                    /*                      @A2A*/ 00808000
*        3 SdexiDrpxSensitiveAttr Fixed(8),/* Sensitivity attributes    00809000
*                                           of the page                 00810000
*                         Unknown=0, Sensitive=1, NotSensitive=2 @A2A*/ 00811000
*      2 * CHAR(0);                      /*                      @L1A*/ 00812000
*DCL SdexiDRPXSensitive   Fixed(8) Constant(1), /* Sensitive=yes @A2A*/ 00813000
*    SdexiDRPXNotSensitive Fixed(8) Constant(2); /* Sensitive=no @A2A*/ 00814000
*                                                                       00815000
* %IHASDEXI_DEF = 'DEF(SdexiDrpxTYPD)';                                 00816000
* %IF IBM_CPSI = 'YES' %THEN                                            00817000
*   %IHASDEXI_DEF = 'BASED';                                            00818000
*DCL 1 SdexiDRPXTypd_CV CHAR(28) IHASDEXI_DEF,         /* This          00819000
*           maps information to be placed into the SdexiDrpxTYPD        00820000
*           field when creating an address space record (CV)     @L1A*/ 00821000
*      2 SdexiDrpxTypd_CV_KEY BIT(8),    /* Key should be in bits       00822000
*                 0-3 of the field, not bits 4-7                 @L1A*/ 00823000
*      2 * CHAR(0);                      /*                      @L1A*/ 00824000
*DCL 1 SdexiDRPXTypd_DS CHAR(28) IHASDEXI_DEF,         /* This          00825000
*           maps information to be placed into the SdexiDrpxTYPD        00826000
*           field when creating a data space record (DS)         @L1A*/ 00827000
*      2 SdexiDrpxTypd_DS_KEY BIT(8),    /* Key should be in bits       00828000
*                 0-3 of the field, not bits 4-7                 @L1A*/ 00829000
*      2 * CHAR(5),                      /* Reserved             @L1A*/ 00830000
*      2 * CHAR(2),                      /* Reserved             @L1A*/ 00831000
*      2 SdexiDrpxTypd_DS_ASTE PTR(31),  /* Set by SDUMP. Exit should   00832000
*                                           not change.          @L1A*/ 00833000
*      2 SdexiDrpxTypd_DS_STOKEN CHAR(8),  /* STOKEN             @L1A*/ 00834000
*      2 * CHAR(0);                      /*                      @L1A*/ 00835000
*DCL 1 SdexiDRPXTypd_SC CHAR(28) IHASDEXI_DEF,         /* This          00836000
*           maps information to be placed into the SdexiDrpxTYPD        00837000
*           field when creating a component data record (SC)     @L1A*/ 00838000
*      2 SdexiDrpxTypd_SC_KEY BIT(8),    /* Key should be in bits       00839000
*                 0-3 of the field, not bits 4-7                 @L1A*/ 00840000
*      2 * CHAR(5),                      /* Reserved             @L1A*/ 00841000
*      2 SdexiDrpxTypd_SC_Styp BIT(8),   /* Storage Type         @L1A*/ 00842000
*        3 SdexiDrpxTypd_SC_Comm BIT(1), /* Storage is in common        00843000
*                                                                @L1A*/ 00844000
*        3 SdexiDrpxTypd_SC_AAFlag BIT(1), /* Absolute address supplied 00845000
*              in SdexiDrpxTypd_SC_AAPtr                         @L1A*/ 00846000
*      2 * CHAR(1),                      /* Reserved             @L1A*/ 00847000
*      2 SdexiDrpxTypd_SC_AAPtr PTR(31), /* Absolute address     @L1A*/ 00848000
*      2 * CHAR(0);                      /*                      @L1A*/ 00849000
*DCL 1 SdexiDrpx64 CHAR(64) BDY(WORD)                                   00850000
*                BASED(SdexiDRPA),  /* Dump record prefix v2 to be      00851000
*                                      filled in by the exit     @L4A*/ 00852000
*      2 *           CHAR(20),      /*                           @L4A*/ 00853000
*      2 SdexiDrpx64Lad CHAR(8) Bdy(Word), /* Logical address. This     00854000
*                                      should be on a page boundary.    00855000
*                                                                @L4A*/ 00856000
*        3 SdexiDrpx64LadHi PTR(32), /* High-order word of LAD   @L4A*/ 00857000
*        3 SdexiDrpx64LadLo PTR(32), /* Low-order word of LAD    @L4A*/ 00858000
*      2 * CHAR(32);                /*                           @L4A*/ 00859000
*                                                                       00860000
*DCL SdexiDrpxAST_AddrSpac CHAR(2) Constant('CV');  /* Address space    00861000
*                                                                @L1A*/ 00862000
*DCL SdexiDrpxAST_DataSpac CHAR(2) Constant('DS');  /* Data space       00863000
*                                                                @L1A*/ 00864000
*DCL SdexiDrpxAST_CompData CHAR(2) Constant('SC');  /* Component        00865000
*                 data                                           @L1A*/ 00866000
*DCL SdexiUtokenArea Char(SdexiUtokenAreaSize)                          00867000
*              Based(SdexiUtokenPtr) Bdy(Word);  /* Area to provide     00868000
*                       usertoken entries. See IHASDMIS for the format  00869000
*                       of this array. Note that this is available to   00870000
*                       global exits only.                       @L9A*/ 00871000
*DCL SdexiUtokenAreaSize Fixed(16) Constant(256);  /* Size of           00872000
*                                      SdexiUtokenArea           @L9A*/ 00873000
*DCL MaxXUtokenEntries   Fixed(16) Constant(20);   /* Maximum Utoken    00874000
*                       entries allowed in SDexiUtokenArea       @L9A*/ 00875000
*%                                                                      00876000
* /* The following constant is used by SDUMP in allocating storage      00877000
*    for the parameter list. It has no meaning for the exit. */         00878000
*SdexiTOTL='Length(SDEXI)+Length(SdexDRPX)+Length(SdexSAVE)+            00879000
*Length(SdexWORK)+SdexMAXA*Length(SdexAIDE)+Length(SdexAID#)+           00880000
*SdexiUtokenAreaSize'                                                   00881000
*                         /*                                     @L9C*/ 00882000
*      ;                                                                00883000
*@LOGIC;                                                                00884000
*#PRAGMA TOOL=CBGEN.                                                    00885000
*#DELETE.SDEXISAVE                                                      00886000
*#DELETE.SDEXIWORK                                                      00887000
*#USEORG.                                                               00888000
*#EPRAGMA.                                                              00889000
*@ENDLOGIC;                                                             00890000
*/* End of PL/X Source                                               */ 00891000
* %IF IHASDEXI_LIST = 'NO' !                                            00892000
*    ZCBPRINT = 'NO' %THEN                                              00893000
* %DO;                                                                  00894000
*   @LIST POP NOECHO;                                                   00895000
* %END;                                                                 00896000
* %END;                                                                 00897000
