*   %GO TO TTEL1;                                                       00010000
*                                                                       00020000
*/*                                                                     00030000
         MACRO                                                          00040000
         IHATTE &ALL=,&EX=,&AS=,&BR=,&SCH=,&SIGA=,                     X00050000
               &EXT=,&SVC=,&PGM=,&IO=,&DSP=,                           X00060000
               &MCH=,&RST=,&ACR=,&SUSP=,&ALTR=,&SSRV=,&USRN=,&SPER=,   X00070000
               &RCVY=,&TIME=,&MODE=,&USRNG=,&SPIN=,               @LQC X00080009
               &PCIL=,&PCIS=,&AINT=,&PDMX,&SYNS=,&SYNE=           @04C  00090000
*                                                                    */ 00100000
*                                                                       00110000
*%TTEL1:                                                                00120000
*   ;                                                                   00130000
*                                                                       00140000
*/** START OF SPECIFICATIONS *****************************************/ 00150000
*/*                                                                  */ 00160000
*/* $MAC(IHATTE) COMP(SC142) PROD(HBB77D0):                          */ 00170003
*/*                                                                  */ 00180000
*/* PROPRIETARY STATEMENT:                                           */ 00190000
*/*                                                                  */ 00200000
*/* COPYRIGHT =                                                      */ 00210000
*/*   LICENSED MATERIALS - PROPERTY OF IBM                           */ 00220000
*/*   5650-ZOS COPYRIGHT IBM CORP. 1981, 2021                        */ 00230002
*/*                                                                  */ 00240000
*/* STATUS:  HBB77D0                                                 */ 00250002
*/*                                                                  */ 00260000
*/* MACRO NAME: IHATTE                                               */ 00270000
*/*                                                                  */ 00280000
*/* DESCRIPTIVE NAME: System trace table entry (TTE)                 */ 00290000
*/*                                                                  */ 00300000
*/* COMPONENT: System trace (SC142)                                  */ 00310000
*/*                                                                  */ 00320000
*/* EXTERNAL CLASSIFICATION:                                         */ 00330000
*/* DMTI: BASE                                                       */ 00340000
*/* GUPI: FIELDS TTEXP TTE07F TTE07FAD TTE07FCI TTE07FHA TTE07FPA    */ 00350000
*/*     TTE07FPI TTE07FRB TTE07FRV TTE07FSA TTE07FTB TTEEXP          */ 00360000
*/* END OF EXTERNAL CLASSIFICATION:                                  */ 00370000
*/*                                                                  */ 00380000
*/* FUNCTION:                                                        */ 00390000
*/*   Contain the information from each trace entry.                 */ 00400000
*/*                                                                  */ 00410000
*/* METHOD OF ACCESS:                                                */ 00420000
*/*                                                                  */ 00430000
*/*  ASM:                                                            */ 00440000
*/*                                                                  */ 00450000
*/*   INCLUDE THE IHATTE MAPPING MACRO.                              */ 00460000
*/*        - DSECT TTE IS PRODUCED.                                  */ 00470000
*/*          USING ON TTE GIVES ADDRESSABILITY FOR ALL SYMBOLS.      */ 00480000
*/*                                                                  */ 00490000
*/*          THE FOLLOWING KEYWORD PARAMETERS MUST BE CODED AS       */ 00500000
*/*          '=YES' ON THE INVOCATION OF THE IHATTE MACRO IN         */ 00510000
*/*          ORDER FOR THE INDICATED SECTIONS TO BE GENERATED:       */ 00520000
*/*                                                                  */ 00530000
*/*            ALL  -  ALL ENTRY MAPPINGS                            */ 00540000
*/*                                                                  */ 00550000
*/*            ACR  -  ACR ENTRY MAPPING                             */ 00560000
*/*            AINT -  ADAPTER INTERRUPT ENTRY MAPPING           @LNA*/ 00570000
*/*            ALTR -  TRACE OPTIONS ALTERATION ENTRY MAPPING        */ 00580000
*/*            AS   -  ALL ASID TRACING ENTRY MAPPINGS (NOP)         */ 00590000
*/*            BR   -  ALL BRANCH TRACING ENTRY MAPPINGS (NOP)       */ 00600000
*/*            EX   -  ALL EXPLICIT TRACING ENTRY MAPPINGS           */ 00610000
*/*                                                                  */ 00620000
*/*            DSP  -  ALL DISPATCHER ENTRY MAPPINGS                 */ 00630000
*/*            EXT  -  ALL EXTERNAL INTERRUPT ENTRY MAPPINGS         */ 00640000
*/*            IO   -  I/O INTERRUPT ENTRY MAPPING                   */ 00650000
*/*            MCH  -  MACHINE CHECK INTERRUPT ENTRY MAPPING         */ 00660000
*/*            MODE -  ALL MODE TRACING ENTRY MAPPINGS (NOP)         */ 00670000
*/*            PCIL -  PCI LOAD ENTRY MAPPING                    @LNA*/ 00680000
*/*            PCIS -  PCI STORE ENTRY MAPPING                   @LNA*/ 00690000
*/*            PDMX -  PCIE DEMULTIPLEX ENTRY MAPPING            @LNA*/ 00700000
*/*            PGM  -  PROGRAM INTERRUPT ENTRY MAPPING               */ 00710000
*/*            RCVY -  RECOVERY ENTRY MAPPING                        */ 00720000
*/*            RST  -  RESTART INTERRUPT ENTRY MAPPING               */ 00730000
*/*            SCH  -  ALL SUBCHANNEL ENTRY MAPPINGS                 */ 00740000
*/*            SIGA -  Signal adapter mapping                        */ 00750000
*/*            SPER -  SLIP/PER EVENT ENTRY MAPPING                  */ 00760000
*/*            SPIN -  Spin event entry mapping                  @LJA*/ 00770000
*/*            SSRV -  PC OR BRANCH ENTERED SYSTEM SERVICE ENTRY     */ 00780000
*/*                    MAPPING                                       */ 00790000
*/*            SUSP -  SUSPENSION ENTRY MAPPING                      */ 00800000
*/*            SYNE -  Synchronous I/O End Mapping               @04A*/ 00800100
*/*            SYNS -  Synchronous I/O Start Mapping             @04A*/ 00800200
*/*            SVC  -  ALL SUPERVISOR CALL ENTRY MAPPINGS            */ 00800300
*/*            TIME -  TIMER SERVICES ENTRY MAPPING                  */ 00800400
*/*            USRN -  USER EVENT TRACE ENTRY MAPPING                */ 00800500
*/*                                                                  */ 00800600
*/*          FOR EXAMPLE:  AS=YES,SUSP=YES                           */ 00800700
*/*                                                                  */ 00800800
*/*  PL/S:                                                           */ 00800900
*/*                                                                  */ 00801000
*/*   INCLUDE THE IHATTE MAPPING MACRO.                              */ 00802000
*/*        - BASED STRUCTURE TTE IS PRODUCED.                        */ 00803000
*/*   DECLARE TTEPTR POINTER(31).                                    */ 00804000
*/*                                                                  */ 00805000
*/*          THE FOLLOWING MACRO VARIABLES MUST BE SET TO 'YES'      */ 00806000
*/*          BEFORE INCLUDING THE IHATTE MAPPING MACRO TO CAUSE      */ 00807000
*/*          THE INDICATED SECTIONS TO BE GENERATED:                 */ 00808000
*/*                                                                  */ 00809000
*/*            %TTEALL  -  ALL ENTRY MAPPINGS                        */ 00810000
*/*                                                                  */ 00820000
*/*            %TTEAINT -  ADAPTER INTERRUPT TRACE ENTRY MAPPING @04A*/ 00830000
*/*            %TTEAS   -  ALL ASID TRACING ENTRY MAPPINGS           */ 00840000
*/*            %TTEBR   -  ALL BRANCH TRACING ENTRY MAPPINGS         */ 00850000
*/*            %TTEMO   -  ALL MODE TRACING ENTRY MAPPINGS           */ 00860000
*/*            %TTEEX   -  ALL EXPLICIT TRACING ENTRY MAPPINGS       */ 00870000
*/*                                                                  */ 00880000
*/*            %TTEACR  -  ACR ENTRY MAPPING                         */ 00890000
*/*            %TTEALTR -  TRACE OPTIONS ALTERATION ENTRY MAPPING    */ 00900000
*/*            %TTEDSP  -  ALL DISPATCHER ENTRY MAPPINGS             */ 00910000
*/*            %TTEEXT  -  ALL EXTERNAL INTERRUPT ENTRY MAPPINGS     */ 00920000
*/*            %TTEIO   -  I/O INTERRUPT ENTRY MAPPING               */ 00930000
*/*            %TTEMCH  -  MACHINE CHECK INTERRUPT ENTRY MAPPING     */ 00940000
*/*            %TTEPCIL -  PCIE LOAD TRACE TABLE ENTRY MAPPING   @04A*/ 00950000
*/*            %TTEPCIS -  PCIE STORE TRACE TABLE ENTRY MAPPING  @04A*/ 00960000
*/*            %TTEPDMX -  PCIE DEMULTIPLEX ENTRY MAPPING        @04A*/ 00970000
*/*            %TTEPGM  -  PROGRAM INTERRUPT ENTRY MAPPING           */ 00980000
*/*            %TTERST  -  RESTART INTERRUPT ENTRY MAPPING           */ 00990000
*/*            %TTESCH  -  ALL SUBCHANNEL ENTRY MAPPINGS             */ 01000000
*/*            %TTESIGA -  Signal adapter mapping                    */ 01010000
*/*            %TTESPER -  SLIP/PER EVENT ENTRY MAPPING              */ 01020000
*/*            %TTESSRV -  PC OR BRANCH ENTERED SYSTEM SERVICE       */ 01030000
*/*                        ENTRY MAPPING                             */ 01040000
*/*            %TTESUSP -  SUSPENSION ENTRY MAPPING                  */ 01050000
*/*            %TTESVC  -  ALL SUPERVISOR CALL ENTRY MAPPINGS        */ 01060000
*/*            %TTESYNE -  Synch I/O End mapping                 @04A*/ 01070000
*/*            %TTESYNS -  Synch I/O Start mapping               @04A*/ 01080000
*/*            %TTEUSRN -  USER EVENT TRACE ENTRY MAPPING            */ 01090000
*/*            %TTEUSRNG-  USER EVENT TRACE ENTRY MAPPING -- TRACG   */ 01100000
*/*            %TTERCVY -  RECOVERY ENTRY MAPPING                    */ 01110000
*/*            %TTESPIN -  Spin event entry mapping              @LJA*/ 01120000
*/*            %TTETIME -  TIMER SERVICES ENTRY MAPPING              */ 01130000
*/*                                                                  */ 01140000
*/*          FOR EXAMPLE:  %TTEAS='YES'                              */ 01150000
*/*                        %TTESUSP='YES'                            */ 01160000
*/*                                                                  */ 01170000
*/*   DSECT NAME: TTE                                                */ 01180000
*/*   EYE CATCHER:  NONE                                             */ 01190000
*/*                                                                  */ 01200000
*/* Created by:  Implicitly by the hardware or explicitly by:        */ 01210000
*/*   system trace table entry creation routines (IEAVETRC),         */ 01220000
*/*   the dispatcher (PTRACE in IEAVEDS0),                           */ 01230000
*/*   exit prologue routine (PTRACE in IEAVEEXP),                    */ 01240000
*/*   and SVC FLIH (PTRACE in IEAVESVC).                             */ 01250000
*/*                                                                  */ 01260000
*/* DELETED BY: N/A                                                  */ 01270000
*/*                                                                  */ 01280000
*/* POINTED TO BY:                                                   */ 01290000
*/*   Control register 12                                            */ 01300000
*/*   TBVTCR12                                                       */ 01310000
*/*   TBVTENTY                                                       */ 01320000
*/*   Parameter 3 for ITRF0n7F, the USRn formatting routines,        */ 01330000
*/*     where n is 0-9.                                              */ 01340000
*/*                                                                  */ 01350000
*/* SERIALIZATION:                                                   */ 01360000
*/*   Disablement on the processor and zeroed tracing control bits   */ 01370000
*/*   in control register 12.                                        */ 01380000
*/*                                                                  */ 01390000
*/* STORAGE ATTRIBUTES:                                              */ 01400000
*/*                                                                  */ 01410000
*/*   SUBPOOL:                                                       */ 01420000
*/*     245 in tracing buffers created by IEAVNIP0.                  */ 01430000
*/*     255 in tracing buffers created by IEAVETEA.                  */ 01440000
*/*                                                                  */ 01450000
*/*   KEY:      0                                                    */ 01460000
*/*                                                                  */ 01470000
*/*   SIZE:     Depends on type of entry.                            */ 01480000
*/*                                                                  */ 01490000
*/* DISTRIBUTION LIBRARY: AMACLIB                                    */ 01500000
*/*                                                                  */ 01510000
*/*   CHANGE ACTIVITY:                                               */ 01520000
*/*      G860PXY - SYSTEM TRACE EXTENSIONS                           */ 01530000
*/* $L1= TREVENT JBB2125 820823 PDXM: TRACE PER EVENTS               */ 01540000
*/*    = DCRR0050 JBB2125 830428 PDXM:  SERVICE SIGNAL TRACE TABLE   */ 01550000
*/*      ENTRY ENHANCEMENT                                           */ 01560000
*/* $L2= AR      HBB3310 860210 PDR8:   ACCESS REGISTERS             */ 01570000
*/* $L3= RTMRAS  HBB3310 860414 PDR8:   RCVY ENTRY SUPPORT           */ 01580000
*/* $L4= LOCKR   HBB4410 871026 PDT7:   PSACLHSE SUPPORT             */ 01590000
*/* $L5= CLOCK   HBB4410 880428 PD88CT: TIME ENTRY SUPPORT           */ 01600000
*/* $L6= CNITG   HBB4410 881128 PD88CT: UPDATE THE MAPPING FOR THE   */ 01610000
*/*      CHANGED SS TRACE ENTRY                                      */ 01620000
*/* $P1= PEO2361 HBB4410 890814 PD88CT: UPDATE TYPE=SUSP TTE ENTRY   */ 01630000
*/*      DESCRIPTION                                                 */ 01640000
*/* $P2= PH31564 HBB4420 901130 PD88CT: UPDATE TYPE=SSRB ENTRY       */ 01650000
*/*      DESCRIPTION                                                 */ 01660000
*/*    = FOURDGIT HBB5510 930304 PD88XM:  ADD TOKEN FOR I/O RELATED  */ 01670000
*/*      TTES                                                        */ 01680000
*/* $L7= SUBSP   HBB5510 930412 PD88XM: BSG ENTRY.                   */ 01690000
*/*    = PIG2260 HBB5510 930909 PD88XM: CDPI INFORMATION.            */ 01700000
*/* $L8= PAVS    HBB5520 940215 PDXM: ADD CAPTURED UCB ADDRESS AND   */ 01710000
*/*      CHANGE ADDRESSABILITY TO ACTUAL DEVICE NUMBER FOR SSCH      */ 01720000
*/*      ENTRIES.                                                    */ 01730000
*/* $D1= DN70021 HBB5520 940505 PDXM: ADD WEB ADDRESS TO SRB AND     */ 01740000
*/*      SSRB ENTRIES.                                               */ 01750000
*/* $01= OW38365 JBB6607 981101 PDHT: Signal adapter event support   */ 01760000
*/* $L9= 64BITSLP HBB7703 981204 PD00XB: ESAME                       */ 01770000
*/*    = PXD0809  HBB7703 000210 PDE1: SHOWHDR compliance            */ 01780000
*/* $LA= DYCHM    HBB7703 000218 PDDR: DYNAMIC CHPID MANAGEMENT      */ 01790000
*/* $P3= PXD1550  HBB7703 000325 PDH6: MODE problems                 */ 01800000
*/* $P4= PXD1550  HBB7703 000325 PDE1: New hardware trace formats    */ 01810000
*/* $LB= 64BITSYT HBB7705 001108 PDE1: 64-bit TEA in PGM entry       */ 01820000
*/*    = IMEX     HBB7708 021115 PDON: Immediate Execution Support   */ 01830000
*/* $02= OA02284  HBB7703 021231 PDON: Immediate Execution Support   */ 01840000
*/* $LD= V64TR    HBB7708 021125 PD2C: IARV64 Tracing Support        */ 01850000
*/* $LE= LXREU    HBB7709 030801 PDXB: ASN-and-LX-Reuse Facility     */ 01860000
*/*    = PJK0987  HBB7709 030929 PDE1: Document TTE019SI/TTE019AD    */ 01870000
*/*      completely and accurately                                   */ 01880000
*/* $LF= SCHSET   HBB7720 040330 PDPY: Subchannel Sets               */ 01890000
*/* $LG= SVA      HBB7720 031028 IIRT: TracG support                 */ 01900000
*/*    = ME01640 HBB7720,040829,PDE1: 5637-A01 ==> 5694-A01          */ 01910000
*/* $P5= ME03162  HBB7720 050322 PDH6: Physical CP ID                */ 01920000
*/* $LH= SVAH7Q   HBB7740 060615 PDPG: STDATA                        */ 01930000
*/*    = IOSHPF   HBB7740 070331 PDHC: High Performance FICON,       */ 01940000
*/*                                    flagged as OAnnnnn            */ 01950000
*/* $A4= OAnnnnn  HBB7720 070331 PDHC: High Performance FICON        */ 01960000
*/*                                    - TTE601IA                    */ 01970000
*/*    = ME08404,HBB7740,06311,PDE1: Prolog cleanup                  */ 01980000
*/* $LI= SVAIZW   HBB7750 070820 IISN: Move trace buffers above the  */ 01990000
*/*      bar.                                                        */ 02000000
*/* $LJ= SPINT    HBB7760 081105 PDXB: Spin event entry mapping      */ 02010000
*/* $LK= IOSRAS   HBB7770 090430 PDHC: CF CPU entry mapping          */ 02020000
*/* $LL=RMODE64   HBB7780 091101 PDXB: RMODE 64                      */ 02030000
*/* $P6=ME17714   HBB7780 091120 PDCS: Correct bdy of TTEB6ADR       */ 02040000
*/* $LM=RMODE64   HBB7780 091211 PDXB: RMODE 64 for SLIP             */ 02050000
*/* $P7=ME22443   HBB7790 110830 PDKD: More fields in a RCVY record  */ 02060000
*/* $LN=FPGA      HBB7790 120803 PDMD: PCIE Trace entry support      */ 02070000
*/* $P8=ME24842   HBB7790 120930 PDMD: Change bit positions of ISC   */ 02080000
*/*                                    in TTE10AU1B3                 */ 02090000
*/* $03=ME27166   HBB77A0 140212 PDXB: CLKC TQE update               */ 02100000
*/* $LO=092678    HBB77B0 160317 PDH6: Extend physical CP ID         */ 02110000
*/*    =OA50757   HBB7790 160730 PDH6: Rollback $LO                  */ 02120000
*/* $04=OA50653   HBB7790 170915 PDMD: Synchronous I/O               */ 02130000
*/* $LP=W354028   HBB77D0 191224 PDH6: Fix TRACG formatting          */ 02131004
*/* $LQ=W358825   HBB77D0 200131 PDH6: Remove wasted space in TRACG  */ 02132013
*/*                                    Fix USRNG definition on ASM   */ 02140009
*/*                                    MACRO statement               */ 02141009
*/*                                                                  */ 02142009
*/** END OF SPECIFICATIONS *******************************************/ 02150000
*/* A-000000-999999                                          @G860PXY*/ 02160000
*                                                                       02170000
*   %GO TO TTEL2;                                                       02180000
*                                                                       02190000
*/*                                                                     02191000
*   SYSTEM TRACE TABLE ENTRY                                            02192000
*                                                                       02193000
         SPACE 1                                                        02194000
TTE      DSECT                          TRACE TABLE ENTRY.              02195000
         DS    0CL4                     MINIMUM TRACE TABLE ENTRY.      02196000
.*                                                                      02197000
         AIF   ('&BR' NE 'YES').ENDBR                              @P4C 02198000
         SPACE 3                                                        02199000
*                                                                       02200000
*   BR - BRANCH TTE no longer mapped                                    02210000
*                                                                       02220000
.ENDBR  ANOP                                                            02230000
.*                                                                      02240000
         AIF   ('&MODE' NE 'YES').ENDMODE                          @P4C 02250000
         SPACE 3                                                        02260000
*                                                                       02270000
*   MODE - MODE TTE - no longer mapped                                  02280000
*                                                                       02290000
.ENDMODE ANOP                                                      @L9A 02300000
.*                                                                      02310000
         AIF   ('&AS' NE 'YES').ENDAS                              @P4C 02320000
         SPACE 3                                                        02330000
*                                                                       02340000
*     Address space TTEs - no longer mapped                             02350000
*                                                                       02360000
.ENDAS   ANOP                                                           02370000
.*                                                                      02380000
         SPACE 3                                                        02390000
*                                                                       02400000
*     GENERAL EXPLICIT TTE                                              02410000
*                                                                       02420000
         ORG   TTE                                                      02430000
TTEXP    DS    0CL12                   EXPLICIT TRACE TABLE ENTRY.      02440000
TTETYPE  DS    XL1                     TRACE TABLE ENTRY TYPE (X'7N').  02450000
TTETEX   EQU   X'70'                   EXPLICIT TTE TYPE (X'7N').       02460000
TTEMEX   EQU   X'F0'                   MASK FOR EXPLICIT TTE TYPE.      02470000
TTEREGS  EQU   X'0F'                   MASK FOR ONE LESS THAN THE       02480000
*                                      NUMBER OF REGISTERS              02490000
*                                      IN THE TTE.                      02500000
TTEMBZ1  DS    XL1                     RESERVED. (MUST BE ZERO)         02510000
TTETOD   DS    XL6                     TOD-CLOCK BITS 16-63.            02520000
TTETOTE  DS    0XL4                    TRACE OPERAND TABLE ENTRY.       02530000
TTECPID  DS    XL2                     CP ID                       @LOC 02540000
TTEXPTYP DS    0H                      EXPLICIT ENTRY TYPE.             02550000
TTEXPSID DS    XL1                     EXPLICIT ENTRY SUB-ID.           02560000
TTEMSID  EQU   X'0F'                   MASK FOR EXPLICIT TTE SUB-ID.    02570000
TTEXPID  DS    XL1                     EXPLICIT ENTRY ID.               02580000
TTEUNQ   DS    0F                      UNIQUE ENTRY DESCRIPTIONS.       02590000
TTEEXCOM DS    0CL64                   EXPLICIT ENTRY COMMON FIELD      02600000
*                                      NAMES.                           02610000
TTEWRD0  DS    0CL4                    TTE WORD 0.                      02620000
TTETCB   DS    A                       TCB ADDRESS.                     02630000
TTEWRD1  DS    0CL4                    TTE WORD 1.                      02640000
TTEDEP   DS    H                       DEPENDENT ON EACH                02650000
*                                      EXPLICIT TTE ENTRY.              02660000
TTEASID  DS    H                       ASID.                            02670000
TTEWRD2  DS    CL4                     TTE WORD 2.                      02680000
TTEWRD3  DS    CL4                     TTE WORD 3.                      02690000
TTEWRD4  DS    CL4                     TTE WORD 4.                      02700000
TTEWRD5  DS    CL4                     TTE WORD 5.                      02710000
TTEWRD6  DS    CL4                     TTE WORD 6.                      02720000
TTEWRD7  DS    CL4                     TTE WORD 7.                      02730000
TTEWRD8  DS    CL4                     TTE WORD 8.                      02740000
TTEWRD9  DS    CL4                     TTE WORD 9.                      02750000
TTEWRDA  DS    CL4                     TTE WORD 10.                     02760000
TTEWRDB  DS    CL4                     TTE WORD 11.                     02770000
TTEWRDC  DS    CL4                     TTE WORD 12.                     02780000
TTEWRDD  DS    CL4                     TTE WORD 13.                     02790000
TTEWRDE  DS    CL4                     TTE WORD 14.                     02800000
TTEWRDF  DS    CL4                     TTE WORD 15.                     02810000
TTEXPEND DS    0F                      END OF MAXIMUM EXPLICIT TTE.     02820000
         SPACE 1                                                        02830000
TTETMAX  EQU   76                      MAXIMUM LENGTH OF EXPLICIT       02840000
*                                      ENTRIES.                         02850000
*                                                                       02860000
         ORG   TTE                                                      02870000
TTEEXP   DS    0CL16                   EXPLICIT TRACE TABLE ENTRY.      02880000
TTEETYPE DS    XL1                     TRACE TABLE ENTRY TYPE (X'7N').  02890000
TTEETEX  EQU   X'70'                   EXPLICIT TTE TYPE (X'7N').  @LGA 02900000
TTEEMEX  EQU   X'F0'                   MASK FOR EXPLICIT TTE TYPE. @LGA 02910000
TTEEREGS EQU   X'0F'                   MASK FOR ONE LESS THAN THE  @LGA 02920000
*                                      NUMBER OF REGISTERS              02930000
*                                      IN THE TTE.                      02940000
TTEEMBZ1 DS    X'80'                   MUST BE 10000000            @LGA 02950000
TTEETOD  DS    XL10                    TOD-CLOCK BITS 0-79.        @LGA 02960000
TTEETOTE DS    0XL4                    TRACE OPERAND TABLE ENTRY.  @LGA 02970000
TTEECPID DS    XL2                     CP ID                       @LOC 02980000
TTEEXPTP DS    0H                      EXPLICIT ENTRY TYPE.        @LGA 02990000
TTEEXPSD DS    XL1                     EXPLICIT ENTRY SUB-ID.      @LGA 03000000
TTEEMSID EQU   X'0F'                   MASK FOR EXPLICIT TTE SUB-ID.    03010000
TTEEXPID DS    XL1                     EXPLICIT ENTRY ID.          @LGA 03020000
TTEEUNQ  DS    0F                      UNIQUE ENTRY DESCRIPTIONS.  @LGA 03030000
TTEEECOM DS    0CL128                  EXPLICIT ENTRY COMMON FIELD @LGA 03040000
*                                      NAMES.                           03050000
TTEEWRD1 DS    0CL8                    TTE DOUBLE WORD1            @LQC 03070009
TTEETCB  DS    A                       TCB ADDRESS.                @LGA 03080000
TTEEDEP  DS    H                       DEPENDENT ON EACH           @LGA 03110000
*                                      EXPLICIT TTE ENTRY.              03120000
TTEEASID DS    H                       ASID.                       @LGA 03130000
TTEEWRD2 DS    CL8                     TTE DOUBLE WORD3            @LGA 03140000
TTEEWRD3 DS    CL8                     TTE DOUBLE WORD4            @LGA 03150000
TTEEWRD4 DS    CL8                     TTE DOUBLE WORD5            @LGA 03160000
TTEEWRD5 DS    CL8                     TTE DOUBLE WORD6            @LGA 03170000
TTEEWRD6 DS    CL8                     TTE DOUBLE WORD7            @LGA 03180000
TTEEWRD7 DS    CL8                     TTE DOUBLE WORD8            @LGA 03190000
TTEEWRD8 DS    CL8                     TTE DOUBLE WORD9            @LGA 03200000
TTEEWRD9 DS    CL8                     TTE DOUBLE WORD10           @LGA 03210000
TTEEWRDA DS    CL8                     TTE DOUBLE WORD11           @LGA 03220000
TTEEWRDB DS    CL8                     TTE DOUBLE WORD12           @LGA 03230000
TTEEWRDC DS    CL8                     TTE DOUBLE WORD13           @LGA 03240000
TTEEWRDD DS    CL8                     TTE DOUBLE WORD14           @LGA 03250000
TTEEWRDE DS    CL8                     TTE DOUBLE WORD15           @LGA 03260000
TTEEWRDF DS    CL8                     TTE DOUBLE WORD16           @LGA 03270000
TTEEXEND DS    0F                      END OF MAXIMUM EXPLICIT TTE.     03280000
*                                                                       03280105
*        Pre-z/OS 2.5 mapping                                      @LQA 03280209
*                                                                       03280305
         ORG   TTEEECOM                                                 03281005
TTEEWRD0_pre25 DS    0CL8              TTE DOUBLE WORD0            @LQA 03282009
               DS    XL4               RESERVED                    @LQA 03283009
TTEETCB_pre25  DS    A                 TCB ADDRESS.                @LQA 03284009
TTEEWRD1_pre25 DS    0CL8              TTE DOUBLE WORD1            @LQA 03285009
               DS    XL4               RESERVED                    @LQA 03286009
TTEEDEP_pre25  DS    H                 DEPENDENT ON EACH           @LQA 03287009
*                                      EXPLICIT TTE ENTRY.              03288005
TTEEASID_pre25 DS    H                 ASID.                       @LQA 03289009
TTEEWRD2_pre25 DS    CL8               TTE DOUBLE WORD3            @LQA 03289109
TTEEWRD3_pre25 DS    CL8               TTE DOUBLE WORD4            @LQA 03289209
TTEEWRD4_pre25 DS    CL8               TTE DOUBLE WORD5            @LQA 03289309
TTEEWRD5_pre25 DS    CL8               TTE DOUBLE WORD6            @LQA 03289409
TTEEWRD6_pre25 DS    CL8               TTE DOUBLE WORD7            @LQA 03289509
TTEEWRD7_pre25 DS    CL8               TTE DOUBLE WORD8            @LQA 03289609
TTEEWRD8_pre25 DS    CL8               TTE DOUBLE WORD9            @LQA 03289709
TTEEWRD9_pre25 DS    CL8               TTE DOUBLE WORD10           @LQA 03289809
TTEEWRDA_pre25 DS    CL8               TTE DOUBLE WORD11           @LQA 03289909
TTEEWRDB_pre25 DS    CL8               TTE DOUBLE WORD12           @LQA 03290009
TTEEWRDC_pre25 DS    CL8               TTE DOUBLE WORD13           @LQA 03290109
TTEEWRDD_pre25 DS    CL8               TTE DOUBLE WORD14           @LQA 03290209
TTEEWRDE_pre25 DS    CL8               TTE DOUBLE WORD15           @LQA 03290309
TTEEWRDF_pre25 DS    CL8               TTE DOUBLE WORD16           @LQA 03290409
TTEEXEND_pre25 DS    0F                END OF MAXIMUM EXPLICIT TTE @LQa 03290509
*                                                                       03291005
TTEETMAX EQU   144                     MAXIMUM LENGTH OF EXPLICIT  @LGA 03300000
*                                      ENTRIES                          03310000
*                                                                       03320000
TTEMTSCH EQU   X'001'                  SUBCHANNEL TYPE MAJOR ID.        03330000
TTEMTEXT EQU   X'003'                  EXTERNAL INTERRUPT TYPE MAJOR    03340000
*                                      ID.                              03350000
TTEMTSVC EQU   X'005'                  SVC TYPE MAJOR ID.               03360000
TTEMTDSP EQU   X'00F'                  DISPATCHER TYPE MAJOR ID.        03370000
*                                                                       03380000
*                                                                       03390000
TTETSSCH EQU   X'001'                  SSCH TYPE ID.                    03400000
TTETEXT  EQU   X'003'                  GENERAL EXT TYPE ID.             03410000
TTETSVC  EQU   X'005'                  GENERAL SVC TYPE ID.             03420000
TTETPGM  EQU   X'007'                  PGM TYPE ID.                     03430000
TTETSPER EQU   X'009'                  SLIP/PER TYPE ID.           @L1A 03440000
TTETPDMX EQU   X'00A'                  PDMX TYPE ID.               @LNA 03450000
TTETSYNS EQU   X'00C'                  Synch I/O Start ID          @04A 03460000
TTETDSP  EQU   X'00F'                  DSP TYPE ID.                     03470000
TTETIO   EQU   X'00B'                  IO TYPE ID.                      03480000
TTETMCH  EQU   X'013'                  MCH TYPE ID.                     03490000
TTETRST  EQU   X'015'                  RST TYPE ID.                     03500000
TTETACR  EQU   X'017'                  ACR TYPE ID.                     03510000
TTETSUSP EQU   X'019'                  SUSP TYPE ID.                    03520000
TTETALTR EQU   X'01B'                  ALTR TYPE ID.                    03530000
TTETRCVY EQU   X'01D'                  RCVY TYPE ID.               @L3A 03540000
TTETSPIN EQU   X'01E'                  SPIN TYPE ID.               @LJA 03550000
TTETTIME EQU   X'01F'                  TIME TYPE ID.               @L5A 03560000
TTETUSR0 EQU   X'07F'                  USR0 TYPE ID.                    03570000
TTETEMS  EQU   X'103'                  EMS EXT TYPE ID.                 03580000
TTETMSCH EQU   X'101'                  MSCH TYPE ID.                    03590000
TTETSVCR EQU   X'105'                  SVCR TYPE ID.                    03600000
TTETAINT EQU   X'10A'                  AINT TYPE ID.               @LNA 03610000
TTETSYNE EQU   X'10C'                  Synch I/O End ID            @04A 03620000
TTETSRB  EQU   X'10F'                  SRB TYPE ID.                     03630000
TTETUSR1 EQU   X'17F'                  USR1 TYPE ID.                    03640000
TTETHSCH EQU   X'201'                  HSCH TYPE ID.                    03650000
TTETSS   EQU   X'203'                  SS EXT TYPE ID.                  03660000
TTETSSRV EQU   X'205'                  SSRV TYPE ID.               @L2A 03670000
TTETPCIL EQU   X'20A'                  PCIL TYPE ID.               @LNA 03680000
TTETSSRB EQU   X'20F'                  SSRB TYPE ID.                    03690000
TTETUSR2 EQU   X'27F'                  USR2 TYPE ID.                    03700000
TTETCSCH EQU   X'301'                  CSCH TYPE ID.                    03710000
TTETCALL EQU   X'303'                  EXTERNAL CALL EXT TYPE ID.       03720000
TTETPCIS EQU   X'30A'                  PCIS TYPE ID.               @LNA 03730000
TTETUSR3 EQU   X'37F'                  USR3 TYPE ID.                    03740000
TTETRSCH EQU   X'401'                  RSCH TYPE ID.                    03750000
TTETCLKC EQU   X'403'                  CLOCK COMPARATOR EXT TYPE ID.    03760000
TTETUSR4 EQU   X'47F'                  USR4 TYPE ID.                    03770000
TTETSIGA EQU   X'501'                  SIGA TYPE ID.               @01A 03780000
TTETUSR5 EQU   X'57F'                  USR5 TYPE ID.                    03790000
TTETXSCH EQU   X'601'                  XSCH TYPE ID.               @02A 03800000
TTETUSR6 EQU   X'67F'                  USR6 TYPE ID.                    03810000
TTETUSR7 EQU   X'77F'                  USR7 TYPE ID.                    03820000
TTETUSR8 EQU   X'87F'                  USR8 TYPE ID.                    03830000
TTETUSR9 EQU   X'97F'                  USR9 TYPE ID.                    03840000
TTETUSRA EQU   X'A7F'                  USRA TYPE ID.                    03850000
TTETUSRB EQU   X'B7F'                  USRB TYPE ID.                    03860000
TTETUSRC EQU   X'C7F'                  USRC TYPE ID.                    03870000
TTETUSRD EQU   X'D7F'                  USRD TYPE ID.                    03880000
TTETUSRE EQU   X'E7F'                  USRE TYPE ID.                    03890000
TTETSVCE EQU   X'F05'                  SVC ERROR TYPE ID.               03900000
TTETWAIT EQU   X'F0F'                  WAIT TYPE ID.                    03910000
TTETUSRF EQU   X'F7F'                  USRF TYPE ID.                    03920000
.*                                                                      03930000
         AIF   ('&ALL' NE 'YES' AND                                    X03940000
               '&EX' NE 'YES' AND                                      X03950000
               '&ACR' NE 'YES').ENDACR                                  03960000
         SPACE 2                                                        03970000
*     ACR - ALTERNATE CPU RECOVERY TTE                                  03980000
         ORG   TTEUNQ                                                   03990000
TTE017   DS    0F                      ACR (ACR).                       04000000
TTE017TB DS    A                       PSATOLD FROM THE FAILING         04010000
*                                      PROCESSOR.                       04020000
*                                      * FLCCVT->CVTPCCAT->             04030000
*                                      *   PCCAT00P(PSASPAD)->          04040000
*                                      *   PCCAPSAV->PSATOLD.           04050000
TTE017LP DS    H                       PSACPUPA. LOGICAL PROCESSOR      04060000
*                                      ADDRESS.                         04070000
*                                      * FLCCVT->CVTPCCAT->             04080000
*                                      *   PCCAT00P(PSASPAD)->          04090000
*                                      *   PCCAPSAV->PSACPUPA.          04100000
TTE017HA DS    H                       HOME ADDRESS SPACE FROM THE      04110000
*                                      FAILING PROCESSOR.               04120000
*                                      * FLCCVT->CVTPCCAT->             04130000
*                                      *   PCCAT00P(PSASPAD)->          04140000
*                                      *   PCCAPSAV->PSAAOLD->          04150000
*                                      *   ASCBASID.                    04160000
TTE017AD DS    A                       PSAEEPSW FROM THE ACR PROCESSOR. 04170000
*                                      FAILING PROCESSOR ADDRESS.       04180000
*                                      * PSAEEPSW.                      04190000
TTE017FG DS    XL1                     LCCACREX. ACR FLAG BYTE          04200000
*                                      FROM THE FAILING PROCESSOR.      04210000
*                                      * FLCCVT->CVTPCCAT->             04220000
*                                      *   PCCAT00P(PSASPAD)->          04230000
*                                      *   PCCAPSAV->PSALCCAV->         04240000
*                                      *   LCCACREX.                    04250000
TTE017R1 DS    XL3                     RESERVED.                        04260000
TTE017FR DS    A                       PSACSTK. CURRENT FRR STACK       04270000
*                                      ADDRESS FROM THE FAILING         04280000
*                                      PROCESSOR.                       04290000
*                                      * FLCCVT->CVTPCCAT->             04300000
*                                      *   PCCAT00P(PSASPAD)->          04310000
*                                      *   PCCAPSAV->PSACSTK.           04320000
TTE017PS DS    F                       PSASUPER FROM THE FAILING        04330000
*                                      PROCESSOR.                       04340000
*                                      * FLCCVT->CVTPCCAT->             04350000
*                                      *   PCCAT00P(PSASPAD)->          04360000
*                                      *   PCCAPSAV->PSASUPER.          04370000
TTE017MW DS    F                       PSAMODEW FROM THE FAILING        04380000
*                                      PROCESSOR.                       04390000
*                                      * FLCCVT->CVTPCCAT->             04400000
*                                      *   PCCAT00P(PSASPAD)->          04410000
*                                      *   PCCAPSAV->PSAMODEW.          04420000
TTE017LH DS    F                       PSACLHS FROM THE FAILING         04430000
*                                      PROCESSOR.                       04440000
*                                      * FLCCVT->CVTPCCAT->             04450000
*                                      *   PCCAT00P(PSASPAD)->          04460000
*                                      *   PCCAPSAV->PSACLHS.           04470000
TTE017PL DS    A                       PSALOCAL FROM THE FAILING        04480000
*                                      PROCESSOR.                       04490000
*                                      * FLCCVT->CVTPCCAT->             04500000
*                                      *   PCCAT00P(PSASPAD)->          04510000
*                                      *   PCCAPSAV->PSALOCAL.          04520000
TTE017LE DS    F                       PSACLHSE FROM THE FAILING   @L4A 04530000
*                                      PROCESSOR.                  @L4A 04540000
*                                      * FLCCVT->CVTPCCAT->        @L4A 04550000
*                                      *   PCCAT00P(PSASPAD)->     @L4A 04560000
*                                      *   PCCAPSAV->PSACLHSE.     @L4A 04570000
TTE017ED DS    0F                      END OF ACR TTE.                  04580000
.ENDACR  ANOP                                                           04590000
.*                                                                      04600000
         AIF   ('&ALL' NE 'YES' AND                                    X04610000
               '&EX' NE 'YES' AND                                      X04620000
               '&ALTR' NE 'YES').ENDALTR                                04630000
         SPACE 2                                                        04640000
*     ALTR - TRACE OPTIONS ALTERATION TTE                               04650000
         ORG   TTEUNQ                                                   04660000
TTE01B   DS    0F                      TRACE OPTIONS ALTERATION (ALTR). 04670000
TTE01BTB DS    A                       CURRENT TCB ADDRESS OR 0.        04680000
*                                      * PSATOLD.                       04690000
TTE01BR1 DS    H                       RESERVED.                        04700000
TTE01BHA DS    H                       HOME ADDRESS SPACE.              04710000
*                                      * PSAAOLD->ASCBASID.             04720000
TTE01BPA DS    H                       PASID.                           04730000
*                                      * CONTROL REGISTER 4.            04740000
TTE01BSA DS    H                       SASID.                           04750000
*                                      * CONTROL REGISTER 3.            04760000
TTE01BFC DS    F                       REGISTER 0 TRACE FUNCTION CODE.  04770000
*                                      ALTRTRC INPUT.                   04780000
*                                      * INPUT REGISTER 0.              04790000
TTE01BAC DS    F                       REGISTER 1 TRACE ACTION CODE.    04800000
*                                      ALTRTRC INPUT.                   04810000
*                                      * INPUT REGISTER 1.              04820000
TTE01BPT DS    0FL8                    TOBTROPT - CONTROL REGISTER 12   04830000
*                                      MODEL FORMAT.                    04840000
*                                      * PSATRVT->TRVTTOB->TOBTROPT.    04850000
*                                                                  @LIC 04860000
TTE01BPTW1 DS  F                       FIRST WORD                  @LIA 04870000
TTE01BPTW2 DS  F                       SECOND WORD                 @LIA 04880000
TTE01BBF DS    0FL8                    TOBTRBUF - NUMBER OF TRACE       04890000
*                                      BUFFERS PER PROCESSOR.           04900000
*                                      * PSATRVT->TRVTTOB->TOBTRBUF.    04910000
*                                                                  @LIC 04920000
TTE01BBFW1 DS  F                       FIRST WORD                  @LIA 04930000
TTE01BBFW2 DS  F                       SECOND WORD                 @LIA 04940000
TTE01BCT DS    H                       TOBTRPOL - NUMBER OF PROCESSORS  04950000
*                                      WITH TRACE CURRENTLY ACTIVE      04960000
*                                      AND/OR SUSPENDED.                04970000
*                                      * PSATRVT->TRVTTOB->TOBTRPOL.    04980000
*                                                                  @LIM 04990000
TTE01BR2 DS    H                       RESERVED.                   @LIA 05000000
TTE01BED DS    0F                      END OF ALTR TTE.                 05010000
.ENDALTR ANOP                                                           05020000
.*                                                                      05030000
         AIF   ('&ALL' NE 'YES' AND                                    X05040000
               '&EX' NE 'YES' AND                                      X05050000
               '&EXT' NE 'YES').ENDCALL                                 05060000
         SPACE 1                                                        05070000
*     CALL - EXTERNAL CALL EXTERNAL INTERRUPT TTE                       05080000
         ORG   TTEUNQ                                                   05090000
TTE303   DS    0F                      EXTERNAL CALL EXTERNAL           05100000
*                                      INTERRUPT (CALL).                05110000
TTE303TB DS    A                       CURRENT TCB ADDRESS OR 0.        05120000
*                                      * PSATOLD.                       05130000
TTE303R1 DS    H                       RESERVED.                        05140000
TTE303HA DS    H                       HOME ADDRESS SPACE.              05150000
*                                      * PSAAOLD->ASCBASID.             05160000
TTE303PA DS    H                       PASID.                           05170000
*                                      * INPUT REGISTER 4.              05180000
TTE303SA DS    H                       SASID.                           05190000
*                                      * INPUT REGISTER 4.              05200000
TTE303PW DS    0CL16                   EXTERNAL OLD PSW.                05210000
*                                      * FLCEOPSW.                 @LLC 05220000
TTE303P1 DS    CL4                     PSW 0-3                     @LLA 05230000
TTE303P2 DS    CL4                     PSW 4-7                     @LLA 05240000
TTE303P3 DS    CL4                     PSW 8-B                     @LLA 05250000
TTE303P4 DS    CL4                     PSW C-F                     @LLA 05260000
TTE303CD DS    A                       ISSUING PROCESSOR ADDRESS        05270000
*                                      AND EXTERNAL INTERRUPT CODE.     05280000
*                                      * PSAEEPSW.                      05290000
TTE303PB DS    F                       PCCARPB.                         05300000
*                                      * PSAPCCAV->PCCARPB.             05310000
TTE303LH DS    F                       PSACLHS.                         05320000
TTE303PL DS    A                       PSALOCAL.                        05330000
TTE303LE DS    F                       PSACLHSE.                   @L4A 05340000
TTE303ED DS    0F                      END OF CALL TTE.                 05350000
.ENDCALL ANOP                                                           05360000
.*                                                                      05370000
         AIF   ('&ALL' NE 'YES' AND                                    X05380000
               '&EX' NE 'YES' AND                                      X05390000
               '&EXT' NE 'YES').ENDCLKC                                 05400000
         SPACE 1                                                        05410000
*     CLKC - CLOCK COMPARATOR EXTERNAL INTERRUPT TTE                    05420000
         ORG   TTEUNQ                                                   05430000
TTE403   DS    0F                      CLOCK COMPARATOR EXTERNAL        05440000
*                                      INTERRUPT (CLKC).                05450000
TTE403TB DS    A                       CURRENT TCB ADDRESS OR 0.        05460000
*                                      * PSATOLD.                       05470000
TTE403R1 DS    H                       RESERVED.                        05480000
TTE403HA DS    H                       HOME ADDRESS SPACE.              05490000
*                                      * PSAAOLD->ASCBASID.             05500000
TTE403PA DS    H                       PASID.                           05510000
*                                      * INPUT REGISTER 4.              05520000
TTE403SA DS    H                       SASID.                           05530000
*                                      * INPUT REGISTER 4.              05540000
TTE403PW DS    0CL16                   EXTERNAL OLD PSW.                05550000
*                                      * FLCEOPSW.                 @LLC 05560000
TTE403P1 DS    CL4                     PSW 0-3                     @LLA 05570000
TTE403P2 DS    CL4                     PSW 4-7                     @LLA 05580000
TTE403P3 DS    CL4                     PSW 8-B                     @LLA 05590000
TTE403P4 DS    CL4                     PSW C-F                     @LLA 05600000
TTE403CD DS    F                       EXTERNAL INTERRUPT CODE.         05610000
*                                      * PSAEEPSW.                      05620000
TTE403TT DS    A                       TQE Address or 0.           @03C 05630000
*                                      * PSAPCCAV->PCCATQEP.       @03C 05640000
TTE403R2 DS    H                       RESERVED.                        05650000
TTE403TA DS    H                       TQE ASID OR 0.                   05660000
*                                      * PSAPCCAV->PCCA_TQEASID.   @03C 05670000
TTE403LH DS    F                       PSACLHS.                         05680000
TTE403PL DS    A                       PSALOCAL.                        05690000
TTE403LE DS    F                       PSACLHSE.                   @L4A 05700000
TTE403ED DS    0F                      END OF CLKC TTE.                 05710000
.ENDCLKC ANOP                                                           05720000
.*                                                                      05730000
         AIF   ('&ALL' NE 'YES' AND                                    X05740000
               '&EX' NE 'YES' AND                                      X05750000
               '&SCH' NE 'YES').ENDCSCH                                 05760000
         SPACE 1                                                        05770000
*     CSCH - CLEAR SUBCHANNEL TTE                                       05780000
         ORG   TTEUNQ                                                   05790000
TTE301   DS    0F                      CLEAR SUBCHANNEL (CSCH).         05800000
TTE301TB DS    A                       TCB ADDRESS FROM SRB.            05810000
*                                      * IOSBPTR(R2)->IOSSRB->SRBPTCB.  05820000
TTE301AD DS    H                       ASID FROM IOSB.                  05830000
*                                      * IOSBPTR(R2)->IOSASID.          05840000
TTE301HA DS    H                       HOME ADDRESS SPACE.              05850000
*                                      * PSAAOLD->ASCBASID.             05860000
TTE301CC DS    XL1                     CONDITION CODE.                  05870000
*                                      * INPUT REGISTER 0.              05880000
TTE301DI DS    XL1                     DRIVER ID.                       05890000
*                                      * IOSBPTR(R2)->IOSDVRID.         05900000
TTE301DN DS    H                       DEVICE NUMBER.                   05910000
*                                      * IOSBPTR(R2)->IOSUCB->UCBCHAN.  05920000
TTE301UB DS    A                       UCB ADDRESS (COMMON SEGMENT).    05930000
*                                      * ORBPTR(R3)->WORD 1.            05940000
TTE301IQ DS    A                       IOQ ADDRESS.                     05950000
*                                      * ORBPTR(R3)->WORD 2.            05960000
TTE301AI DS    A                       ADDRESS OF IOSB FOR ASSOCIATED   05970000
*                                      SSCH REQUEST (0 IF NO ASSOCIATED 05980000
*                                      REQUEST).                        05990000
*                                      * ORBPTR(R3)->WORD 3.            06000000
TTE301IO DS    A                       IOSB ADDRESS.                    06010000
*                                      * INPUT REGISTER 2.              06020000
TTE301TK DS    0F                      TOKEN.                      @L8C 06030000
*                                      * INPUT REGISTER 1.              06040000
TTE301T1 DS    XL1                     KEY. NOT FORMATTED.         @L8A 06050000
TTE301T2 DS    XL1                     RESERVED.                   @L8A 06060000
TTE301T3 DS    H                       BASE DEVICE NUMBER.         @L8A 06070000
TTE301SSIDA DS XL1                     SUBCHANNEL SET ID           @LFA 06080000
         DS    XL3                     RESERVED                    @LFA 06090000
TTE301ED DS    0F                      END OF CSCH TTE.                 06100000
.ENDCSCH ANOP                                                           06110000
.*                                                                      06120000
         AIF   ('&ALL' NE 'YES' AND                                    X06130000
               '&EX' NE 'YES' AND                                      X06140000
               '&DSP' NE 'YES').ENDDSP                                  06150000
         SPACE 1                                                        06160000
*     DSP - TASK DISPATCH TTE                                           06170000
         ORG   TTEUNQ                                                   06180000
TTE00F   DS    0F                      TASK DISPATCH (DSP).             06190000
TTE00FTB DS    A                       CURRENT TCB ADDRESS.             06200000
*                                      * PSATOLD.                       06210000
TTE00FR1 DS    H                       RESERVED.                        06220000
TTE00FHA DS    H                       HOME ADDRESS SPACE.              06230000
*                                      * PSAAOLD->ASCBASID.             06240000
TTE00FPA DS    H                       PASID.                           06250000
*                                      * INPUT REGISTER 13.             06260000
TTE00FSA DS    H                       SASID.                           06270000
*                                      * INPUT REGISTER 13.             06280000
TTE00FPW DS    0CL16                   PSW TO BE DISPATCHED.            06290000
*                                      * PSAPSWSV16.               @LLC 06300000
TTE00FP1 DS    CL4                     PSW 0-3                     @LLC 06310000
TTE00FP2 DS    CL4                     PSW 4-7                     @LLC 06320000
TTE00FP3 DS    CL4                     PSW 8-B                     @LLA 06330000
TTE00FP4 DS    CL4                     PSW C-F                     @LLA 06340000
TTE00FG0 DS    F                       REGISTER 0 CONTENTS.             06350000
*                                      * INPUT REGISTER 0.              06360000
TTE00FG1 DS    F                       REGISTER 1 CONTENTS.             06370000
*                                      * INPUT REGISTER 1.              06380000
TTE00FMW DS    F                       PSAMODEW.                        06390000
TTE00FLH DS    F                       PSACLHS.                         06400000
TTE00FPL DS    A                       PSALOCAL.                        06410000
TTE00FED DS    0F                      END OF DSP TTE.                  06420000
.ENDDSP  ANOP                                                           06430000
.*                                                                      06440000
         AIF   ('&ALL' NE 'YES' AND                                    X06450000
               '&EX' NE 'YES' AND                                      X06460000
               '&EXT' NE 'YES').ENDEMS                                  06470000
         SPACE 1                                                        06480000
*     EMS - EMERGENCY SIGNAL EXTERNAL INTERRUPT TTE                     06490000
         ORG   TTEUNQ                                                   06500000
TTE103   DS    0F                      EMS EXTERNAL INTERRUPT (EMS).    06510000
TTE103TB DS    A                       CURRENT TCB ADDRESS OR 0.        06520000
*                                      * PSATOLD.                       06530000
TTE103R1 DS    H                       RESERVED.                        06540000
TTE103HA DS    H                       HOME ADDRESS SPACE.              06550000
*                                      * PSAAOLD->ASCBASID.             06560000
TTE103PA DS    H                       PASID.                           06570000
*                                      * INPUT REGISTER 4.              06580000
TTE103SA DS    H                       SASID.                           06590000
*                                      * INPUT REGISTER 4.              06600000
TTE103PW DS    0CL16                   EXTERNAL OLD PSW.           @LLC 06610000
*                                      * FLCEOPSW.                      06620000
TTE103P1 DS    CL4                     PSW 0-3                     @LLA 06630000
TTE103P2 DS    CL4                     PSW 4-7                     @LLA 06640000
TTE103P3 DS    CL4                     PSW 8-B                     @LLA 06650000
TTE103P4 DS    CL4                     PSW C-F                     @LLA 06660000
TTE103CD DS    A                       ISSUING PROCESSOR ADDRESS AND    06670000
*                                      EXTERNAL INTERRUPT CODE.         06680000
*                                      * PSAEEPSW.                      06690000
TTE103SI DS    F                       PCCAEMSI.                        06700000
*                                      * FLCCVT->CVTPCCAT->             06710000
*                                      *   PCCAT00P(PSASPAD)->          06720000
*                                      *   PCCAEMSI.                    06730000
TTE103SP DS    A                       PCCAEMSP.                        06740000
*                                      * FLCCVT->CVTPCCAT->             06750000
*                                      *   PCCAT00P(PSASPAD)->          06760000
*                                      *   PCCAEMSP.                    06770000
TTE103SE DS    A                       PCCAEMSE.                        06780000
*                                      * FLCCVT->CVTPCCAT->             06790000
*                                      *   PCCAT00P(PSASPAD)->          06800000
*                                      *   PCCAEMSE.                    06810000
TTE103LH DS    F                       PSACLHS.                         06820000
TTE103PL DS    A                       PSALOCAL.                        06830000
TTE103LE DS    F                       PSACLHSE.                   @L4A 06840000
TTE103ED DS    0F                      END OF EMS TTE.                  06850000
.ENDEMS  ANOP                                                           06860000
.*                                                                      06870000
         AIF   ('&ALL' NE 'YES' AND                                    X06880000
               '&EX' NE 'YES' AND                                      X06890000
               '&EXT' NE 'YES').ENDEXT                                  06900000
         SPACE 1                                                        06910000
*     EXT - GENERAL EXTERNAL INTERRUPT TTE                              06920000
         ORG   TTEUNQ                                                   06930000
TTE003   DS    0F                      EXTERNAL INTERRUPT (EXT).        06940000
TTE003TB DS    A                       CURRENT TCB ADDRESS OR 0.        06950000
*                                      * PSATOLD.                       06960000
TTE003R1 DS    H                       RESERVED.                        06970000
TTE003HA DS    H                       HOME ADDRESS SPACE.              06980000
*                                      * PSAAOLD->ASCBASID.             06990000
TTE003PA DS    H                       PASID.                           07000000
*                                      * INPUT REGISTER 4.              07010000
TTE003SA DS    H                       SASID.                           07020000
*                                      * INPUT REGISTER 4.              07030000
TTE003PW DS    0CL16                   EXTERNAL OLD PSW.                07040000
*                                      * FLCEOPSW.                 @LLC 07050000
TTE003P1 DS    CL4                     PSW 0-3                     @LLA 07060000
TTE003P2 DS    CL4                     PSW 4-7                     @LLA 07070000
TTE003P3 DS    CL4                     PSW 8-B                     @LLA 07080000
TTE003P4 DS    CL4                     PSW C-F                     @LLA 07090000
TTE003CD DS    F                       EXTERNAL INTERRUPT CODE.         07100000
*                                      * PSAEEPSW.                      07110000
TTE003LH DS    F                       PSACLHS.                         07120000
TTE003PL DS    A                       PSALOCAL.                        07130000
TTE003LE DS    F                       PSACLHSE.                   @L4A 07140000
TTE003ED DS    0F                      END OF EXT TTE.                  07150000
.ENDEXT  ANOP                                                           07160000
.*                                                                      07170000
         AIF   ('&ALL' NE 'YES' AND                                    X07180000
               '&EX' NE 'YES' AND                                      X07190000
               '&SCH' NE 'YES').ENDHSCH                                 07200000
         SPACE 1                                                        07210000
*     HSCH - HALT SUBCHANNEL TTE                                        07220000
         ORG   TTEUNQ                                                   07230000
TTE201   DS    0F                      HALT SUBCHANNEL (HSCH).          07240000
TTE201TB DS    A                       TCB ADDRESS FROM SRB.            07250000
*                                      * IOSBPTR(R2)->IOSSRB->SRBPTCB.  07260000
TTE201AD DS    H                       ASID FROM IOSB.                  07270000
*                                      * IOSBPTR(R2)->IOSASID.          07280000
TTE201HA DS    H                       HOME ADDRESS SPACE.              07290000
*                                      * PSAAOLD->ASCBASID.             07300000
TTE201CC DS    XL1                     CONDITION CODE.                  07310000
*                                      * INPUT REGISTER 0.              07320000
TTE201DI DS    XL1                     DRIVER ID.                       07330000
*                                      * IOSBPTR(R2)->IOSDVRID.         07340000
TTE201DN DS    H                       DEVICE NUMBER.                   07350000
*                                      * IOSBPTR(R2)->IOSUCB->UCBCHAN.  07360000
TTE201UB DS    A                       UCB ADDRESS (COMMON SEGMENT).    07370000
*                                      * ORBPTR(R3)->WORD 1.            07380000
TTE201IQ DS    A                       IOQ ADDRESS.                     07390000
*                                      * ORBPTR(R3)->WORD 2.            07400000
TTE201AI DS    A                       ADDRESS OF IOSB FOR ASSOCIATED   07410000
*                                      SSCH REQUEST (0 IF NO ASSOCIATED 07420000
*                                      REQUEST).                        07430000
*                                      * ORBPTR(R3)->WORD 3.            07440000
TTE201IO DS    A                       IOSB ADDRESS.                    07450000
*                                      * INPUT REGISTER 2.              07460000
TTE201TK DS    0F                      TOKEN.                      @L8C 07470000
*                                      * INPUT REGISTER 1.              07480000
TTE201T1 DS    XL1                     KEY. NOT FORMATTED.         @L8A 07490000
TTE201T2 DS    XL1                     RESERVED.                   @L8A 07500000
TTE201T3 DS    H                       BASE DEVICE NUMBER.         @L8A 07510000
TTE201SSIDA DS XL1                     SUBCHANNEL SET ID           @LFA 07520000
         DS    XL3                     RESERVED                    @LFA 07530000
TTE201ED DS    0F                      END OF HSCH TTE.                 07540000
.ENDHSCH ANOP                                                           07550000
.*                                                                      07560000
         AIF   ('&ALL' NE 'YES' AND                                    X07570000
               '&EX' NE 'YES' AND                                      X07580000
               '&IO' NE 'YES').ENDIO                                    07590000
         SPACE 2                                                        07600000
*     IO - I/O INTERRUPT TTE                                            07610000
         ORG   TTEUNQ                                                   07620000
TTE00B   DS    0F                      I/O INTERRUPT (IO).              07630000
TTE00BTB DS    A                       CURRENT TCB ADDRESS OR 0.        07640000
*                                      * PSATOLD.                       07650000
TTE00BDN DS    H                       DEVICE NUMBER.                   07660000
*                                      * UCBPTR(R7)->UCBCHAN.           07670000
TTE00BHA DS    H                       HOME ADDRESS SPACE.              07680000
*                                      * PSAAOLD->ASCBASID.             07690000
TTE00BPA DS    H                       PASID.                           07700000
*                                      * CONTROL REGISTER 4.            07710000
TTE00BSA DS    H                       SASID.                           07720000
*                                      * CONTROL REGISTER 3.            07730000
TTE00BPW DS    0CL16                   I/O OLD PSW.                     07740000
*                                      * FLCIOPSW.                 @LLC 07750000
TTE00BP1 DS    CL4                     PSW 0-3                     @LLA 07760000
TTE00BP2 DS    CL4                     PSW 4-7                     @LLA 07770000
TTE00BP3 DS    CL4                     PSW 8-B                     @LLA 07780000
TTE00BP4 DS    CL4                     PSW C-F                     @LLA 07790000
TTE00BFG DS    H                       IRBFLAGS.                        07800000
*                                      * IRBPTR(R3)->WORD 1.            07810000
TTE00BSC DS    H                       SUBCHANNEL CONTROL.              07820000
*                                      * IRBPTR(R3)->WORD 1.            07830000
TTE00BCA DS    A                       CCW ADDRESS.                     07840000
*                                      * IRBPTR(R3)->WORD 2.            07850000
TTE00BDS DS    XL1                     DEVICE STATUS.                   07860000
*                                      * IRBPTR(R3)->WORD 3.            07870000
TTE00BSS DS    XL1                     SUBCHANNEL STATUS.               07880000
*                                      * IRBPTR(R3)->WORD 3.            07890000
TTE00BCT DS    H                       RESIDUAL COUNT.                  07900000
*                                      * IRBPTR(R3)->WORD 3.            07910000
TTE00BEW DS    F                       EXTENDED STATUS WORD.            07920000
*                                      * IRBPTR(R3)->WORD 4.            07930000
TTE00BUB DS    A                       UCB ADDRESS.                     07940000
*                                      * INPUT REGISTER 7.              07950000
TTE00BLH DS    F                       PSACLHS.                         07960000
TTE00BPL DS    A                       PSALOCAL.                        07970000
TTE00BLE DS    F                       PSACLHSE.                   @L4A 07980000
TTE00BTK DS    0F                      TOKEN.                      @L8C 07990000
*                                      * INPUT REGISTER 1.              08000000
TTE00BT1 DS    XL1                     KEY. NOT FORMATTED.         @L8A 08010000
TTE00BSSIDA DS XL1                     SUBCHANNEL SET ID           @LFA 08020000
TTE00BT3 DS    H                       BASE DEVICE NUMBER.         @L8A 08030000
TTE00BED DS    0F                      END OF IO TTE.                   08040000
.ENDIO   ANOP                                                           08050000
.*                                                                      08060000
         AIF   ('&ALL' NE 'YES' AND                                    X08070000
               '&EX' NE 'YES' AND                                      X08080000
               '&MCH' NE 'YES').ENDMCH                                  08090000
         SPACE 2                                                        08100000
*     MCH - MACHINE CHECK INTERRUPT TTE                                 08110000
         ORG   TTEUNQ                                                   08120000
TTE013   DS    0F                      MACHINE CHECK INTERRUPT (MCH).   08130000
TTE013TB DS    A                       CURRENT TCB ADDRESS OR 0.        08140000
*                                      * PSATOLD.                       08150000
TTE013R1 DS    H                       RESERVED.                        08160000
TTE013HA DS    H                       HOME ADDRESS SPACE.              08170000
*                                      * PSAAOLD->ASCBASID.             08180000
TTE013PA DS    H                       PASID.                           08190000
*                                      * CONTROL REGISTER 4.            08200000
TTE013SA DS    H                       SASID.                           08210000
*                                      * CONTROL REGISTER 3.            08220000
TTE013PW DS    0CL16                   MACHINE CHECK OLD PSW.           08230000
*                                      * FLCMOPSW.                 @LLC 08240000
TTE013P1 DS    CL4                     PSW 0-3                     @LLA 08250000
TTE013P2 DS    CL4                     PSW 4-7                     @LLA 08260000
TTE013P3 DS    CL4                     PSW 8-B                     @LLA 08270000
TTE013P4 DS    CL4                     PSW C-F                     @LLA 08280000
TTE013MC DS    0CL8                    MACHINE CHECK INTERRUPT CODE.    08290000
*                                      * FLCMCIC.                       08300000
TTE013M1 DS    CL4                     PART 1 OF FLCMCIC.               08310000
TTE013M2 DS    CL4                     PART 2 OF FLCMCIC.               08320000
TTE013PS DS    F                       PSASUPER.                        08330000
TTE013LH DS    F                       PSACLHS.                         08340000
TTE013PL DS    A                       PSALOCAL.                        08350000
TTE013LE DS    F                       PSACLHSE.                   @L4A 08360000
TTE013ED DS    0F                      END OF MCH TTE.                  08370000
.ENDMCH  ANOP                                                           08380000
.*                                                                      08390000
         AIF   ('&ALL' NE 'YES' AND                                    X08400000
               '&EX' NE 'YES' AND                                      X08410000
               '&SCH' NE 'YES').ENDMSCH                                 08420000
         SPACE 1                                                        08430000
*     MSCH - MODIFY SUBCHANNEL TTE                                      08440000
         ORG   TTEUNQ                                                   08450000
TTE101   DS    0F                      MODIFY SUBCHANNEL (MSCH).        08460000
TTE101TB DS    A                       TCB ADDRESS FROM SRB.            08470000
*                                      * IOSBPTR(R2)->IOSSRB->SRBPTCB.  08480000
TTE101AD DS    H                       ASID FROM IOSB.                  08490000
*                                      * IOSBPTR(R2)->IOSASID.          08500000
TTE101HA DS    H                       HOME ADDRESS SPACE.              08510000
*                                      * PSAAOLD->ASCBASID.             08520000
TTE101CC DS    XL1                     CONDITION CODE.                  08530000
*                                      * INPUT REGISTER 0.              08540000
TTE101R1 DS    XL1                     RESERVED.                        08550000
TTE101DN DS    H                       DEVICE NUMBER.                   08560000
*                                      * IOSBPTR(R2)->IOSUCB->UCBCHAN.  08570000
TTE101UB DS    A                       UCB ADDRESS (COMMON SEGMENT).    08580000
*                                      * ORBPTR(R3)->WORD 1.            08590000
TTE101O2 DS    0F                      ORB WORD 2.                      08600000
*                                      * ORBPTR(R3)->WORD 2.            08610000
TTE101F1 DS    XL1                     SCHFLG1 FROM SCHIB               08620000
*                                      USED FOR MSCH INSTRUCTION.       08630000
TTE101F2 DS    XL1                     SCHFLG2 FROM SCHIB               08640000
*                                      USED FOR MSCH INSTRUCTION.       08650000
TTE101LM DS    XL1                     SCHLPM FROM SCHIB                08660000
*                                      USED FOR MSCH INSTRUCTION.       08670000
TTE101PM DS    XL1                     SCHPOM FROM SCHIB                08680000
*                                      USED FOR MSCH INSTRUCTION.       08690000
TTE101O3 DS    0F                      ORB WORD 3.                      08700000
*                                      * ORBPTR(R3)->WORD 3.            08710000
TTE101MI DS    H                       SCHMBI FROM SCHIB                08720000
*                                      USED FOR MSCH INSTRUCTION.       08730000
TTE101P2 DS    XL1                     IOSOPT2 FROM MSCH IOSB.          08740000
TTE101FB DS    XL1                     IOSFLB FROM MSCH IOSB.           08750000
TTE101IO DS    A                       IOSB ADDRESS.                    08760000
*                                      * INPUT REGISTER 2.              08770000
TTE101TK DS    0F                      TOKEN.                      @L8C 08780000
*                                      * INPUT REGISTER 1.              08790000
TTE101T1 DS    XL1                     KEY. NOT FORMATTED.         @L8A 08800000
TTE101T2 DS    XL1                     RESERVED.                   @L8A 08810000
TTE101T3 DS    H                       BASE DEVICE NUMBER.         @L8A 08820000
TTE101SSIDA DS XL1                     SUBCHANNEL SET ID           @LFA 08830000
         DS    XL3                     RESERVED                    @LFA 08840000
TTE101ED DS    0F                      END OF MSCH TTE.                 08850000
.ENDMSCH ANOP                                                           08860000
.*                                                                      08870000
         AIF   ('&ALL' NE 'YES' AND                                    X08880000
               '&EX' NE 'YES' AND                                      X08890000
               '&PGM' NE 'YES').ENDPGM                                  08900000
         SPACE 2                                                        08910000
*     PGM - PROGRAM INTERRUPT TTE                                       08920000
         ORG   TTEUNQ                                                   08930000
TTE007   DS    0F                      PROGRAM INTERRUPT (PGM).         08940000
TTE007TB DS    A                       CURRENT TCB ADDRESS OR 0.        08950000
*                                      * PSATOLD.                       08960000
TTE007R1 DS    H                       RESERVED.                        08970000
TTE007HA DS    H                       HOME ADDRESS SPACE.              08980000
*                                      * PSAAOLD->ASCBASID.             08990000
TTE007PA DS    H                       PASID.                           09000000
*                                      * CONTROL REGISTER 4.            09010000
TTE007SA DS    H                       SASID.                           09020000
*                                      * CONTROL REGISTER 3.            09030000
TTE007LH DS    F                       PSACLHS.                    @LBM 09040000
TTE007PL DS    A                       PSALOCAL.                   @LBM 09050000
TTE007LE DS    F                       PSACLHSE.                   @LBM 09060000
TTE007PW DS    0CL16                   PROGRAM INTERRUPT PSW.           09070000
*                                      * PROGRAM INTERRUPT STATUS       09080000
*                                      *   ADDRESS(R2)->WORDS 1         09090000
*                                      *   AND 2.                  @LLC 09100000
TTE007P1 DS    CL4                     PSW 0-3                     @LLA 09110000
TTE007P2 DS    CL4                     PSW 4-7                     @LLA 09120000
TTE007P3 DS    CL4                     PSW 8-B                     @LLA 09130000
TTE007P4 DS    CL4                     PSW C-F                     @LLA 09140000
TTE007IL DS    H                       PROGRAM INSTRUCTION LENGTH.      09150000
*                                      * PROGRAM INTERRUPT STATUS       09160000
*                                      *   ADDRESS(R2)->WORD 3.         09170000
TTE007CD DS    H                       PROGRAM INTERRUPT CODE.          09180000
*                                      * PROGRAM INTERRUPT STATUS       09190000
*                                      *   ADDRESS(R2)->WORD 3.         09200000
TTE007ZT DS    0ADL8                   TEA - Z/Architecture        @LBA 09210000
TTE007TA DS    A                       TEA CONTENTS. HIGH ORDER BIT     09220000
*                                      INDICATES PRIMARY (0) OR         09230000
*                                      SECONDARY (1).                   09240000
*                                      * PROGRAM INTERRUPT STATUS       09250000
*                                      *   ADDRESS(R2)->WORD 4.         09260000
TTE007ED DS    0F                      END OF PGM TTE - ESA             09270000
TTE007ZL DS    A                       TEA bits 32-63 - z/Arch     @LBA 09280000
TTE007ZD DS    0F                      END OF PGM TTE - z/Arch     @LBA 09290000
.ENDPGM  ANOP                                                           09300000
.*                                                                      09310000
         AIF   ('&ALL' NE 'YES' AND                                    X09320000
               '&EX' NE 'YES' AND                                      X09330000
               '&SCH' NE 'YES').ENDRSCH                                 09340000
         SPACE 1                                                        09350000
*     RSCH - RESUME SUBCHANNEL TTE                                      09360000
         ORG   TTEUNQ                                                   09370000
TTE401   DS    0F                      RESUME SUBCHANNEL (RSCH).        09380000
TTE401TB DS    A                       TCB ADDRESS FROM SRB.            09390000
*                                      * IOSBPTR(R2)->IOSSRB->SRBPTCB.  09400000
TTE401AD DS    H                       ASID FROM IOSB.                  09410000
*                                      * IOSBPTR(R2)->IOSASID.          09420000
TTE401HA DS    H                       HOME ADDRESS SPACE.              09430000
*                                      * PSAAOLD->ASCBASID.             09440000
TTE401CC DS    XL1                     CONDITION CODE.                  09450000
*                                      * INPUT REGISTER 0.              09460000
TTE401DI DS    XL1                     DRIVER ID.                       09470000
*                                      * IOSBPTR(R2)->IOSDVRID.         09480000
TTE401DN DS    H                       DEVICE NUMBER.                   09490000
*                                      * IOSBPTR(R2)->IOSUCB->UCBCHAN.  09500000
TTE401UB DS    A                       UCB ADDRESS FROM IOSB.           09510000
*                                      * IOSBPTR(R2)->IOSUCB.           09520000
TTE401IO DS    A                       IOSB ADDRESS.                    09530000
*                                      * INPUT REGISTER 2.              09540000
TTE401TK DS    0F                      TOKEN.                      @L8C 09550000
*                                      * INPUT REGISTER 1.              09560000
TTE401T1 DS    XL1                     KEY. NOT FORMATTED.         @L8A 09570000
TTE401T2 DS    XL1                     RESERVED.                   @L8A 09580000
TTE401T3 DS    H                       BASE DEVICE NUMBER.         @L8A 09590000
TTE401SSIDA DS XL1                     SUBCHANNEL SET ID           @LFA 09600000
         DS    XL3                     RESERVED                    @LFA 09610000
TTE401ED DS    0F                      END OF RSCH TTE.                 09620000
.ENDRSCH ANOP                                                           09630000
.*                                                                      09640000
         AIF   ('&ALL' NE 'YES' AND                                    X09650000
               '&EX' NE 'YES' AND                                      X09660000
               '&RST' NE 'YES').ENDRST                                  09670000
         SPACE 2                                                        09680000
*     RST - RESTART INTERRUPT TTE                                       09690000
         ORG   TTEUNQ                                                   09700000
TTE015   DS    0F                      RESTART INTERRUPT (RST).         09710000
TTE015TB DS    A                       CURRENT TCB ADDRESS OR 0.        09720000
*                                      * PSATOLD.                       09730000
TTE015R1 DS    H                       RESERVED.                        09740000
TTE015HA DS    H                       HOME ADDRESS SPACE.              09750000
*                                      * PSAAOLD->ASCBASID.             09760000
TTE015PA DS    H                       PASID.                           09770000
*                                      * CONTROL REGISTER 4.            09780000
TTE015SA DS    H                       SASID.                           09790000
*                                      * CONTROL REGISTER 3.            09800000
TTE015PW DS    0CL16                   RESTART OLD PSW.                 09810000
*                                      * FLCROPSW.                 @LLC 09820000
TTE015P1 DS    CL4                     PSW 0-3                     @LLA 09830000
TTE015P2 DS    CL4                     PSW 4-7                     @LLA 09840000
TTE015P3 DS    CL4                     PSW 8-B                     @LLA 09850000
TTE015P4 DS    CL4                     PSW C-F                     @LLA 09860000
TTE015GF DS    F                       REGISTER 15 CONTENT.             09870000
*                                      * INPUT REGISTER 15.             09880000
TTE015G0 DS    F                       REGISTER 0 CONTENT.              09890000
*                                      * INPUT REGISTER 0.              09900000
TTE015G1 DS    F                       REGISTER 1 CONTENT.              09910000
*                                      * INPUT REGISTER 1.              09920000
TTE015PS DS    F                       PSASUPER.                        09930000
TTE015MW DS    F                       PSAMODEW.                        09940000
TTE015LH DS    F                       PSACLHS.                         09950000
TTE015PL DS    A                       PSALOCAL.                        09960000
TTE015LE DS    F                       PSACLHSE.                   @L4A 09970000
TTE015ED DS    0F                      END OF RST TTE.                  09980000
.ENDRST  ANOP                                                           09990000
.*                                                                      10000000
         AIF   ('&ALL' NE 'YES' AND                                    X10010000
               '&EX' NE 'YES' AND                                      X10020000
               '&SPER' NE 'YES').ENDSPER                                10030000
         SPACE 2                                                        10040000
*     SPER - SLIP/PER EVENT TTE                                    @L1A 10050000
         ORG   TTEUNQ                                              @L1A 10060000
TTE009   DS    0F                      SLIP/PER (SPER).            @L1A 10070000
TTE009TB DS    A                       CURRENT TCB ADDRESS OR 0.   @L1A 10080000
*                                      * PSATOLD.                  @L1A 10090000
TTE009PC DS    XL2                     PER CODE.                   @L9C 10100000
*                                      * SLIP/PER STATUS ADDRESS   @L1A 10110000
*                                      * (R3)-> BYTE 1.            @L1A 10120000
TTE009HA DS    H                       HOME ADDRESS SPACE.         @L1A 10130000
*                                      * PSAAOLD->ASCBASID.        @L1A 10140000
TTE009PA DS    H                       PASID.                      @L1A 10150000
*                                      * CONTROL REGISTER 4.       @L1A 10160000
TTE009SA DS    H                       SASID.                      @L1A 10170000
*                                      * CONTROL REGISTER 3.       @L1A 10180000
TTE009PW DS    0CL16                   16-Byte Program Interrupt PSW   *10190000
                                                                   @LMC 10200000
TTE009P1 DS    CL4                     PSW 0-3                     @LMC 10210000
TTE009P2 DS    CL4                     PSW 4-7                     @LMC 10220000
TTE009P3 DS    CL4                     PSW 8-B                     @LMA 10230000
TTE009P4 DS    CL4                     PSW C-F                     @LMA 10240000
TTE009V1 DS    0F                      Stdata Variable Word 1      @LHA 10250000
TTE009IL DS    H                       PROGRAM INSTRUCTION LENGTH. @L1A 10260000
*                                      * PROGRAM INTERRUPT STATUS  @L1A 10270000
*                                      *   ADDRESS(R2)->WORD 3.    @L1A 10280000
TTE009CD DS    H                       PROGRAM INTERRUPT CODE.     @L1A 10290000
*                                      * PROGRAM INTERRUPT STATUS  @L1A 10300000
*                                      *   ADDRESS(R2)->WORD 3.    @L1A 10310000
TTE009V2 DS    0F                      Stdata Variable Word 2      @LHA 10320000
TTE009ID DS    CL4                     SLIP/PER TRAP ID.           @L1A 10330000
*                                      * SLIP/PER TRAP ID ADDRESS  @L1A 10340000
*                                      * (R1)->WORD 1.             @L1A 10350000
TTE009V3 DS    0F                      Stdata Variable Word 3      @LHA 10360000
TTE009IA DS    A                       PER ADDRESS.                @L1A 10370000
*                                      * SLIP/PER STATUS ADDRESS   @L1A 10380000
*                                      * (R3)-> BYTES 3 THROUGH 6. @L1A 10390000
TTE009V4 DS    0F                      Stdata Variable Word 4      @LHA 10400000
TTE009IB DS    A                       PER ADDRESS.                @L1A 10410000
*                                      * SLIP/PER STATUS ADDRESS   @L1A 10420000
*                                      * (R3)-> BYTES 7 THROUGH 10.@L1A 10430000
TTE009LH DS    F                       PSACLHS.                    @L1A 10440000
TTE009LE DS    F                       PSACLHSE.                   @L4C 10450000
TTE009PL DS    A                       PSALOCAL.                   @L1A 10460000
TTE009V5 DS    F                       Stdata Variable Word 5      @LHA 10470000
TTE009ED DS    0F                      END OF SLIP/PER TTE.        @L1A 10480000
.ENDSPER ANOP                                                      @L1A 10490000
.*                                                                      10500000
         AIF   ('&ALL' NE 'YES' AND                                    X10510000
               '&EX' NE 'YES' AND                                      X10520000
               '&DSP' NE 'YES').ENDSRB                                  10530000
         SPACE 1                                                        10540000
*     SRB - SRB DISPATCH TTE                                            10550000
         ORG   TTEUNQ                                                   10560000
TTE10F   DS    0F                      SRB DISPATCH (SRB).              10570000
TTE10FTB DS    A                       WORK UNIT ADDRESS.         @D1C  10580000
*                                      * SRBPTR(R0)->SRBWEB.            10590000
TTE10FSF DS    XL1                     SRB FLAG BYTE.                   10600000
*                                      * SRBPTR(R0)->SRBFLGS.           10610000
TTE10FLH DS    XL1                     SRBHLHI.                         10620000
*                                      * SRBPTR(R0)->SRBHLHI.           10630000
TTE10FHA DS    H                       HOME ADDRESS SPACE.              10640000
*                                      * PSAAOLD->ASCBASID.             10650000
TTE10FPW DS    0CL8                    PSW TO RECEIVE CONTROL ON SRB    10660000
*                                      DISPATCH.                        10670000
*                                      * PSASMPSW                       10680000
TTE10FP1 DS    CL4                     1ST HALF OF PSW                  10690000
TTE10FP2 DS    CL4                     2ND HALF OF PSW                  10700000
TTE10FFN DS    H                       CPU AFFINITY.                    10710000
*                                      * SRBPTR(R0)->SRBCPAFF.          10720000
TTE10FAP DS    H                       RELATED ASID.                    10730000
*                                      * SRBPTR(R0)->SRBPASID.          10740000
TTE10FG0 DS    F                       REGISTER 0 CONTENTS.             10750000
*                                      * INPUT REGISTER 0.              10760000
TTE10FG1 DS    F                       REGISTER 1 CONTENTS.             10770000
*                                      * INPUT REGISTER 1.              10780000
TTE10FPT DS    A                       PURGE TCB ADDRESS.          @D1A 10790000
*                                      * SRBPTR(R0)->SRBPTCB.           10800000
TTE10FED DS    0F                      END OF SRB TTE.                  10810000
.ENDSRB  ANOP                                                           10820000
         AIF   ('&ALL' NE 'YES' AND                                    X10830000
               '&EX' NE 'YES' AND                                      X10840000
               '&EXT' NE 'YES').ENDSS                                   10850000
         SPACE 1                                                        10860000
*     SS - SERVICE SIGNAL EXTERNAL INTERRUPT TTE                        10870000
         ORG   TTEUNQ                                                   10880000
TTE203   DS    0F                      SS EXTERNAL INTERRUPT (SS).      10890000
TTE203TB DS    A                       CURRENT TCB ADDRESS OR 0.        10900000
*                                      * PSATOLD.                       10910000
TTE203R1 DS    H                       RESERVED.                        10920000
TTE203HA DS    H                       HOME ADDRESS SPACE.              10930000
*                                      * PSAAOLD->ASCBASID.             10940000
TTE203PA DS    H                       PASID.                           10950000
*                                      * INPUT REGISTER 4.              10960000
TTE203SA DS    H                       SASID.                           10970000
*                                      * INPUT REGISTER 4.              10980000
TTE203PW DS    0CL16                   EXTERNAL OLD PSW.                10990000
*                                      * FLCEOPSW.                 @LLC 11000000
TTE203P1 DS    CL4                     PSW 0-3                     @LLA 11010000
TTE203P2 DS    CL4                     PSW 4-7                     @LLA 11020000
TTE203P3 DS    CL4                     PSW 8-B                     @LLA 11030000
TTE203P4 DS    CL4                     PSW C-F                     @LLA 11040000
TTE203CD DS    F                       EXTERNAL INTERRUPT CODE.         11050000
*                                      * PSAEEPSW.                      11060000
TTE203BA DS    A                       SCCB ADDRESS ASSOCIATED     @L6C 11070000
*                                      WITH THE SERVICE SIGNAL.         11080000
TTE203CM DS    F                       SCLP COMMAND WORD           @L6C 11090000
*                                      ASSOCIATED WITH THE SERVICE      11100000
*                                      SIGNAL INTERRUPT.                11110000
TTE203R3 DS    H                       RESERVED.                   @L6C 11120000
*                                      HARDWARE FLAGS NO LONGER         11130000
*                                      PART OF THE SS TRACE ENTRY       11140000
TTE203RC DS    H                       SERVICE PROCESSOR RESPONSE  @L6C 11150000
*                                      AND REASON CODE.                 11160000
TTE203R2 DS    H                       RESERVED.                        11170000
TTE203AD DS    H                       SS ASID.                    @L6C 11180000
TTE203AT DS    A                       SS TCB ADDRESS.             @L6C 11190000
TTE203LH DS    F                       PSACLHS.                         11200000
TTE203PL DS    A                       PSALOCAL.                        11210000
TTE203LE DS    F                       PSACLHSE.                   @L4A 11220000
TTE203ED DS    0F                      END OF SS TTE.                   11230000
.ENDSS   ANOP                                                           11240000
.*                                                                      11250000
         AIF   ('&ALL' NE 'YES' AND                                    X11260000
               '&EX' NE 'YES' AND                                      X11270000
               '&SIGA' NE 'YES').ENDSIGA                           @01A 11280000
         SPACE 1                                                   @01P 11290000
*     SIGA - Signal adapter TTE                                         11300000
         ORG   TTEUNQ                                              @01P 11310000
TTE501   DS    0F                      Signal adapter (SIGA).      @01A 11320000
TTE501TB DS    A                       TCB address.                @01A 11330000
         DS    H                       Reserved                    @01A 11340000
TTE501HA DS    H                       Home ASID.                  @01A 11350000
TTE501CC DS    XL1                     Condition code              @01A 11360000
TTE501FC DS    XL1                     SIGA function code          @01A 11370000
TTE501DN DS    H                       Device number.              @01A 11380000
TTE501SI DS    F                       SID.                        @01A 11390000
TTE501M1 DS    A                       Bit mask (SYNCH).           @01A 11400000
TTE501M2 DS    A                       Bit mask (SYNCH).           @01A 11410000
TTE501QI DS    F                       QIB pointer.                @01A 11420000
TTE501UB DS    A                       UCB address.                @01A 11430000
TTE501ED DS    0F                      End of SIGA TTE.            @01A 11440000
.ENDSIGA ANOP  ,                                                   @01A 11450000
.*                                                                      11460000
         AIF   ('&ALL' NE 'YES' AND                                    X11470000
               '&EX' NE 'YES' AND                                      X11480000
               '&SCH' NE 'YES').ENDSSCH                                 11490000
         SPACE 1                                                        11500000
*     SSCH - START SUBCHANNEL TTE                                       11510000
         ORG   TTEUNQ                                                   11520000
TTE001   DS    0F                      START SUBCHANNEL (SSCH).         11530000
TTE001TB DS    A                       TCB ADDRESS FROM SRB.            11540000
*                                      * IOSBPTR(R2)->IOSSRB->SRBPTCB.  11550000
TTE001AD DS    H                       ASID FROM IOSB.                  11560000
*                                      * IOSBPTR(R2)->IOSASID.          11570000
TTE001HA DS    H                       HOME ADDRESS SPACE.              11580000
*                                      * PSAAOLD->ASCBASID.             11590000
TTE001CC DS    XL1                     CONDITION CODE.                  11600000
*                                      * INPUT REGISTER 0.              11610000
TTE001DI DS    XL1                     DRIVER ID.                       11620000
*                                      * IOSBPTR(R2)->IOSDVRID.         11630000
TTE001DN DS    H                       DEVICE NUMBER.                   11640000
*                                      * TTE001UB->UCBCHAN.        @L8C 11650000
TTE001UB DS    A                       ORB WORD 1 - UCB ADDRESS.        11660000
*                                      * ORBPTR(R3)->WORD 1.            11670000
TTE001O2 DS    F                       ORB WORD 2.                      11680000
*                                      * ORBPTR(R3)->WORD 2.            11690000
TTE001O3 DS    F                       ORB WORD 3.                      11700000
*                                      * ORBPTR(R3)->WORD 3.            11710000
TTE001O4 DS    F                       ORB WORD 4.                 @LAA 11720000
*                                      * ORBPTR(R3)->WORD 4        @LAA 11730000
TTE001IO DS    A                       IOSB ADDRESS.                    11740000
*                                      * INPUT REGISTER 2.              11750000
TTE001TK DS    0F                      TOKEN.                      @L8C 11760000
*                                      * INPUT REGISTER 1.              11770000
TTE001T1 DS    XL1                     KEY. NOT FORMATTED.         @L8A 11780000
TTE001T2 DS    XL1                     RESERVED.                   @L8A 11790000
TTE001T3 DS    H                       BASE DEVICE NUMBER.         @L8A 11800000
TTE001CU DS    F                       CAPTURE UCB ADDRESS.        @L8A 11810000
*                                      * IOSBPTR(R2)->IOSUCB.           11820000
TTE001SSIDA DS XL1                     SUBCHANNEL SET ID           @LFA 11830000
         DS    XL3                     RESERVED                    @LFA 11840000
TTE001ED DS    0F                      END OF SSCH TTE.                 11850000
.ENDSSCH ANOP                                                           11860000
.*                                                                      11870000
         AIF   ('&ALL' NE 'YES' AND                                    X11880000
               '&EX' NE 'YES' AND                                      X11890000
               '&DSP' NE 'YES').ENDSSRB                                 11900000
         SPACE 1                                                        11910000
*     SSRB - SUSPENDED SRB DISPATCH TTE                                 11920000
         ORG   TTEUNQ                                                   11930000
TTE20F   DS    0F                      SUSPENDED SRB DISPATCH (SSRB).   11940000
TTE20FTB DS    A                       WORK UNIT ADDRESS.         @D1C  11950000
*                                      * PSALCCAV->LCCACWEB.            11960000
TTE20FR1 DS    XL1                     RESERVED.                        11970000
TTE20FLH DS    XL1                     PSACLHS BYTE 4.                  11980000
*                                      * PSACLHS4.                      11990000
TTE20FHA DS    H                       HOME ADDRESS SPACE.              12000000
*                                      * PSAAOLD->ASCBASID.             12010000
TTE20FPA DS    H                       PASID.                           12020000
*                                      * INPUT REGISTER 13.             12030000
TTE20FSA DS    H                       SASID.                           12040000
*                                      * INPUT REGISTER 13.             12050000
TTE20FPW DS    0CL16                   PSW TO BE REDISPATCHED.          12060000
*                                      * PSAPSWSV16.               @LLC 12070000
TTE20FP1 DS    CL4                     PSW 0-3                     @LLC 12080000
TTE20FP2 DS    CL4                     PSW 4-7                     @LLC 12090000
TTE20FP3 DS    CL4                     PSW 8-B                     @LLA 12100000
TTE20FP4 DS    CL4                     PSW C-F                     @LLA 12110000
TTE20FPT DS    A                       RELATED TCB.                     12120000
*                                      * PSALCCAV->LCCAPGTA+2.     @D1A 12130000
TTE20FSP DS    F                       SSRB ADDRESS                @P2C 12140000
*                                      * INPUT REGISTER 1               12150000
TTE20FFN DS    H                       CPU AFFINITY.                    12160000
*                                      * PSALCCAV->LCCASAFN.            12170000
TTE20FAP DS    H                       RELATED ASID.                    12180000
*                                      * PSALCCAV->LCCAPGTA.            12190000
TTE20FPL DS    A                       PSALOCAL.                        12200000
TTE20FED DS    0F                      END OF SSRB TTE.                 12210000
.ENDSSRB ANOP                                                           12220000
.*                                                                      12230000
.*                                                                      12240000
         AIF   ('&ALL' NE 'YES' AND                                    X12250000
               '&EX' NE 'YES' AND                                      X12260000
               '&PDMX' NE 'YES').ENDPDMX                           @LNA 12270000
         SPACE 1                                                        12280000
*     PDMX event TTE                                                    12290000
         ORG   TTEUNQ                                              @LNA 12300000
TTE00A   DS    0F                      PDMX event                  @LNA 12310000
TTE00AW0 DS    0F                      Word 0 (Same as common)     @LNA 12320000
TTE00ATB DS    A                       CURRENT TCB ADDRESS OR 0.   @LNA 12330000
*                                      * PSATOLD.                       12340000
TTE00AW1 DS    0F                      Word 1 (Same as common)     @LNA 12350000
         DS    H                                                   @LNA 12360000
TTE00AHA DS    H                       <ASID>. HOME ADDRESS SPACE. @LNA 12370000
*                                      PSAAOLD-> ASCBASID.         @LNA 12380000
TTE00AW2 DS    0F                      Word 2                      @P8C 12390000
TTE00ARA DS    F                       RETURN ADDRESS              @P8C 12400000
TTE00AW3 DS    0F                      Word 3                      @P8C 12410000
TTE00APFID DS  0F                      PFID                        @LNA 12420000
         DS    H                                                   @LNA 12430000
TTE00APFIDLOW DS H                     Low half of PFID            @LNA 12440000
TTE00W4  DS    0F                      Word 4                      @P8C 12450000
TTE00AU1 DS    0F                      Unique 1                    @LNA 12460000
TTE00ADT DS    F                       Device type                 @LNA 12470000
TTE00AW5 DS    0F                      Word 5                      @LNA 12480000
TTE00AU2 DS    0F                      Unique 2                    @LNA 12490000
TTE00ACB DS    F                       Low half of callback@       @LNA 12500000
TTE00W6  DS    0F                      Word 6                      @P8C 12510000
TTE00AU3 DS    0F                      Unique 3                    @LNA 12520000
TTE00ACBP1 DS  F                       Callback parms 0-3          @LNA 12530000
TTE00W7  DS    0F                      Word 7                      @P8C 12540000
TTE00AU4 DS    0F                      Unique 4                    @LNA 12550000
TTE00ACBP2 DS  F                       Callback parms 4-7          @LNA 12560000
TTE00AED DS    0F                      END OF PDMX TTE.            @LNA 12570000
.ENDPDMX ANOP                                                      @LNA 12580000
         AIF   ('&ALL' NE 'YES' AND                                    X12590000
               '&EX' NE 'YES' AND                                      X12600000
               '&AINT' NE 'YES').ENDAINT                           @LNA 12610000
         SPACE 1                                                        12620000
*     AINT event TTE                                                    12630000
         ORG   TTEUNQ                                              @LNA 12640000
TTE10A   DS    0F                      AINT event                  @LNA 12650000
TTE10AW0 DS    0F                      Word 0 (Same as common)     @LNA 12660000
TTE10ATB DS    A                       <TCB> Current TCB Address        12670000
*                                        PSATOLD.                  @LNA 12680000
TTE10AW1 DS    0F                      Word 1                      @LNA 12690000
         DS    XL1                                                      12700000
TTE10AISM DS   XL1                     Adapter interrupt subclass mask  12710000
*                                                                  @P8C 12720000
TTE10AHA DS    H                       <ASID>. Home Address space. @LNA 12730000
*                                                                  @LNA 12740000
TTE10AW2 DS    0F                      Word 2                           12750000
TTE10APA DS    H                       <PASD>. PASID. Control register  12760000
*                                       4.                         @LNA 12770000
TTE10ASA DS    H                       <SASD>. PASID. Control register  12780000
*                                       3.                         @LNA 12790000
TTE10AW3 DS    0F                      Word 3                      @LNA 12800000
TTE10AU1 DS    0F                      Unique 1                    @LNA 12810000
         DS    CL3                             @LNA                     12820000
TTE10AU1B3 DS  XL1                     Low byte of Unique 3        @LNA 12830000
TTE10AISC EQU  X'38'                   Interrruption subclass is in    *12840000
                                       bits 2-4 ..111...           @P8C 12850000
TTE10APW DS    0CL16                   I/O OLD PSW.                @LNA 12860000
*                                        FLCIOPSW.                 @LNA 12870000
TTE10AP1 DS    CL4                     PSW 0-3                     @LNA 12880000
TTE10AP2 DS    CL4                     PSW 4-7                     @LNA 12890000
TTE10AP3 DS    CL4                     PSW 8-B                     @LNA 12900000
TTE10AP4 DS    CL4                     PSW C-F                     @LNA 12910000
TTE10ALH DS    F                       PSACLHS.                    @P8A 12920000
TTE10APL DS    A                       PSALOCAL.                   @P8A 12930000
TTE10ALE DS    F                       PSACLHSE.                   @P8A 12940000
TTE10AED DS    0F                      END OF AINT TTE.            @LNA 12950000
.ENDAINT ANOP                                                      @LNA 12960000
         AIF   ('&ALL' NE 'YES' AND                                    X12970000
               '&EX' NE 'YES' AND                                      X12980000
               '&PCIL' NE 'YES').ENDPCIL                           @LNA 12990000
         SPACE 1                                                        13000000
*     PCIL event TTE                                                    13010000
         ORG   TTEUNQ                                              @LNA 13020000
TTE20A   DS    0F                      PCIL/PCIS event             @LNA 13030000
TTE20AW0 DS    0F                      Word 0 (Same as common)     @LNA 13040000
TTE20ATB DS    A                       <TCB>. CURRENT TCB ADDRESS OR 0. 13050000
*                                       PSATOLD.                   @LNA 13060000
TTE20AW1 DS    0F                      Word 1 (ASID as in common)  @LNA 13070000
         DS    XL1                                                 @P8A 13080000
TTE20ACC DS    XL1                     CC                          @P8C 13090000
TTE20AHA DS    H                       <ASID>. Home Address space.      13100000
*                                        PSAAOLD->ASCBASID.        @LNA 13110000
TTE20AW2 DS    0F                      Word 2                      @LNA 13120000
TTE20ARet@ DS  A                       Return Address              @LNA 13130000
TTE20AW3 DS    0F                      Word 3                      @LNA 13140000
TTE20AU1 DS    0F                      Unique 1                    @LNA 13150000
TTE20ATraceId DS F                     PCI trace identifier        @LNA 13160000
TTE20AW4 DS    0F                      Word 4                      @LNA 13170000
TTE20APFID DS  0F                      PFID                        @LNA 13180000
         DS    H                                                        13190000
TTE20APFIDLOW DS H                     Low half of PFID            @LNA 13200000
TTE20AW5 DS    0F                      Word 5                      @LNA 13210000
TTE20AU2 DS    0F                      Unique 2                         13220000
TTE20AOP1HH DS F                       High half of operand 1      @LNA 13230000
TTE20AW6 DS    0F                      Word 6                      @LNA 13240000
TTE20AU3 DS    0F                      Unique 3                         13250000
TTE20AOP1LH DS F                       Low half of operand 1       @LNA 13260000
TTE20AW7 DS    0F                      Word 7                      @LNA 13270000
TTE20AU4 DS    0F                      Unique 4                         13280000
TTE20AOP2HH DS F                       High half of operand 2      @LNA 13290000
TTE20AW8 DS    0F                      Word 8                      @LNA 13300000
TTE20AU5 DS    0F                      Unique 5                         13310000
TTE20AOP2LH DS F                       Low half of operand 2       @LNA 13320000
TTE20AW9 DS    0F                      Word 9                      @LNA 13330000
TTE20AU6 DS    0F                      Unique 6                         13340000
TTE20AOP2PHH DS F                      High half of operand 2+1    @LNA 13350000
TTE20AW10 DS   0F                      Word 10                     @LNA 13360000
TTE20AU7 DS    0F                      Unique 7 (under UNIQUE-1)   @LNA 13370000
TTE20AOP2PLH DS F                      Low half of operand 2+1     @LNA 13380000
TTE20AED DS    0F                      END OF PCIL TTE.            @LNA 13390000
.ENDPCIL ANOP                                                      @LNA 13400000
         AIF   ('&ALL' NE 'YES' AND                                    X13410000
               '&EX' NE 'YES' AND                                      X13420000
               '&PCIS' NE 'YES').ENDPCIS                           @LNA 13430000
         SPACE 1                                                        13440000
*     PCIS event TTE                                                    13450000
         ORG   TTEUNQ                                              @LNA 13460000
TTE30A   DS    0F                      PCIL/PCIS event             @LNA 13470000
TTE30AW0 DS    0F                      Word 0 (Same as common)     @LNA 13480000
TTE30ATB DS    A                       <TCB>. CURRENT TCB ADDRESS OR 0. 13490000
*                                       PSATOLD.                   @LNA 13500000
TTE30AW1 DS    0F                      Word 1 (ASID as in common)  @LNA 13510000
         DS    XL1                                                 @P8A 13520000
TTE30ACC DS    XL1                     CC                          @P8C 13530000
TTE30AHA DS    H                       <ASID>. Home Address space.      13540000
*                                        PSAAOLD->ASCBASID.        @LNA 13550000
TTE30AW2 DS    0F                      Word 2                      @LNA 13560000
TTE30ARet@ DS  A                       Return Address              @LNA 13570000
TTE30AW3 DS    0F                      Word 3                      @LNA 13580000
TTE30AU1 DS    0F                      Unique 1                    @LNA 13590000
TTE30ATraceId DS F                     PCI trace identifier        @LNA 13600000
TTE30AW4 DS    0F                      Word 4                      @LNA 13610000
TTE30APFID DS  0F                      PFID                        @LNA 13620000
         DS    H                                                        13630000
TTE30APFIDLOW DS H                     Low half of PFID            @LNA 13640000
TTE30AW5 DS    0F                      Word 5                      @LNA 13650000
TTE30AU2 DS    0F                      Unique 2                         13660000
TTE30AOP1HH DS F                       High half of operand 1      @LNA 13670000
TTE30AW6 DS    0F                      Word 6                      @LNA 13680000
TTE30AU3 DS    0F                      Unique 3                         13690000
TTE30AOP1LH DS F                       Low half of operand 1       @LNA 13700000
TTE30AW7 DS    0F                      Word 7                      @LNA 13710000
TTE30AU4 DS    0F                      Unique 4                         13720000
TTE30AOP2HH DS F                       High half of operand 2      @LNA 13730000
TTE30AW8 DS    0F                      Word 8                      @LNA 13740000
TTE30AU5 DS    0F                      Unique 5                         13750000
TTE30AOP2LH DS F                       Low half of operand 2       @LNA 13760000
TTE30AW9 DS    0F                      Word 9                      @LNA 13770000
TTE30AU6 DS    0F                      Unique 6                         13780000
TTE30AOP2PHH DS F                      High half of operand 2+1    @LNA 13790000
TTE30AW10 DS   0F                      Word 10                     @LNA 13800000
TTE30AU7 DS    0F                      Unique 7 (under UNIQUE-1)   @LNA 13810000
TTE30AOP2PLH DS F                      Low half of operand 2+1     @LNA 13820000
TTE30AED DS    0F                      END OF PCIL TTE.            @LNA 13830000
.ENDPCIS ANOP                                                      @LNA 13840000
         AIF   ('&ALL' NE 'YES' AND                                    X13850000
               '&EX' NE 'YES' AND                                      X13860000
               '&SYNS' NE 'YES').ENDSYNS                           @04A 13870000
         SPACE 1                                                        13880000
*     SYNS event TTE                                                    13890000
         ORG   TTEUNQ                                              @LNA 13900000
TTE00C   DS    0F                      SYNS event                  @04A 13901000
TTE00CW0 DS    0F                      Word 0 (Same as common)     @04A 13902000
TTE00CTB DS    A                       <TCB>. CURRENT TCB ADDRESS OR 0. 13903000
*                                       PSATOLD.                   @04A 13904000
TTE00CW1 DS    0F                      Word 1 (ASID as in common)  @04A 13905000
TTE00CDV DS    XL2                     Device number               @04A 13906000
TTE00CHA DS    H                       <ASID>. Home Address space.      13907000
*                                        PSAAOLD->ASCBASID.        @04A 13908000
TTE00CW2 DS    0F                      Word 2                      @04A 13909000
TTE00CW2B1 DS  XL1                     Word 2, Byte 1              @04A 13909100
TTE00CSID EQU  X'F0'                   Subchannel set id of device     *13909200
                                                                   @04A 13909300
TTE00CTY EQU   X'0F'                   Type of request             @04A 13909400
TTE00CDRVID DS XL1                     Driver ID                   @04A 13909500
TTE00COp DS    XL1                     Operation (Command code)    @04A 13909600
TTE00CRCnt DS  XL1                     Record count                @04A 13909700
TTE00CW3 DS    0F                      Word 3                      @04A 13909800
TTE00CPFID DS  F                       PFID                        @04A 13909900
TTE00CW4 DS    0F                      Word 4                      @04A 13910000
TTE00CFHND DS  F                       Function handle             @04A 13910100
TTE00CW5 DS    0F                      Word 5                      @04A 13910200
TTE00CIOSB@ DS F                       IOSB address                     13910300
TTE00CW6 DS    0F                      Word 6                      @04A 13910400
TTE00CLEN1 DS  H                       First data length field     @04A 13910500
TTE00CLEN2 DS  H                       Second data length field    @04A 13910600
TTE00CED DS    0F                      END OF SYNS TTE.            @04A 13910700
.ENDSYNS ANOP                                                      @04A 13910800
         AIF   ('&ALL' NE 'YES' AND                                    X13910900
               '&EX' NE 'YES' AND                                      X13911000
               '&SYNE' NE 'YES').ENDSYNE                           @04A 13912000
         SPACE 1                                                        13913000
*     SYNE event TTE                                                    13913100
         ORG   TTEUNQ                                              @LNA 13913200
TTE10C   DS    0F                      SYNE event                  @LNA 13913300
TTE10CW0 DS    0F                      Word 0 (Same as common)     @04A 13913400
TTE10CTB DS    A                       <TCB>. CURRENT TCB ADDRESS OR 0. 13913500
*                                       PSATOLD.                   @04A 13913600
TTE10CW1 DS    0F                      Word 1 (ASID as in common)  @04A 13913700
         DS    XL2                                                 @04A 13913800
TTE10CHA DS    H                       <ASID>. Home Address space.      13913900
*                                        PSAAOLD->ASCBASID.        @04A 13914000
TTE10CW2 DS    0F                      Word 2                      @04A 13914100
TTE10CW2B1 DS  XL1                     Word 2, Byte 1              @04A 13914200
TTE10CSID EQU  X'F0'                   Subchannel set id of device     *13914300
                                                                   @04A 13914400
TTE10CTY EQU   X'0F'                   Type of request             @04A 13914500
TTE10CDRVID DS XL1                     Driver ID                   @04A 13914600
TTE10COp DS    XL1                     Operation (Command code)    @04A 13914700
TTE10CRCnt DS  XL1                     Record count                @04A 13914800
TTE10CW3 DS    0F                      Word 3                      @04A 13914900
TTE10CPFID DS  F                       PFID                        @04A 13915000
TTE10CW4 DS    0F                      Word 4                      @04A 13916000
TTE10CFHND DS  F                       Function handle             @04A 13916100
TTE10CW5 DS    0F                      Word 5                      @04A 13916200
TTE10CIOSB@ DS F                       IOSB address                     13916300
TTE10CW6 DS    0F                      Word 6                      @04A 13916400
TTE10CLEN1 DS  H                       First data length field     @04A 13916500
TTE10CLEN2 DS  H                       Second data length field    @04A 13916600
TTE10CW7 DS    0F                      Word 7                      @04A 13916700
TTE10CRC DS    H                       Response code               @04A 13916800
TTE10CRCQ DS   H                       Response code qualifier     @04A 13916900
TTE10CED DS    0F                      END OF SYNE TTE.            @04A 13917000
.ENDSYNE ANOP                                                      @04A 13918000
         AIF   ('&ALL' NE 'YES' AND                                    X13919000
               '&EX' NE 'YES' AND                                      X13919100
               '&SUSP' NE 'YES').ENDSUSP                                13919200
         SPACE 2                                                        13919300
*     SUSP - LOCK SUSPENSION TTE                                        13919400
         ORG   TTEUNQ                                                   13919500
TTE019   DS    0F                      SUSPENSION (SUSP).               13919600
TTE019TB DS    A                       ADDRESS OF SUSPENDED TCB OR      13919700
*                                      RELATED TCB.                     13919800
*                                      * INPUT REGISTER 4 OR            13919900
*                                      * SSRBPTR(R4)->SRBPTCB.          13920000
TTE019R1 DS    H                       RESERVED.                        13930000
TTE019HA DS    H                       HOME ADDRESS SPACE.              13940000
*                                      * PSAAOLD->ASCBASID.             13950000
TTE019RT DS    A                       RETURN ADDRESS FOR THE CALLER    13960000
*                                      OF THE SERVICE ROUTINE.          13970000
*                                      * INPUT REGISTER 14.             13980000
TTE019RB DS    A                       ADDRESS OF SUSPENDED RB OR 0.    13990000
*                                      * INPUT REGISTER 5.              14000000
TTE019SB DS    A                       ADDRESS OF SUSPENDED SRB OR 0.   14010000
*                                      * INPUT REGISTER 4 OR 0.         14020000
TTE019SI DS    CL4                     EBCDIC SUSPENSION TYPE           14030000
*                                      IDENTIFIER:  CEDQ, CLAT CML,     14040000
*                                      CMS, CSMF LOCL                   14050000
*                                      * INPUT REGISTER 12.             14060000
TTE019AD DS    A                       ADDRESS ASSOCIATED WITH          14070000
*                                      SUSPENSION OR 0:                 14080000
*                                      CEDQ - LOCKWORD ADDRESS.         14090000
*                                      CLAT - LOCKWORD ADDRESS.         14100000
*                                      CML  - ASCB ADDRESS FOR CML      14110000
*                                             LOCK REQUESTED.           14120000
*                                      CMS  - LOCKWORD ADDRESS.         14130000
*                                      CSMF - LOCKWORD ADDRESS.         14140000
*                                      LOCL - 0.                        14150000
*                                      * INPUT REGISTER 11.             14160000
TTE019LH DS    F                       CLHS - CPU LOCKS HELD STRING     14170000
*                                      * INPUT REGISTER 2.         @P1A 14180000
TTE019PL DS    A                       LOCAL LOCK                       14190000
*                                      * INPUT REGISTER 3.         @P1A 14200000
TTE019LE DS    F                       PSACLHSE.                   @L4A 14210000
TTE019ED DS    0F                      END OF SUSP TTE.                 14220000
.ENDSUSP ANOP                                                           14230000
.*                                                                      14240000
         AIF   ('&ALL' NE 'YES' AND                                    X14250000
               '&EX' NE 'YES' AND                                      X14260000
               '&SVC' NE 'YES').ENDSVC                                  14270000
         SPACE 1                                                        14280000
*     SVC - SVC INTERRUPT TTE                                           14290000
         ORG   TTEUNQ                                                   14300000
TTE005   DS    0F                      GENERAL SVC INTERRUPT (SVC).     14310000
TTE005TB DS    A                       CURRENT TCB ADDRESS OR 0.        14320000
*                                      * PSATOLD.                       14330000
TTE005SN DS    H                       SVC NUMBER.                      14340000
*                                      * FLCSVCN.                       14350000
TTE005HA DS    H                       HOME ADDRESS SPACE.              14360000
*                                      * PSAAOLD->ASCBASID.             14370000
TTE005PW DS    0CL16                   SVC OLD PSW.                     14380000
*                                      * FLCSOPSW.                 @LLC 14390000
TTE005P1 DS    CL4                     PSW 0-3                     @LLA 14400000
TTE005P2 DS    CL4                     PSW 4-7                     @LLA 14410000
TTE005P3 DS    CL4                     PSW 8-B                     @LLA 14420000
TTE005P4 DS    CL4                     PSW C-F                     @LLA 14430000
TTE005GF DS    F                       REGISTER 15 CONTENTS.            14440000
*                                      * INPUT REGISTER 15.             14450000
TTE005G0 DS    F                       REGISTER 0 CONTENTS.             14460000
*                                      * INPUT REGISTER 0.              14470000
TTE005G1 DS    F                       REGISTER 1 CONTENTS.             14480000
*                                      * INPUT REGISTER 1.              14490000
TTE005ED DS    0F                      END OF SVC TTE.                  14500000
.ENDSVC  ANOP                                                           14510000
.*                                                                      14520000
         AIF   ('&ALL' NE 'YES' AND                                    X14530000
               '&EX' NE 'YES' AND                                      X14540000
               '&SVC' NE 'YES').ENDSVCE                                 14550000
         SPACE 1                                                        14560000
*     SVCE - SVC ERROR TTE                                              14570000
         ORG   TTEUNQ                                                   14580000
TTEF05   DS    0F                      SVC ERROR (SVCE).                14590000
TTEF05TB DS    A                       CURRENT TCB ADDRESS OR 0.        14600000
*                                      * PSATOLD.                       14610000
TTEF05SN DS    H                       SVC NUMBER.                      14620000
*                                      * FLCSVCN.                       14630000
TTEF05HA DS    H                       HOME ADDRESS SPACE.              14640000
*                                      * PSAAOLD->ASCBASID.             14650000
TTEF05PA DS    H                       PASID.                           14660000
*                                      * CONTROL REGISTER 4.            14670000
TTEF05SA DS    H                       SASID.                           14680000
*                                      * CONTROL REGISTER 3.            14690000
TTEF05PW DS    0CL16                   SVC OLD PSW.                     14700000
*                                      * FLCSOPSW.                 @LLC 14710000
TTEF05P1 DS    CL4                     PSW 0-3                     @LLA 14720000
TTEF05P2 DS    CL4                     PSW 4-7                     @LLA 14730000
TTEF05P3 DS    CL4                     PSW 8-B                     @LLA 14740000
TTEF05P4 DS    CL4                     PSW C-F                     @LLA 14750000
TTEF05GF DS    F                       REGISTER 15 CONTENTS.            14760000
*                                      * INPUT REGISTER 15.             14770000
TTEF05G0 DS    F                       REGISTER 0 CONTENTS.             14780000
*                                      * INPUT REGISTER 0.              14790000
TTEF05G1 DS    F                       REGISTER 1 CONTENTS.             14800000
*                                      * INPUT REGISTER 1.              14810000
TTEF05MW DS    F                       PSAMODEW.                        14820000
TTEF05LH DS    F                       PSACLHS.                         14830000
TTEF05PL DS    A                       PSALOCAL.                        14840000
TTEF05LE DS    F                       PSACLHSE.                   @L4A 14850000
TTEF05ED DS    0F                      END OF SVCE TTE.                 14860000
.ENDSVCE ANOP                                                           14870000
.*                                                                      14880000
         AIF   ('&ALL' NE 'YES' AND                                    X14890000
               '&EX' NE 'YES' AND                                      X14900000
               '&SVC' NE 'YES').ENDSVCR                                 14910000
         SPACE 1                                                        14920000
*     SVCR - SVC RETURN TTE                                             14930000
         ORG   TTEUNQ                                                   14940000
TTE105   DS    0F                      SVC RETURN (SVCR).               14950000
TTE105TB DS    A                       CURRENT TCB ADDRESS.             14960000
*                                      * PSATOLD.                       14970000
TTE105SN DS    H                       SVC NUMBER.                      14980000
*                                      * ((PSATOLD->TCBRBP)-            14990000
*                                      *   (RBPRFLNA)->RBINTCOD.        15000000
TTE105HA DS    H                       HOME ADDRESS SPACE.              15010000
*                                      * PSAAOLD->ASCBASID.             15020000
TTE105PW DS    0CL16                   PSW TO RECEIVE CONTROL ON        15030000
*                                      REDISPATCH.                      15040000
*                                      * PSATOLD->TCBRBP->RBOPSW.  @LLC 15050000
TTE105P1 DS    CL4                     PSW 0-3                     @LLA 15060000
TTE105P2 DS    CL4                     PSW 4-7                     @LLA 15070000
TTE105P3 DS    CL4                     PSW 8-B                     @LLA 15080000
TTE105P4 DS    CL4                     PSW C-F                     @LLA 15090000
TTE105GF DS    F                       REGISTER 15 CONTENTS.            15100000
*                                      * INPUT REGISTER 15.             15110000
TTE105G0 DS    F                       REGISTER 0 CONTENTS.             15120000
*                                      * INPUT REGISTER 0.              15130000
TTE105G1 DS    F                       REGISTER 1 CONTENTS.             15140000
*                                      * INPUT REGISTER 1.              15150000
TTE105ED DS    0F                      END OF SVCR TTE.                 15160000
.ENDSVCR ANOP                                                           15170000
.*                                                                      15180000
         AIF   ('&ALL' NE 'YES' AND                                    X15190000
               '&EX' NE 'YES' AND                                      X15200000
               '&SSRV' NE 'YES').ENDSSRV  IF ALL ENTRY MAPPINGS IS @L2A 15210000
.*                                     NOT SPECIFIED, ALL EXPLICIT      15220000
.*                                     ENTRY MAPPINGS IS NOT            15230000
.*                                     SPECIFIED, SSRV ENTRY            15240000
.*                                     MAPPING IS NOT SPECIFIED,        15250000
.*                                     SKIP SSRV ENTRY MAPPING          15260000
.*                                     GENERATION.                      15270000
         SPACE 1                                                        15280000
*     SSRV - PC OR BRANCH ENTERED SYSTEM SERVICE TTE                    15290000
         ORG   TTEUNQ                                                   15300000
TTE205   DS    0F                      PC OR BRANCH ENTERED        @L2A 15310000
*                                      SYSTEM SERVICE (SSRV)            15320000
TTE205TB DS    A                       CURRENT TCB ADDRESS OR 0.   @L2A 15330000
*                                      PSATOLD.                         15340000
TTE205SI DS    H                       SSRVID.                     @L2A 15350000
*                                      ASSOCIATED SERVICE IDENTIFIER    15360000
*                                      NUMBER.                          15370000
TTE205HA DS    H                       HOME ADDRESS SPACE.         @L2A 15380000
*                                      PSAAOLD->ASCBASID.               15390000
TTE205CI DS    A                       RETURN ADDRESS OF THE       @L2A 15400000
*                                      CALLER OF THE BRANCH             15410000
*                                      ENTERED SERVICE OR OF THE        15420000
*                                      PC ENTERED SERVICE.              15430000
TTE205U1 DS    F                       1ST WORD OF INFORMATION     @L2A 15440000
*                                      UNIQUE FOR ASSOCIATED            15450000
*                                      SERVICE IDENTIFIER.              15460000
TTE205U2 DS    F                       2ND WORD OF INFORMATION     @L2A 15470000
*                                      UNIQUE FOR ASSOCIATED            15480000
*                                      SERVICE IDENTIFIER.              15490000
TTE205U3 DS    F                       3RD WORD OF INFORMATION     @L2A 15500000
*                                      UNIQUE FOR ASSOCIATED            15510000
*                                      SERVICE IDENTIFIER.              15520000
TTE205U4 DS    F                       4TH WORD OF INFORMATION     @L2A 15530000
*                                      UNIQUE FOR ASSOCIATED            15540000
*                                      SERVICE IDENTIFIER.              15550000
TTE205ED DS    0F                      END OF SSRV TTE.            @L2A 15560000
*     SSRV - TTE FOR IARV64 REQUESTS                                    15570000
         ORG   TTEUNQ                                              @LDA 15580000
TTEV64   DS    0F                      IARV64 SSRV                 @LDA 15590000
TTEV64TB DS    A                       CURRENT TCB ADDRESS OR 0.   @LDA 15600000
*                                      PSATOLD.                    @LDA 15610000
TTEV64SI DS    H                       SSRVID.                     @LDA 15620000
*                                      ASSOCIATED SERVICE IDENTIFIER    15630000
*                                      NUMBER.                     @LDA 15640000
TTEV64HA DS    H                       HOME ADDRESS SPACE.         @LDA 15650000
*                                      PSAAOLD->ASCBASID.          @LDA 15660000
TTEV64W1 DS    A                       WORD1 - REQUEST TYPE AND    @LDA 15670000
*                                       MISC FLAGS                 @LDA 15680000
TTEV64W2 DS    A                       WORD2 - ABEND/RETURN CODE   @LDA 15690000
TTEV64W3 DS    A                       WORD3 - REASON CODE         @LDA 15700000
TTEV64W4 DS    A                       WORD4 - ALET                @LDA 15710000
*                                                                  @LDA 15720000
TTEV64D1 DS    0CL8                    DOUBLEWORD #1               @LDA 15730000
TTEV64WA DS    CL4                      WORD1                      @LDA 15740000
TTEV64WB DS    CL4                      WORD2                      @LDA 15750000
*                                                                  @LDA 15760000
TTEV64D2 DS    0CL8                    DOUBLEWORD #2               @LDA 15770000
TTEV64WC DS    CL4                      WORD1                      @LDA 15780000
TTEV64WD DS    CL4                      WORD2                      @LDA 15790000
*                                                                  @LDA 15800000
TTEV64D3 DS    0CL8                    DOUBLEWORD #3               @LDA 15810000
TTEV64WE DS    CL4                      WORD1                      @LDA 15820000
TTEV64WF DS    CL4                      WORD2                      @LDA 15830000
TTEV64ED DS    0F                                                  @LDA 15840000
*     SSRV - TTE FOR CF CPU REQUESTS                                    15850000
         ORG   TTEUNQ                                              @LKA 15860000
TTECFC   DS    0F           CF CPU SSRV                            @LKA 15870000
TTECFCTB DS    A     <TCB>  CURRENT TCB ADDRESS OR 0.                   15880000
*                           PSATOLD.                               @LKA 15890000
TTECFCSI DS    H     <CD/D> SSRVID.                                     15900000
*                           ASSOCIATED SERVICE IDENTIFIER               15910000
*                           NUMBER ('1050'x).                      @LKA 15920000
TTECFCHA DS    H     <ASID> HOME ADDRESS SPACE.                         15930000
*                           PSAAOLD->ASCBASID.                     @LKA 15940000
*                                                                       15950000
TTECFCPW DS    CL4   <PSW ADDR> TARGET CPU, FLAGS,                      15960000
*                            DIRECTION AND SOURCE.                 @LKA 15970000
*                                                                       15980000
TTECFCU1 DS    CL4     <U1> COPY OF RGD_SCPU_RC                    @LKA 15990000
*                                                                       16000000
TTECFCU2 DS    CL4     <U2> START OF CSD_CPU_ALIVE.                @LKA 16010000
TTECFCU3 DS    CL4     <U3>                                        @LKA 16020000
*                                                                       16030000
TTECFCU4 DS    CL4     <U4>                                        @LKA 16040000
TTECFCU5 DS    CL4     <U5> END OF CSD_CPU_ALIVE.                  @LKA 16050000
*                                                                       16060000
TTECFCED DS    0F           END OF SSRV CF CPU TTE                 @LKA 16070000
*                                                                       16080000
.ENDSSRV ANOP                                                      @L2A 16090000
.*                                                                      16100000
         AIF   ('&ALL' NE 'YES' AND                                    X16110000
               '&EX' NE 'YES' AND                                      X16120000
               '&USRNG' NE 'YES').ENDUSRNG                              16130000
         SPACE 2                                                        16140000
*     USRN - USER EVENT TTE AMODE64                                     16150000
         ORG   TTEEUNQ                                                  16160000
TTE07FE  DS    0F                      USER EVENT TRACE (USRN) TRACG    16170000
TTE07FTE DS    A                       CURRENT TCB ADDRESS OR 0.   @LGA 16200000
*                                      * PSATOLD.                       16230000
TTE07FDE DS    H                       RESERVED.                   @LGA 16240000
TTE07FHE DS    H                       HOME ADDRESS SPACE.         @LGA 16250000
*                                      * PSAAOLD->ASCBASID.             16280000
TTE07FPE DS    H                       PASID.                      @LGA 16290000
*                                      * CONTROL REGISTER 4.            16300000
TTE07FSE DS    H                       SASID.                      @LGA 16310000
*                                      * CONTROL REGISTER 3.            16320000
TTE07FCE DS    0CL4                    CONTINUATION INFORMATION.   @LPC 16361002
TTE07FIE DS    H                       PTRACE IDENTIFICATION COUNT @LGA 16370000
*                                      * PSATRVT->TRVTTOB->TOBTRCI      16380000
TTE07FRE DS    H                       RELATIVE BYTE COUNT.        @LGA 16390000
*                                      * GENERATED.                     16400000
TTE07FAE DS    CL8                     USER RETURN ADDRESS.        @LQM 16400109
*                                      * INPUT REGISTER 14.             16400205
TTE07FME EQU   7                       MAXIMUM NUMBER OF DATA WORDS     16400311
*                                      PER USER ENTRY.             @LQC 16400412
*                                                                       16401005
*        Pre-z/OS 2.5 mapping                                      @LQA 16402009
*                                                                       16403005
               ORG   TTEEUNQ                                       @LQA 16404009
TTE07FE_pre25  DS    0F                USER EVENT TRACE (USRN) TRACG    16405006
               DS    0CL8                                          @LQA 16406009
               DS    CL4                                           @LQA 16407009
TTE07FTE_pre25 DS    A                 CURRENT TCB ADDRESS OR 0.   @LQA 16408009
*                                      * PSATOLD.                  @LQM 16408109
               DS    0CL8                                          @LQA 16409009
               DS    CL4                                           @LQA 16409109
TTE07FDE_pre25 DS    H                 RESERVED.                   @LQA 16409309
TTE07FHE_pre25 DS    H                 HOME ADDRESS SPACE.         @LQA 16409409
*                                      * PSAAOLD->ASCBASID.        @LQM 16409509
               DS    0CL8                                          @LQA 16409609
               DS    CL4                                           @LQA 16409709
TTE07FPE_pre25 DS    H                 PASID.                      @LQA 16409909
*                                      * CONTROL REGISTER 4.            16410005
TTE07FSE_pre25 DS    H                 SASID.                      @LQA 16410109
*                                      * CONTROL REGISTER 3.            16410205
TTE07FAE_pre25 DS    CL8               USER RETURN ADDRESS.        @LQA 16410309
*                                      * INPUT REGISTER 14.             16410405
               DS    0CL8                                          @LQA 16410509
               DS    CL4                                           @LQA 16410609
TTE07FCE_pre25 DS    0CL4              CONTINUATION INFORMATION.   @LQA 16410709
TTE07FIE_pre25 DS    H                 PTRACE IDENTIFICATION COUNT @LQA 16410809
*                                      * PSATRVT->TRVTTOB->TOBTRCI      16410905
TTE07FRE_pre25 DS    H                 RELATIVE BYTE COUNT.        @LQA 16411009
.ENDUSRNG ANOP                                                          16430000
.*                                                                      16440000
         AIF   ('&ALL' NE 'YES' AND                                    X16450000
               '&EX' NE 'YES' AND                                      X16460000
               '&USRN' NE 'YES').ENDUSRN                                16470000
         SPACE 2                                                        16480000
*     USRN - USER EVENT TTE                                             16490000
         ORG   TTEUNQ                                                   16500000
TTE07F   DS    0F                      USER EVENT TRACE (USRN).         16510000
TTE07FTB DS    A                       CURRENT TCB ADDRESS OR 0.        16520000
*                                      * PSATOLD.                       16530000
TTE07FRV DS    H                       RESERVED.                        16540000
TTE07FHA DS    H                       HOME ADDRESS SPACE.              16550000
*                                      * PSAAOLD->ASCBASID.             16560000
TTE07FPA DS    H                       PASID.                           16570000
*                                      * CONTROL REGISTER 4.            16580000
TTE07FSA DS    H                       SASID.                           16590000
*                                      * CONTROL REGISTER 3.            16600000
TTE07FAD DS    A                       USER RETURN ADDRESS.             16610000
*                                      * INPUT REGISTER 14.             16620000
TTE07FCI DS    0F                      CONTINUATION INFORMATION.        16630000
TTE07FPI DS    H                       PTRACE IDENTIFICATION COUNT.     16640000
*                                      * PSATRVT->TRVTTOB->TOBTRCI      16650000
TTE07FRB DS    H                       RELATIVE BYTE COUNT.             16660000
*                                      * GENERATED.                     16670000
TTE07FMW EQU   5                       MAXIMUM NUMBER OF DATA WORDS     16680000
*                                      PER USER ENTRY.                  16690000
.ENDUSRN ANOP                                                           16700000
.*                                                                      16710000
         AIF   ('&ALL' NE 'YES' AND                                    X16720000
               '&EX' NE 'YES' AND                                      X16730000
               '&DSP' NE 'YES').ENDWAIT                                 16740000
         SPACE 1                                                        16750000
*     WAIT - WAIT DISPATCH TTE                                          16760000
         ORG   TTEUNQ                                                   16770000
TTEF0F   DS    0F                      WAIT DISPATCH (WAIT).            16780000
TTEF0FTB DS    A                       CURRENT TCB ADDRESS.             16790000
*                                      * PSATOLD.                       16800000
TTEF0FR1 DS    H                       RESERVED.                        16810000
TTEF0FHA DS    H                       HOME ADDRESS SPACE.              16820000
*                                      * PSAAOLD->ASCBASID.             16830000
TTEF0FED DS    0F                      END OF WAIT TTE.                 16840000
.ENDWAIT ANOP                                                           16850000
.*                                                                      16860000
         AIF   ('&ALL' NE 'YES' AND                                    X16870000
               '&EX' NE 'YES' AND                                      X16880000
               '&RCVY' NE 'YES').ENDRCVY                           @L3A 16890000
         SPACE 1                                                        16900000
*     RCVY - RECOVERY EVENT TTE                                         16910000
         ORG   TTEUNQ                                              @L3A 16920000
TTE01D   DS    0F                      RECOVERY EVENT (RCVY).      @L3A 16930000
TTE01DTB DS    A                       CURRENT TCB ADDRESS OR 0.   @L3A 16940000
*                                      * PSATOLD.                       16950000
TTE01DSI DS    H                       RCVY SUBTYPE CODE.          @L3A 16960000
TTE01DHA DS    H                       HOME ADDRESS SPACE.         @L3A 16970000
*                                      * PSAAOLD->ASCBASID.             16980000
TTE01DLH DS    F                       PSACLHS.                    @L3A 16990000
TTE01DLE DS    F                       PSACLHSE.                   @L4A 17000000
TTE01DPL DS    A                       PSALOCAL.                   @L3A 17010000
TTE01DU  DS    0CL40                   INFORMATION UNIQUE TO       @P7C 17020000
*                                      RCVY SUBTYPE CODE.               17030000
TTE01DU1 DS    F                       1ST WORD OF INFORMATION     @L3A 17040000
*                                      UNIQUE TO RCVY SUBTYPE.          17050000
TTE01DU2 DS    F                       2ND WORD OF INFORMATION     @L3A 17060000
*                                      UNIQUE TO RCVY SUBTYPE.          17070000
TTE01DU3 DS    F                       3RD WORD OF INFORMATION     @L3A 17080000
*                                      UNIQUE TO RCVY SUBTYPE.          17090000
TTE01DU4 DS    F                       4TH WORD OF INFORMATION     @L3A 17100000
*                                      UNIQUE TO RCVY SUBTYPE.          17110000
TTE01DU5 DS    F                       5TH WORD OF INFORMATION     @L3A 17120000
*                                      UNIQUE TO RCVY SUBTYPE.          17130000
TTE01DU6 DS    F                       6TH WORD OF INFORMATION     @L3A 17140000
*                                      UNIQUE TO RCVY SUBTYPE.          17150000
TTE01DU7 DS    F                       7TH WORD OF INFORMATION     @L3A 17160000
*                                      UNIQUE TO RCVY SUBTYPE.          17170000
TTE01DU8 DS    F                       8TH WORD OF INFORMATION     @L3A 17180000
*                                      UNIQUE TO RCVY SUBTYPE.          17190000
TTE01DU9 DS    F                       9TH WORD OF INFORMATION     @P7A 17200000
*                                      UNIQUE TO RCVY SUBTYPE.          17210000
TTE01DUA DS    F                       10TH WORD OF INFORMATION    @P7A 17220000
*                                      UNIQUE TO RCVY SUBTYPE.          17230000
TTE01DED DS    0F                      END OF RCVY TTE.            @L3A 17240000
.ENDRCVY ANOP                                                      @L3A 17250000
.*                                                                      17260000
         AIF   ('&ALL' NE 'YES' AND                                    X17270000
               '&EX' NE 'YES' AND                                      X17280000
               '&SPIN' NE 'YES').ENDSPIN                           @LJA 17290000
         SPACE 1                                                        17300000
*     SPIN event TTE                                                    17310000
         ORG   TTEUNQ                                              @LJA 17320000
TTE01E   DS    0F                      SPIN event                  @LJA 17330000
TTE01ETB DS    A                       CURRENT TCB ADDRESS OR 0.   @LJA 17340000
*                                      * PSATOLD.                       17350000
TTE01ESI DS    H                       SPIN SUBTYPE CODE.          @LJA 17360000
TTE01EHA DS    H                       HOME ADDRESS SPACE.         @LJA 17370000
*                                      * PSAAOLD->ASCBASID.             17380000
TTE01ELH DS    F                       PSACLHS.                    @LJA 17390000
TTE01ELE DS    F                       PSACLHSE.                   @LJA 17400000
TTE01EPL DS    A                       PSALOCAL.                   @LJA 17410000
TTE01EU  DS    0CL32                   INFORMATION UNIQUE TO       @LJA 17420000
*                                      SPIN SUBTYPE CODE.               17430000
TTE01EU1 DS    F                       1ST WORD OF INFORMATION     @LJA 17440000
*                                      UNIQUE TO SPIN SUBTYPE.          17450000
TTE01EU2 DS    F                       2ND WORD OF INFORMATION     @LJA 17460000
*                                      UNIQUE TO SPIN SUBTYPE.          17470000
TTE01EU3 DS    F                       3RD WORD OF INFORMATION     @LJA 17480000
*                                      UNIQUE TO SPIN SUBTYPE.          17490000
TTE01EU4 DS    F                       4TH WORD OF INFORMATION     @LJA 17500000
*                                      UNIQUE TO SPIN SUBTYPE.          17510000
TTE01EU5 DS    F                       5TH WORD OF INFORMATION     @LJA 17520000
*                                      UNIQUE TO SPIN SUBTYPE.          17530000
TTE01EU6 DS    F                       6TH WORD OF INFORMATION     @LJA 17540000
*                                      UNIQUE TO SPIN SUBTYPE.          17550000
TTE01EU7 DS    F                       7TH WORD OF INFORMATION     @LJA 17560000
*                                      UNIQUE TO SPIN SUBTYPE.          17570000
TTE01EU8 DS    F                       8TH WORD OF INFORMATION     @LJA 17580000
*                                      UNIQUE TO SPIN SUBTYPE.          17590000
TTE01EED DS    0F                      END OF SPIN TTE.            @LJA 17600000
.ENDSPIN ANOP                                                      @LJA 17610000
.*                                                                      17620000
         AIF   ('&ALL' NE 'YES' AND                                    X17630000
               '&EX' NE 'YES' AND                                      X17640000
               '&TIME' NE 'YES').ENDTIME                           @L5A 17650000
         SPACE 1                                                        17660000
*     TIME - TIMER SERVICES TTE                                    @L5A 17670000
         ORG   TTEUNQ                                              @L5A 17680000
TTE01F   DS    0F                      TIMER SERVICES ENTRY(TIME)  @L5A 17690000
TTE01FTB DS    A                       CURRENT TCB ADDRESS OR 0.   @L5A 17700000
*                                      * PSATOLD.                       17710000
TTE01FSI DS    H                       TIME SUBTYPE CODE.          @L5A 17720000
TTE01FHA DS    H                       HOME ADDRESS SPACE.         @L5A 17730000
*                                      * PSAAOLD->ASCBASID.             17740000
TTE01FU  DS    0CL44                   INFORMATION UNIQUE TO       @L5A 17750000
*                                      TIME SUBTYPE CODE.               17760000
TTE01FU1 DS    F                       1ST WORD OF INFORMATION     @L5A 17770000
*                                      UNIQUE TO TIME SUBTYPE.          17780000
TTE01FU2 DS    F                       2ND WORD OF INFORMATION     @L5A 17790000
*                                      UNIQUE TO TIME SUBTYPE.          17800000
TTE01FU3 DS    F                       3RD WORD OF INFORMATION     @L5A 17810000
*                                      UNIQUE TO TIME SUBTYPE.          17820000
TTE01FU4 DS    F                       4TH WORD OF INFORMATION     @L5A 17830000
*                                      UNIQUE TO TIME SUBTYPE.          17840000
TTE01FU5 DS    F                       5TH WORD OF INFORMATION     @L5A 17850000
*                                      UNIQUE TO TIME SUBTYPE.          17860000
TTE01FU6 DS    F                       6TH WORD OF INFORMATION     @L5A 17870000
*                                      UNIQUE TO TIME SUBTYPE.          17880000
TTE01FU7 DS    F                       7TH WORD OF INFORMATION     @L5A 17890000
*                                      UNIQUE TO TIME SUBTYPE.          17900000
TTE01FU8 DS    F                       8TH WORD OF INFORMATION     @L5A 17910000
*                                      UNIQUE TO TIME SUBTYPE.          17920000
TTE01FU9 DS    F                       9TH WORD OF INFORMATION     @L5A 17930000
*                                      UNIQUE TO TIME SUBTYPE.          17940000
TTE01FUA DS    F                       10TH WORD OF INFORMATION    @L5A 17950000
*                                      UNIQUE TO TIME SUBTYPE.          17960000
TTE01FUB DS    F                       11TH WORD OF INFORMATION    @L5A 17970000
*                                      UNIQUE TO TIME SUBTYPE.          17980000
TTE01FED DS    0F                      END OF TIME TTE.            @L5A 17990000
.ENDTIME ANOP                                                      @L5A 18000000
.*                                                                      18010000
         AIF   ('&ALL' NE 'YES' AND                                    X18020000
               '&EX' NE 'YES' AND                                      X18030000
               '&SCH' NE 'YES').ENDXSCH                            @02A 18040000
         SPACE 1                                                        18050000
*     XSCH - CANCEL SUBCHANNEL TTE                                 @02A 18060000
         ORG   TTEUNQ                                              @02A 18070000
TTE601   DS    0F                      CANCEL SUBCHANNEL (XSCH).   @02A 18080000
TTE601TB DS    A                       TCB ADDRESS FROM SRB.            18090000
*                                      * IOSBPTR(R2)->IOSSRB->SRBPTCB.  18100000
*                                                                  @02A 18110000
TTE601AD DS    H                       ASID FROM IOSB.                  18120000
*                                      * IOSBPTR(R2)->IOSASID.     @02A 18130000
TTE601HA DS    H                       HOME ADDRESS SPACE.              18140000
*                                      * PSAAOLD->ASCBASID.        @02A 18150000
TTE601CC DS    XL1                     CONDITION CODE.                  18160000
*                                      * INPUT REGISTER 0.         @02A 18170000
TTE601DI DS    XL1                     DRIVER ID.                       18180000
*                                      * IOSBPTR(R2)->IOSDVRID.    @02A 18190000
TTE601DN DS    H                       DEVICE NUMBER.                   18200000
*                                      * UCBPFPTR(R7)+'200'X->UCBCHAN.  18210000
*                                                                  @02A 18220000
TTE601UB DS    A                       UCB ADDRESS (COMMON SEGMENT).    18230000
*                                      *  UCBPFPTR(R7)+'200'X.     @02A 18240000
TTE601IQ DS    A                       IOQ ADDRESS.                     18250000
*                                      * UCBPFPTR(R7)->UCBIOQ.     @02A 18260000
TTE601IO DS    A                       IOSB ADDRESS.                    18270000
*                                      * INPUT REGISTER 2.         @02A 18280000
TTE601TK DS    0F                      TOKEN.                           18290000
*                                      * INPUT REGISTER 1.         @02A 18300000
TTE601T1 DS    XL1                     KEY. NOT FORMATTED.         @02A 18310000
TTE601T2 DS    XL1                     RESERVED.                   @02A 18320000
TTE601T3 DS    H                       BASE DEVICE NUMBER.         @02A 18330000
TTE601SSIDA DS XL1                     SUBCHANNEL SET ID           @LFA 18340000
         DS    XL3                     RESERVED                    @LFA 18350000
TTE601IA DS    A                       ASSOCIATED IOQ ADDRESS (E.G.,    18360000
*                                      AN INTERROGATE IOQ) OR 0.        18370000
*                                      REG 10 ON TRACE INSTRUCTION.     18380000
*                                                                  @A4A 18390000
TTE601ED DS    0F                      END OF XSCH TTE.            @02A 18400000
.ENDXSCH ANOP                                                      @02A 18410000
.*                                                                      18420000
         MEND  ,                                                     */ 18430000
*                                                                       18440000
*%TTEL2:                                                                18450000
*   ;                                                                   18460000
*                                                                       18470000
*   /*****************************************************************/ 18480000
*   /*                                                               */ 18490000
*   /* SYSTEM TRACE TABLE ENTRY                                      */ 18500000
*   /*                                                               */ 18510000
*   /*****************************************************************/ 18520000
*                                                                       18530000
* ?ASAXMAC SetzArchInfo;                                      /* @LLA*/ 18540000
*   DECLARE                                                             18550000
*     1    TTE      BASED(TTEPTR) BOUNDARY(WORD), /* TRACE TABLE        18560000
*                                      ENTRY.                        */ 18570000
*       3    *        CHARACTER(4); /* MINIMUM TRACE TABLE ENTRY.    */ 18580000
*                                                                       18590000
*/*!NOTATION USED IN THE TTE MAPPING:                                */ 18600000
*/*!                                                                 */ 18610000
*/*!A MODEL OF THE FORMATTED VERSION OF EACH ENTRY TYPE APPEARS AT   */ 18620000
*/*!THE HEAD OF THE ENTRY:                                           */ 18630000
*/*!                                                                 */ 18640000
*/*!PR ASID TCB ID   CD/D PSW ADDR U1 U2 U3 CLHS LOCAL PASD SASD TIME*/ 18650000
*/*!                               U4 U5 U6 CLHSE                    */ 18660000
*/*!                                                                 */ 18670000
*/*!                                                                 */ 18680000
*/*!THE <PR> FIELD IS THE PROCESSOR ID, WHICH IS NOT CONTAINED IN THE*/ 18690000
*/*!ENTRY, BUT IS IMPLIED BY ASSOCIATION OF THE CONTAINING TRACE     */ 18700000
*/*!BUFFER WITH A PROCESSOR.                                         */ 18710000
*/*!                                                                 */ 18720000
*/*!THE <ASID> FIELD IS THE HOME OR RELATED ASID, WHICH IS CONTAINED */ 18730000
*/*!IN AN EXPLICIT TRACE ENTRY AND IS IMPLIED FROM THE PREVIOUS HOME */ 18740000
*/*!ASID FOR AN ASID (PC, PT OR SSAR) OR BRANCH ENTRY.               */ 18750000
*/*!                                                                 */ 18760000
*/*!THE <TCB> FIELD IS THE TCB OR RELATED TCB ADDRESS, WHICH IS      */ 18770000
*/*!CONTAINED IN AN EXPLICIT TRACE ENTRY AND IS IMPLIED FROM THE     */ 18780000
*/*!PREVIOUS TCB FOR AN ASID OR BRANCH ENTRY.                        */ 18790000
*/*!                                                                 */ 18800000
*/*!THE <TIME> FIELD IS COMPOSED FROM THE TIMESTAMP ASSOCIATED WITH  */ 18810000
*/*!THE CONTAINING TRACE BUFFER AND THE PARTIAL TIMESTAMP IN THE     */ 18820000
*/*!EXPLICIT ENTRY.                                                  */ 18830000
*/*!                                                                 */ 18840000
*/*!ALL OTHER FIELDS ARE CONTAINED IN THE PARTICULAR TTE.            */ 18850000
*/*!                                                                 */ 18860000
*/*!                                                                 */ 18870000
*/*!                                                                 */ 18880000
*/*!TTE FIELD COMMENTS INDICATE:                                     */ 18890000
*/*!                                                                 */ 18900000
*/*! WHERE A TTE FIELD APPEARS IN THE FORMATTED VERSION OF THE TTE   */ 18910000
*/*! <FORMAT FIELD>.                                                 */ 18920000
*/*! THE CONTENTS OF THE FIELD.                                      */ 18930000
*/*! THE SOURCE OF DATA IN THE FIELD.  (RX) INDICATES THE REGISTER X */ 18940000
*/*! ON INPUT TO THE PTRACE MACRO.  A RIGHT ARROW (->) INDICATES     */ 18950000
*/*! THE INDIRECT ADDRESSING USED TO OBTAIN THE DATA.                */ 18960000
*/*!                                                                 */ 18970000
*/*!                                                                 */ 18980000
* %IHATTE_DEF1 = 'DEFINED(TTE)';                                        18990000
* %IF IBM_CPSI = 'YES' %THEN                                            19000000
*   %IHATTE_DEF1 = 'BASED';                                             19010000
* %IHATTE_DEF2 = 'DEFINED(TTEUNQ)';                                     19011000
* %IF IBM_CPSI = 'YES' %THEN                                            19012000
*   %IHATTE_DEF2 = 'BASED';                                             19013000
* %IHATTE_DEF3 = 'DEFINED(TTEEUNQ)';                                    19013100
* %IF IBM_CPSI = 'YES' %THEN                                            19013200
*   %IHATTE_DEF3 = 'BASED';                                             19013300
* %IF IBM_CBGENC = 'YES' %THEN %TTEALL = 'YES';                         19013400
* %IF IBM_CPSI = 'YES' %THEN %TTEALL = 'YES';                           19013500
*                                                                       19013600
*%TTELBR:                                                               19013700
*   IF TTEALL ^= 'YES'                                                  19013800
*      %THEN                                                            19013900
*     %IF TTEBR ^= 'YES' %THEN                                          19014000
*       %GO TO ENDBR;                                                   19015000
*                                                                       19016000
*/*!BR - BRANCH TTE                                                  */ 19017000
*/*!                                                                 */ 19018000
*/*!                                                                 */ 19019000
*/*!FORMATTED BR TTE(S):                                             */ 19020000
*/*!                                                                 */ 19030000
*/*!PR ASID TCB BR        PSW ADDR U1 U2 U3 CLHS LOCAL               */ 19040000
*/*!                                                                 */ 19050000
*                                                                       19060000
*   DECLARE                                                             19070000
*     TTETBR24 FIXED(8) CONSTANT(0), /* 24-BIT BRANCH TTE TYPE          19080000
*                                      (X'00').                      */ 19090000
*     1    TTEBRNCH IHATTE_DEF1 BOUNDARY(WORD), /* BRANCH TRACE         19100000
*                                      TABLE ENTRY.                  */ 19110000
*       3    TTEBRA31 POINTER(31),  /* <MULTIPLE BRANCH ENTRIES CAN     19120000
*                                      APPEAR IN FIELDS PSW, ADDR,      19130000
*                                      U1, U2, U3, CLHS AND LOCAL>.     19140000
*                                      31-BIT ADDRESS.               */ 19150000
*         5    TTEBRTYP FIXED(8),   /* TRACE TABLE ENTRY TYPE (X'00':   19160000
*                                      24-BIT ADDRESS, X'80'-X'FF':     19170000
*                                      31-BIT ADDRESS).              */ 19180000
*           7    TTEBRMOD BIT(1),   /* ADDRESSING MODE INDICATOR. BIT   19190000
*                                      0. IF 1, BITS 1-31 CONTAIN       19200000
*                                      31-BIT ADDRESS. IF 0 AND BITS    19210000
*                                      1-7 ARE ZERO, BITS 8-31          19220000
*                                      CONTAIN 24-BIT ADDRESS.       */ 19230000
*         5    TTEBRA24 POINTER(24), /* <MULPTIPLE BRANCH ENTRIES CAN   19240000
*                                      APPEAR IN FIELDS PSW, ADDR,      19250000
*                                      U1, U2, U3, CLHS AND LOCAL>.     19260000
*                                      24-BIT ADDRESS.               */ 19270000
*       3    TTEBREND CHARACTER(0) BOUNDARY(WORD); /* END OF BRANCH     19280000
*                                      TTE.                          */ 19290000
*%ENDBR:                                                                19300000
*   IF TTEALL ^= 'YES'                                                  19310000
*      %THEN                                                            19320000
*     %IF TTEMO ^= 'YES' %THEN                                          19330000
*       %GO TO ENDMODE;                                                 19340000
*                                                                       19350000
*/*!TTE for Mode Switch, Mode-Switching Branch, and Branch to        */ 19360000
*/*!    an address larger than 31 bits.                              */ 19370000
*/*!                                                                 */ 19380000
*/*!Formatted TTEs:                                                  */ 19390000
*/*!                                                                 */ 19400000
*/*!PR ASID TCB MODE  ... 24 or 31 address                           */ 19410000
*/*!PR ASID TCB MODE  ... 64       address                           */ 19420000
*/*!PR ASID TCB MODE  ... 64       address_address                   */ 19430000
*/*!PR ASID TCB MOBR  ... 24       address                           */ 19440000
*/*!PR ASID TCB MOBR  ... 31       address                           */ 19450000
*/*!PR ASID TCB MOBR  ... 64       address                           */ 19460000
*/*!PR ASID TCB MOBR  ... 64       address_address                   */ 19470000
*/*!                                                                 */ 19480000
*                                                                       19490000
*   DECLARE                                                             19500000
*     TTETM51  FIXED(8) CONSTANT(81), /* TTE Type X'51'          @P3C*/ 19510000
*     TTETM52  FIXED(8) CONSTANT(82), /* TTE Type X'52'          @P3C*/ 19520000
*     TTEMSF1  BIT(8) CONSTANT('30'X), /* Format 1 Mode Switch   @P3C*/ 19530000
*     TTEMSF2  BIT(8) CONSTANT('20'X), /* Format 2 Mode Switch   @P3C*/ 19540000
*     TTEMSF3  BIT(8) CONSTANT('60'X), /* Format 3 Mode Switch   @P3C*/ 19550000
*     TTEMSBF1 BIT(8) CONSTANT('A0'X), /* Format 1 Mode-Switching       19560000
*                                      Branch                    @P3C*/ 19570000
*     TTEMSBF2 BIT(8) CONSTANT('B0'X), /* Format 2 Mode-Switching       19580000
*                                      Branch                    @P3C*/ 19590000
*     TTEMSBF3 BIT(8) CONSTANT('F0'X), /* Format 3 Mode-Switching       19600000
*                                      Branch                    @P3C*/ 19610000
*     TTEMBF3  BIT(8) CONSTANT('C0'X), /* Format 3 Branch        @P3C*/ 19620000
*     1    TTEM5152 IHATTE_DEF1 BOUNDARY(WORD), /* Trace Table Entry    19630000
*                                      for type X'51' and X'52'  @P3C*/ 19640000
*       3    TTEM1TYP CHARACTER(1), /* X'51' or X'52 '           @P3C*/ 19650000
*       3    TTEMFMT  BIT(8),       /* Format indicator          @P3C*/ 19660000
*         5    *        BIT(4),     /* Format indicator          @P3C*/ 19670000
*         5    *        BIT(4),     /* 0'S                       @P3C*/ 19680000
*       3    *        BIT(16),      /* 0'S                       @L9A*/ 19690000
*       3    TTEMADRH POINTER(31),  /* 31 bit address, or high order    19700000
*                                      half of 64 bit address    @P3C*/ 19710000
*         5    TTEMAMD  BIT(1),     /* Amode in F1 Mode Switch and F1   19720000
*                                      Mode-Switching Branch     @P3C*/ 19730000
*       3    TTEMADRL POINTER(31),  /* Low order half of 64 bit         19740000
*                                      address                   @P3C*/ 19750000
*       3    TTEMOEND CHARACTER(0) BOUNDARY(WORD); /* END OF MODE       19760000
*                                      TTE.                      @P3C*/ 19770000
*%ENDMODE:                                                              19780000
*   IF TTEALL ^= 'YES'                                                  19790000
*      %THEN                                                            19800000
*     %IF TTEAS ^= 'YES' %THEN                                          19810000
*       %GO TO ENDAS;                                                   19820000
*                                                                       19830000
*/*!PC - PROGRAM CALL TTE                                            */ 19840000
*/*!                                                                 */ 19850000
*/*!                                                                 */ 19860000
*/*!FORMATTED PC TTE:                                                */ 19870000
*/*!                                                                 */ 19880000
*/*!PR ASID TCB PC    ... PSW ADDR U1                                */ 19890000
*/*!                                                                 */ 19900000
*                                                                       19910000
*   DECLARE                                                             19920000
*     TTETPC   FIXED(8) CONSTANT(33), /* PC TTE TYPE (X'21').        */ 19930000
*     1    TTEPC    IHATTE_DEF1 BOUNDARY(WORD), /* PC TRACE TABLE       19940000
*                                      ENTRY.                        */ 19950000
*       3    TTEPCTYP FIXED(8),     /* PC TRACE TABLE ENTRY TYPE        19960000
*                                      (X'21').                      */ 19970000
*       3    TTEPCPKN CHARACTER(3), /* <PSW, U1>. <PSW> PSW KEY IN      19980000
*                                      BITS 0-3 AND <U1> PC NUMBER IN   19990000
*                                      BITS 4-23.                    */ 20000000
*         5    TTEPCPKY BIT(4),     /* PSW KEY.                      */ 20010000
*       3    TTEPCADR POINTER(31),  /* <ADDR>. RETURN ADDRESS FROM      20020000
*                                      THE PC INSTRUCTION.           */ 20030000
*         5    TTEPCAB1 BIT(8),     /* BYTE 1 OF ADDRESS.            */ 20040000
*           7    TTEPCAMD BIT(1),   /* OLD ADDRESSING MODE BIT FROM     20050000
*                                      PSW BEFORE THE PC INSTRUCTION.   20060000
*                                      BIT 0.                        */ 20070000
*         5    *        CHARACTER(2), /* BYTES 2 AND 3 OF ADDRESS.   */ 20080000
*         5    TTEPCAB4 BIT(8),     /* BYTE 4 OF ADDRESS.            */ 20090000
*           7    *        BIT(7),   /* RESERVED.                     */ 20100000
*           7    TTEPCPS  BIT(1),   /* PROBLEM STATE BIT BEFORE THE     20110000
*                                      PC INSTRUCTION. BIT 31.       */ 20120000
*       3    TTEPCEND CHARACTER(0) BOUNDARY(WORD), /* END OF PC TTE. */ 20130000
*     TTETPC64 FIXED(8) CONSTANT(34), /* PC64 TTE TYPE (X'22').  @L9A*/ 20140000
*     1    TTEPC64  IHATTE_DEF1 BOUNDARY(WORD), /* PC64 TRACE TABLE     20150000
*                                      ENTRY.                    @L9A*/ 20160000
*       3    TTEP6TYP FIXED(8),     /* PC64 TRACE TABLE ENTRY TYPE      20170000
*                                      (X'22').                  @L9A*/ 20180000
*       3    TTEP6PKN CHARACTER(3), /* <PSW, U1>. <PSW> PSW KEY IN      20190000
*                                      BITS 0-3 AND <U1> PC NUMBER IN   20200000
*                                      BITS 4-23. BIT 4 = 0.     @L9A*/ 20210000
*         5    TTEP6PKY BIT(4),     /* PSW KEY.                  @L9A*/ 20220000
*       3    TTEP6ADL POINTER(32),  /* <ADDR> Left half address  @P3A*/ 20230000
*       3    TTEP6ADR POINTER(32),  /* <ADDR>. RETURN ADDRESS FROM      20240000
*                                      THE PC INSTRUCTION.       @L9A*/ 20250000
*         5    TTEP6AB1 BIT(8),     /* BYTE 1 OF ADDRESS.        @L9A*/ 20260000
*         5    *        CHARACTER(2), /* BYTES 2 AND 3 OF ADDRESS.   */ 20270000
*         5    TTEP6AB4 BIT(8),     /* BYTE 4 OF ADDRESS.        @L9A*/ 20280000
*           7    *        BIT(7),   /* RESERVED.                 @L9A*/ 20290000
*           7    TTEP6PS  BIT(1),   /* PROBLEM STATE BIT BEFORE THE     20300000
*                                      PC INSTRUCTION. BIT 31.       */ 20310000
*       3    TTEP6END CHARACTER(0) BOUNDARY(WORD) /* END OF PC64 TTE.   20320000
*                                                                @LEC*/ 20330000
*                %IF SYSVERSION = '' %THEN                              20340000
*              %GOTO IHATTE_NOTPLX1; /*                          @LEA*/ 20350000
*   ,1 TTEPC64A IHATTE_DEF1 BOUNDARY(WORD) /* PC64 ALR TTE when         20360000
*                                      address < 2G              @LEA*/ 20370000
*       ,3 TTEPC64ATYP FIXED(8)     /* PC64 TRACE TABLE ENTRY TYPE      20380000
*                                      (X'22').                  @LEA*/ 20390000
*       ,3 TTEPC64AFLAGS CHAR(1)    /* <PSW, U1>. <PSW> PSW KEY IN      20400000
*                                      BITS 0-3 AND <U1> SUBTYPE IN     20410000
*                                      BITS 4-7.                 @LEA*/ 20420000
*       ,5 TTEPC64APKY BIT(4)       /* PSW KEY.                  @LEA*/ 20430000
*       ,5 TTEPC64ASUBTYPE BIT(4)   /* 100E or 101E              @LEA*/ 20440000
*       ,7 TTEPC64APC32 BIT(1)      /* 1 when PC # 32-bits       @LEA*/ 20450000
*       ,7 TTEPC64ARA031NZ BIT(1)   /* 1 when return address bits       20460000
*                                      0-31 not all zero         @LEA*/ 20470000
*       ,7 TTEPC64AP31W1 BIT(1)     /* 1 when PSW bit 31 was 1   @LEA*/ 20480000
*       ,7 TTEPC64AP31R1 BIT(1)     /* 1 when PSW bit 31 was replaced   20490000
*                                      by 1                      @LEA*/ 20500000
*       ,3 * CHAR(2)                /* Zeroes                    @LEA*/ 20510000
*       ,3 TTEPC64AADR POINTER(32)  /* <ADDR>. RETURN ADDRESS FROM      20520000
*                                      THE PC INSTRUCTION.       @LEA*/ 20530000
*       ,5 TTEPC64AAB1 BIT(8)       /* BYTE 1 OF ADDRESS.        @LEA*/ 20540000
*       ,5 * CHARACTER(2)           /* BYTES 2 AND 3 OF ADDRESS.     */ 20550000
*       ,5 TTEPC64AAB4 BIT(8)       /* BYTE 4 OF ADDRESS.        @LEA*/ 20560000
*       ,7 * BIT(7)                 /* RESERVED.                 @LEA*/ 20570000
*       ,7 TTEPC64APS BIT(1)        /* PROBLEM STATE BIT BEFORE THE     20580000
*                                      PC INSTRUCTION. BIT 31.       */ 20590000
*       ,3 TTEPC64APCN FIXED(32)    /* PC Number                 @LEA*/ 20600000
*       ,3 TTEPC64AEND CHARACTER(0) BOUNDARY(WORD) /* END OF PC64       20610000
*                                      TTE.                      @LEA*/ 20620000
*       ,TTETPC64R FIXED(8) CONSTANT(35) /* PC64 ASN-and-LX-Reuse       20630000
*                                                                @LEA*/ 20640000
*       ,1 TTEPC64R IHATTE_DEF1 BOUNDARY(WORD) /* PC64 ALR TTE   @LEA*/ 20650000
*       ,3 TTEPC64RTYP FIXED(8)     /* PC64 TRACE TABLE ENTRY TYPE      20660000
*                                      (X'23').                  @LEA*/ 20670000
*       ,3 TTEPC64RFLAGS CHAR(1)    /* <PSW, U1>. <PSW> PSW KEY IN      20680000
*                                      BITS 0-3 AND <U1> SUBTYPE IN     20690000
*                                      BITS 4-7.                 @LEA*/ 20700000
*       ,5 TTEPC64RPKY BIT(4)       /* PSW KEY.                  @LEA*/ 20710000
*       ,5 TTEPC64RSUBTYPE BIT(4)   /* 111E                      @LEA*/ 20720000
*       ,7 TTEPC64RPC32 BIT(1)      /* 1 when PC # 32-bits       @LEA*/ 20730000
*       ,7 TTEPC64RRA031NZ BIT(1)   /* 1 when return address bits       20740000
*                                      0-31 not all zero         @LEA*/ 20750000
*       ,7 TTEPC64RP31W1 BIT(1)     /* 1 when PSW bit 31 was 1   @LEA*/ 20760000
*       ,7 TTEPC64RP31R1 BIT(1)     /* 1 when PSW bit 31 was replaced   20770000
*                                      by 1                      @LEA*/ 20780000
*       ,3 * CHAR(2)                /* Zeroes                    @LEA*/ 20790000
*       ,3 TTEPC64RADL POINTER(32)  /* <ADDR> Left half address  @P3A*/ 20800000
*       ,3 TTEPC64RADR POINTER(32)  /* <ADDR>. RETURN ADDRESS FROM      20810000
*                                      THE PC INSTRUCTION.       @LEA*/ 20820000
*       ,5 TTEPC64RAB1 BIT(8)       /* BYTE 1 OF ADDRESS.        @LEA*/ 20830000
*       ,5 * CHARACTER(2)           /* BYTES 2 AND 3 OF ADDRESS.     */ 20840000
*       ,5 TTEPC64RAB4 BIT(8)       /* BYTE 4 OF ADDRESS.        @LEA*/ 20850000
*       ,7 * BIT(7)                 /* RESERVED.                 @LEA*/ 20860000
*       ,7 TTEPC64RPS BIT(1)        /* PROBLEM STATE BIT BEFORE THE     20870000
*                                      PC INSTRUCTION. BIT 31.       */ 20880000
*       ,3 TTEPC64RPCN FIXED(32)    /* PC Number                 @LEA*/ 20890000
*       ,3 TTEPC64REND CHARACTER(0) BOUNDARY(WORD) /* END OF PC64       20900000
*                                      TTE.                      @LEA*/ 20910000
*       %IHATTE_NOTPLX1:;           /*                           @LEA*/ 20920000
*   ;                                                                   20930000
*                                                                       20940000
*/*!PR - PROGRAM RETURN TTE                                          */ 20950000
*/*!                                                                 */ 20960000
*/*!                                                                 */ 20970000
*/*!FORMATTED PR TTE:                                                */ 20980000
*/*!                                                                 */ 20990000
*/*!PR ASID TCB PR    ... PSW ADDR U1                  PASD SASD     */ 21000000
*/*!                                                                 */ 21010000
*                                                                       21020000
*   DECLARE                                                             21030000
*     TTETPR   FIXED(8) CONSTANT(50), /* PR TTE TYPE (X'32').    @L2A*/ 21040000
*     TTEPRL   CONSTANT(12),        /* Length for type X'32'     @P4A*/ 21050000
*     TTETPR2  FIXED(8) CONSTANT(51), /* PR TTE TYPE (X'33').    @P3A*/ 21060000
*     TTEPR2L  CONSTANT(16),        /* Length for type X'33'     @P4A*/ 21070000
*     TTETPR3  FIXED(8) CONSTANT(52), /* PR TTE TYPE (X'34').    @P3A*/ 21080000
*     TTEPR3L  CONSTANT(20),        /* Length for type X'34'     @P4A*/ 21090000
*     1    TTEPR    IHATTE_DEF1 BOUNDARY(WORD), /* PR TRACE TABLE       21100000
*                                      ENTRY.                    @L2A*/ 21110000
*                                                                       21120000
*/*                                                                  */ 21130000
*/*    ------------------------------------------------------------- */ 21140000
*/*    All PR entries have an initial word having the same format    */ 21150000
*/*    ------------------------------------------------------------- */ 21160000
*/*                                                                  */ 21170000
*                                                                       21180000
*      2    TTEPRbase,              /* Common fields             @P4A*/ 21190000
*       3    TTEPRTYP FIXED(8),     /* PR TRACE TABLE ENTRY TYPE @L2A*/ 21200000
*       3    TTEPRPKY FIXED(8),     /* <PSW>. PSW KEY IN BITS 0-3.      21210000
*                                                                @L9C*/ 21220000
*        4    TTEPRKY  BIT(4),      /* PSW key                   @P4A*/ 21230000
*        4    TTEPRT   BIT(2),      /* To info                   @P4A*/ 21240000
*         5    TTEPR6M  BIT(1),     /* 64-bit mode               @P4A*/ 21250000
*         5    TTEPR6A  BIT(1),     /* 64-bits present in entry  @P4A*/ 21260000
*        4    TTEPRF   BIT(2) LIKE(TTEPRT), /* From info         @P4A*/ 21270000
*       3    TTEPRASD FIXED(16),    /* NEW ASID SPECIFIED BY THE PR     21280000
*                                      INSTRUCTION.              @L2A*/ 21290000
*                                                                       21300000
*/*                                                                  */ 21310000
*/*    ------------------------------------------------------------- */ 21320000
*/*    The remainder consists of two addresses that may be 31-bit    */ 21330000
*/*    or 64-bit addresses.  Addressing mode and problem state data  */ 21340000
*/*    also appears.                                                 */ 21350000
*/*    ------------------------------------------------------------- */ 21360000
*/*                                                                  */ 21370000
*                                                                       21380000
*      2    *        UNION BOUNDARY(WORD), /* 31/64-bit initial         21390000
*                                      address                   @P4A*/ 21400000
*                                                                       21410000
*/*                                                                  */ 21420000
*/*     ------------------------------------------------------------ */ 21430000
*/*     The older PR entries start with 31-bit addresses             */ 21440000
*/*     ------------------------------------------------------------ */ 21450000
*/*                                                                  */ 21460000
*                                                                       21470000
*       3    TTEPRF31 BOUNDARY(WORD), /* Starts with 31-bit addr @P4A*/ 21480000
*        4    TTEPRTAD POINTER(31), /* <ADDR>. NEW INSTRUCTION          21490000
*                                      ADDRESS AS UPDATED BY THE PR     21500000
*                                      INSTRUCTION.              @P4C*/ 21510000
*         5    TTEPRTB1 BIT(8),     /* BYTE 1 OF ADDRESS.        @L2A*/ 21520000
*           7    TTEPRAM1 BIT(1),   /* ADDRESSING MODE BIT FROM THE     21530000
*                                      PSW AS UPDATED BY THE PR         21540000
*                                      INSTRUCTION. BIT 0.       @L2A*/ 21550000
*         5    *        CHARACTER(2), /* BYTES 2 AND 3 OF ADDRESS.      21560000
*                                                                @L2A*/ 21570000
*         5    TTEPRTB4 BIT(8),     /* BYTE 4 OF ADDRESS.        @L2A*/ 21580000
*           7    *        BIT(7),   /* RESERVED.                 @L2A*/ 21590000
*           7    TTEPRPS  BIT(1),   /* PROBLEM STATE BIT AFTER          21600000
*                                      COMPLETION OF THE PR             21610000
*                                      INSTRUCTION. BIT 31.      @L2A*/ 21620000
*                                                                       21630000
*/*                                                                  */ 21640000
*/*      ----------------------------------------------------------- */ 21650000
*/*      Either a 32-bit or a 64-bit address may appear after the    */ 21660000
*/*      64-bit address in the older PR entries.                     */ 21670000
*/*      ----------------------------------------------------------- */ 21680000
*/*                                                                  */ 21690000
*                                                                       21700000
*        4    *        UNION BOUNDARY(WORD), /* 31/64-bit final         21710000
*                                      address                   @P4A*/ 21720000
*         5    TTEPRFAD POINTER(31), /* <U1>. ADDRESS OF THE LOCATION   21730000
*                                      FOLLOWING THE PR INSTRUCTION.    21740000
*                                                                @P4C*/ 21750000
*         5    TTEPRFA6 CHARACTER(8), /* <U1>. ADDRESS OF THE           21760000
*                                      LOCATION FOLLOWING THE PR        21770000
*                                      INSTRUCTION.              @P4C*/ 21780000
*                                                                       21790000
*/*                                                                  */ 21800000
*/*     ------------------------------------------------------------ */ 21810000
*/*     The newer PR entries start with 64-bit addresses.            */ 21820000
*/*     ------------------------------------------------------------ */ 21830000
*/*                                                                  */ 21840000
*                                                                       21850000
*       3    TTEPRF64 BOUNDARY(WORD), /* Starts with 64-bit addr @P4A*/ 21860000
*        4    TTEPRTA6 CHARACTER(8), /* <ADDR>. NEW INSTRUCTION         21870000
*                                      ADDRESS AS UPDATED BY THE PR     21880000
*                                      INSTRUCTION.              @P4C*/ 21890000
*         5    *        CHARACTER(7), /* BYTES 2 AND 3 OF ADDRESS.      21900000
*                                                                @L2A*/ 21910000
*         5    TTEPRTB8 BIT(8),     /* BYTE 4 OF ADDRESS.        @L2A*/ 21920000
*           7    *        BIT(7),   /* RESERVED.                 @L2A*/ 21930000
*           7    TTEPRPS8 BIT(1),   /* PROBLEM STATE BIT AFTER          21940000
*                                      COMPLETION OF THE PR             21950000
*                                      INSTRUCTION. BIT 31.      @L2A*/ 21960000
*                                                                       21970000
*/*                                                                  */ 21980000
*/*      ----------------------------------------------------------- */ 21990000
*/*      Either a 32-bit or a 64-bit address may appear after the    */ 22000000
*/*      64-bit address in the newer PR entries.                     */ 22010000
*/*      ----------------------------------------------------------- */ 22020000
*/*                                                                  */ 22030000
*                                                                       22040000
*        4    *        UNION BOUNDARY(WORD), /* 31/64-bit final         22050000
*                                      address                   @P4A*/ 22060000
* %IF IBM_CBGENC = 'YES' %THEN                                          22070000
*   %GOTO IHATTE_1A;                                                    22080000
*         5    TTEPRFA6 POINTER(31), /* <U1>. ADDRESS OF THE LOCATION   22090000
*                                      FOLLOWING THE PR INSTRUCTION.    22100000
*                                                                @P4C*/ 22110000
*         5    TTEPRF66 CHARACTER(8), /* <U1>. ADDRESS OF THE           22120000
*                                      LOCATION FOLLOWING THE PR        22130000
*                                      INSTRUCTION.              @P4C*/ 22140000
*   %GOTO IHATTE_1B;                                                    22150000
* %IHATTE_1A:;                                                          22160000
*         5    TTEPRF64AD POINTER(31), /* <U1>. ADDRESS OF THE LOCATION 22170000
*                                      FOLLOWING THE PR INSTRUCTION.    22180000
*                                                                @P4C*/ 22190000
*         5    TTEPRF64A6 CHARACTER(8), /* <U1>. ADDRESS OF THE         22200000
*                                      LOCATION FOLLOWING THE PR        22210000
*                                      INSTRUCTION.              @P4C*/ 22211000
* %IHATTE_1B:;                                                          22212000
*       3    TTEPREND CHARACTER(0) BOUNDARY(WORD); /* END OF PR TTE.    22213000
*                                                                @L2A*/ 22214000
*                                                                       22215000
*/*!PT - PROGRAM TRANSFER TTE                                        */ 22216000
*/*!                                                                 */ 22217000
*/*!                                                                 */ 22218000
*/*!FORMATTED PT TTE:                                                */ 22219000
*/*!                                                                 */ 22220000
*/*!PR ASID TCB PT    ... PSW ADDR U1                  PASD SASD     */ 22230000
*/*!                                                                 */ 22240000
*                                                                       22250000
*   DECLARE                                                             22260000
*     TTETPT   FIXED(8) CONSTANT(49), /* PT TTE TYPE (X'31').        */ 22270000
*                                                                       22280000
*/*   -------------------------------------------------------------- */ 22290000
*/*   TTETPT2  FIXED(8) CONSTANT(50), ** PT TTE TYPE (X'32').        */ 22300000
*/*   Note: Entry type 32x is used for both PC and PT.  System trace */ 22310000
*/*         code sensitive to this byte initially considers the      */ 22320000
*/*         entry type as a PC entry type, correcting matters later. */ 22330000
*/*   -------------------------------------------------------------- */ 22340000
*                                                                       22350000
*     1    TTEPT    IHATTE_DEF1 BOUNDARY(WORD), /* PT TRACE TABLE       22360000
*                                      ENTRY.                        */ 22370000
*       3    TTEPTTYP FIXED(8),     /* PT TRACE TABLE ENTRY TYPE        22380000
*                                      (X'31').                      */ 22390000
*       3    TTEPTPKY FIXED(8),     /* <PSW>. PSW KEY IN BITS 0-3.      22400000
*                                                                @L9C*/ 22410000
*        4    TTEPTKY  BIT(4),      /* PSW key                   @P4A*/ 22420000
*        4    TTEPTT   BIT(2),      /* To info                   @P4A*/ 22430000
*         5    TTEPT6M  BIT(1),     /* 64-bit mode               @P4A*/ 22440000
*         5    TTEPT6A  BIT(1),     /* 64-bits present in entry  @P4A*/ 22450000
*        4    *        BIT(1),      /* 00                        @LEC*/ 22460000
*        4    TTEPTI   BIT(1),      /* PTI (not PT) when on      @LEA*/ 22470000
*       3    TTEPTASD FIXED(16),    /* <U1, PASD AND SASD>. NEW ASID    22480000
*                                      SPECIFIED BY THE PT              22490000
*                                      INSTRUCTION.                  */ 22500000
*       3    TTEPTADR POINTER(31),  /* <ADDR>. NEW INSTRUCTION          22510000
*                                      ADDRESS AS UPDATED BY THE PT     22520000
*                                      INSTRUCTION.                  */ 22530000
*         5    TTEPTAB1 BIT(8),     /* BYTE 1 OF ADDRESS.            */ 22540000
*           7    TTEPTAMD BIT(1),   /* ADDRESSING MODE BIT FROM THE     22550000
*                                      PSW AS UPDATED BY THE PT         22560000
*                                      INSTRUCTION. BIT 0.           */ 22570000
*         5    *        CHARACTER(2), /* BYTES 2 AND 3 OF ADDRESS.   */ 22580000
*         5    TTEPTAB4 BIT(8),     /* BYTE 4 OF ADDRESS.            */ 22590000
*           7    *        BIT(7),                                       22600000
*           7    TTEPTPS  BIT(1),   /* PROBLEM STATE BIT AFTER          22610000
*                                      COMPLETION OF THE PT             22620000
*                                      INSTRUCTION. BIT 31.          */ 22630000
*       3    TTEPTEND CHARACTER(0) BOUNDARY(WORD); /* END OF PT TTE. */ 22640000
*                                                                       22650000
*/*!SSAR - SET SECONDARY ASN TTE                                     */ 22660000
*/*!                                                                 */ 22670000
*/*!                                                                 */ 22680000
*/*!FORMATTED SSAR TTE:                                              */ 22690000
*/*!                                                                 */ 22700000
*/*!PR ASID TCB SSAR  ... PSW                               SASD     */ 22710000
*/*!                                                                 */ 22720000
*                                                                       22730000
*   DECLARE                                                             22740000
*     TTETSSAR FIXED(8) CONSTANT(16), /* SSAR TTE TYPE (X'10').      */ 22750000
*     1    TTESSAR  IHATTE_DEF1 BOUNDARY(WORD), /* SSAR TRACE TABLE     22760000
*                                      ENTRY.                        */ 22770000
*       3    TTESSTYP FIXED(8),     /* SSAR TRACE TABLE ENTRY TYPE      22780000
*                                      (X'10').                      */ 22790000
*       3    TTESSRSV BIT(7),       /* RESERVED.                 @LEC*/ 22800000
*       3    TTESSAIR BIT(1),       /* SSAIR (not SSAR) when on  @LEA*/ 22810000
*       3    TTESSASD FIXED(16),    /* <PSW AND SASD>. NEW SASID FROM   22820000
*                                      SSAR INSTRUCTION.             */ 22830000
*       3    TTESSEND CHARACTER(0) BOUNDARY(WORD); /* END OF SSAR       22840000
*                                      TTE.                          */ 22850000
*                                                                       22860000
*/*!BSG  - BRANCH IN SUBSPACE GROUP                              @L7A*/ 22870000
*/*!                                                                 */ 22880000
*/*!                                                                 */ 22890000
*/*!FORMATTED BSG TTE:                                               */ 22900000
*/*!                                                                 */ 22910000
*/*!PR ASID TCB BSG   ... PSW ADDR                                   */ 22920000
*/*!                                                                 */ 22930000
*                                                                       22940000
*   DECLARE                                                             22950000
*     TTETBSG  FIXED(8) CONSTANT(65), /* BSG TTE TYPE (X'41').   @L7A*/ 22960000
*     1    TTEBSG   IHATTE_DEF1 BOUNDARY(WORD), /* BSG TRACE TABLE      22970000
*                                      ENTRY.                    @L7A*/ 22980000
*       3    TTEBSTYP FIXED(8),     /* BSG TRACE TABLE ENTRY (X'41').   22990000
*                                                                @L7A*/ 23000000
*       3    TTEBSALT CHARACTER(3), /* <PSW>. BITS 7 AND 9-31 OF THE    23010000
*                                      ALET USED DURING THE BSG         23020000
*                                      EXECUTION.                @L7A*/ 23030000
*         5    TTEBSAP  BIT(1),     /* BIT 7 OF THE ALET USED DURING    23040000
*                                      THE BSG EXECUTION (PASN-AL       23050000
*                                      INDICATOR).               @L7A*/ 23060000
*       3    TTEBSADR POINTER(31),  /* <ADDR>. THE AMODE AND BITS       23070000
*                                      1-31 OF THE INSTRUCTION          23080000
*                                      ADDRESS USED AS THE TARGET       23090000
*                                      LOCATION OF THE BSG.      @L7A*/ 23100000
*         5    TTEBSMOD BIT(1),     /* IF THIS BIT IS ON AMODE IS 31    23110000
*                                      OTHERWISE IT IS AMODE 24. @L7A*/ 23120000
*       3    TTEBSEND CHARACTER(0) BOUNDARY(WORD), /* END OF BSG TTE.   23130000
*                                                                @L7A*/ 23140000
*     TTETBS64 FIXED(8) CONSTANT(66), /* BGS64 TTE TYPE (X'42'). @L9A*/ 23150000
*     1    TTEBSG64 IHATTE_DEF1 BOUNDARY(WORD), /* BSG64 TRACE TABLE    23160000
*                                      ENTRY.                    @L9A*/ 23170000
*       3    TTEB6TYP FIXED(8),     /* BSG TRACE TABLE ENTRY (X'42').   23180000
*                                                                @L9A*/ 23190000
*       3    TTEB6ALT CHARACTER(3), /* <PSW>. BITS 7 AND 9-31 OF THE    23200000
*                                      ALET USED DURING THE BSG         23210000
*                                      EXECUTION.                @L9A*/ 23220000
*         5    TTEB6AP  BIT(1),     /* BIT 7 OF THE ALET USED DURING    23230000
*                                      THE BSG EXECUTION (PASN-AL       23240000
*                                      INDICATOR).               @L9A*/ 23250000
*       3    TTEB6ADR AsaxmacP64 BDY(WORD), /* <ADDR>. Instruction      23260000
*                                      address used as the target       23270000
*                                      location of the BSG       @P6C*/ 23280000
*       3    TTEB6END CHARACTER(0) BOUNDARY(WORD); /* END OF BSG64      23290000
*                                      TTE.                      @L9A*/ 23300000
*%ENDAS:                                                                23310000
*   ;                                                                   23320000
*                                                                       23330000
*/*!GENERAL EXPLICIT TTE                                             */ 23340000
*/*!                                                                 */ 23350000
*/*!                                                                 */ 23360000
*/*!GENERAL FORMAT FOR AN EXPLICIT TTE:                              */ 23370000
*/*!                                                                 */ 23380000
*/*!PR ASID TCB ID   CD/D PSW ADDR U1 U2 U3 CLHS LOCAL PASD SASD TIME*/ 23390000
*/*!                               U4 U5 U6                          */ 23400000
*                                                                       23410000
*   DECLARE                                                             23420000
*     TTETEX   FIXED(8) CONSTANT(112), /* EXPLICIT TTE TYPE (X'7N'). */ 23430000
*     TTEMEX   FIXED(8) CONSTANT(240), /* MASK FOR EXPLICIT TTE TYPE.   23440000
*                                      (X'F0').                      */ 23450000
*     TTEMSID  FIXED(8) CONSTANT(15), /* MASK FOR EXPLICIT TTE          23460000
*                                      SUB-ID. (X'0F').              */ 23470000
*     1    TTEXP    IHATTE_DEF1 BOUNDARY(WORD), /* EXPLICIT TRACE       23480000
*                                      TABLE ENTRY.                  */ 23490000
*       3    TTETYPE  BIT(8),       /* TRACE TABLE ENTRY TYPE           23500000
*                                      (X'7N').                      */ 23510000
*         5    *        BIT(4),     /* (ALWAYS X'7' FOR EXPLICITS)   */ 23520000
*         5    TTEREGS  BIT(4),     /* ONE LESS THAN THE NUMBER OF      23530000
*                                      REGISTERS IN THE TTE.         */ 23540000
*       3    TTEMBZ1  FIXED(8),     /* RESERVED. (MUST BE ZERO)      */ 23550000
*       3    TTETOD   BIT(48),      /* <TIME(3:8)>. TOD-CLOCK BITS      23560000
*                                      16-63.                        */ 23570000
*       3    TTETOTE  BIT(32) BOUNDARY(WORD), /* TRACE OPERAND TABLE    23580000
*                                      ENTRY.                        */ 23590000
*         5    TTECPID  BIT(16),    /* CP ID                     @LOC*/ 23600000
*         5    TTEXPTYP FIXED(16),  /* <ID>. EXPLICIT ENTRY TYPE.    */ 23610000
*           7    TTEXPSID FIXED(8), /* EXPLICIT ENTRY SUB-ID.        */ 23620000
*           7    TTEXPID  FIXED(8), /* EXPLICIT ENTRY ID.            */ 23630000
*       3    TTEUNQ   CHARACTER(*) BOUNDARY(WORD), /* UNIQUE ENTRY      23640000
*                                      DESCRIPTIONS.                 */ 23650000
*     1    TTEEXCOM IHATTE_DEF2,     /* EXPLICIT ENTRY COMMON FIELD     23660000
*                                      NAMES.                        */ 23670000
*       3    TTEWRD0  CHARACTER(4) BOUNDARY(WORD), /* TTE WORD 0.    */ 23680000
*         5    TTETCB   POINTER(31), /* <TCB>. TCB ADDRESS.          */ 23690000
*       3    TTEWRD1  CHARACTER(4) BOUNDARY(WORD), /* TTE WORD 1.    */ 23700000
*         5    TTEDEP   FIXED(16),  /* DEPENDENT ON EACH EXPLICIT TTE   23710000
*                                      ENTRY.                        */ 23720000
*         5    TTEASID  FIXED(16),  /* ASID.                         */ 23730000
*       3    TTEWRD2  CHARACTER(4) BOUNDARY(WORD), /* TTE WORD 2.    */ 23740000
*       3    TTEWRD3  CHARACTER(4) BOUNDARY(WORD), /* TTE WORD 3.    */ 23750000
*       3    TTEWRD4  CHARACTER(4) BOUNDARY(WORD), /* TTE WORD 4.    */ 23760000
*       3    TTEWRD5  CHARACTER(4) BOUNDARY(WORD), /* TTE WORD 5.    */ 23770000
*       3    TTEWRD6  CHARACTER(4) BOUNDARY(WORD), /* TTE WORD 6.    */ 23780000
*       3    TTEWRD7  CHARACTER(4) BOUNDARY(WORD), /* TTE WORD 7.    */ 23790000
*       3    TTEWRD8  CHARACTER(4) BOUNDARY(WORD), /* TTE WORD 8.    */ 23800000
*       3    TTEWRD9  CHARACTER(4) BOUNDARY(WORD), /* TTE WORD 9.    */ 23810000
*       3    TTEWRDA  CHARACTER(4) BOUNDARY(WORD), /* TTE WORD 10.   */ 23820000
*       3    TTEWRDB  CHARACTER(4) BOUNDARY(WORD), /* TTE WORD 11.   */ 23830000
*       3    TTEWRDC  CHARACTER(4) BOUNDARY(WORD), /* TTE WORD 12.   */ 23840000
*       3    TTEWRDD  CHARACTER(4) BOUNDARY(WORD), /* TTE WORD 13.   */ 23850000
*       3    TTEWRDE  CHARACTER(4) BOUNDARY(WORD), /* TTE WORD 14.   */ 23860000
*       3    TTEWRDF  CHARACTER(4) BOUNDARY(WORD), /* TTE WORD 15.   */ 23870000
*       3    TTEXPEND CHARACTER(0) BOUNDARY(WORD), /* END OF MAXIMUM    23880000
*                                      EXPLICIT TTE.                 */ 23890000
*     TTETMAX  FIXED(16) CONSTANT(76), /* MAXIMUM LENGTH OF EXPLICIT    23900000
*                                      ENTRIES.                      */ 23910000
*                                                                       23920000
*/*!GENERAL EXPLICIT TTE TRACG INSTR SUPPORT                         */ 23930000
*/*!                                                                 */ 23940000
*/*!                                                                 */ 23950000
*/*!GENERAL FORMAT FOR AN EXPLICIT TTE:                              */ 23960000
*/*!                                                                 */ 23970000
*/*!PR ASID TCB ID   CD/D PSW ADDR U1 U2 U3 CLHS LOCAL PASD SASD TIME*/ 23980000
*/*!                               U4 U5 U6                      @LGA*/ 23990000
*                                                                       24000000
*     TTEETEX  FIXED(8) CONSTANT(112), /* EXPLICIT TTE TYPE (X'7N').    24010000
*                                                                @LGA*/ 24020000
*     TTEEMEX  FIXED(8) CONSTANT(240), /* MASK FOR EXPLICIT TTE TYPE.   24030000
*                                      (X'F0').                  @LGA*/ 24040000
*     TTEEMSID FIXED(8) CONSTANT(15), /* MASK FOR EXPLICIT TTE          24050000
*                                      SUB-ID. (X'0F').          @LGA*/ 24060000
*     1    TTEEXP   IHATTE_DEF1 BOUNDARY(WORD), /* EXPLICIT TRACE       24070000
*                                      TABLE ENTRY. ZARCH        @LGA*/ 24080000
*       3    TTEETYPE BIT(8),       /* TRACE TABLE ENTRY TYPE           24090000
*                                      (X'7N').                  @LGA*/ 24100000
*         5    *        BIT(4),     /* (ALWAYS X'7' FOR EXPLICITS)      24110000
*                                                                @LGA*/ 24120000
*         5    TTEEREGS BIT(4),     /* ONE LESS THAN THE NUMBER OF      24130000
*                                      REGISTERS IN THE TTE.     @LGA*/ 24140000
*       3    TTEEMBZ1 FIXED(8),     /* MUST BE 10000000          @LGA*/ 24150000
*         5    TTETRACG BIT(1),     /* Tracing is by TRACG       @LGA*/ 24160000
*         5    TTEIMPL  BIT(7),     /* Implicit TTEs             @LGA*/ 24170000
*       3    TTEETOD  BIT(80),      /* <TIME(1:10)>. TOD-CLOCK BITS     24180000
*                                      0-79.                     @LGA*/ 24190000
*       3    TTEETOTE BIT(32) BOUNDARY(WORD), /* TRACE OPERAND TABLE    24200000
*                                      ENTRY.                    @LGA*/ 24210000
*         5    TTEECPID BIT(16),    /* CP ID.                    @LOC*/ 24220000
*         5    TTEEXPTP FIXED(16),  /* <ID>. EXPLICIT ENTRY TYPE.@LGA*/ 24230000
*           7    TTEEXPSD FIXED(8), /* EXPLICIT ENTRY SUB-ID.    @LGA*/ 24240000
*           7    TTEEXPID FIXED(8), /* EXPLICIT ENTRY ID.        @LGA*/ 24250000
*       3    TTEEUNQ  CHARACTER(*) BOUNDARY(WORD), /* UNIQUE ENTRY      24260000
*                                      DESCRIPTIONS.             @LGA*/ 24270000
*     1    TTEEECOM IHATTE_DEF3,     /* EXPLICIT ENTRY COMMON FIELD     24280000
*                                      NAMES.                    @LGA*/ 24290000
*       3    TTEEWRD1 CHARACTER(8) BOUNDARY(WORD), /* TTE DOUBLE        24310007
*                                      WORD1                     @LQM*/ 24320009
*         5    TTEETCB  POINTER(31), /* <TCB>. TCB ADDRESS.      @LGA*/ 24330000
*         5    TTEEDEP  FIXED(16),  /* DEPENDENT ON EACH EXPLICIT TTE   24370000
*                                      ENTRY.                    @LGA*/ 24380007
*         5    TTEEASID FIXED(16),  /* ASID.                     @LGA*/ 24390007
*       3    TTEEWRD2 CHARACTER(8) BOUNDARY(WORD), /* TTE DOUBLE        24400000
*                                      WORD2                     @LGA*/ 24410000
*       3    TTEEWRD3 CHARACTER(8) BOUNDARY(WORD), /* TTE DOUBLE        24420000
*                                      WORD3                     @LGA*/ 24430000
*       3    TTEEWRD4 CHARACTER(8) BOUNDARY(WORD), /* TTE DOUBLE        24440000
*                                      WORD4                     @LGA*/ 24450000
*       3    TTEEWRD5 CHARACTER(8) BOUNDARY(WORD), /* TTE DOUBLE        24460000
*                                      WORD5                     @LGA*/ 24470000
*       3    TTEEWRD6 CHARACTER(8) BOUNDARY(WORD), /* TTE DOUBLE        24480000
*                                      WORD6                     @LGA*/ 24490000
*       3    TTEEWRD7 CHARACTER(8) BOUNDARY(WORD), /* TTE DOUBLE        24500000
*                                      WORD7                     @LGA*/ 24510000
*       3    TTEEWRD8 CHARACTER(8) BOUNDARY(WORD), /* TTE DOUBLE        24520000
*                                      WORD8                     @LGA*/ 24530000
*       3    TTEEWRD9 CHARACTER(8) BOUNDARY(WORD), /* TTE DOUBLE        24540000
*                                      WORD9                     @LGA*/ 24550000
*       3    TTEEWRDA CHARACTER(8) BOUNDARY(WORD), /* TTE DOUBLE        24560000
*                                      WORD10                    @LGA*/ 24570000
*       3    TTEEWRDB CHARACTER(8) BOUNDARY(WORD), /* TTE DOUBLE        24580000
*                                      WORD11                    @LGA*/ 24590000
*       3    TTEEWRDC CHARACTER(8) BOUNDARY(WORD), /* TTE DOUBLE        24600000
*                                      WORD12                    @LGA*/ 24610000
*       3    TTEEWRDD CHARACTER(8) BOUNDARY(WORD), /* TTE DOUBLE        24620000
*                                      WORD13                    @LGA*/ 24630000
*       3    TTEEWRDE CHARACTER(8) BOUNDARY(WORD), /* TTE DOUBLE        24640000
*                                      WORD14                    @LGA*/ 24650000
*       3    TTEEWRDF CHARACTER(8) BOUNDARY(WORD), /* TTE DOUBLE        24660000
*                                      WORD15                    @LGA*/ 24670000
*       3    TTEEXEND CHARACTER(0) BOUNDARY(WORD), /* END OF MAXIMUM    24680000
*                                      EXPLICIT TTE.             @LGA*/ 24690000
*/*!                                                                 */ 24691005
*/*!    Pre-z/OS 2.5 mapping                                     @LQA*/ 24692009
*/*!                                                                 */ 24693005
*     1    TTEEECOM_pre25 IHATTE_DEF3, /* EXPLICIT ENTRY COMMON FIELD   24694006
*                                      NAMES.                    @LQA*/ 24695009
*       3    TTEEWRD0_pre25 CHARACTER(8) BOUNDARY(WORD), /* TTE DOUBLE  24696006
*                                      WORD0                     @LQA*/ 24697009
*         5    *        CHARACTER(4), /* RESERVED                @LQA*/ 24698009
*         5    TTEETCB_pre25 POINTER(31), /* <TCB>. TCB ADDRESS. @LQA*/ 24699009
*       3    TTEEWRD1_pre25 CHARACTER(8) BOUNDARY(WORD), /* TTE DOUBLE  24699106
*                                      WORD1                     @LQA*/ 24699209
*         5    *        CHARACTER(4), /* RESERVED                @LQA*/ 24699309
*         5    TTEEDEP_pre25 FIXED(16),/* DEPENDENT ON EACH EXPLICIT    24699406
*                                      TTE ENTRY.                    */ 24699506
*         5    TTEEASID_pre25 FIXED(16), /* ASID.                    */ 24699606
*       3    TTEEWRD2_pre25 CHARACTER(8) BOUNDARY(WORD), /* TTE DOUBLE  24699706
*                                      WORD2                     @LQA*/ 24699809
*       3    TTEEWRD3_pre25 CHARACTER(8) BOUNDARY(WORD), /* TTE DOUBLE  24699906
*                                      WORD3                     @LQA*/ 24700009
*       3    TTEEWRD4_pre25 CHARACTER(8) BOUNDARY(WORD), /* TTE DOUBLE  24700106
*                                      WORD4                     @LQA*/ 24700209
*       3    TTEEWRD5_pre25 CHARACTER(8) BOUNDARY(WORD), /* TTE DOUBLE  24700306
*                                      WORD5                     @LQA*/ 24700409
*       3    TTEEWRD6_pre25 CHARACTER(8) BOUNDARY(WORD), /* TTE DOUBLE  24700506
*                                      WORD6                     @LQA*/ 24700609
*       3    TTEEWRD7_pre25 CHARACTER(8) BOUNDARY(WORD), /* TTE DOUBLE  24700706
*                                      WORD7                     @LQA*/ 24700809
*       3    TTEEWRD8_pre25 CHARACTER(8) BOUNDARY(WORD), /* TTE DOUBLE  24700906
*                                      WORD8                     @LQA*/ 24701009
*       3    TTEEWRD9_pre25 CHARACTER(8) BOUNDARY(WORD), /* TTE DOUBLE  24701106
*                                      WORD9                     @LQA*/ 24701209
*       3    TTEEWRDA_pre25 CHARACTER(8) BOUNDARY(WORD), /* TTE DOUBLE  24701306
*                                      WORD10                    @LQA*/ 24701409
*       3    TTEEWRDB_pre25 CHARACTER(8) BOUNDARY(WORD), /* TTE DOUBLE  24701506
*                                      WORD11                    @LQA*/ 24701609
*       3    TTEEWRDC_pre25 CHARACTER(8) BOUNDARY(WORD), /* TTE DOUBLE  24701706
*                                      WORD12                    @LQA*/ 24701809
*       3    TTEEWRDD_pre25 CHARACTER(8) BOUNDARY(WORD), /* TTE DOUBLE  24701906
*                                      WORD13                    @LQA*/ 24702009
*       3    TTEEWRDE_pre25 CHARACTER(8) BOUNDARY(WORD), /* TTE DOUBLE  24702106
*                                      WORD14                    @LQA*/ 24702209
*       3    TTEEWRDF_pre25 CHARACTER(8) BOUNDARY(WORD), /* TTE DOUBLE  24702306
*                                      WORD15                    @LQA*/ 24702409
*       3    TTEEXEND_pre25 CHARACTER(0) BDY(WORD), /* END OF MAXIMUM   24702506
*                                      EXPLICIT TTE.             @LQA*/ 24702609
*     TTEETMAX FIXED(16) CONSTANT(144), /* MAXIMUM LENGTH OF EXPLICIT   24702705
*                                      ENTRIES.ZARCH             @LGA*/ 24702805
*     TTEMTSCH FIXED(16) CONSTANT(1), /* SUBCHANNEL TYPE MAJOR ID       24720000
*                                      (X'001').                     */ 24730000
*     TTEMTEXT FIXED(16) CONSTANT(3), /* EXTERNAL INTERRUPT TYPE        24740000
*                                      MAJOR ID (X'003').            */ 24750000
*     TTEMTSVC FIXED(16) CONSTANT(5), /* SVC TYPE MAJOR ID (X'005'). */ 24760000
*     TTEMTDSP FIXED(16) CONSTANT(15), /* DISPATCHER TYPE MAJOR ID      24770000
*                                      (X'00F').                     */ 24780000
*     TTETSSCH FIXED(16) CONSTANT(1), /* SSCH TYPE ID (X'001').      */ 24790000
*     TTETEXT  FIXED(16) CONSTANT(3), /* GENERAL EXT TYPE ID            24800000
*                                      (X'003').                     */ 24810000
*     TTETSVC  FIXED(16) CONSTANT(5), /* SVC TYPE ID (X'005').       */ 24820000
*     TTETPGM  FIXED(16) CONSTANT(7), /* PGM TYPE ID (X'007').       */ 24830000
*     TTETSPER FIXED(16) CONSTANT(9), /* SPER TYPE ID (X'009').  @L1A*/ 24840000
*     TTETPDMX FIXED(16) CONSTANT(10),  /* PDMX TYPE ID (X'00A').@LNA*/ 24850000
*     TTETIO   FIXED(16) CONSTANT(11), /* IO TYPE ID (X'00B').       */ 24860000
*     TTETSYNS FIXED(16) CONSTANT(12), /* SYNS TYPE ID (X'00C'). @04A*/ 24870000
*     TTETDSP  FIXED(16) CONSTANT(15), /* DSP TYPE ID (X'00F').      */ 24880000
*     TTETMCH  FIXED(16) CONSTANT(19), /* MCH TYPE ID (X'013').      */ 24890000
*     TTETRST  FIXED(16) CONSTANT(21), /* RST TYPE ID (X'015').      */ 24900000
*     TTETACR  FIXED(16) CONSTANT(23), /* ACR TYPE ID (X'017').      */ 24910000
*     TTETSUSP FIXED(16) CONSTANT(25), /* SUSP TYPE ID (X'019').     */ 24920000
*     TTETALTR FIXED(16) CONSTANT(27), /* ALTR TYPE ID (X'01B').     */ 24930000
*     TTETRCVY FIXED(16) CONSTANT(29), /* RCVY TYPE ID (X'01D'). @L3A*/ 24940000
*     TTETSPIN FIXED(16) CONSTANT(30), /* SPIN TYPE ID (X'01E'). @LJA*/ 24950000
*     TTETTIME FIXED(16) CONSTANT(31), /* TIME TYPE ID (X'01F'). @L5A*/ 24960000
*     TTETUSR0 FIXED(16) CONSTANT(127), /* USR0 TYPE ID (X'07F').    */ 24970000
*     TTETMSCH FIXED(16) CONSTANT(257), /* MSCH TYPE ID (X'101').    */ 24980000
*     TTETEMS  FIXED(16) CONSTANT(259), /* EMS EXT TYPE ID (X'103'). */ 24990000
*     TTETSVCR FIXED(16) CONSTANT(261), /* SVCR TYPE ID (X'105').    */ 25000000
*     TTETAINT FIXED(16) CONSTANT(266), /* AINT TYPE ID (X'10A').@LNA*/ 25010000
*     TTETSYNE FIXED(16) CONSTANT(268),/* SYNE TYPE ID (X'10C'). @04A*/ 25020000
*     TTETSRB  FIXED(16) CONSTANT(271), /* SRB TYPE ID (X'10F').     */ 25030000
*     TTETUSR1 FIXED(16) CONSTANT(383), /* USR1 TYPE ID (X'17F').    */ 25040000
*     TTETHSCH FIXED(16) CONSTANT(513), /* HSCH TYPE ID (X'201').    */ 25050000
*     TTETSS   FIXED(16) CONSTANT(515), /* SS EXT TYPE ID (X'203').  */ 25060000
*     TTETSSRV FIXED(16) CONSTANT(517), /* SSRV TYPE ID (X'205').       25070000
*                                                                @L2A*/ 25080000
*     TTETPCIL FIXED(16) CONSTANT(522), /* PCIL TYPE ID (X'20A').@LNA*/ 25090000
*     TTETSSRB FIXED(16) CONSTANT(527), /* SSRB TYPE ID (X'20F').    */ 25100000
*     TTETUSR2 FIXED(16) CONSTANT(639), /* USR2 TYPE ID (X'27F').    */ 25110000
*     TTETCSCH FIXED(16) CONSTANT(769), /* CSCH TYPE ID (X'301').    */ 25120000
*     TTETCALL FIXED(16) CONSTANT(771), /* EXTERNAL CALL EXT TYPE ID    25130000
*                                      (X'303').                     */ 25140000
*     TTETPCIS FIXED(16) CONSTANT(778), /* PCIS TYPE ID (X'30A').@LNA*/ 25150000
*     TTETUSR3 FIXED(16) CONSTANT(895), /* USR3 TYPE ID (X'37F').    */ 25160000
*     TTETRSCH FIXED(16) CONSTANT(1025), /* RSCH TYPE ID (X'401').   */ 25170000
*     TTETCLKC FIXED(16) CONSTANT(1027), /* CLOCK COMPARATOR EXT TYPE   25180000
*                                      ID (X'403').                  */ 25190000
*     TTETUSR4 FIXED(16) CONSTANT(1151), /* USR4 TYPE ID (X'47F').   */ 25200000
*     TTETSIGA FIXED(16) CONSTANT(1281), /* SIGA TYPE ID (X'501').      25210000
*                                                                @01A*/ 25220000
*     TTETUSR5 FIXED(16) CONSTANT(1407), /* USR5 TYPE ID (X'57F').   */ 25230000
*     TTETXSCH FIXED(16) CONSTANT(1537), /* XSCH TYPE ID (X'601').      25240000
*                                                                @02A*/ 25250000
*     TTETUSR6 FIXED(16) CONSTANT(1663), /* USR6 TYPE ID (X'67F').   */ 25260000
*     TTETUSR7 FIXED(16) CONSTANT(1919), /* USR7 TYPE ID (X'77F').   */ 25270000
*     TTETUSR8 FIXED(16) CONSTANT(2175), /* USR8 TYPE ID (X'87F').   */ 25280000
*     TTETUSR9 FIXED(16) CONSTANT(2431), /* USR9 TYPE ID (X'97F').   */ 25290000
*     TTETUSRA FIXED(16) CONSTANT(2687), /* USRA TYPE ID (X'A7F').   */ 25300000
*     TTETUSRB FIXED(16) CONSTANT(2943), /* USRB TYPE ID (X'B7F').   */ 25310000
*     TTETUSRC FIXED(16) CONSTANT(3199), /* USRC TYPE ID (X'C7F').   */ 25320000
*     TTETUSRD FIXED(16) CONSTANT(3455), /* USRD TYPE ID (X'D7F').   */ 25330000
*     TTETUSRE FIXED(16) CONSTANT(3711), /* USRE TYPE ID (X'E7F').   */ 25340000
*     TTETSVCE FIXED(16) CONSTANT(3845), /* SVC ERROR TYPE ID           25350000
*                                      (X'F05').                     */ 25360000
*     TTETWAIT FIXED(16) CONSTANT(3855), /* WAIT TYPE ID (X'F0F').   */ 25370000
*     TTETUSRF FIXED(16) CONSTANT(3967); /* USRE TYPE ID (X'F7F').   */ 25380000
*   %IF TTEALL ^= 'YES' %THEN                                           25390000
*     %IF TTEEX ^= 'YES' %THEN                                          25400000
*       %IF TTEACR ^= 'YES' %THEN                                       25410000
*         %GO TO ENDACR;                                                25420000
*                                                                       25430000
*/*!ACR - ALTERNATE CPU RECOVERY TTE                                 */ 25440000
*/*!                                                                 */ 25450000
*/*!                                                                 */ 25460000
*/*!FORMATTED ACR TTE:                                               */ 25470000
*/*!                                                                 */ 25480000
*/*!PR ASID TCB ACR  CD/D          U1 U2 U3 CLHS LOCAL           TIME*/ 25490000
*/*!                               U4 U5    CLHSE                    */ 25500000
*                                                                       25510000
*   DECLARE                                                             25520000
*     1    TTE017   IHATTE_DEF2, /* ACR (ACR).                       */ 25530000
*       3    TTE017TB POINTER(31),  /* <TCB>. PSATOLD FROM THE          25540000
*                                      FAILING PROCESSOR. FLCCVT->      25550000
*                                      CVTPCCAT-> PCCAT00P(PSASPAD)->   25560000
*                                      PCCAPSAV-> PSATOLD.           */ 25570000
*       3    TTE017LP FIXED(16),    /* <CD/D>. PSACPUPA. LOGICAL        25580000
*                                      PROCESSOR ADDRESS. FLCCVT->      25590000
*                                      CVTPCCAT-> PCCAT00P(PSASPAD)->   25600000
*                                      PCCAPSAV-> PSACPUPA.          */ 25610000
*       3    TTE017HA FIXED(16),    /* <ASID>. HOME ADDRESS SPACE       25620000
*                                      FROM THE FAILING PROCESSOR.      25630000
*                                      FLCCVT-> CVTPCCAT->              25640000
*                                      PCCAT00P(PSASPAD)-> PCCAPSAV->   25650000
*                                      PSAAOLD-> ASCBASID.           */ 25660000
*       3    TTE017AD POINTER(31),  /* <U1>. PSAEEPSW FROM THE ACR      25670000
*                                      PROCESSOR. FAILING PROCESSOR     25680000
*                                      ADDRESS. PSAEEPSW.            */ 25690000
*       3    TTE017FG BIT(8),       /* <U2>. LCCACREX. ACR FLAG BYTE    25700000
*                                      FROM THE FAILING PROCESSOR.      25710000
*                                      FLCCVT-> CVTPCCAT->              25720000
*                                      PCCAT00P(PSASPAD)-> PCCAPSAV->   25730000
*                                      PSALCCAV-> LCCACREX.          */ 25740000
*       3    TTE017R1 CHARACTER(3), /* RESERVED.                     */ 25750000
*       3    TTE017FR POINTER(31),  /* <U3>. PSACSTK. CURRENT FRR       25760000
*                                      STACK ADDRESS FROM THE FAILING   25770000
*                                      PROCESSOR. FLCCVT-> CVTPCCAT->   25780000
*                                      PCCAT00P(PSASPAD)-> PCCAPSAV->   25790000
*                                      PSACSTK.                      */ 25800000
*       3    TTE017PS FIXED(32),    /* <U4>. PSASUPER FROM THE          25810000
*                                      FAILING PROCESSOR. FLCCVT->      25820000
*                                      CVTPCCAT-> PCCAT00P(PSASPAD)->   25830000
*                                      PCCAPSAV-> PSASUPER.          */ 25840000
*       3    TTE017MW FIXED(32),    /* <U5>. PSAMODEW FROM THE          25850000
*                                      FAILING PROCESSOR. FLCCVT->      25860000
*                                      CVTPCCAT-> PCCAT00P(PSASPAD)->   25870000
*                                      PCCAPSAV-> PSAMODEW.          */ 25880000
*       3    TTE017LH FIXED(32),    /* <CLHS> PSACLHS FROM THE          25890000
*                                      FAILING PROCESSOR. FLCCVT->      25900000
*                                      CVTPCCAT-> PCCAT00P(PSASPAD)->   25910000
*                                      PCCAPSAV-> PSACLHS.           */ 25920000
*       3    TTE017PL POINTER(31),  /* <LOCAL>. PSALOCAL FROM THE       25930000
*                                      FAILING PROCESSOR. FLCCVT->      25940000
*                                      CVTPCCAT-> PCCAT00P(PSASPAD)->   25950000
*                                      PCCAPSAV-> PSALOCAL.          */ 25960000
*       3    TTE017LE FIXED(32),    /* <CLHSE> PSACLHSE FROM THE        25970000
*                                      FAILING PROCESSOR. FLCCVT->      25980000
*                                      CVTPCCAT-> PCCAT00P(PSASPAD)->   25990000
*                                      PCCAPSAV-> PSACLHSE.      @L4A*/ 26000000
*       3    TTE017ED CHARACTER(0) BOUNDARY(WORD); /* END OF ACR TTE.*/ 26010000
*%ENDACR:                                                               26020000
*   IF TTEALL ^= 'YES'                                                  26030000
*      %THEN                                                            26040000
*     %IF TTEEX ^= 'YES' %THEN                                          26050000
*       %IF TTEALTR ^= 'YES' %THEN                                      26060000
*         %GO TO ENDALTR;                                               26070000
*                                                                       26080000
*/*!ALTR - TRACE OPTIONS ALTERATION TTE                              */ 26090000
*/*!                                                                 */ 26100000
*/*!                                                                 */ 26110000
*/*!FORMATTED ALTR TTE:                                              */ 26120000
*/*!                                                                 */ 26130000
*/*!PR ASID TCB ALTR               U1 U2 U3            PASD SASD TIME*/ 26140000
*/*!                               U4                                */ 26150000
*                                                                       26160000
*   DECLARE                                                             26170000
*     1    TTE01B   IHATTE_DEF2,     /* TRACE OPTIONS ALTERATION        26180000
*                                      (ALTR).                       */ 26190000
*       3    TTE01BTB POINTER(31),  /* <TCB>. CURRENT TCB ADDRESS OR    26200000
*                                      0. PSATOLD.                   */ 26210000
*       3    TTE01BR1 FIXED(16),    /* RESERVED.                     */ 26220000
*       3    TTE01BHA FIXED(16),    /* <ASID>. HOME ADDRESS SPACE.      26230000
*                                      PSAAOLD-> ASCBASID.           */ 26240000
*       3    TTE01BPA FIXED(16),    /* <PASD>. PASID. CONTROL           26250000
*                                      REGISTER 4.                   */ 26260000
*       3    TTE01BSA FIXED(16),    /* <SASD>. SASID. CONTROL           26270000
*                                      REGISTER 3.                   */ 26280000
*       3    TTE01BFC FIXED(32),    /* <U2>. R0 TRACE FUNCTION CODE.    26290000
*                                      ALTRTRC INPUT. INPUT REGISTER    26300000
*                                      0.                            */ 26310000
*       3    TTE01BAC FIXED(32),    /* <U3>. R1 TRACE ACTION CODE.      26320000
*                                      ALTRTRC INPUT. INPUT REGISTER    26330000
*                                      1.                            */ 26340000
*       3    TTE01BPT CHAR(8),      /* <U1>. TOBTROPT - CONTROL         26350000
*                                      REGISTER 12 MODEL FORMAT.        26360000
*                                      PSATRVT-> TRVTTOB-> TOBTROPT.    26370000
*                                                                @LIC*/ 26380000
*         5     TTE01BPTW1 CHAR(4), /* FIRST WORD                @LIA*/ 26390000
*         5     TTE01BPTW2 CHAR(4), /* SECOND WORD               @LIA*/ 26400000
*       3    TTE01BBF CHAR(8),      /* <U4(3:4)>. TOBTRBUF - NUMBER     26410000
*                                      OF TRACE BUFFERS PER             26420000
*                                      PROCESSOR. PSATRVT-> TRVTTOB->   26430000
*                                      TOBTRBUF.                 @LIC*/ 26440000
*         5     TTE01BBFW1 CHAR(4), /* FIRST WORD                @LIA*/ 26450000
*         5     TTE01BBFW2 CHAR(4), /* SECOND WORD               @LIA*/ 26460000
*       3    TTE01BCT FIXED(16),    /* <U4(1:2)>. TOBTRPOL - NUMBER     26470000
*                                      OF PROCESSORS WITH TRACE         26480000
*                                      CURRENTLY ACTIVE AND/OR          26490000
*                                      SUSPENDED. PSATRVT-> TRVTTOB->   26500000
*                                      TOBTRPOL.                 @LIM*/ 26510000
*       3    TTE01BR2 FIXED(16),    /* RESERVED.                 @LIA*/ 26520000
*       3    TTE01BED CHARACTER(0) BOUNDARY(WORD); /* END OF ALTR       26530000
*                                      TTE.                          */ 26540000
*%ENDALTR:                                                              26550000
*   IF TTEALL ^= 'YES'                                                  26560000
*      %THEN                                                            26570000
*     %IF TTEEX ^= 'YES' %THEN                                          26580000
*       %IF TTEEXT ^= 'YES' %THEN                                       26590000
*         %GO TO ENDCALL;                                               26600000
*                                                                       26610000
*/*!CALL - EXTERNAL CALL EXTERNAL INTERRUPT TTE                      */ 26620000
*/*!                                                                 */ 26630000
*/*!                                                                 */ 26640000
*/*!FORMATTED CALL TTE:                                              */ 26650000
*/*!                                                                 */ 26660000
*/*!PR ASID TCB CALL      PSW ADDR U1 U2    CLHS LOCAL PASD SASD TIME*/ 26670000
*/*!                                        CLHSE                    */ 26680000
*                                                                       26690000
*   DECLARE                                                             26700000
*     1    TTE303   IHATTE_DEF2,     /* EXTERNAL CALL EXTERNAL          26710000
*                                      INTERRUPT (CALL).             */ 26720000
*       3    TTE303TB POINTER(31),  /* <TCB>. CURRENT TCB ADDRESS OR    26730000
*                                      0. PSATOLD.                   */ 26740000
*       3    TTE303R1 FIXED(16),    /* RESERVED.                     */ 26750000
*       3    TTE303HA FIXED(16),    /* <ASID>. HOME ADDRESS SPACE.      26760000
*                                      PSAAOLD-> ASCBASID.           */ 26770000
*       3    TTE303PA FIXED(16),    /* <PASD>. PASID. INPUT REGISTER    26780000
*                                      4.                            */ 26790000
*       3    TTE303SA FIXED(16),    /* <SASD>. SASID. INPUT REGISTER    26800000
*                                      4.                            */ 26810000
*       3    TTE303PW CHARACTER(16) BOUNDARY(WORD), /* <PSW ADDR>.      26820000
*                                    EXTERNAL OLD PSW. FLCEOPSW. @LLC*/ 26830000
*         5    TTE303P1 CHARACTER(4), /* PSW 0-3                 @LLC*/ 26840000
*         5    TTE303P2 CHARACTER(4), /* PSW 4-7                 @LLC*/ 26850000
*         5    TTE303P3 CHARACTER(4), /* PSW 8-B                 @LLA*/ 26860000
*         5    TTE303P4 CHARACTER(4), /* PSW C-F                 @LLA*/ 26870000
*       3    TTE303CD POINTER(31),  /* <U1>. ISSUING PROCESSOR          26880000
*                                      ADDRESS AND EXTERNAL INTERRUPT   26890000
*                                      CODE. PSAEEPSW.               */ 26900000
*       3    TTE303PB FIXED(32),    /* <U2>. PCCARPB. PSAPCCAV->        26910000
*                                      PCCARPB.                      */ 26920000
*       3    TTE303LH FIXED(32),    /* <CLHS>. PSACLHS.              */ 26930000
*       3    TTE303PL POINTER(31),  /* <LOCAL>. PSALOCAL.            */ 26940000
*       3    TTE303LE FIXED(32),    /* <CLHSE>. PSACLHSE.        @L4A*/ 26950000
*       3    TTE303ED CHARACTER(0) BOUNDARY(WORD); /* END OF CALL       26960000
*                                      TTE.                          */ 26970000
*%ENDCALL:                                                              26980000
*   IF TTEALL ^= 'YES'                                                  26990000
*      %THEN                                                            27000000
*     %IF TTEEX ^= 'YES' %THEN                                          27010000
*       %IF TTEEXT ^= 'YES' %THEN                                       27020000
*         %GO TO ENDCLKC;                                               27030000
*                                                                       27040000
*/*!CLKC - CLOCK COMPARATOR EXTERNAL INTERRUPT TTE                   */ 27050000
*/*!                                                                 */ 27060000
*/*!                                                                 */ 27070000
*/*!FORMATTED CLKC TTE:                                              */ 27080000
*/*!                                                                 */ 27090000
*/*!PR ASID TCB CLKC      PSW ADDR U1 U2 U3 CLHS LOCAL PASD SASD TIME*/ 27100000
*/*!                                        CLHSE                    */ 27110000
*                                                                       27120000
*   DECLARE                                                             27130000
*     1    TTE403   IHATTE_DEF2,     /* CLOCK COMPARATOR EXTERNAL       27140000
*                                      INTERRUPT (CLKC).             */ 27150000
*       3    TTE403TB POINTER(31),  /* <TCB>. CURRENT TCB ADDRESS OR    27160000
*                                      0. PSATOLD.                   */ 27170000
*       3    TTE403R1 FIXED(16),    /* RESERVED.                     */ 27180000
*       3    TTE403HA FIXED(16),    /* <ASID>. HOME ADDRESS SPACE.      27190000
*                                      PSAAOLD-> ASCBASID.           */ 27200000
*       3    TTE403PA FIXED(16),    /* <PASD>. PASID. INPUT REGISTER    27210000
*                                      4.                            */ 27220000
*       3    TTE403SA FIXED(16),    /* <SASD>. SASID. INPUT REGISTER    27230000
*                                      4.                            */ 27240000
*       3    TTE403PW CHARACTER(16) BOUNDARY(WORD), /* <PSW ADDR>.      27250000
*                                    EXTERNAL OLD PSW. FLCEOPSW. @LLC*/ 27260000
*         5    TTE403P1 CHARACTER(4), /* PSW 0-3                 @LLC*/ 27270000
*         5    TTE403P2 CHARACTER(4), /* PSW 4-7                 @LLC*/ 27280000
*         5    TTE403P3 CHARACTER(4), /* PSW 8-B                 @LLA*/ 27290000
*         5    TTE403P4 CHARACTER(4), /* PSW C-F                 @LLA*/ 27300000
*       3    TTE403CD FIXED(32),    /* <U1>. EXTERNAL INTERRUPT CODE.   27310000
*                                      PSAEEPSW.                     */ 27320000
*       3    TTE403TT POINTER(31),  /* <U2>. TQE address or 0.          27330000
*                                      PSAPCCAV -> PCCATQEP      @03C*/ 27340000
*       3    TTE403R2 FIXED(16),    /* RESERVED.                     */ 27350000
*       3    TTE403TA FIXED(16),    /* <U3>. TQE ASID OR 0.             27360000
*                                      PSAPCCAV-> PCCA_TQEASID.  @03C*/ 27370000
*       3    TTE403LH FIXED(32),    /* <CLHS>. PSACLHS.              */ 27380000
*       3    TTE403PL POINTER(31),  /* <LOCAL>. PSALOCAL.            */ 27390000
*       3    TTE403LE FIXED(32),    /* <CLHSE>. PSACLHSE.        @L4A*/ 27400000
*       3    TTE403ED CHARACTER(0) BOUNDARY(WORD); /* END OF CLKC       27410000
*                                      TTE.                          */ 27420000
*%ENDCLKC:                                                              27430000
*   IF TTEALL ^= 'YES'                                                  27440000
*      %THEN                                                            27450000
*     %IF TTEEX ^= 'YES' %THEN                                          27460000
*       %IF TTESCH ^= 'YES' %THEN                                       27470000
*         %GO TO ENDCSCH;                                               27480000
*                                                                       27490000
*/*!CSCH - CLEAR SUBCHANNEL TTE                                      */ 27500000
*/*!                                                                 */ 27510000
*/*!                                                                 */ 27520000
*/*!FORMATTED CSCH TTE:                                              */ 27530000
*/*!                                                                 */ 27540000
*/*!PR ASID TCB CSCH CD/D PSW ADDR U1 U2 U3                      TIME*/ 27550000
*/*!                                                                 */ 27560000
*                                                                       27570000
*   DECLARE                                                             27580000
*     1    TTE301   IHATTE_DEF2, /* CLEAR SUBCHANNEL (CSCH).         */ 27590000
*       3    TTE301TB POINTER(31),  /* <TCB>. TCB ADDRESS FROM SRB.     27600000
*                                      IOSBPTR(R2)-> IOSSRB->           27610000
*                                      SRBPTCB.                      */ 27620000
*       3    TTE301AD FIXED(16),    /* <ASID>. ASID FROM IOSB.          27630000
*                                      IOSBPTR(R2)-> IOSASID.        */ 27640000
*       3    TTE301HA FIXED(16),    /* HOME ADDRESS SPACE. PSAAOLD->    27650000
*                                      ASCBASID.                     */ 27660000
*       3    TTE301CC FIXED(8),     /* <PSW(1:1)>. CONDITION CODE.      27670000
*                                      INPUT REGISTER 0.             */ 27680000
*       3    TTE301DI FIXED(8),     /* <PSW(3:3)>. DRIVER ID.           27690000
*                                      IOSBPTR(R2)-> IOSDVRID.       */ 27700000
*       3    TTE301DN FIXED(16),    /* <CD/D>. DEVICE NUMBER.           27710000
*                                      IOSBPTR(R2)-> IOSUCB->           27720000
*                                      UCBCHAN.                      */ 27730000
*       3    TTE301UB POINTER(31),  /* <U1>. UCB ADDRESS (COMMON        27740000
*                                      SEGMENT). ORBPTR(R3)-> WORD 1.*/ 27750000
*       3    TTE301IQ POINTER(31),  /* <U2>. IOQ ADDRESS.               27760000
*                                      ORBPTR(R3)-> WORD 2.          */ 27770000
*       3    TTE301AI POINTER(31),  /* <U3>. ADDRESS OF IOSB FOR        27780000
*                                      ASSOCIATED SSCH REQUEST (0 IF    27790000
*                                      NO ASSOCIATED REQUEST).          27800000
*                                      ORBPTR(R3)-> WORD 3.          */ 27810000
*       3    TTE301IO POINTER(31),  /* <ADDR>. IOSB ADDRESS. INPUT      27820000
*                                      REGISTER 2.                   */ 27830000
*       3    TTE301TK FIXED(32),    /* <CD/D> IF COPROCESSOR DEVICE.    27840000
*                                      TOKEN. INPUT REGISTER 1.  @L8C*/ 27850000
*         5    TTE301T1 FIXED(8),   /* KEY. NOT FORMATTED.       @L8A*/ 27860000
*         5    TTE301T2 CHARACTER(1), /* RESERVED.               @L8A*/ 27870000
*         5    TTE301T3 FIXED(16),  /* <U4>. BASE DEVICE NUMBER. @L8A*/ 27880000
*       3    TTE301SSIDA Fixed(8),  /* Subchannel set ID                27890000
*                                      IOSBPTR(R2)-> IOSUCB->           27900000
*                                      UCBSSID.                  @LFA*/ 27910000
*       3    *        Fixed(24),    /* Reserved                  @LFA*/ 27920000
*       3    TTE301ED CHARACTER(0) BOUNDARY(WORD); /* END OF CSCH       27930000
*                                      TTE.                          */ 27940000
*%ENDCSCH:                                                              27950000
*   IF TTEALL ^= 'YES'                                                  27960000
*      %THEN                                                            27970000
*     %IF TTEEX ^= 'YES' %THEN                                          27980000
*       %IF TTEDSP ^= 'YES' %THEN                                       27990000
*         %GO TO ENDDSP;                                                28000000
*                                                                       28010000
*/*!DSP - TASK DISPATCH TTE                                          */ 28020000
*/*!                                                                 */ 28030000
*/*!                                                                 */ 28040000
*/*!FORMATTED DSP TTE:                                               */ 28050000
*/*!                                                                 */ 28060000
*/*!PR ASID TCB DSP       PSW ADDR U1 U2 U3 CLHS LOCAL PASD SASD TIME*/ 28070000
*/*!                                                                 */ 28080000
*                                                                       28090000
*   DECLARE                                                             28100000
*     1    TTE00F   IHATTE_DEF2, /* TASK DISPATCH (DSP).             */ 28110000
*       3    TTE00FTB POINTER(31),  /* <TCB>. CURRENT TCB ADDRESS.      28120000
*                                      PSATOLD.                      */ 28130000
*       3    TTE00FR1 FIXED(16),    /* RESERVED.                     */ 28140000
*       3    TTE00FHA FIXED(16),    /* <ASID>. HOME ADDRESS SPACE.      28150000
*                                      PSAAOLD-> ASCBASID.           */ 28160000
*       3    TTE00FPA FIXED(16),    /* <PASD>. PASID. INPUT REGISTER    28170000
*                                      13.                           */ 28180000
*       3    TTE00FSA FIXED(16),    /* <SASD>. SASID. INPUT REGISTER    28190000
*                                      13.                           */ 28200000
*       3    TTE00FPW CHARACTER(16) BOUNDARY(WORD), /* <PSW ADDR>. PSW  28210000
*                                      TO BE DISPATCHED. PSAPSWSV16     28220000
*                                                                @LLC*/ 28230000
*         5    TTE00FP1 CHARACTER(4), /* PSW 0-3                 @LLC*/ 28240000
*         5    TTE00FP2 CHARACTER(4), /* PSW 4-7                 @LLC*/ 28250000
*         5    TTE00FP3 CHARACTER(4), /* PSW 8-B                 @LLA*/ 28260000
*         5    TTE00FP4 CHARACTER(4), /* PSW C-F                 @LLA*/ 28270000
*       3    TTE00FG0 FIXED(32),    /* <U2>. REGISTER 0 CONTENTS.       28280000
*                                      INPUT REGISTER 0.             */ 28290000
*       3    TTE00FG1 FIXED(32),    /* <U3>. REGISTER 1 CONTENTS.       28300000
*                                      INPUT REGISTER 1.             */ 28310000
*       3    TTE00FMW FIXED(32),    /* <U1>. PSAMODEW.               */ 28320000
*       3    TTE00FLH FIXED(32),    /* <CLHS>. PSACLHS.              */ 28330000
*       3    TTE00FPL POINTER(31),  /* <LOCAL>. PSALOCAL.            */ 28340000
*       3    TTE00FED CHARACTER(0) BOUNDARY(WORD); /* END OF DSP TTE.*/ 28350000
*%ENDDSP:                                                               28360000
*   IF TTEALL ^= 'YES'                                                  28370000
*      %THEN                                                            28380000
*     %IF TTEEX ^= 'YES' %THEN                                          28390000
*       %IF TTEEXT ^= 'YES' %THEN                                       28400000
*         %GO TO ENDEMS;                                                28410000
*                                                                       28420000
*/*!EMS - EMERGENCY SIGNAL EXTERNAL INTERRUPT TTE                    */ 28430000
*/*!                                                                 */ 28440000
*/*!                                                                 */ 28450000
*/*!FORMATTED EMS TTE:                                               */ 28460000
*/*!                                                                 */ 28470000
*/*!PR ASID TCB EMS       PSW ADDR U1 U2 U3 CLHS LOCAL PASD SASD TIME*/ 28480000
*/*!                               U4       CLHSE                    */ 28490000
*                                                                       28500000
*   DECLARE                                                             28510000
*     1    TTE103   IHATTE_DEF2,     /* EMS EXTERNAL INTERRUPT (EMS).*/ 28520000
*       3    TTE103TB POINTER(31),  /* <TCB>. CURRENT TCB ADDRESS OR    28530000
*                                      0. PSATOLD.                   */ 28540000
*       3    TTE103R1 FIXED(16),    /* RESERVED.                     */ 28550000
*       3    TTE103HA FIXED(16),    /* <ASID>. HOME ADDRESS SPACE.      28560000
*                                      PSAAOLD-> ASCBASID.           */ 28570000
*       3    TTE103PA FIXED(16),    /* <PASD>. PASID. INPUT REGISTER    28580000
*                                      4.                            */ 28590000
*       3    TTE103SA FIXED(16),    /* <SASD>. SASID. INPUT REGISTER    28600000
*                                      4.                            */ 28610000
*       3    TTE103PW CHARACTER(16) BOUNDARY(WORD), /* <PSW ADDR>.      28620000
*                                    EXTERNAL OLD PSW. FLCEOPSW. @LLC*/ 28630000
*         5    TTE103P1 CHARACTER(4), /* PSW 0-3                 @LLC*/ 28640000
*         5    TTE103P2 CHARACTER(4), /* PSW 4-7                 @LLC*/ 28650000
*         5    TTE103P3 CHARACTER(4), /* PSW 8-B                 @LLA*/ 28660000
*         5    TTE103P4 CHARACTER(4), /* PSW C-F                 @LLA*/ 28670000
*       3    TTE103CD POINTER(31),  /* <U1>. ISSUING PROCESSOR          28680000
*                                      ADDRESS AND EXTERNAL INTERRUPT   28690000
*                                      CODE. PSAEEPSW.               */ 28700000
*       3    TTE103SI FIXED(32),    /* <U2>. PCCAEMSI. FLCCVT->         28710000
*                                      CVTPCCAT-> PCCAT00P(PSASPAD)->   28720000
*                                      PCCAEMSI.                     */ 28730000
*       3    TTE103SP POINTER(31),  /* <U3>. PCCAEMSP. FLCCVT->         28740000
*                                      CVTPCCAT-> PCCAT00P(PSASPAD)->   28750000
*                                      PCCAEMSP.                     */ 28760000
*       3    TTE103SE POINTER(31),  /* <U4>. PCCAEMSE. FLCCVT->         28770000
*                                      CVTPCCAT-> PCCAT00P(PSASPAD)->   28780000
*                                      PCCAEMSE.                     */ 28790000
*       3    TTE103LH FIXED(32),    /* <CLHS>. PSACLHS.              */ 28800000
*       3    TTE103PL POINTER(31),  /* <LOCAL>. PSALOCAL.            */ 28810000
*       3    TTE103LE FIXED(32),    /* <CLHSE>. PSACLHSE.        @L4A*/ 28820000
*       3    TTE103ED CHARACTER(0) BOUNDARY(WORD); /* END OF EMS TTE.*/ 28830000
*%ENDEMS:                                                               28840000
*   IF TTEALL ^= 'YES'                                                  28850000
*      %THEN                                                            28860000
*     %IF TTEEX ^= 'YES' %THEN                                          28870000
*       %IF TTEEXT ^= 'YES' %THEN                                       28880000
*         %GO TO ENDEXT;                                                28890000
*                                                                       28900000
*/*!EXT - GENERAL EXTERNAL INTERRUPT TTE                             */ 28910000
*/*!                                                                 */ 28920000
*/*!                                                                 */ 28930000
*/*!FORMATTED EXT TTE:                                               */ 28940000
*/*!                                                                 */ 28950000
*/*!PR ASID TCB EXT  CD/D PSW ADDR U1       CLHS LOCAL PASD SASD TIME*/ 28960000
*/*!                                        CLHSE                    */ 28970000
*                                                                       28980000
*   DECLARE                                                             28990000
*     1    TTE003   IHATTE_DEF2, /* EXTERNAL INTERRUPT (EXT).        */ 29000000
*       3    TTE003TB POINTER(31),  /* <TCB>. CURRENT TCB ADDRESS OR    29010000
*                                      0. PSATOLD.                   */ 29020000
*       3    TTE003R1 FIXED(16),    /* RESERVED.                     */ 29030000
*       3    TTE003HA FIXED(16),    /* <ASID>. HOME ADDRESS SPACE.      29040000
*                                      PSAAOLD-> ASCBASID.           */ 29050000
*       3    TTE003PA FIXED(16),    /* <PASD>. PASID. INPUT REGISTER    29060000
*                                      4.                            */ 29070000
*       3    TTE003SA FIXED(16),    /* <SASD>. SASID. INPUT REGISTER    29080000
*                                      4.                            */ 29090000
*       3    TTE003PW CHARACTER(16) BOUNDARY(WORD), /* <PSW ADDR>.      29100000
*                                    EXTERNAL OLD PSW. FLCEOPSW. @LLC*/ 29110000
*         5    TTE003P1 CHARACTER(4), /* PSW 0-3                 @LLC*/ 29120000
*         5    TTE003P2 CHARACTER(4), /* PSW 4-7                 @LLC*/ 29130000
*         5    TTE003P3 CHARACTER(4), /* PSW 8-B                 @LLA*/ 29140000
*         5    TTE003P4 CHARACTER(4), /* PSW C-F                 @LLA*/ 29150000
*       3    TTE003CD FIXED(32),    /* <CD/D AND U1>. EXTERNAL          29160000
*                                      INTERRUPT CODE. PSAEEPSW.     */ 29170000
*       3    TTE003LH FIXED(32),    /* <CLHS>. PSACLHS.              */ 29180000
*       3    TTE003PL POINTER(31),  /* <LOCAL>. PSALOCAL.            */ 29190000
*       3    TTE003LE FIXED(32),    /* <CLHSE>. PSACLHSE.        @L4A*/ 29200000
*       3    TTE003ED CHARACTER(0) BOUNDARY(WORD); /* END OF EXT TTE.*/ 29210000
*%ENDEXT:                                                               29220000
*   IF TTEALL ^= 'YES'                                                  29230000
*      %THEN                                                            29240000
*     %IF TTEEX ^= 'YES' %THEN                                          29250000
*       %IF TTESCH ^= 'YES' %THEN                                       29260000
*         %GO TO ENDHSCH;                                               29270000
*                                                                       29280000
*/*!HSCH - HALT SUBCHANNEL TTE                                       */ 29290000
*/*!                                                                 */ 29300000
*/*!                                                                 */ 29310000
*/*!FORMATTED HSCH TTE:                                              */ 29320000
*/*!                                                                 */ 29330000
*/*!PR ASID TCB HSCH CD/D PSW ADDR U1 U2 U3                      TIME*/ 29340000
*/*!                                                                 */ 29350000
*                                                                       29360000
*   DECLARE                                                             29370000
*     1    TTE201   IHATTE_DEF2, /* HALT SUBCHANNEL (HSCH).          */ 29380000
*       3    TTE201TB POINTER(31),  /* <TCB>. TCB ADDRESS FROM SRB.     29390000
*                                      IOSBPTR(R2)-> IOSSRB->           29400000
*                                      SRBPTCB.                      */ 29410000
*       3    TTE201AD FIXED(16),    /* <ASID>. ASID FROM IOSB.          29420000
*                                      IOSBPTR(R2)-> IOSASID.        */ 29430000
*       3    TTE201HA FIXED(16),    /* HOME ADDRESS SPACE. PSAAOLD->    29440000
*                                      ASCBASID.                     */ 29450000
*       3    TTE201CC FIXED(8),     /* <PSW(1:1)>. CONDITION CODE.      29460000
*                                      INPUT REGISTER 0.             */ 29470000
*       3    TTE201DI FIXED(8),     /* <PSW(3:3)>. DRIVER ID.           29480000
*                                      IOSBPTR(R2)-> IOSDVRID.       */ 29490000
*       3    TTE201DN FIXED(16),    /* <CD/D>. DEVICE NUMBER.           29500000
*                                      IOSBPTR(R2)-> IOSUCB->           29510000
*                                      UCBCHAN.                      */ 29520000
*       3    TTE201UB POINTER(31),  /* <U1>. UCB ADDRESS (COMMON        29530000
*                                      SEGMENT. ORBPTR(R3)-> WORD 1. */ 29540000
*       3    TTE201IQ POINTER(31),  /* <U2>. IOQ ADDRESS.               29550000
*                                      ORBPTR(R3)-> WORD 2.          */ 29560000
*       3    TTE201AI POINTER(31),  /* <U3>. ADDRESS OF IOSB FOR        29570000
*                                      ASSOCIATED SSCH REQUEST (0 IF    29580000
*                                      NO ASSOCIATED REQUEST).          29590000
*                                      ORBPTR(R3)-> WORD 3.          */ 29600000
*       3    TTE201IO POINTER(31),  /* <ADDR>. IOSB ADDRESS. INPUT      29610000
*                                      REGISTER 2.                   */ 29620000
*       3    TTE201TK FIXED(32),    /* <CD/D> IF COPROCESSOR DEVICE.    29630000
*                                      TOKEN. INPUT REGISTER 1.  @L8C*/ 29640000
*         5    TTE201T1 FIXED(8),   /* KEY. NOT FORMATTED.       @L8A*/ 29650000
*         5    TTE201T2 CHARACTER(1), /* RESERVED.               @L8A*/ 29660000
*         5    TTE201T3 FIXED(16),  /* <U4>. BASE DEVICE NUMBER. @L8A*/ 29670000
*       3    TTE201SSIDA Fixed(8),  /* Subchannel set ID                29680000
*                                      IOSBPTR(R2)-> IOSUCB->           29690000
*                                      UCBSSID.                  @LFA*/ 29700000
*       3    *        Fixed(24),    /* Reserved                  @LFA*/ 29710000
*       3    TTE201ED CHARACTER(0) BOUNDARY(WORD); /* END OF HSCH       29720000
*                                      TTE.                          */ 29730000
*%ENDHSCH:                                                              29740000
*   IF TTEALL ^= 'YES'                                                  29750000
*      %THEN                                                            29760000
*     %IF TTEEX ^= 'YES' %THEN                                          29770000
*       %IF TTEIO ^= 'YES' %THEN                                        29780000
*         %GO TO ENDIO;                                                 29790000
*                                                                       29800000
*/*!IO - I/O INTERRUPT TTE                                           */ 29810000
*/*!                                                                 */ 29820000
*/*!                                                                 */ 29830000
*/*!FORMATTED IO TTE:                                                */ 29840000
*/*!                                                                 */ 29850000
*/*!PR ASID TCB IO   CD/D PSW ADDR U1 U2 U3 CLHS LOCAL PASD SASD TIME*/ 29860000
*/*!                               U4 U5    CLHSE                    */ 29870000
*                                                                       29880000
*   DECLARE                                                             29890000
*     1    TTE00B   IHATTE_DEF2, /* I/O INTERRUPT (IO).              */ 29900000
*       3    TTE00BTB POINTER(31),  /* <TCB>. CURRENT TCB ADDRESS OR    29910000
*                                      0. PSATOLD.                   */ 29920000
*       3    TTE00BDN FIXED(16),    /* <CD/D>. DEVICE NUMBER.           29930000
*                                      UCBPTR(R7)-> UCBCHAN.         */ 29940000
*       3    TTE00BHA FIXED(16),    /* <ASID>. HOME ADDRESS SPACE.      29950000
*                                      PSAAOLD-> ASCBASID.           */ 29960000
*       3    TTE00BPA FIXED(16),    /* <PASD>. PASID. CONTROL           29970000
*                                      REGISTER 4.                   */ 29980000
*       3    TTE00BSA FIXED(16),    /* <SASD>. SASID. CONTROL           29990000
*                                      REGISTER 3.                   */ 30000000
*       3    TTE00BPW CHARACTER(16) BOUNDARY(WORD), /* <PSW ADDR>. I/O  30010000
*                                      OLD PSW. FLCIOPSW.        @LLC*/ 30020000
*         5    TTE00BP1 CHARACTER(4), /* PSW 0-3                 @LLC*/ 30030000
*         5    TTE00BP2 CHARACTER(4), /* PSW 4-7                 @LLC*/ 30040000
*         5    TTE00BP3 CHARACTER(4), /* PSW 8-B                 @LLA*/ 30050000
*         5    TTE00BP4 CHARACTER(4), /* PSW C-F                 @LLA*/ 30060000
*       3    TTE00BFG FIXED(16),    /* <U1(1:2)>. IRBFLAGS.             30070000
*                                      IRBPTR(R3)-> WORD 1.          */ 30080000
*       3    TTE00BSC FIXED(16),    /* <U1(3:4)>. SUBCHANNEL CONTROL.   30090000
*                                      IRBPTR(R3)-> WORD 1.          */ 30100000
*       3    TTE00BCA POINTER(31),  /* <U2>. CCW ADDRESS.               30110000
*                                      IRBPTR(R3)-> WORD 2.          */ 30120000
*       3    TTE00BDS FIXED(8),     /* <U3(1:1)>. DEVICE STATUS.        30130000
*                                      IRBPTR(R3)-> WORD 3.          */ 30140000
*       3    TTE00BSS FIXED(8),     /* <U3(2:2)>. SUBCHANNEL STATUS.    30150000
*                                      IRBPTR(R3)-> WORD 3.          */ 30160000
*       3    TTE00BCT FIXED(16),    /* <U3(3:4)>. RESIDUAL COUNT.       30170000
*                                      IRBPTR(R3)-> WORD 3.          */ 30180000
*       3    TTE00BEW FIXED(32),    /* <U6>. EXTENDED STATUS WORD.      30190000
*                                      IRBPTR(R3)-> WORD 4.      @L8C*/ 30200000
*       3    TTE00BUB POINTER(31),  /* <U5>. UCB ADDRESS. INPUT         30210000
*                                      REGISTER 7.                   */ 30220000
*       3    TTE00BLH FIXED(32),    /* <CLHS>. PSACLHS.              */ 30230000
*       3    TTE00BPL POINTER(31),  /* <LOCAL>. PSALOCAL.            */ 30240000
*       3    TTE00BLE FIXED(32),    /* <CLHSE>. PSACLHSE.        @L4A*/ 30250000
*       3    TTE00BTK FIXED(32),    /* <CD/D> IF COPROCESSOR DEVICE.    30260000
*                                      TOKEN. INPUT REGISTER 1.  @L8C*/ 30270000
*         5    TTE00BT1 FIXED(8),   /* KEY. NOT FORMATTED.       @L8A*/ 30280000
*         5    TTE00BSSIDA Fixed(8), /* Subchannel set ID               30290000
*                                      IOSBPTR(R2)-> IOSUCB->           30300000
*                                      UCBSSID.                  @LFA*/ 30310000
*         5    TTE00BT3 FIXED(16),  /* <U4>. BASE DEVICE NUMBER. @L8A*/ 30320000
*       3    TTE00BED CHARACTER(0) BOUNDARY(WORD); /* END OF IO TTE. */ 30330000
*%ENDIO:                                                                30340000
*   IF TTEALL ^= 'YES'                                                  30350000
*      %THEN                                                            30360000
*     %IF TTEEX ^= 'YES' %THEN                                          30370000
*       %IF TTEMCH ^= 'YES' %THEN                                       30380000
*         %GO TO ENDMCH;                                                30390000
*                                                                       30400000
*/*!MCH - MACHINE CHECK INTERRUPT TTE                                */ 30410000
*/*!                                                                 */ 30420000
*/*!                                                                 */ 30430000
*/*!FORMATTED MCH TTE:                                               */ 30440000
*/*!                                                                 */ 30450000
*/*!PR ASID TCB MCH       PSW ADDR U1 U2 U3 CLHS LOCAL PASD SASD TIME*/ 30460000
*/*!                                        CLHSE                    */ 30470000
*                                                                       30480000
*   DECLARE                                                             30490000
*     1    TTE013   IHATTE_DEF2, /* MACHINE CHECK INTERRUPT             30500000
*                                      (MCH).                        */ 30510000
*       3    TTE013TB POINTER(31),  /* <TCB>. CURRENT TCB ADDRESS OR    30520000
*                                      0. PSATOLD.                   */ 30530000
*       3    TTE013R1 FIXED(16),    /* RESERVED.                     */ 30540000
*       3    TTE013HA FIXED(16),    /* <ASID>. HOME ADDRESS SPACE.      30550000
*                                      PSAAOLD-> ASCBASID.           */ 30560000
*       3    TTE013PA FIXED(16),    /* <PASD>. PASID. CONTROL           30570000
*                                      REGISTER 4.                   */ 30580000
*       3    TTE013SA FIXED(16),    /* <SASD>. SASID. CONTROL           30590000
*                                      REGISTER 3.                   */ 30600000
*       3    TTE013PW CHARACTER(16) BOUNDARY(WORD), /* <PSW ADDR>.      30610000
*                                      MACHINE CHECK OLD PSW.           30620000
*                                      FLCMOPSW.                 @LLC*/ 30630000
*         5    TTE013P1 CHARACTER(4), /* PSW 0-3                 @LLC*/ 30640000
*         5    TTE013P2 CHARACTER(4), /* PSW 4-7                 @LLC*/ 30650000
*         5    TTE013P3 CHARACTER(4), /* PSW 8-B                 @LLA*/ 30660000
*         5    TTE013P4 CHARACTER(4), /* PSW C-F                 @LLA*/ 30670000
*       3    TTE013MC CHARACTER(8) BOUNDARY(WORD), /* <U1 U2>.          30680000
*                                      MACHINE CHECK INTERRUPT CODE.    30690000
*                                      FLCMCIC.                      */ 30700000
*         5    TTE013M1 CHARACTER(4), /* PART 1 OF FLCMCIC.          */ 30710000
*         5    TTE013M2 CHARACTER(4), /* PART 2 OF FLCMCIC.          */ 30720000
*       3    TTE013PS FIXED(32),    /* <U3>. PSASUPER.               */ 30730000
*       3    TTE013LH FIXED(32),    /* <CLHS>. PSACLHS.              */ 30740000
*       3    TTE013PL POINTER(31),  /* <LOCAL>. PSALOCAL.            */ 30750000
*       3    TTE013LE FIXED(32),    /* <CLHSE>. PSACLHSE.        @L4A*/ 30760000
*       3    TTE013ED CHARACTER(0) BOUNDARY(WORD); /* END OF MCH TTE.*/ 30770000
*%ENDMCH:                                                               30780000
*   IF TTEALL ^= 'YES'                                                  30790000
*      %THEN                                                            30800000
*     %IF TTEEX ^= 'YES' %THEN                                          30810000
*       %IF TTESCH ^= 'YES' %THEN                                       30820000
*         %GO TO ENDMSCH;                                               30830000
*                                                                       30840000
*/*!MSCH - MODIFY SUBCHANNEL TTE                                     */ 30850000
*/*!                                                                 */ 30860000
*/*!                                                                 */ 30870000
*/*!FORMATTED MSCH TTE:                                              */ 30880000
*/*!                                                                 */ 30890000
*/*!PR ASID TCB MSCH CD/D PSW ADDR U1 U2 U3                      TIME*/ 30900000
*/*!                                                                 */ 30910000
*                                                                       30920000
*   DECLARE                                                             30930000
*     1    TTE101   IHATTE_DEF2, /* MODIFY SUBCHANNEL (MSCH).        */ 30940000
*       3    TTE101TB POINTER(31),  /* <TCB>. TCB ADDRESS FROM SRB.     30950000
*                                      IOSBPTR(R2)-> IOSSRB->           30960000
*                                      SRBPTCB.                      */ 30970000
*       3    TTE101AD FIXED(16),    /* <ASID>. ASID FROM IOSB.          30980000
*                                      IOSBPTR(R2)-> IOSASID.        */ 30990000
*       3    TTE101HA FIXED(16),    /* HOME ADDRESS SPACE. PSAAOLD->    31000000
*                                      ASCBASID.                     */ 31010000
*       3    TTE101CC FIXED(8),     /* <PSW>. CONDITION CODE. INPUT     31020000
*                                      REGISTER 0.                   */ 31030000
*       3    TTE101R1 FIXED(8),     /* RESERVED.                     */ 31040000
*       3    TTE101DN FIXED(16),    /* <CD/D>. DEVICE NUMBER.           31050000
*                                      IOSBPTR(R2)-> IOSUCB->           31060000
*                                      UCBCHAN.                      */ 31070000
*       3    TTE101UB POINTER(31),  /* <U1>. UCB ADDRESS (COMMON        31080000
*                                      SEGMENT). ORBPTR(R3)-> WORD 1.*/ 31090000
*       3    TTE101O2 FIXED(31),    /* <U2>. ORB WORD 2. ORBPTR(R3)->   31100000
*                                      WORD 2.                       */ 31110000
*         5    TTE101F1 BIT(8),     /* SCHFLG1 FROM SCHIB USED FOR      31120000
*                                      MSCH INSTRUCTION.             */ 31130000
*         5    TTE101F2 BIT(8),     /* SCHFLG2 FROM SCHIB USED FOR      31140000
*                                      MSCH INSTRUCTION.             */ 31150000
*         5    TTE101LM FIXED(8),   /* SCHLPM FROM SCHIB USED FOR       31160000
*                                      MSCH INSTRUCTION.             */ 31170000
*         5    TTE101PM FIXED(8),   /* SCHPOM FROM SCHIB USED FOR       31180000
*                                      MSCH INSTRUCTION.             */ 31190000
*       3    TTE101O3 FIXED(31),    /* <U3>. ORB WORD 3. ORBPTR(R3)->   31200000
*                                      WORD 3.                       */ 31210000
*         5    TTE101MI FIXED(16),  /* SCHMBI FROM SCHIB USED FOR       31220000
*                                      MSCH INSTRUCTION.             */ 31230000
*         5    TTE101P2 FIXED(8),   /* IOSOPT2 FROM MSCH IOSB.       */ 31240000
*         5    TTE101FB FIXED(8),   /* IOSFLB FROM MSCH IOSB.        */ 31250000
*       3    TTE101IO POINTER(31),  /* <ADDR>. IOSB ADDRESS. INPUT      31260000
*                                      REGISTER 2.                   */ 31270000
*       3    TTE101TK FIXED(32),    /* <CD/D> IF COPROCESSOR DEVICE.    31280000
*                                      TOKEN. INPUT REGISTER 1.  @L8C*/ 31290000
*         5    TTE101T1 FIXED(8),   /* KEY. NOT FORMATTED.       @L8A*/ 31300000
*         5    TTE101T2 CHARACTER(1), /* RESERVED.               @L8A*/ 31310000
*         5    TTE101T3 FIXED(16),  /* <U4>. BASE DEVICE NUMBER. @L8A*/ 31320000
*       3    TTE101SSIDA Fixed(8),  /* Subchannel set ID                31330000
*                                      IOSBPTR(R2)-> IOSUCB->           31340000
*                                      UCBSSID.                  @LFA*/ 31350000
*       3    *        Fixed(24),    /* Reserved                  @LFA*/ 31360000
*       3    TTE101ED CHARACTER(0) BOUNDARY(WORD); /* END OF MSCH       31370000
*                                      TTE.                          */ 31380000
*%ENDMSCH:                                                              31390000
*   IF TTEALL ^= 'YES'                                                  31400000
*      %THEN                                                            31410000
*     %IF TTEEX ^= 'YES' %THEN                                          31420000
*       %IF TTEPGM ^= 'YES' %THEN                                       31430000
*         %GO TO ENDPGM;                                                31440000
*                                                                       31450000
*/*!PGM - PROGRAM INTERRUPT TTE                                      */ 31460000
*/*!                                                                 */ 31470000
*/*!                                                                 */ 31480000
*/*!FORMATTED PGM TTE:                                               */ 31490000
*/*!                                                                 */ 31500000
*/*!PR ASID TCB PGM  CD/D PSW ADDR U1 U2    CLHS LOCAL PASD SASD TIME*/ 31510000
*/*!                                        CLHSE                    */ 31520000
*                                                                       31530000
*   DECLARE                                                             31540000
*     1    TTE007   IHATTE_DEF2, /* PROGRAM INTERRUPT (PGM).         */ 31550000
*       3    TTE007TB POINTER(31),  /* <TCB>. CURRENT TCB ADDRESS OR    31560000
*                                      0. PSATOLD.                   */ 31570000
*       3    TTE007R1 FIXED(16),    /* RESERVED.                     */ 31580000
*       3    TTE007HA FIXED(16),    /* <ASID>. HOME ADDRESS SPACE.      31590000
*                                      PSAAOLD-> ASCBASID.           */ 31600000
*       3    TTE007PA FIXED(16),    /* <PASD>. PASID. CONTROL           31610000
*                                      REGISTER 4.                   */ 31620000
*       3    TTE007SA FIXED(16),    /* <SASD>. SASID. CONTROL           31630000
*                                      REGISTER 3.                   */ 31640000
*       3    TTE007LH FIXED(32),    /* <CLHS>. PSACLHS.          @LBM*/ 31650000
*       3    TTE007PL POINTER(31),  /* <LOCAL>. PSALOCAL.        @LBM*/ 31660000
*       3    TTE007LE FIXED(32),    /* <CLHSE>. PSACLHSE.        @LBM*/ 31670000
*       3    TTE007PW CHARACTER(16) BOUNDARY(WORD), /* <PSW ADDR>.      31680000
*                                      PROGRAM INTERRUPT PSW. PROGRAM   31690000
*                                      INTERRUPT STATUS ADDRESS(R2)->   31700000
*                                      WORDS 1 AND 2.            @LLC*/ 31710000
*         5    TTE007P1 CHARACTER(4), /* PSW 0-3                 @LLC*/ 31720000
*         5    TTE007P2 CHARACTER(4), /* PSW 4-7                 @LLC*/ 31730000
*         5    TTE007P3 CHARACTER(4), /* PSW 8-B                 @LLA*/ 31740000
*         5    TTE007P4 CHARACTER(4), /* PSW C-F                 @LLA*/ 31750000
*       3    TTE007IL FIXED(16),    /* <U1(1:2)>. PROGRAM INSTRUCTION   31760000
*                                      LENGTH. PROGRAM INTERRUPT        31770000
*                                      STATUS ADDRESS(R2)-> WORD 3.  */ 31780000
*       3    TTE007CD FIXED(16),    /* <CD/D AND U1(3:4)>. PROGRAM      31790000
*                                      INTERRUPT CODE. PROGRAM          31800000
*                                      INTERRUPT STATUS ADDRESS(R2)->   31810000
*                                      WORD 3.                       */ 31820000
*       3    TTE007ZT,              /* TEA - Z/Architecture      @LBA*/ 31830000
*         5    TTE007TA POINTER(31), /* <U2>. TEA CONTENTS. HIGH        31840000
*                                      ORDER BIT INDICATES PRIMARY      31850000
*                                      (0) OR SECONDARY (1). PROGRAM    31860000
*                                      INTERRUPT STATUS ADDRESS(R2)->   31870000
*                                      WORD 4.                       */ 31880000
*         5    TTE007ED CHARACTER(0) BOUNDARY(WORD), /* END OF PGM      31890000
*                                      TTE - ESA                     */ 31900000
*         5    TTE007ZL POINTER(31), /* TEA bits 32-63 - z/Arch  @LBA*/ 31910000
*         5    TTE007ZD CHARACTER(0) BOUNDARY(WORD); /* END OF PGM      31920000
*                                      TTE - z/Arch              @LBA*/ 31930000
*%ENDPGM:                                                               31940000
*   IF TTEALL ^= 'YES'                                                  31950000
*      %THEN                                                            31960000
*     %IF TTEEX ^= 'YES' %THEN                                          31970000
*       %IF TTESCH ^= 'YES' %THEN                                       31980000
*         %GO TO ENDRSCH;                                               31990000
*                                                                       32000000
*/*!RSCH - RESUME SUBCHANNEL TTE                                     */ 32010000
*/*!                                                                 */ 32020000
*/*!                                                                 */ 32030000
*/*!FORMATTED RSCH TTE:                                              */ 32040000
*/*!                                                                 */ 32050000
*/*!PR ASID TCB RSCH CD/D PSW ADDR U1                            TIME*/ 32060000
*/*!                                                                 */ 32070000
*                                                                       32080000
*   DECLARE                                                             32090000
*     1    TTE401   IHATTE_DEF2, /* RESUME SUBCHANNEL (RSCH).        */ 32100000
*       3    TTE401TB POINTER(31),  /* <TCB>. TCB ADDRESS FROM SRB.     32110000
*                                      IOSBPTR(R2)-> IOSSRB->           32120000
*                                      SRBPTCB.                      */ 32130000
*       3    TTE401AD FIXED(16),    /* <ASID>. ASID FROM IOSB.          32140000
*                                      IOSBPTR(R2)-> IOSASID.        */ 32150000
*       3    TTE401HA FIXED(16),    /* HOME ADDRESS SPACE. PSAAOLD->    32160000
*                                      ASCBASID.                     */ 32170000
*       3    TTE401CC FIXED(8),     /* <PSW(1:1)>. CONDITION CODE.      32180000
*                                      INPUT REGISTER 0.             */ 32190000
*       3    TTE401DI FIXED(8),     /* <PSW(3:3)>. DRIVER ID.           32200000
*                                      IOSBPTR(R2)-> IOSDVRID.       */ 32210000
*       3    TTE401DN FIXED(16),    /* <CD/D>. DEVICE NUMBER.           32220000
*                                      IOSBPTR(R2)-> IOSUCB->           32230000
*                                      UCBCHAN.                      */ 32240000
*       3    TTE401UB POINTER(31),  /* <U1>. UCB ADDRESS FROM IOSB.     32250000
*                                      IOSBPTR(R2)-> IOSUCB.         */ 32260000
*       3    TTE401IO POINTER(31),  /* <ADDR>. IOSB ADDRESS. INPUT      32270000
*                                      REGISTER 2.                   */ 32280000
*       3    TTE401TK FIXED(32),    /* <CD/D> IF COPROCESSOR DEVICE.    32290000
*                                      TOKEN. INPUT REGISTER 1.  @L8C*/ 32300000
*         5    TTE401T1 FIXED(8),   /* KEY. NOT FORMATTED.       @L8A*/ 32310000
*         5    TTE401T2 CHARACTER(1), /* RESERVED.               @L8A*/ 32320000
*         5    TTE401T3 FIXED(16),  /* <U4>. BASE DEVICE NUMBER. @L8A*/ 32330000
*       3    TTE401SSIDA Fixed(8),  /* Subchannel set ID                32340000
*                                      IOSBPTR(R2)-> IOSUCB->           32350000
*                                      UCBSSID.                  @LFA*/ 32360000
*       3    *        Fixed(24),    /* Reserved                  @LFA*/ 32370000
*       3    TTE401ED CHARACTER(0) BOUNDARY(WORD); /* END OF RSCH       32380000
*                                      TTE.                          */ 32390000
*%ENDRSCH:                                                              32400000
*   IF TTEALL ^= 'YES'                                                  32410000
*      %THEN                                                            32420000
*     %IF TTEEX ^= 'YES' %THEN                                          32430000
*       %IF TTERST ^= 'YES' %THEN                                       32440000
*         %GO TO ENDRST;                                                32450000
*                                                                       32460000
*/*!RST - RESTART INTERRUPT TTE                                      */ 32470000
*/*!                                                                 */ 32480000
*/*!                                                                 */ 32490000
*/*!FORMATTED RST TTE:                                               */ 32500000
*/*!                                                                 */ 32510000
*/*!PR ASID TCB RST       PSW ADDR U1 U2 U3 CLHS LOCAL PASD SASD TIME*/ 32520000
*/*!                               U4 U5    CLHSE                    */ 32530000
*                                                                       32540000
*   DECLARE                                                             32550000
*     1    TTE015   IHATTE_DEF2, /* RESTART INTERRUPT (RST).         */ 32560000
*       3    TTE015TB POINTER(31),  /* <TCB>. CURRENT TCB ADDRESS OR    32570000
*                                      0. PSATOLD.                   */ 32580000
*       3    TTE015R1 FIXED(16),    /* RESERVED.                     */ 32590000
*       3    TTE015HA FIXED(16),    /* <ASID>. HOME ADDRESS SPACE.      32600000
*                                      PSAAOLD-> ASCBASID.           */ 32610000
*       3    TTE015PA FIXED(16),    /* <PASD>. PASID. CONTROL           32620000
*                                      REGISTER 4.                   */ 32630000
*       3    TTE015SA FIXED(16),    /* <SASD>. SASID. CONTROL           32640000
*                                      REGISTER 3.                   */ 32650000
*       3    TTE015PW CHARACTER(16) BOUNDARY(WORD), /* <PSW ADDR>.      32660000
*                                     RESTART OLD PSW. FLCROPSW. @LLC*/ 32670000
*         5    TTE015P1 CHARACTER(4), /* PSW 0-3                 @LLC*/ 32680000
*         5    TTE015P2 CHARACTER(4), /* PSW 4-7                 @LLC*/ 32690000
*         5    TTE015P3 CHARACTER(4), /* PSW 8-B                 @LLA*/ 32700000
*         5    TTE015P4 CHARACTER(4), /* PSW C-F                 @LLA*/ 32710000
*       3    TTE015GF FIXED(32),    /* <U1>. R15 CONTENT. INPUT         32720000
*                                      REGISTER 15.                  */ 32730000
*       3    TTE015G0 FIXED(32),    /* <U2>. R0 CONTENT. INPUT          32740000
*                                      REGISTER 0.                   */ 32750000
*       3    TTE015G1 FIXED(32),    /* <U3>. R1 CONTENT. INPUT          32760000
*                                      REGISTER 1.                   */ 32770000
*       3    TTE015PS FIXED(32),    /* <U4>. PSASUPER.               */ 32780000
*       3    TTE015MW FIXED(32),    /* <U5>. PSAMODEW.               */ 32790000
*       3    TTE015LH FIXED(32),    /* <CLHS>. PSACLHS.              */ 32800000
*       3    TTE015PL POINTER(31),  /* <LOCAL>. PSALOCAL.            */ 32810000
*       3    TTE015LE FIXED(32),    /* <CLHSE>. PSACLHSE.        @L4A*/ 32820000
*       3    TTE015ED CHARACTER(0) BOUNDARY(WORD); /* END OF RST TTE.*/ 32830000
*%ENDRST:                                                               32840000
*   IF TTEALL ^= 'YES'                                                  32850000
*      %THEN                                                            32860000
*     %IF TTEEX ^= 'YES' %THEN                                          32870000
*       %IF TTESPER ^= 'YES' %THEN                                      32880000
*         %GO TO ENDSPER;                                               32890000
*                                                                       32900000
*/*!SPER - SLIP/PER EVENT TTE                                    @L1A*/ 32910000
*/*!                                                                 */ 32920000
*/*!                                                                 */ 32930000
*/*!FORMATTED SLIP/PER TTE:                                          */ 32940000
*/*!                                                                 */ 32950000
*/*!PR ASID TCB SPER CD/D PSW ADDR U1 U2 U3 CLHS LOCAL PASD SASD TIME*/ 32960000
*/*!                               U4       CLHSE                    */ 32970000
*/*!                                                                 */ 32980000
*                                                                       32990000
*   DECLARE                                                             33000000
*     1    TTE009   IHATTE_DEF2, /* SLIP/PER EVENT (SPER).       @L1A*/ 33010000
*       3    TTE009TB POINTER(31),  /* <TCB>. CURRENT TCB ADDRESS OR    33020000
*                                      0. PSATOLD.               @L1A*/ 33030000
*       3    TTE009PC CHARACTER(2), /* <CD/D>. PER CODE. SLIP/PER       33040000
*                                      STATUS ADDRESS (R3)-> BYTE 1.    33050000
*                                                                @L9C*/ 33060000
*       3    TTE009HA FIXED(16),    /* <ASID>. HOME ADDRESS SPACE.      33070000
*                                      PSAAOLD-> ASCBASID.       @L1A*/ 33080000
*       3    TTE009PA FIXED(16),    /* <PASD>. PASID. CONTROL           33090000
*                                      REGISTER 4.               @L1A*/ 33100000
*       3    TTE009SA FIXED(16),    /* <SASD>. SASID. CONTROL           33110000
*                                      REGISTER 3.               @L1A*/ 33120000
*       3    TTE009PW CHARACTER(16) BOUNDARY(WORD), /* 16-byte          33130000
*                                      Program Interrupt PSW     @LMC*/ 33140000
*         5    TTE009P1 CHARACTER(4), /* PSW 0-3                 @LMC*/ 33150000
*         5    TTE009P2 CHARACTER(4), /* PSW 4-7                 @LMC*/ 33160000
*         5    TTE009P3 CHARACTER(4), /* PSW 8-B                 @LMA*/ 33170000
*         5    TTE009P4 CHARACTER(4), /* PSW C-F                 @LMA*/ 33180000
*       3    TTE009V1 Fixed(32),    /* Stdata Variable Word 1    @LHA*/ 33190000
*         5  TTE009IL FIXED(16),    /* <U1(1:2)>. PROGRAM INSTRUCTION   33200000
*                                      LENGTH. PROGRAM INTERRUPT        33210000
*                                      STATUS ADDRESS(R2)-> WORD 3.     33220000
*                                                                @LHC*/ 33230000
*         5  TTE009CD FIXED(16),    /* <DT/C> PROGRAM INTERRUPT CODE.   33240000
*                                      PROGRAM INTERRUPT STATUS         33250000
*                                      ADDRESS(R2)-> WORD 3.     @LHC*/ 33260000
*       3    TTE009V2 Fixed(32),    /* Stdata Variable Word 2    @LHA*/ 33270000
*         5  TTE009ID CHARACTER(4), /* <U3>. SLIP/PER TRAP ID.          33280000
*                                      SLIP/PER TRAP ID ADDRESS         33290000
*                                      (R1)-> WORD 1.            @LHC*/ 33300000
*       3    TTE009V3 Fixed(32),    /* Stdata Variable Word 3    @LHA*/ 33310000
*         5  TTE009IA POINTER(31),  /* <U1> PER ADDRESS PART 1.         33320000
*                                      SLIP/PER STATUS ADDRESS(R3)->    33330000
*                                      BYTES 3 THROUGH 6         @LHC*/ 33340000
*       3    TTE009V4 Fixed(32),    /* Stdata Variable Word 4    @LHA*/ 33350000
*         5  TTE009IB POINTER(31),  /* <U2> PER ADDRESS PART 2.         33360000
*                                      SLIP/PER STATUS ADDRESS(R3)->    33370000
*                                      BYTES 7 THROUGH 10.       @LHC*/ 33380000
*       3    TTE009LH FIXED(32),    /* <CLHS>. PSACLHS.          @L1A*/ 33390000
*       3    TTE009PL POINTER(31),  /* <LOCAL>. PSALOCAL (the first     33400000
*                                      bit of this address is used      33410000
*                                      as a flag. 1 => STDATA           33420000
*                                      capture space exceeded    @LHA*/ 33430000
*       3    TTE009LE FIXED(32),    /* <CLHSE>. PSACLHSE.        @L4A*/ 33440000
*       3    TTE009V5 Fixed(32),    /* Stdata Variable Word 5    @LHA*/ 33450000
*       3    TTE009ED CHARACTER(0) BOUNDARY(WORD); /* END OF SLIP/PER   33460000
*                                      TTE.                      @L1A*/ 33470000
*%ENDSPER:                                                              33480000
*   IF TTEALL ^= 'YES'                                                  33490000
*      %THEN                                                            33500000
*     %IF TTEEX ^= 'YES' %THEN                                          33510000
*       %IF TTEDSP ^= 'YES' %THEN                                       33520000
*         %GO TO ENDSRB;                                                33530000
*                                                                       33540000
*/*!SRB - SRB DISPATCH TTE                                           */ 33550000
*/*!                                                                 */ 33560000
*/*!                                                                 */ 33570000
*/*!FORMATTED SRB TTE:                                               */ 33580000
*/*!                                                                 */ 33590000
*/*!PR ASID TCB SRB       PSW ADDR U1 U2 U3 CLHS       PASD SASD TIME*/ 33600000
*/*!                               U4 U5                             */ 33610000
*                                                                       33620000
*   DECLARE                                                             33630000
*     1    TTE10F   IHATTE_DEF2, /* SRB DISPATCH (SRB).              */ 33640000
*       3    TTE10FTB POINTER(31),  /* <TCB>. WORK UNIT ADDRESS.        33650000
*                                      SRBPTR(R0)-> SRBWEB.      @D1C*/ 33660000
*       3    TTE10FSF BIT(8),       /* <U5>. SRB FLAG BYTE.             33670000
*                                      SRBPTR(R0)-> SRBFLGS.     @D1C*/ 33680000
*       3    TTE10FLH BIT(8),       /* <CLHS>. SRBHLHI. SRBPTR(R0)->    33690000
*                                      SRBHLHI.                      */ 33700000
*       3    TTE10FHA FIXED(16),    /* <ASID>. HOME ADDRESS SPACE.      33710000
*                                      PSAAOLD-> ASCBASID.           */ 33720000
*       3    TTE10FPW CHARACTER(8) BOUNDARY(WORD), /* <PSW ADDR>. PSW   33730000
*                                      TO RECEIVE CONTROL ON SRB        33740000
*                                      DISPATCH. PSASMPSW            */ 33750000
*         5    TTE10FP1 CHARACTER(4), /* 1ST HALF OF PSW             */ 33760000
*         5    TTE10FP2 CHARACTER(4), /* 2ND HALF OF PSW             */ 33770000
*       3    TTE10FFN FIXED(16),    /* <U1(1:2)>. CPU AFFINITY.         33780000
*                                      SRBPTR(R0)-> SRBCPAFF.        */ 33790000
*       3    TTE10FAP FIXED(16),    /* <U1(3:4)>. RELATED ASID.         33800000
*                                      SRBPTR(R0)-> SRBPASID.        */ 33810000
*       3    TTE10FG0 FIXED(32),    /* <U2>. REGISTER 0 CONTENTS.       33820000
*                                      INPUT REGISTER 0.             */ 33830000
*       3    TTE10FG1 FIXED(32),    /* <U3>. REGISTER 1 CONTENTS.       33840000
*                                      INPUT REGISTER 1.             */ 33850000
*       3    TTE10FPT POINTER(31),  /* <U4>. PURGE TCB ADDRESS.         33860000
*                                      SRBPTR(R0)-> SRBPTCB.     @D1A*/ 33870000
*       3    TTE10FED CHARACTER(0) BOUNDARY(WORD); /* END OF SRB TTE.*/ 33880000
*%ENDSRB:                                                               33890000
*   IF TTEALL ^= 'YES'                                                  33900000
*      %THEN                                                            33910000
*     %IF TTEEX ^= 'YES' %THEN                                          33920000
*       %IF TTEEXT ^= 'YES' %THEN                                       33930000
*         %GO TO ENDSS;                                                 33940000
*                                                                       33950000
*/*!SS - SERVICE SIGNAL EXTERNAL INTERRUPT TTE                       */ 33960000
*/*!                                                                 */ 33970000
*/*!                                                                 */ 33980000
*/*!FORMATTED SS TTE:                                                */ 33990000
*/*!                                                                 */ 34000000
*/*!PR ASID TCB SS        PSW ADDR U1 U2 U3 CLHS LOCAL PASD SASD TIME*/ 34010000
*/*!                               U4 U5 U6 CLHSE                    */ 34020000
*                                                                       34030000
*   DECLARE                                                             34040000
*     1    TTE203   IHATTE_DEF2, /* SS EXTERNAL INTERRUPT (SS).      */ 34050000
*       3    TTE203TB POINTER(31),  /* <TCB>. CURRENT TCB ADDRESS OR    34060000
*                                      0. PSATOLD.                   */ 34070000
*       3    TTE203R1 FIXED(16),    /* RESERVED.                     */ 34080000
*       3    TTE203HA FIXED(16),    /* <ASID>. HOME ADDRESS SPACE.      34090000
*                                      PSAAOLD-> ASCBASID.           */ 34100000
*       3    TTE203PA FIXED(16),    /* <PASD>. PASID. INPUT REGISTER    34110000
*                                      4.                            */ 34120000
*       3    TTE203SA FIXED(16),    /* <SASD>. SASID. INPUT REGISTER    34130000
*                                      4.                            */ 34140000
*       3    TTE203PW CHARACTER(16) BOUNDARY(WORD), /* <PSW ADDR>.      34150000
*                                    EXTERNAL OLD PSW. FLCEOPSW. @LLC*/ 34160000
*         5    TTE203P1 CHARACTER(4), /* PSW 0-3                 @LLC*/ 34170000
*         5    TTE203P2 CHARACTER(4), /* PSW 4-7                 @LLC*/ 34180000
*         5    TTE203P3 CHARACTER(4), /* PSW 8-B                 @LLA*/ 34190000
*         5    TTE203P4 CHARACTER(4), /* PSW C-F                 @LLA*/ 34200000
*       3    TTE203CD FIXED(32),    /* <U1>. EXTERNAL INTERRUPT CODE.   34210000
*                                      PSAEEPSW.                     */ 34220000
*       3    TTE203BA POINTER(31),  /* <U2>. SCCB ADDRESS ASSOCIATED    34230000
*                                      WITH THE SERVICE SIGNAL.  @L6C*/ 34240000
*       3    TTE203CM FIXED(32),    /* <U3>. SCLP COMMAND WORD          34250000
*                                      ASSOCIATED WITH THE SERVICE      34260000
*                                      SIGNAL INTERRUPT.         @L6C*/ 34270000
*       3    TTE203R3 FIXED(16),    /* RESERVED. MSSF HARDWARE FLAGS    34280000
*                                      NO LONGER PART OF THE SS TRACE   34290000
*                                      ENTRY.                    @L6C*/ 34300000
*       3    TTE203RC FIXED(16),    /* <U4(3:4)>. SERVICE PROCESSOR     34310000
*                                      RESPONSE AND REASON CODE. @L6C*/ 34320000
*       3    TTE203R2 FIXED(16),    /* RESERVED.                     */ 34330000
*       3    TTE203AD FIXED(16),    /* <U5>. SS ASID.            @L6C*/ 34340000
*       3    TTE203AT POINTER(31),  /* <U6>. SS TCB ADDRESS.     @L6C*/ 34350000
*       3    TTE203LH FIXED(32),    /* <CLHS>. PSACLHS.              */ 34360000
*       3    TTE203PL POINTER(31),  /* <LOCAL>. PSALOCAL.            */ 34370000
*       3    TTE203LE FIXED(32),    /* <CLHSE>. PSACLHSE.        @L4A*/ 34380000
*       3    TTE203ED CHARACTER(0) BOUNDARY(WORD); /* END OF SS TTE. */ 34390000
*%ENDSS:                                                                34400000
*   IF TTEALL ^= 'YES'                                                  34410000
*      %THEN                                                            34420000
*     %IF TTEEX ^= 'YES' %THEN      /*                           @01P*/ 34430000
*       %IF TTESIGA ^= 'YES' %THEN  /*                           @01A*/ 34440000
*         %GO TO ENDSIGA;           /*                           @01A*/ 34450000
*                                                                       34460000
*/*!SIGA - Signal adapter TTE                                        */ 34470000
*/*!                                                                 */ 34480000
*/*!                                                                 */ 34490000
*/*!FORMATTED SIGA TTE:                                              */ 34500000
*/*!                                                                 */ 34510000
*/*!PR ASID TCB SIGA CD/D PSW ADDR U1 U2 U3                      TIME*/ 34520000
*/*!                               U4                                */ 34530000
*/*!                                                                 */ 34540000
*                                                                       34550000
*   DECLARE                                                             34560000
*     1    TTE501   IHATTE_DEF2, /* Signal adapter (SIGA).       @01A*/ 34570000
*      2    TTE501TB POINTER(31),   /* <TCB> TCB address         @01A*/ 34580000
*      2    *        FIXED(16),     /* Reserved                  @01A*/ 34590000
*      2    TTE501HA FIXED(16),     /* <ASID> Home address space @01A*/ 34600000
*      2    TTE501CC UNSIGNED BINARY(8), /* <PSW(1:1)> Condition code   34610000
*                                                                @01A*/ 34620000
*      2    TTE501FC UNSIGNED BINARY(8), /* <PSW(3:3)> SIGA function    34630000
*                                      code.                     @01A*/ 34640000
*      2    TTE501DN UNSIGNED BINARY(16), /* <CD/D> Device number       34650000
*                                                                @01A*/ 34660000
*      2    TTE501SI UNSIGNED BINARY(32), /* <U1> SID            @01A*/ 34670000
*      2    TTE501M1 UNSIGNED BINARY(32), /* <U2> Queue Mask 1   @01A*/ 34680000
*      2    TTE501M2 UNSIGNED BINARY(32), /* <U3> Queue Mask 2   @01A*/ 34690000
*      2    TTE501QI POINTER(31),   /* <ADDR> QIB Pointer        @01A*/ 34700000
*      2    TTE501UB POINTER(31),   /* <U4> UCB address.         @01A*/ 34710000
*      2    TTE501ED CHARACTER(0) BOUNDARY(WORD); /* End of SIGA TTE.   34720000
*                                                                @01A*/ 34730000
*%ENDSIGA:                          /*                           @01A*/ 34740000
*   IF TTEALL ^= 'YES'                                                  34750000
*      %THEN                                                            34760000
*     %IF TTEEX ^= 'YES' %THEN                                          34770000
*       %IF TTESCH ^= 'YES' %THEN                                       34780000
*         %GO TO ENDSSCH;                                               34790000
*                                                                       34800000
*/*!SSCH - START SUBCHANNEL TTE                                      */ 34810000
*/*!                                                                 */ 34820000
*/*!                                                                 */ 34830000
*/*!FORMATTED SSCH TTE:                                              */ 34840000
*/*!                                                                 */ 34850000
*/*!PR ASID TCB SSCH CD/D PSW ADDR U1 U2 U3                      TIME*/ 34860000
*/*!                                                                 */ 34870000
*                                                                       34880000
*   DECLARE                                                             34890000
*     1    TTE001   IHATTE_DEF2, /* START SUBCHANNEL (SSCH).         */ 34900000
*       3    TTE001TB POINTER(31),  /* <TCB>. TCB ADDRESS FROM SRB.     34910000
*                                      IOSBPTR(R2)-> IOSSRB->           34920000
*                                      SRBPTCB.                      */ 34930000
*       3    TTE001AD FIXED(16),    /* <ASID>. ASID FROM IOSB.          34940000
*                                      IOSBPTR(R2)-> IOSASID.        */ 34950000
*       3    TTE001HA FIXED(16),    /* HOME ADDRESS SPACE. PSAAOLD->    34960000
*                                      ASCBASID.                     */ 34970000
*       3    TTE001CC FIXED(8),     /* <PSW(1:1)>. CONDITION CODE.      34980000
*                                      INPUT REGISTER 0.             */ 34990000
*       3    TTE001DI FIXED(8),     /* <PSW(3:3)>. DRIVER ID.           35000000
*                                      IOSBPTR(R2)-> IOSDVRID.       */ 35010000
*       3    TTE001DN FIXED(16),    /* <CD/D>. DEVICE NUMBER.           35020000
*                                      TTE001UB-> UCBCHAN.       @L8C*/ 35030000
*       3    TTE001UB POINTER(31),  /* <U1>. ORB WORD 1 - UCB           35040000
*                                      ADDRESS. ORBPTR(R3)-> WORD 1. */ 35050000
*       3    TTE001O2 FIXED(32),    /* <U2>. ORB WORD 2. ORBPTR(R3)->   35060000
*                                      WORD 2.                       */ 35070000
*       3    TTE001O3 FIXED(32),    /* <U3>. ORB WORD 3. ORBPTR(R3)->   35080000
*                                      WORD 3.                       */ 35090000
*       3    TTE001O4 FIXED(32),    /* <U4>. ORB WORD 4. ORBPTR(R3)->   35100000
*                                      WORD 4.                   @LAA*/ 35110000
*       3    TTE001IO POINTER(31),  /* <ADDR>. IOSB ADDRESS. INPUT      35120000
*                                      REGISTER 2.                   */ 35130000
*       3    TTE001TK FIXED(32),    /* <CD/D> IF COPROCESSOR DEVICE.    35140000
*                                      TOKEN. INPUT REGISTER 1.  @L8C*/ 35150000
*         5    TTE001T1 FIXED(8),   /* KEY. NOT FORMATTED.       @L8A*/ 35160000
*         5    TTE001T2 CHARACTER(1), /* RESERVED.               @L8A*/ 35170000
*         5    TTE001T3 FIXED(16),  /* <U6>. BASE DEVICE NUMBER. @LAC*/ 35180000
*       3    TTE001CU POINTER(31),  /* <U5>. CAPTURE UCB ADDRESS.       35190000
*                                      IOSBPTR(R2)->IOSUCB.      @L8A*/ 35200000
*       3    TTE001SSIDA Fixed(8),  /* Subchannel set ID                35210000
*                                      IOSBPTR(R2)-> IOSUCB->           35220000
*                                      UCBSSID.                  @LFA*/ 35230000
*       3    *        Fixed(24),    /* Reserved                  @LFA*/ 35240000
*       3    TTE001ED CHARACTER(0) BOUNDARY(WORD); /* END OF SSCH       35250000
*                                      TTE.                          */ 35260000
*%ENDSSCH:                                                              35270000
*   IF TTEALL ^= 'YES'                                                  35280000
*      %THEN                                                            35290000
*     %IF TTEEX ^= 'YES' %THEN                                          35300000
*       %IF TTEDSP ^= 'YES' %THEN                                       35310000
*         %GO TO ENDSSRB;                                               35320000
*                                                                       35330000
*/*!SSRB - SUSPENDED SRB DISPATCH TTE                                */ 35340000
*/*!                                                                 */ 35350000
*/*!                                                                 */ 35360000
*/*!FORMATTED SSRB TTE:                                              */ 35370000
*/*!                                                                 */ 35380000
*/*!PR ASID TCB SSRB      PSW ADDR U1    U3 CLHS LOCAL PASD SASD TIME*/ 35390000
*/*!                               U4                                */ 35400000
*/*!                                                                 */ 35410000
*                                                                       35420000
*   DECLARE                                                             35430000
*     1    TTE20F   IHATTE_DEF2, /* SUSPENDED SRB DISPATCH              35440000
*                                      (SSRB).                       */ 35450000
*       3    TTE20FTB POINTER(31),  /* <TCB>. WORK UNIT ADDRESS.        35460000
*                                      PSALCCAV-> LCCACWEB.      @D1C*/ 35470000
*       3    TTE20FR1 BIT(8),       /* RESERVED.                     */ 35480000
*       3    TTE20FLH BIT(8),       /* <CLHS>. PSACLHS BYTE 4.          35490000
*                                      PSACLHS4.                     */ 35500000
*       3    TTE20FHA FIXED(16),    /* <ASID>. HOME ADDRESS SPACE.      35510000
*                                      PSAAOLD-> ASCBASID.           */ 35520000
*       3    TTE20FPA FIXED(16),    /* <PASD>. PASID. INPUT REGISTER    35530000
*                                      13.                           */ 35540000
*       3    TTE20FSA FIXED(16),    /* <SASD>. SASID. INPUT REGISTER    35550000
*                                      13.                           */ 35560000
*       3    TTE20FPW CHARACTER(16) BOUNDARY(WORD), /* <PSW ADDR>. PSW  35570000
*                                 TO BE REDISPATCHED. PSAPSWSV16 @LLC*/ 35580000
*         5    TTE20FP1 CHARACTER(4), /* PSW 0-3                 @LLC*/ 35590000
*         5    TTE20FP2 CHARACTER(4), /* PSW 4-7                 @LLC*/ 35600000
*         5    TTE20FP3 CHARACTER(4), /* PSW 8-B                 @LLA*/ 35610000
*         5    TTE20FP4 CHARACTER(4), /* PSW C-F                 @LLA*/ 35620000
*       3    TTE20FPT POINTER(31),  /* <U4>. RELATED TCB. PSALCCAV->    35630000
*                                      LCCAPGTA+2.               @D1A*/ 35640000
*       3    TTE20FSP FIXED(32),    /* <U3>. SSRB ADDRESS. INPUT        35650000
*                                      REGISTER 1.               @P2C*/ 35660000
*       3    TTE20FFN FIXED(16),    /* <U1(1:2)>. CPU AFFINITY.         35670000
*                                      PSALCCAV-> LCCASAFN.          */ 35680000
*       3    TTE20FAP FIXED(16),    /* <U1(3:4)>. RELATED ASID.         35690000
*                                      PSALCCAV-> LCCAPGTA.          */ 35700000
*       3    TTE20FPL POINTER(31),  /* <LOCAL>. PSALOCAL.            */ 35710000
*       3    TTE20FED CHARACTER(0) BOUNDARY(WORD); /* END OF SSRB       35720000
*                                      TTE.                          */ 35730000
*%ENDSSRB:                                                              35740000
*   IF TTEALL ^= 'YES' %THEN        /* IF ALL ENTRY MAPPINGS IS NOT     35750000
*                                      SPECIFIED,                @LNA*/ 35760000
*     %IF TTEEX ^= 'YES' %THEN      /* ALL EXPLICIT TRACING MAPPINGS    35770000
*                                      IS NOT SPECIFIED,         @LNA*/ 35780000
*       %IF TTEPDMX ^= 'YES' %THEN                            /* @LNA*/ 35790000
*         %GO TO ENDPDMX;                                     /* @LNA*/ 35800000
*                                                                       35810000
*/*!PDMX event TTE                                                   */ 35820000
*/*!                                                                 */ 35830000
*/*!                                                                 */ 35840000
*/*!FORMATTED PDMX TTE:                                              */ 35850000
*/*!                                                                 */ 35860000
*/*!PR ASID TCB EMS  CD/D PSW ADDR U3 U4 U5 CLHS LOCAL PASD SASD TIME*/ 35870000
*/*!                               U6 U7 U8                          */ 35880000
*                                                                       35890000
*   DECLARE                                                             35900000
*     1    TTE00A   IHATTE_DEF2, /* PDMX event                   @LNA*/ 35910000
*       3    TTE00AW0 POINTER(31),  /* Word 0 (Same as common)   @LNA*/ 35920000
*         5  TTE00ATB POINTER(31),  /* <TCB>. CURRENT TCB ADDRESS OR    35930000
*                                      0. PSATOLD.               @LNA*/ 35940000
*       3    TTE00AW1 FIXED(32),    /* Word 1 (Same as common)   @LNA*/ 35950000
*         5  *        FIXED(16),    /*                           @LNA*/ 35960000
*         5  TTE00AHA FIXED(16),    /* <ASID>. HOME ADDRESS SPACE.      35970000
*                                      PSAAOLD-> ASCBASID.       @LNA*/ 35980000
*       3    TTE00AW2 FIXED(32),    /* Word 2                    @P8C*/ 35990000
*         5    TTE00ARA FIXED(32),  /* Return address            @P8C*/ 36000000
*       3    TTE00AW3 FIXED(32),    /* Word 3                    @P8C*/ 36010000
*         5  TTE00APFID FIXED(32),  /* PFID                      @LNA*/ 36020000
*            7 *     Fixed(16),     /*                           @LNA*/ 36030000
*            7 TTE00APFIDLow Fixed(16),/* Low half of PFID       @LNA*/ 36040000
*       3    TTE00AW4 FIXED(32),    /* Word 4                    @P8C*/ 36050000
*         5  TTE00AU1 FIXED(32),    /* Unique 1                  @LNA*/ 36060000
*            7 TTE00ADT FIXED(32),  /* Device type               @LNA*/ 36070000
*       3    TTE00AW5 FIXED(32),    /* Word 5                    @P8C*/ 36080000
*         5  TTE00AU2 FIXED(32),    /* Unique 2                  @LNA*/ 36090000
*            7 TTE00ACB FIXED(32),  /* Low half of callback@     @LNA*/ 36100000
*       3    TTE00AW6  FIXED(32),   /* Word 6                    @P8C*/ 36110000
*         5  TTE00AU3  CHAR(4),     /* Unique 3                  @LNA*/ 36120000
*            7 TTE00ACBP1 CHAR(4),  /* Callback parm bytes 0-3   @LNA*/ 36130000
*       3    TTE00AW7  FIXED(32),   /* Word 7                    @P8C*/ 36140000
*         5  TTE00AU4  CHAR(4),     /* Unique 4                  @LNA*/ 36150000
*            7 TTE00ACBP2 CHAR(4),  /* Callback parm bytes 4-7   @LNA*/ 36160000
*       3    TTE00AED CHARACTER(0) BOUNDARY(WORD); /* END OF PDMX       36170000
*                                      TTE.                      @LNA*/ 36180000
*%ENDPDMX:                                                              36190000
*   IF TTEALL ^= 'YES' %THEN        /* IF ALL ENTRY MAPPINGS IS NOT     36200000
*                                      SPECIFIED,                @LNA*/ 36210000
*     %IF TTEEX ^= 'YES' %THEN      /* ALL EXPLICIT TRACING MAPPINGS    36220000
*                                      IS NOT SPECIFIED,         @LNA*/ 36230000
*       %IF TTEAINT ^= 'YES' %THEN                            /* @LNA*/ 36240000
*         %GO TO ENDAINT;                                     /* @LNA*/ 36250000
*                                                                       36260000
*/*!AINT event TTE                                                   */ 36270000
*/*!                                                                 */ 36280000
*/*!                                                                 */ 36290000
*/*!FORMATTED AINT TTE:                                              */ 36300000
*/*!                                                                 */ 36310000
*/*!PR ASID TCB AINT CD/D PSW ADDR U3                                */ 36320000
*                                                                       36330000
*   DECLARE                                                             36340000
*     1    TTE10A   IHATTE_DEF2, /* AINT event                   @LNA*/ 36350000
*       3    TTE10AW0 FIXED(32),    /* Word 0                    @LNA*/ 36360000
*          5 TTE10ATB POINTER(31),  /* <TCB>. Current TCB Address       36370000
*                                       PSATOLD.                 @LNA*/ 36380000
*       3    TTE10AW1 FIXED(32),    /* Word 1                    @LNA*/ 36390000
*          5 *         FIXED(8),    /*                           @P8C*/ 36400000
*          5 TTE10AISM FIXED(8),    /* Adapter interrupt subclass       36410000
*                                      mask                      @P8C*/ 36420000
*          5 TTE10AHA FIXED(16),    /* <ASID>. Home Address space.      36430000
*                                      PSAAOLD-> ASCBASID.       @LNA*/ 36440000
*       3    TTE10AW2 FIXED(32),    /* Word 2                    @LNA*/ 36450000
*          5 TTE10APA FIXED(16),    /* <PASD>. PASID. Control           36460000
*                                      register 4.               @LNA*/ 36470000
*          5 TTE10ASA FIXED(16),    /* <SASD>. SASID. Control           36480000
*                                      register 3.               @LNA*/ 36490000
*       3    TTE10AW3 FIXED(32),    /* Word 3                    @LNA*/ 36500000
*          5 TTE10AU1 FIXED(32),    /* Unique 1                  @LNA*/ 36510000
*            7 *         CHAR(3),                                       36520000
*            7 TTE10AU1B3 CHAR(1),  /*                           @LNA*/ 36530000
*              9 *       BIT(2),    /*                           @P8C*/ 36540000
*              9 TTE10AISC BIT(3),  /* Adapter interrupt subclass bits  36550000
*                                                                @LNA*/ 36560000
*              9 *       BIT(3),    /*                           @P8C*/ 36570000
*       3    TTE10APW CHAR(16) BDY(WORD), /* I/O OLD PSW                36580000
*                                             FLCIOPSW.          @LNA*/ 36590000
*         5    TTE10AP1 FIXED(32),  /* PSW 0-3                   @LNA*/ 36600000
*         5    TTE10AP2 FIXED(32),  /* PSW 4-7                   @LNA*/ 36610000
*         5    TTE10AP3 FIXED(32),  /* PSW 8-B                   @LNA*/ 36620000
*         5    TTE10AP4 FIXED(32),  /* PSW C-F                   @LNA*/ 36630000
*       3    TTE10ALH FIXED(32),    /* <CLHS>. PSACLHS.          @P8A*/ 36640000
*       3    TTE10APL POINTER(31),  /* <LOCAL>. PSALOCAL.        @P8A*/ 36650000
*       3    TTE10ALE FIXED(32),    /* <CLHSE>. PSACLHSE.        @P8A*/ 36660000
*       3    TTE10AED CHARACTER(0) BOUNDARY(WORD); /* End of AINT       36670000
*                                      TTE.                      @LNA*/ 36680000
*%ENDAINT:                                                              36690000
*   IF TTEALL ^= 'YES' %THEN        /* IF ALL ENTRY MAPPINGS IS NOT     36700000
*                                      SPECIFIED,                @LNA*/ 36710000
*     %IF TTEEX ^= 'YES' %THEN      /* ALL EXPLICIT TRACING MAPPINGS    36720000
*                                      IS NOT SPECIFIED,         @LNA*/ 36730000
*       %IF TTEPCIL ^= 'YES' %THEN                            /* @LNA*/ 36740000
*         %GO TO ENDPCIL;                                     /* @LNA*/ 36750000
*                                                                       36760000
*/*!PCIL EVENT TTE                                                   */ 36770000
*/*!                                                                 */ 36780000
*/*!                                                                 */ 36790000
*/*!FORMATTED PCIL TTE:                                              */ 36800000
*/*!                                                                 */ 36810000
*/*!PR ASID TCB PCIS PFID CC RET   U1 U2 U3 CLHS LOCAL PASD SASD TIME*/ 36820000
*/*!                               U4 U5 U6                          */ 36830000
*/*!                               U7                                */ 36840000
*                                                                       36850000
*   DECLARE                                                             36860000
*     1    TTE20A   IHATTE_DEF2, /* PCIL/PCIS event              @LNA*/ 36870000
*       3    TTE20AW0 FIXED(32),    /* Word 0 (Same as common)   @LNA*/ 36880000
*         5  TTE20ATB POINTER(31),  /* <TCB>. CURRENT TCB ADDRESS OR    36890000
*                                      0. PSATOLD.               @LNA*/ 36900000
*       3    TTE20AW1 FIXED(32),    /* Word 1 (ASID as in common)@LNA*/ 36910000
*         5  *        FIXED(16),    /*                           @P8C*/ 36920000
*            7 *      FIXED(8),     /*                           @P8A*/ 36930000
*            7 TTE20ACC FIXED(8),   /* CC                        @P8M*/ 36940000
*         5  TTE20AHA FIXED(16),    /* <ASID>. HOME ADDRESS SPACE.      36950000
*                                      PSAAOLD-> ASCBASID.       @LNA*/ 36960000
*       3    TTE20AW2 FIXED(32),    /* Word 2                    @LNA*/ 36970000
*         5  TTE20ARet@ FIXED(32),  /* Return Address            @LNA*/ 36980000
*       3    TTE20AW3 FIXED(32),    /* Word 3                    @LNA*/ 36990000
*         5  TTE20AU1 FIXED(32),    /* Unique 1                  @LNA*/ 37000000
*           7  TTE20ATraceId Fixed(32), /* PCI trace identifier  @LNA*/ 37010000
*       3    TTE20AW4 FIXED(32),    /* Word 4                    @LNA*/ 37020000
*         5  TTE20APFID FIXED(32),  /* PFID                      @LNA*/ 37030000
*            7  *     FIXED(16),    /*                           @LNA*/ 37040000
*            7  TTE20APFIDLOW FIXED(16), /* low half of PFID     @LNA*/ 37050000
*       3    TTE20AW5 FIXED(32),    /* Word 5                    @LNA*/ 37060000
*         5  TTE20AU2 FIXED(32),    /* Unique 2                  @LNA*/ 37070000
*            7  TTE20AOP1HH FIXED(32), /* High half of operand 1 @LNA*/ 37080000
*       3    TTE20AW6 FIXED(32),    /* Word 6                    @LNA*/ 37090000
*         5  TTE20AU3 FIXED(32),    /* Unique 3                  @LNA*/ 37100000
*           7  TTE20AOP1LH FIXED(32), /* Low half of operand 1   @LNA*/ 37110000
*       3    TTE20AW7 FIXED(32),    /* Word 7                    @LNA*/ 37120000
*         5  TTE20AU4 FIXED(32),    /* Unique 4                  @LNA*/ 37130000
*           7  TTE20AOP2HH FIXED(32), /* High half of operand 2  @LNA*/ 37140000
*       3    TTE20AW8 FIXED(32),    /* Word 8                    @LNA*/ 37150000
*         5  TTE20AU5 FIXED(32),    /* Unique 5                  @LNA*/ 37160000
*           7  TTE20AOP2LH FIXED(32), /* Low half of operand 2   @LNA*/ 37170000
*       3    TTE20AW9  FIXED(32),   /* Word 9                    @LNA*/ 37180000
*         5  TTE20AU6 FIXED(32),    /* Unique 6                  @LNA*/ 37190000
*           7  TTE20AOP2PHH FIXED(32), /* High half of operand 2+1      37200000
*                                                                @LNA*/ 37210000
*       3    TTE20AW10 FIXED(32),   /* Word 10                   @LNA*/ 37220000
*         5  TTE20AU7 FIXED(32),    /* Unique 7 (under UNIQUE-1) @LNA*/ 37230000
*           7  TTE20AOP2PLH FIXED(32),/* Low half of operand 2+1        37240000
*                                                                @LNA*/ 37250000
*       3    TTE20AED CHARACTER(0) BOUNDARY(WORD); /* END OF PCIL/PCIS  37260000
*                                      TTE.                      @LNA*/ 37270000
*%ENDPCIL:                                                              37280000
*   IF TTEALL ^= 'YES' %THEN        /* IF ALL ENTRY MAPPINGS IS NOT     37290000
*                                      SPECIFIED,                @LNA*/ 37300000
*     %IF TTEEX ^= 'YES' %THEN      /* ALL EXPLICIT TRACING MAPPINGS    37310000
*                                      IS NOT SPECIFIED,         @LNA*/ 37320000
*       %IF TTEPCIS ^= 'YES' %THEN                            /* @LNA*/ 37330000
*         %GO TO ENDPCIS;                                     /* @LNA*/ 37340000
*                                                                       37350000
*/*!PCIS event TTE                                                   */ 37360000
*/*!                                                                 */ 37370000
*/*!                                                                 */ 37380000
*/*!FORMATTED PCIS TTE:                                              */ 37390000
*/*!                                                                 */ 37400000
*/*!PR ASID TCB PCIS PFID CC RET   U1 U2 U3 CLHS LOCAL PASD SASD TIME*/ 37410000
*/*!                               U4 U5 U6                          */ 37420000
*/*!                               U7                                */ 37430000
*                                                                       37440000
*   DECLARE                                                             37450000
*     1    TTE30A   IHATTE_DEF2, /* PCIL/PCIS event              @LNA*/ 37460000
*       3    TTE30AW0 FIXED(32),    /* Word 0 (Same as common)   @LNA*/ 37470000
*         5  TTE30ATB POINTER(31),  /* <TCB>. CURRENT TCB ADDRESS OR    37480000
*                                      0. PSATOLD.               @LNA*/ 37490000
*       3    TTE30AW1 FIXED(32),    /* Word 1 (ASID as in common)@LNA*/ 37500000
*         5  *        FIXED(16),    /*                           @P8C*/ 37510000
*            7 *      FIXED(8),     /*                           @P8A*/ 37520000
*            7 TTE30ACC FIXED(8),   /* CC                        @P8M*/ 37530000
*         5  TTE30AHA FIXED(16),    /* <ASID>. HOME ADDRESS SPACE.      37540000
*                                      PSAAOLD-> ASCBASID.       @LNA*/ 37550000
*       3    TTE30AW2 FIXED(32),    /* Word 2                    @LNA*/ 37560000
*         5  TTE30ARet@ FIXED(32),  /* Return Address            @LNA*/ 37570000
*       3    TTE30AW3 FIXED(32),    /* Word 3                    @LNA*/ 37580000
*         5  TTE30AU1 FIXED(32),    /* Unique 1                  @LNA*/ 37590000
*           7  TTE30ATraceId Fixed(32), /* PCI trace identifier  @LNA*/ 37600000
*       3    TTE30AW4 FIXED(32),    /* Word 4                    @LNA*/ 37610000
*         5  TTE30APFID FIXED(32),  /* PFID                      @LNA*/ 37620000
*            7  *     FIXED(16),    /*                           @LNA*/ 37630000
*            7  TTE30APFIDLOW FIXED(16), /* low half of PFID     @LNA*/ 37640000
*       3    TTE30AW5 FIXED(32),    /* Word 5                    @LNA*/ 37650000
*         5  TTE30AU2 FIXED(32),    /* Unique 2                  @LNA*/ 37660000
*            7  TTE30AOP1HH FIXED(32), /* High half of operand 1 @LNA*/ 37670000
*       3    TTE30AW6 FIXED(32),    /* Word 6                    @LNA*/ 37680000
*         5  TTE30AU3 FIXED(32),    /* Unique 3                  @LNA*/ 37690000
*           7  TTE30AOP1LH FIXED(32), /* Low half of operand 1   @LNA*/ 37700000
*       3    TTE30AW7 FIXED(32),    /* Word 7                    @LNA*/ 37710000
*         5  TTE30AU4 FIXED(32),    /* Unique 4                  @LNA*/ 37720000
*           7  TTE30AOP2HH FIXED(32), /* High half of operand 2  @LNA*/ 37730000
*       3    TTE30AW8 FIXED(32),    /* Word 8                    @LNA*/ 37740000
*         5  TTE30AU5 FIXED(32),    /* Unique 5                  @LNA*/ 37750000
*           7  TTE30AOP2LH FIXED(32), /* Low half of operand 2   @LNA*/ 37760000
*       3    TTE30AW9  FIXED(32),   /* Word 9                    @LNA*/ 37770000
*         5  TTE30AU6 FIXED(32),    /* Unique 6                  @LNA*/ 37780000
*           7  TTE30AOP2PHH FIXED(32), /* High half of operand 2+1      37790000
*                                                                @LNA*/ 37800000
*       3    TTE30AW10 FIXED(32),   /* Word 10                   @LNA*/ 37810000
*         5  TTE30AU7 FIXED(32),    /* Unique 7 (under UNIQUE-1) @LNA*/ 37820000
*           7  TTE30AOP2PLH FIXED(32),/* Low half of operand 2+1        37830000
*                                                                @LNA*/ 37840000
*       3    TTE30AED CHARACTER(0) BOUNDARY(WORD); /* END OF PCIL/PCIS  37850000
*                                      TTE.                      @LNA*/ 37860000
*%ENDPCIS:                                                              37870000
*   IF TTEALL ^= 'YES' %THEN        /* IF ALL ENTRY MAPPINGS IS NOT     37880000
*                                      SPECIFIED,                @04A*/ 37890000
*     %IF TTEEX ^= 'YES' %THEN      /* ALL EXPLICIT TRACING MAPPINGS    37900000
*                                      IS NOT SPECIFIED,         @04A*/ 37910000
*       %IF TTESYNS ^= 'YES' %THEN  /* IF SYNCHIO Start mapping is not  37920000
*                                      specified                 @04A*/ 37930000
*         %GO TO ENDSYNS;           /* Bypass mapping            @04A*/ 37940000
*                                                                       37950000
*/*!SYNS event TTE                                                   */ 37960000
*/*!                                                                 */ 37970000
*/*!                                                                 */ 37980000
*/*!FORMATTED SYNS TTE:                                              */ 37990000
*/*!                                                                 */ 37991000
*/*!PR ASID TCB SYNS devno t dd op pfid  iosbaddr len1len2 rr        */ 37992000
*/*!                               funchand                          */ 37993000
*                                                                       37994000
*   DECLARE                                                             37995000
*     1    TTE00C   IHATTE_DEF2, /* SYNS event                   @04A*/ 37996000
*       3    TTE00CW0 FIXED(32),    /* Word 0 (Same as common)   @04A*/ 37997000
*         5  TTE00CTB POINTER(31),  /* <TCB>. CURRENT TCB ADDRESS OR    37998000
*                                      0. PSATOLD.               @04A*/ 37999000
*       3    TTE00CW1 FIXED(32),    /* Word 1 (ASID as in common)@04A*/ 38000000
*         5  TTE00CDV FIXED(16),    /* Device number             @04C*/ 38000100
*         5  TTE00CHA FIXED(16),    /* <ASID>. HOME ADDRESS SPACE.      38000200
*                                      PSAAOLD-> ASCBASID.       @04A*/ 38000300
*       3    TTE00CW2 FIXED(32),    /* Word 2                    @04A*/ 38000400
*         5  TTE00CW2B1 Bit(8),     /* Word 2, Byte 1            @04A*/ 38000500
*            7  TTE00CSID Bit(4),   /* Subchannel set id of device      38000600
*                                      number                    @04A*/ 38000700
*            7  TTE00CTY Bit(4),    /* Type of request:                 38000800
*                                       O = Only     '00'               38000900
*                                       I = Initiate '01'               38001000
*                                       E = End      '10'        @04A*/ 38001100
*         5  TTE00CDRVID Fixed(8),  /* Driver ID                        38001200
*                                      Valid IDs mapped in IECDIOSB     38001300
*                                                                @04A*/ 38001400
*         5  TTE00COP Fixed(8),     /* Operation (command code)  @04A*/ 38001500
*         5  TTE00CRCnt Fixed(8),   /* Record count              @04A*/ 38001600
*       3    TTE00CW3 FIXED(32),    /* Word 3                    @04A*/ 38001700
*         5  TTE00CPfid Fixed(32),  /* PFID                      @04A*/ 38001800
*       3    TTE00CW4 FIXED(32),    /* Word 4                    @04A*/ 38001900
*         5  TTE00CFHnd Fixed(32),  /* Function handle           @04A*/ 38002000
*       3    TTE00CW5 FIXED(32),    /* Word 5                    @04A*/ 38002100
*         5  TTE00CIOSB@ Fixed(32), /* IOSB address              @04A*/ 38002200
*       3    TTE00CW6 FIXED(32),    /* Word 6                    @04A*/ 38002300
*         5  TTE00CLen1 Fixed(16),  /* First data length field   @04A*/ 38002400
*         5  TTE00CLen2 Fixed(16),  /* Second data length field  @04A*/ 38002500
*       3    TTE00CED CHARACTER(0) BOUNDARY(WORD); /* END OF SYNS TTE.  38002600
*                                                                @04A*/ 38002700
*%ENDSYNS:                                                              38002800
*   IF TTEALL ^= 'YES' %THEN        /* IF ALL ENTRY MAPPINGS IS NOT     38002900
*                                      SPECIFIED,                @04A*/ 38003000
*     %IF TTEEX ^= 'YES' %THEN      /* ALL EXPLICIT TRACING MAPPINGS    38004000
*                                      IS NOT SPECIFIED,         @04A*/ 38005000
*       %IF TTESYNE ^= 'YES' %THEN  /* IF SYNCHIO Start mapping is not  38005100
*                                      specified                 @04A*/ 38005200
*         %GO TO ENDSYNE;           /* Bypass mapping            @04A*/ 38005300
*                                                                       38005400
*/*!SYNE event TTE                                                   */ 38005500
*/*!                                                                 */ 38005600
*/*!                                                                 */ 38005700
*/*!FORMATTED SYNE TTE:                                              */ 38005800
*/*!                                                                 */ 38005900
*/*!PR ASID TCB SYNE devno t dd op pfid     iosbaddr len1len2 rr     */ 38006000
*/*!                               funchand rc rcq                   */ 38006100
*                                                                       38006200
*   DECLARE                                                             38006300
*     1    TTE10C   IHATTE_DEF2, /* SYNE event                   @04A*/ 38006400
*       3    TTE10CW0 FIXED(32),    /* Word 0 (Same as common)   @04A*/ 38006500
*         5  TTE10CTB POINTER(31),  /* <TCB>. CURRENT TCB ADDRESS OR    38006600
*                                      0. PSATOLD.               @04A*/ 38006700
*       3    TTE10CW1 FIXED(32),    /* Word 1 (ASID as in common)@04A*/ 38006800
*         5  *        FIXED(16),    /*                           @04C*/ 38006900
*         5  TTE10CHA FIXED(16),    /* <ASID>. HOME ADDRESS SPACE.      38007000
*                                      PSAAOLD-> ASCBASID.       @04A*/ 38008000
*       3    TTE10CW2 FIXED(32),    /* Word 2                    @04A*/ 38008100
*         5  TTE10CW2B1 Bit(8),     /* Word 2, Byte 1            @04A*/ 38008200
*            7  TTE10CSID Bit(4),   /* Subchannel set id of device      38008300
*                                      number                    @04A*/ 38008400
*            7  TTE10CTY Bit(4),    /* Type of request:                 38008500
*                                       O = Only     '00'               38008600
*                                       I = Initiate '01'               38008700
*                                       E = End      '10'        @04A*/ 38008800
*         5  TTE10CDRVID Fixed(8),  /* Driver ID                        38008900
*                                      Valid IDs mapped in IECDIOSB     38009000
*                                                                @04A*/ 38009100
*         5  TTE10COP Fixed(8),     /* Operation (command code)  @04A*/ 38009200
*         5  TTE10CRCnt Fixed(8),   /* Record count              @04A*/ 38009300
*       3    TTE10CW3 FIXED(32),    /* Word 3                    @04A*/ 38009400
*         5  TTE10CPfid Fixed(32),  /* PFID                      @04A*/ 38009500
*       3    TTE10CW4 FIXED(32),    /* Word 4                    @04A*/ 38009600
*         5  TTE10CFHnd Fixed(32),  /* Function handle           @04A*/ 38009700
*       3    TTE10CW5 FIXED(32),    /* Word 5                    @04A*/ 38009800
*         5  TTE10CIOSB@ Fixed(32), /* IOSB address              @04A*/ 38009900
*       3    TTE10CW6 FIXED(32),    /* Word 6                    @04A*/ 38010000
*         5  TTE10CLen1 Fixed(16),  /* First data length field   @04A*/ 38010100
*         5  TTE10CLen2 Fixed(16),  /* Second data length field  @04A*/ 38010200
*       3    TTE10CW7 FIXED(32),    /* Word 7                    @04A*/ 38010300
*         5  TTE10CRC Fixed(16),    /* Response code             @04A*/ 38010400
*         5  TTE10CRcq  Fixed(16),  /* Response code qualifier   @04A*/ 38010500
*       3    TTE10CED CHARACTER(0) BOUNDARY(WORD); /* END OF SYNE TTE.  38010600
*                                                                @04A*/ 38010700
*%ENDSYNE:                                                              38010800
*   IF TTEALL ^= 'YES'                                                  38010900
*      %THEN                                                            38011000
*     %IF TTEEX ^= 'YES' %THEN                                          38012000
*       %IF TTESUSP ^= 'YES' %THEN                                      38013000
*         %GO TO ENDSUSP;                                               38014000
*                                                                       38015000
*/*!SUSP - LOCK SUSPENSION TTE                                       */ 38016000
*/*!                                                                 */ 38017000
*/*!                                                                 */ 38018000
*/*!FORMATTED SUSP TTE:                                              */ 38019000
*/*!                                                                 */ 38020000
*/*!PR ASID TCB SUSP          ADDR U1 U2 U3 CLHS LOCAL           TIME*/ 38030000
*/*!                               U4       CLHSE                    */ 38040000
*                                                                       38050000
*   DECLARE                                                             38060000
*     1    TTE019   IHATTE_DEF2, /* SUSPENSION (SUSP).               */ 38070000
*       3    TTE019TB POINTER(31),  /* <TCB>. ADDRESS OF SUSPENDED      38080000
*                                      TCB OR RELATED TCB. INPUT        38090000
*                                      REGISTER 4 OR SSRBPTR(R4)->      38100000
*                                      SRBPTCB.                      */ 38110000
*       3    TTE019R1 FIXED(16),    /* RESERVED.                     */ 38120000
*       3    TTE019HA FIXED(16),    /* <ASID>. HOME ADDRESS SPACE.      38130000
*                                      PSAAOLD-> ASCBASID.           */ 38140000
*       3    TTE019RT POINTER(31),  /* <ADDR>. RETURN ADDRESS FOR THE   38150000
*                                      CALLER OF THE SERVICE ROUTINE.   38160000
*                                      INPUT REGISTER 14.            */ 38170000
*       3    TTE019RB POINTER(31),  /* <U1>. ADDRESS OF SUSPENDED RB    38180000
*                                      OR 0. INPUT REGISTER 5.       */ 38190000
*       3    TTE019SB POINTER(31),  /* <U4>. ADDRESS OF SUSPENDED SRB   38200000
*                                      OR 0. INPUT REGISTER 4 OR 0.  */ 38210000
*       3    TTE019SI CHARACTER(4), /* <U2>. EBCDIC SUSPENSION TYPE     38220000
*                                      IDENTIFIER: CEDQ, CLAT CML,      38230000
*                                      CMS, CSMF LOCL * INPUT           38240000
*                                      REGISTER 12.                  */ 38250000
*       3    TTE019AD POINTER(31),  /* <U3>. ADDRESS ASSOCIATED WITH    38260000
*                                      SUSPENSION OR 0: CEDQ -          38270000
*                                      LOCKWORD ADDRESS. CLAT -         38280000
*                                      LOCKWORD ADDRESS. CML - ASCB     38290000
*                                      ADDRESS FOR CML LOCK             38300000
*                                      REQUESTED. CMS - LOCKWORD        38310000
*                                      ADDRESS. CSMF - LOCKWORD         38320000
*                                      ADDRESS. LOCL - 0. * INPUT       38330000
*                                      REGISTER 11.                  */ 38340000
*       3    TTE019LH FIXED(32),    /* <CLHS>. INPUT REGISTER 2. @P1C*/ 38350000
*       3    TTE019PL POINTER(31),  /* <LOCAL>. INPUT REGISTER 3.       38360000
*                                                                @P1C*/ 38370000
*       3    TTE019LE FIXED(32),    /* <CLHSE>. PSACLHSE.        @L4A*/ 38380000
*       3    TTE019ED CHARACTER(0) BOUNDARY(WORD); /* END OF SUSP       38390000
*                                      TTE.                          */ 38400000
*%ENDSUSP:                                                              38410000
*   IF TTEALL ^= 'YES'                                                  38420000
*      %THEN                                                            38430000
*     %IF TTEEX ^= 'YES' %THEN                                          38440000
*       %IF TTESVC ^= 'YES' %THEN                                       38450000
*         %GO TO ENDSVC;                                                38460000
*                                                                       38470000
*/*!SVC - SVC INTERRUPT TTE                                          */ 38480000
*/*!                                                                 */ 38490000
*/*!                                                                 */ 38500000
*/*!FORMATTED SVC TTE:                                               */ 38510000
*/*!                                                                 */ 38520000
*/*!PR ASID TCB SVC  CD/D PSW ADDR U1 U2 U3                      TIME*/ 38530000
*/*!                                                                 */ 38540000
*                                                                       38550000
*   DECLARE                                                             38560000
*     1    TTE005   IHATTE_DEF2, /* GENERAL SVC INTERRUPT (SVC)      */ 38570000
*       3    TTE005TB POINTER(31),  /* <TCB>. CURRENT TCB ADDRESS OR    38580000
*                                      0. PSATOLD.                   */ 38590000
*       3    TTE005SN FIXED(16),    /* <CD/D>. SVC NUMBER. FLCSVCN.  */ 38600000
*       3    TTE005HA FIXED(16),    /* <ASID>. HOME ADDRESS SPACE.      38610000
*                                      PSAAOLD->ASCBASID.            */ 38620000
*       3    TTE005PW CHARACTER(16) BOUNDARY(WORD), /* <PSW ADDR>. SVC  38630000
*                                      OLD PSW. FLCSOPSW.        @LLC*/ 38640000
*         5    TTE005P1 CHARACTER(4), /* PSW 0-3                 @LLC*/ 38650000
*         5    TTE005P2 CHARACTER(4), /* PSW 4-7                 @LLC*/ 38660000
*         5    TTE005P3 CHARACTER(4), /* PSW 8-B                 @LLA*/ 38670000
*         5    TTE005P4 CHARACTER(4), /* PSW C-F                 @LLA*/ 38680000
*       3    TTE005GF FIXED(32),    /* <U1>. REGISTER 15 CONTENTS.      38690000
*                                      INPUT REGISTER 15.            */ 38700000
*       3    TTE005G0 FIXED(32),    /* <U2>. REGISTER 0 CONTENTS.       38710000
*                                      INPUT REGISTER 0.             */ 38720000
*       3    TTE005G1 FIXED(32),    /* <U3>. REGISTER 1 CONTENTS.       38730000
*                                      INPUT REGISTER 1.             */ 38740000
*       3    TTE005ED CHARACTER(0) BOUNDARY(WORD); /* END OF SVC TTE.*/ 38750000
*%ENDSVC:                                                               38760000
*   IF TTEALL ^= 'YES'                                                  38770000
*      %THEN                                                            38780000
*     %IF TTEEX ^= 'YES' %THEN                                          38790000
*       %IF TTESVC ^= 'YES' %THEN                                       38800000
*         %GO TO ENDSVCE;                                               38810000
*                                                                       38820000
*/*!SVCE - SVC ERROR TTE                                             */ 38830000
*/*!                                                                 */ 38840000
*/*!                                                                 */ 38850000
*/*!FORMATTED SVCE TTE:                                              */ 38860000
*/*!                                                                 */ 38870000
*/*!PR ASID TCB SVCE CD/D PSW ADDR U1 U2 U3 CLHS LOCAL PASD SASD TIME*/ 38880000
*/*!                               U4       CLHSE                    */ 38890000
*                                                                       38900000
*   DECLARE                                                             38910000
*     1    TTEF05   IHATTE_DEF2, /* SVC ERROR (SVCE).                */ 38920000
*       3    TTEF05TB POINTER(31),  /* <TCB>. CURRENT TCB ADDRESS OR    38930000
*                                      0. PSATOLD.                   */ 38940000
*       3    TTEF05SN FIXED(16),    /* <CD/D>. SVC NUMBER. FLCSVCN.  */ 38950000
*       3    TTEF05HA FIXED(16),    /* <ASID>. HOME ADDRESS SPACE.      38960000
*                                      PSAAOLD->ASCBASID.            */ 38970000
*       3    TTEF05PA FIXED(16),    /* <PASD>. PASID. CONTROL           38980000
*                                      REGISTER 4.                   */ 38990000
*       3    TTEF05SA FIXED(16),    /* <SASD>. SASID. CONTROL           39000000
*                                      REGISTER 3.                   */ 39010000
*       3    TTEF05PW CHARACTER(16) BOUNDARY(WORD), /* <PSW ADDR>. SVC  39020000
*                                      OLD PSW. FLCSOPSW.        @LLC*/ 39030000
*         5    TTEF05P1 CHARACTER(4), /* PSW 0-3                 @LLC*/ 39040000
*         5    TTEF05P2 CHARACTER(4), /* PSW 4-7                 @LLC*/ 39050000
*         5    TTEF05P3 CHARACTER(4), /* PSW 8-B                 @LLA*/ 39060000
*         5    TTEF05P4 CHARACTER(4), /* PSW C-F                 @LLA*/ 39070000
*       3    TTEF05GF FIXED(32),    /* <U1>. REGISTER 15 CONTENTS.      39080000
*                                      INPUT REGISTER 15.            */ 39090000
*       3    TTEF05G0 FIXED(32),    /* <U2>. REGISTER 0 CONTENTS.       39100000
*                                      INPUT REGISTER 0.             */ 39110000
*       3    TTEF05G1 FIXED(32),    /* <U3>. REGISTER 1 CONTENTS.       39120000
*                                      INPUT REGISTER 1.             */ 39130000
*       3    TTEF05MW FIXED(32),    /* <U4>. PSAMODEW.               */ 39140000
*       3    TTEF05LH FIXED(32),    /* <CLHS>. PSACLHS.              */ 39150000
*       3    TTEF05PL POINTER(31),  /* <LOCAL>. PSALOCAL.            */ 39160000
*       3    TTEF05LE FIXED(32),    /* <CLHSE>. PSACLHSE.            */ 39170000
*       3    TTEF05ED CHARACTER(0) BOUNDARY(WORD); /* END OF SVCE       39180000
*                                      TTE.                          */ 39190000
*%ENDSVCE:                                                              39200000
*   IF TTEALL ^= 'YES'                                                  39210000
*      %THEN                                                            39220000
*     %IF TTEEX ^= 'YES' %THEN                                          39230000
*       %IF TTESVC ^= 'YES' %THEN                                       39240000
*         %GO TO ENDSVCR;                                               39250000
*                                                                       39260000
*/*!SVCR - SVC RETURN TTE                                            */ 39270000
*/*!                                                                 */ 39280000
*/*!                                                                 */ 39290000
*/*!FORMATTED SVCR TTE:                                              */ 39300000
*/*!                                                                 */ 39310000
*/*!PR ASID TCB SVCR CD/D PSW ADDR U1 U2 U3                      TIME*/ 39320000
*/*!                                                                 */ 39330000
*                                                                       39340000
*   DECLARE                                                             39350000
*     1    TTE105   IHATTE_DEF2, /* SVC RETURN (SVCR).               */ 39360000
*       3    TTE105TB POINTER(31),  /* <TCB>. CURRENT TCB ADDRESS.      39370000
*                                      PSATOLD.                      */ 39380000
*       3    TTE105SN FIXED(16),    /* <CD/D>. SVC NUMBER.              39390000
*                                      ((PSATOLD-> TCBRBP)-             39400000
*                                      RBPRFLNA)-> RBINTCOD.         */ 39410000
*       3    TTE105HA FIXED(16),    /* <ASID>. HOME ADDRESS SPACE.      39420000
*                                      PSAAOLD-> ASCBASID.           */ 39430000
*       3    TTE105PW CHARACTER(16) BOUNDARY(WORD), /* <PSW ADDR>. PSW  39440000
*                                      TO RECEIVE CONTROL ON            39450000
*                                      REDISPATCH. PSATOLD-> TCBRBP->   39460000
*                                      RBOPSW.                   @LLC*/ 39470000
*         5    TTE105P1 CHARACTER(4), /* PSW 0-3                 @LLC*/ 39480000
*         5    TTE105P2 CHARACTER(4), /* PSW 4-7                 @LLC*/ 39490000
*         5    TTE105P3 CHARACTER(4), /* PSW 8-B                 @LLA*/ 39500000
*         5    TTE105P4 CHARACTER(4), /* PSW C-F                 @LLA*/ 39510000
*       3    TTE105GF FIXED(32),    /* <U1>. REGISTER 15 CONTENTS.      39520000
*                                      INPUT REGISTER 15.            */ 39530000
*       3    TTE105G0 FIXED(32),    /* <U2>. REGISTER 0 CONTENTS.       39540000
*                                      INPUT REGISTER 0.             */ 39550000
*       3    TTE105G1 FIXED(32),    /* <U3>. REGISTER 1 CONTENTS.       39560000
*                                      INPUT REGISTER 1.             */ 39570000
*       3    TTE105ED CHARACTER(0) BOUNDARY(WORD); /* END OF SVCR       39580000
*                                      TTE.                          */ 39590000
*%ENDSVCR:                                                              39600000
*   IF TTEALL ^= 'YES'                                                  39610000
*      %THEN                        /* IF ALL ENTRY MAPPINGS IS NOT     39620000
*                                      SPECIFIED,                @L2A*/ 39630000
*     %IF TTEEX ^= 'YES' %THEN      /* ALL EXPLICIT TRACING MAPPINGS    39640000
*                                      IS NOT SPECIFIED,         @L2A*/ 39650000
*       %IF TTESSRV ^= 'YES' %THEN                                      39660000
*         %GO TO ENDSSRV;                                               39670000
*                                                                       39680000
*/*!SSRV - PC OR BRANCH ENTERED SYSTEM SERVICE TTE                   */ 39690000
*/*!                                                                 */ 39700000
*/*!                                                                 */ 39710000
*/*!FORMATTED SSRV TTE:                                              */ 39720000
*/*!                                                                 */ 39730000
*/*!PR ASID TCB SSRV CD/D     ADDR U1 U2 U3 U4                   TIME*/ 39740000
*/*!                                                                 */ 39750000
*                                                                       39760000
*   DECLARE                                                             39770000
*     1    TTE205   IHATTE_DEF2, /* PC OR BRANCH ENTERED SYSTEM         39780000
*                                      SERVICE (SSRV).           @L2A*/ 39790000
*       3    TTE205TB POINTER(31),  /* <TCB>. CURRENT TCB ADDRESS OR    39800000
*                                      0. PSATOLD.               @L2A*/ 39810000
*       3    TTE205SI FIXED(16),    /* <CD/D>. ASSOCIATED SERVICE       39820000
*                                      IDENTIFIER NUMBER.        @L2A*/ 39830000
*       3    TTE205HA FIXED(16),    /* <ASID>. HOME ADDRESS SPACE.      39840000
*                                      PSAAOLD-> ASCBASID.       @L2A*/ 39850000
*       3    TTE205CI POINTER(31),  /* <ADDR>. RETURN ADDRESS OF THE    39860000
*                                      CALLER OF THE BRANCH ENTERED     39870000
*                                      SERVICE OR OF THE PC ENTERED     39880000
*                                      SERVICE.                  @L2A*/ 39890000
*       3    TTE205U1 FIXED(32),    /* <U1>. 1ST WORD OF INFORMATION    39900000
*                                      UNIQUE FOR ASSOCIATED SERVICE    39910000
*                                      IDENTIFIER.               @L2A*/ 39920000
*       3    TTE205U2 FIXED(32),    /* <U2>. 2ND WORD OF INFORMATION    39930000
*                                      UNIQUE FOR ASSOCIATED SERVICE    39940000
*                                      IDENTIFIER.               @L2A*/ 39950000
*       3    TTE205U3 FIXED(32),    /* <U3>. 3RD WORD OF INFORMATION    39960000
*                                      UNIQUE FOR ASSOCIATED SERVICE    39970000
*                                      IDENTIFIER.               @L2A*/ 39980000
*       3    TTE205U4 FIXED(32),    /* <U4>. 4TH WORD OF INFORMATION    39990000
*                                      UNIQUE FOR ASSOCIATED SERVICE    40000000
*                                      IDENTIFIER.               @L2A*/ 40010000
*       3    TTE205ED CHARACTER(0) BOUNDARY(WORD); /* END OF SSRV       40020000
*                                      TTE.                      @L2A*/ 40030000
*                                                                       40040000
*/*!SSRV - TTE for IARV64 Requests                                   */ 40050000
*/*!                                                                 */ 40060000
*/*!                                                                 */ 40070000
*/*!Formatted SSRV IARV64 TTE:                                       */ 40080000
*/*!                                                                 */ 40090000
*/*!PR ASID TCB SSRV CD/D     ADDR U1  U2  U3                    TIME*/ 40100000
*/*!                               U4  U5  U6                        */ 40110000
*/*!                               U7  U8  U9                        */ 40120000
*/*!                               U10 U11 U12                       */ 40130000
*/*!                                                                 */ 40140000
*                                                                       40150000
*   DECLARE                                                             40160000
*     1    TTEV64   IHATTE_DEF2, /* IARV64 request               @LDA*/ 40170000
*       3    TTEV64TB POINTER(31),  /* <TCB>. CURRENT TCB ADDRESS OR    40180000
*                                      0. PSATOLD.               @LDA*/ 40190000
*       3    TTEV64SI FIXED(16),    /* <CD/D>. ASSOCIATED SERVICE       40200000
*                                      IDENTIFIER NUMBER.        @LDA*/ 40210000
*       3    TTEV64HA FIXED(16),    /* <ASID>. HOME ADDRESS SPACE.      40220000
*                                      PSAAOLD-> ASCBASID.       @LDA*/ 40230000
*       3    TTEV64W1 FIXED(32),    /* <ADDR> WORD1 - REQUEST TYPE      40240000
*                                      AND MISC FLAGS.           @LDA*/ 40250000
*       3    TTEV64W2 FIXED(32),    /* <U1> WORD2 - ABEND/RETURN        40260000
*                                      CODE.                     @LDA*/ 40270000
*       3    TTEV64W3 FIXED(32),    /* <U2> WORD3 - REASON CODE  @LDA*/ 40280000
*       3    TTEV64W4 FIXED(32),    /* <U3> WORD4 - ALET         @LDA*/ 40290000
*       3    TTEV64D1 CHAR(8),      /* <U4 U5> DOUBLEWORD1 - DATA       40300000
*                                      SPECIFIC TO IARV64 REQUEST       40310000
*                                                                @LDA*/ 40320000
*         5    TTEV64WA CHAR(4),    /* <U4> FIRST WORD OF D1     @LDA*/ 40330000
*         5    TTEV64WB CHAR(4),    /* <U5> SECOND WORD OF D1    @LDA*/ 40340000
*       3    TTEV64D2 CHAR(8),      /* <U7 U8> DOUBLEWORD2 - DATA       40350000
*                                      SPECIFIC TO IARV64 REQUEST       40360000
*                                                                @LDA*/ 40370000
*         5    TTEV64WC CHAR(4),    /* <U7> FIRST WORD OF D2     @LDA*/ 40380000
*         5    TTEV64WD CHAR(4),    /* <U8> SECOND WORD OF D2    @LDA*/ 40390000
*       3    TTEV64D3 CHAR(8),      /* <U10 U11> DOUBLEWORD3 - DATA     40400000
*                                      SPECIFIC TO IARV64 REQUEST       40410000
*                                                                @LDA*/ 40420000
*         5    TTEV64WE CHAR(4),    /* <U10> FIRST WORD OF D3    @LDA*/ 40430000
*         5    TTEV64WF CHAR(4),    /* <U11> SECOND WORD OF D3   @LDA*/ 40440000
*       3    TTEV64ED CHARACTER(0) BOUNDARY(WORD); /* END OF SSRV V64   40450000
*                                      TTE.                      @LDA*/ 40460000
*                                                                       40470000
*/*!SSRV - TTE FOR CF CPU REQUESTS                                   */ 40480000
*/*!                                                                 */ 40490000
*/*!Formatted SSRV CF CPU TTE:                                       */ 40500000
*/*!                                                                 */ 40510000
*/*!PR ASID TCB SSRV CD/D     ADDR U1  U2  U3                    TIME*/ 40520000
*/*!                               U4  U5                            */ 40530000
*/*!                                                                 */ 40540000
*                                                                       40550000
*   DECLARE                                                             40560000
*     1    TTECFC   IHATTE_DEF2, /* CF CPU SSRV                  @LKA*/ 40570000
*       3    TTECFCTB POINTER(31),  /* <TCB> CURRENT TCB ADDRESS OR     40580000
*                                      0. PSATOLD.               @LKA*/ 40590000
*       3    TTECFCSI FIXED(16),    /* <CD/D> SSRVID. ASSOCIATED        40600000
*                                      SERVICE IDENTIFIER NUMBER        40610000
*                                      ('1050'x).                @LKA*/ 40620000
*       3    TTECFCHA FIXED(16),    /* <ASID> HOME ADDRESS SPACE.       40630000
*                                      PSAAOLD->ASCBASID.        @LKA*/ 40640000
*       3    TTECFCPW FIXED(32),    /* <PSW ADDR> - TARGET CPU,         40650000
*                                      FLAGS, DIRECTION AND SOURCE.     40660000
*                                                                @LKA*/ 40670000
*       3    TTECFCU1 FIXED(32),    /* <U1> COPY OF RGD_SCPU_RC  @LKA*/ 40680000
*       3    TTECFCU2 FIXED(32),    /* <U2> - START OF                  40690000
*                                      CSD_CPU_ALIVE.            @LKA*/ 40700000
*       3    TTECFCU3 FIXED(32),    /* <U3>                      @LKA*/ 40710000
*       3    TTECFCU4 FIXED(32),    /* <U4>                      @LKA*/ 40720000
*       3    TTECFCU5 FIXED(32),    /* <U5> - END OF CSD_CPU_ALIVE.     40730000
*                                                                @LKA*/ 40740000
*       3    TTECFCED CHARACTER(0) BOUNDARY(WORD); /* END OF SSRV       40750000
*                                      CF CPU TTE.               @LKA*/ 40760000
*                                                                       40770000
*%ENDSSRV:                                                              40780000
*   IF TTEALL ^= 'YES'                                                  40790000
*      %THEN                                                            40800000
*     %IF TTEEX ^= 'YES' %THEN                                          40810000
*       %IF TTEUSRNG ^= 'YES' %THEN /* TRACG RECORD ??           @LGA*/ 40820000
*         %GO TO ENDUSRNG;                                              40830000
*                                                                       40840000
*/*!USRN - USER EVENT TTE TRACG INSTRUCTION SUPPORT                  */ 40850000
*/*!                                                                 */ 40860000
*/*!                                                                 */ 40870000
*/*!FORMATTED USRN TTE:                                              */ 40880000
*/*!                                                                 */ 40890000
*/*!PR ASID TCB USRN          ADDR U1 U2 U3            PASD SASD TIME*/ 40900000
*/*!                               U4 U5 U6                          */ 40910000
*/*!                                                                 */ 40920000
*/*! U1-U6 ARE OPTIONAL USER DATA FIELDS.                            */ 40930000
*/*! TTE07FCE IS FORMATTED IN FIELD <U1> ONLY IF CONTINUATION        */ 40940000
*/*! IS INDICATED BY NONZERO.                                        */ 40950000
*/*!                                                                 */ 40960000
*                                                                       40970000
*   DECLARE                                                             40980000
*     1    TTE07FE  IHATTE_DEF3,    /* USER EVENT TRACE (USRN).  @LGA*/ 40990005
*       3   TTE07FTE POINTER(31),   /* <TCB>. CURRENT TCB ADDRESS OR    41020005
*                                      0. PSATOLD.               @LQC*/ 41030009
*       3    TTE07FDE FIXED(16),    /* RESERVED.                 @LQC*/ 41060009
*       3    TTE07FHE FIXED(16),    /* <ASID>. HOME ADDRESS SPACE.      41070005
*                                      PSAAOLD-> ASCBASID.       @LQC*/ 41080009
*       3    TTE07FPE FIXED(16),    /* <PASD>. PASID. CONTROL           41110005
*                                      REGISTER 4.               @LQC*/ 41120009
*       3    TTE07FSE FIXED(16),    /* <SASD>. SASID. CONTROL           41130005
*                                      REGISTER 3.               @LQC*/ 41140009
*       3    TTE07FCE Fixed(32),    /* Continuation information  @LQC*/ 41201009
*         5    TTE07FIE FIXED(16),  /* PTRACE IDENTIFICATION COUNT.     41210005
*                                      PSATRVT->TRVTTOB->TOBTRCI @LQC*/ 41220009
*         5    TTE07FRE FIXED(16),  /* RELATIVE BYTE COUNT.             41230005
*                                      GENERATED.                @LQC*/ 41240009
*       3    TTE07FAE CHARACTER(8) BOUNDARY(WORD), /* <ADDR>. USER      41241005
*                                      RETURN ADDRESS. INPUT REGISTER   41242005
*                                      14.                       @LQM*/ 41243009
*     TTE07FME FIXED(31) CONSTANT(7); /* MAXIMUM NUMBER OF DATA WORDS   41250010
*                                      PER USER ENTRY.           @LQC*/ 41260012
*/*!                                                                 */ 41261005
*/*!    Pre-z/OS 2.5 mapping                                     @LQA*/ 41262009
*/*!                                                                 */ 41263005
*   DECLARE                                                             41264005
*     1    TTE07FE_pre25 IHATTE_DEF3, /* USER EVENT TRACE (USRN).@LQA*/ 41265009
*       3    *        CHARACTER(8) BOUNDARY(WORD),                      41266005
*         5    *        CHARACTER(4), /* RESERVED.               @LQA*/ 41267009
*         5    TTE07FTE_pre25 POINTER(31), /* <TCB>. CURRENT TCB        41268006
*                                      address or 0. PSATOLD.    @LQA*/ 41269009
*       3    *        CHARACTER(8) BOUNDARY(WORD),                      41269105
*         5    *        CHARACTER(4), /* RESERVED.               @LQA*/ 41269209
*         5    TTE07FDE_pre25 FIXED(16), /* RESERVED.            @LQA*/ 41269309
*         5    TTE07FHE_pre25 FIXED(16), /* <ASID>. HOME ADDRESS SPACE. 41269406
*                                      PSAAOLD-> ASCBASID.       @LQA*/ 41269509
*       3    *        CHARACTER(8) BOUNDARY(WORD),                      41269605
*         5    *        CHARACTER(4), /* RESERVED.               @LQA*/ 41269709
*         5    TTE07FPE_pre25 FIXED(16), /* <PASD>. PASID. CONTROL      41269806
*                                      REGISTER 4.               @LQA*/ 41269909
*         5    TTE07FSE_pre25 FIXED(16), /* <SASD>. SASID. CONTROL      41270006
*                                      REGISTER 3.               @LQA*/ 41270109
*       3    TTE07FAE_pre25 CHARACTER(8) BOUNDARY(WORD), /* <ADDR>.     41270206
*                                      User RETURN ADDRESS. INPUT       41270306
*                                      register 14.              @LQA*/ 41270409
*       3    *        CHARACTER(8) BOUNDARY(WORD), /*            @LQA*/ 41270509
*         5    *        CHARACTER(4), /* RESERVED.               @LQA*/ 41270609
*         5    TTE07FCE_pre25 Fixed(32), /* Continuation information    41270706
*                                                                @LQA*/ 41270809
*           7    TTE07FIE_pre25 FIXED(16), /* PTRACE IDENTIFICATION     41270906
*                                        count                          41271005
*                                      PSATRVT->TRVTTOB->TOBTRCI @LQA*/ 41271109
*           7    TTE07FRE_pre25 FIXED(16); /* RELATIVE BYTE COUNT.      41271206
*                                      GENERATED.                @LQA*/ 41271309
*%ENDUSRNG:                                                             41272000
*   IF TTEALL ^= 'YES'                                                  41280000
*      %THEN                                                            41290000
*     %IF TTEEX ^= 'YES' %THEN                                          41300000
*       %IF TTEUSRN ^= 'YES' %THEN                                      41310000
*         %GO TO ENDUSRN;                                               41320000
*                                                                       41330000
*/*!USRN - USER EVENT TTE                                            */ 41340000
*/*!                                                                 */ 41350000
*/*!                                                                 */ 41360000
*/*!FORMATTED USRN TTE:                                              */ 41370000
*/*!                                                                 */ 41380000
*/*!PR ASID TCB USRN          ADDR U1 U2 U3            PASD SASD TIME*/ 41390000
*/*!                               U4 U5 U6                          */ 41400000
*/*!                                                                 */ 41410000
*/*! U1-U6 ARE OPTIONAL USER DATA FIELDS.                            */ 41420000
*/*! TTE07FCI IS FORMATTED IN FIELD <U1> ONLY IF CONTINUATION        */ 41430000
*/*! IS INDICATED BY NONZERO.                                        */ 41440000
*/*!                                                                 */ 41450000
*                                                                       41460000
*   DECLARE                                                             41470000
*     1    TTE07F   IHATTE_DEF2, /* USER EVENT TRACE (USRN).         */ 41480000
*       3    TTE07FTB POINTER(31),  /* <TCB>. CURRENT TCB ADDRESS OR    41490000
*                                      0. PSATOLD.                   */ 41500000
*       3    TTE07FRV FIXED(16),    /* RESERVED.                     */ 41510000
*       3    TTE07FHA FIXED(16),    /* <ASID>. HOME ADDRESS SPACE.      41520000
*                                      PSAAOLD-> ASCBASID.           */ 41530000
*       3    TTE07FPA FIXED(16),    /* <PASD>. PASID. CONTROL           41540000
*                                      REGISTER 4.                   */ 41550000
*       3    TTE07FSA FIXED(16),    /* <SASD>. SASID. CONTROL           41560000
*                                      REGISTER 3.                   */ 41570000
*       3    TTE07FAD POINTER(31),  /* <ADDR>. USER RETURN ADDRESS.     41580000
*                                      INPUT REGISTER 14.            */ 41590000
*       3    TTE07FCI FIXED(32),    /* <U1>. CONTINUATION               41600000
*                                      INFORMATION.                  */ 41610000
*         5    TTE07FPI FIXED(16),  /* PTRACE IDENTIFICATION COUNT.     41620000
*                                      PSATRVT-> TRVTTOB-> TOBTRCI.  */ 41630000
*         5    TTE07FRB FIXED(16),  /* RELATIVE BYTE COUNT.             41640000
*                                      GENERATED.                    */ 41650000
*     TTE07FMW FIXED(31) CONSTANT(5); /* MAXIMUM NUMBER OF DATA WORDS   41660000
*                                      PER USER ENTRY.               */ 41670000
*%ENDUSRN:                                                              41680000
*   IF TTEALL ^= 'YES'                                                  41690000
*      %THEN                                                            41700000
*     %IF TTEEX ^= 'YES' %THEN                                          41710000
*       %IF TTEDSP ^= 'YES' %THEN                                       41720000
*         %GO TO ENDWAIT;                                               41730000
*                                                                       41740000
*/*!WAIT - WAIT DISPATCH TTE                                         */ 41750000
*/*!                                                                 */ 41760000
*/*!                                                                 */ 41770000
*/*!FORMATTED WAIT TTE:                                              */ 41780000
*/*!                                                                 */ 41790000
*/*!PR ASID TCB WAIT                                             TIME*/ 41800000
*/*!                                                                 */ 41810000
*                                                                       41820000
*   DECLARE                                                             41830000
*     1    TTEF0F   IHATTE_DEF2, /* WAIT DISPATCH (WAIT).            */ 41840000
*       3    TTEF0FTB POINTER(31),  /* <TCB>. CURRENT TCB ADDRESS.      41850000
*                                      PSATOLD.                      */ 41860000
*       3    TTEF0FR1 FIXED(16),    /* RESERVED.                     */ 41870000
*       3    TTEF0FHA FIXED(16),    /* <ASID>. HOME ADDRESS SPACE.      41880000
*                                      PSAAOLD-> ASCBASID.           */ 41890000
*       3    TTEF0FED CHARACTER(0) BOUNDARY(WORD); /* END OF WAIT       41900000
*                                      TTE.                          */ 41910000
*%ENDWAIT:                                                              41920000
*   IF TTEALL ^= 'YES'                                                  41930000
*      %THEN                        /* IF ALL ENTRY MAPPINGS IS NOT     41940000
*                                      SPECIFIED,                @L3A*/ 41950000
*     %IF TTEEX ^= 'YES' %THEN      /* ALL EXPLICIT TRACING MAPPINGS    41960000
*                                      IS NOT SPECIFIED,         @L3A*/ 41970000
*       %IF TTERCVY ^= 'YES' %THEN                                      41980000
*         %GO TO ENDRCVY;                                               41990000
*                                                                       42000000
*/*!RCVY - RECOVERY EVENT TTE                                        */ 42010000
*/*!                                                                 */ 42020000
*/*!                                                                 */ 42030000
*/*!FORMATTED RCVY TTE:                                              */ 42040000
*/*!                                                                 */ 42050000
*/*!PR ASID TCB EMS  CD/D PSW ADDR U3 U4 U5 CLHS LOCAL PASD SASD TIME*/ 42060000
*/*!                               U6 U7 U8 CLHSE                    */ 42070000
*                                                                       42080000
*   DECLARE                                                             42090000
*     1    TTE01D   IHATTE_DEF2, /* RECOVERY EVENT (RCVY).       @L3A*/ 42100000
*       3    TTE01DTB POINTER(31),  /* <TCB>. CURRENT TCB ADDRESS OR    42110000
*                                      0. PSATOLD.               @L3A*/ 42120000
*       3    TTE01DSI FIXED(16),    /* RCVY SUBTYPE CODE         @L3A*/ 42130000
*       3    TTE01DHA FIXED(16),    /* <ASID>. HOME ADDRESS SPACE.      42140000
*                                      PSAAOLD-> ASCBASID.       @L3A*/ 42150000
*       3    TTE01DLH FIXED(32),    /* <CLHS>. PSACLHS.          @L3A*/ 42160000
*       3    TTE01DLE FIXED(32),    /* <CLHSE>. PSACLHSE.        @L4A*/ 42170000
*       3    TTE01DPL POINTER(31),  /* <LOCAL>. PSALOCAL.        @L3A*/ 42180000
*       3    TTE01DU  BOUNDARY(WORD), /* INFORMATION UNIQUE TO RCVY     42190000
*                                      SUBTYPE CODE.             @L3A*/ 42200000
*         5    TTE01DU1 FIXED(32),  /* 1ST WORD OF INFORMATION UNIQUE   42210000
*                                      TO RCVY SUBTYPE.          @L3A*/ 42220000
*         5    TTE01DU2 FIXED(32),  /* 2ND WORD OF INFORMATION UNIQUE   42230000
*                                      TO RCVY SUBTYPE.          @L3A*/ 42240000
*         5    TTE01DU3 FIXED(32),  /* 3RD WORD OF INFORMATION UNIQUE   42250000
*                                      TO RCVY SUBTYPE.          @L3A*/ 42260000
*         5    TTE01DU4 FIXED(32),  /* 4TH WORD OF INFORMATION UNIQUE   42270000
*                                      TO RCVY SUBTYPE.          @L3A*/ 42280000
*         5    TTE01DU5 FIXED(32),  /* 5TH WORD OF INFORMATION UNIQUE   42290000
*                                      TO RCVY SUBTYPE.          @L3A*/ 42300000
*         5    TTE01DU6 FIXED(32),  /* 6TH WORD OF INFORMATION UNIQUE   42310000
*                                      TO RCVY SUBTYPE.          @L3A*/ 42320000
*         5    TTE01DU7 FIXED(32),  /* 7TH WORD OF INFORMATION UNIQUE   42330000
*                                      TO RCVY SUBTYPE.          @L3A*/ 42340000
*         5    TTE01DU8 FIXED(32),  /* 8TH WORD OF INFORMATION UNIQUE   42350000
*                                      TO RCVY SUBTYPE.          @L3A*/ 42360000
*         5    TTE01DU9 FIXED(32),  /* 9TH WORD OF INFORMATION UNIQUE   42370000
*                                      TO RCVY SUBTYPE.          @P7A*/ 42380000
*         5    TTE01DUA FIXED(32),  /* 10TH WORD OF INFORMATION UNIQUE  42390000
*                                      TO RCVY SUBTYPE.          @P7A*/ 42400000
*       3    TTE01DED CHARACTER(0) BOUNDARY(WORD); /* END OF RCVY       42410000
*                                      TTE.                      @L3A*/ 42420000
*%ENDRCVY:                                                              42430000
*   IF TTEALL ^= 'YES' %THEN        /* IF ALL ENTRY MAPPINGS IS NOT     42440000
*                                      SPECIFIED,                @LJA*/ 42450000
*     %IF TTEEX ^= 'YES' %THEN      /* ALL EXPLICIT TRACING MAPPINGS    42460000
*                                      IS NOT SPECIFIED,         @LJA*/ 42470000
*       %IF TTESPIN ^= 'YES' %THEN                            /* @LJA*/ 42480000
*         %GO TO ENDSPIN;                                     /* @LJA*/ 42490000
*                                                                       42500000
*/*!SPIN event TTE                                                   */ 42510000
*/*!                                                                 */ 42520000
*/*!                                                                 */ 42530000
*/*!FORMATTED SPIN TTE:                                              */ 42540000
*/*!                                                                 */ 42550000
*/*!PR ASID TCB EMS  CD/D PSW ADDR U3 U4 U5 CLHS LOCAL PASD SASD TIME*/ 42560000
*/*!                               U6 U7 U8 CLHSE                    */ 42570000
*                                                                       42580000
*   DECLARE                                                             42590000
*     1    TTE01E   IHATTE_DEF2, /* SPIN event                   @LJA*/ 42600000
*       3    TTE01ETB POINTER(31),  /* <TCB>. CURRENT TCB ADDRESS OR    42610000
*                                      0. PSATOLD.               @LJA*/ 42620000
*       3    TTE01ESI FIXED(16),    /* SPIN SUBTYPE CODE         @LJA*/ 42630000
*       3    TTE01EHA FIXED(16),    /* <ASID>. HOME ADDRESS SPACE.      42640000
*                                      PSAAOLD-> ASCBASID.       @LJA*/ 42650000
*       3    TTE01ELH FIXED(32),    /* <CLHS>. PSACLHS.          @LJA*/ 42660000
*       3    TTE01ELE FIXED(32),    /* <CLHSE>. PSACLHSE.        @LJA*/ 42670000
*       3    TTE01EPL POINTER(31),  /* <LOCAL>. PSALOCAL.        @LJA*/ 42680000
*       3    TTE01EU  BOUNDARY(WORD), /* INFORMATION UNIQUE TO SPIN     42690000
*                                      SUBTYPE CODE.             @LJA*/ 42700000
*         5    TTE01EU1 FIXED(32),  /* 1ST WORD OF INFORMATION UNIQUE   42710000
*                                      TO SPIN SUBTYPE.          @LJA*/ 42720000
*         5    TTE01EU2 FIXED(32),  /* 2ND WORD OF INFORMATION UNIQUE   42730000
*                                      TO SPIN SUBTYPE.          @LJA*/ 42740000
*         5    TTE01EU3 FIXED(32),  /* 3RD WORD OF INFORMATION UNIQUE   42750000
*                                      TO SPIN SUBTYPE.          @LJA*/ 42760000
*         5    TTE01EU4 FIXED(32),  /* 4TH WORD OF INFORMATION UNIQUE   42770000
*                                      TO SPIN SUBTYPE.          @LJA*/ 42780000
*         5    TTE01EU5 FIXED(32),  /* 5TH WORD OF INFORMATION UNIQUE   42790000
*                                      TO SPIN SUBTYPE.          @LJA*/ 42800000
*         5    TTE01EU6 FIXED(32),  /* 6TH WORD OF INFORMATION UNIQUE   42810000
*                                      TO SPIN SUBTYPE.          @LJA*/ 42820000
*         5    TTE01EU7 FIXED(32),  /* 7TH WORD OF INFORMATION UNIQUE   42830000
*                                      TO SPIN SUBTYPE.          @LJA*/ 42840000
*         5    TTE01EU8 FIXED(32),  /* 8TH WORD OF INFORMATION UNIQUE   42850000
*                                      TO SPIN SUBTYPE.          @LJA*/ 42860000
*       3    TTE01EED CHARACTER(0) BOUNDARY(WORD); /* END OF SPIN       42870000
*                                      TTE.                      @LJA*/ 42880000
*%ENDSPIN:                                                              42890000
*   IF TTEALL ^= 'YES'                                                  42900000
*      %THEN                        /* IF ALL ENTRY MAPPINGS IS NOT     42910000
*                                      SPECIFIED,                @L5A*/ 42920000
*     %IF TTEEX ^= 'YES' %THEN      /* ALL EXPLICIT TRACING MAPPINGS    42930000
*                                      IS NOT SPECIFIED,         @L5A*/ 42940000
*       %IF TTETIME ^= 'YES' %THEN                                      42950000
*         %GO TO ENDTIME;                                               42960000
*                                                                       42970000
*/*!TIME - TIMER SERVICES TTE                                        */ 42980000
*/*!                                                                 */ 42990000
*/*!                                                                 */ 43000000
*/*!FORMATTED TIME TTE:                                              */ 43010000
*/*!                                                                 */ 43020000
*/*!PR ASID TCB TIME CD/D          U1  U2 U3                     TIME*/ 43030000
*/*!                               U4  U5 U6                         */ 43040000
*/*!                               U7  U8 U9                         */ 43050000
*/*!                               U10 U11                           */ 43060000
*                                                                       43070000
*   DECLARE                                                             43080000
*     1    TTE01F   IHATTE_DEF2, /* TIMER SERVICES ENTRY (TIME).        43090000
*                                                                @L5A*/ 43100000
*       3    TTE01FTB POINTER(31),  /* <TCB>. CURRENT TCB ADDRESS OR    43110000
*                                      0. PSATOLD.               @L5A*/ 43120000
*       3    TTE01FSI FIXED(16),    /* TIME SUBTYPE CODE         @L5A*/ 43130000
*       3    TTE01FHA FIXED(16),    /* <ASID>. HOME ADDRESS SPACE.      43140000
*                                      PSAAOLD-> ASCBASID.       @L5A*/ 43150000
*       3    TTE01FU  BOUNDARY(WORD), /* INFORMATION UNIQUE TO TIME     43160000
*                                      SUBTYPE CODE.             @L5A*/ 43170000
*         5    TTE01FU1 FIXED(32),  /* 1ST WORD OF INFORMATION UNIQUE   43180000
*                                      TO TIME SUBTYPE.          @L5A*/ 43190000
*         5    TTE01FU2 FIXED(32),  /* 2ND WORD OF INFORMATION UNIQUE   43200000
*                                      TO TIME SUBTYPE.          @L5A*/ 43210000
*         5    TTE01FU3 FIXED(32),  /* 3RD WORD OF INFORMATION UNIQUE   43220000
*                                      TO TIME SUBTYPE.          @L5A*/ 43230000
*         5    TTE01FU4 FIXED(32),  /* 4TH WORD OF INFORMATION UNIQUE   43240000
*                                      TO TIME SUBTYPE.          @L5A*/ 43250000
*         5    TTE01FU5 FIXED(32),  /* 5TH WORD OF INFORMATION UNIQUE   43260000
*                                      TO TIME SUBTYPE.          @L5A*/ 43270000
*         5    TTE01FU6 FIXED(32),  /* 6TH WORD OF INFORMATION UNIQUE   43280000
*                                      TO TIME SUBTYPE.          @L5A*/ 43290000
*         5    TTE01FU7 FIXED(32),  /* 7TH WORD OF INFORMATION UNIQUE   43300000
*                                      TO TIME SUBTYPE.          @L5A*/ 43310000
*         5    TTE01FU8 FIXED(32),  /* 8TH WORD OF INFORMATION UNIQUE   43320000
*                                      TO TIME SUBTYPE.          @L5A*/ 43330000
*         5    TTE01FU9 FIXED(32),  /* 9TH WORD OF INFORMATION UNIQUE   43340000
*                                      TO TIME SUBTYPE.          @L5A*/ 43350000
*         5    TTE01FUA FIXED(32),  /* 10TH WORD OF INFORMATION         43360000
*                                      UNIQUE TO TIME SUBTYPE.   @L5A*/ 43370000
*         5    TTE01FUB FIXED(32),  /* 11TH WORD OF INFORMATION         43380000
*                                      UNIQUE TO TIME SUBTYPE.   @L5A*/ 43390000
*       3    TTE01FED CHARACTER(0) BOUNDARY(WORD); /* END OF TIME       43400000
*                                      TTE.                      @L5A*/ 43410000
*%ENDTIME:                                                              43420000
*   IF TTEALL ^= 'YES'                                                  43430000
*      %THEN                        /* IF ALL ENTRY MAPPINGS IS NOT     43440000
*                                      SPECIFIED,                @02A*/ 43450000
*     %IF TTEEX ^= 'YES' %THEN      /* ALL EXPLICIT TRACING MAPPINGS    43460000
*                                      IS NOT SPECIFIED,         @02A*/ 43470000
*       %IF TTESCH ^= 'YES' %THEN   /* ALL SUBCHANNEL TRACING           43480000
*                                      MAPPINGS IS NOT SPECIFIED @02A*/ 43490000
*         %GO TO ENDXSCH;           /*                           @02A*/ 43500000
*                                                                       43510000
*/*!XSCH - CANCEL SUBCHANNEL TTE                                     */ 43520000
*/*!                                                                 */ 43530000
*/*!                                                                 */ 43540000
*/*!FORMATTED XSCH TTE:                                              */ 43550000
*/*!                                                                 */ 43560000
*/*!PR ASID TCB XSCH CD/D PSW ADDR U1 U2 U3 U4                   TIME*/ 43570000
*/*!                                                             @A4C*/ 43580000
*                                                                       43590000
*   DECLARE                                                             43600000
*     1    TTE601   IHATTE_DEF2, /* CANCEL SUBCHANNEL (XSCH).@02A*/     43610000
*       3    TTE601TB POINTER(31),  /* <TCB>. TCB ADDRESS FROM SRB.     43620000
*                                      IOSBPTR(R2)-> IOSSRB->           43630000
*                                      SRBPTCB.                  @02A*/ 43640000
*       3    TTE601AD FIXED(16),    /* <ASID>. ASID FROM IOSB.          43650000
*                                      IOSBPTR(R2)-> IOSASID.    @02A*/ 43660000
*       3    TTE601HA FIXED(16),    /* HOME ADDRESS SPACE. PSAAOLD->    43670000
*                                      ASCBASID.                 @02A*/ 43680000
*       3    TTE601CC FIXED(8),     /* <PSW(1:1)>. CONDITION CODE.      43690000
*                                      INPUT REGISTER 0.         @02A*/ 43700000
*       3    TTE601DI FIXED(8),     /* <PSW(3:3)>. DRIVER ID.           43710000
*                                      IOSBPTR(R2)-> IOSDVRID.   @02A*/ 43720000
*       3    TTE601DN FIXED(16),    /* <CD/D>. DEVICE NUMBER.           43730000
*                                      UCBPFPTR(R7)+'200'X-> UCBCHAN.   43740000
*                                                                @02A*/ 43750000
*       3    TTE601UB POINTER(31),  /* <U1>. UCB ADDRESS (COMMON        43760000
*                                      SEGMENT. UCBPFPTR(R7)+'200'X     43770000
*                                                                @02A*/ 43780000
*       3    TTE601IQ POINTER(31),  /* <U2>. IOQ ADDRESS.               43790000
*                                      UCBPFPTR(R7)-> UCBIOQ.    @02A*/ 43800000
*       3    TTE601IO POINTER(31),  /* <ADDR>. IOSB ADDRESS. INPUT      43810000
*                                      REGISTER 2.               @02A*/ 43820000
*       3    TTE601TK FIXED(32),    /* <CD/D> IF COPROCESSOR DEVICE.    43830000
*                                      TOKEN. INPUT REGISTER 1.  @02A*/ 43840000
*         5    TTE601T1 FIXED(8),   /* KEY. NOT FORMATTED.       @02A*/ 43850000
*         5    TTE601T2 CHARACTER(1), /* RESERVED.               @02A*/ 43860000
*         5    TTE601T3 FIXED(16),  /* <U3>. BASE DEVICE NUMBER. @02A*/ 43870000
*       3    TTE601SSIDA Fixed(8),  /* Subchannel set ID                43880000
*                                      IOSBPTR(R2)-> IOSUCB->           43890000
*                                      UCBSSID.                  @LFA*/ 43900000
*       3    *        Fixed(24),    /* Reserved                  @LFA*/ 43910000
*       3    TTE601IA POINTER(31),  /* <U4>. ASSOCIATED IOQ ADDRESS     43920000
*                                      (E.G., AN INTERROGATE IOQ)       43930000
*                                      OR 0.  REG 10 ON TRACE           43940000
*                                      INSTRUCTION.              @A4A*/ 43950000
*       3    TTE601ED CHARACTER(0) BOUNDARY(WORD); /* END OF XSCH       43960000
*                                      TTE.                      @02A*/ 43970000
*%ENDXSCH:                          /*                           @02A*/ 43980000
*   ;                                                                   43990000
