*/* COPYRIGHT = 5650-ZOS                                             */ 00010003
*/*            COPYRIGHT IBM CORP. 1988, 2017                        */ 00030003
*/*            LICENSED MATERIALS - PROPERTY OF IBM                  */ 00040000
*/*                                                                  */ 00050000
*/* STATUS  = HBB77B0                                                */ 00060003
*/*                                                                  */ 00070000
*/*01* EXTERNAL CLASSIFICATION: NONE                                 */ 00080000
*/*01* END OF EXTERNAL CLASSIFICATION:                               */ 00090000
*/*                                                                  */ 00100000
*/* CHANGE ACTIVITY =                                                */ 00110000
*/*   $L1 =    AR    HBB3310 850901 PDXB: AR SUPPORT                 */ 00120000
*/*   $L2 = 64BITCSV HBB7703 980311 PDXB: 64-BIT SUPPORT             */ 00130000
*/*   $01 = OA16056  HBB7707 060413 PDXB: SYSALVL                    */ 00140000
*/*   $L3 = RMODE64  HBB77B0 150901 PDXB: RMODE 64                   */ 00141003
         MACRO                                                          00150000
&NAME    IHBINNRR  &A,&B,&USELGR=COND                                   00160000
         LCLC  &LA                      "LA" OR "LAE" VIA SYSSTATE @L1A 00170000
         LCLC  &LR                      "LR" OR "LGR" VIA SYSSTATE @L2A 00180000
         GBLC  &SYSASCE                                            @L1A 00190000
         GBLC  &SYSAM64                                            @L2A 00200000
         GBLA  &SYSALVL                                            @L2A 00210000
         SYSSTATE TEST                  TEST ASC ENVIRONMENT       @L1A 00220000
&LA      SETC  'LA'                     MUST USE LA INSTRUCTION    @L1A 00230000
&LR      SETC  'LR'                     MUST USE LR INSTRUCTION    @L2A 00240000
         AIF   ('&SYSASCE' EQ 'P').NOLAE                           @L1A 00250000
&LA      SETC  'LAE'                    MUST USE LAE               @L1A 00260000
.NOLAE   ANOP                                                      @L1A 00270000
         AIF   ('&USELGR' EQ 'YES').YESAM64                        @L3A 00280003
         AIF   (&SYSALVL LT 2).NOAM64                              @01C 00281000
         AIF   ('&SYSAM64' NE 'YES').NOAM64                        @L2A 00290000
.YESAM64 ANOP                                                      @L2A 00300000
&LR      SETC  'LGR'                    MUST USE LGR               @L2A 00310000
.NOAM64  ANOP                                                      @L2A 00320000
.NOPT    AIF   ('&A' EQ '' OR '&A' EQ '(1)').NAMEIT               19015 00330000
         AIF   ('&A'(1,1) EQ '(').REGA                                  00340000
&NAME    &LA   1,&A                              LOAD PARAMETER REG 1   00350000
         AIF   ('&USELGR' NE 'YES').NO_LGR                         @L3A 00351003
         AIF   ('&SYSAM64' EQ 'YES').YESAM642                      @L3A 00351103
         LLGTR 1,1                                                 @L3A 00351203
.YESAM642 ANOP                                                     @L3A 00351303
.NO_LGR  ANOP                                                      @L3A 00352003
         AGO   .CHKB                                                    00360000
.REGA    ANOP                                                           00370000
&NAME    &LR   1,&A(1)                           LOAD PARAMETER REG 1   00380000
         AIF   ('&SYSASCE' EQ 'P').CHKB                                 00390000
         CPYA  1,&A(1)                                                  00400000
         AGO   .CHKB                                                    00410000
.NAMEIT  AIF   ('&NAME' EQ '').CHKB                                     00420000
&NAME    DS    0H                                                       00430000
.CHKB    AIF   ('&B' EQ '' OR '&B' EQ '(0)').END                        00440000
         AIF   ('&B'(1,1) EQ '(').REGB                                  00450000
         &LA   0,&B                              LOAD PARAMETER REG 0   00460000
         AGO   .END                                                     00470000
.REGB    ANOP                                                           00480000
         &LR   0,&B(1)                           LOAD PARAMETER REG 0   00490000
         AIF   ('&SYSASCE' EQ 'P').END                                  00500000
         CPYA  0,&B(1)                                             @L1A 00510000
.END     MEND                                                           00520000
