         MACRO                                                @G381P2A  00050000
&NAME    IHBINNRX &EP,&EPLOC,&DE,&DCB,&LSEARCH,               @G381P2A X00100000
               &GLOBAL,&ADDR,&RETURN,&CALL,&PARAM,&MF,        @G381P2A X00150000
               &ERRET=,&SF=I,&LOADPT=,&EOM=,                  @G860P35 X00155000
               &ADRNAPF=,&EXTINFO=,                               @L1A X00160100
               &LOADPT64=,                                        @L3A X00160205
               &ADRNAPF64=,&ADDR64=,&PLISTVER=                    @L2A  00160300
.********************************************************************** 00165200
.*                                                                    * 00172800
.* COPYRIGHT =                                                        * 00180400
.*      5650-ZOS COPYRIGHT IBM CORP 1981, 2017                        * 00189605
.*      LICENSED MATERIAL-PROGRAM, PROPERTY OF IBM                    * 00198800
.*                                                                    * 00208200
.* STATUS = HBB77B0                                                   * 00211805
.*                                                                    * 00215400
.*01* EXTERNAL CLASSIFICATION: OTHER                                  * 00216900
.*01* END OF EXTERNAL CLASSIFICATION:                                 * 00218400
.*                                                                    * 00219900
.* CHANGE ACTIVITY =                                                  * 00221400
.*  $01=OY56888,HBB2102,920825,PDPA: ALLOW EXPLICIT NOTATION FOR      * 00222900
.*                                   PARAMETER LIST ADDRESS       @01A* 00224400
.*  $02=OA12535,HBB7703,063005,PDXB: DC'S MUST BE AFTER ALL STORES    * 00224500
.*  $L1=XXXXXXX,HBB7703,000101,PDXB: EXTINFO                          * 00224600
.*  $L2=CSV11   HBB7760 071201 PDXB: RMODE 64 FOR NOT-EXECUTABLE      * 00224700
.*  $L3=RMODE64 HBB77B0 150901 PDXB: RMODE 64                         * 00224805
.*                                                                    * 00226000
.********************************************************************** 00241200
         GBLC  &IHBNO                                         @G381P2A  00250000
         GBLA  &SYSALVL                                                 00275000
         LCLB  &B(18)                                             @L3C  00312505
         LCLB  &PL64               64-BIT PARAMETER LIST          @L2A  00312600
         LCLA  &CTR,&A,&OFFBASE,&OFFFLG,&OFFFLG2              @YA11577  00350000
         LCLC  &CHARS,&DCBVAL,&EPNAME,&ERRVAL                 @G381P2A  00400000
         SYSSTATE TEST                                                  00425000
&EPNAME  SETC  'IHB'.'&SYSNDX'                                @G381P2A  00450000
&B(1)    SETB  ('&EP' NE '')                                  @G381P2A  00500000
&B(2)    SETB  ('&EPLOC' NE '')                               @G381P2A  00550000
&B(3)    SETB  ('&DE' NE '')                                  @G381P2A  00600000
&B(4)    SETB  ('&ERRET' NE '')                               @G381P2A  00650000
&B(4)    SETB  ('&RETURN' NE '' OR &B(4))                     @G381P2A  00700000
&B(5)    SETB  0                                                        00750000
         AIF   ('&LSEARCH' EQ '').NLSER   NO LSEARCH CONTINUE @G381P2A  00800000
         AIF   ('&LSEARCH' NE 'YES' AND '&LSEARCH' NE 'NO').E6          00850000
.*                                                            @G381P2A  00900000
&B(6)    SETB  ('&LSEARCH(1)' EQ 'YES')                       @G381P2A  00950000
.NLSER   ANOP                                                 @G381P2A  00951000
         AIF   ('&PLISTVER' EQ '').NPLISTVER                       @L2A 00952000
         AIF   ('&PLISTVER' NE '0' AND '&PLISTVER' NE '1' AND          X00952100
               '&PLISTVER' NE 'IMPLIED_VERSION' AND                    X00952200
               '&PLISTVER' NE 'MAX').E6PLISTVER                    @L2A 00952300
         AIF   ('&PLISTVER' NE '0').NPLISTVER0                     @L2A 00952400
         AIF   ('&ADDR64' NE '' OR '&ADRNAPF64' NE '').E6PLISTVER2 @L2A 00952500
.NPLISTVER0 ANOP                                                   @L2A 00953000
    AIF   ('&PLISTVER' NE '1' AND '&PLISTVER' NE 'MAX').NPLISTVER1 @L2A 00953100
         AIF   ('&ADDR' NE '' OR '&ADRNAPF' NE '').E6PLISTVER3     @L2A 00953400
.NPLISTVER1 ANOP                                                   @L2A 00953500
.NPLISTVER ANOP                                                    @L2A 00954000
.********************************************************************** 00958300
.*                                                                    * 00966600
.*  CHECK FOR ERRORS IN THE SPECIFICATION OF PARAMETERS               * 00974900
.*                                                                    * 00983200
.********************************************************************** 00991500
         AIF   ('&GLOBAL' EQ '').NGLOB GLOBAL NOT SPECIFIED   @G381P2A  01050000
.* GLOBAL CANNOT BE COMBINED WITH ADDR                        @ZMB0619  01083300
         AIF   ('&GLOBAL(1)' EQ 'YES' AND '&ADDR' NE'').E7    @ZA50556  01116600
.* GLOBAL CANNOT BE COMBINED WITH ADDR64                          @L2A  01116700
         AIF   ('&GLOBAL(1)' EQ 'YES' AND '&ADDR64' NE'').E7      @L2A  01116800
.* GLOBAL CANNOT BE COMBINED WITH ADRNAPF                     @YA11577  01124900
         AIF   ('&GLOBAL(1)' EQ 'YES' AND '&ADRNAPF' NE'').E7B          01133200
.* GLOBAL CANNOT BE COMBINED WITH ADRNAPF64                       @L2A  01133300
         AIF   ('&GLOBAL(1)' EQ 'YES' AND '&ADRNAPF64' NE'').E7B  @L2A  01133400
.* FIRST OPERAND OF GLOBAL MUST BE YES OR NO                            01150000
         AIF   ('&GLOBAL(1)' NE 'YES' AND '&GLOBAL(1)' NE 'NO').E5      01200000
.* SECOND OPERAND OF GLOBAL MUST BE P OR F OR NULL                      01250000
         AIF   (N'&GLOBAL EQ 1).YGLOB    NO SECOND OPERAND OK           01300000
         AIF   ('&GLOBAL(2)' NE 'P' AND '&GLOBAL(2)' NE 'F').E5         01350000
.YGLOB   ANOP                                                 @G381P2A  01400000
&B(7)    SETB  ('&GLOBAL(1)' EQ 'YES')                        @G381P2A  01450000
&B(8)    SETB  ('&GLOBAL(1)' EQ 'YES' AND '&GLOBAL(2)' EQ 'F')          01500000
.*                                                            @G381P2A  01550000
.NGLOB   ANOP                                                 @G381P2A  01600000
&B(9)    SETB ('&ADDR' NE '')                                 @G381P2A  01650000
&B(16)   SETB ('&ADDR64' NE '')                                   @L2A  01660000
&B(14)   SETB ('&ADRNAPF' NE '')                              @YA11577  01675000
&B(17)   SETB ('&ADRNAPF64' NE '')                                @L2A  01676000
&PL64    SETB ('&ADRNAPF64' NE '' OR '&ADDR64' NE '' OR                *01677100
               '&PLISTVER' EQ '1' OR '&PLISTVER' EQ 'MAX')        @L2A  01677200
&B(10)   SETB  ('&CALL' EQ 'LINK' OR '&CALL' EQ 'XCTL')       @G381P2A  01700000
&B(11)   SETB  ('&CALL' EQ 'LOAD')                            @G381P2A  01750000
         AIF   ('&EOM' EQ '').NEOM        NO EOM CONTINUE     @G860P35  01755000
         AIF   ('&EOM' NE 'YES' AND '&EOM' NE 'NO').E10       @G860P35  01760000
.* EOM MUST COMBINED WITH GLOBAL                              @G860P35  01765000
         AIF   ('&EOM' EQ 'YES' AND '&GLOBAL(1)' NE 'YES').E9 @G860P35  01770000
&B(12)   SETB  ('&EOM' EQ 'YES')                              @G860P35  01775000
.NEOM    ANOP                                                 @G860P35  01780000
.* ADDR AND LOADPT OPTIONS CANNOT BE COMBINED                 @G860P35  01785000
         AIF   ('&LOADPT' NE '' AND '&ADDR' NE '').E8         @G860P35  01790000
.* ADDR64 AND LOADPT OPTIONS CANNOT BE COMBINED                   @L2A  01790100
         AIF   ('&LOADPT' NE '' AND '&ADDR64' NE '').E8           @L2A  01790200
.* ADRNAPF AND LOADPT OPTIONS CANNOT BE COMBINED              @YA11577  01791000
         AIF   ('&LOADPT' NE '' AND '&ADRNAPF' NE '').E8B     @YA11577  01792000
.* ADRNAPF64 AND LOADPT OPTIONS CANNOT BE COMBINED                @L2A  01792100
         AIF   ('&LOADPT' NE '' AND '&ADRNAPF64' NE '').E8B       @L2A  01792200
.* EXTINFO AND LOADPT OPTIONS CANNOT BE COMBINED                  @L1A  01792300
         AIF   ('&LOADPT' NE '' AND '&EXTINFO' NE '').E8C         @L1A  01792400
.* ADDR AND LOADPT64 OPTIONS CANNOT BE COMBINED                   @L3A  01792705
         AIF   ('&LOADPT64' NE '' AND '&ADDR' NE '').E648         @L3A  01792805
.* ADDR64 AND LOADPT64 OPTIONS CANNOT BE COMBINED                 @L3A  01792905
         AIF   ('&LOADPT64' NE '' AND '&ADDR64' NE '').E648       @L3A  01793005
.* ADRNAPF AND LOADPT64 OPTIONS CANNOT BE COMBINED                @L3A  01793105
         AIF   ('&LOADPT64' NE '' AND '&ADRNAPF' NE '').E648B     @L3A  01793205
.* ADRNAPF64 AND LOADPT64 OPTIONS CANNOT BE COMBINED              @L3A  01793305
         AIF   ('&LOADPT64' NE '' AND '&ADRNAPF64' NE '').E648B   @L3A  01793405
.* EXTINFO AND LOADPT64 OPTIONS CANNOT BE COMBINED                @L3A  01793505
         AIF   ('&LOADPT64' NE '' AND '&EXTINFO' NE '').E648C     @L3A  01793605
.* EXTINFO AND ADDR OPTIONS CANNOT BE COMBINED                    @L1A  01793701
         AIF   ('&EXTINFO' NE '' AND '&ADDR' NE '').E8D           @L1A  01793801
.* EXTINFO AND ADDR64 OPTIONS CANNOT BE COMBINED                  @L2A  01793901
         AIF   ('&EXTINFO' NE '' AND '&ADDR64' NE '').E8D         @L2A  01794001
.* EXTINFO AND ADRNAPF OPTIONS CANNOT BE COMBINED                 @L1A  01794101
         AIF   ('&EXTINFO' NE '' AND '&ADRNAPF' NE '').E8E        @L1A  01794201
.* EXTINFO AND ADRNAPF64 OPTIONS CANNOT BE COMBINED               @L2A  01794301
         AIF   ('&EXTINFO' NE '' AND '&ADRNAPF64' NE '').E8E      @L2A  01794401
.* LOADPT AND LOADPT64 OPTIONS CANNOT BE COMBINED                 @L3A  01794505
         AIF   ('&LOADPT64' NE '' AND '&LOADPT' NE '').E648F      @L3A  01794605
.* ADRNAPF AND ADDR OPTIONS CANNOT BE COMBINED                @YA11577  01794701
         AIF   ('&ADDR' NE '' AND '&ADRNAPF' NE '').E11       @YA11577  01794801
.* ADRNAPF AND ADDR64 OPTIONS CANNOT BE COMBINED                  @L2A  01794901
         AIF   ('&ADDR64' NE '' AND '&ADRNAPF' NE '').E11         @L2A  01795001
.* ADRNAPF64 AND ADDR OPTIONS CANNOT BE COMBINED                  @L2A  01795101
         AIF   ('&ADDR' NE '' AND '&ADRNAPF64' NE '').E11         @L2A  01795201
.* ADRNAPF64 AND ADDR64 OPTIONS CANNOT BE COMBINED                @L2A  01795301
         AIF   ('&ADDR64' NE '' AND '&ADRNAPF64' NE '').E11       @L2A  01795401
.* ADDR AND ADDR64 OPTIONS CANNOT BE COMBINED                     @L2A  01795501
         AIF   ('&ADDR' NE '' AND '&ADDR64' NE '').E12            @L2A  01795601
.* ADRNAPF AND ADRNAPF64 OPTIONS CANNOT BE COMBINED               @L2A  01795701
         AIF   ('&ADRNAPF' NE '' AND '&ADRNAPF64' NE '').E13      @L2A  01795801
.* ADDR64 REQUIRES SYSSTATE ARCHLVL=2                             @L2A  01795901
         AIF   ('&ADDR64' NE '' AND &SYSALVL LT 2).E14            @L2A  01796001
.* ADRNAPF64 REQUIRES SYSSTATE ARCHLVL=2                          @L2A  01796101
         AIF   ('&ADRNAPF64' NE '' AND &SYSALVL LT 2).E14         @L2A  01796201
.* PLISTVER=1/MAX REQUIRES SYSSTATE ARCHLVL=2                     @L2A  01796301
         AIF   (&PL64 AND &SYSALVL LT 2).E15                      @L2A  01796401
&B(13)   SETB  ('&LOADPT' NE '')                              @G860P35  01797001
&B(18)   SETB  ('&LOADPT64' NE '')                                @L3A  01797105
&B(15)   SETB  ('&EXTINFO' NE '')                                 @L1A  01797500
         AIF   (&B(1)+&B(2)+&B(3) GT 1).E1   TOO MANY PARMS SPECIFIED   01800000
.*                                                            @G381P2A  01850000
         AIF   ('&EP' EQ '').AGONE   EP NOT SPECIFIED         @G381P2A  01900000
         AIF   ('&EP'(1,1) EQ '(').E1A  EP REG FORM NOT ALLOWED         01950000
.*                                                            @G381P2A  02000000
.AGONE   ANOP                                                 @G381P2A  02050000
         AIF   ('&SF' EQ 'L').LROUT   PROCESS L FORM          @G381P2A  02100000
&OFFFLG  SETA  (10)   COMPUTE FLAGS OFFSET                    @G381P2A  02150000
&OFFFLG2 SETA  (11)   COMPUTE FLAGS OFFSET                    @YA11577  02200000
         AIF   ('&SF' EQ 'I').IROUT   PROCESS I FORM          @G381P2A  02300000
.********************************************************************** 02316600
.*                                                                    * 02333200
.*  PROCESS SF=E FORM                                                 * 02349800
.*                                                                    * 02366400
.********************************************************************** 02383000
         AIF   ('&CALL' NE 'LOAD').DOCNOP                         @L2A  02384000
         AIF   (&SYSALVL GT 0).SKIPCNOP                           @L2A  02384100
.DOCNOP  ANOP                                                     @L2A  02385000
         CNOP  0,4                                            @ZA64577  02388600
.SKIPCNOP ANOP                                                    @L2A  02388700
.*                 REMOVE THE LABEL ON THE PREVIOUS STATEMENT @YA21876  02394200
         AIF   (N'&SF NE 2).E2     E FORM MUST HAVE 2 OPERANDS          02400000
.*                                                            @G381P2A  02450000
         AIF   ('&SF(1)' NE 'E').E2   E FORM MUST BE SPECIFIED          02500000
.*                                                            @G381P2A  02550000
         AIF   ('&SF'(4,1) EQ '(').ISAREG  E FORM REG SPECIFIED         02600000
.*                                                            @G381P2A  02650000
         AIF   ('&PARAM' EQ '' AND '&MF(1)' NE 'E').ACONST CONSTRUCT    02700000
.*                                   BRANCH                   @ZMB0095  02725000
         ST    1,16+&SF(2)     STORE PROBLEM PROG PARM LIST ADDR  @01C  02750000
.*                                                            @G381P2A  02800000
.ACONST  ANOP                                                 @G381P2A  02850000
         LA    1,&SF(2)           LOAD SUPV PARM LIST ADDR    @G381P2A  02900000
         AGO   .CONTA                                         @G381P2A  02950000
.E1      IHBERMAC 88,&IHBNO   TOO MANY PARAMETERS PRESENT     @G381P2A  03000000
         MEXIT                                                @G381P2A  03050000
.E1A     IHBERMAC 42,&EP      R-FORM INVALID FOR EP NAME      @G381P2A  03100000
         MEXIT                                                @G381P2A  03150000
.E2      IHBERMAC 41,,&SF,,,0   SF PARAMETER BAD              @G381P2A  03200000
         MEXIT                                                @G381P2A  03250000
.E3      IHBERMAC 72,&IHBNO   REG. NOT. W/SF=L                @G381P2A  03300000
         MEXIT                                                @G381P2A  03350000
.E4      IHBERMAC 31,&IHBNO   EP,EPLOC,DE ALL MISSING         @G381P2A  03400000
         MEXIT                                                @G381P2A  03450000
.E5      MNOTE    12,'*** IHB005 GLOBAL=&GLOBAL OPTION INVALID'         03500000
.*                                                            @G381P2A  03550000
         MEXIT                                                @G381P2A  03600000
.E6      MNOTE    12,'*** IHB006 LSEARCH MUST BE YES OR NO'   @G381P2A  03650000
         MEXIT                                                @G381P2A  03700000
.E6PLISTVER MNOTE 12,'*** IHB006 PLISTVER MUST BE 0, 1 OR MAX'    @L2A  03710000
         MEXIT                                                    @L2A  03711000
.E6PLISTVER2 MNOTE 12,'*** IHB006 PLISTVER=0 IS NOT VALID WITH ADDR64 A-03712000
               ND ADRNAPF64'                                      @L2A  03712100
         MEXIT                                                    @L2A  03712200
.E6PLISTVER3 MNOTE 12,'*** IHB006 PLISTVER=1 AND PLISTVER=MAX ARE NOT V-03712300
               ALID WITH ADDR AND ADRNAPF'                        @L2A  03712400
         MEXIT                                                    @L2A  03712500
.E7      MNOTE    12,'*** IHB007 COMBINED GLOBAL AND ADDR/ADDR64'       03712600
         MEXIT                                                    @L2C  03737500
.E7B     MNOTE    12,'*** IHB007 COMBINED GLOBAL AND ADRNAPF/ADRNAPF64' 03737800
.*                                                                @L2C  03738100
         MEXIT                                                @YA11577  03738400
.E8      MNOTE    12,'*** IHB008 COMBINED LOADPT AND ADDR/ADDR64'       03738801
.*                                                                @L2C  03740106
         MEXIT                                                @G860P35  03741400
.E8B     MNOTE    12,'*** IHB008 COMBINED LOADPT AND ADRNAPF/ADRNAPF64' 03741700
.*                                                                @L2C  03742000
         MEXIT                                                    @L2A  03742100
.E8C     MNOTE    12,'*** IHB008 COMBINED LOADPT AND EXTINFO OPTIONS'   03742200
.*                                                                @L1A  03742400
.E648    MNOTE    12,'*** IHB008 COMBINED LOADPT64 AND ADDR/ADDR64'     03742501
.*                                                                @L3A  03742605
         MEXIT                                                    @L3A  03742705
.E648B   MNOTE  12,'*** IHB008 COMBINED LOADPT64 AND ADRNAPF/ADRNAPF64' 03742801
.*                                                                @L3A  03742905
         MEXIT                                                    @L3A  03743005
.E648C   MNOTE  12,'*** IHB008 COMBINED LOADPT64 AND EXTINFO OPTIONS'   03743101
.*                                                                @L3A  03743205
         MEXIT                                                    @L3A  03743305
.E8D     MNOTE    12,'*** IHB008 COMBINED EXTINFO AND ADDR/ADDR64'      03743401
.*                                                                @L2C  03743501
         MEXIT                                                    @L2A  03743601
.E8E     MNOTE  12,'*** IHB008 COMBINED EXTINFO AND ADRNAPF/ADRNAPF64'  03743701
.*                                                                @L2C  03743801
         MEXIT                                                @YA11577  03743901
.E648F   MNOTE  12,'*** IHB008 COMBINED LOADPT AND LOADPT64 OPTIONS'    03744001
.*                                                                @L3A  03744105
         MEXIT                                                    @L3A  03744205
.E9      MNOTE    12,'*** IHB009 EOM MUST APPEAR WITH GLOBAL OPTION'    03744301
.*                                                            @G860P35  03745001
         MEXIT                                                @G860P35  03745300
.E10     MNOTE    12,'*** IHB010 EOM MUST BE YES OR NO'       @G860P35  03746600
         MEXIT                                                @G860P35  03747900
.E11  MNOTE 12,'*** IHB008 COMBINED ADDR/ADDR64 AND ADRNAPF/ADRNAPF64'  03748400
.*                                                                @L2C  03748900
         MEXIT                                                @YA11577  03749000
.E12     MNOTE    12,'*** IHB008 COMBINED ADDR AND ADDR64'        @L2A  03749100
         MEXIT                                                    @L2A  03749300
.E13     MNOTE    12,'*** IHB008 COMBINED ADRNAPF AND ADRNAPF64'  @L2A  03749400
         MEXIT                                                    @L2A  03749600
.E14     MNOTE    12,'*** IHB007 ADDR64 AND ADRNAPF64 REQUIRE SYSSTATE -03749700
               ARCHLVL > 1'                                       @L2A  03749800
         MEXIT                                                    @L2A  03749900
.E15     MNOTE    12,'*** IHB007 PLISTVER=1 AND PLISTVER=MAX REQUIRE SY-03750000
               SSTATE ARCHLVL > 1'                                @L2A  03751000
         MEXIT                                                    @L2A  03752000
.ISAREG  ANOP                                                 @G381P2A  03760000
         AIF   ('&SF(2)' EQ '(1)').E2 R1 NOT ALLOWED          @G381P2A  03800000
&A       SETA  K'&SF-6  CALCULATE PTR TO REGISTER IN STRING   @G381P2A  03850000
&CHARS   SETC  '&SF'(5,&A) EXTRACT REGISTER SPECIFIED         @G381P2A  03900000
         AIF   ('&PARAM' EQ '' AND '&MF(1)' NE 'E').BCONST CONSTRUCT    03950000
.*                                   BRANCH                   @ZMB0095  03975000
         ST    1,16(&CHARS)       STORE PROBLEM PROG PARM LIST ADDR     04000000
.*                                                            @G381P2A  04050000
.BCONST  ANOP                                                 @G381P2A  04100000
         LA    1,0(&CHARS)        LOAD SUPV PARM LIST ADDR    @G381P2A  04150000
.CCONST  ANOP                                                 @G381P2A  04200000
.CONTA   AIF   (NOT &B(1)).CONTB  IF NO EP SPECIFIED          @G381P2A  04250000
         AIF   (&SYSALVL GT 0).ALVL1A                                   04275000
         LA    0,*+8              LOAD EP ADDR IN REG 0       @G381P2A  04300000
         B     *+12               BRANCH AROUND EP            @G381P2A  04350000
         DC    CL8'&EP'           EP SYMBOL                   @G381P2A  04400000
         AGO   .ALVL1B                                                  04410000
.ALVL1A  ANOP                                                           04420000
         LA    0,=CL8'&EP'        LOAD EP ADDR IN REG 0       @G381P2A  04430000
.ALVL1B  ANOP                                                           04440000
         ST    0,0(0,1)           STORE EP ADDR IN SUPV PARMLIST        04450000
.*                                                            @G381P2A  04500000
         AGO   .DCBCHK            CHECK FOR DCB               @G381P2A  04550000
.CONTB   AIF   (&B(2)+&B(3) EQ 0).DCBCHK NEITHER DE NOR EPLOC SPECIFIED 04600000
.*                                                            @G381P2A  04650000
         AIF   ('&EPLOC&DE'(1,1) EQ '(').ISAREGA  PROCESS REG FORM      04700000
.*                                                            @G381P2A  04750000
         LA    0,&EPLOC&DE        PICK UP SUPV PARMLIST       @G381P2A  04800000
         ST    0,0(0,1)           STORE IN SUPV PARMLIST      @G381P2A  04850000
         AGO   .DECHK                                         @G381P2A  04900000
.ISAREGA LA    0,0(0,&EPLOC(1)&DE(1)) PICKUP EPLOC OR DE PARM @ZA63079  04933300
         ST    0,0(0,1)               STORE IN SUPV PARMLIST  @ZA63079  04966600
.DECHK   AIF   (NOT &B(3)).DCBCHK  DE NOT SPECIFIED           @G381P2A  05000000
         OI    &OFFFLG.(1),X'80'  SET DE SWITCH BIT ON        @G381P2A  05050000
.DCBCHK  AIF   ('&DCB' EQ '').LOADCK PROCESS ADDR OPERAND     @G381P2A  05100000
         AIF   ('&DCB'(1,1) EQ '(').ISAREGB REG FORM          @G381P2A  05150000
         LA    0,&DCB             PICK UP DCB PARM            @G381P2A  05200000
         AGO   .STORDCB                                       @G381P2A  05250000
.ISAREGB LA    0,0(0,&DCB(1))     PICK UP DCB PARM            @G381P2A  05300000
.STORDCB ST    0,4(0,1)           STORE DCB PARAMETER IN LIST @G381P2A  05350000
.LOADCK  AIF   ('&CALL' NE 'LOAD').RETCK  NOT LOAD, PROCESS ERRET       05400000
.*                                                            @G381P2A  05450000
         AIF   ('&LOADPT' EQ '').LOADPT64CHK PROCESS LOADPT64     @L3C  05452705
         AIF   ('&LOADPT'(1,1) EQ '(').LDRFORM   R-FORM       @G860P35  05455400
         LA    0,&LOADPT          PICK UP LOADPT ADDRESS      @G860P35  05458100
         ST    0,12(0,1)          STORE ADDRESS IN PARM LIST  @G860P35  05460800
         AGO   .LDPTBIT      SET DIRECTED LOAD POINT BIT      @G860P35  05463500
.LDRFORM ANOP                                                 @G860P35  05466200
         LA    0,0(0,&LOADPT(1))   PICKUP LOADPT ADDRESS PARM @ZA63079  05468000
         ST    0,12(0,1)           STORE ADDRESS IN PARM LIST @ZA63079  05469800
.LDPTBIT ANOP                                                 @G860P35  05471600
         OI    &OFFFLG.(1),X'01'   SET LOADPT SPECIFIED BIT   @G860P35  05474300
.LOADPT64CHK ANOP                                                 @L3A  05474405
         AIF   ('&LOADPT64' EQ '').EXTINFOCHK PROCESS EXTINFO     @L3A  05474505
         AIF   ('&LOADPT64'(1,1) EQ '(').LDRFORM64 R-FORM         @L3A  05474605
         LA    0,&LOADPT64        PICK UP LOADPT64 ADDRESS        @L3A  05474705
         ST    0,12(0,1)          STORE ADDRESS IN PARM LIST      @L3A  05474805
         AGO   .LDPT64BIT    SET DIRECTED LOAD POINT BIT          @L3A  05474905
.LDRFORM64 ANOP                                                   @L3A  05475005
         LA    0,0(0,&LOADPT64(1)) PICKUP LOADPT64 ADDRESS PARM   @L3A  05475105
         ST    0,12(0,1)           STORE ADDRESS IN PARM LIST     @L3A  05475205
.LDPT64BIT ANOP                                                   @L3A  05475305
         OI    &OFFFLG2.(1),X'08'   SET LOADPT64 SPECIFIED BIT    @L3A  05475405
.EXTINFOCHK ANOP                                                  @L1A  05475501
         AIF   ('&EXTINFO' EQ '').EOMCHK   PROCESS EOM OPTION     @L1A  05475601
         AIF   ('&EXTINFO'(1,1) EQ '(').XIRFORM  R-FORM           @L1A  05475701
         LA    0,&EXTINFO         PICK UP EXTINFO ADDRESS         @L1A  05475801
         ST    0,12(0,1)          STORE ADDRESS IN PARM LIST      @L1A  05475901
         AGO   .EXTIBIT           SET EXTINFO BIT                 @L1A  05476001
.XIRFORM ANOP                                                     @L1A  05476101
         LA    0,0(0,&EXTINFO(1))  PICKUP EXTINFO ADDRESS PARM    @L1A  05476201
         ST    0,12(0,1)           STORE ADDRESS IN PARM LIST     @L1A  05476301
.EXTIBIT ANOP                                                     @L1A  05476400
         OI    &OFFFLG2.(1),X'40'  TURN ON EXTINFO SPECIFIED BIT  @L1A  05476500
.EOMCHK  ANOP                                                 @G860P35  05477000
         AIF   ('&EOM' EQ '').ADDRCHK  PROCESS ADDR OPTION    @G860P35  05479700
         AIF   ('&EOM' EQ 'NO').NOEOM  TURN OFF EOM BIT       @G860P35  05482400
         OI    &OFFFLG.(1),X'02'  TURN ON EOM SPECIFIED BIT   @G860P35  05485100
         AGO   .ADDRCHK      SET DIRECTED LOAD BIT            @G860P35  05487800
.NOEOM   ANOP                                                 @G860P35  05490500
         NI    &OFFFLG.(1),X'FD'  TURN OFF EOM REQUESTED BIT  @G860P35  05493200
.ADDRCHK ANOP                                                           05495900
         AIF   ('&ADDR' EQ '').ENDADDRCHK                         @L2C  05500000
         AIF   ('&ADDR'(1,1) EQ '(').ADRFORM  REG FORM        @G381P2A  05550000
         L     0,&ADDR            PICK UP LOAD ADDRESS        @G381P2A  05600000
         ST    0,12(0,1)          STORE LOAD ADDRESS IN PARM LIST       05650000
.*                                                            @G381P2A  05700000
         AGO   .ADRBIT       SET DIRECTED LOAD BIT            @G381P2A  05750000
.ADRFORM ANOP                                                 @G381P2A  05800000
         LA    0,0(0,&ADDR(1))    PICKUP LOAD ADDRESS PARM    @ZA63079  05837500
         ST    0,12(0,1)          STORE LOAD ADDRESS IN PARM LIST       05875000
.*                                                            @ZA63079  05912500
.ADRBIT  ANOP                                                 @G381P2A  05950000
         OI    &OFFFLG.(1),X'04'  TURN ON ADDRESS SPECIFIED BIT         06000000
.*                                                            @G381P2A  06050000
.ENDADDRCHK ANOP                                                  @L2C  06053300
.ADDR64CHK ANOP                                                         06053400
         AIF   ('&ADDR64' EQ '').ENDADDR64CHK                     @L2A  06053500
         AIF   ('&ADDR64'(1,1) EQ '(').ADR64FORM REG FORM         @L2A  06053600
         LG    0,&ADDR64          PICK UP LOAD64 ADDRESS          @L2A  06053700
         STG   0,16(0,1)          STORE LOAD64 ADDRESS IN PARM LIST     06053800
.*                                                                @L2A  06053900
         AGO   .ADR64BIT     SET DIRECTED LOAD64 BIT              @L2A  06054000
.ADR64FORM ANOP                                                   @L2A  06055000
         STG   &ADDR64(1),16(0,1) STORE LOAD64 ADDRESS IN PARM LIST     06056100
.*                                                                @L2A  06056200
.ADR64BIT ANOP                                                    @L2A  06056300
         OI    &OFFFLG2.(1),X'20'  ADDR64 SPECIFIED               @L2A  06056500
.ENDADDR64CHK ANOP                                                @L2C  06056600
         AIF   ('&ADRNAPF' EQ '').ENDADRNAPFCHK                   @L2C  06056700
         AIF   ('&ADRNAPF'(1,1) EQ '(').ADNFORM  REG FORM     @YA11577  06059900
         L     0,&ADRNAPF         PICK UP LOAD ADDRESS        @YA11577  06063200
         ST    0,12(0,1)          STORE LOAD ADDRESS IN PARM LIST       06066500
.*                                                            @YA11577  06069800
         AGO   .ADNBIT       SET DIRECTED LOAD BIT            @YA11577  06073100
.ADNFORM ANOP                                                 @YA11577  06076400
         LA    0,0(0,&ADRNAPF(1))       LOAD ADDRESS          @YA11577  06079700
         ST    0,12(0,1)          STORE LOAD ADDRESS IN PARM LIST       06083000
.*                                                            @YA11577  06086300
.ADNBIT  ANOP                                                 @YA11577  06089600
         OI    &OFFFLG2.(1),X'80'  TURN ON ADRNAPF SPECIFIED BIT        06092900
.*                                                            @YA11577  06096200
.ENDADRNAPFCHK ANOP                                               @L2C  06100000
         AIF   ('&ADRNAPF64' EQ '').ENDADRNAPF64CHK               @L2A  06110000
         AIF   ('&ADRNAPF64'(1,1) EQ '(').ADN64FORM REG FORM      @L2A  06120000
         LG    0,&ADRNAPF64       PICK UP LOAD64 ADDRESS          @L2A  06130000
         STG   0,16(0,1)          STORE LOAD64 ADDRESS IN PARM LIST     06140000
.*                                                                @L2A  06141000
         AGO   .ADN64BIT     SET DIRECTED LOAD64 BIT              @L2A  06142000
.ADN64FORM ANOP                                                   @L2A  06143000
         STG   &ADRNAPF64(1),16(0,1) STORE LOAD64 ADDRESS IN PARM LIST  06145000
.*                                                                @L2A  06146000
.ADN64BIT ANOP                                                    @L2A  06147000
         OI    &OFFFLG2.(1),X'10' ADRNAPF64 SPECIFIED             @L2A  06148000
.ENDADRNAPF64CHK ANOP                                             @L2A  06149100
         AIF   ('&GLOBAL' EQ '').RFLAG                                  06150000
         AIF   ('&GLOBAL(1)' EQ 'NO').GNO TURN OFF GLOBAL     @G381P2A  06200000
         AIF   ('&GLOBAL(2)' NE 'F').GYESP PROCESS GLOBAL PAGABLE       06250000
.*                                                            @G381P2A  06300000
         OI    &OFFFLG.(1),X'18'  TURN ON GLOBAL FIXED        @G381P2A  06350000
         AGO   .RFLAG                                                   06400000
.GYESP   ANOP                                                 @G381P2A  06450000
         OI    &OFFFLG.(1),X'10'  TURN ON GLOBAL              @G381P2A  06500000
         NI    &OFFFLG.(1),X'F7'  FIXED/PAGABLE BIT IS OFF    @G381P2A  06550000
         AGO   .RFLAG                                                   06600000
.GNO     ANOP                                                 @G381P2A  06650000
         NI    &OFFFLG.(1),X'E7'  TURN OFF GLOBAL             @G381P2A  06700000
         AGO   .RFLAG                                         @G381P2A  06750000
.RETCK   AIF   ('&ERRET' EQ '').RFLAG                                   06800000
         AIF   ('&ERRET'(1,1) EQ '(').RFORM  REG FORM         @G381P2A  06850000
         LA    0,&ERRET           PICK UP RETURN ADDRESS      @G381P2A  06900000
         ST    0,12(0,1)          STORE RETURN ADDRESS IN PARM LIST     06950000
.*                                                            @G381P2A  07000000
         AGO   .RFLAG                                         @G381P2A  07050000
.RFORM   LA    0,0(0,&ERRET(1))   PICKUP RETURN ADDRESS PARM  @ZA63079  07100000
         ST    0,12(0,1)          STORE RETURN ADDRESS IN PARM LIST     07150000
.*                                                            @ZA63079  07200000
.RFLAG   ANOP                                                 @G381P2A  07550000
         AIF   (NOT &B(4)).LCHK                               @G381P2A  07600000
         OI    &OFFFLG.(1),X'20'  TURN ON RETURN REQUESTED BIT          07650000
.*                                                            @G381P2A  07700000
.LCHK    AIF   ('&LSEARCH' EQ '').END                         @G381P2A  07750000
         AIF   ('&LSEARCH' EQ 'NO').LNO                       @G381P2A  07800000
         OI    &OFFFLG.(1),X'40'  TURN ON LSEARCH REQUESTED BIT         07850000
.*                                                            @G381P2A  07900000
         AGO   .END                                           @G381P2A  07950000
.LNO     ANOP                                                 @G381P2A  08000000
         NI    &OFFFLG.(1),X'BF'  TURN OFF LSEARCH REQUESTED BIT        08050000
.*                                                            @G381P2A  08100000
         AGO   .END                                           @G381P2A  08150000
.********************************************************************** 08166600
.*                                                                    * 08183200
.*  PROCESS SF=L FORM                                                 * 08199800
.*                                                                    * 08216400
.********************************************************************** 08233000
.LROUT   ANOP                                                     @L2C  08250000
         AIF   (&PL64).LCNOP1A    64-BIT PARAMETER LIST           @L2A  08251000
         CNOP  0,4                                            @G381P2A  08260000
         AGO   .LCNOP1B                                           @L2A  08270000
.LCNOP1A ANOP                                                     @L2A  08280000
         CNOP  0,8                                                @L2A  08281000
.LCNOP1B ANOP                                                     @L2A  08290000
         AIF   (NOT &B(1)).CKEPLOC                            @G381P2A  08560000
&NAME    DC    AL4(&EPNAME)       ADDRESS OF EP PARAMETER     @G381P2A  08600000
         AGO   .CHKDCB                                        @G381P2A  08650000
.CKEPLOC AIF   (&B(2)+&B(3) EQ 0).PUTZERO                     @G381P2A  08700000
         AIF   ('&EPLOC&DE'(1,1) EQ '(').E3                   @G381P2A  08750000
&NAME    DC    AL4(&EPLOC&DE)     EPLOC OR DE PARAMETER       @G381P2A  08800000
         AGO   .CHKDCB                                        @G381P2A  08850000
.PUTZERO ANOP                                                 @G381P2A  08900000
&NAME    DC    A(0)               ADDRESS OF EP OR DE PARAMETER         08950000
.*                                                            @G381P2A  09000000
.CHKDCB  AIF   ('&DCB' EQ '').ZERODCB                         @G381P2A  09050000
         AIF   ('&DCB'(1,1) EQ '(').E3                        @G381P2A  09100000
&DCBVAL  SETC  '&DCB'                                         @G381P2A  09150000
         AGO   .CHKERR                                        @G381P2A  09200000
.ZERODCB ANOP                                                 @G381P2A  09250000
&DCBVAL  SETC  '0'                                            @G381P2A  09300000
.CHKERR  AIF   ('&ERRET' EQ '').ZEROERR                       @G381P2A  09350000
         AIF   ('&ERRET'(1,1) EQ '(').E3                      @G381P2A  09400000
&ERRVAL  SETC  '&ERRET'                                       @G381P2A  09450000
         AGO   .DOLIST                                        @G381P2A  09500000
.ZEROERR ANOP                                                 @G381P2A  09550000
&ERRVAL  SETC  '0'                                            @G381P2A  09600000
.DOLIST  ANOP                                                 @G381P2A  09650000
         DC    AL4(&DCBVAL)       DCB ADDRESS PARAMETER       @G381P2A  09700000
         DC    AL1(0)             PARAMETER LIST FORMAT NUMBER          09750000
.*                                                            @G381P2A  09800000
         DC    AL1(0)             RESERVED                    @G381P2A  09850000
         DC    B'&B(3)&B(6)&B(4)&B(7)&B(8)&B(9)&B(12)&B(13)' OPTIONS    09900000
.*                                                            @G860P35  09950000
         AIF   ('&CALL' EQ 'LOAD').OPTION1     LOAD OPTIONS   @YA11577  09975000
         DC    AL1(0)             RESERVED                    @G381P2A  10000000
         AGO   .NLOAD1                                        @YA11577  10010000
.OPTION1 ANOP                                                 @YA11577  10020000
         DC    B'&B(14).&B(15).&B(16).&B(17).&B(18).000' OPTIONS  @L3C  10030005
.NLOAD1  ANOP                                                 @YA11577  10040000
         AIF   ('&CALL' NE 'LOAD').ERRCK  NOT LOAD, PROCESS ERRET       10050000
         AIF   ('&LOADPT' EQ '').NOLDPT     CHECK FOR ADDR    @G860P35  10058300
         AIF   ('&LOADPT'(1,1) EQ '(').E3   NO R-FORM ALLOWED @G860P35  10066600
         DC    A(&LOADPT)                   LOADPT PARAMETER  @G860P35  10074900
         AGO   .CHK64                                             @L2C  10083200
.NOLDPT  ANOP                                                 @G860P35  10091500
         AIF   ('&LOADPT64' EQ '').NOLDPT64 CHECK FOR ADDR        @L3A  10091605
         AIF   ('&LOADPT64'(1,1) EQ '(').E3 NO R-FORM ALLOWED     @L3A  10091705
         DC    A(&LOADPT64)                 LOADPT64 PARAMETER    @L3A  10091805
         AGO   .CHK64                                             @L3A  10091905
.NOLDPT64 ANOP                                                    @L3A  10092005
         AIF   ('&EXTINFO' EQ '').NOEXTI    CHECK FOR ADDR        @L1A  10092900
         AIF   ('&EXTINFO'(1,1) EQ '(').E3  NO R-FORM ALLOWED     @L1A  10094300
         DC    A(&EXTINFO)                  EXTINFO PARAMETER     @L1A  10095700
         AGO   .CHK64                                             @L2C  10097100
.NOEXTI  ANOP                                                     @L1A  10098500
.*                                                            @G381P2A  10100000
         AIF   ('&ADDR' EQ '' AND '&ADRNAPF' EQ '').NOADDR    @YA11577  10150000
.*                                                            @G381P2A  10200000
         AIF   ('&ADDR' EQ '').NOADDN                         @YA11577  10216600
.*                                                            @YA11577  10233200
         AIF   ('&ADDR'(1,1) EQ '(').E3 NO  R-FORM ALLOWED    @G381P2A  10250000
         AGO   .NOADDN2                                       @YA11577  10266600
.NOADDN  ANOP                                                 @YA11577  10283200
         AIF   ('&ADRNAPF'(1,1) EQ '(').E3   NO R-FORM        @YA11577  10299800
.NOADDN2 ANOP                                                 @YA11577  10316400
         DC    A(&ADDR&ADRNAPF)   LOAD ADDRESS PARAMETER      @YA11577  10333000
         AGO   .CHK64                                             @L2C  10350000
.NOADDR  ANOP                                                 @G381P2A  10400000
         DC    A(0)               EXPLICIT LOAD, LOADPT, EXTINFO  @L1C  10450000
         AGO   .CHK64                                             @L2C  10500000
.CHK64   ANOP                                                     @L2C  10501000
         AIF   ('&ADDR64' EQ '' AND '&ADRNAPF64' EQ '').NOADDR64  @L2A  10510000
         AIF   ('&ADDR64' EQ '').NOADDN64                         @L2A  10530000
         AIF   ('&ADDR64'(1,1) EQ '(').E3 NO R-FORM ALLOWED       @L2A  10541000
         AGO   .NOADDN642                                         @L2A  10542000
.NOADDN64 ANOP                                                    @L2A  10543000
         AIF   ('&ADRNAPF64'(1,1) EQ '(').E3 NO R-FORM            @L2A  10544000
.NOADDN642 ANOP                                                   @L2A  10545000
         DC    AD(&ADDR64&ADRNAPF64) ADDR64/ADRNAPF64             @L2A  10546000
         AGO   .CHKEP                                             @L2A  10547000
.NOADDR64 ANOP                                                    @L2A  10548000
         AIF  ('&PLISTVER' NE '1' AND '&PLISTVER' NE 'MAX').CHKEP @L2A  10548100
         DC    AD(0)              ADDR64/ADRNAPF64                @L2A  10549000
         AGO   .CHKEP                                             @L2A  10549100
.ERRCK   ANOP                                                 @G381P2A  10550000
         AIF   ('&ERRET' EQ '').PASSERR                       @G381P2A  10700000
         DC    A(&ERRVAL)         RETURN ADDRESS PARAMETER    @G381P2A  10750000
         DC    A(0)               PROBLEM PROGRAM PARAMETERS ADDRESS    10800000
.*                                                            @G381P2A  10850000
         AGO   .CHKEP                                         @G381P2A  10900000
.PASSERR ANOP                                                 @G381P2A  10950000
         DC    A(0)               RETURN ADDRESS PARAMETER    @G381P2A  11000000
         DC    A(0)               PROBLEM PROGRAM PARAMETERS ADDRESS    11050000
.*                                                            @G381P2A  11100000
.CHKEP   AIF   (NOT &B(1)).END                                @G381P2A  11150000
&EPNAME  DC    CL8'&EP'           EP PARAMETER                @G381P2A  11200000
         AGO   .END                                           @G381P2A  11250000
.********************************************************************** 11266600
.*                                                                    * 11283200
.*  PROCESS SF=I FORM                                                 * 11299800
.*                                                                    * 11316400
.********************************************************************** 11333000
.IROUT   AIF   (&B(1)+&B(2)+&B(3) NE 1).E4                    @G381P2A  11350000
.*         CALCULATE LENGTH PARM LIST +4 FOR BRANCH AROUND              11400000
&CTR     SETA  16+8*&B(1)   3 WORDS LONG +2 FOR EP            @G381P2A  11450000
&CTR     SETA  &CTR+8*&B(10) 5 WORDS LONG IF LINK OR XCTL     @G381P2A  11500000
&CTR     SETA  &CTR+4*&B(11) 4 WORDS LONG IF LOAD             @G381P2A  11550000
&CTR     SETA  &CTR+8*&PL64  8 MORE BYTES IF 64-BIT PARMLIST      @L2A  11551000
         AIF   (&PL64).ICNOP1A                                    @L2A  11560000
         CNOP  0,4                                            @ZA64577  11583300
         AGO   .ICNOP1B                                           @L2A  11583500
.ICNOP1A ANOP                                                     @L2A  11583600
.* ALL OF THE CASES THAT GET HERE REQUIRE SYSALVL > 1, SO WILL          11583700
.* USE THE AL1A PATH AND DO NOT NEED ALIGNMENT UNTIL THE "LOAD1"        11583800
.* SECTION                                                              11583900
.ICNOP1B ANOP                                                     @L2A  11584000
.*                 REMOVE THE LABEL ON THE PREVIOUS STATEMENT @YA21876  11616600
         AIF   (&SYSALVL GT 0).AL1A                                     11633300
         AIF   ('&PARAM' EQ '' AND '&MF(1)' NE 'E').LOAD   CONSTRUCT    11650000
.*                                   BRANCH                   @ZMB0095  11675000
         ST    1,*+28             STORE PROGRAM PARM LIST ADDR          11700000
.*                                                            @G381P2A  11750000
.LOAD    ANOP                                                 @G381P2A  11800000
         LA    1,*+8              PICK UP ADDR OF PARM LIST   @G381P2A  11850000
         B     *+&CTR             BRANCH AROUND CONSTANTS     @G381P2A  11900000
         AGO   .AL1B                                          @G381P2A  11910000
.AL1A    ANOP                                                 @G381P2A  11920000
         AIF   ('&PARAM' EQ '' AND '&MF(1)' NE 'E').LOAD1  CONSTRUCT    11922500
.* THE FOLLOWING MUST BE A 4-BYTE INSTRUCTION TO PRESERVE         @02C  11925000
.* ALIGNMENT                                                      @02C  11925100
         LA    15,0(1)            SAVE REG 1                      @02C  11926000
.LOAD1   ANOP                                                 @G381P2A  11927500
         AIF   (NOT &PL64).ICNOP2B                                @L2A  11927600
         CNOP  4,8                                            @ZA64577  11929100
.ICNOP2B ANOP                                                     @L2A  11929200
         BRAS  1,*+&CTR           PICK UP ADDR OF PARM LIST             11930000
.AL1B    ANOP                                                 @G381P2A  11940000
         AIF   (NOT &B(1)).NOEP                               @G381P2A  11950000
         DC    A(&EPNAME)         EP PARAMETER ADDRESS        @G381P2A  12000000
         AGO   .DCB    PROCESS DCB ADDRESS                    @G381P2A  12050000
.NOEP    AIF   ('&EPLOC&DE'(1,1) EQ '(').ZERODE R-FORM, GEN ZERO ADDR   12100000
.*                                                            @G381P2A  12150000
         DC    AL4(&EPLOC&DE)     EPLOC OR DE PARAMETER       @G381P2A  12200000
         AGO   .DCB    PROCESS DCB ADDRESS                    @G381P2A  12250000
.ZERODE  DC    A(0)               EPLOC OR DE PARAMETER       @G381P2A  12300000
.DCB     ANOP                                                 @G381P2A  12350000
         AIF   ('&DCB' EQ '').ZDCB  NO DCB GENERATE ZERO ADDRESS        12400000
.*                                                            @G381P2A  12450000
         AIF   ('&DCB'(1,1) EQ '(').ZDCB R-FORM DCB GEN ZERO ADDR       12500000
.*                                                            @G381P2A  12550000
         DC    AL4(&DCB)          DCB ADDRESS PARAMETER       @G381P2A  12600000
         AGO   .DCGEN    GENERATE CONSTANTS                   @G381P2A  12650000
.ZDCB    ANOP                                                 @G381P2A  12700000
         DC    AL4(0)             DCB ADDRESS PARAMETER       @G381P2A  12750000
.DCGEN   ANOP                                                 @G381P2A  12800000
         DC    AL1(0)             PARAMETER LIST FORMAT NUMBER          12850000
.*                                                            @G381P2A  12900000
         DC    AL1(0)             RESERVED                    @G381P2A  12950000
         DC    B'&B(3)&B(6)&B(4)&B(7)&B(8)&B(9)&B(12)&B(13)'  OPTIONS   13000000
.*                                                            @G860P35  13050000
         AIF   ('&CALL' EQ 'LOAD').OPTION2     LOAD OPTIONS   @YA11577  13075000
         DC    AL1(0)             RESERVED                    @G381P2A  13100000
         AGO   .NLOAD2                                        @YA11577  13110000
.OPTION2 ANOP                                                 @YA11577  13120000
         DC    B'&B(14).&B(15).&B(16).&B(17).&B(18).000' OPTIONS  @L3C  13130005
.NLOAD2  ANOP                                                 @YA11577  13140000
         AIF   ('&CALL' NE 'LOAD').ECHECK NOT LOAD, PROCESS ERRET       13150000
         AIF   ('&LOADPT' EQ '').ZLOADPT                      @G860P35  13158300
         AIF   ('&LOADPT'(1,1) EQ '(').ZADDR  R-FORM GEN ZERO @G860P35  13166600
         DC    A(&LOADPT)                    LOADPT PARAMETER @G860P35  13174900
         AGO   .CHK642                                            @L2C  13183200
.ZLOADPT ANOP                                                 @G860P35  13191500
         AIF   ('&LOADPT64' EQ '').ZLOADPT64                      @L3A  13191605
         AIF   ('&LOADPT64'(1,1) EQ '(').ZADDR R-FORM GEN ZERO    @L3A  13191705
         DC    A(&LOADPT64)                  LOADPT64 PARAMETER   @L3A  13191805
         AGO   .CHK642                                            @L3A  13191905
.ZLOADPT64 ANOP                                                   @L3A  13192005
         AIF   ('&EXTINFO' EQ '').ZEXTINFO                        @L1A  13192900
         AIF   ('&EXTINFO'(1,1) EQ '(').ZADDR R-FORM GEN ZERO     @L1A  13194300
         DC    A(&EXTINFO)                  EXTINFO PARAMETER     @L1A  13195700
         AGO   .CHK642                                            @L2C  13195800
.ZEXTINFO ANOP                                                    @L1A  13198500
.*                                                            @G381P2A  13200000
         AIF   ('&ADDR' EQ '' AND '&ADRNAPF' EQ '').ZADDR     @YA11577  13233300
         AIF   ('&ADDR' EQ '').ZADDN                          @YA11577  13266600
         AIF   ('&ADDR'(1,1) EQ '(').ZADDR R-FORM GEN ZERO ADDR         13300000
.*                                                            @G381P2A  13350000
         AGO   .ZADDN2                                        @YA11577  13364200
.ZADDN   ANOP                                                 @YA11577  13378400
         AIF   ('&ADRNAPF'(1,1) EQ '(').ZADDR     R-FORM      @YA11577  13392600
.*                                                            @YA11577  13406800
.ZADDN2  ANOP                                                 @YA11577  13421000
         DC    A(&ADDR&ADRNAPF)   LOAD ADDRESS PARAMETER      @YA11577  13435200
         AGO   .CHK642                                            @L2C  13435300
.ZADDR   DC    A(0)               EXPLICIT LOAD, LOADPT, EXTINFO  @L1C  13500000
         AGO   .CHK642                                            @L2C  13510000
.CHK642  ANOP                                                     @L2A  14101000
         AIF   ('&ADDR64' EQ '' AND '&ADRNAPF64' EQ '').ZADDR64   @L2A  14110000
         AIF   ('&ADDR64' EQ '').ZADDN64                          @L2A  14120000
         AIF   ('&ADDR64'(1,1) EQ '(').ZADDR641 R-FORM GEN ZERO ADDR64  14130000
.*                                                                @L2A  14140000
         AGO   .ZADDN642                                          @L2A  14141000
.ZADDN64 ANOP                                                     @L2A  14142000
         AIF   ('&ADRNAPF64'(1,1) EQ '(').ZADDR641 R-FORM         @L2A  14143000
.ZADDN642 ANOP                                                    @L2A  14145000
         DC    AD(&ADDR64&ADRNAPF64) LOAD ADDRESS PARAMETER       @L2A  14146000
         AGO   .EPCHECK                                           @L2A  14147000
.ZADDR64 ANOP                     ADDR64                          @L2A  14148000
      AIF   ('&PLISTVER' NE '1' AND '&PLISTVER' NE 'MAX').EPCHECK @L2A  14148200
.ZADDR641 ANOP                    ADDR64                          @L2A  14148400
         DC    AD(0)              ADDR64                          @L2A  14148500
         AGO   .EPCHECK                                           @L2A  14149000
.ECHECK  ANOP                                                 @G381P2A  14149100
         AIF   ('&ERRET' EQ '').ZERRET NO ERRET GEN ZERO ADDRESS        14149200
.*                                                            @G381P2A  14149400
         AIF   ('&ERRET'(1,1) EQ '(').ZERRET R-FORM GEN ZERO ADDR       14149500
.*                                                            @G381P2A  14149700
         DC    A(&ERRET)          ERROR ADDRESS PARAMETER     @G381P2A  14149800
         DC    A(0)               PROBLEM PROGRAM PARAMETERS ADDRESS    14149900
.*                                                            @G381P2A  14150000
         AGO   .EPCHECK                                       @G381P2A  14151000
.ZERRET  DC    A(0)               ERROR ADDRESS PARAMETER     @G381P2A  14160000
         DC    A(0)               PROBLEM PROGRAM PARAMETERS ADDRESS    14200000
.*                                                            @G381P2A  14250000
.EPCHECK ANOP                                                 @G381P2A  14300000
.*                                                               5@02D  14360000
.*                                                            @G381P2A  14370000
         AIF   (NOT &B(1)).ACTION  PROCESS R-FORMS                      14400000
.*                                                            @G381P2A  14450000
&EPNAME  DC    CL8'&EP'           EP PARAMETER                @G381P2A  14500000
.ACTION  ANOP                                                     @02A  14550000
.* SECTION MOVED HERE                                             @02M  14550100
         AIF   (&SYSALVL LT 1).AL2A                                     14551000
         AIF   ('&PARAM' EQ '' AND '&MF(1)' NE 'E').LOAD2  CONSTRUCT    14552000
         ST    15,16(0,1)         SAVE PARAM                      @02C  14553000
.LOAD2   ANOP                                                 @G381P2A  14554000
.AL2A    ANOP                                                           14555000
.* END OF MOVED SECTION                                           @02M  14556000
         AIF   (&B(1)).TESTDCB  EP SPECIFIED, PROCESS DCB R-FORM  @02C  14560000
.*                                                            @G381P2A  14600000
         AIF   ('&EPLOC&DE'(1,1) NE '(').TESTDCB  PROCESS DCB R-FORM    14650000
.*                                                            @G381P2A  14700000
         LA    0,0(0,&EPLOC(1)&DE(1)) PICKUP EPLOC OR DE PARM @ZA63079  14733300
         ST    0,0(0,1)               STORE IN SUPV PARM LIST @ZA63079  14766600
.TESTDCB ANOP                                                 @G381P2A  14800000
         AIF   ('&DCB' EQ '').ERTEST PROCESS ERRET R-FORM     @G381P2A  14850000
         AIF   ('&DCB'(1,1) NE '(').ERTEST PROCESS ERRET R-FORM         14900000
.*                                                            @G381P2A  14950000
         LA    0,0(0,&DCB(1))     PICKUP DCB ADDRESS PARM     @ZA63079  14987500
         ST    0,4(0,1)           STORE DCB ADDRESS IN SUP PARMS        15025000
.*                                                            @ZA63079  15062500
.ERTEST  ANOP                                                 @G381P2A  15100000
         AIF   ('&ERRET' EQ '').ADTEST PROCESS ADDR           @G381P2A  15150000
         AIF   ('&ERRET'(1,1) NE '(').ADTEST PROCESS ADDR     @G381P2A  15200000
         LA    0,0(0,&ERRET(1))   PICKUP ERROR ADDRESS PARM   @ZA63079  15237500
         ST    0,12(0,1)          STORE ERROR ADDRESS PARAMETER         15275000
.*                                                            @ZA63079  15312500
.ADTEST  ANOP                                                 @G381P2A  15350000
         AIF   ('&ADDR' EQ '' AND '&ADRNAPF' EQ '').EADDR         @L2C  15383300
         AIF   ('&ADDR' EQ '').ADNTEST                        @YA11577  15416600
         AIF   ('&ADDR'(1,1) NE '(').END                                15450000
         AGO   .ADADDR                                        @YA11577  15456400
.ADNTEST ANOP                                                 @YA11577  15462800
         AIF   ('&ADRNAPF'(1,1) NE '(').END  NOT THE R-FORM   @YA11577  15469200
.ADADDR  ANOP                                                 @YA11577  15475600
         LA    0,0(0,&ADDR(1)&ADRNAPF(1))   LOAD ADDRESS      @YA11577  15482000
         ST    0,12(0,1)         STORE LOAD ADDRESS PARAMETER @ZA63079  15488800
         AGO   .END                                                     15508300
.EADDR ANOP                                                       @L2C  15516600
         AIF   ('&ADDR64' EQ '' AND '&ADRNAPF64' EQ '').EADDR64   @L2C  15516700
         AIF   ('&ADDR64' EQ '').ADN64TEST                        @L2A  15516800
         AIF   ('&ADDR64'(1,1) NE '(').END                        @L2A  15516900
         AGO   .ADADDR64                                          @L2A  15517000
.ADN64TEST ANOP                                                   @L2A  15518000
         AIF   ('&ADRNAPF64'(1,1) NE '(').END NOT THE R-FORM      @L2A  15519000
.ADADDR64 ANOP                                                    @L2A  15520000
         STG   &ADDR64(1)&ADRNAPF64(1),16(0,1)                    @L2A  15521000
         AGO   .END                                               @L2A  15523000
.EADDR64 ANOP                                                     @L2A  15524000
         AIF   ('&LOADPT' EQ '').RLOADPT64                        @L3C  15524905
         AIF   ('&LOADPT'(1,1) NE '(').END       NOT R-FORM   @G860P35  15533200
         LA    0,0(0,&LOADPT(1))    PICKUP LOADPT ADDRESS     @ZA63079  15538800
         ST    0,12(0,1)            STORE LOADPT ADDRESS      @ZA63079  15544400
.RLOADPT64 ANOP                                                   @L3A  15545305
         AIF   ('&LOADPT64' EQ '').REXTINFO                       @L3A  15545405
         AIF   ('&LOADPT64'(1,1) NE '(').END     NOT R-FORM       @L3A  15545505
         ST    &LOADPT64(1),12(0,1) STORE LOADPT64 ADDRESS        @L3A  15545606
.REXTINFO ANOP                                                @G860P35  15545901
         AIF   ('&EXTINFO' EQ '').END                             @L1A  15546200
         AIF   ('&EXTINFO'(1,1) NE '(').END      NOT R-FORM       @L1A  15547100
         LA    0,0(0,&EXTINFO(1))   PICKUP EXTINFO ADDRESS        @L1A  15548000
         ST    0,12(0,1)            STORE EXTINFO ADDRESS         @L1A  15548900
.*                                                            @G381P2A  15550000
.END     MEND                                                 @G381P2A  15600000
