         MACRO                                                @G381P2A  00010000
&NAME    IHBINNRY &EP,&EPLOC,&DE,&DCB,&LSEARCH,               @G381P2A X00020000
               &CALL,&PARAM,&MF,                              @G381P2A X00030000
               &ERRET=,&SF=I,&PLIST8=,&PLIST4=                    @L2C  00040000
.********************************************************************** 00050000
.*                                                                    * 00060000
.* COPYRIGHT = 5694-A01                                               * 00070000
.*             THIS MODULE IS "RESTRICTED MATERIALS OF IBM"           * 00080000
.*             (C) COPYRIGHT IBM CORP. 1988, 2002                     * 00090000
.*             LICENSED MATERIALS - PROPERTY OF IBM                   * 00100000
.*                                                                    * 00110000
.* STATUS =  HBB7706                                                  * 00120000
.*                                                                    * 00130000
.*01* EXTERNAL CLASSIFICATION: NONE                                   * 00140000
.*01* END OF EXTERNAL CLASSIFICATION:                                 * 00150000
.*                                                                    * 00160000
.* CHANGE ACTIVITY =                                                  * 00170000
.*   $L1 =    AR    HBB3310 850901 PDXB: AR SUPPORT                   * 00180000
.*   $01=OY56888,HBB3310,920825,PDPA: ALLOW EXPLICIT NOTATION FOR     * 00190000
.*                                    PARAMETER LIST ADDRESS      @01A* 00200000
.*   $02=OY65329,HBB4420,930826,PDBE: REMOVE DUPLICATE &NAME LBLS @02A* 00210000
.*   $L2 = 64BITCSV HBB7703 980311 PDXB: 64-BIT SUPPORT               * 00220000
.*   $P1 = PYM0390  HBB7706 010720 PDXB: FIX CNOP FOR BRAS            * 00230000
.*   $03=OW57320,HBB7706,021114,PDXB: AMODE64OK                       * 00240000
.*   $04=OA16375,HBB7730,060505,PDXB: CORRECT STAM                    * 00250000
.*                                                                    * 00260000
.********************************************************************** 00270000
         GBLC  &IHBNO                                         @G381P2A  00280000
         LCLB  &B(15)                                             @LXC  00290000
         LCLA  &A,&OFFBASE,&OFFFLG                                @L2C  00300000
         LCLC  &CHARS,&DCBVAL,&EPNAME,&ERRVAL                 @G381P2A  00310000
         LCLC  &PNAME                                             @L1A  00320000
&EPNAME  SETC  'IHB'.'&SYSNDX'                                @G381P2A  00330000
&B(1)    SETB  ('&EP' NE '')                                  @G381P2A  00340000
&B(2)    SETB  ('&EPLOC' NE '')                               @G381P2A  00350000
&B(3)    SETB  ('&DE' NE '')                                  @G381P2A  00360000
&B(4)    SETB  ('&ERRET' NE '')                               @G381P2A  00370000
&B(5)    SETB  0                                                        00380000
         GBLC  &SYSASCE                                            @L1A 00390000
         GBLC  &SYSAM64                                            @L2A 00400000
         GBLA  &SYSALVL                                            @L2A 00410000
         GBLC  &SYSPLIST8                                          @L2A 00420000
         GBLC  &SYSAMODE64OK         AMODE64 TARGET IS OK         @03A  00430000
         SYSSTATE TEST                  TEST ASC ENVIRONMENT       @L1A 00440000
         LCLC  &LA                      "LA" OR "LAE" VIA SYSSTATE @L1A 00450000
&LA      SETC  'LA'                     MUST USE LA INSTRUCTION    @L1A 00460000
         AIF   ('&SYSASCE' EQ 'P').NOLAE                           @L1A 00470000
&LA      SETC  'LAE'                    MUST USE LAE               @L1A 00480000
.NOLAE   ANOP                                                      @L1A 00490000
         AIF   ('&LSEARCH' EQ '').NLSER   NO LSEARCH CONTINUE @G381P2A  00500000
         AIF   ('&LSEARCH' NE 'YES' AND '&LSEARCH' NE 'NO').E6          00510000
.*                                                            @G381P2A  00520000
&B(6)    SETB  ('&LSEARCH(1)' EQ 'YES')                       @G381P2A  00530000
.NLSER   ANOP                                                 @G381P2A  00540000
&B(7)    SETB  ('&SYSPLIST8' EQ 'YES')  8-BYTE PLIST ENTRY        @L2C  00550000
&B(8)    SETB  ('&SYSAMODE64OK' EQ 'YES') AMODE 64 TARGET OK      @03C  00560000
&B(9)    SETB  0                     NOT ADDR                     @L1C  00570000
&B(10)   SETB  ('&CALL' EQ 'LINK' OR '&CALL' EQ 'XCTL')       @G381P2A  00580000
&B(11)   SETB  0                     NOT LOAD                     @L1C  00590000
&B(12)   SETB  0                     NOT USED                     @L1C  00600000
&B(13)   SETB  0                     NO LOADPT                    @L1C  00610000
&B(15)   SETB  0                     NO EXTINFO                   @LXC  00620000
         AIF   (&B(1)+&B(2)+&B(3) GT 1).E1   TOO MANY PARMS SPECIFIED   00630000
.*                                                            @G381P2A  00640000
         AIF   ('&EP' EQ '').AGONE   EP NOT SPECIFIED         @G381P2A  00650000
         AIF   ('&EP'(1,1) EQ '(').E1A  EP REG FORM NOT ALLOWED         00660000
.*                                                            @G381P2A  00670000
.AGONE   ANOP                                                 @G381P2A  00680000
         AIF   ('&SF' EQ 'L').LROUT   PROCESS L FORM          @G381P2A  00690000
&OFFFLG  SETA  (10)   COMPUTE FLAGS OFFSET                    @G381P2A  00700000
         AIF   ('&SF' EQ 'I').IROUT   PROCESS I FORM          @G381P2A  00710000
.********************************************************************** 00720000
.*                                                                    * 00730000
.*  PROCESS SF=E FORM                                                 * 00740000
.*                                                                    * 00750000
.********************************************************************** 00760000
         CNOP  0,4                                       @ZA64577 @02C  00770000
.*              REMOVE LABEL ON PREVIOUS CNOP - CAUSES DUP LABELS @02A  00780000
         AIF   (N'&SF NE 2).E2     ' E FORM MUST HAVE 2 OPERANDS        00790000
.*                                                            @G381P2A  00800000
         AIF   ('&SF(1)' NE 'E').E2   E FORM MUST BE SPECIFIED          00810000
.*                                                            @G381P2A  00820000
         AIF   ('&SF'(4,1) EQ '(').ISAREG  E FORM REG SPECIFIED         00830000
.*                                                            @G381P2A  00840000
         AIF   ('&PARAM' EQ '' AND '&MF(1)' NE 'E').ACONST CONSTRUCT    00850000
.*                                   BRANCH                   @ZMB0095  00860000
         AIF   ('&SYSPLIST8' NE 'YES').TRYARA                     @L2A  00870000
         AIF   (&SYSALVL LT 2).XCST1                              @L2A  00880000
         STG   1,&SF(2)+16        STORE 64-BIT PLIST ADDRESS      @L2A  00890000
         AGO   .ACONST                                            @L2A  00900000
.XCST1   ANOP                                                     @L2A  00910000
         XC    &SF(2)+16(4),&SF(2)+16                             @L2A  00920000
         ST    1,&SF(2)+20        STORE PLIST ADDRESS             @L2A  00930000
         AGO   .ACONST                                            @L2A  00940000
.TRYARA  ANOP                                                     @L2A  00950000
         ST    1,16+&SF(2)    STORE PROBLEM PROG PARM LIST ADDR   @01C  00960000
         AIF   ('&SYSASCE' EQ 'P').ACONST                         @L1A  00970000
         STAM  1,1,&SF(2)+28      STORE PROBLEM PROG PLIST ALET   @L1A  00980000
.*                                                            @G381P2A  00990000
.ACONST  ANOP                                                 @G381P2A  01000000
         &LA   1,&SF(2)           LOAD SUPV PARM LIST ADDR        @L1C  01010000
         AGO   .CONTA                                         @G381P2A  01020000
.E1      IHBERMAC 88,&IHBNO   TOO MANY PARAMETERS PRESENT     @G381P2A  01030000
         MEXIT                                                @G381P2A  01040000
.E1A     IHBERMAC 42,&EP      R-FORM INVALID FOR EP NAME      @G381P2A  01050000
         MEXIT                                                @G381P2A  01060000
.E2      IHBERMAC 41,,&SF,,,0   SF PARAMETER BAD              @G381P2A  01070000
         MEXIT                                                @G381P2A  01080000
.E3      IHBERMAC 72,&IHBNO   REG. NOT. W/SF=L                @G381P2A  01090000
         MEXIT                                                @G381P2A  01100000
.E4      IHBERMAC 31,&IHBNO   EP,EPLOC,DE ALL MISSING         @G381P2A  01110000
         MEXIT                                                @G381P2A  01120000
.E6      MNOTE    12,'*** IHB006 LSEARCH MUST BE YES OR NO'   @G381P2A  01130000
         MEXIT                                                @G381P2A  01140000
.ISAREG  ANOP                                                 @G381P2A  01150000
         AIF   ('&SF(2)' EQ '(1)').E2 R1 NOT ALLOWED          @G381P2A  01160000
&A       SETA  K'&SF-6  ' CALCULATE PTR TO REGISTER IN STRING @G381P2A  01170000
&CHARS   SETC  '&SF'(5,&A) EXTRACT REGISTER SPECIFIED         @G381P2A  01180000
         AIF   ('&PARAM' EQ '' AND '&MF(1)' NE 'E').BCONST CONSTRUCT    01190000
.*                                   BRANCH                   @ZMB0095  01200000
         AIF   ('&SYSPLIST8' NE 'YES').TRYARB                     @L2A  01210000
         AIF   (&SYSALVL LT 2).XCST2                              @L2A  01220000
         STG   1,16(&CHARS)      STORE 64-BIT PLIST ADDRESS       @L2A  01230000
         AGO   .BCONST                                            @L2A  01240000
.XCST2   ANOP                                                     @L2A  01250000
         XC    16(4,&CHARS),16(&CHARS)                            @L2A  01260000
         ST    1,20(&CHARS)      STORE 64-BIT PLIST ADDRESS       @L2A  01270000
         AGO   .BCONST                                            @L2A  01280000
.TRYARB  ANOP                                                     @L2A  01290000
         ST    1,16(&CHARS)       STORE PROBLEM PROG PARM LIST ADDR     01300000
         AIF   ('&SYSASCE' EQ 'P').BCONST                         @L1A  01310000
         STAM  1,1,28(&CHARS)     STORE PROBLEM PROG PLIST ALET   @L1A  01320000
.*                                                            @G381P2A  01330000
.BCONST  ANOP                                                 @G381P2A  01340000
         &LA   1,0(,&CHARS)       LOAD SUPV PARM LIST ADDR        @L1C  01350000
.CCONST  ANOP                                                 @G381P2A  01360000
.CONTA   ANOP                                                           01370000
         AIF   ('&EP' EQ '' AND '&EPLOC' EQ '' AND                     *01380000
                '&DE' EQ '' AND '&LSEARCH' EQ '' AND                   *01390000
                '&CALL' EQ '' AND                                      *01400000
                '&PARAM' EQ '' AND '&ERRET' EQ '').NOVERSN              01410000
         MVI   8(1),1             SET VERSION NUMBER                    01420000
.NOVERSN ANOP                                                           01430000
         AIF   (NOT &B(1)).CONTB  IF NO EP SPECIFIED          @G381P2A  01440000
         AIF   (&SYSALVL GT 0).ALVL2A                                   01450000
         &LA   0,*+8              LOAD EP ADDR IN REG 0           @L1C  01460000
         B     *+12               BRANCH AROUND EP            @G381P2A  01470000
         DC    CL8'&EP'           EP SYMBOL                   @G381P2A  01480000
         AGO   .ALVL2B                                                  01490000
.ALVL2A  ANOP                                                           01500000
         &LA   0,=CL8'&EP'        LOAD EP ADDR IN REG 0           @L1C  01510000
.ALVL2B  ANOP                                                           01520000
         ST    0,0(0,1)           STORE EP ADDR IN SUPV PARMLIST        01530000
         AIF   ('&SYSASCE' EQ 'P').DCBCHK                         @L1A  01540000
         AIF   ('&SYSPLIST8' EQ 'YES').DCBCHK                     @L2A  01550000
         STAM  0,0,20(1)          STORE EP ADDR ALET              @L1A  01560000
.*                                                            @G381P2A  01570000
         AGO   .DCBCHK            CHECK FOR DCB               @G381P2A  01580000
.CONTB   AIF   (&B(2)+&B(3) EQ 0).DCBCHK NEITHER DE NOR EPLOC SPECIFIED 01590000
.*                                                            @G381P2A  01600000
         AIF   ('&EPLOC&DE'(1,1) EQ '(').ISAREGA  PROCESS REG FORM      01610000
.*                                                            @G381P2A  01620000
         &LA   0,&EPLOC&DE        PICK UP SUPV PARMLIST           @L1C  01630000
         ST    0,0(0,1)           STORE IN SUPV PARMLIST      @G381P2A  01640000
         AIF   ('&SYSASCE' EQ 'P').DECHK                          @L1A  01650000
         AIF   ('&SYSPLIST8' EQ 'YES').DECHK                      @L2A  01660000
         STAM  0,0,20(1)          STORE EP ADDR ALET              @L1A  01670000
         AGO   .DECHK                                         @G381P2A  01680000
.ISAREGA &LA   0,0(0,&EPLOC(1)&DE(1)) PICKUP EPLOC OR DE PARM     @L1C  01690000
         ST    0,0(0,1)               STORE IN SUPV PARMLIST  @ZA63079  01700000
         AIF   ('&SYSASCE' EQ 'P').DECHK                          @L1A  01710000
         AIF   ('&SYSPLIST8' EQ 'YES').DECHK                      @L2A  01720000
         STAM  0,0,20(1)          STORE EP ADDR ALET              @L1A  01730000
.DECHK   AIF   (NOT &B(3)).DCBCHK  DE NOT SPECIFIED           @G381P2A  01740000
         OI    &OFFFLG.(1),X'80'  SET DE SWITCH BIT ON        @G381P2A  01750000
.DCBCHK  AIF   ('&DCB' EQ '').LOADCK PROCESS ADDR OPERAND     @G381P2A  01760000
         AIF   ('&DCB'(1,1) EQ '(').ISAREGB REG FORM          @G381P2A  01770000
         &LA   0,&DCB             PICK UP DCB PARM                @L1C  01780000
         AGO   .STORDCB                                       @G381P2A  01790000
.ISAREGB &LA   0,0(0,&DCB(1))     PICK UP DCB PARM                @L1C  01800000
.STORDCB ST    0,4(0,1)           STORE DCB PARAMETER IN LIST @G381P2A  01810000
         AIF   ('&SYSASCE' EQ 'P').LOADCK                         @L1A  01820000
         STAM  0,0,24(1)          STORE DCB PARAMETER ALET        @L1A  01830000
.LOADCK  ANOP                     NOT LOAD                        @L1C  01840000
.RETCK   AIF   ('&ERRET' EQ '').RFLAG                                   01850000
         AIF   ('&ERRET'(1,1) EQ '(').RFORM  REG FORM         @G381P2A  01860000
         LA    0,&ERRET           PICK UP RETURN ADDRESS      @G381P2A  01870000
         ST    0,12(0,1)          STORE RETURN ADDRESS IN PARM LIST     01880000
.*                                                            @G381P2A  01890000
         AGO   .RFLAG                                         @G381P2A  01900000
.RFORM   LA    0,0(0,&ERRET(1))   PICKUP RETURN ADDRESS PARM  @ZA63079  01910000
         ST    0,12(0,1)          STORE RETURN ADDRESS IN PARM LIST     01920000
.*                                                            @ZA63079  01930000
.RFLAG   ANOP                                                 @G381P2A  01940000
         AIF   (NOT &B(4)).LCHK                               @G381P2A  01950000
         OI    &OFFFLG.(1),X'20'  TURN ON RETURN REQUESTED BIT          01960000
.*                                                            @G381P2A  01970000
.LCHK    AIF   ('&LSEARCH' EQ '').ENDLCHK                     @G381P2A  01980000
         AIF   ('&LSEARCH' EQ 'NO').LNO                       @G381P2A  01990000
         OI    &OFFFLG.(1),X'40'  TURN ON LSEARCH REQUESTED BIT         02000000
.*                                                            @G381P2A  02010000
         AGO   .ENDLCHK                                       @G381P2A  02020000
.LNO     ANOP                                                 @G381P2A  02030000
         NI    &OFFFLG.(1),X'BF'  TURN OFF LSEARCH REQUESTED BIT        02040000
.*                                                            @G381P2A  02050000
.ENDLCHK ANOP                                                     @L2A  02060000
.PL8CHK  ANOP                                                     @L2A  02070000
         AIF   ('&SYSPLIST8' EQ 'YES').PL8YES                     @L2A  02080000
         AIF   ('&PLIST4' EQ '' AND '&PLIST8' EQ '').ENDPL8CHK    @L2A  02090000
.*                                                                @L2A  02100000
.PL8NO   ANOP                                                     @L2A  02110000
         NI    &OFFFLG.(1),X'EF'  TURN OFF PLIST8 BIT                   02120000
         AGO   .ENDPL8CHK                                         @L2A  02130000
.*                                                                @L2A  02140000
.PL8YES  ANOP                                                     @L2A  02150000
         OI    &OFFFLG.(1),X'10'  TURN ON PLIST8 BIT                    02160000
.*                                                                @L2A  02170000
.ENDPL8CHK ANOP                                                   @L2A  02180000
.AM64OKCHK ANOP                                                   @03A  02190000
         AIF   ('&SYSAMODE64OK' EQ 'YES').AM64OKYES               @03A  02200000
.* WE'RE STUCK HERE. WE COULD TURN OFF THE BIT, BUT THEN ANYONE         02210000
.* INVOKING LISTX WILL GET THIS EXTRA "NI". RATHER THAN THAT,           02220000
.* WE SIMPLY LEAVE THE BIT ALONE UNLESS "NO" IS EXPLICITLY              02230000
.* SPECIFIED.                                                           02240000
         AIF   ('&SYSAMODE64OK' EQ '').ENDAM64OKCHK               @03A  02250000
.*                                                                @03A  02260000
.AM64OKNO ANOP                                                    @03A  02270000
         NI    &OFFFLG.(1),X'F7'  TURN OFF AMODE64OK BIT                02280000
         AGO   .ENDAM64OKCHK                                      @03A  02290000
.*                                                                @03A  02300000
.AM64OKYES ANOP                                                   @03A  02310000
         OI    &OFFFLG.(1),X'08'  TURN ON AMODE64OK BIT                 02320000
.*                                                                @03A  02330000
.ENDAM64OKCHK ANOP                                                @03A  02340000
         AGO   .END                                           @G381P2A  02350000
.********************************************************************** 02360000
.*                                                                    * 02370000
.*  PROCESS SF=L FORM                                                 * 02380000
.*                                                                    * 02390000
.********************************************************************** 02400000
.LROUT   CNOP  0,4                                            @G381P2A  02410000
         AIF   (NOT &B(1)).CKEPLOC                            @G381P2A  02420000
&NAME    DC    AL4(&EPNAME)       ADDRESS OF EP PARAMETER     @G381P2A  02430000
         AGO   .CHKDCB                                        @G381P2A  02440000
.CKEPLOC AIF   (&B(2)+&B(3) EQ 0).PUTZERO                     @G381P2A  02450000
         AIF   ('&EPLOC&DE'(1,1) EQ '(').E3                   @G381P2A  02460000
&NAME    DC    AL4(&EPLOC&DE)     EPLOC OR DE PARAMETER       @G381P2A  02470000
         AGO   .CHKDCB                                        @G381P2A  02480000
.PUTZERO ANOP                                                 @G381P2A  02490000
&NAME    DC    A(0)               ADDRESS OF EP OR DE PARAMETER         02500000
.*                                                            @G381P2A  02510000
.CHKDCB  AIF   ('&DCB' EQ '').ZERODCB                         @G381P2A  02520000
         AIF   ('&DCB'(1,1) EQ '(').E3                        @G381P2A  02530000
&DCBVAL  SETC  '&DCB'                                         @G381P2A  02540000
         AGO   .CHKERR                                        @G381P2A  02550000
.ZERODCB ANOP                                                 @G381P2A  02560000
&DCBVAL  SETC  '0'                                            @G381P2A  02570000
.CHKERR  AIF   ('&ERRET' EQ '').ZEROERR                       @G381P2A  02580000
         AIF   ('&ERRET'(1,1) EQ '(').E3                      @G381P2A  02590000
&ERRVAL  SETC  '&ERRET'                                       @G381P2A  02600000
         AGO   .DOLIST                                        @G381P2A  02610000
.ZEROERR ANOP                                                 @G381P2A  02620000
&ERRVAL  SETC  '0'                                            @G381P2A  02630000
.DOLIST  ANOP                                                 @G381P2A  02640000
         DC    AL4(&DCBVAL)       DCB ADDRESS PARAMETER       @G381P2A  02650000
         DC    AL1(1)             PARAMETER LIST FORMAT NUMBER    @L1C  02660000
         DC    AL1(0)             RESERVED                    @G381P2A  02670000
         DC    B'&B(3)&B(6)&B(4)&B(7)&B(8)&B(9)&B(12)&B(13)' OPTIONS    02680000
.*                                                            @G860P35  02690000
         DC    AL1(0)             RESERVED                    @G381P2A  02700000
.ERRCK   ANOP                                                 @G381P2A  02710000
         AIF   ('&ERRET' EQ '').PASSERR                       @G381P2A  02720000
         DC    A(&ERRVAL)         RETURN ADDRESS PARAMETER    @G381P2A  02730000
         DC    A(0)               PROBLEM PROGRAM PARAMETERS ADDRESS    02740000
.*                                                            @G381P2A  02750000
         AGO   .CHKEP                                         @G381P2A  02760000
.PASSERR ANOP                                                 @G381P2A  02770000
         DC    A(0)               RETURN ADDRESS PARAMETER    @G381P2A  02780000
         DC    A(0)               PROBLEM PROGRAM PARAMETERS ADDRESS    02790000
.*                                                            @G381P2A  02800000
.CHKEP   ANOP                                                     @L1A  02810000
         DC    A(0)               ALET FOR EP/EPLOC/DE            @L1A  02820000
         DC    A(0)               ALET FOR DCB                    @L1A  02830000
         DC    A(0)               ALET FOR LINK/XCTL PLIST        @L1A  02840000
         AIF   (NOT &B(1)).END                                    @L1C  02850000
&EPNAME  DC    CL8'&EP'           EP PARAMETER                @G381P2A  02860000
         AGO   .END                                           @G381P2A  02870000
.********************************************************************** 02880000
.*                                                                    * 02890000
.*  PROCESS SF=I FORM                                                 * 02900000
.*                                                                    * 02910000
.********************************************************************** 02920000
.IROUT   AIF   (&B(1)+&B(2)+&B(3) NE 1).E4                    @G381P2A  02930000
.*         CALCULATE LENGTH PARM LIST +4 FOR BRANCH AROUND              02940000
&PNAME   SETC  'P&SYSNDX.'                                        @L1A  02950000
.*              REMOVE LABEL ON PREVIOUS CNOP - CAUSES DUP LABELS @02A  02960000
         AIF   (&SYSALVL GT 0).ALVL1A                                   02970000
         CNOP  0,4                                       @ZA64577 @P1M  02980000
         AIF   ('&PARAM' EQ '' AND '&MF(1)' NE 'E').LOAD   CONSTRUCT    02990000
.*                                   BRANCH                   @ZMB0095  03000000
         AIF   ('&SYSPLIST8' NE 'YES').TRYARC                     @L2A  03010000
         AIF   (&SYSALVL LT 2).XCST3                              @L2A  03020000
         STG   1,&PNAME+16        STORE 64-BIT PLIST ADDRESSS     @L2A  03030000
         AGO   .LOAD                                              @L2A  03040000
.XCST3   ANOP                                                     @L2A  03050000
         XC    &PNAME+16(4),&PNAME+16                             @L2A  03060000
         ST    1,&PNAME+20        STORE PLIST ADDRESSS            @L2A  03070000
         AGO   .LOAD                                              @L2A  03080000
.TRYARC  ANOP                                                     @L2A  03090000
         ST    1,&PNAME+16        STORE PROGRAM PARM LIST ADDR @L1C     03100000
         AIF   ('&SYSASCE' EQ 'P').LOAD                           @L1A  03110000
         STAM  1,1,&PNAME+28      STORE PROGRAM PARM LIST ALET    @L1A  03120000
.*                                                            @G381P2A  03130000
.LOAD    ANOP                                                 @G381P2A  03140000
         &LA   1,&PNAME           PICK UP ADDR OF PARM LIST       @L1C  03150000
         B     &PNAME.E           BRANCH AROUND CONSTANTS         @L2C  03160000
         AGO   .ALVL1B                                                  03170000
.ALVL1A  ANOP                                                           03180000
         AIF   ('&PARAM' EQ '' AND '&MF(1)' NE 'E').LOAD1  CONSTRUCT    03190000
.*                                   BRANCH                   @ZMB0095  03200000
         AIF   ('&SYSPLIST8' NE 'YES').TRYARC1                    @L2A  03210000
         AIF   (&SYSALVL LT 2).XCST31                             @L2A  03220000
         LGR   15,1               SAVE 64-BIT PLIST ADDRESSS      @L2A  03230000
         AGO   .LOAD1                                             @L2A  03240000
.XCST31  ANOP                                                     @L2A  03250000
         LR    15,1               SAVE PLIST ADDRESS              @L2A  03260000
         AGO   .LOAD1                                             @L2A  03270000
.TRYARC1 ANOP                                                     @L2A  03280000
         LR    15,1               SAVE PLIST ADDRESS              @L2A  03290000
         AIF   ('&SYSASCE' EQ 'P').LOAD1                          @L1A  03300000
         CPYA  15,1               SAVE PLIST ALET                 @L1A  03310000
.LOAD1   ANOP                                                 @G381P2A  03320000
         AIF   ('&LA' EQ 'LA').ALVL1C                                   03330000
         LAE   1,0                               CLEAR AR 1             03340000
.ALVL1C  ANOP                                                           03350000
         AIF   ('&SYSPLIST8' NE 'YES').NOT8A                      @P1A  03360000
         CNOP  4,8                PLIST IS DWORD-ALIGNED, SO WE        *03370000
                                  MUST ACCOMMODATE THAT                 03380000
         AGO   .NOT8A1                                            @P1A  03390000
.NOT8A   ANOP                                                     @P1A  03400000
         CNOP  0,4                                       @ZA64577 @P1A  03410000
.NOT8A1  ANOP                                                     @P1A  03420000
         BRAS  1,&PNAME.E                        LIST ADDRESS           03430000
.ALVL1B  ANOP                                                           03440000
         AIF   ('&SYSPLIST8' NE 'YES').NOT8                       @L2A  03450000
&PNAME   DS    0D                 PARAMETER LIST                  @L1C  03460000
         AGO   .NOT8B                                             @L2A  03470000
.NOT8    ANOP                                                     @L2A  03480000
&PNAME   DS    0F                 PARAMETER LIST                  @L1C  03490000
.NOT8B   ANOP                                                     @L2A  03500000
         AIF   (NOT &B(1)).NOEP                               @G381P2A  03510000
         DC    A(&EPNAME)         EP PARAMETER ADDRESS        @G381P2A  03520000
         AGO   .DCB    PROCESS DCB ADDRESS                    @G381P2A  03530000
.NOEP    AIF   ('&EPLOC&DE'(1,1) EQ '(').ZERODE R-FORM, GEN ZERO ADDR   03540000
.*                                                            @G381P2A  03550000
         DC    AL4(&EPLOC&DE)     EPLOC OR DE PARAMETER       @G381P2A  03560000
         AGO   .DCB    PROCESS DCB ADDRESS                    @G381P2A  03570000
.ZERODE  DC    A(0)               EPLOC OR DE PARAMETER       @G381P2A  03580000
.DCB     ANOP                                                 @G381P2A  03590000
         AIF   ('&DCB' EQ '').ZDCB  NO DCB GENERATE ZERO ADDRESS        03600000
.*                                                            @G381P2A  03610000
         AIF   ('&DCB'(1,1) EQ '(').ZDCB R-FORM DCB GEN ZERO ADDR       03620000
.*                                                            @G381P2A  03630000
         DC    AL4(&DCB)          DCB ADDRESS PARAMETER       @G381P2A  03640000
         AGO   .DCGEN    GENERATE CONSTANTS                   @G381P2A  03650000
.ZDCB    ANOP                                                 @G381P2A  03660000
         DC    AL4(0)             DCB ADDRESS PARAMETER       @G381P2A  03670000
.DCGEN   ANOP                                                 @G381P2A  03680000
         DC    AL1(1)             PARAMETER LIST FORMAT NUMBER    @L1C  03690000
         DC    AL1(0)             RESERVED                    @G381P2A  03700000
         DC    B'&B(3)&B(6)&B(4)&B(7)&B(8)&B(9)&B(12)&B(13)'  OPTIONS   03710000
.*                                                            @G860P35  03720000
         DC    AL1(0)             RESERVED                    @G381P2A  03730000
.ECHECK  ANOP                                                 @G381P2A  03740000
         AIF   ('&ERRET' EQ '').ZERRET NO ERRET GEN ZERO ADDRESS        03750000
.*                                                            @G381P2A  03760000
         AIF   ('&ERRET'(1,1) EQ '(').ZERRET R-FORM GEN ZERO ADDR       03770000
.*                                                            @G381P2A  03780000
         DC    A(&ERRET)          ERROR ADDRESS PARAMETER     @G381P2A  03790000
         DC    A(0)               PROBLEM PROGRAM PARAMETERS ADDRESS    03800000
.*                                                            @G381P2A  03810000
         AGO   .EPCHECK                                       @G381P2A  03820000
.ZERRET  DC    A(0)               ERROR ADDRESS PARAMETER     @G381P2A  03830000
         DC    A(0)               PROBLEM PROGRAM PARAMETERS ADDRESS    03840000
.*                                                            @G381P2A  03850000
.EPCHECK ANOP                                                 @G381P2A  03860000
.*                                                            @G381P2A  03870000
         DC    A(0)               ALET FOR EP/EPLOC/DE            @L1A  03880000
         DC    A(0)               ALET FOR DCB                    @L1A  03890000
         DC    A(0)               ALET FOR LINK/XCTL PLIST        @L1A  03900000
         AIF   (NOT &B(1)).ACTION  PROCESS R-FORMS                      03910000
.*                                                            @G381P2A  03920000
&EPNAME  DC    CL8'&EP'           EP PARAMETER                @G381P2A  03930000
.ACTION  ANOP                                                           03940000
&PNAME.E EQU   *                  PARAMETER LIST END              @L2A  03950000
         AIF   (&SYSALVL LE 0).AL3A                                     03960000
         AIF   ('&PARAM' EQ '' AND '&MF(1)' NE 'E').LOAD2  CONSTRUCT    03970000
.*                                   BRANCH                   @ZMB0095  03980000
         AIF   ('&SYSPLIST8' NE 'YES').TRYARC2                    @L2A  03990000
         AIF   (&SYSALVL LT 2).XCST32                             @L2A  04000000
         STG   15,16(0,1)         STORE 64-BIT PLIST ADDRESSS     @L2A  04010000
         AGO   .LOAD2                                             @L2A  04020000
.XCST32  ANOP                                                     @L2A  04030000
         XC    16(4,1),16(1)                                      @L2A  04040000
         ST    15,20(0,1)         STORE PLIST ADDRESSS            @L2A  04050000
         AGO   .LOAD2                                             @L2A  04060000
.TRYARC2 ANOP                                                     @L2A  04070000
         ST    15,16(0,1)         STORE PROGRAM PARM LIST ADDR @L1C     04080000
         AIF   ('&SYSASCE' EQ 'P').LOAD2                          @L1A  04090000
         STAM  15,15,28(1)        STORE PROGRAM PARM LIST ALET    @04C  04100000
.*                                                            @G381P2A  04110000
.LOAD2   ANOP                                                 @G381P2A  04120000
.AL3A    ANOP                                                           04130000
         AIF   (&B(1)).TESTDCB  EP SPECIFIED, PROCESS DCB R-FORM        04140000
.*                                                            @G381P2A  04150000
         AIF   ('&EPLOC&DE'(1,1) NE '(').TESTDCB  PROCESS DCB R-FORM    04160000
.*                                                            @G381P2A  04170000
         &LA   0,0(0,&EPLOC(1)&DE(1)) PICKUP EPLOC OR DE PARM     @L1C  04180000
         ST    0,0(0,1)               STORE IN SUPV PARM LIST @ZA63079  04190000
         AIF   ('&SYSASCE' EQ 'P').TESTDCB                        @L1A  04200000
         AIF   ('&SYSPLIST8' EQ 'YES').TESTDCB                    @L2A  04210000
         STAM  0,0,20(1)          STORE EP/EPLOC/DE ALET          @L1A  04220000
.TESTDCB ANOP                                                 @G381P2A  04230000
         AIF   ('&DCB' EQ '').ERTEST PROCESS ERRET R-FORM     @G381P2A  04240000
         AIF   ('&DCB'(1,1) NE '(').ERTEST PROCESS ERRET R-FORM         04250000
.*                                                            @G381P2A  04260000
         &LA   0,0(0,&DCB(1))     PICKUP DCB ADDRESS PARM         @L1C  04270000
         ST    0,4(0,1)           STORE DCB ADDRESS IN SUP PARMS        04280000
         AIF   ('&SYSASCE' EQ 'P').ERTEST                         @L1A  04290000
         STAM  0,0,24(1)          STORE DCB ALET                  @L1A  04300000
.*                                                            @ZA63079  04310000
.ERTEST  ANOP                                                 @G381P2A  04320000
         AIF   ('&ERRET' EQ '').ADTEST PROCESS ADDR           @G381P2A  04330000
         AIF   ('&ERRET'(1,1) NE '(').ADTEST PROCESS ADDR     @G381P2A  04340000
         LA    0,0(0,&ERRET(1))   PICKUP ERROR ADDRESS PARM   @ZA63079  04350000
         ST    0,12(0,1)          STORE ERROR ADDRESS PARAMETER         04360000
.*                                                            @ZA63079  04370000
.ADTEST  ANOP                                                 @G381P2A  04380000
.END     MEND                                                 @G381P2A  04390000
