*/*                                                                     00003800
* COPYRIGHT =                                                        *  00007600
*   5650-ZOS                                                         *  00011400
*   COPYRIGHT IBM CORP. 1980,2019                                    *  00015200
*   LICENSED MATERIALS - PROPERTY OF IBM                             *  00019000
*                                                                    *  00022800
* STATUS  = HBB77C0                                                  *  00026600
*                                                                    *  00030400
*01* EXTERNAL CLASSIFICATION: OTHER                                  *  00034200
*01* END OF EXTERNAL CLASSIFICATION:                                 *  00038000
*                                                                    *  00041800
*01* CHANGE ACTIVITY =                                                  00041900
*    $L1=ME18813  HBB7780 100316 PDXB: RELATIVE/IMMEDIATE               00043000
*    $L2=WXXXXXX  HBB77C0 170801 PDXB: RMODE 64                         00044000
**/                                                                     00045600
         MACRO                                                          00050000
&NAME    IHBINNRA  &A,&B,&C,&D,&E                                  LC0A 00100000
.*0000000360                                                       LC0A 00150000
         LCLA  &ASUM                                              19015 00200000
         LCLB  &BIT(2)                                            19015 00250000
.*                                                                1@L1D 00300001
         GBLA  &SYSALVL                                            @L1A 00310000
         GBLC  &SYSRM64                                            @L2A 00311000
.*                                                                1@L1D 00320001
         SYSSTATE TEST                                             @L1A 00360000
         AIF   ('&E' EQ '').NOPT                                  19015 00400000
&BIT(1)  SETB  ('&E' EQ 'REWIND')                                 19015 00450000
&BIT(2)  SETB  ('&E' EQ 'LEAVE')                                  19015 00500000
&ASUM    SETA  &BIT(1)*32+&BIT(2)*48                              19015 00550000
         AIF   ('&A' EQ '(1)' OR '&A'(1,1) EQ '(').LDREG          19015 00600000
         CNOP  0,4                                                19015 00650000
         AIF   (&SYSALVL GT 0).ALVL1_1A                            @L1A 00660000
&NAME    BAL   1,*+8                    BR AROUND LIST            19015 00700000
         AGO   .ALVL1_1B                                           @L1A 00710000
.ALVL1_1A ANOP                                                     @L1A 00720000
&NAME    BRAS  1,*+8                    BR AROUND LIST             @L1A 00721000
.ALVL1_1B ANOP                                                     @L1A 00730000
         DC    AL1(&ASUM)               OPTION BYTE               19015 00750000
         DC    AL3(&A(1))                                         19015 00800000
         L     1,0(1,0)                 LOAD REG 1               YM1995 00850000
         AGO   .END                                               19015 00900000
.LDREG   ANOP                                                     19015 00950000
         AIF   ('&A' EQ '(1)').ORIT                               19015 01000000
         CNOP  0,4                                                19015 01050000
         AIF   (&SYSALVL GT 0).ALVL1_2A                            @L1A 01060000
&NAME    BAL   1,*+8                    BR AROUND LIST            19015 01100000
         DC    AL1(&ASUM)               OPTION BYTE               19015 01150000
         DC    AL3(0)                                             19015 01200000
         L     1,0(1,0)                 LOAD R 1 WITH OPTION BYTEYM1995 01250000
         AGO   .ALVL1_2B                                           @L1A 01260000
.ALVL1_2A ANOP                                                     @L1A 01270000
&NAME    DS    0H                                                  @L1C 01280000
         LHI   1,&ASUM                  GET OPTION BYTE            @L1C 01281000
         SLL   1,24                     ALIGN AT BIT 0             @L1C 01282000
.ALVL1_2B ANOP                                                     @L1A 01290000
         OR    1,&A(1)                  OR IN DCB ADDRESS         19015 01300000
         AGO   .END                                               19015 01350000
.ORIT    ANOP                                                     19015 01400000
         CNOP  0,4                                                19015 01450000
         AIF   (&SYSALVL GT 1).ALVL2_3A                            @L1A 01460000
&NAME    O     1,*+8                    SET OPTION BYTE IN REG 1  19015 01500000
         B     *+8                                                19015 01550000
         DC    AL1(&ASUM)               OPTION BYTE               19015 01600000
         DC    AL3(0)                                             19015 01650000
         AGO   .ALVL2_3B                                           @L1A 01660000
.ALVL2_3A ANOP                                                     @L1A 01670000
&NAME    OILH  1,&ASUM*256              SET OPTION BYTE IN REG 1   @L1A 01671000
.ALVL2_3B ANOP                                                     @L1A 01680000
         AGO   .END                                               19015 01700000
.NOPT    AIF   ('&A' EQ '' OR '&A' EQ '(1)').NAMEIT               19015 01750000
         AIF   ('&A'(1,1) EQ '(').REGA                                  01800000
         AIF   ('&C' NE '').HOH1                                   LC0A 01850000
&NAME    LA    1,&A                              LOAD PARAMETER REG 1   01900000
         AGO   .CHKB                                                    01950000
.REGA    ANOP                                                           02000000
&NAME    LR    1,&A(1)                           LOAD PARAMETER REG 1   02050000
         AGO   .CHKB                                                    02100000
.NAMEIT  AIF   ('&NAME' EQ '').CHKB                                     02150000
&NAME    DS    0H                                                       02200000
.CHKB    AIF   ('&B' EQ '' OR '&B' EQ '(0)').END                        02250000
         AIF   ('&B'(1,1) EQ '(').REGB                                  02300000
         AIF   ('&A' EQ '').GEN                                    LC0A 02350000
         AIF   ('&D' EQ '1').END                                   LC0A 02400000
.GEN     ANOP                                                      LC0A 02450000
         LA    0,&B                              LOAD PARAMETER REG 0   02500000
         AGO   .END                                                     02550000
.HOH1    ANOP                                                      LC0A 02600000
&NAME    DS    0H                                                  @L1A 02610000
         AIF   (&SYSALVL GT 1).ALVL2_4A                            @L1A 02611000
         LA    0,1                                                 @L1A 02620000
         AIF   ('&C' EQ '1').H1                                    LC0A 02650000
         SLL   0,24      LOAD FOR HIARCHY ZERO                     @L1C 02702000
         AGO   .HCHK                                               LC0A 02750000
.H1      ANOP                                                      LC0A 02800000
         SLL   0,25      LOAD FOR HIARCHY ONE                      @L1C 02860000
.HCHK    ANOP                                                      LC0A 02900000
         CNOP  2,4                                                 LCOA 02950000
         LA    1,&A                                                LC0A 03000000
         OR    1,0                                                 LC0A 03050000
         AGO   .ALVL2_4B                                           @L1A 03051000
.ALVL2_4A ANOP                                                     @L1A 03060000
         LA    1,&A                                                @L1A 03061000
         AIF   ('&C' EQ '1').ALVL2_4A_H1                           LC0A 03061100
         OILH  1,X'0100'                                           @L1A 03062000
         AGO   .ALVL2_4B                                           @L1A 03062100
.ALVL2_4A_H1 ANOP                                                  @L1A 03062200
         OILH  1,X'0200'                                           @L1A 03063000
.ALVL2_4B ANOP                                                     @L1A 03070000
         AIF   ('&D' NE '1').CHKB                                  @L1C 03100000
         AIF   (&SYSALVL GT 0).ALVL1_5A                            @L1A 03110000
         LA    0,*+8                                               LC0A 03150000
         B     *+12                                                @L1C 03200000
         DC    CL8'&B'                                             LC0A 03250000
         AGO   .ALVL1_5B                                           @L1A 03251000
.ALVL1_5A ANOP                                                     @L1A 03252000
         LA    0,=CL8'&B'                                          @L1C 03252100
.ALVL1_5B ANOP                                                     @L1A 03253000
         AGO   .CHKB                                               @L1C 03300000
.*                                                               10@L1D 03500001
.REGB    ANOP                                                      @L2C 03850000
         AIF   ('&SYSRM64' EQ 'YES').RM64                          @L2A 03852000
         LR    0,&B(1)                           LOAD PARAMETER REG 0   03860000
         AGO   .END_RM                                             @L2A 03870000
.RM64    ANOP                                                      @L2A 03880000
         LGR   0,&B(1)                           LOAD PARAMETER REG 0   03881000
.END_RM  ANOP                                                      @L2A 03890000
.END     MEND                                                           03900000
