*/* COPYRIGHT =                                                      */ 00033300
*/*            5694-A01                                              */ 00066600
*/*            THIS MODULE IS "RESTRICTED MATERIALS OF IBM"          */ 00100000
*/*            (C) COPYRIGHT IBM CORP. 1988, 2004                    */ 00150000
*/*            LICENSED MATERIALS - PROPERTY OF IBM                  */ 00200000
*/*                                                                  */ 00350000
*/* STATUS  = HBB7709                                                */ 00370000
*/*                                                                  */ 00390000
*/*01* EXTERNAL CLASSIFICATION: OTHER                                */ 00410000
*/*01* END OF EXTERNAL CLASSIFICATION:                               */ 00430000
*/*                                                                  */ 00450000
*/* CHANGE ACTIVITY =                                                */ 00500000
*/*   $L1 =    AR    HBB3310 850901 PDXB: AR SUPPORT                 */ 00550000
*/*   $P1 = PJK1310  HBB7709 031204 PDXB: OPTIMIZE                   */ 00575000
         MACRO                                                          00600000
         IHBSETR  &ADDRESS,&REG                                         00650000
         LCLC  &LA                      "LA" OR "LAE" VIA SYSSTATE @L1A 00687500
         GBLC  &SYSASCE                                            @L1A 00725000
         SYSSTATE TEST                  TEST ASC ENVIRONMENT       @L1A 00762500
&LA      SETC  'LA'                     MUST USE LA INSTRUCTION    @L1A 00800000
         AIF   ('&SYSASCE' EQ 'P').NOLAE                           @L1A 00850000
&LA      SETC  'LAE'                    MUST USE LAE               @L1A 00900000
.NOLAE   ANOP                                                      @L1A 01000000
         AIF   ('&ADDRESS'(1,1) EQ '(').REG  IS ADDRESS A REGISTER      01050000
         &LA   &REG,&ADDRESS                 ADDR OF PARAM IN REG  @L1C 01100000
         AGO   .DONE                         DONE, GO RETURN TO CALLER  01150000
.REG     ANOP                                REGISTER ADDRESS           01200000
         AIF   ('(&REG)' EQ '&ADDRESS').DONE   SKIP IF EQUAL       @P1A 01225000
         &LA   &REG,0(0,&ADDRESS)     ADDR IN SPECIFIED REGISTER   @L1C 01250000
.DONE    MEXIT                                                          01300000
         MEND                                                           01350000
