*  %GOTO PLAS_IKJADFMT;                                                 00050000
         MACRO                                                          00100000
         IKJADFMT &ADMAXCNT=1                                           00150000
.* A 0-999999                                                   E21D2JC 00200000
*/***START OF SPECIFICATIONS******************************************/ 00250000
*/*                                                                  */ 00300000
*/*  MACRO-NAME = IKJADFMT                                           */ 00350000
*/*                                                                  */ 00400000
*/*  DESCRIPTIVE-NAME = Mapping for the IKJADTAB parameter list      */ 00450000
*/*                                                                  */ 00500000
*/**01* PROPRIETARY STATEMENT=                                       */ 00550000
*/***PROPRIETARY_STATEMENT********************************************/ 00600000
*/*                                                                  */ 00650000
*/*                                                                  */ 00700000
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00750000
*/* 5650-ZOS COPYRIGHT IBM CORP. 1988, 2015                          */ 00800000
*/*                                                                  */ 00850000
*/* STATUS= HTE77A0                                                  */ 00900000
*/*                                                                  */ 00950000
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 01000000
*/*                                                                  */ 01050000
*/*01* EXTERNAL CLASSIFICATION: PI                                   */ 01100000
*/*01* END OF EXTERNAL CLASSIFICATION:                               */ 01150000
*/*                                                                  */ 01300000
*/*01* Macro Name: IKJADFMT                                          */ 01310000
*/*                                                                  */ 01311000
*/*01* Descriptive Name: Mapping for the IKJADTAB Parameter List     */ 01312000
*/*                                                                  */ 01313000
*/*01* DSECT Name: IKJADFMT                                          */ 01314000
*/*                                                                  */ 01315000
*/*01* Component:  TSO/E Scheduler (28502)                           */ 01316000
*/*                                                                  */ 01317000
*/*01* Eye-Catcher: None                                             */ 01318000
*/*02*  Offset: N/A                                                  */ 01319000
*/*02*  Length: N/A                                                  */ 01319100
*/*                                                                  */ 01319200
*/*01* Storage Attributes:                                           */ 01319300
*/*02*  Subpool: 0                                                   */ 01319400
*/*02*  Key: 8                                                       */ 01319500
*/*02*  Residency:                                                   */ 01319600
*/*02*  Main Storage:                                                */ 01319700
*/*02*  Auxiliary Storage:                                           */ 01320000
*/*02*  Virtual Storage:                                             */ 01330000
*/*                                                                  */ 01340000
*/*01* Size: Variable                                                */ 01341000
*/*                                                                  */ 01342000
*/*01* Created by: Caller of IKJADTAB                                */ 01343000
*/*                                                                  */ 01344000
*/*01* Pointed to by: Register 1 on entry to IKJADTAB                */ 01345000
*/*                                                                  */ 01346000
*/*01* Serialization: None                                           */ 01347000
*/*                                                                  */ 01347100
*/*01* Function: IKJADFMT is the mapping macro for the standard      */ 01348000
*/*              parameter list passed to IKJADTAB via Register 1.   */ 01349000
*/*                                                                  */ 01349100
*/*01* Method of Access:                                             */ 01349200
*/*02*  ASM:  USING on DSECT IKJADFMT ADMAXCNT=XX                    */ 01349300
*/*                                                                  */ 01349400
*/*                          ADMAXCNT=NUMBER specified the number    */ 01349500
*/*                          of elements required for the array.     */ 01349600
*/*                          ADMAXCNT=1 is the default.              */ 01349700
*/*                                                                  */ 01349800
*/*02*  PL/X: %ADMAX_COUNT='N' - - - TO GET ARRAY WITH N             */ 01350000
*/*                                   ELEMENTS - DEFAULTS TO         */ 01350100
*/*                                   1 ELEMENT                      */ 01350200
*/*           %INCLUDE SYSLIB(IKJADFMT)                              */ 01350300
*/*                                                                  */ 01350400
*/*                                                                  */ 01351000
*/*                                                                  */ 01360000
*/*             Register 1                                           */ 01500000
*/*             .--------.    .---------.    .--------.              */ 01550000
*/*             !        !--->!FUNCTION@!--->!FUNCTION!              */ 01600000
*/*             '--------'    !---------!    !--------!              */ 01650000
*/*                           !LIKE@    !--->!LIKE    !              */ 01700000
*/*                           !---------!    !--------!              */ 01750000
*/*                           !COUNT@   !--->!COUNT   !              */ 01800000
*/*                           !---------!    !--------'...---.       */ 01850000
*/*                           !ARRAY@   !--->!ARRAY ELEMENTS !       */ 01900000
*/*                           !---------!    !---------...---'       */ 01950000
*/*                           !ECTADDR@ !--->!ECTADDR !      @YA28059*/ 02000000
*/*                           !---------!    !---------      @YA28059*/ 02050000
*/*                           !ABEND@   !--->!ABEND   !      @YA28059*/ 02100000
*/*                           !---------!    !---------      @YA28059*/ 02150000
*/*                           !REASON@  !--->!REASON  !      @YA28059*/ 02200000
*/*                           '---------'    '--------'      @YA28059*/ 02250000
*/*                                                                  */ 02300000
*/*  MACRO-TYPE = Mapping macro                                      */ 02350000
*/*                                                                  */ 02400000
*/*  NOTES = None                                                    */ 02450000
*/*                                                                  */ 02500000
*/*  PROCESSOR = BAL                                                 */ 02550000
*/*                                                                  */ 02600000
*/*  MACRO-SIZE = See listing                                        */ 02650000
*/*                                                                  */ 02700000
*/*  INVOCATION = MACRO SPECIFICATION IS:                            */ 02750000
*/*                                                                  */ 02800000
*/*             IKJADFMT ADMAXCNT=XX                                 */ 02850000
*/*                                                                  */ 02900000
*/*               ADMAXCNT=NUMBER specified the number               */ 02950000
*/*               of elements required for the array.                */ 03000000
*/*               ADMAXCNT=1 is the default.                         */ 03050000
*/*                                                                  */ 03100000
*/*01* CHANGE-ACTIVITY =                                             */ 03150000
*/*                                                                  */ 03200000
*/*  Created for TSO/E 2.1.0                                 @E21D2JC*/ 03250000
*/*  OY28059 - Added ECT address, ABEND, and REASON          @YA28059*/ 03300000
*/*            parameters.                                   @YA28059*/ 03350000
*/*                                                                  */ 03400000
*/*  OW17712 - Change ASM byte length specifications to      @WA17712*/ 03450000
*/*            bit length specifications where appropriate.  @WA17712*/ 03500000
*/*                                                                  */ 03550000
*/* FLAG REASON   RELEASE DATE     ORIGIN                        @N1A*/ 03600000
*/* ---- ------   ------- -------- ------                        @N1A*/ 03650000
*/* $N1= COPYRITE HTE26D2 19970218 VOHS: Insert/Update Copyright @N1A*/ 03700000
*/*                                                                  */ 03750000
*/***END OF SPECIFICATIONS********************************************/ 03800000
         EJECT                                                          03850000
*/********************************************************************/ 03900000
*/*                                                                  */ 03950000
*/*  IKJADFMT - Parameter List for IKJADTAB                          */ 04000000
*/*                                                                  */ 04050000
*/********************************************************************/ 04100000
         SPACE                                                          04150000
**/                                                                     04200000
               DS 0D                     Align on double-word boundary  04250000
IKJADFMT_PLIST DS CL32                                        @YA28059  04300000
         ORG   IKJADFMT_PLIST                                           04350000
ADTAB_FUNCTION@ DS AL4                   Pointer to FUNCTION data       04400000
ADTAB_LIKE@ DS AL4                       Pointer to LIKE data           04450000
ADTAB_LOADLIB@ DS AL4                    Pointer to LOADLIB data        04500000
ADTAB_COUNT@ DS AL4                      Pointer to COUNT data          04550000
ADTAB_ARRAY@ DS AL4                      Pointer to ARRAY data          04600000
             ORG ADTAB_ARRAY@                                @YA28059   04650000
ADTAB_ARRAY@_HIBIT DS BL.1               End of list         @WA17712   04700000
                   DS 0F                 Reach next fullword @YA28059   04750000
ADTAB_ECTADDR@     DS AL4                Pointer to ECTADDR  @YA28059   04800000
*                                        data                @YA28059   04850000
             ORG ADTAB_ECTADDR@                              @YA28059   04900000
ADTAB_ECTADDR@_HIBIT DS BL.1             End of list         @WA17712   04950000
                   DS 0F                 Reach next fullword @YA28059   05000000
ADTAB_ABEND@       DS AL4                Pointer to ABEND    @YA28059   05050000
*                                        data                @YA28059   05100000
             ORG ADTAB_ABEND@                                @YA28059   05150000
ADTAB_ABEND@_HIBIT DS BL.1               End of list         @WA17712   05200000
                   DS 0F                 Reach next fullword @YA28059   05250000
ADTAB_REASON@      DS AL4                Pointer to REASON   @YA28059   05300000
*                                        data                @YA28059   05350000
             ORG ADTAB_REASON@                               @YA28059   05400000
ADTAB_REASON@_HIBIT DS BL.1              End of list         @WA17712   05450000
**/                                                                     05500000
               DS 0D                     Align on double-word boundary  05550000
&NUMBYTE SETA  (&ADMAXCNT*4)+32                              @YA28059   05600000
IKJADFMT DS    CL&NUMBYTE                                               05650000
         ORG   IKJADFMT                                                 05700000
ADTAB_FUNCTION DS CL8                    Function to be performed:      05750000
*                                            "NEWTABLE"                 05800000
*                                            "ENDTABLE"                 05850000
*                                            "ADD_LOAD"                 05900000
ADTAB_LIKE DS  AL4                       Anchor of a table to copy      05950000
*                                          when the function is         06000000
*                                          "NEWTABLE"                   06050000
ADTAB_LOADLIB DS AL4                     DCB address of an alternative  06100000
*                                          load module library when     06150000
*                                          the function is "ADD_LOAD"   06200000
ADTAB_COUNT DS FL4                       Number of tables to            06250000
*                                          be freed when the            06300000
*                                          function is "ENDTABLE"       06350000
ADTAB_ARRAY DS &ADMAXCNT.A(0)                                           06400000
*                                        Array of tokens,               06450000
*                                          one for each table to be     06500000
*                                          freed                        06550000
ADTAB_ECTADDR DS AL4                     ECT address data    @YA28059   06600000
ADTAB_ABEND   DS BL.32                   Internal error abend code      06650000
*                                         returned to caller @WA17712   06700000
ADTAB_REASON  DS BL.32                   Internal error reason code     06750000
*                                         returned to caller @WA17712   06800000
**/                                                                     06850000
         MEND                                                           06900000
  %PLAS_IKJADFMT: ;                                                     06950000
 /***START OF SPECIFICATIONS******************************************/ 07000000
 /*                                                                  */ 07050000
 /*  MACRO-NAME = IKJADFMT                                           */ 07100000
 /*                                                                  */ 07150000
 /*  DESCRIPTIVE-NAME = Mapping for the IKJADTAB parameter list      */ 07200000
 /*                                                                  */ 07250000
 /*                                                                  */ 07300000
 /*  FUNCTION = IKJADFMT is the mapping macro for the standard       */ 07350000
 /*             parameter list passed to IKJADTAB via register 1.    */ 07400000
 /*                                                                  */ 07450000
 /*             Register 1                                           */ 07500000
 /*             .--------.    .---------.    .--------.              */ 07550000
 /*             !        !--->!FUNCTION@!--->!FUNCTION!              */ 07600000
 /*             '--------'    !---------!    !--------!              */ 07650000
 /*                           !LIKE@    !--->!LIKE    !              */ 07700000
 /*                           !---------!    !--------!              */ 07750000
 /*                           !COUNT@   !--->!COUNT   !              */ 07800000
 /*                           !---------!    !--------'...---.       */ 07850000
 /*                           !ARRAY@   !--->!ARRAY ELEMENTS !       */ 07900000
 /*                           !---------!    !---------...---'       */ 07950000
 /*                           !ECTADDR@ !--->!ECTADDR !      @YA28059*/ 08000000
 /*                           !---------!    !---------      @YA28059*/ 08050000
 /*                           !ABEND@   !--->!ABEND   !      @YA28059*/ 08100000
 /*                           !---------!    !---------      @YA28059*/ 08150000
 /*                           !REASON@  !--->!REASON  !      @YA28059*/ 08200000
 /*                           '---------'    '--------'      @YA28059*/ 08250000
 /*                                                                  */ 08300000
 /*  MACRO-TYPE = Mapping macro                                      */ 08350000
 /*                                                                  */ 08400000
 /*  NOTES = None                                                    */ 08450000
 /*                                                                  */ 08500000
 /*  PROCESSOR = PL/AS                                               */ 08550000
 /*                                                                  */ 08600000
 /*  MACRO-SIZE = See listing                                        */ 08650000
 /*                                                                  */ 08700000
 /*  INVOCATION =                                                    */ 08750000
 /*               %ADMAX_COUNT='N' - - - TO GET ARRAY WITH N         */ 08800000
 /*                                       ELEMENTS - DEFAULTS TO     */ 08850000
 /*                                       1 ELEMENT                  */ 08900000
 /*               %INCLUDE SYSLIB(IKJADFMT)                          */ 08950000
 /*                                                                  */ 09000000
 /*                                                                  */ 09050000
 /*  CHANGE-ACTIVITY =                                               */ 09100000
 /*                                                                  */ 09150000
 /*  Created for TSO/E 2.1.0                                 @E21D2JC*/ 09200000
 /*  OY28059 - Added ECT address, ABEND, and REASON          @YA28059*/ 09250000
 /*            parameters.                                   @YA28059*/ 09300000
 /*                                                                  */ 09350000
 /***END OF SPECIFICATIONS********************************************/ 09400000
 @EJECT;                                                                09450000
 /********************************************************************/ 09500000
 /*                                                                  */ 09550000
 /*  IKJADFMT - Paramter List for IKJADTAB                           */ 09600000
 /*                                                                  */ 09650000
 /********************************************************************/ 09700000
 @SPACE;                                                                09750000
 DECLARE                                                                09800000
  1 IKJADFMT_PLIST         BDY(DWORD),                                  09850000
    2 ADTAB_FUNCTION@      PTR(31),   /* Pointer to FUNCTION data    */ 09900000
    2 ADTAB_LIKE@          PTR(31),   /* Pointer to LIKE data        */ 09950000
    2 ADTAB_LOADLIB@       PTR(31),   /* Pointer to LOADLIB data     */ 10000000
    2 ADTAB_COUNT@         PTR(31),   /* Pointer to COUNT data       */ 10050000
    2 ADTAB_ARRAY@         PTR(31),   /* Pointer to ARRAY data       */ 10100000
      3 ADTAB_ARRAY@_HIBIT BIT(1),    /* End of list         @YA28059*/ 10150000
    2 ADTAB_ECTADDR@       PTR(31),   /* Pointer to ECTADDR             10200000
                                         data                @YA28059*/ 10250000
      3 ADTAB_ECTADDR@_HIBIT BIT(1),  /* End of list         @YA28059*/ 10300000
    2 ADTAB_ABEND@         PTR(31),   /* Pointer to ABEND               10350000
                                         data                @YA28059*/ 10400000
      3 ADTAB_ABEND@_HIBIT BIT(1),    /* End of list         @YA28059*/ 10450000
    2 ADTAB_REASON@        PTR(31),   /* Pointer to REASON              10500000
                                         data                @YA28059*/ 10550000
      3 ADTAB_REASON@_HIBIT BIT(1);   /* End of list         @YA28059*/ 10600000
 @SPACE;                                                                10650000
 DECLARE                                                                10700000
  1 IKJADFMT               BDY(DWORD),                                  10750000
    2 ADTAB_FUNCTION       CHAR(8),   /* Function to be performed:   */ 10800000
                                      /*     "NEWTABLE"              */ 10850000
                                      /*     "ENDTABLE"              */ 10900000
                                      /*     "ADD_LOAD"              */ 10950000
    2 ADTAB_LIKE           PTR(31),   /* Anchor or a table to copy      11000000
                                           when the function is         11050000
                                           "NEWTABLE"                */ 11100000
    2 ADTAB_LOADLIB        PTR(31),   /* DCB address of an              11150000
                                           alternative load module      11200000
                                           library when the function    11250000
                                           is "ADD_LOAD"             */ 11300000
    2 ADTAB_COUNT          FIXED(32),                                   11350000
                                      /* Number of tables to            11400000
                                           be freed when the            11450000
                                           function is "ENDTABLE"    */ 11500000
*%IF ADMAX_COUNT='' %THEN             /* Default maximum is one      */ 11550000
*%GOTO ADSKIP1;                       /* Use the default             */ 11600000
    2 ADTAB_ARRAY(ADMAX_COUNT)        /* Maximum specified - use it  */ 11650000
*%GOTO ADSKIP2;                       /* Skip around the default     */ 11700000
*%ADSKIP1:;                                                             11750000
    2 ADTAB_ARRAY(1)                  /* Default array size is one   */ 11800000
*%ADSKIP2:;                                                             11850000
                           BDY(WORD)                                    11900000
                           PTR(31),   /* Array of tokens,               11950000
                                           one for each table to be     12000000
                                           freed                     */ 12050000
    2 ADTAB_ECTADDR        PTR(31),   /* Address of current             12100000
                                           ECT.              @YA28059*/ 12150000
    2 ADTAB_ABEND          BIT(32),   /* Internal error abend code      12200000
                                           returned to                  12250000
                                           caller.           @YA28059*/ 12300000
    2 ADTAB_REASON         BIT(32);   /* Internal error abend code      12350000
                                           returned to                  12400000
                                           caller.           @YA28059*/ 12450000
