* %GOTO PROSTMNT;       /*                                              00050000
       MACRO                                                            00100000
       IKJCAFPL                                                         00150000
.*/ %PROSTMNT: ;                                                        00200000
*/*** START OF SPECIFICATIONS ****************************************/ 00210001
*/*01* PROPRIETARY STATEMENT=                                        */ 00220002
*/***PROPRIETARY_STATEMENT********************************************/ 00250000
*/*                                                                  */ 00350000
*/*                                                                  */ 00400000
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00450000
*/* 5650-ZOS COPYRIGHT IBM CORP. 1986, 2015                          */ 00550002
*/*                                                                  */ 00650000
*/* STATUS= HTE77A0                                                  */ 00700002
*/*                                                                  */ 00750000
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 00800000
*  %GOTO CAFPRO;                                                        00850000
*/********************************************************************/ 00860000
*/*                                                                  */ 00950000
*/*01* EXTERNAL CLASSIFICATION: PI                                   */ 00960004
*/*01* END OF EXTERNAL CLASSIFICATION:                               */ 00970002
*/*                                                                  */ 00980002
*/*01* MACRO NAME: IKJCAFPL                                          */ 01000002
*/*                                                                  */ 01050000
*/*01* DESCRIPTIVE NAME: Parameter list for the CLIST Attention      */ 01100002
*/*                      Facility                                    */ 01150002
*/*                                                                  */ 01200000
*/*01* DSECT NAME: CAFMAP                                            */ 01250002
*/*                                                                  */ 01260002
*/*01* COMPONENT:  TSO/E Scheduler (28502)                           */ 01270002
*/*                                                                  */ 01271002
*/*01* EYE-CATCHER: CAF                                              */ 01272002
*/*02*  OFFSET: 0                                                    */ 01273002
*/*02*  LENGTH: 4                                                    */ 01274002
*/*                                                                  */ 01275002
*/*01* STORAGE ATTRIBUTES:                                           */ 01276002
*/*02*  SUBPOOL: Must be the subpool used by the invoker of IKJCAF   */ 01277002
*/*02*  KEY: Must be in the same key as the invoker of IKJCAF        */ 01278002
*/*02*  RESIDENCY:                                                   */ 01279002
*/*02*  MAIN STORAGE:                                                */ 01280002
*/*02*  AUXILIARY STORAGE:                                           */ 01290002
*/*02*  VIRTUAL STORAGE:                                             */ 01291002
*/*                                                                  */ 01292002
*/*01* SIZE: 40 bytes                                                */ 01293002
*/*                                                                  */ 01294002
*/*01* CREATED BY: The invoker of IKJCAF                             */ 01295002
*/*                                                                  */ 01296002
*/*01* POINTED TO BY: Register 1                                     */ 01297002
*/*                                                                  */ 01298002
*/*01* SERIALIZATION: None                                           */ 01299002
*/*                                                                  */ 01299102
*/*01* FUNCTION: IKJCAFPL maps the parameters passed to the CLIST    */ 01300002
*/*              Attention Facility IKJCAF.  It also contains the    */ 01350002
*/*              constants used to initialize the acronym and        */ 01400002
*/*              version number.                                     */ 01450002
*/*                                                                  */ 01500000
*/*01* MODULE TYPE:  MAPPING MACRO                                   */ 01550003
*/*                                                                  */ 01600000
*/*01* PROCESSOR:  PL/X                                              */ 01650002
*/*                                                                  */ 01700000
*/*01* SIZE:  40 bytes                                               */ 01750002
*/*                                                                  */ 01800000
*/*01* METHOD OF ACCESS:                                             */ 02050002
*/*02*  ASM: USING on DSECT CAF                                      */ 02100003
*/*                                                                  */ 02110003
*/*02*  PL/X: %INCLUDE SYSLIB(IKJCAFPL)                              */ 02150003
*/*                                                                  */ 02200000
*/* CHANGE ACTIVITIES = NONE                                         */ 02250000
*/*                                                                  */ 02300000
*/*** END OF SPECIFICATIONS ******************************************/ 02400001
*/*A00000000-99999999                                        @E2367H1*/ 02450000
*/*                                                                     02500000
CAF       DSECT                                                         02550000
          DS  0D                                                        02600000
CAFCAF    DS  CL4            IDENTIFIER 'CAF '                          02650000
CAFCAFC   EQU C'CAF '        CAF ACRONYM CONSTANT                       02700000
CAFLEV    DS  XL1            CAF VERSION NUMBER                         02750000
CAFLEVN   EQU X'01'          CAF VERSION NUMBER CONSTANT                02800000
CAFRES01  DS  XL1            RESERVED                                   02850000
CAFRES02  DS  XL1            RESERVED                                   02900000
CAFRES03  DS  XL1            RESERVED                                   02950000
CAFPARM   EQU *              USED TO CLEAR OUT PARAMETER LIST           03000000
CAFTAIE   DS  F              POINTER TO THE TAIE                        03050000
CAFIOPL   DS  F              POINTER TO IOPL                            03100000
CAFPGPB   DS  F              POINTER TO PUTGET PARM BLOCK               03150000
CAFSTPB   DS  F              POINTER TO STACK PARM BLOCK                03200000
CAFABEND  DS  CL4            ABEND CODE IF CAF FAILS                    03250000
CAFRSNCD  DS  F              REASON CODE IF CAF FAILS                   03300000
CAFRES04  DS  F              RESERVED                                   03350000
CAFRES05  DS  F              RESERVED                                   03400000
CAFEND    DS  0D             END IKJCAFPL ON A DOUBLE WORD BOUNDRY      03450000
CAFPLEN   EQU *-CAFPARM      LENGTH OF CLIST ATTENTION FACILITY PARMS   03500000
          MEND                                                          03550000
.*/ %CAFPRO: ;                                                          03600000
*/********************************************************************/ 03650000
*/*                                                                  */ 03700000
*/* MODULE NAME = IKJCAFPL                                           */ 03750000
*/*                                                                  */ 03800000
*/* DESCRIPTIVE NAME = PARAMETER LIST FOR THE CLIST ATTENTION        */ 03850000
*/*                    FACILITY.                                     */ 03900000
*/*                                                                  */ 03950000
*/*                                                                  */ 04000000
*/* FUNCTION = IKJCAFPL MAPS THE PARAMETERS PASSED TO THE CLIST      */ 04050000
*/*            ATTENTION FACILITY IKJCAF.  IT ALSO CONTAINS THE      */ 04100000
*/*            THE CONSTANTS USED TO INITIALIZE THE ACRONYM AND      */ 04150000
*/*            VERSION NUMBER.                                       */ 04200000
*/*                                                                  */ 04250000
*/* MODULE TYPE = MAPPING MACRO                                      */ 04300000
*/*                                                                  */ 04350000
*/* PROCESSOR = PL/AS                                                */ 04400000
*/*                                                                  */ 04450000
*/* MODULE-SIZE = 40 BYTES                                           */ 04500000
*/*                                                                  */ 04550000
*/* ATTRIBUTES = STORAGE MUST BE IN THE SAME KEY AS THE INVOKER OF   */ 04600000
*/*                  IKJCAF.                                         */ 04650000
*/*              SUBPOOL IS THE SAME AS THE INVOKER OF IKJCAF.       */ 04700000
*/*                                                                  */ 04750000
*/* INVOCATION =                                                     */ 04800000
*/*                                                                  */ 04850000
*/*   ASSEMBLER - IKJCAFPL                                           */ 04900000
*/*                                                                  */ 04950000
*/*   PL/S   %CAFB = ''      THIS IS THE DEFAULT IF YOU DO NOT       */ 05000000
*/*                          WANT THE MAPPING BASED                  */ 05050000
*/*          %CAFB = 'BASED' IF YOU WANT THE MAPPING BASED           */ 05100000
*/*          %CAFB = 'BASED(ANYPTR)' IF YOU WANT THE MAPPING BASED   */ 05150000
*/*                          ON A POINTER.                           */ 05200000
*/*          %INCLUDE SYSLIB(IKJCAFPL)                               */ 05250000
*/*                                                                  */ 05300000
*/*                                                                  */ 05350000
*/* CHANGE ACTIVITIES = NONE                                         */ 05400000
*/*                                                                  */ 05450000
*/*                                                                  */ 05500000
*/********************************************************************/ 05550000
*/*A00000000-99999999                                        @E2367H1*/ 05600000
* %IF CAFB='' %THEN %CAFB=' ';   /* USER DID NOT WANT MAPPING BASED */  05650000
*DCL 1 CAFMAP CAFB BDY(DWORD),                                          05700000
*        2 CAFCAF   CHAR(4),      /* IDENTIFIER 'CAF ' - USE CAFCAFC    05750000
*                                    WHEN SETTING THIS VARIABLE      */ 05800000
*        2 CAFLEV   FIXED(8),     /* VERSION NUMBER - USE CAFLEVN WHEN  05850000
*                                    SETTING THIS VARIABLE           */ 05900000
*        2 CAFRES01 BIT(8),       /* RESERVED                        */ 05950000
*        2 CAFRES02 BIT(8),       /* RESERVED                        */ 06000000
*        2 CAFRES03 BIT(8),       /* RESERVED                        */ 06050000
*        2 CAFPARM,               /* USED TO CLEAR OUT PARAMETER LIST*/ 06100000
*           3 CAFTAIE  PTR(31),   /* POINTER TO THE TAIE             */ 06150000
*           3 CAFIOPL  PTR(31),   /* POINTER TO THE IOPL             */ 06200000
*           3 CAFPGPB  PTR(31),   /* POINTER TO PUTGET PARM BLOCK    */ 06250000
*           3 CAFSTPB  PTR(31),   /* POINTER TO STACK PARM BLOCK     */ 06300000
*           3 CAFABEND CHAR(4),   /* ABEND CODE IF IKJCAF FAILS - SAME  06350000
*                                    CONTENTS AS SDWAABCC            */ 06400000
*           3 CAFRSNCD FIXED(31), /* REASON CODE OR ZERO IF IKJCAF      06450000
*                                   FAILS - SAME CONTENTS AS SDWAGR15*/ 06500000
*           3 CAFRES05 FIXED(31), /* RESERVED                        */ 06550000
*           3 CAFRES06 FIXED(31), /* RESERVED                        */ 06600000
*        2 CAFEND CHAR(0) BDY(DWORD); /* ASSURE WORK AREA ENDS ON A     06650000
*                                     DOUBLE WORD BOUNDRY.  ANY         06700000
*                                     ADDITIONS TO WORK AREA SHOULD BE  06750000
*                                     PUT BEFORE CAFEND              */ 06800000
*/*                                                                  */ 06850000
*/*  THE FOLLOWING FIELDS ARE CONSTANTS THAT CAN BE USED TO SET      */ 06900000
*/*  CAFCAF OR CAFLEV                                                */ 06950000
*/*                                                                  */ 07000000
*DCL                                                                    07050000
*CAFCAFC   CHAR(4) CONSTANT('CAF '),/* CAF ACRONYM CONSTANT          */ 07100000
*CAFLEVN   FIXED(8) CONSTANT(1);   /* CAF VERSION NUMBER             */ 07150000
*/*                                                                  */ 07200000
