*        %GOTO ECTPRO ; /*                                              00050000
         MACRO                                                          02000000
         IKJECT                                                         03000000
**/                                                                     03009000
* %ECTPRO : ;                                                           03018000
*/* Start of Specifications ******************************************* 03027000
*                                                                     * 03036000
*01* Descriptive Name: TSO/E Environment Control Table                * 03045001
*02*  Acronym: ECT                                                    * 03054000
*                                                                     * 03063000
*    NOTE: Any changes to this macro which cause new fields to be     * 03072000
*          added will require changes to the TSODATA IPCS exit.       * 03081000
*          Module IKJVELES contains a model of the ECT that will      * 03090000
*          need to be updated to contain the new fields.              * 03099000
*                                                             @ZA96793* 03108000
*                                                                     * 03117000
*01* PROPRIETARY STATEMENT=                                           * 03126000
*****PROPRIETARY_STATEMENT********************************************* 03135000
*                                                                     * 03144000
*                                                                     * 03153000
*   LICENSED MATERIALS - PROPERTY OF IBM                              * 03162000
*   5650-ZOS COPYRIGHT IBM CORP. 1981, 2015                           * 03180000
*                                                                     * 03198000
*   STATUS= HTE77A0                                                   * 03207000
*                                                                     * 03216000
*****END_OF_PROPRIETARY_STATEMENT************************************** 03225000
*                                                                     * 03234000
*01* External Classification: PI                                      * 03235003
*01* End of External Classification:                                  * 03236003
*                                                                     * 03237003
*01* Macro Name: IKJECT                                               * 03243000
*                                                                     * 03252000
*01* DSECT Name: ECT                                                  * 03261000
*                                                                     * 03270000
*01* Component:  TSO/E Scheduler (28502)                              * 03279000
*                                                                     * 03288000
*01* Eye-Catcher: None                                                * 03297000
*02*  Offset: N/A                                                     * 03306000
*02*  Length: N/A                                                     * 03315000
*                                                                     * 03324000
*01* Storage Attributes:                                              * 03333000
*02*  Subpool: 1 or 78                                                * 03342000
*02*  Key: 8                                                          * 03351000
*02*  Residency: Below 16M                                            * 03360000
*02*  Main Storage:                                                   * 03369000
*02*  Auxiliary Storage:                                              * 03378000
*02*  Virtual Storage:                                                * 03387000
*                                                                     * 03396000
*01* Size: 56 bytes                                                   * 03405000
*                                                                     * 03414000
*01* Created by: IKJEFT01                                             * 03423000
*                                                                     * 03432000
*01* Pointed to by: CPPLECT field of the CPPL                         * 03441000
*                   TPLECT field of the TPL                           * 03450000
*                   LWAPECT field of the LWA                          * 03459000
*                                                                     * 03468000
*01* Serialization: Responsibility of the caller                      * 03477000
*                                                                     * 03486000
*01* Function:                                                        * 03495000
*02* This table provides the communication medium for the TMP,        * 03504000
*    command processors and service routines.  It contains the        * 03505000
*    current command/subcommand name, return code, pointers to        * 03506000
*    work areas and message chain, and processing control flags.      * 03507000
*    The Environment Control Table (ECT) is built by the TMP and      * 03509000
*    stored in a non-shared subpool.  Its fields can be modified      * 03513000
*    by a CP or service routine.  The TMP that created the ECT        * 03522000
*    must free it.  For more information, see STACK macro,            * 03531000
*    ENVIRON=CREATE operand.                                          * 03540000
*                                                                     * 03549000
*01* Method of Access:                                                * 03558000
*02*  ASM: USING on DSECT IKJECT                                      * 03567000
*                                                                     * 03576000
*02*  PL/X: %ECTSTORAGE='xxxxxxxx'                                    * 03585002
*           %INCLUDE SYSLIB(IKJECT)                                   * 03594002
*                                                                     * 03603000
*01* Change Activity:                                                 * 03639000
*   OZ92773 - ADD ECTMSGOR FLAG TO CAUSE OVERRIDE OF CLIST NOMSG      * 03648000
*             OPTION WHEN A CLIST IS ON THE STACK BUT THERE IS A      * 03657000
*             READY MESSAGE AT THE TERMINAL.                  @ZA92773* 03666000
*                                                                     * 03675000
*   OZ91237 - REMOVE ARAR OZ74164 WHICH DEFINED ECTPARSA              * 03684000
*             IT IS NOW RESERVED                              @ZA91237* 03693000
*                                                                     * 03702000
*   @OZ96793 - ADD NOTE IN PROLOGUE TO INDICATE THAT ANY      @ZA96793* 03711000
*              NEW FIELDS ADDED TO THE ECT WILL REQUIRE       @ZA96793* 03720000
*              CHANGE TO THE TSODATA IPCS EXIT MODULE         @ZA96793* 03729000
*              IKJVELES WHICH CONTAINS A MODEL OF THE ECT.    @ZA96793* 03738000
*                                                                     * 03747000
*                                                                     * 03756000
*   @E21D2S4 - TSO/E 2.1.0 SUPPORT FOR EXEC PROCESSING        @E21D2S4* 03765000
*   @E21D2C1 - TSO/E 2.1.0 CLIST SUPPORT.                     @E21D2C1* 03774000
*   @PEI0926 - ADD BIT TO DENOTE THAT A REXX EXEC IN THE      @PEI0926* 03783000
*              BACKGROUND HAS EXHAUSTED SYSTSIN BY ISSUING    @PEI0926* 03792000
*              PULLS.                                         @PEI0926* 03801000
*                                                                     * 03810000
*    OY24741 - DEFINE A BIT TO INDICATE THAT IKJCAF HAS BEEN          * 03819000
*              ENTERED IN CASE THE ATTENTION ECB HAS NOT BEEN         * 03828000
*              POSTED.                                        @YA24741* 03837000
*                                                                     * 03846000
*   @E22D2D3 - TSO/E 2.2.0 CONSOLE SUPPORT                    @E22D2D3* 03855000
*                                                                     * 03864000
*    OY49863 - DEFINE A BIT TO INDICATE THAT TEST ISSUED THE          * 03873000
*              PUTGET DURING ATTENTION PROCESSING. GETLINE            * 03882000
*              WILL CHECK THE BIT AND NOT ABEND 66D-42 WHEN           * 03891000
*              THERE IS A TOKEN MISMATCH BECAUSE TEST USES            * 03900000
*              ITS OWN ECT.                                   @YA49863* 03909000
*                                                                     * 03918000
*    PMH0160   Updated prolog for SHOWHDR tool                @PMH0160* 03927000
*                                                                     * 03936000
*    PMH0173   Changed name of PL/AS label from PROLOG to     @PMH0173* 03945000
*              ECTPRO to prevent name clashes.                @PMH0173* 03954000
*                                                                     * 03963000
*** End of Specifications ********************************************/ 03972000
* %GOTO ECTBSL   ; /*                                                   03981000
ECT      DSECT                                                          04000000
         SPACE                                                          10000000
ECTRCDF  DS    X        HIGH ORDER BIT INDICATES CP ABENDED             11000000
ECTRTCD  DS    CL3      RETURN CODE FROM LAST CP                        11050000
*                         (ABEND CODE IF ECTRCDF IS SET)                11100000
ECTIOWA  DS    A        ADDR OF I/O SERVICE ROUTINES WORK AREA          14000000
ECTMSGF  DS    X        HIGH ORDER BIT SET MEANS DELETE SECOND LEVEL    15000000
*                         MESSAGE                                       15050000
ECTSMSG  DS    AL3      ADDR OF SECOND LEVEL MSG CHAIN                  17000000
ECTPCMD  DS    CL8      PRIMARY COMMAND NAME                            18000000
ECTSCMD  DS    CL8      SUBCOMMAND NAME                                 19000000
ECTSWS   DS    X        1 BYTE OF SWITCHES                              19050000
ECTNOPD  EQU   X'80'    0 BIT ON= NO OPERANDS EXIST IN CMD BUFFER       21000000
ECTCAFAT EQU   X'40'    IKJCAF HAS BEEN ENTERED                @YA24741 21050000
ECTATRM  EQU   X'20'    CP TERMINATED BY TMP DETACH W/ STAE             22000000
ECTLOGF  EQU   X'10'    LOGON/OFF REQUESTED TMP TO LOGOFF USER          24000000
ECTNMAL  EQU   X'08'    NO USER MSGS TO RECVED AT LOGON                 25000000
ECTNNOT  EQU   X'04'    NO BRDCST NOTICES TO BE RECVED AT LOGON         26000000
ECTBKGRD EQU   X'02'    BACKGROUND MODE                                 26050000
ECTATTN  EQU   X'01'    ATTENTION MODE FOR CLIST                Z30NQKM 26100000
ECTDDNUM DS    AL3      COUNTER FOR GENERATING TEMP DDNAMES             27000000
ECTUSER  DS    A        WORD RESERVED FOR INSTALLATION  USE             29050000
ECTBKPB  DS    A        ADDR OF BACKGROUND PARAMETER BLOCK              29085100
ECTSWS2  DS    X        EXTENDED FLAG FIELD                             29120200
ECTDEFCS EQU   X'80'    DEFAULT DELETE CHARACTERS USED                  29155300
ECTTABND EQU   X'40'    TEST SUBTASK ABENDED                            29190400
ECTPARSE EQU   X'20'    PARSE ?HELP ALLOWED                    @E1113KS 29225500
ECTPOSIT EQU   X'10'    ECTHELP=POSITIONAL NUMBER              @E1113KS 29260600
ECTKEYWD EQU   X'08'    ECTHELP=PCE ADDRESS OR 0               @E1113KS 29295700
ECTNOQPR EQU   X'04'    ? PROMPT HELP IS DISABLED              @E1113KS 29330800
*        EQU   X'02'    RESERVED                               @ZA91237 29365900
ECTNOPUT EQU   X'01'    TO PREVENT THE PUTLINE                 @E1213F4 29401000
ECTSWS22 DS    X        EXTENDED FLAG FIELD                    @ZA92773 29436100
ECTMSGOR EQU   X'80'    MESSAGE OVERRIDE                       @ZA92773 29471200
ECTRXEOF EQU   X'40'    END OF FILE FOR SYSTSIN BY REXX        @PEI0926 29506300
ECTNPTSO EQU   X'20'    USED TO INDICATE TO TSOEXEC TO INVOKE  @E22D2D3 29541400
*                       TSF WITH THE NON-PARALLEL TMP          @E22D2D3 29576500
*                       PROCESSING OPTION.                     @E22D2D3 29611600
ECTTSTAT EQU   X'10'    TEST IS IN ATTENTION PROCESSING        @YA49863 29646700
         DS    CL(2)    RESERVED                               @ZA92773 29681800
ECTHELP  DS    A        POSITIONALS: POSITIONAL # IN EBCDIC    @E1113KS 29716900
*                       KEYWORDS: CONTAINS ADDRESS OF PCE FOR  @E1113KS 29752000
*                                 KEYWORD OR 0 IF INVALID      @E1113KS 29787100
*                                 KEYWORD ENTERED              @E1113KS 29822200
         ORG   ECTHELP                                         @E1113KS 29857300
ECTNUM   DS    CL4      SAME AS ECTHELP                        @E1113KS 29892400
ECTENVBK DS    A        ADDRESS OF THE REXX ENVIRONMENT BLOCK  @E21D2S4 29927500
ECTEXTPR DS    A        ADDRESS OF THE ECT EXTENSION BLOCK     @E21D2C1 29962600
**/                                                                     30000000
         MEND                                                           31000000
* %ECTBSL  :  ;                                                         32000000
* %IF ECTSTORAGE='' %THEN            /*                     @ZA29467 */ 32050000
*   %ECTSTORAGE='BASED(ECTPTR)';     /*                     @ZA29467 */ 32100000
* /* MAPPING OF  ENVIRONMENT CONTROL TABLE                           */ 32150000
* DECLARE                                                               33000000
*   1 ECT ECTSTORAGE,                /*                     @ZA29467 */ 33050000
*    2 ECTRCDF  CHAR(1),             /* HIGH ORDER BIT INDICATES CP     41000000
*                                       ABENDED                      */ 42000000
*    2 ECTRTCD PTR(24),              /* RETURN CODE FROM LAST CP OR     43000000
*                                       ABEND CODE IF ECTRCDF IS SET */ 44000000
*    2 ECTIOWA  PTR(31),             /* ADDR I/O SRV RTNS WORK AREA  */ 45000000
*    2 ECTMSGF  CHAR(1),             /* HIGH ORDER BIT SET MEANS        46000000
*                                       DELETE SECOND LEVEL MSG      */ 47000000
*    2 ECTSMSG  PTR(24),                                                47050000
*                                    /* ADDR OF SECOND LEVEL MSG        49000000
*                                       CHAIN                @E1213F4*/ 49050000
*    2 ECTPCMD  CHAR(8),             /* PRIMARY COMMAND NAME         */ 51000000
*    2 ECTSCMD  CHAR(8),             /* SUBCOMMAND NAME              */ 52000000
*    2 ECTSWS   CHAR(1),             /* 1 BYTE OF SWITCHES           */ 52050000
*     3 ECTNOPD  BIT(1),             /* 0 BIT ON= NO OPERANDS EXIST     54000000
*                                       IN CMD BUFFER                */ 55000000
*     3 ECTCAFAT BIT(1),             /* IKJCAF WAS ENTERED   @YA24741*/ 55050000
*     3 ECTATRM  BIT(1),             /* CP TERMINATED BY TMP DETACH     57000000
*                                       W/ STAE EQU                  */ 58000000
*     3 ECTLOGF  BIT(1),             /* LOGON/OFF REQUESTED TMP TO      59000000
*                                       LOGOFF USER BITS             */ 60000000
*     3 ECTNMAL BIT(1),              /* NO USER MSGS TO BE RECVED AT    61000000
*                                       LOGON                        */ 62000000
*     3 ECTNNOT BIT(1),              /* NO BRDCST NOTICES TO BE RECVED  63000000
*                                       LOGON                        */ 64000000
*     3 ECTBKGRD BIT(1),             /* BACKGROUND MODE              */ 64050000
*     3 ECTATTN  BIT(1),             /* ATTN MODE FOR CLIST  Z30NQKM */ 64100000
*    2 ECTDDNUM PTR(24),             /*COUNTER FOR TEMPORARY DDNAMES */ 67000000
*    2 ECTUSER  PTR(31),             /*RESERVED FOR INSTALLATION USE */ 67050000
*    2 ECTBKPB  PTR(31),             /*ADDR OF BACKGROUND PARM BLOCK */ 67100000
*    2 ECTSWS2  CHAR(4) BDY(WORD),   /* EXTENDED FLAG FIELD          */ 67150000
*      3 ECTSWS21 BIT(8),            /* FLAGS                        */ 67200000
*        4 ECTDEFCS BIT(1),          /* DEFAULT CONTROL CHARS USED   */ 67250000
*        4 ECTTABND BIT(1),          /* TEST SUBTASK ABENDED         */ 67300000
*        4 ECTPARSE BIT(1),          /* PARSE ?HELP ALLOWED  @E1113KS*/ 67350000
*        4 ECTPOSIT BIT(1),          /* ECTHELP = POSITIONAL NUMBER     67400000
*                                                            @E1113KS*/ 67450000
*        4 ECTKEYWD BIT(1),          /* ECTHELP = PCE ADDRESS OR 0      67500000
*                                                            @E1113KS*/ 67550000
*        4 ECTNOQPR BIT(1),          /* ? PROMPT HELP IS DISABLED       67600000
*                                                            @E1113KS*/ 67650000
*        4 *        BIT(1),          /* RESERVED             @ZA91237*/ 67700000
*        4 ECTNOPUT BIT(1),          /* TO PREVENT PUTLINE - IF ON,     67750000
*                                       ALL PUTLINE DATA IS DISCARDED   67800000
*                                                            @E1213F4*/ 67850000
*      3 ECTSWS22 BIT(8),            /* ADDITIONAL FLAGS     @ZA92773*/ 67900000
*        4 ECTMSGOR BIT(1),          /* MESSAGE OVERRIDE     @ZA92773*/ 67950000
*        4 ECTRXEOF BIT(1),          /* END OF FILE FOR SYSTSIN BY      68000000
*                                       REXX                 @PEI0926*/ 68050000
*        4 ECTNPTSO BIT(1),          /* USED TO INDICATE TO TSOEXEC TO  68100000
*                                       INVOKE TSF WITH THE             68150000
*                                       NON-PARALLEL TMP PROCESSING     68200000
*                                       OPTION.              @E22D2D3*/ 68250000
*        4 ECTTSTAT BIT(1),          /* TEST IS IN ATTENTION            68300000
                                        PROCESSING           @YA49863*/ 68350000
*        4 *        BIT(4),          /* RESERVED             @YA49863*/ 68400000
*      3 *        CHAR(2),           /* RESERVED             @ZA92773*/ 68450000
*    2 ECTHELP  PTR(31),             /* POSITIONALS: POSITIONAL #       68500000
*                                                    IN EBCDIC          68550000
*                                       KEYWORDS: CONTAINS ADDRESS OF   68600000
*                                                 PCE FOR KEYWORD OR 0  68650000
*                                                 IF INVALID KEYWORD    68700000
*                                                 ENTERED    @E1113KS*/ 68750000
*      3 ECTNUM CHAR(4),             /* ALTERNATIVE NAME FOR ECTHELP    68800000
*                                                            @E1113KS*/ 68850000
*    2 ECTENVBK PTR(31),             /* ADDRESS OF THE REXX             68900000
*                                       ENVIRONMENT BLOCK    @E21D2S4*/ 68950000
*    2 ECTEXTPR PTR(31);             /* ADDRESS OF ECT EXTENSION        69000000
*                                       BLOCK                @E21D2C1*/ 69050000
*                                                                       70000000
