         MACRO                                                          00001005
         IKJENDP &DUMMY                                                 00002005
.**01* PROPRIETARY STATEMENT=                                         * 00010002
.* **PROPRIETARY_STATEMENT********************************************* 00011002
.*                                                                    * 00012002
.*                                                                    * 00013002
.*  LICENSED MATERIALS - PROPERTY OF IBM                              * 00014003
.*  5650-ZOS COPYRIGHT IBM CORP. 1981, 2013                           * 00019006
.*                                                                    * 00019102
.*  STATUS= HTE7790                                                   * 00019202
.*                                                                    * 00019302
.* **END_OF_PROPRIETARY_STATEMENT************************************** 00019402
.*                                                                      00019502
.**01* EXTERNAL CLASSIFICATION: PI                                 @L1A 00019602
.**01* END OF EXTERNAL CLASSIFICATION:                             @L1A 00019702
.*                                                                      00019802
.*                                                                      00019904
.*  CHANGE-ACTIVITY =                                                   00020002
.*                                                                      00020105
.* RELEASE 20 SUPPORT CODE -- 20035                                     00020205
.*                                                                      00020305
.* FLAG REASON   RELEASE DATE     ORIGIN                           @L1A 00020502
.* ---- ------   ------- -------- ------                           @L1A 00020602
.* $L1= MG08414  HTE7790 120619   MPK: ALLOW FOR USE WITHIN RSECT  @L1A 00020702
.*                                                                      00020802
         GBLC  &IKJCSNM,&IKJDSNM,&IKJCSND,&IKJKWST,&IKJDSLN             00040000
         AIF   (N'&SYSLIST(1) EQ 0).GOOD                     @ZA65509   00050004
         MNOTE 4,'IKJENDP SHOULD HAVE NO POSITIONAL PARAMETERS'         00060000
.GOOD    ANOP                                                           00070000
         AIF   ('&IKJCSNM' NE '').GOOD2                                 00080000
         MNOTE 8,'CSECT NAME (FROM IKJPARM MACRO LABEL) IS MISSING'     00090000
         MEXIT                                                          00100000
.GOOD2   ANOP                                                           00110000
&IKJCSNM CSECT ,                       RESUME PCL CSECT                 00120000
         AIF   ('&IKJKWST' EQ '').NOEQU IS KEYWORD SET                  00130000
&IKJKWST EQU   *-&IKJCSNM              OFFSET TO END OF FIELD           00140000
.NOEQU   ANOP                                                           00150000
         DC    AL1(0)                  END OF FIELD                     00160000
&IKJDSNM DSECT                                                          00170000
         DS    0D                      ALIGN TO DOUBLEWORD FOR STG. ALL*00180000
               OCATOR                                                   00190000
&IKJDSLN EQU   *-&IKJDSNM              LENGTH OF BASIC PDL              00200000
&IKJCSNM CSECT                                                          00210000
&IKJCSND EQU   *                                                        00220000
&SYSECT  &SYSSTYP ,                    RESUME USERS CSECT OR RSECT @L1A 00230002
         MEND                                                           00240000
