*        %GOTO DFPLS1;                 /* BILINGUAL MAPPING             00050000
         MACRO                                                          00100000
         IKJEFFDF &DFDSECT=NO,&DFDSEC2=NO                               00150000
.*A-000000-999999                                               Y02993  00200000
.*C-REL. 4 UPDATE CHANGES FOR LENGTH OF POSSIBLE VALUES        @Z40NQKQ 00250000
.*C-IDNUM AND ALTERNATE NAME FOR IDNUM                         @Z40NQKQ 00300000
.*C-TWO BUFFERS FOR EXTRACTING MESSAGES                        @Z40GQKU 00350000
.*C198000                                                      @ZA67575 00400000
         AGO .DFBAL01                  **SKIP PLS MACRO STATEMENT ** */ 00450000
*%DFPLS1: ;                            /* BAL/PLS HEADER                00500000
.DFBAL01 ANOP                                                        */ 00550000
*/*** START OF SPECIFICATIONS ****************************************/ 00600000
*/*                                                                  */ 00650000
*/**01* PROPRIETARY STATEMENT=                                       */ 00660001
*/***PROPRIETARY_STATEMENT********************************************/ 00670001
*/*                                                                  */ 00680001
*/*                                                                  */ 00690001
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00691001
*/* 5650-ZOS COPYRIGHT IBM CORP. 1975, 2015                          */ 00692001
*/*                                                                  */ 00693001
*/* STATUS= HTE77A0                                                  */ 00694001
*/*                                                                  */ 00695001
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 00696001
*/*                                                                  */ 00697001
*/*01* EXTERNAL CLASSIFICATION: PI                                   */ 00698002
*/*01* END OF EXTERNAL CLASSIFICATION:                               */ 00699001
*/*                                                                  */ 00699101
*/*01* MACRO NAME: IKJEFFDF                                          */ 00699202
*/*                                                                  */ 00699302
*/*01* DESCRIPTIVE NAME: TSO/E Parameter List to IKJEFF18 (DAIRFAIL) */ 00699402
*/*                                                                  */ 00699502
*/*01* DSECT NAME: DFPARMS, DFID, DFBUFS                             */ 00699602
*/*                                                                  */ 00699702
*/*01* COMPONENT:  TSO/E Scheduler (28502)                           */ 00699802
*/*                                                                  */ 00699902
*/*01* EYE-CATCHER: None                                             */ 00700002
*/*02*  OFFSET: N/A                                                  */ 00710002
*/*02*  LENGTH: N/A                                                  */ 00720002
*/*                                                                  */ 00730002
*/*01* STORAGE ATTRIBUTES:                                           */ 00740002
*/*02*  SUBPOOL: 0 or 1                                              */ 00750002
*/*02*  KEY: 1 or 8                                                  */ 00760002
*/*02*  RESIDENCY:                                                   */ 00770002
*/*02*  MAIN STORAGE:                                                */ 00780002
*/*02*  AUXILIARY STORAGE:                                           */ 00790002
*/*02*  VIRTUAL STORAGE:                                             */ 00791002
*/*                                                                  */ 00792002
*/*01* SIZE: DFPARMS - 24 bytes                                      */ 00793002
*/*          DFID - 2 bytes                                          */ 00794002
*/*          DFBUF - 511 bytes                                       */ 00794102
*/*                                                                  */ 00794202
*/*01* CREATED BY: Caller of IKJEFF18                                */ 00795002
*/*                                                                  */ 00796002
*/*01* POINTED TO BY: Register 1                                     */ 00797002
*/*                                                                  */ 00798002
*/*01* SERIALIZATION: None                                           */ 00799002
*/*                                                                  */ 00799102
*/*01* FUNCTION: This parameter list is the interface to IKJEFF18    */ 00799202
*/*              from a caller with an error return code from        */ 00799302
*/*              SVC 99 (dynamic allocation) or DAIR. IKJEFF18 will  */ 00799402
*/*              issue an error message to the TSO/E terminal or as  */ 00799502
*/*              a write to programmer and/or return the message in  */ 00799602
*/*              the caller's buffers.                               */ 00799702
*/*                                                                  */ 00799802
*/*01* METHOD OF ACCESS:                                             */ 00799902
*/*02*   PL/X:  - %DFTYPE='BDY(WORD)'- - - IF DON'T WANT BASED       */ 00800002
*/*                                        (THIS IS THE DEFAULT)     */ 00800102
*/*               %DFTYPE2='BASED(DFBUFP)' IF WANT TO HAVE   @Z40GQKU*/ 00800202
*/*                                        BASED (THIS IS THE@Z40GQKU*/ 00800302
*/*                                        DEFAULT)          @Z40GQKU*/ 00800402
*/*               %INCLUDE SYSLIB(IKJEFFDF)                          */ 00800502
*/*                                                                  */ 00800602
*/*02*   ASM:   - USING on DSECT DFPARMS                             */ 00800702
*/*             - DFDSECT=YES  IF DON'T WANT TO GET CORE             */ 00800802
*/*                 THEN CODE      LA    REG,MYDFCORE  *CALLER AREA  */ 00800902
*/*                                USING DFDSECTD,REG        @ZA67575*/ 00801002
*/*               DFDSECT=NO   IS THE DEFAULT.                       */ 00801102
*/*               DFDSEC2=YES  IF DON'T WANT TO GET CORE     @Z40GQKU*/ 00801202
*/*                 THEN CODE      LA    REG,MYDFCORE        @Z40GQKU*/ 00801302
*/*                                           *CALLER AREA   @Z40GQKU*/ 00801402
*/*                                USING DFDSECT2,REG        @Z40GQKU*/ 00801502
*/*               DFDSEC2=NO   THIS IS THE DEFAULT           @Z40GQKU*/ 00801602
*/*                                                                  */ 00801702
*/* DESCRIPTION - BILINGUAL MAPPING MACRO FOR IKJEFF18 PARAMETER     */ 00810000
*/*               LIST (DYNAMIC ALLOCATION SVC99 FAILURES OR         */ 00850000
*/*               DAIR FAILURES)                                     */ 00900000
*/*                                                                  */ 00950000
*/* FUNCTION   - THE PARAMETER LIST IS THE INTERFACE                 */ 01000000
*/*              TO IKJEFF18 FROM CALLER WITH AN ERROR RETURN        */ 01050000
*/*              FROM SVC99 OR DAIR                                  */ 01100000
*/*                                                                  */ 01150000
*/*              REGISTER 1 CONTAINS THE ADDRESS OF DFPARMS          */ 01200000
*/*              REGISTER 15 WILL CONTAIN IKJEFF18'S RETURN CODE     */ 01250000
*/*                          TO THE CALLER (0 IF MESSAGE(S)          */ 01300000
*/*                          ISSUED SUCCESSFULLY)                    */ 01350000
*/*                                                                  */ 01400000
*/*               IKJEFFDF                                           */ 02350000
*/*                                                                  */ 02400000
*/* NOTES       - IKJEFF18 WILL INDEX INTO THE S99RB FOR SVC 99      */ 02450000
*/*               ERRORS AND THE DAIR PARAMETER BLOCK FOR DAIR       */ 02500000
*/*               ERRORS TO OBTAIN DSNAME, DDNAME, VOLSER,ETC,       */ 02550000
*/*               INFORMATION WHICH MAY BE INSERTED INTO THE         */ 02600000
*/*               OUTPUT MESSAGE                                     */ 02650000
*/*                                                                  */ 02700000
*/*01* CHANGE ACTIVITY =                                             */ 02810002
*/* *** IKJEFFDF ***     LEVEL=06/19/75     OS/VS2 RELEASE 4.0       */ 02820002
*/*                                                          @Z40NQKJ*/ 02830002
*/*** END OF SPECIFICATIONS ******************************************/ 02850000
*        %GOTO DFPLS2;                 /* BAL ONLY FOLLOWS              02900000
.*       SET UP DSECT CARD IF DFDSECT-YES ON MACRO                      02950000
         AIF   ('&DFDSECT' EQ 'NO').DFBAL1                              03000000
DFDSECTD DSECT                                                          03050000
.DFBAL1  ANOP                          **MACRO STATEMENT**              03100000
         DS    0F                                                       03150000
DFPARMS  EQU   *                                                        03200000
DFS99RBP DS    A                      *ADDRESS OF THE FAILING SVC 99    03250000
*                                      REQUEST BLOCK FOR SVC 99 ERRORS  03300000
DFDAPLP  EQU   DFS99RBP               *ADDRESS OF THE FAILING DAIR      03350000
*                                      PARAMETER LIST FOR DAIR ERRORS   03400000
DFRCP    DS    A                      *ADDRESS OF A FOUR BYTE STORAGE   03450000
*                                      AREA CONTAINING THE SVC 99 OR    03500000
*                                      THE DAIR REGISTER 15 RETURN CODE 03550000
DFJEFF02 DS    A                      *ADDRESS OF A FOUR BYTE AREA      03600000
*                                      WHICH CONTAINS EITHER THE ENTRY  03650000
*                                      POINT ADDRESS OF IKJEFF02        03700000
*                                      (MESSAGE WRITER FOR IKJEFF18) OR 03750000
*                                      ZEROES IF ENTRY ADDRESS IS       03800000
*                                      UNKNOWN                          03850000
DFIDP    DS    A                      *ADDRESS OF A TWO BYTE AREA       03900000
*                                      CONTAINING A CALLER IDENTIFIER   03950000
*                                      NUMBER DESCRIBED BELOW  @Z40GQKU 04000000
DFCPPLP  DS    A                      *ADDRESS OF THE CPPL - THIS IS    04050000
*                                      NEEDED ONLY WHEN IKJEFF18 IS     04100000
*                                      CALLED WITH AN SVC 99 ERROR      04150000
DFBUFP   DS    A                      *ADDRESS OF DFBUFS IF DFBUFSW OR  04200000
*                                      DFBUFS2 ON              @Z40GQKU 04250000
DFLEN    EQU   *-DFPARMS                                                04300000
**********************************************************************  04350000
* POSSIBLE VALUES FOR THE CALLER IDENTIFIER POINTED TO BY DFIDP         04400000
**********************************************************************  04450000
*                                                                       04500000
DFSVC99  EQU   50                      GENERAL CALLER WITH AN SVC 99    04550000
*                                      ERROR                            04600000
DFFREE   EQU   51                      FREE COMMAND WITH AN SVC 99      04650000
*                                      ERROR                            04700000
DFDAIR   EQU   1                       GENERAL CALLER WITH A DAIR ERROR 04750000
*                                                                       04800000
DFWTP    EQU   X'80'                   THE HIGH ORDER BIT ON IN THE     04850000
*                                      CALLER IDENTIFIER INDICATES      04900000
*                                      A WRITE TO PROGRAMMER IS         04950000
*                                      NEEDED INSTEAD OF THE DEFAULT    05000000
*                                      PUTLINE                          05050000
DFBUFSW  EQU   X'40'                   ON IF CALLER WANTS      @Z40GQKU 05100000
*                                      MESSAGE TEXT RETURNED IN@Z40GQKU 05150000
*                                      BUFFERS INSTEAD OF      @Z40GQKU 05200000
*                                      DEFAULT PUTLINE         @Z40GQKU 05250000
DFBUFS2  EQU   X'20'                   ON IF WANT DFBUFSW      @Z40GQKU 05300000
*                                      FUNCTION PLUS PUTLINE   @Z40GQKU 05350000
*                                      (OR WTP)                @Z40GQKU 05400000
*/***********************************************************@Z40GQKU*/ 05450000
*/* MAP OF CALLER-SUPPLIED BUFFERS POINTED TO BY DFBUFP      @Z40GQKU*/ 05500000
*/***********************************************************@Z40GQKU*/ 05550000
.*       SET UP DSECT CARD IF DFDSEC2-YES ON MACRO             @Z40GQKU 05600000
         AIF   ('&DFDSEC2' EQ 'NO').DFBAL2                     @Z40GQKU 05650000
DFDSECT2 DSECT                                                 @Z40GQKU 05700000
.DFBAL2  ANOP                          **MACRO STATEMENT**     @Z40GQKU 05750000
DFBUFS   DS    0F                      (NEED NOT INITIALIZE)   @Z40GQKU 05800000
DFBUF1   EQU   *                                               @Z40GQKU 05850000
DFBUFL1  DS    FL2                     LENGTH OF AREA USED IN  @Z40GQKU 05900000
*                                      DFBUF1 (INCLUDES DFBUFL1@Z40GQKU 05950000
*                                      AND DFBUFO2 FIELDS)     @Z40GQKU 06000000
DFBUFO1  DS    FL2                     OFFSET IS ZERO ON RETURN@Z40GQKU 06050000
DFBUFT1  DS    CL251                   TEXT OF FIRST LEVEL     @Z40GQKU 06100000
*                                      MESSAGE                 @Z40GQKU 06150000
DFBUF2   DS    0H                                              @Z40GQKU 06200000
DFBUFL2  DS    FL2                     LENGTH (INCLUDES LLOO   @Z40GQKU 06250000
*                                      FIELDS)                 @Z40GQKU 06300000
DFBUFO2  DS    FL2                     OFFSET                  @Z40GQKU 06350000
DFBUFT2  DS    CL251                   TEXT OF SECOND LEVEL    @Z40GQKU 06400000
*                                      MESSAGE                 @Z40GQKU 06450000
DFLEN2   EQU   *-DFBUFS                LENGTH OF BUFFER PARMS  @Z40GQKU 06500000
**********************************************************************  06550000
* END OF IKJEFFDF MAPPING MACRO                                         06600000
**********************************************************************  06650000
         MEND                                                      , */ 06700000
*%DFPLS2: ;                                                             06750000
*%IF DFTYPE='' %THEN                                                    06800000
*%DFTYPE='BDY(WORD)';                                                   06850000
*   DCL 1 DFPARMS DFTYPE,              /* PARAMETER LIST TO IKJEFF18 */ 06900000
*        2 DFS99RBP PTR(31),           /* ADDRESS OF THE FAILING SVC 99 06950000
*                                         REQUEST BLOCK FOR SVC 99      07000000
*                                         ERRORS                     */ 07050000
*         3 DFDAPLP PTR(31),           /* ADDRESS OF THE FAILING DAIR   07100000
*                                         PARAMETER LIST FOR DAIR       07150000
*                                         ERRORS                     */ 07200000
*        2 DFRCP PTR(31),              /* ADDRESS OF A FOUR BYTE        07250000
*                                         STORAGE AREA CONTAINING THE   07300000
*                                         SVC 99 OR THE DAIR REGISTER   07350000
*                                         15 RETURN CODE             */ 07400000
*        2 DFJEFF02 PTR(31),           /* ADDRESS OF A FOUR BYTE        07450000
*                                         STORAGE AREA WHICH CONTAINS   07500000
*                                         EITHER THE ENTRY POINT        07550000
*                                         ADDRESS OF IKJEFF02 (MESSAGE  07600000
*                                         WRITER FOR IKJEFF18) OR       07650000
*                                         ZEROES IF ENTRY ADDRESS       07700000
*                                         UNKNOWN                    */ 07750000
*        2 DFIDP PTR(31),              /* ADDR OF DFID FIELD @Z40GQKU*/ 07800000
*        2 DFCPPLP PTR(31),            /* ADDRESS OF THE CPPL - THIS    07850000
*                                         IS NEEDED ONLY WHEN IKJEFF18  07900000
*                                         IS CALLED WITH AN SVC 99      07950000
*                                         ERROR                      */ 08000000
*        2 DFBUFP PTR(31);             /* ADDRESS OF DFBUFS FIELD       08050000
*                                         IF DFBUFSW OR DFBUFS2         08100000
*                                         ON                 @Z40GQKU*/ 08150000
*                                                                       08200000
*   /* IKJEFFDF - RETURN CODE, MESSAGE WRITER ENTRY AND              */ 08250000
*   /*            CALLER IDENTIFIER POINTED TO BY DFPARMS            */ 08300000
*                                                                       08350000
*   DCL DFRC FIXED(31) BASED(DFRCP);    /* RETURN CODE FROM SVC 99      08400000
*                                          OR DAIR                   */ 08450000
*   DCL DFMSGWTP PTR(31) BASED(DFJEFF02); /* ENTRY POINT ADDRESS OF     08500000
*                                            IKJEFF02 OR ZEROES      */ 08550000
*   /* MAP OF THE CALLER IDENTIFIER AREA POINTED TO BY DFIDP         */ 08600000
*   DCL 1 DFID FIXED(15) BASED(DFIDP), /* CALLER IDENTIFIER          */ 08650000
*        2 * BIT(8),                   /* FLAG AREA                  */ 08700000
*         3 DFWTP BIT(1),              /* ON IF THE CALLER WANTS A      08750000
*                                         WRITE TO PROGRAMMER INSTEAD   08800000
*                                         OF A DEFAULT PUTLINE       */ 08850000
*         3 DFBUFSW BIT(1),         /* ON IF THE CALLER WANTS@Z40GQKU   08900000
*                                      MESSAGE TEXT RETURNED @Z40GQKU   08950000
*                                      IN BUFFERS INSTEAD OF @Z40GQKU   09000000
*                                      A DEFAULT PUTLINE     @Z40GQKU*/ 09050000
*         3 DFBUFS2 BIT(1),         /* ON IF WANT DFBUFSW    @Z40GQKU   09100000
*                                      FUNCTION PLUS PUTLINE @Z40GQKU   09150000
*                                      (OR WTP)              @Z40GQKU*/ 09200000
*         3 * BIT(5),                  /* RESERVED - MUST BE ZERO    */ 09250000
*       2 IDNUM FIXED(8),              /* CALLER IDENTIFIER NUMBER      09300000
*                                         (VALUES DESCRIBED BELOW)   */ 09350000
*         3 DFIDNUM FIXED(8);          /* ALTERNATE NAME                09400000
*                                         FOR IDNUM          @Z40NQKQ*/ 09450000
*   /* POSSIBLE VALUES FOR IDNUM                                     */ 09500000
*   DCL DFSVC99 FIXED(8) CONSTANT(50); /* GENERAL CALLER WITH AN        09550000
*                                         SVC 99 ERROR       @Z40NQKQ*/ 09600000
*   DCL DFFREE FIXED(8) CONSTANT(51); /* FREE COMMAND WITH AN           09650000
*                                         SVC 99 ERROR       @Z40NQKQ*/ 09700000
*   DCL DFDAIR FIXED(8) CONSTANT(1);  /* GENERAL CALLER WITH A          09750000
*                                         DAIR ERROR         @Z40NQKQ*/ 09800000
*%IF DFTYPE2='' %THEN               /*                       @Z40GQKU*/ 09850000
*%DFTYPE2='BASED(DFBUFP)';          /*                       @Z40GQKU*/ 09900000
*   /*  MAP OF CALLER-SUPPLIED BUFFERS                       @Z40GQKU*/ 09950000
*   DCL 1 DFBUFS DFTYPE2,           /* (NEED NOT INITIALIZE) @Z40GQKU*/ 10000000
*        2 DFBUF1,                  /* FIRST EXTRACT BUFFER  @Z40GQKU*/ 10050000
*         3 DFBUFL1 FIXED(15),      /* LENGTH OF AREA USED IN@Z40GQKU   10100000
*                                      DFBUF1 (INCLUDES      @Z40GQKU   10150000
*                                      DFBUFL1 AND DFBUFO1   @Z40GQKU   10200000
*                                      LENGTHS)              @Z40GQKU*/ 10250000
*         3 DFBUFO1 FIXED(15),      /* OFFSET IS ZERO ON     @Z40GQKU   10300000
*                                      RETURN                @Z40GQKU*/ 10350000
*         3 DFBUFT1 CHAR(251),      /* TEXT OF FIRST LEVEL   @Z40GQKU   10400000
*                                      MESSAGE               @Z40GQKU*/ 10450000
*        2 *       CHAR(1),         /* ALIGNMENT FACTOR      @Z40GQKU*/ 10500000
*        2 DFBUF2 BDY(HWORD),       /* SECOND EXTRACT BUFFER @Z40GQKU*/ 10550000
*         3 DFBUFL2 FIXED(15),      /* LENGTH (INCLUDES LLOO @Z40GQKU   10600000
*                                      FIELDS)               @Z40GQKU*/ 10650000
*         3 DFBUFO2 FIXED(15),      /* OFFSET                @Z40GQKU*/ 10700000
*         3 DFBUFT2 CHAR(251);      /* TEXT OF SECOND LEVEL  @Z40GQKU   10750000
*                                      MESSAGE               @Z40GQKU*/ 10800000
*/********************************************************************/ 10850000
*/* END OF IKJEFFDF MAPPING MACRO                                    */ 10900000
*/********************************************************************/ 10950000
