*%GOTO PLAS_TSJ;                                                        00050000
         MACRO                                                          00100000
         IKJEFTSJ &TJDSECT=NO                                           00150000
.* A 0-999999                                                           00200000
*/***START OF SPECIFICATIONS******************************************/ 00250000
*/*                                                                  */ 00300000
*/**01* PROPRIETARY STATEMENT=                                       */ 00560000
*/***PROPRIETARY_STATEMENT********************************************/ 00600000
*/*                                                                  */ 00650000
*/*                                                                  */ 00700000
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00750000
*/* 5650-ZOS COPYRIGHT IBM CORP. 1990, 2015                          */ 00800000
*/*                                                                  */ 00850000
*/* STATUS= HTE77A0                                                  */ 00900000
*/*                                                                  */ 00950000
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 01000000
*/*                                                                  */ 01050000
*/*01* EXTERNAL CLASSIFICATION: NOTPI                                */ 01100000
*/*01* END OF EXTERNAL CLASSIFICATION:                               */ 01150000
*/*                                                                  */ 01350000
*/*01* MACRO NAME: IKJEFTSJ                                          */ 01360000
*/*                                                                  */ 01370000
*/*01* DESCRIPTIVE NAME: Mapping for the IKJEFTSI parameter list     */ 01380000
*/*                                                                  */ 01381000
*/*02*  ACRONYM: IKJEFTSJ                                            */ 01390000
*/*                                                                  */ 01391000
*/*01* DSECT NAME: IKJEFTSJ                                          */ 01400000
*/*                                                                  */ 01450000
*/*01* COMPONENT: TSO/E Scheduler (28502)                            */ 01500000
*/*                                                                  */ 01550000
*/*01* EYE-CATCHER: None                                             */ 01600000
*/*                                                                  */ 01650000
*/*01* STORAGE ATTRIBUTES =                                          */ 01700000
*/*02*  SUBPOOL = Determined by the invoker of IKJEFTSI              */ 01750000
*/*02*  KEY = 8                                                      */ 01800000
*/*02*  RESIDENCY = Determined by the invoker of IKJEFTSI            */ 01850000
*/*                                                                  */ 01900000
*/*01* SIZE = See assembler listing                                  */ 01950000
*/*                                                                  */ 02000000
*/*01* CREATED BY =                                                  */ 02050000
*/*     Invoker of IKJEFTSI                                          */ 02100000
*/*                                                                  */ 02150000
*/*01* DELETED BY =                                                  */ 02200000
*/*     Invoker of IKJEFTSI                                          */ 02250000
*/*                                                                  */ 02300000
*/*01* POINTED TO BY =                                               */ 02350000
*/*     Register 1 on entry to IKJEFTSI                              */ 02400000
*/*                                                                  */ 02450000
*/*01* SERIALIZATION =                                               */ 02500000
*/*     None                                                         */ 02550000
*/*                                                                  */ 02600000
*/*01* FUNCTION = IKJEFTSJ is the mapping macro for the standard     */ 02650000
*/*             parameter list passed to IKJEFTSI via register 1.    */ 02700000
*/*                                                                  */ 02750000
*/*01* METHOD OF ACCESS =                                            */ 02760001
*/*                                                                  */ 02770001
*/*             IKJEFTSJ TJDSECT=XX                                  */ 02780001
*/*               TJDSECT=YES  IF DON'T WANT TO GET STORAGE,         */ 02790001
*/*                 THEN CODE      LA    REG,MYTJSTOR  *CALLER AREA* */ 02791001
*/*                                USING TJDSECTD,REG                */ 02792001
*/*               TJDSECT=NO  IS THE DEFAULT.                        */ 02793001
*/*                                                                  */ 02794001
*/*  Register 1                                                      */ 02800000
*/*  +--------+    +--------------+    +-------------+               */ 02850000
*/*  !        !--->!ECTPARM@      !--->!ECTPARM      !               */ 02900000
*/*  +--------+    !--------------!    !-------------!               */ 02950000
*/*                !RESERVED@     !--->!RESERVED     !               */ 03000000
*/*                !--------------!    !-------------!               */ 03050000
*/*                !TOKEN@        !--->!TOKEN        !               */ 03100000
*/*                !--------------!    !-------------!               */ 03150000
*/*                !ERROR@        !--->!ERROR        !               */ 03200000
*/*                !--------------!    !-------------!               */ 03250000
*/*                !ABEND@        !--->!ABEND        !               */ 03300000
*/*                !--------------!    !-------------!               */ 03350000
*/*                !REASON@       !--->!REASON       !               */ 03400000
*/*                +--------------+    +-------------+               */ 03450000
*/*                                                                  */ 03500000
*/*01* MACRO-TYPE = Mapping macro                                    */ 03550000
*/*                                                                  */ 03600000
*/*01*  NOTES = None                                                 */ 03650000
*/*                                                                  */ 03700000
*/*01*  PROCESSOR = BAL                                              */ 03750000
*/*                                                                  */ 03800000
*/*01* CHANGE-ACTIVITY =                                             */ 04250000
*/*                                                                  */ 04300000
*/*  Created for TSO/E 2.2.0                                 @E22D2E9*/ 04350000
*/*  PG10120 - Change parameters such that only the          @PG10120*/ 04400000
*/*            ECTPARM, RESERVED, TOKEN and ERROR parameters @PG10120*/ 04450000
*/*            are the only required parameters.             @PG10120*/ 04500000
*/*                                                                  */ 04550000
*/*  PG10203 - Change ORG EFTST_RESERVED@ to                 @PG10203*/ 04600000
*/*            ORG EFTSI_RESERVED@                           @PG10203*/ 04650000
*/*                                                                  */ 04700000
*/*  PG10209 - Define EFTSI_TOKEN with a length of 16        @PG10209*/ 04750000
*/*                                                                  */ 04800000
*/*  OW17712 - Length of EFTSI_RESERVED, EFTSI_ABEND and             */ 04850000
*/*            EFTSI_REASON changed from 32 to 4 bytes to            */ 04900000
*/*            match the PLX version of the mapping macro.   @WA17712*/ 04950000
*/*                                                                  */ 05000000
*/* FLAG REASON   RELEASE DATE     ORIGIN                        @N1A*/ 05050000
*/* ---- ------   ------- -------- ------                        @N1A*/ 05100000
*/* $N1= COPYRITE HTE26D2 19970218 VOHS: Insert/Update Copyright @N1A*/ 05150000
*/*                                                                  */ 05200000
*/***END OF SPECIFICATIONS********************************************/ 05250000
         EJECT                                                          05300000
*/********************************************************************/ 05350000
*/*                                                                  */ 05400000
*/*  IKJEFTSJ - Parameter List for IKJEFTSI                          */ 05450000
*/*                                                                  */ 05500000
*/********************************************************************/ 05550000
         SPACE                                                          05600000
**/                                                                     05650000
*       SET UP DSECT CARD IF TJDSECT=YES ON MACRO                       05700000
         AIF   ('&TJDSECT' EQ 'NO').TJBAL1  **MACRO STATEMENT**         05750000
TJDSECTD DSECT                                                          05800000
.TJBAL1  ANOP                            **MACRO STATEMENT**            05850000
         DS 0D                           Align on double-word boundary  05900000
IKJEFTSJ DS CL60                         Bytes in structure    @PG10120 05950000
         ORG   IKJEFTSJ                                                 06000000
EFTSI_ECTPARM@  DS AL4                   Pointer to the                 06050000
*                                        ECT address.          @PG10120 06100000
             ORG EFTSI_ECTPARM@                                @PG10120 06150000
EFTSI_ECTPARM@_HIBIT DS BL1              This bit must be OFF  @PG10120 06200000
             DS 0F                       Reach next WORD bdy   @PG10120 06250000
EFTSI_RESERVED@ DS AL4                   Pointer to RESERVED   @PG10120 06300000
             ORG EFTSI_RESERVED@                               @PG10203 06350000
EFTSI_RESERVED@_HIBIT DS BL1             End of list           @PG10120 06400000
                   DS 0F                 Reach next WORD bdy   @PG10120 06450000
EFTSI_TOKEN@ DS AL4                      Pointer to TOKEN data @PG10120 06500000
             ORG EFTSI_TOKEN@                                  @PG10120 06550000
EFTSI_TOKEN@_HIBIT DS BL1                This bit must be OFF  @PG10120 06600000
                   DS 0F                 Reach next WORD bdy   @PG10120 06650000
EFTSI_ERROR@ DS AL4                      Ptr to ERROR data     @PG10120 06700000
             ORG EFTSI_ERROR@                                  @PG10120 06750000
EFTSI_ERROR@_HIBIT DS BL1                End of list           @PG10120 06800000
                   DS 0F                 Reach next WORD bdy   @PG10120 06850000
EFTSI_ABEND@ DS AL4                      Pointer to ABEND data          06900000
             ORG EFTSI_ABEND@                                           06950000
EFTSI_ABEND@_HIBIT DS BL1                End of list                    07000000
                   DS 0F                 Reach next fullword boundary   07050000
EFTSI_REASON@ DS AL4                     Pointer to REASON data         07100000
              ORG EFTSI_REASON@                                         07150000
EFTSI_REASON@_HIBIT DS BL1               End of list                    07200000
                    DS 0F                Reach next fullword boundary   07250000
*                                                                       07300000
*/********************************************************************/ 07350000
*/*                                                                  */ 07400000
*/*  Begin declarations for storage pointed to by above addresses:   */ 07450000
*/*                                                                  */ 07500000
*/********************************************************************/ 07550000
*                                                                       07600000
EFTSI_ECTPARM  DS AL4                    ECT address.                   07650000
*                                        If zero is specified, then     07700000
*                                        the address of the primary     07750000
*                                        ECT is assumed and returned.   07800000
*                                        If X'FFFFFFFF' is entered      07850000
*                                        a new ECT is created and       07900000
*                                        returned.           @PG10120   07950000
EFTSI_RESERVED DS BL.32                  Reserved field      @WA17712   08000000
               DS 0F                     Force a fullword boundary      08050000
*                                                            @PG10209   08100000
EFTSI_TOKEN    DS CL16                   Token passed back to caller.   08150000
*                                          A list of four fullwords.    08200000
*                                                            @PG10209   08250000
             ORG EFTSI_TOKEN                                 @PG10209   08300000
EFTSI_TOKEN1   DS FL4                        1st fullword    @PG10120   08350000
EFTSI_TOKEN2   DS FL4                        2nd fullword    @PG10120   08400000
EFTSI_TOKEN3   DS FL4                        3rd fullword    @PG10120   08450000
EFTSI_TOKEN4   DS FL4                        4th fullword    @PG10120   08500000
*                                                            @PG10120   08550000
EFTSI_ERROR    DS FL4                    Error reason code when         08600000
*                                          IKJEFTSI fails to            08650000
*                                          complete                     08700000
*                                          successfully.     @PG10120   08750000
EFTSI_ABEND    DS BL.32                  Internal error abend code      08800000
*                                         returned to caller @WA17712   08850000
EFTSI_REASON   DS BL.32                  Internal error reason code     08900000
*                                          returned to                  08950000
*                                          caller.           @OW17712   09000000
**/                                                                     09050000
         MEND                                                           09100000
 %PLAS_TSJ: ;                                                           09150000
 /***START OF SPECIFICATIONS******************************************/ 09200000
 /*                                                                  */ 09250000
 /*  MACRO-NAME = IKJEFTSJ                                           */ 09300000
 /*                                                                  */ 09350000
 /*  DESCRIPTIVE-NAME = Mapping for the IKJEFTSI parameter list      */ 09400000
 /*                                                                  */ 09450000
 /*  COPYRIGHT =                                                     */ 09500000
 /*            5685-025 COPYRIGHT (C) IBM CORP. 1990                 */ 09550000
 /*            LICENSED MATERIAL PROGRAM - PROPERTY OF IBM           */ 09600000
 /*            REFER TO COPYRIGHT INSTRUCTIONS FORM NUMBER G120-2083.*/ 09650000
 /*                                                                  */ 09700000
 /* DSECT NAME = IKJEFTSJ                                            */ 09750000
 /*                                                                  */ 09800000
 /* COMPONENT = Scheduler (28502)                                    */ 09850000
 /*                                                                  */ 09900000
 /* EYE-CATCHER = Not applicable                                     */ 09950000
 /*                                                                  */ 10000000
 /* STORAGE ATTRIBUTES =                                             */ 10050000
 /*  SUBPOOL = Determined by the invoker of IKJEFTSI                 */ 10100000
 /*  KEY = 8                                                         */ 10150000
 /*  RESIDENCY = Determined by the invoker of IKJEFTSI               */ 10200000
 /*                                                                  */ 10250000
 /* SIZE = See assembler listing                                     */ 10300000
 /*                                                                  */ 10350000
 /* CREATED BY =                                                     */ 10400000
 /*     Invoker of IKJEFTSI                                          */ 10450000
 /*                                                                  */ 10500000
 /* DELETED BY =                                                     */ 10550000
 /*     Invoker of IKJEFTSI                                          */ 10600000
 /*                                                                  */ 10650000
 /* POINTED TO BY =                                                  */ 10700000
 /*     Register 1 on entry to IKJEFTSI.                             */ 10750000
 /*                                                                  */ 10800000
 /* SERIALIZATION =                                                  */ 10850000
 /*     None required                                                */ 10900000
 /*                                                                  */ 10950000
 /*  FUNCTION = IKJEFTSJ is the mapping macro for the standard       */ 11000000
 /*             parameter list passed to IKJEFTSI via register 1.    */ 11050000
 /*                                                                  */ 11100000
 /*  Register 1                                                      */ 11150000
 /*  +--------+    +--------------+    +-------------+               */ 11200000
 /*  !        !--->!ECTPARM@      !--->!ECTPARM      !               */ 11250000
 /*  +--------+    !--------------!    !-------------!               */ 11300000
 /*                !RESERVED@     !--->!RESERVED     !               */ 11350000
 /*                !--------------!    !-------------!               */ 11400000
 /*                !TOKEN@        !--->!TOKEN        !               */ 11450000
 /*                !--------------!    !-------------!               */ 11500000
 /*                !ERROR@        !--->!ERROR        !               */ 11550000
 /*                !--------------!    !-------------!               */ 11600000
 /*                !ABEND@        !--->!ABEND        !               */ 11650000
 /*                !--------------!    !-------------!               */ 11700000
 /*                !REASON@       !--->!REASON       !               */ 11750000
 /*                +--------------+    +-------------+               */ 11800000
 /*                                                                  */ 11850000
 /*  MACRO-TYPE = Mapping macro                                      */ 11900000
 /*                                                                  */ 11950000
 /*  NOTES = None                                                    */ 12000000
 /*                                                                  */ 12050000
 /*  PROCESSOR = PL/AS                                               */ 12100000
 /*                                                                  */ 12150000
 /*  MACRO-SIZE = See listing                                        */ 12200000
 /*                                                                  */ 12250000
 /*  INVOCATION =                                                    */ 12300000
 /*         %TJPLNEW='1' - - - - - IF DON'T WANT BASED               */ 12350000
 /*         %TJPLBASE='ANY BASE' - IF TJPLNEW ISN'T SPECIFIED,       */ 12400000
 /*                                DEFAULTS TO BASED(TJPLPTR)        */ 12450000
 /*         %INCLUDE SYSLIB(IKJEFTSJ)                                */ 12500000
 /*                                                                  */ 12550000
 /*                                                                  */ 12600000
 /*  CHANGE-ACTIVITY =                                               */ 12650000
 /*                                                                  */ 12700000
 /*  Created for TSO/E 2.2.0                                 @E22D2E9*/ 12750000
 /*  PG10120 - Change parameters such that only the          @PG10120*/ 12800000
 /*            ECTPARM, RESERVED, TOKEN and ERROR parameters @PG10120*/ 12850000
 /*            are the only required parameters.             @PG10120*/ 12900000
 /*                                                                  */ 12950000
 /***END OF SPECIFICATIONS********************************************/ 13000000
 @EJECT;                                                                13050000
 /********************************************************************/ 13100000
 /*                                                                  */ 13150000
 /*  IKJEFTSJ - Parameter List for IKJEFTSI                          */ 13200000
 /*                                                                  */ 13250000
 /********************************************************************/ 13300000
 @SPACE;                                                                13350000
 DECLARE                                                                13400000
  1 IKJEFTSJ                                                            13450000
*%IF TJPLNEW='1' %THEN                                                  13500000
*%GOTO TJPLSKIP1;                                                       13550000
*%IF TJPLBASE='' %THEN                                                  13600000
*%TJPLBASE='BASED(TJPLPTR)';                                            13650000
*           TJPLBASE                                                    13700000
*%TJPLSKIP1:;                                                           13750000
                           BDY(DWORD),                                  13800000
    2 EFTSI_ECTPARM@       PTR(31),   /* Pointer to the                 13850000
                                         ECT address.        @PG10120*/ 13900000
      3 EFTSI_ECTPARM@_HIBIT BIT(1),  /* This bit must                  13950000
                                         be OFF.             @PG10120*/ 14000000
    2 EFTSI_RESERVED@      PTR(31),   /* Pointer to RESERVED @PG10120*/ 14050000
      3 EFTSI_RESERVED@_HIBIT BIT(1), /* End of list         @PG10120*/ 14100000
    2 EFTSI_TOKEN@         PTR(31),   /* Ptr to TOKEN data   @PG10120*/ 14150000
      3 EFTSI_TOKEN@_HIBIT BIT(1),    /* End of list         @PG10120*/ 14200000
    2 EFTSI_ERROR@         PTR(31),   /* Ptr to ERROR data   @PG10120*/ 14250000
      3 EFTSI_ERROR@_HIBIT BIT(1),    /* This bit must                  14300000
                                         be OFF.             @PG10120*/ 14350000
    2 EFTSI_ABEND@         PTR(31),   /* Pointer to ABEND data       */ 14400000
      3 EFTSI_ABEND@_HIBIT BIT(1),    /* Indicates end of list       */ 14450000
    2 EFTSI_REASON@        PTR(31),   /* Pointer to REASON data      */ 14500000
      3 EFTSI_REASON@_HIBIT BIT(1),   /* Indicates end of list       */ 14550000
                                                                        14600000
 /********************************************************************/ 14650000
 /*                                                                  */ 14700000
 /*  Begin declarations for storage pointed to by above addresses:   */ 14750000
 /*                                                                  */ 14800000
 /********************************************************************/ 14850000
                                                                        14900000
    2 EFTSI_ECTPARM        PTR(31),   /* ECT address.                   14950000
                                         If zero is specified, then     15000000
                                         the address of the primary     15050000
                                         ECT is assumed and returned.   15100000
                                         If X'FFFFFFFF' is entered      15150000
                                         a new ECT is created and       15200000
                                         returned.           @PG10120*/ 15250000
    2 EFTSI_RESERVED       BIT(32),   /* Reserved field      @PG10120*/ 15300000
    2 EFTSI_TOKEN,                    /* Token passed back to           15350000
                                           caller.  A list of           15400000
                                           four fullwords:   @PG10120*/ 15450000
      3 EFTSI_TOKEN1       PTR(31),   /*     1st fullword    @PG10120*/ 15500000
      3 EFTSI_TOKEN2       PTR(31),   /*     2nd fullword    @PG10120*/ 15550000
      3 EFTSI_TOKEN3       PTR(31),   /*     3rd fullword    @PG10120*/ 15600000
      3 EFTSI_TOKEN4       PTR(31),   /*     4th fullword    @PG10120*/ 15650000
    2 EFTSI_ERROR          FIXED(31), /* Error reason code when         15700000
                                           IKJEFTSI fails to            15750000
                                           complete                     15800000
                                           successfully.     @PG10120*/ 15850000
    2 EFTSI_ABEND          BIT(32),   /* Internal error abend code      15900000
                                           returned to                  15950000
                                           caller.                   */ 16000000
    2 EFTSI_REASON         BIT(32);   /* Internal error reason code     16050000
                                           returned to                  16100000
                                           caller.           @PG10120*/ 16150000
