*      %GOTO SIBPRO; /*                                                 00010004
       MACRO                                                            00020004
       IKJEGSIB                                                         00030004
**/                                                                     00040004
* %SIBPRO: ;                                                            00050004
*/* START OF SPECIFICATIONS ******************************************/ 00060004
*/*                                                                  */ 00070004
*/*01* PROPRIETARY STATEMENT=                                        */ 00080004
*/***PROPRIETARY_STATEMENT********************************************/ 00090004
*/*                                                                  */ 00100004
*/*                                                                  */ 00110004
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00120004
*/* 5650-ZOS COPYRIGHT IBM CORP. 1982, 2015                          */ 00130004
*/*                                                                  */ 00140004
*/* STATUS= HTE77A0                                                  */ 00150004
*/*                                                                  */ 00160004
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 00170004
*      %GOTO SIBPLS; /*                                                 00180004
*********************************************************************** 00190004
*                                                                     * 00200004
*01* EXTERNAL CLASSIFICATION: NOTPI                                   * 00210004
*01* END OF EXTERNAL CLASSIFICATION:                                  * 00220004
*                                                                     * 00230004
*01* MACRO NAME: IKJEGSIB                                             * 00240004
*                                                                     * 00250004
*01* DESCRIPTIVE NAME: TSO/E TEST Symbol Information Block            * 00260004
*                                                                     * 00270004
*01* DSECT NAME: IKJEGSIB, SIB                                        * 00280004
*                                                                     * 00290004
*01* COMPONENT:  TSO/E TEST (28503)                                   * 00300004
*                                                                     * 00310004
*01* EYE-CATCHER: IKJEGSIB                                            * 00320004
*02*  OFFSET: 0                                                       * 00330004
*02*  LENGTH: 8                                                       * 00340004
*                                                                     * 00350004
*01* STORAGE ATTRIBUTES:                                              * 00360004
*02*  SUBPOOL: 1                                                      * 00370004
*02*  KEY: 8                                                          * 00380004
*02*  RESIDENCY:                                                      * 00390004
*02*  MAIN STORAGE:                                                   * 00400004
*02*  AUXILIARY STORAGE:                                              * 00410004
*02*  VIRTUAL STORAGE:                                                * 00420004
*                                                                     * 00430004
*01* SIZE: IKJEGSIB 24 - bytes                                        * 00440004
*          SIB - 32 bytes                                             * 00450004
*                                                                     * 00460004
*01* CREATED BY: IKJEGSYM                                             * 00470004
*                                                                     * 00480004
*01* POINTED TO BY: SIBNEXT                                           * 00490004
*                                                                     * 00500004
*01* SERIALIZATION: None                                              * 00510004
*                                                                     * 00520004
*01* FUNCTION: This symbol information block is created when TEST     * 00530004
*              tries to resolve a symbol.                             * 00540004
*                                                                     * 00550004
*01* METHOD OF ACCESS:                                                * 00560004
*02*  ASM: USING ON DSECT SIB                                         * 00570004
*                                                                     * 00580004
*02*  PL/X: %INCLUDE SYSLIB(IKJEGSIB)                                 * 00590004
*                                                                     * 00600004
*  IKJEGSIB                                                           * 00610004
*                                                                     * 00620004
*  THIS IS THE DSECT MAPPING FOR A SYMBOL INFORMATION BLOCK BUILT     * 00630004
*     BY IKJEGSYM, THE SYMBOL PROCESSING MODULE OF TSO TEST, AND      * 00640004
*     FREED BY IKJEGMNL, THE TSO TEST MODULE RESPONSIBLE FOR ACQUIRING* 00650004
*     A NEW SUBCOMMAND AND INVOKING THE APPROPRIATE SUBCOMMAND        * 00660004
*     PROCESSOR.  THE CHAIN OF SIBS BUILT FOR A SUBCOMMAND PROCESSOR  * 00670004
*     IS POINTED TO BY THE SICHAIN FIELD OF THE TEST COMMUNICATIONS   * 00680004
*     TABLE, TCOMTAB.                                                 * 00690004
*                                                                     * 00700004
*01* CHANGE ACTIVITY =                                        @E2115KR* 00710004
*                   E2115KR - JBB2115 TSO/E FOR MVS/XA        @E2115KR* 00720004
*                   E1502S6 - HTE21D2 TSO/E RELEASE 5 FOR MVS         * 00730004
*                             SP 3 ARCHITECTURE ENHANCEMENTS. @E1502S6* 00740004
*                                                                     * 00750004
*** END OF SPECIFICATIONS ********************************************* 00760004
*A-000000-999999                                              @E2115KR* 00770004
SIB       DSECT               PREFIX FOR SYMBOL INFORMATION BLOCK       00780004
SIBPREF   DS 0F                  SIB PREFIX                             00790004
SIBID     DS    CL8              SIB IDENTIFIER 'IKJEGSIB'              00800004
SIBPREFL  EQU   (*-SIBPREF)      LENGTH OF SIB PREFIX                   00810004
IKJEGSIB  DSECT               SYMBOL INFORMATION BLOCK                  00820004
SIBSYMAD  DS    A                EQUIVALENT MAIN STORAGE ADDRESS        00830004
SIBTYPE   DS    X                TYPE OF DATA AT THIS LOCATION          00840004
SIBTYPEC  EQU   X'00'            CHARACTER                              00850004
SIBTYPEX  EQU   X'04'            HEXIDECIMAL                            00860004
SIBTYPEB  EQU   X'08'            BINARY                                 00870004
SIBTYPEI  EQU   X'0C'            INSTRUCTION                            00880004
SIBTYPEF  EQU   X'10'            FIXED POINT, FULL WORD                 00890004
SIBTYPEH  EQU   X'14'            FIXED POINT, HALF WORD                 00900004
SIBTYPEE  EQU   X'18'            FLOATING POINT, FULL WORD              00910004
SIBTYPED  EQU   X'1C'            FLOATING POINT, DOUBLE WORD            00920004
SIBTYPEA  EQU   X'20'            ADDRESS CONSTANT, A OR Q FORMAT        00930004
SIBTYPEY  EQU   X'24'            ADDRESS CONSTANT, Y FORMAT             00940004
SIBTYPES  EQU   X'28'            ADDRESS IN BASE-DISPLACEMENT FORMAT    00950004
SIBTYPEP  EQU   X'30'            PACKED DECIMAL                         00960004
SIBTYPEZ  EQU   X'34'            ZONED DECIMAL                          00970004
SIBXTEND  EQU   X'80'            EXTENDED FORMAT SIB           @E1502S6 00980004
SIBMULTP  DS    AL3              MULTIPLICITY FACTOR                    00990004
SIBSTLTH  DS    H                LENGTH OF STORAGE RESERVED             01000004
SIBRSVD1  DS    H                RESERVED                               01010004
SIBNEXT   DS    A                POINTER TO NEXT SIB                    01020004
SIBLTHO   EQU   (*-IKJEGSIB)+SIBPREFL  SIB AND PREFIX LENGTH   @E1502S6 01030004
SIBXTNT1  DS    CL8              SIB EXTENSION                 @E1502S6 01040004
          ORG   SIBXTNT1                                       @E1502S6 01050004
SIBXLEN   DS    H                LENGTH OF THE SIB IN STORAGE  @E1502S6 01060004
SIBXVER   DS    X                SIB VERSION NUMBER            @E1502S6 01070004
SIBTYPE2  DS    X                TYPE OF DATA AT LOCATION      @E1502S6 01080004
SIBALET   DS    F                ALET ASSOCIATED WITH SYMBOL   @E1502S6 01090004
SIBLENTH  EQU   (*-IKJEGSIB)+SIBPREFL  EXTENDED SIB AND PREFIX LENGTH   01100004
*                                                              @E1502S6 01110004
SIBVERSC  EQU   X'01'            SIB VERSION NUMBER CONSTANT   @E1502S6 01120004
          MEND                                                          01130004
**/                                                                     01140004
* %SIBPLS: ;                                                            01150004
*/********************************************************************/ 01160004
*/*                                                                   */01170004
*/* IKJEGSIB --                                                       */01180004
*/*                                                                   */01190004
*/* THIS IS THE DSECT MAPPING FOR A SYMBOL INFORMATION BLOCK BUILT    */01200004
*/*  BY IKJEGSYM, THE SYMBOL PROCESSING MODULE OF TSO TEST, AND       */01210004
*/*  FREED BY IKJEGMNL, THE TSO TEST MODULE RESPONSIBLE FOR ACQUIRING */01220004
*/*  A NEW SUBCOMMAND AND INVOKING THE APPROPRIATE SUBCOMMAND         */01230004
*/*  PROCESSOR.  THE CHAIN OF SIBS BUILT FOR A SUBCOMMAND PROCESSOR   */01240004
*/*  IS POINTED TO BY THE SICHAIN FIELD OF THE TEST COMMUNICATIONS    */01250004
*/*  TABLE, TCOMTAB.                                                  */01260004
*/*                                                                   */01270004
*/* LENGTH -- 32 BYTES                                       @E1502S6*/ 01280004
*/*                                                                  */ 01290004
*/* CHANGE ACTIVITY --                                       @E2115KR*/ 01300004
*/*                 E2115KR - JBB2115 TSO/E FOR MVS/XA       @E2115KR*/ 01310004
*/*                 E1502S6 - HTE21D2 TSO/E RELEASE 5 FOR MVS        */ 01320004
*/*                          SP 3 ARCHITECTURE ENHANCEMENTS. @E1502S6*/ 01330004
*/*                                                                  */ 01340004
*/*                                                                  */ 01350004
*/********************************************************************/ 01360004
*/*A-000000-999999                                            @E2115KR*/01370004
* DCL 1 IKJEGSIB BASED(SIBPTR),/* INFORMATION ABOUT RESOLVED SYMBOL   */01380004
*       2 SIBSYMAD PTR(31),    /*   EQUIVALENT MAIN STORAGE ADDRESS   */01390004
*       2 SIBTYPE  BIT(8),     /*   TYPE OF DATA AT THIS LOCATION     */01400004
*       2 SIBMULTP FIXED(24),  /*   MULTIPLICITY FACTOR               */01410004
*       2 SIBSTLTH FIXED(15),  /*   LENGTH OF STORAGE RESERVED        */01420004
*       2 SIBRSVD1 BIT(16),    /*   RESERVED                          */01430004
*       2 SIBNEXT  PTR(31),    /*   POINTER TO NEXT SIB               */01440004
*       2 SIBXTNT1,            /*  SIB EXTENSION              @E1502S6*/01450004
*         3 SIBXLEN  FIXED(16),  /*   LENGTH OF THE SIB       @E1502S6*/01460004
*         3 SIBXVER  FIXED(8),   /*   SIB VERSION NUMBER      @E1502S6*/01470004
*         3 SIBTYPE2 BIT(8),     /*   TYPE OF DATA            @E1502S6*/01480004
*         3 SIBALET  FIXED(32);  /*   ALET ASSOCIATED WITH SYMBOL       01490004
*                                                             @E1502S6*/01500004
*                                                                       01510004
* DCL 1 SIB CHAR(*) BASED(ADDR(IKJEGSIB)-SIBPREFL), /* NAME FOR ENTIRE  01520004
*                                                                SIB */ 01530004
*       2 SIBPREF,             /* SIB PREFIX                         */ 01540004
*         3 SIBID CHAR(8),     /* SIB IDENTIFIER 'IKJEGSIB'          */ 01550004
*       2 * CHAR(LENGTH(IKJEGSIB));  /* MAIN PART OF SIB             */ 01560004
*                                                                       01570004
* DCL SIBLENTH FIXED(31) CONSTANT(LENGTH(IKJEGSIB)+LENGTH(SIBPREF)); /* 01580004
*                                   LENGTH OF SIB & PREFIX    @E1502S6*/01590004
*                                                                       01600004
* DCL SIBLTHO FIXED(31) CONSTANT(LENGTH(IKJEGSIB)+LENGTH(SIBPREF)       01610004
*                             -LENGTH(SIBXTNT1)); /* SIB LENGTH AND     01620004
*                                   PREFIX MINUS EXTENSION    @E1502S6*/01630004
*                                                                       01640004
* DCL SIBVERSC FIXED(8) CONSTANT(1); /* SIB VERSION NUMBER              01650004
*                                   CONSTANT                  @E1502S6*/01660004
*                                                                       01670004
* DCL SIBPREFL FIXED(31) INIT(LENGTH(SIBPREF)); /* LENGTH SIB PREFIX  */01680004
*                                                                       01690004
* DCL SIBPTR PTR(31);          /* POINTER TO IKJEGSIB                 */01700004
*           /*    VALUES FOR SIBTYPE                                  */01710004
* DCL SIBTYPEC BIT(8) CONSTANT('00'X); /* CHARACTER                   */01720004
* DCL SIBTYPEX BIT(8) CONSTANT('04'X); /* HEXIDECIMAL                 */01730004
* DCL SIBTYPEB BIT(8) CONSTANT('08'X); /* BINARY                      */01740004
* DCL SIBTYPEI BIT(8) CONSTANT('0C'X); /* INSTRUCTION                 */01750004
* DCL SIBTYPEF BIT(8) CONSTANT('10'X); /* FIXED POINT, FULL WORD      */01760004
* DCL SIBTYPEH BIT(8) CONSTANT('14'X); /* FIXED POINT, HALF WORD      */01770004
* DCL SIBTYPEE BIT(8) CONSTANT('18'X); /* FLOATING POINT, FULL WORD   */01780004
* DCL SIBTYPED BIT(8) CONSTANT('1C'X); /* FLOATING POINT, DOUBLE WORD */01790004
* DCL SIBTYPEA BIT(8) CONSTANT('20'X); /* ADDRESS CONSTANT, A OR Q FMT*/01800004
* DCL SIBTYPEY BIT(8) CONSTANT('24'X); /* ADDRESS CONSTANT, Y FORMAT  */01810004
* DCL SIBTYPES BIT(8) CONSTANT('28'X); /* ADDRESS: BASE-DISPLACEMENT  */01820004
* DCL SIBTYPEP BIT(8) CONSTANT('30'X); /* PACKED DECIMAL              */01830004
* DCL SIBTYPEZ BIT(8) CONSTANT('34'X); /* ZONED DECIMAL               */01840004
* DCL SIBXTEND BIT(8) CONSTANT('80'X); /* EXTENDED FORMAT SIB @E1502S6*/01850004
