*/***PROPRIETARY_STATEMENT***************************************@N1A*/ 00041600
*/*                                                                  */ 00083200
*/* Licensed Materials - Property of IBM                             */ 00124800
*/*                                                                  */ 00166400
*/* 5645-001                                                         */ 00208000
*/*                                                                  */ 00249600
*/* (C) Copyright IBM Corp. 1997                                     */ 00291200
*/*                                                                  */ 00332800
*/* US Government Users Restricted Rights - Use, duplication or      */ 00374400
*/* disclosure restricted by GSA ADP Schedule Contract with          */ 00416000
*/* IBM Corp.                                                        */ 00457600
*/*                                                                  */ 00499200
*/* STATUS = HTE26D2                                                 */ 00540800
*/*                                                                  */ 00582400
*/***END_OF_PROPRIETARY_STATEMENT********************************@N1A*/ 00624000
*/*                                                                  */ 00665600
*/* CHANGE ACTIVITY                                                  */ 00707200
*/*                                                                  */ 00748800
*/* FLAG REASON   RELEASE DATE     ORIGIN                        @N1A*/ 00790400
*/* ---- ------   ------- -------- ------                        @N1A*/ 00832000
*/* $N1= COPYRITE HTE26D2 19970218 VOHS: Insert/Update Copyright @N1A*/ 00873600
*/*                                                                  */ 00915200
*/***************************************************************@N1A*/ 00956800
         MACRO                                                          01000020
         IKJEBEST &CSECT=IBM                                            02000020
         LCLA  &A,&B,&C,&D,&E                                           03000020
         LCLA  &F                                                A42956 03050000
         LCLC  &CNAME,&SCNAME,&ABBR,&LDMOD,&LABEL,&LABEL1,&LABEL2,&NMBR 04000020
.*A035000,185000,230600-239000,255000                            A42956 04050000
         AIF   ('&CSECT' NE 'IBM').CONT0                                05000020
&CNAME   SETC  'IKJEBMA8'     DEFINE CSECT NAME FOR IBM TABLE.          06000020
IKJEBMA8 CSECT                                                          07000020
         ENTRY MA8IP002                                                 08000020
         ENTRY MA8LI002                                                 09000020
         AGO   .CONT1                                                   10000020
.CONT0   ANOP                                                           11000020
         AIF   ('&CSECT' NE 'USER').ERROR2                              12000020
&CNAME   SETC  'IKJEBMA9'     DEFINE CSECT NAME FOR USER TABLE.         13000020
IKJEBMA9 CSECT                                                          14000020
.CONT1   ANOP                                                           15000020
&A       SETA  N'&SYSLIST                                               16000020
         AIF   (&A EQ 0).END                                            17000020
&B       SETA  1                                                        18000020
&F       SETA  1                                                 A42956 18050000
.CONT2   ANOP                                                           19000020
&C       SETA  N'&SYSLIST(&B)                                           20000020
         AIF   (&C LT 2 OR &C GT 3).ERROR1                              21000020
&E       SETA  K'&SYSLIST(&B,&C)                                        22000020
&D       SETA  &E-1                                                     23000020
.*  THE FOLLOWING FLAGED INSTRUCTIONS WERE ADDED TO PROVIDE      A42956 23050000
.*  UNIQUE LABELS, EVEN IF MODULES HAVE IDENTICAL LAST TWO       A42956 23100000
.*  CHARACTERS IN ENTRY POINT NAMES.  THE LABELS FOR MODULES     A42956 23150000
.*  IKJEBELI AND IKJEBEIP ARE UNCHANGED, SINCE THEY ARE          A42956 23200000
.*  REFERENCED WITHIN IKJEBEMA.                                  A42956 23250000
         AIF   ('&CSECT' NE 'IBM').CONT10                        A42956 23300000
         AIF   ('&SYSLIST(&B,&C)'(&D,&E) EQ 'LI' OR                    X23350000
                '&SYSLIST(&B,&C)'(&D,&E) EQ 'IP' ).CONT11        A42956 23400000
.CONT10  ANOP                                                    A42956 23450000
&LABEL1  SETC  '&CNAME'(6,8).'@'.'&F'                            A42956 23500000
&F       SETA  &F+1                                              A42956 23550000
&LABEL2  SETC  '&CNAME'(6,8).'@'.'&F'                            A42956 23600000
&F       SETA  &F+1                                              A42956 23650000
         AGO   .CONT12                                           A42956 23700000
.CONT11  ANOP                                                    A42956 23750000
&LABEL1  SETC  '&CNAME'(6,8).'&SYSLIST(&B,&C)'(&D,&E).'001'             24000020
&LABEL2  SETC  '&CNAME'(6,8).'&SYSLIST(&B,&C)'(&D,&E).'002'             25000020
.CONT12  ANOP                                                    A42956 25050000
&SCNAME  SETC  '&SYSLIST(&B,1)'                                         26000020
         SPACE 2                                                        27000020
         DC    AL1(&LABEL1-*-1) LENGTH OF SUBCOMMAND NAME.              28000020
         DC    C'&SCNAME' SUBCOMMAND NAME.                              29000020
&LABEL1  EQU   *                                                        30000020
         DC    AL1(&LABEL2-*-1) LENGTH OF ABBREVIATION.                 31000020
         AIF   (K'&SYSLIST(&B,2) EQ 0).CONT5                            32000020
&ABBR    SETC '&SYSLIST(&B,2)'                                          33000020
         DC    C'&ABBR' ABBREVIATION FOR SUBCOMMAND.                    34000020
.CONT5   ANOP                                                           35000020
&LABEL2  EQU   *                                                        36000020
&LDMOD   SETC  '&SYSLIST(&B,&C)'                                        37000020
         DC    CL8'&LDMOD' LOAD MODULE NAME.                            38000020
         AIF   (&B EQ &A).END                                           39000020
&B       SETA  &B+1                                                     40000020
         AGO   .CONT2                                                   41000020
.END     ANOP                                                           42000020
         SPACE 2                                                        43000020
         DC    AL1(255)       END OF TABLE MARKER.                      44000020
         MEXIT                                                          45000020
.ERROR1  MNOTE 12,'INVALID TABLE ENTRY'                                 46000020
         MEXIT                                                          47000020
.ERROR2  MNOTE 12,'INVALID KEYWORD VALUE'                               48000020
         MEND                                                           49000020
