         MACRO                                                          00020000
&LABEL   IKJIDENT &TYPNAM,&OPTION,&OPTION2,&OPTION3,&OPTION4,&OPTION5, *00030000
               &OPTION6,&OPTION7,&OPTION8,&FIRST=ALPHA,&OTHER=,        *00030500
               &PROMPT=,&DEFAULT=,&MAXLNTH=,&HELP=,&VALIDCK=            00031000
.**01* PROPRIETARY STATEMENT=                                         * 00031101
.* **PROPRIETARY_STATEMENT********************************************* 00031201
.*                                                                    * 00031301
.*                                                                    * 00031401
.*  LICENSED MATERIALS - PROPERTY OF IBM                              * 00031501
.*  5650-ZOS COPYRIGHT IBM CORP. 1981, 2013                           * 00031601
.*                                                                    * 00031701
.*  STATUS= HTE7790                                                   * 00031801
.*                                                                    * 00031901
.* **END_OF_PROPRIETARY_STATEMENT************************************** 00032001
.*                                                                      00032101
.**01* EXTERNAL CLASSIFICATION: PI                                 @L1A 00032201
.**01* END OF EXTERNAL CLASSIFICATION:                             @L1A 00032301
.*                                                                      00032401
.*                                                                      00032501
.*  TITLE - IKJIDENT MACRO (SYMBOLIC DEBUG PROJECT)            @E2115KD 00033200
.*                                                             @E2115KD 00033300
.*  FUNCTION - THE IKJIDENT MACRO IS USED BY COMMAND           @E2115KD 00033400
.*             PROCESSORS TO DEFINE TO PARSE THE EXPECTED      @E2115KD 00033500
.*             FORMAT OF POSITIONAL PARAMETERS WHICH DO NOT    @E2115KD 00034000
.*             DEPEND UPON A PARTICULAR DELIMITER FOR          @E2115KD 00034500
.*             SYNTACTICAL DEFINITION.                         @E2115KD 00035000
.*                                                                      00035500
.*                                                                      00041001
.*  INPUT - THE PROTOTYPE STATEMENT IS AS DEFINED ABOVE. ITS   @E2115KD 00042500
.*          PARAMETERS REPRESENT THE FOLLOWING:                @E2115KD 00043000
.*             &LABEL - STATEMENT LABEL IS REQUIRED            @E2115KD 00043500
.*             &TYPNAM - A PARAMETER TYPE IS REQUIRED          @E2115KD 00044000
.*             &OPTION - POSITIONAL PARAMETERS TO SPECIFY      @E2115KD 00044500
.*                       OPTIONS ON THE IKJIDENT MACRO         @E2115KD 00045000
.*             &FIRST - SPECIFIES THE CHARACTER TYPE           @E2115KD 00045500
.*                      RESTRICTION ON THE FIRST CHARACTER     @E2115KD 00046000
.*                      OF THE STRING                          @E2115KD 00046500
.*             &OTHER - SPECIFIES THE CHARACTER TYPE           @E2115KD 00047000
.*                      RESTRICTION ON THE CHARACTERS OF THE   @E2115KD 00047500
.*                      STRING OTHER THAN THE FIRST CHARACTER  @E2115KD 00048000
.*             &PROMPT - SUPPLIES DATA TO BE USED IF PROMPTING @E2115KD 00048500
.*                       FOR A MISSING PARAMETER               @E2115KD 00049000
.*             &DEFAULT - SUPPLIES PARAMETER TO BE USED IF     @E2115KD 00049500
.*                        THE PARAMETER IS NOT USED            @E2115KD 00050000
.*             &HELP - SUPPLIES SECOND LEVEL MESSAGES          @E2115KD 00050500
.*             &VALIDCK - SPECIFIES THE ADDRESS OF A USER      @E2115KD 00051000
.*                        SUPPLIED VALIDITY CHECK EXIT         @E2115KD 00051500
.*                        ROUTINE                              @E2115KD 00052000
.*             &MAXLNTH - THE MAXIMUM NUMBER OF CHARACTERS     @E2115KD 00052500
.*                        THE STRING MAY CONTAIN               @E2115KD 00053000
.*                                                             @E2115KD 00053500
.* OUTPUT - THIS MACRO PRODUCES A PARAMETER CONTROL ENTRY      @E2115KD 00054000
.*          (PCE) TO BE PASSED TO THE PARSE SERVICE ROUTINE.   @E2115KD 00054500
.*          IF AN ERROR IS ENCOUNTERED IN PROCESSING THE       @E2115KD 00055000
.*          MACRO INSTRUCTION ENTERED BY THE CP, AN            @E2115KD 00055500
.*          APPROPRIATE ERROR MESSAGE IS PRINTED AND THE PCE   @E2115KD 00056000
.*          IS NOT GENERATED.                                  @E2115KD 00056500
.*                                                             @E2115KD 00057000
.*   CHANGE ACTIVITY --                                        @E2115KD 00057101
.*                   E2115KD - JBB2115 TSO/E FOR MVS/XA        @E2115KD 00057201
.*                                                                      00057301
.* FLAG REASON   RELEASE DATE     ORIGIN                           @L1A 00057401
.* ---- ------   ------- -------- ------                           @L1A 00057501
.* $L1= MG08414  HTE7790 120619   MPK: ALLOW FOR USE WITHIN RSECT  @L1A 00057601
.*                                                                      00057700
.********************************************************************** 00058500
         GBLC  &IKJCSNM,&IKJDSNM                                        00060000
         LCLA  &FRSTCHR,&MAXLG,&OTHRCHR,&T,&PDESIZE,&END                00070000
         LCLB  &FLIST,&FRANGE,&FASIS,&FASTRIK,&FPRPT,&FDFLT,&FPTBYPS    00080000
         LCLB  &FINTEG,&FCHAR,&FHEX,&FINTEG2,&FASIS1,&FASIS2            00085000
         LCLB  &FHELP,&FVALID,&FMAXLG,&FENDBIT,&FOTHER                  00090000
         LCLB  &FLIST1,&FLIST2,&FRANGE1,&FRANGE2,&FASTRK1,&FASTRK2      00093300
         LCLB  &FCHAR1,&FCHAR2,&FHEX1,&FHEX2,&FPTBYP1,&FPTBYP2,&FINTEG1 00096600
         LCLC  &BADFRST,&QUOTE                                          00100000
&FENDBIT SETB  0                                                        00110000
         AIF   (N'&SYSLIST LT 8).GOOD                                   00120000
         MNOTE 8,'NO MORE THAN 7 POSITIONAL PARAMETERS ALLOWED'         00130000
.GOOD    AIF   ('&TYPNAM' EQ 'LIST' OR '&TYPNAM' EQ 'RANGE').BAD        00140000
         AIF   ('&TYPNAM' EQ 'CHAR' OR '&TYPNAM' EQ 'HEX'              *00143300
               OR '&TYPNAM' EQ 'INTEG').BAD                             00146600
         AIF   ('&TYPNAM' NE 'UPPERCASE' AND '&TYPNAM' NE 'ASIS'       *00150000
               AND '&TYPNAM' NE 'ASTERISK' AND '&TYPNAM' NE 'MAXLNTH'  *00160000
               AND '&TYPNAM' NE '' AND '&TYPNAM' NE 'PTBYPS').GOOD1     00170000
.BAD     MNOTE 8,'PARAMETER TYPE NAME MISSING BUT REQUIRED'             00180000
&FENDBIT SETB  1                                                        00190000
.GOOD1   ANOP                                                           00200000
         AIF   ('&IKJCSNM' NE '').GOOD2                                 00210000
         MNOTE 8,'CSECT NAME (FROM IKJPARM MACRO LABEL) IS MISSING'     00220000
&FENDBIT SETB  1                                                        00230000
.GOOD2   ANOP                                                           00240000
         AIF   ('&LABEL' NE '').GOOD3                                   00250000
         MNOTE 8,'STATEMENT LABEL MISSING BUT REQUIRED'                 00260000
&FENDBIT SETB  1                                                        00270000
.GOOD3   ANOP                                                           00280000
&FLIST1  SETB  ('&OPTION' EQ 'LIST' OR '&OPTION2' EQ 'LIST' OR         *00290000
               '&OPTION3' EQ 'LIST' OR '&OPTION4' EQ 'LIST'            *00300000
               OR '&OPTION5' EQ 'LIST' OR '&OPTION6' EQ 'LIST')         00305000
&FLIST2  SETB  ('&OPTION7' EQ 'LIST' OR '&OPTION8' EQ 'LIST')           00310000
&FRANGE1 SETB  ('&OPTION' EQ 'RANGE' OR '&OPTION2' EQ 'RANGE' OR       *00315000
               '&OPTION3' EQ 'RANGE' OR '&OPTION4' EQ 'RANGE'          *00320000
               OR '&OPTION5' EQ 'RANGE' OR '&OPTION6' EQ 'RANGE')       00325000
&FRANGE2 SETB  ('&OPTION7' EQ 'RANGE' OR '&OPTION8' EQ 'RANGE')         00330000
&FASTRK1 SETB  ('&OPTION' EQ 'ASTERISK' OR '&OPTION2' EQ 'ASTERISK' OR *00335000
               '&OPTION3' EQ 'ASTERISK' OR '&OPTION4' EQ 'ASTERISK'    *00340000
               OR '&OPTION5' EQ 'ASTERISK' OR '&OPTION6' EQ 'ASTERISK') 00345000
&FASTRK2 SETB  ('&OPTION7' EQ 'ASTERISK' OR '&OPTION8' EQ 'ASTERISK')   00350000
&FASIS1   SETB  ('&OPTION' EQ 'ASIS' OR '&OPTION2' EQ 'ASIS' OR        *00355000
               '&OPTION3' EQ 'ASIS' OR '&OPTION4' EQ 'ASIS'            *00360000
               OR '&OPTION5' EQ 'ASIS' OR '&OPTION6' EQ 'ASIS')         00360100
&FASIS2   SETB  ('&OPTION7' EQ 'ASIS' OR '&OPTION8' EQ 'ASIS')          00360200
&FCHAR1   SETB  ('&OPTION' EQ 'CHAR' OR '&OPTION2' EQ 'CHAR' OR        *00360300
               '&OPTION3' EQ 'CHAR' OR '&OPTION4' EQ 'CHAR'            *00360400
               OR '&OPTION5' EQ 'CHAR' OR '&OPTION6' EQ 'CHAR')         00360500
&FCHAR2   SETB  ('&OPTION7' EQ 'CHAR' OR '&OPTION8' EQ 'CHAR')          00360600
&FHEX1    SETB  ('&OPTION' EQ 'HEX' OR '&OPTION2' EQ 'HEX' OR          *00360700
               '&OPTION3' EQ 'HEX' OR '&OPTION4' EQ 'HEX'              *00360800
               OR '&OPTION5' EQ 'HEX' OR '&OPTION6' EQ 'HEX')           00360900
&FHEX2 SETB  ('&OPTION7' EQ 'HEX' OR '&OPTION8' EQ 'HEX')               00361000
&FINTEG1   SETB  ('&OPTION' EQ 'INTEG' OR '&OPTION2' EQ 'INTEG' OR     *00361100
               '&OPTION3' EQ 'INTEG' OR '&OPTION4' EQ 'INTEG'          *00361200
               OR '&OPTION5' EQ 'INTEG' OR '&OPTION6' EQ 'INTEG')       00361300
&FINTEG2 SETB  ('&OPTION7' EQ 'INTEG' OR '&OPTION8' EQ 'INTEG')         00361400
&FPTBYP1 SETB  ('&OPTION' EQ 'PTBYPS' OR '&OPTION2' EQ 'PTBYPS' OR     *00361500
               '&OPTION3' EQ 'PTBYPS' OR '&OPTION4' EQ 'PTBYPS'        *00363000
               OR '&OPTION5' EQ 'PTBYPS' OR '&OPTION6' EQ 'PTBYPS')     00365300
&FPTBYP2 SETB  ('&OPTION7' EQ 'PTBYPS' OR '&OPTION8' EQ 'PTBYPS')       00367600
         AIF   ('&OPTION' EQ '' OR '&OPTION' EQ 'LIST' OR '&OPTION'    *00370000
               EQ 'RANGE' OR '&OPTION' EQ 'ASIS' OR '&OPTION' EQ       *00370600
               'UPPERCASE' OR '&OPTION' EQ 'ASTERISK').OPT1             00371200
        AIF   ('&OPTION' EQ 'PTBYPS' OR '&OPTION' EQ 'CHAR').OPT1       00371800
        AIF   ('&OPTION' EQ 'HEX' OR '&OPTION' EQ 'INTEG').OPT1         00372400
         MNOTE 8,'''&OPTION'' IS AN INVALID POSITIONAL PARAMETER'       00373000
&FENDBIT SETB  1                                                        00374000
.OPT1    AIF   ('&OPTION2' EQ '' OR '&OPTION2' EQ 'LIST' OR '&OPTION2' *00375000
               EQ 'RANGE' OR '&OPTION2' EQ 'ASIS' OR '&OPTION2' EQ     *00376000
               'UPPERCASE' OR '&OPTION2' EQ 'ASTERISK').OPT2            00378000
         AIF   ('&OPTION2' EQ 'PTBYPS' OR '&OPTION2' EQ 'CHAR').OPT2    00378300
         AIF   ('&OPTION2' EQ 'HEX' OR '&OPTION2' EQ 'INTEG').OPT2      00378600
         MNOTE 8,'''&OPTION2'' IS AN INVALID POSITIONAL PARAMETER'      00379000
&FENDBIT SETB  1                                                        00379100
.OPT2    AIF   ('&OPTION3' EQ '' OR '&OPTION3' EQ 'LIST' OR '&OPTION3' *00379200
               EQ 'RANGE' OR '&OPTION3' EQ 'ASIS' OR '&OPTION3' EQ     *00379300
               'UPPERCASE' OR '&OPTION3' EQ 'ASTERISK').OPT3            00379500
         AIF   ('&OPTION3' EQ 'PTBYPS' OR '&OPTION3' EQ 'CHAR').OPT3    00379600
         AIF   ('&OPTION3' EQ 'HEX' OR '&OPTION3' EQ 'INTEG').OPT3      00379700
         MNOTE 8,'''&OPTION3'' IS AN INVALID POSITIONAL PARAMETER'      00379900
&FENDBIT SETB  1                                                        00380000
.OPT3    AIF   ('&OPTION4' EQ '' OR '&OPTION4' EQ 'LIST' OR '&OPTION4' *00380100
               EQ 'RANGE' OR '&OPTION4' EQ 'ASIS' OR '&OPTION4' EQ     *00380400
               'UPPERCASE' OR '&OPTION4' EQ 'ASTERISK').OPT4            00380500
         AIF   ('&OPTION4' EQ 'PTBYPS' OR '&OPTION4' EQ 'CHAR').OPT4    00380600
         AIF   ('&OPTION4' EQ 'HEX' OR '&OPTION4' EQ 'INTEG').OPT4      00380700
         MNOTE 8,'''&OPTION4'' IS AN INVALID POSITIONAL PARAMETER'      00380900
&FENDBIT SETB  1                                                        00381000
.OPT4    AIF   ('&OPTION5' EQ '' OR '&OPTION5' EQ 'LIST' OR '&OPTION5' *00381100
               EQ 'RANGE' OR '&OPTION5' EQ 'ASIS' OR '&OPTION5' EQ     *00381200
               'UPPERCASE' OR '&OPTION5' EQ 'ASTERISK').OPT5            00381300
         AIF   ('&OPTION5' EQ 'PTBYPS' OR '&OPTION5' EQ 'CHAR').OPT5    00381400
         AIF   ('&OPTION5' EQ 'HEX' OR '&OPTION5' EQ 'INTEG').OPT5      00381500
         MNOTE 8,'''&OPTION5'' IS AN INVALID POSITIONAL PARAMETER'      00381600
 &FENDBIT SETB  1                                                       00381700
.OPT5    AIF   ('&OPTION6' EQ '' OR '&OPTION6' EQ 'LIST' OR '&OPTION6' *00381800
               EQ 'RANGE' OR '&OPTION6' EQ 'ASIS' OR '&OPTION6' EQ     *00381900
               'UPPERCASE' OR '&OPTION6' EQ 'ASTERISK').OPT6            00382000
          AIF   ('&OPTION6' EQ 'PTBYPS' OR '&OPTION6' EQ 'CHAR').OPT6   00382100
          AIF   ('&OPTION6' EQ 'HEX' OR '&OPTION6' EQ 'INTEG').OPT6     00382200
         MNOTE 8,'''&OPTION6'' IS AN INVALID POSITIONAL PARAMETER'      00382300
&FENDBIT SETB  1                                                        00382400
.OPT6   AIF   ('&OPTION7' EQ '' OR '&OPTION7' EQ 'LIST' OR '&OPTION7'  *00382500
               EQ 'RANGE' OR '&OPTION7' EQ 'ASIS' OR '&OPTION7' EQ     *00382600
               'UPPERCASE' OR '&OPTION7' EQ 'ASTERISK').OPT7            00382700
         AIF   ('&OPTION7' EQ 'PTBYPS' OR '&OPTION7' EQ 'CHAR').OPT7    00382800
         AIF   ('&OPTION7' EQ 'HEX' OR '&OPTION7' EQ 'INTEG').OPT7      00382900
         MNOTE 8,'''&OPTION7'' IS AN INVALID POSITIONAL PARAMETER'      00383000
&FENDBIT SETB  1                                                        00383100
.OPT7   AIF   ('&OPTION8' EQ '' OR '&OPTION8' EQ 'LIST' OR '&OPTION8'  *00383200
               EQ 'RANGE' OR '&OPTION8' EQ 'ASIS' OR '&OPTION8' EQ     *00383300
               'UPPERCASE' OR '&OPTION8' EQ 'ASTERISK').OPT8            00383400
         AIF   ('&OPTION8' EQ 'PTBYPS' OR '&OPTION8' EQ 'CHAR').OPT8    00383500
         AIF   ('&OPTION8' EQ 'HEX' OR '&OPTION8' EQ 'INTEG').OPT8      00383600
         MNOTE 8,'''&OPTION8'' IS AN INVALID POSITIONAL PARAMETER'      00383700
&FENDBIT SETB  1                                                        00383800
.OPT8    AIF   (('&OPTION' EQ 'UPPERCASE' OR '&OPTION2' EQ             *00383900
               'UPPERCASE' OR '&OPTION3' EQ 'UPPERCASE' OR '&OPTION4'  *00384000
               EQ 'UPPERCASE') AND &FASIS).ERROR0                       00384100
         AIF   (('&OPTION5' EQ 'UPPERCASE') AND &FASIS).ERROR0          00384200
         AIF   (('&OPTION6' EQ 'UPPERCASE') AND &FASIS).ERROR0          00384300
         AIF   (('&OPTION7' EQ 'UPPERCASE') AND &FASIS).ERROR0          00384400
         AIF   (('&OPTION8' EQ 'UPPERCASE') AND &FASIS).ERROR0          00384500
       AIF (('&OPTION' EQ 'CHAR' OR '&OPTION2' EQ 'CHAR' OR '&OPTION3' *00384600
               EQ 'CHAR' OR '&OPTION4' EQ 'CHAR' OR '&OPTION5'         *00384700
               EQ 'CHAR' OR '&OPTION6' EQ 'CHAR') AND &FHEX).ERROR1     00384800
        AIF  (('&OPTION7' EQ 'CHAR' OR '&OPTION8'  EQ 'CHAR')          *00384900
               AND &FHEX).ERROR1                                        00385000
         AIF (('&OPTION' EQ 'HEX' OR '&OPTION2' EQ 'HEX' OR '&OPTION3' *00385100
               EQ 'HEX' OR '&OPTION4' EQ 'HEX' OR '&OPTION5' EQ 'HEX'  *00385200
               OR '&OPTION6' EQ 'HEX') AND &FINTEG).ERROR2              00385300
          AIF  (('&OPTION7' EQ 'HEX' OR '&OPTION8'  EQ 'HEX')          *00385400
               AND &FINTEG).ERROR2                                      00385500
     AIF (('&OPTION' EQ 'INTEG' OR '&OPTION2' EQ 'INTEG' OR '&OPTION3' *00385600
               EQ 'INTEG' OR '&OPTION4' EQ 'INTEG' OR '&OPTION5' EQ    *00385700
               'INTEG' OR '&OPTION6' EQ 'INTEG') AND &FCHAR).ERROR3     00385800
      AIF  (('&OPTION7' EQ 'INTEG' OR '&OPTION8'  EQ 'INTEG')          *00385900
               AND &FCHAR).ERROR3                                       00386000
        AGO .A0                                                         00386100
.ERROR0  MNOTE 8,'BOTH ''UPPERCASE'' AND ''ASIS'' CANNOT BE SPECIFIED'  00386200
&FENDBIT  SETB  1                                                       00386300
         AGO  .A0                                                       00386400
.ERROR1  MNOTE 8,'BOTH ''CHAR'' AND ''HEX'' CANNOT BE SPECIFIED'        00386500
&FENDBIT  SETB  1                                                       00386600
         AGO  .A0                                                       00386700
.ERROR2  MNOTE 8,'BOTH ''INTEG'' AND ''HEX'' CANNOT BE SPECIFIED'       00386800
&FENDBIT SETB  1                                                        00386900
         AGO  .A0                                                       00387000
.ERROR3  MNOTE 8,'BOTH ''INTEG'' AND ''CHAR'' CANNOT BE SPECIFIED'      00387100
&FENDBIT SETB  1                                                        00387200
.A0      ANOP                                                           00387300
&FPRPT   SETB  ('&PROMPT' NE '')                                        00387400
&FDFLT   SETB  ('&DEFAULT' NE '')                                       00390000
&FHELP   SETB  ('&HELP' NE '')                                          00400000
&FVALID  SETB  ('&VALIDCK' NE '')                                       00410000
&FOTHER  SETB  ('&OTHER' NE '')                                         00420000
&FMAXLG  SETB  ('&MAXLNTH' NE '')                                       00430000
         AIF   (NOT(&FDFLT AND &FPRPT)).GOOD4                           00440000
         MNOTE 8,'PARAMETER CANNOT BOTH DEFAULT AND REQUIRE PROMPTING'  00450000
&FENDBIT SETB  1                                                        00460000
.GOOD4   ANOP                                                           00470000
         AIF   (&FLIST1 OR &FLIST2).LISTSET                             00470200
&FLIST   SETB  0                                                        00470400
         AGO   .RNGE                                                    00470600
.LISTSET ANOP                                                           00470800
&FLIST   SETB  1                                                        00471000
.RNGE    AIF   (&FRANGE1 OR &FRANGE2).RNGESET                           00471200
&FRANGE  SETB  0                                                        00471400
         AGO   .ASTRK                                                   00471600
.RNGESET ANOP                                                           00471800
&FRANGE  SETB  1                                                        00472000
.ASTRK   AIF   (&FASTRK1 OR &FASTRK2).ASTSET                            00472200
&FASTRIK SETB  0                                                        00472400
         AGO   .ASITIS                                                  00472600
.ASTSET  ANOP                                                           00472800
&FASTRIK SETB  1                                                        00473000
.ASITIS  AIF   (&FASIS1 OR &FASIS2).ASISET                              00473200
&FASIS   SETB  0                                                        00473400
         AGO   .CHARS                                                   00473600
.ASISET  ANOP                                                           00473800
&FASIS   SETB  1                                                        00474000
.CHARS   AIF   (&FCHAR1 OR &FCHAR2).CHARSET                             00474200
&FCHAR   SETB  0                                                        00474400
         AGO   .HEXA                                                    00474600
.CHARSET ANOP                                                           00474800
&FCHAR   SETB  1                                                        00475000
.HEXA    AIF   (&FHEX1 OR &FHEX2).HEXSET                                00475200
&FHEX    SETB  0                                                        00475400
         AGO   .INTEGR                                                  00475600
.HEXSET  ANOP                                                           00475800
&FHEX    SETB  1                                                        00476000
.INTEGR  AIF   (&FINTEG1 OR &FINTEG2).INTSET                            00476200
&FINTEG  SETB  0                                                        00476400
         AGO   .PTBYP                                                   00476600
.INTSET  ANOP                                                           00476800
&FINTEG  SETB  1                                                        00477000
.PTBYP   AIF   (&FPTBYP1 OR &FPTBYP2).BYPSET                            00477200
&FPTBYPS SETB  0                                                        00477400
         AGO   .MAXL                                                    00477600
.BYPSET  ANOP                                                           00477800
&FPTBYPS SETB  1                                                        00478000
.MAXL    ANOP                                                           00478200
         AIF   ('&MAXLNTH' EQ '').NFIRST                                00480000
&MAXLG   SETA  &MAXLNTH                                                 00490000
.NFIRST  ANOP                                                           00500000
.*                                                                      00510000
.*  THE FOLLOWING CODE TESTS RESTRICTION ON FIRST CHARACTER OF STRING.  00520000
.*                                                                      00530000
&FRSTCHR SETA  2                                                        00540000
         AIF   ('&FIRST' EQ 'NUMERIC').NOTHER                           00550000
&FRSTCHR SETA  3                                                        00560000
         AIF   ('&FIRST' EQ 'ALPHANUM').NOTHER                          00570000
&FRSTCHR SETA  0                                                        00580000
         AIF   ('&FIRST' EQ 'ANY').NOTHER                               00590000
.*                                                                R0301 00590401
&FRSTCHR SETA  4                                                        00592001
.*                                                                R0301 00592401
         AIF   ('&FIRST' EQ 'NONATABC').NOTHER                          00594001
.*                                                                R0301 00594401
&FRSTCHR SETA  5                                                        00596001
.*                                                                R0301 00596401
         AIF   ('&FIRST' EQ 'NONATNUM').NOTHER                          00598001
&FRSTCHR SETA  1                                                        00600000
         AIF   ('&FIRST' EQ '' OR '&FIRST' EQ 'ALPHA').NOTHER           00610000
         MNOTE 8,'ILLEGAL ''FIRST'' VALUE ''&FIRST'''                   00620000
&FENDBIT SETB  1                                                        00621000
.*                                                                      00630000
.* THE FOLLOWING CODE TESTS RESTRICTION ON CHARACTERS OTHER THAN FIRST. 00640000
.*                                                                      00650000
.NOTHER  ANOP                                                           00660000
         AIF   (&MAXLG EQ 1).MNOT1     IF MAXLNTH = 1, IGNORE 'OTHER'   00670000
&OTHRCHR SETA  2                                                        00680000
         AIF   ('&OTHER' EQ 'NUMERIC').NDEFLT                           00690000
&OTHRCHR SETA  3                                                        00700000
         AIF   ('&OTHER' EQ 'ALPHANUM').NDEFLT                          00710000
&OTHRCHR SETA  0                                                        00720000
         AIF   ('&OTHER' EQ 'ANY').NDEFLT                               00730000
.*                                                                R0301 00730401
&OTHRCHR SETA  4                                                        00732001
.*                                                                R0301 00732401
         AIF   ('&OTHER' EQ 'NONATABC').NDEFLT                          00734001
.*                                                                R0301 00734401
&OTHRCHR SETA  5                                                        00736001
.*                                                                R0301 00736401
         AIF   ('&OTHER' EQ 'NONATNUM').NDEFLT                          00738001
&OTHRCHR SETA  1                                                        00740000
         AIF   ('&OTHER' EQ '' OR '&OTHER' EQ 'ALPHA').NDEFLT           00750000
         MNOTE 8,'ILLEGAL ''OTHER'' VALUE ''&OTHER'''                   00760000
&FENDBIT SETB  1                                                        00761000
         AGO   .NDEFLT                                                  00770000
.MNOT1   AIF   ('&OTHER' EQ '').NDEFLT                                  00771000
         MNOTE 4,'MAXLNTH = 1 SPECIFIED, ''OTHER'' FIELD IGNORED'       00780000
.NDEFLT  ANOP                                                           00790000
         AIF   (&FPTBYPS AND NOT(&FPRPT)).NOTON                         00791000
         AGO   .BITSOK                                                  00792000
.NOTON   MNOTE 4,'''PROMPT'' MUST BE SPECIFIED WHEN ''PTBYPS'' IS CODED*00793000
               '                                                        00793100
&FPTBYPS SETB  0                       TURN OFF PTBYPS BIT              00793200
.BITSOK  ANOP                                                           00794000
         AIF   (NOT(&FENDBIT)).GEN     IF ERRORS DO NOT GENERATE CODE   00800000
         MEXIT                                                          00810000
.GEN     ANOP                                                           00820000
&IKJCSNM CSECT ,                       RESUME PCL CSECT                 00830000
* FLAGS -    BIT3=PROMPT, BIT4=DEFAULT, BIT5=NEW FORMAT PCE,   @E2115KD 00837500
*            BIT6=HELP,  BIT7=VALIDCK, BIT8=LIST,  BIT9=ASIS,  @E2115KD 00845000
*            BIT10=RANGE                                       @E2115KD 00852500
DENT&SYSNDX EQU *                                                       00860000
.*   SET BIT 5 TO INDICATE A NEW FORMAT PCE HAS BEEN           @E2115KD 00866000
.*   GENERATED                                                 @E2115KD 00872000
         DC    BL2'100&FPRPT&FDFLT.1&FHELP&FVALID&FLIST&FASIS&FRANGE.00*00878000
               000'                    FLAGS                  @E2115KD  00884000
         DC    AL2(DEND&SYSNDX-DENT&SYSNDX) LENGTH OF PCE               00890000
         DC    AL2(&LABEL-&IKJDSNM)    OFFSET TO PDE                    00900000
* OPTIONS -  BIT0 = ASTERISK,  BIT1 = MAXLNTH,  BIT2 = PTBYPS           00910000
*         -  BIT3 = INTEGER,   BIT4 = CHARACTER, BIT5 = HEXADECIMAL     00916600
         DC    BL1'&FASTRIK&FMAXLG&FPTBYPS&FINTEG&FCHAR&FHEX.00'        00923200
         DC    AL1(&FRSTCHR)            FIRST CHARACTER RESTRICTION     00930000
         DC    AL1(&OTHRCHR)            RESTRICTION ON CHAR OTHER THAN *00940000
               FIRST                                                    00950000
.*                                                                      00960000
.* THE FOLLOWING CODE SUPPLIES QUOTES TO &TYPNAM IF THEY ARE MISSING.   00970000
.*                                                                      00980000
&QUOTE   SETC  '&TYPNAM'(1,1)                                           00990000
         AIF   ('&QUOTE' EQ '''').QUOT                                  01000000
&QUOTE   SETC  ''''                                                     01010000
         DC    AL2(IKJ@&SYSNDX-*),AL2(18),C&QUOTE&TYPNAM&QUOTE PARAMETE*01020000
               R TYPE MESSAGE SEGMENT                                   01030000
         AGO   .EQUGEN1                                                 01040000
.QUOT    ANOP                                                           01050000
         DC    AL2(IKJ@&SYSNDX-*),AL2(18),C&TYPNAM PARAMETER TYPE MESSA*01060000
               GE SEGMENT                                               01070000
.EQUGEN1 ANOP                                                           01080000
IKJ@&SYSNDX EQU *                                                       01090000
         AIF   (&MAXLG EQ 0).GDEFLT                                     01100000
         DC    AL1(&MAXLG)             MAXIMUM LENGTH OF STRING         01110000
.GDEFLT  ANOP                                                           01120000
         AIF   (&FPRPT).PRPT           PROMPT SPECIFIED                 01130000
         AIF   (NOT &FDFLT).NPRDF                                       01140000
         DC    AL1(IKJ$&SYSNDX-*-2),C&DEFAULT DEFAULT DATA              01150000
         AGO   .EQUGEN                                                  01160000
.PRPT    DC    AL1(IKJ$&SYSNDX-*-2),C&PROMPT PROMPT DATA                01170000
.EQUGEN  ANOP                                                           01180000
IKJ$&SYSNDX EQU *                                                       01190000
.NPRDF   ANOP                                                           01200000
         AIF   (NOT &FHELP).NOHELP     IS HELP SPECIFIED                01210000
         DC    AL2(IKJA&SYSNDX-*)      LENGTH OF HELP DATA              01220000
&T       SETA  1                       SET &T FOR LOOP CONTROL          01230000
.HELPLP  ANOP                                                           01240000
&T       SETA  &T+1                                                     01250000
         AIF   (&T EQ 257).HELPER                                       01260000
         AIF   (&T LE N'&HELP).HELPLP                                   01270000
         AGO   .HELPCT                                                  01280000
.HELPER  MNOTE 4,'ONLY 255 LEVELS OF HELP AVAILABLE. OTHERS IGNORED'    01290000
&T       SETA  &T+1                    PROVIDE FOR DECREMENT            01291000
.HELPCT  ANOP                                                           01300000
&T       SETA  &T-1                                                     01310000
         DC    AL1(&T)                 NUMBER OF HELP MESSAGES          01320000
&END     SETA  &T                                                       01321000
&T       SETA  1                                                        01330000
.HELPLPA ANOP                                                           01340000
         DC    AL2(IKJ&SYSNDX.&T-*),AL2(00),C&HELP(&T) HELP MSG SEGMENT 01350000
IKJ&SYSNDX.&T  EQU *                                                    01360000
&T       SETA  &T+1                                                     01370000
         AIF   (&T LE &END).HELPLPA                                     01380000
IKJA&SYSNDX EQU *                                                       01390000
.NOHELP  AIF   (NOT &FVALID).NOVALID   IS VALIDCK SPECIFIED             01430000
         DC    AL4(&VALIDCK)        VALIDCK ROUTINE ADDRESS @E2115KD    01440000
.NOVALID ANOP                                                           01450000
DEND&SYSNDX EQU *                                                       01460000
&IKJDSNM DSECT                                                          01470000
&PDESIZE SETA  5                                                        01480000
         AIF   (&FLIST AND &FRANGE).DSECT IS LIST AND RANGE SPECIFIED   01490000
&PDESIZE SETA  4                                                        01500000
         AIF   (&FRANGE).DSECT                                          01510000
&PDESIZE SETA  3                                                        01520000
         AIF   (&FLIST).DSECT                                           01530000
&PDESIZE SETA  2                                                        01540000
.DSECT   ANOP                                                           01550000
&LABEL   DS    &PDESIZE.A              ALLOCATE PDE SPACE               01560000
&SYSECT  &SYSSTYP ,                    RESUME USERS CSECT OR RSECT @L1A 01570002
         MEXIT                                                          01580000
         MEND                                                           01590000
