         MACRO                                                          00020000
         IKJNAME &NAME,&SUBFLD=,&INSERT=,&ALIAS=                        00025000
.**01* PROPRIETARY STATEMENT=                                         * 00026001
.* **PROPRIETARY_STATEMENT********************************************* 00027001
.*                                                                    * 00028001
.*                                                                    * 00029001
.*  LICENSED MATERIALS - PROPERTY OF IBM                              * 00029101
.*  5650-ZOS COPYRIGHT IBM CORP. 1981, 2013                           * 00029202
.*                                                                    * 00029301
.*  STATUS= HTE7790                                                   * 00029401
.*                                                                    * 00029501
.* **END_OF_PROPRIETARY_STATEMENT************************************** 00029601
.*                                                                      00029701
.**01* EXTERNAL CLASSIFICATION: PI                                 @L1A 00029801
.**01* END OF EXTERNAL CLASSIFICATION:                             @L1A 00029901
.*                                                                      00030001
.*                                                                      00030101
.*  CHANGE-ACTIVITY =                                                   00030201
.*                                                                      00030301
.* RELEASE 20 SUPPORT CODE - - 20035                                    00030401
.*                                                                      00030501
.* RELEASE 2.0 SUPPORT CODE -- Y02666                                   00030601
.*                                                                      00030701
.* FLAG REASON   RELEASE DATE     ORIGIN                           @L1A 00030801
.* ---- ------   ------- -------- ------                           @L1A 00030901
.* $L1= MG08414  HTE7790 120619   MPK: ALLOW FOR USE WITHIN RSECT  @L1A 00031001
.*                                                                      00032001
         GBLC  &IKJCSNM                                                 00040000
         LCLA  &T,&END                                                  00046600
         LCLB  &FSUBF,&FINSERT,&FALIAS,&EXITBIT                         00053200
         LCLC  &QUOTE                                                   00060000
&FSUBF   SETB  ('&SUBFLD' NE '')       SUBFIELD FLAG                    00070000
&FINSERT SETB  ('&INSERT' NE '')       INSERT DATA FLAG          Y01993 00073600
&FALIAS  SETB  ('&ALIAS' NE '')        KEYWORD NAME ALIAS FLAG   Y02666 00077200
         AIF   (N'&SYSLIST LT 2).A0                                     00081000
         MNOTE 8,'NO MORE THAN 1 POSITIONAL PARAMETERS ALLOWED'         00082000
&EXITBIT SETB  1                                                        00083000
.A0      AIF   ('&NAME' NE '').A1                                       00084000
         MNOTE 8,'NAME OF KEYWORD IS MISSING'                           00110000
&EXITBIT SETB  1                                                        00120000
.A1      AIF   ('&IKJCSNM' NE '').GOOD2                                 00130000
         MNOTE 8,'CSECT NAME (FROM IKJPARM MACRO LABEL) IS MISSING'     00140000
.END     MEXIT                                                          00150000
.GOOD2   AIF   (&EXITBIT).END                                           00160000
&IKJCSNM CSECT ,                       RESUME PCL CSECT                 00170000
NAME&SYSNDX EQU *                                                       00180000
         DC    BL2'01100&FSUBF.00000&FINSERT.00&FALIAS.0' FLAGS         00190000
         DC    AL2(NEND&SYSNDX-NAME&SYSNDX) LENGTH OF PCE               00200000
.*                                                                      00210000
.* THE FOLLOWING CODE SUPPLIES QUOTES TO &NAME IF THEY ARE MISSING.     00220000
.*                                                                      00230000
&QUOTE   SETC  '&NAME'(1,1)                                             00240000
         AIF   ('&QUOTE' EQ '''').QUOT                                  00250000
&QUOTE   SETC  ''''                                                     00260000
         DC    AL1(IKJ@&SYSNDX-*-2),C&QUOTE&NAME&QUOTE NAME VALID FOR K*00270000
               EYWORD                                                   00280000
         AGO   .QUOTED                                                  00290000
.QUOT    ANOP                                                           00300000
         DC    AL1(IKJ@&SYSNDX-*-2),C&NAME NAME VALID FOR KEYWORD       00310000
.QUOTED  ANOP                                                           00320000
IKJ@&SYSNDX EQU *                                                       00330000
         AIF   (NOT &FSUBF).NOSUBF                                      00340000
         DC    AL2(&SUBFLD-&IKJCSNM)   OFFSET TO SUBFIELD               00350000
.NOSUBF  AIF   (NOT &FINSERT).NOINSRT                                   00360000
         DC    AL1(IKJ$&SYSNDX-*-2),C&INSERT INSERT DATA                00370000
IKJ$&SYSNDX EQU *                                                       00380000
.*                                                                      00380800
.* THE FOLLOWING CODE PROCESSES KEYWORD (ABBREVIATIONS) ALIASES  Y02666 00381600
.*                                                                      00382400
.NOINSRT AIF   (NOT &FALIAS).NOALIAS    ARE ALIASES SPECIFIED?   Y02666 00383200
&T       SETA  1                                                        00384000
.ALOOP   ANOP                                                           00384800
&T       SETA  &T+1                     NEXT ALIAS               Y02666 00385600
         AIF   (&T EQ 34).AMSG                                          00386400
         AIF   (&T LE N'&ALIAS).ALOOP                                   00387200
         AGO   .ACOUNT                                                  00388000
.AMSG    MNOTE 4,'ONLY 32 ALIASES ARE ALLOWED. OTHERS IGNORED'          00388800
.ACOUNT  ANOP                                                           00389600
&T       SETA  &T-1                                                     00390400
         DC    AL1(&T)            NUMBER OF ALIASES                     00391200
&END     SETA  &T                                                       00392000
&T       SETA  1                                                        00392800
.ALIASET ANOP                                                           00393600
         DC    AL1(AL&SYSNDX.&T-*-1),C&ALIAS(&T)                        00394400
AL&SYSNDX.&T EQU *                                                      00395200
&T       SETA  &T+1                                                     00396000
         AIF   (&T LE &END).ALIASET                                     00396800
IKJB&SYSNDX EQU *                                                       00397600
.NOALIAS ANOP                                                           00398400
NEND&SYSNDX EQU *                                                       00400000
&SYSECT  &SYSSTYP ,                    RESUME USERS CSECT OR RSECT @L1A 00410001
         MEXIT                                                          00420000
         MEND                                                           00430000
