         MACRO                                                          00050000
&LABEL   IKJOPER &TYPNAM,&OPERND1=,&OPERND2=,&RSVWD=,&HELP=,           *00100000
               &VALIDCK=,&PROMPT=,&DEFAULT=,&CHAIN=                     00150000
.**01* PROPRIETARY STATEMENT=                                         * 00160001
.* **PROPRIETARY_STATEMENT********************************************* 00170001
.*                                                                    * 00180001
.*                                                                    * 00190001
.*  LICENSED MATERIALS - PROPERTY OF IBM                              * 00191001
.*  5650-ZOS COPYRIGHT IBM CORP. 1981, 2013                           * 00192002
.*                                                                    * 00193001
.*  STATUS= HTE7790                                                   * 00194001
.*                                                                    * 00195001
.* **END_OF_PROPRIETARY_STATEMENT************************************** 00196001
.*                                                                      00197001
.**01* EXTERNAL CLASSIFICATION: PI                                 @L1A 00198001
.**01* END OF EXTERNAL CLASSIFICATION:                             @L1A 00199001
.*                                                                      00199101
.*                                                                      00199201
.* TITLE  -  IKJOPER MACRO (SYMBOLIC DEBUG PROJECT)                     00250000
.*                                                                      00300000
.* FUNCTION  -  THE IKJOPER MACRO IS USED BY COMMAND PROCESSORS TO      00350000
.*              DEFINE TO PARSE THE EXPECTED FORMAT OF AN EXPRESSION    00400000
.*              TYPE PARAMETER.                                         00450000
.*                                                                      00500000
.* INPUT  -  THE PROTOTYPE STATEMENT IS AS DEFINED ABOVE.  IT'S         01150000
.*           PARAMETERS REPRESENT THE FOLLOWING:                        01200000
.*               &LABEL   - STATEMENT LABEL IS REQUIRED                 01250000
.*               &TYPNAM  - A PARAMETER TYPE IS REQUIRED                01300000
.*               &OPERND1 - SPECIFIES THE PCE-LABEL WHICH WILL          01350000
.*                          DESCRIBE THE FIRST OPERAND OF THE           01400000
.*                          EXPRESSION.                                 01450000
.*               &OPERND2 - SPECIFIES THE PCE-LABEL WHICH WILL          01500000
.*                          DESCRIBE THE SECOND OPERAND OF THE          01550000
.*                          EXPRESSION.                                 01600000
.*               &RSVWD   - SPECIFIES THE PCE-LABEL WHICH WILL          01650000
.*                          DESCRIBE POSSIBLE RESERVE WORDS IN          01700000
.*                          THE EXPRESSION.                             01750000
.*               &HELP    - SUPPLIES SECOND-LEVEL MESSAGES.             01800000
.*               &VALIDCK - SPECIFIES THE ADDRESS OF A USER-SUPPLIED    01850000
.*                          VALIDITY CHECK EXIT ROUTINE.                01900000
.*               &PROMPT  - SUPPLIES DATA TO BE USED IF PROMPTING FOR   01950000
.*                          A MISSING PARAMETER.                        02000000
.*               &DEFAULT - SUPPLIES VALUE TO BE USED IF THE PARAMETER  02050000
.*                          IS NOT ENTERED                              02100000
.*               &CHAIN -   ADDRESS OF A TERM ADDRESS-TYPE PCE          02150000
.*                                                                      02200000
.* OUTPUT - THIS MACRO PRODUCES A PARAMETER CONTROL ENTRY (PCE) TO BE   02250000
.*          PASSED TO THE PARSE SERVICE ROUTINE.                        02300000
.*          IF AN ERROR IS ENCOUNTERED IN PROCESSING THE MACRO          02350000
.*          INSTRUCTION ENTERED BY THE CP, AN APPROPRIATE ERROR MESSAGE 02400000
.*          IS PRINTED AND THE PCE IS NOT GENERATED.                    02450000
.*                                                                      02500000
.*                                                                      02650000
.* THE FOLLOWING CODE DEFINES VARIABLES TO BE USED IN THE MACRO         02700000
.*   EXPANSION.                                                         02750000
.*       GLOBALS   -   IKJCSNM - CSECT NAME FROM IKJPARM MACRO LABEL.   02800000
.*                     IKJDSNM - DSECT NAME FOR PDL                     02850000
.*       LOCALS(ARITHMETIC) -  T - USED AS COUNTER FOR HELP MESSAGES.   02900000
.*                             END - SECOND COUNTER FOR HELP MESSAGES.  02950000
.*                             PDESIZE - AMOUNT OF SPACE FOR PDE        03000000
.*             (BINARY)  -  FLAGS FOR VARIOUS OPTIONS AND TO INDICATE   03050000
.*                          THAT NO PCE IS TO BE GENERATED.             03100000
.*             (CHARACTER)  -  QUOTE- USED WHEN QUOTES ARE MISSING      03150000
.*                                    FROM &TYPNAM.                     03200000
.*                                                                   */ 03260001
.*  CHANGE ACTIVITY --                                       @E2115KD*/ 03270001
.*                  THE PLS VERSION OF THIS MODULE WAS CREATED TO    */ 03280001
.*                  SUPPORT APAR OZ25414.                            */ 03290001
.*                  E2115KD - JBB2115 TSO/E FOR MVS/XA       @E2115KD*/ 03291001
.*                                                                      03292001
.* FLAG REASON   RELEASE DATE     ORIGIN                           @L1A 03293001
.* ---- ------   ------- -------- ------                           @L1A 03294001
.* $L1= MG08414  HTE7790 120619   MPK: ALLOW FOR USE WITHIN RSECT  @L1A 03295001
.*                                                                      03296001
         GBLC  &IKJCSNM,&IKJDSNM                                        03300000
         LCLA  &T,&END,&PDESIZE                                         03350000
         LCLB  &FPRPT,&FDFLT,&FHELP,&FVALID,&FENDBIT,&FCHN              03400000
         LCLC  &QUOTE                                                   03450000
&FENDBIT SETB  0                                                        03500000
.*                                                                      03550000
.* DETERMINE IF EXTRANEOUS POSITIONAL PARAMETERS HAVE BEEN SPECIFIED.   03600000
.*                                                                      03650000
         AIF   (N'&SYSLIST LT 2).GOOD                                   03700000
         MNOTE 8,'ONLY ONE POSITIONAL PARAMETER ALLOWED'                03750000
&FENDBIT SETB  1                                                        03800000
.*                                                                      03850000
.* DETERMINE IF TYPE NAME HAS BEEN ENTERED.                             03900000
.*                                                                      03950000
.GOOD    AIF   ('&TYPNAM' EQ '').BAD                                    04000000
         AGO   .GOOD1                                                   04050000
.BAD     MNOTE 8,'PARAMETER TYPE NAME MISSING BUT REQUIRED'             04100000
&FENDBIT SETB  1                                                        04150000
.*                                                                      04200000
.* DETERMINE IF CSECT NAME IS MISSING.                                  04250000
.*                                                                      04300000
.GOOD1   AIF   ('&IKJCSNM' NE '').GOOD2                                 04350000
         MNOTE 8,'CSECT NAME (FROM IKJPARM MACRO LABEL) IS MISSING'     04400000
&FENDBIT SETB  1                                                        04450000
.*                                                                      04500000
.* DETERMINE IF STATEMENT LABEL WAS ENTERED.                            04550000
.*                                                                      04600000
.GOOD2   AIF   ('&LABEL' NE '').GOOD3                                   04650000
         MNOTE 8,'STATEMENT LABEL MISSING BUT REQUIRED'                 04700000
&FENDBIT SETB  1                                                        04750000
.GOOD3   ANOP                                                           04800000
.*                                                                      04850000
.* THE FOLLOWING CODE SETS FLAGS TO INDICATE OPTIONS SPECIFIED ON THE   04900000
.*     MACRO INSTRUCTION.                                               04950000
.*                                                                      05000000
&FPRPT   SETB  ('&PROMPT' NE '')                                        05050000
&FDFLT   SETB  ('&DEFAULT' NE '')                                       05100000
&FHELP   SETB  ('&HELP' NE '')                                          05150000
&FVALID  SETB  ('&VALIDCK' NE '')                                       05200000
&FCHN    SETB  ('&CHAIN' NE '')                                         05250000
.*                                                                      05300000
.* PROMPT AND DEFAULT CANNOT BOTH BE SPECIFIED.                         05350000
.*                                                                      05400000
.OPT6    AIF   (NOT(&FDFLT AND &FPRPT)).OPT2                            05450000
         MNOTE 8,'PARAMETER CANNOT BOTH DEFAULT AND REQUIRE PROMPTING'  05500000
&FENDBIT SETB  1                                                        05550000
.*                                                                      05600000
.* THE FOLLOWING CODE CHECKS THAT OPERND1, OPERND2, AND RSVWD HAVE      05650000
.*     BEEN ENTERED.                                                    05700000
.*                                                                      05750000
.OPT2    AIF   ('&OPERND1' NE '').OPT3                                  05800000
         MNOTE 8,'''OPERND1'' REQUIRED BUT MISSING'                     05850000
&FENDBIT SETB  1                                                        05900000
.OPT3    AIF   ('&OPERND2' NE '').OPT4                                  05950000
         MNOTE 8,'''OPERND2'' REQUIRED BUT MISSING'                     06000000
&FENDBIT SETB  1                                                        06050000
.OPT4    AIF   ('&RSVWD' NE '').OPT5                                    06100000
         MNOTE 8,'''RSVWD'' REQUIRED BUT MISSING'                       06150000
&FENDBIT SETB  1                                                        06200000
.*                                                                      06250000
.* IF AN ERROR HAS BEEN ENCOUNTERED DO NOT GENERATE THE PCE.            06300000
.*                                                                      06350000
.OPT5    AIF   (NOT(&FENDBIT)).GEN                                      06400000
         MEXIT                                                          06450000
.GEN     ANOP                                                           06500000
&IKJCSNM CSECT ,                     RESUME PCL CSECT                   06550000
* FLAGS - BIT3=PROMPT,  BIT4=DEFAULT, BIT5=NEW FORMAT PCE,     @E2115KD 06600000
*         BIT6=HELP,    BIT7=VALIDCK                           @E2115KD 06650000
DENT&SYSNDX EQU *                                                       06700000
&LABEL   EQU   *                                                        06750000
.*  BIT 5 IS USED TO INDICATE A NEW FORMAT PCE HAS BEEN        @E2115KD 06800000
.*  GENERATED                                                  @E2115KD 06850000
         DC    BL2'111&FPRPT&FDFLT.1&FHELP&FVALID.00000000'    @E2115KD 06900000
.*                                                    FLAGS    @E2115KD 06950000
         DC    AL2(DEND&SYSNDX-DENT&SYSNDX)      LENGTH OF PCE          07000000
         DC    AL2(LAB&SYSNDX-&IKJDSNM)          OFFSET TO PDE          07050000
.*                                                                      07100000
.* THE FOLLOWING CODE SUPPLIES QUOTES TO &TYPNAM IF THEY ARE MISSING    07150000
.*                                                                      07200000
&QUOTE   SETC  '&TYPNAM'(1,1)                                           07250000
         AIF   ('&QUOTE' EQ '''').QUOT                                  07300000
&QUOTE   SETC  ''''                                                     07350000
         DC    AL2(IKJ@&SYSNDX-*),AL2(18),C&QUOTE&TYPNAM&QUOTE   PARAME*07400000
               TER TYPE MESSAGE SEGMENT                                 07450000
         AGO   .EQUGEN1                                                 07500000
.QUOT    ANOP                                                           07550000
         DC    AL2(IKJ@&SYSNDX-*),AL2(18),C&TYPNAM  PARAMETER TYPE MESS*07600000
               AGE SEGMENT                                              07650000
.EQUGEN1 ANOP                                                           07700000
IKJ@&SYSNDX EQU *                                                       07750000
         DC    AL2(&RSVWD-&IKJCSNM)     OFFSET TO RESERVE WORD PCE      07800000
         DC    AL2(&OPERND1-&IKJCSNM)   OFFSET TO FIRST OPERAND PCE     07850000
         DC    AL2(&OPERND2-&IKJCSNM)   OFFSET TO SECOND OPERAND PCE    07900000
         AIF   (&FCHN).DCHERE                                           07950000
         DC    AL2(0)                   NO VAR TERM PCE                 08000000
         AGO   .CONT                                                    08050000
.DCHERE  DC    AL2(&CHAIN-&IKJCSNM)       OFFSET TO VAR TERM PCE        08100000
.CONT    AIF   (&FPRPT).PRPT                                            08150000
         AIF   (NOT &FDFLT).NPRDF                                       08200000
         DC    AL1(IKJ$&SYSNDX-*-2),C&DEFAULT     DEFAULT DATA          08250000
         AGO   .EQUGEN                                                  08300000
.PRPT    DC    AL1(IKJ$&SYSNDX-*-2),C&PROMPT      PROMPT DATA           08350000
.EQUGEN  ANOP                                                           08400000
IKJ$&SYSNDX EQU *                                                       08450000
.NPRDF   ANOP                                                           08500000
         AIF   (NOT &FHELP).NOHELP                                      08550000
         DC    AL2(IKJA&SYSNDX-*)                 LENGTH OF HELP DATA   08600000
&T       SETA  1                                                        08650000
.HELPLP  ANOP                                                           08700000
&T       SETA  &T+1                                                     08750000
         AIF   (&T EQ 256).HELPER                                       08800000
         AIF   (&T LE N'&HELP).HELPLP                                   08850000
         AGO   .HELPCT                                                  08900000
.HELPER  MNOTE 4,'ONLY 255 LEVELS OF HELP AVAILABLE. OTHERS IGNORED'    08950000
.HELPCT  ANOP                                                           09000000
&T       SETA  &T-1                                                     09050000
         DC    AL1(&T)                       NUMBER OF HELP MESSAGES    09100000
&END     SETA  &T                                                       09150000
&T       SETA  1                                                        09200000
.HELPLPA ANOP                                                           09250000
         DC    AL2(IKJ&SYSNDX.&T-*),AL2(00),C&HELP(&T) HELP MSG SEGMENT 09300000
IKJ&SYSNDX.&T EQU *                                                     09350000
&T       SETA  &T+1                                                     09400000
         AIF   (&T LE &END).HELPLPA                                     09450000
IKJA&SYSNDX EQU *                                                       09500000
.NOHELP  AIF   (NOT &FVALID).NOVALID                                    09550000
         DC    AL4(&VALIDCK)    VALIDITY CHECK ROUTINE ADDRESS @E2115KD 09600000
.NOVALID ANOP                                                           09650000
DEND&SYSNDX EQU *                                                       09700000
&IKJDSNM DSECT                                                          09750000
&PDESIZE SETA  2                                                        09800000
LAB&SYSNDX   DS    &PDESIZE.F             ALLOCATE PDE SPACE            09850000
&SYSECT  &SYSSTYP ,                   RESUME USERS CSECT OR RSECT  @L1A 09900001
         MEXIT                                                          09950000
         MEND                                                           10000000
