         MACRO                                                          00020000
&CSECNM  IKJPARM &DUMMY,&DSECT=IKJPARMD                                 00030000
.**01* PROPRIETARY STATEMENT=                                         * 00031001
.* **PROPRIETARY_STATEMENT********************************************* 00032001
.*                                                                    * 00033001
.*                                                                    * 00034001
.*  LICENSED MATERIALS - PROPERTY OF IBM                              * 00035001
.*  5650-ZOS COPYRIGHT IBM CORP. 1981, 2013                           * 00036002
.*                                                                    * 00037001
.*  STATUS= HTE7790                                                   * 00038001
.*                                                                    * 00039001
.* **END_OF_PROPRIETARY_STATEMENT************************************** 00039101
.*                                                                      00039201
.**01* EXTERNAL CLASSIFICATION: PI                                 @L1A 00039301
.**01* END OF EXTERNAL CLASSIFICATION:                             @L1A 00039401
.*                                                                      00039501
.*                                                                      00039601
.*  CHANGE-ACTIVITY =                                                   00039701
.*                                                                      00039801
.* RELEASE 20 SUPPORT CODE -- 20035                                     00039901
.*                                                                      00040001
.* FLAG REASON   RELEASE DATE     ORIGIN                           @L1A 00040101
.* ---- ------   ------- -------- ------                           @L1A 00040201
.* $L1= MG08414  HTE7790 120619   MPK: ALLOW FOR USE WITHIN RSECT  @L1A 00040301
.*                                                                      00040401
         GBLC  &IKJCSNM,&IKJDSLN,&IKJCSND,&IKJDSNM                      00041000
&IKJCSNM SETC  '&CSECNM'               SAVE CSECT NAME                  00070000
&IKJDSNM SETC  '&DSECT'                                                 00080000
&IKJDSLN SETC  'IKJ@&SYSNDX'           CREATE AND SAVE NAME FOR DSECT L*00090000
                                          ENGTH                         00100000
&IKJCSND SETC  'IKJ$&SYSNDX'                                            00110000
         AIF   (N'&SYSLIST(1) EQ 0).GOOD                     @ZA65509   00120000
         MNOTE 4,'IKJPARM SHOULD HAVE NO POSITIONAL PARAMETERS'         00130000
.GOOD    ANOP                                                           00140000
         AIF   ('&CSECNM' EQ '').ERROR1                                 00150000
&IKJCSNM CSECT ,                       ENTER PCL CSECT                  00160000
         DC    AL2(&IKJCSND-&IKJCSNM)  LENGTH OF CSECT                  00170000
         DC    AL2(&IKJDSLN)           LENGTH OF DSECT                  00180000
         IKJSUBF NOCSECT               START A SUBFIELD                 00190000
&IKJDSNM DSECT                                                          00200000
         DS    2A                      FOR STORAGE CHAINS               00210000
&SYSECT  &SYSSTYP ,                    RESUME USERS CSECT OR RSECT @L1A 00220001
         MEXIT                                                          00230000
.ERROR1  MNOTE 8,'STATEMENT LABEL MISSING BUT REQUIRED'                 00240000
         MEND                                                           00250000
