         MACRO                                                          00020000
&LABEL   IKJSUBF &DUMMY                                                 00030000
.**01* PROPRIETARY STATEMENT=                                         * 00030101
.* **PROPRIETARY_STATEMENT********************************************* 00030201
.*                                                                    * 00030301
.*                                                                    * 00030401
.*  LICENSED MATERIALS - PROPERTY OF IBM                              * 00030501
.*  5650-ZOS COPYRIGHT IBM CORP. 1981, 2013                           * 00030602
.*                                                                    * 00030701
.*  STATUS= HTE7790                                                   * 00030801
.*                                                                    * 00030901
.* **END_OF_PROPRIETARY_STATEMENT************************************** 00031001
.*                                                                      00031101
.**01* EXTERNAL CLASSIFICATION: PI                                 @L1A 00031201
.**01* END OF EXTERNAL CLASSIFICATION:                             @L1A 00031301
.*                                                                      00031401
.*                                                                      00031501
.* NAME = SUBFIELD (IKJSUBF) PARSE CONTROL ENTRY (PCE)                * 00033500
.*                                                                    * 00033600
.* FUNCTION =                                                         * 00033700
.*                                                                    * 00033800
.*   1) BUILDS THE IKJPARM PCE.                                       * 00033900
.*      INDICATES TO PARSE THE BEGINNING OF A PCL.                    * 00034000
.*                                                                    * 00034200
.*   2) BUILDS THE IKJSUBF PCE.                                       * 00034400
.*      INDICATES TO PARSE THAT A SUBFIELD FOLLOWS THIS PCE.          * 00034600
.*                                                                    * 00034800
.*   3) BUILDS THE IKJENDP PCE.                                       * 00035000
.*      INDICATES TO PARSE THE END OF A PCL.                          * 00035200
.*                                                                    * 00035400
.* CHANGE ACTIVITY =                                                  * 00035600
.*                                                                    * 00036200
.*   CREATED FOR TSO/E RELEASE 2.0 HBB2102                            * 00036300
.*                                                                    * 00036400
.*   JTE23X2 - TSO/E 2.3.1 EXTENDED IKJUNFLD SUPPORT        @E23X2C6  * 00036600
.*                                                                    * 00036800
.* FLAG REASON   RELEASE DATE     ORIGIN                           @L1A 00036901
.* ---- ------   ------- -------- ------                           @L1A 00037001
.* $L1= MG08414  HTE7790 120619   MPK: ALLOW FOR USE WITHIN RSECT  @L1A 00037101
.*                                                                    * 00037200
.********************************************************************** 00037300
.* RELEASE 20 SUPPORT CODE -- 20035                                     00037400
         GBLC  &IKJCSNM,&IKJKWST                                        00040000
         LCLB  &FENDBIT                                                 00041000
&FENDBIT SETB  0                                                        00042000
         AIF   (N'&SYSLIST(1) EQ 0).GOOD                     @ZA65509   00051000
.*                                                                      00060000
.* THE ONLY POSITIONAL PARAMETER ALLOWED ON IKJSUBF MACRO IS NOCSECT    00070000
.* WHICH IS USED ONLY WHEN INTERNALLY CALLED FROM IKJPARM.              00071000
.*                                                                      00080000
         AIF   ('&DUMMY' EQ 'NOCSECT').NOCSECT                          00090000
         MNOTE 4,'IKJSUBF SHOULD HAVE NO POSITIONAL PARAMETERS'         00100000
.GOOD    AIF   ('&LABEL' EQ '').ERROR1                                  00101000
         AGO   .GOOD1                                                   00102000
.ERROR1  ANOP                                                           00103000
         MNOTE 8,'STATEMENT LABEL MISSING BUT REQUIRED'                 00104000
&FENDBIT SETB  1                                                        00105000
.GOOD1   AIF   ('&IKJCSNM' NE '').GOOD2                                 00120000
         MNOTE 8,'CSECT NAME (FROM IKJPARM MACRO LABEL) IS MISSING'     00130000
.END     MEXIT                                                          00140000
.GOOD2   AIF   (&FENDBIT).END                                           00150000
         GBLA  &UNKSUB       NEEDED FOR CHECKING UNKNOWN EXT @E23X2C6   00153300
&UNKSUB  SETA  &SYSNDX          SET FOR CHECKING UNKNOWN EXT @E23X2C6   00156600
&IKJCSNM CSECT ,                       RESUME PCL CSECT                 00160000
.NOCSECT AIF   ('&LABEL' EQ '').NOENDF IF INTERNAL CALL BRANCH          00170000
         AIF   ('&IKJKWST' EQ '').NOEQU IS KEYWORD SET                  00190000
&IKJKWST EQU   *-&IKJCSNM              OFFSET TO END OF FIELD           00200000
.NOEQU   ANOP                                                           00210000
         DC    AL1(0)                  END OF FIELD                     00220000
.NOENDF  ANOP                                                           00230000
&IKJKWST SETC  'IKJ@&SYSNDX'           GENERATE SYMBOL FOR FIRST KEYWD  00240000
&LABEL   DC    AL2(&IKJKWST)           OFFSET TO FIRST KEYWORD OR END   00250000
&SYSECT  &SYSSTYP ,                    RESUME USERS CSECT OR RSECT @L1A 00260001
         MEND                                                           00270000
