*        %GOTO TABPRO; /*                                               00010004
         MACRO                                                          00020004
         IKJTABLK                                                       00030004
**/                                                                     00040004
* %TABPRO: ;                                                            00050004
*/* START OF SPECIFICATIONS ******************************************/ 00060004
*/*01* PROPRIETARY STATEMENT=                                        */ 00070004
*/***PROPRIETARY_STATEMENT********************************************/ 00080004
*/*                                                                  */ 00090004
*/*                                                                  */ 00100004
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00110004
*/* 5650-ZOS COPYRIGHT IBM CORP. 1982, 2015                          */ 00120004
*/*                                                                  */ 00130004
*/* STATUS= HTE77A0                                                  */ 00140004
*/*                                                                  */ 00150004
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 00160004
*        %GOTO TABPLS; /*                                               00170004
*********************************************************************** 00180004
*                                                                     * 00190004
*01* EXTERNAL CLASSIFICATION: NOTPI                                   * 00200004
*01* END OF EXTERNAL CLASSIFICATION:                                  * 00210004
*                                                                     * 00220004
*01* MACRO NAME: IKJTABLK                                             * 00230004
*                                                                     * 00240004
*01* DESCRIPTIVE NAME: Test Address Block                             * 00250004
*                                                                     * 00260004
*01* DSECT NAME: IKJTABLK, TAB                                        * 00270004
*                                                                     * 00280004
*01* COMPONENT:  TSO/E TEST (28503)                                   * 00290004
*                                                                     * 00300004
*01* EYE-CATCHER: IKJTABLK                                            * 00310004
*02*  OFFSET: 0                                                       * 00320004
*02*  LENGTH: 8                                                       * 00330004
*                                                                     * 00340004
*01* STORAGE ATTRIBUTES:                                              * 00350004
*02*  SUBPOOL: 255                                                    * 00360004
*02*  KEY: 0                                                          * 00370004
*02*  RESIDENCY:                                                      * 00380004
*02*  MAIN STORAGE:                                                   * 00390004
*02*  AUXILIARY STORAGE:                                              * 00400004
*02*  VIRTUAL STORAGE:                                                * 00410004
*                                                                     * 00420004
*01* SIZE: IKJTABLK - 36 bytes                                        * 00430004
*          TAB - 44 bytes                                             * 00440004
*                                                                     * 00450004
*01* CREATED BY: IGC0009G (SVC 97)                                    * 00460004
*                                                                     * 00470004
*01* POINTED TO BY: LWATEST field of the LWA                          * 00480004
*                                                                     * 00490004
*01* SERIALIZATION: None                                              * 00500004
*                                                                     * 00510004
*01* FUNCTION: This DSECT maps the test address block which is used   * 00520004
*              to protect certain addresses and flags from Key 8      * 00530004
*              programs.                                              * 00540004
*                                                                     * 00550004
*01* METHOD OF ACCESS:                                                * 00560004
*02*  ASM: USING ON DSECT TAB                                         * 00570004
*                                                                     * 00580004
*02*  PL/X: %INCLUDE SYSLIB(IKJTABLK)                                 * 00590004
*                                                                     * 00600004
*     THIS IS THE DSECT MAPPING THE TEST ADDRESS BLOCK                * 00610004
*                                                                     * 00620004
*01* CHANGE ACTIVITY =                                        @E2115B8* 00630004
*                   E2115B8 - JBB2115 TSO/E FOR MVS/XA        @E2115B8* 00640004
*                                                                     * 00650004
*** END OF SPECIFICATIONS ********************************************* 00660004
*A-000000-999999                                              @ZA25414* 00670004
TAB      DSECT                TEST ADDRESS BLOCK PREFIX AREA  @E2115B8  00680004
TABPREF  DS    0F  -          TEST ADDRESS BLOCK PREFIX AREA  @E2115B8  00690004
TABID    DS    CL8 -          TABLK ID: 'IKJTABLK'            @E2115B8  00700004
TABPREL  EQU   *-TABPREF      LENGTH OF PREFIX AREA           @E2115B8  00710004
         SPACE 1                                              @E2115B8  00720004
IKJTABLK DSECT                                                          00730004
TABSINPT DS    F -            POINTER TO SVC INFORMATION BLOCK QUEUE    00740004
*                             ELEMENT (SVQ)                             00750004
TABECBT  DS    F -            POINTER TO TEST ECB                       00760004
TABTSTCB DS    F -            POINTER TO TEST TCB                       00770004
TABTCOM  DS    F -            POINTER TO TEST COMMUNICATIONS TABLE      00780004
TABFLAG1 DS    X -            1ST FLAG BYTE                             00790004
TABSVCAB EQU   B'10000000' -  ABEND INDICATOR FOR MAINLINE              00800004
TABMSGS  EQU   B'01000000' -  MESSAGE INDICATOR FOR MAINLINE            00810004
TABFLAG2 DS    X -            2ND FLAG BYTE (RESERVED)                  00820004
TABFLAG3 DS    X -            3RD FLAG BYTE (RESERVED)                  00830004
TABFLAG4 DS    X              4TH FLAG BYTE (RESERVED)                  00840004
TABSVC61 DS    F -            FOR USE BY SVC 61 ONLY                    00850004
TABSVC97 DS    F -            FOR USE BY SVC 97 ONLY                    00860004
TABRSVD1 DS    F -            RESERVED WORD                             00870004
TABRSVD2 DS    F -            RESERVED WORD                             00880004
TABLTH   EQU   (*-IKJTABLK)+TABPREL       LENGTH OF TABLK      @E2115B8 00890004
*                                         INCLUDES PREFIX AREA @E2115B8 00900004
**/                                                                     00910004
         MEND                                                           00920004
* %TABPLS: ;                                                            00930004
*/********************************************************************/ 00940004
*/*                                                                  */ 00950004
*/*      THIS IS THE DSECT MAPPING THE TEST ADDRESS BLOCK            */ 00960004
*/*                                                                  */ 00970004
*/*                                                                  */ 00980004
*/* CHANGE ACTIVITY --                                       @E2115B8*/ 00990004
*/*                 E2115B8 - JBB2115 TSO/E FOR MVS/XA       @E2115B8*/ 01000004
*/*                                                                  */ 01010004
*/*                                                                  */ 01020004
*/********************************************************************/ 01030004
*/*A-000000-999999                                           @ZA25414*/ 01040004
*DCL 1 IKJTABLK BASED(LWATEST),   /* TEST ADDRESS BLOCK              */ 01050004
*      3 TABSINPT PTR(31),        /* POINTER TO SVC INFORMATION ON      01060004
*                                    BLOCK QUEUE ELEMENT (SVQ)       */ 01070004
*      3 TABECBT PTR(31),         /* POINTER TO TEST ECB             */ 01080004
*      3 TABTSTCB PTR(31),        /* POINTER TO TEST TCB             */ 01090004
*      3 TABTCOM  PTR(31),        /* POINTER TO TCOMTAB              */ 01100004
*      3 TABFLAG1 BIT(8),         /* 1ST FLAG BYTE                   */ 01110004
*        5 TABSVCAB BIT(1),       /* ABEND INDICATOR FOR MAINLINE    */ 01120004
*        5 TABMSGS BIT(1),        /* MESSAGE INDICATOR FOR MAINLINE  */ 01130004
*        5 * BIT(6),              /* RESERVED                        */ 01140004
*      3 TABFLAG2 BIT(8),         /* 2ND FLAG BYTE (RESERVED)        */ 01150004
*      3 TABFLAG3 BIT(8),         /* 3RD FLAG BYTE (RESERVED)        */ 01160004
*      3 TABFLAG4 BIT(8),         /* 4TH FLAG BYTE (RESERVED)        */ 01170004
*      3 TABSVC61 PTR(31),        /* FOR USE BY SVC61 ONLY           */ 01180004
*      3 TABSVC97 PTR(31),        /* FOR USE BY SVC 97 ONLY          */ 01190004
*      3 TABRSVD1 PTR(31),        /* RESERVED WORD                   */ 01200004
*      3 TABRSVD2 PTR(31);        /* RESERVED WORD                   */ 01210004
* DCL 1                                                                 01220004
*  TAB CHAR(*) BASED(ADDR(IKJTABLK)-TABPREL), /* NAME FOR ENTIRE TEST   01230004
*                                             ADDRESS BLOCK  @E2115B8*/ 01240004
*      2 TABPREF,                 /* TABLK PREFIX            @E2115B8*/ 01250004
*        3 TABID CHAR(8),         /* TABLK ID: 'IKJTABLK'    @E2115B8*/ 01260004
*      2 * CHAR(LENGTH(IKJTABLK));/* TABLK PROPER            @E2115B8*/ 01270004
* DCL                                                                   01280004
*  TABPREL FIXED(31) INIT(LENGTH(TABPREF)); /* LENGTH OF PREFIX AREA    01290004
*                                                            @E2115B8*/ 01300004
* DCL                                                                   01310004
*  TABLTH FIXED(31) INIT(LENGTH(TABPREF)+LENGTH(IKJTABLK));/* LENGTH OF 01320004
*                               TABLK INCLUDING PREFIX AREA  @E2115B8*/ 01330004
