*        %GOTO LGPRO     ; /*                                           00050000
         MACRO                                                          00100000
         IKJTBLMP                                                       00150000
* */                                                                    00200000
* %LGPRO :     ;                                                        00250000
*/* START OF SPECIFICATIONS ******************************************/ 00260000
*/*01* PROPRIETARY STATEMENT=                                        */ 00300000
*/***PROPRIETARY_STATEMENT********************************************/ 00350000
*/*                                                                  */ 00400000
*/*                                                                  */ 00450000
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00500000
*/* 5650-ZOS COPYRIGHT IBM CORP. 1984, 2015                          */ 00600000
*/*                                                                  */ 00700000
*/* STATUS= HTE77A0                                                  */ 00750000
*/*                                                                  */ 00800000
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 00850000
*        %GOTO LGPLS     ; /*                                           00900000
LOGONADD DSECT                                                    @P1C  00950001
*********************************************************************** 01000000
*                                                                     * 01050000
*01* EXTERNAL CLASSIFICATION: NOTPI                                   * 01100000
*01* END OF EXTERNAL CLASSIFICATION:                                  * 01200000
*                                                                     * 01250000
*01* Macro Name: IKJTBLMP                                             * 01260000
*                                                                     * 01261000
*01* Descriptive Name: Logon Address Table                            * 01262000
*                                                                     * 01263000
*01* DSECT Name: LOGONADD                                             * 01264000
*                                                                     * 01265000
*01* Component:  TSO/E Scheduler (28502)                              * 01266000
*                                                                     * 01267000
*01* Eye-Catcher: IKJEFTBL                                            * 01268000
*02*  Offset: 0                                                       * 01269000
*02*  Length: 8                                                       * 01269100
*                                                                     * 01269200
*01* Storage Attributes:                                              * 01269300
*02*  Subpool: 252                                                    * 01269400
*02*  Key: 0                                                          * 01269500
*02*  Residency:                                                      * 01269600
*02*  Main Storage:                                                   * 01269700
*02*  Auxiliary Storage:                                              * 01269800
*02*  Virtual Storage:                                                * 01269900
*                                                                     * 01270000
*01* Size: 56 bytes                                                   * 01270100
*                                                                     * 01270200
*01* Created by: IKJEFLA                                              * 01270300
*                                                                     * 01271000
*01* Pointed to by: TSVTLTBL field of the TSVT                        * 01280000
*                                                                     * 01281000
*01* Serialization: None                                              * 01290000
*                                                                     * 01299100
*01* Function:                                                        * 01300000
*       This macro maps the LOGON address table, IKJEFTBL.            * 01350000
*                                                                     * 01400000
*01* Method of Access:                                                * 01410000
*02*  ASM: USING on DSECT LG                                          * 01420000
*                                                                     * 01430000
*02*  PL/X: %INCLUDE SYSLIB(IKJTBLMP)                                 * 01440000
*                                                                     * 01450000
*01* NOTES:                                                           * 01650000
*       INCLUDE APPROPRIATE LEVEL OF CVT WITH 'CVTTVT' FIELD          * 01700000
*       INCLUDE MAPPING MACRO, IKJTSVT,  WITH 'TSVTLTBL' FIELD        * 01750000
*       DECLARE TSVTPTR PTR(31) DEFINED CVTTVT                        * 01800000
*       USE THE MAPPING MACRO, IKJTBLMP, TO MAP THIS MODULE           * 01850000
*                                                                     * 01900000
*01* CHANGE ACTIVITY -                                                * 01910000
*       TSO/E RELEASE 3 IOGEN RESTRUCTURE SUPPORT             @E2367FY* 01920000
* $P1= xxxxxx  HTE77B0 160606  ER1:  Make ASM and PL/X match      @P1A* 01921000
*                                                                     * 01930000
*** END OF SPECIFICATIONS ********************************************* 01950000
         SPACE                                                          02000000
           DS    0F        BEGIN LG ON DOUBLE WORD BDY        @E226724  02050000
LGLG       DS    CL8       ACRONYM IN EBCDIC 'IKJEFTBL'           @P1C  02100000
LGREL      DS    CL8       LG RELEASE                             @P1C  02150000
LGEFLIO    DS    A     LOGON UADS I/O ROUTINE ADDR  - IKJEFLIO          02250000
LGEFLD     DS    A     LOGON INSTALLATION EXIT ADDR - IKJEFLD           02300000
LGLOGFF    DS    A     EXTENDED LOGOFF ROUTINE ADDR - IKTLOGFF          02350000
LGLOGR     DS    A     LOGON RECONNECT ROUTINE ADDR - IKTLOGR           02400000
LGXINIT    DS    A     VTIOC INITIALIZATION RTN ADDR - IKTXINIT         02450000
LGXLOG     DS    A     EXTENDED LOGON ROUTINE ADDR  - IKTXLOG           02500000
LGEFLP1    DS    A     LOGON LIMITS CSECT ADDR - IKJEFLP1     @E2367FY  02550000
LGRSV2     DS    A     RESERVED                                         02600000
LGRSV3     DS    A     RESERVED                                         02650000
*                                                                       02700000
         MEND , */                                                      02750000
* %LGPLS :     ;                                                        02800000
* /* MAPPING OF LOGON ADDRESS TABLE  */                                 02850000
* DECLARE                                                               02900000
*   1 LOGONADD CHAR(*) BDY(WORD) BASED(TSVTLTBL),                       02950000
*    2 *    CHAR(16),        /*                                     */  04000000
*     3 LGLG  CHAR(8),       /* ACRONYM IN EBCIDIC "IKJEFTBL"       */  04050000
*     3 LGREL CHAR(8),       /* LG RELEASE                          */  04100000
*   2  LGEFLIO  PTR(31),     /* LOGON UADS I/O ROUTINE ADDR-IKJEFLIO*/  04150000
*                                                                       04200000
*   2  LGEFLD   PTR (31),    /* LOGON INSTALLATION EXIT ADDR-IKJEFLD*/  04250000
*                                                                       04300000
*   2  LGLOGFF  PTR(31),     /* EXTENDED LOGOFF ROUTINE ADDR-IKTLOGFF*/ 04350000
*                                                                       04400000
*   2  LGLOGR   PTR(31),     /* LOGON RECONNECT ROUTINE ADDR-IKTLOGR*/  04450000
*                                                                       04500000
*   2  LGXINIT  PTR(31),     /* VTIOC INITIALIZATION ADDR -IKTXINIT */  04550000
*                                                                       04600000
*   2  LGXLOG   PTR(31),     /* EXTENDED LOGON ROUTINE -IKTXLOG     */  04650000
*                                                                       04700000
*   2  LGEFLP1  PTR(31),     /* LOGON LIMITS CSECT ADDR -IKJEFLP1       04750000
*                                                           @E2367FY*/  04800000
*   2  LGRSV2   PTR(31),     /* RESERVED                            */  04850000
*   2  LGRSV3   PTR(31);     /* RESERVED                            */  04900000
