 /***Start of Specifications******************************************/ 00050000
 /*                                                                  */ 00100000
 /*01* PROPRIETARY STATEMENT=                                        */ 00150000
 /***PROPRIETARY_STATEMENT********************************************/ 00200000
 /*                                                                  */ 00250000
 /*                                                                  */ 00300000
 /* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00350000
 /* 5650-ZOS COPYRIGHT IBM CORP. 1984, 2015                          */ 00450001
 /*                                                                  */ 00550000
 /* STATUS= HTE77A0                                                  */ 00600001
 /*                                                                  */ 00650000
 /***END_OF_PROPRIETARY_STATEMENT*************************************/ 00700000
 /*                                                                  */ 00750000
 /*01* EXTERNAL CLASSIFICATION: NOTPI                                */ 00760001
 /*01* END OF EXTERNAL CLASSIFICATION:                               */ 00770001
 /*                                                                  */ 00780001
 /*01* MACRO NAME:   IKJTMP3                                         */ 00800000
 /*                                                                  */ 00850000
 /*01* DESCRIPTIVE NAME:  TMP Work Area 3                            */ 00900000
 /*                                                                  */ 00950000
 /*01* FUNCTION:                                                     */ 01000000
 /*     TMP3 is a communications area between TMP                    */ 01050000
 /*     initialization, the TMP mainline, and internal TSO/E         */ 01100000
 /*     routines that require processing within the TMP.             */ 01150000
 /*                                                                  */ 01200000
 /*01* DSECT-NAME: TMP3                                              */ 01250000
 /*                                                                  */ 01300000
 /*02*  ACRONYM: TMP3                                                */ 01350000
 /*                                                                  */ 01400000
 /*01* COMPONENT:  TSO/E Scheduler (28502)                           */ 01410001
 /*                                                                  */ 01420001
 /*01* EYE CATCHER:  TMP3                                            */ 01450000
 /*02*  OFFSET:  0                                                   */ 01500000
 /*02*  LENGTH:  4                                                   */ 01550000
 /*                                                                  */ 01600000
 /*01* MACRO-TYPE: Mapping macro                                     */ 01650000
 /*                                                                  */ 01700000
 /*01* PROCESSOR:    PL/X                                            */ 01750000
 /*                                                                  */ 01800000
 /*01* STORAGE ATTRIBUTES:                                           */ 01950000
 /*02*  SUBPOOL: 230                                                 */ 02000000
 /*02*  KEY:     1                                                   */ 02050000
 /*02*  RESIDENCY: Below 16MB                                        */ 02100002
 /*                                                                  */ 02150000
 /*01* SIZE:  40 bytes                                               */ 02200002
 /*                                                                  */ 02250000
 /*01* CREATED BY: IKJEFT01                                          */ 02300000
 /*                                                                  */ 02350000
 /*01* POINTED TO BY:                                                */ 02400000
 /*     LWATMPW3 field of the LWA                                    */ 02450002
 /*                                                                  */ 02500000
 /*01* SERIALIZATION:                                                */ 02550000
 /*                                                                  */ 02600000
 /*     Serialization is required to change the TMP3TIBQ field.      */ 02650000
 /*     Serialization is provided via ENQ and DEQ macros as          */ 02700000
 /*     follows:                                                     */ 02750000
 /*                                                                  */ 02800000
 /*         Major name:  SYSZTSOE  -- a prefix of SYSZ indicates     */ 02850000
 /*                                   that this is a system          */ 02900000
 /*                                   (authorized) ENQ.              */ 02950000
 /*         Minor name:  TCBAxxxx  -- where xxxx is the active       */ 03000000
 /*                                   IKJEFT02 TCB address at the    */ 03050000
 /*                                   time that the TMP3TIBQ is to   */ 03100000
 /*                                   be changed.                    */ 03150000
 /*                                                                  */ 03200000
 /*                                   The active IKJEFT02 TCB        */ 03250000
 /*                                   address is available in the    */ 03300000
 /*                                   TMP3AT02 field of the TMP3     */ 03350000
 /*                                   data area.                     */ 03400000
 /*         Scope:       Step Level                                  */ 03450000
 /*                                                                  */ 03500000
 /*01* METHOD OF ACCESS:                                             */ 03550000
 /*02*  PLAS: %INCLUDE SYSLIB(IKJTMP3)                               */ 03600000
 /*                                                                  */ 03650000
 /*           Addressability to this control block is obtained       */ 03700000
 /*           by the following chain:                                */ 03750000
 /*                                                                  */ 03800000
 /*               PSAAOLD->ASCBASXB->ASXBLWA->LWATMPW3               */ 03850000
 /*                                                                  */ 03900000
 /*01* NOTES:                                                        */ 03950000
 /*                                                                  */ 04000000
 /*   TMP3LEVL INDICATORS:                                   @E2367I5*/ 04050000
 /*       1 = ORIGINAL TMP3 (REL 2, 2.1)                     @E2367I5*/ 04100000
 /*       2 = TSO/E XA RELEASE 3 SUPPORT                     @E2367I5*/ 04150000
 /*                                                                  */ 04200000
 /*01* CHANGE ACTIVITY =                                             */ 04250002
 /*                                                                  */ 04300000
 /*ZTS0161 RECOVERY SUPPORT FOR IKJEFT02                     @E1213F3*/ 04350000
 /*ZTS0254 SUPPORT FOR ATTENTIONING OUT OF CLIST             @E1213F3*/ 04400000
 /*E2367I5 TSO/E RELEASE 3 SUPPORT FOR INVOKING CLISTS       @E2367I5*/ 04450000
 /*        THROUGH THE TSO SERVICE FACILITY                  @E2367I5*/ 04500000
 /*                                                                  */ 04550000
 /* PBY0239 - DCR TO SUPPORT "STACK BARRIER" ELEMENT.        @PBY0239*/ 04600000
 /*           CHANGE WAS MADE TO IKJTMP3 TO REMOVE           @PBY0239*/ 04650000
 /*           THE TSF LEVEL COUNTER SINCE IT IS NO LONGER    @PBY0239*/ 04700000
 /*           NEEDED.                                        @PBY0239*/ 04750000
 /*                                                                  */ 04800000
 /* PBY0275 - 0C4 OCCURRED IN IKJEFT02 WHEN NO CLIST         @PBY0275*/ 04850000
 /*           ATTENTION EXIT PRESENT.                        @PBY0275*/ 04900000
 /*                                                                  */ 04950000
 /* PEI0974 - ADD A BIT TO TELL TSF WHEN TERMINATION IS      @PEI0974*/ 05000000
 /*           PROGRESS. TSF WILL INTERROGATE THIS BIT AND    @PEI0974*/ 05050000
 /*           IF IT IS ON, WILL NOT ACCEPT ANY FURTHER       @PEI0974*/ 05100000
 /*           REQUESTS.                                      @PEI0974*/ 05150000
 /*                                                                  */ 05200000
 /* @E22D2D3 - TSO/E 2.2.0 CONSOLE SUPPORT                   @E22D2D3*/ 05250000
 /*                                                                  */ 05300000
 /* OY36904 - ADDED FIELD TO HOLD REXX ENVIRONMENT BLOCK     @YA36904*/ 05350000
 /*           ADDRESS USED DURING TMP INIT AND TERM          @YA36904*/ 05400000
 /*           PROCESSING.                                    @YA36904*/ 05450000
 /*                                                                  */ 05500000
 /* OY37243 - DECLARE A FOOTPRINT SET BY IKJEFTSC BEFORE STATUS      */ 05550000
 /*           STOP IS ISSUED FOR THE NON-PARALLEL TMP AND RESET      */ 05600000
 /*           BY THE PARALLEL IKJEFT02 AFTER THE TCBPTR IS           */ 05650000
 /*           STORED IN IKJTMPWA. THIS FOOTPRINT IS CHECKED BY       */ 05700000
 /*           IKJATTN IN IKJEFTSC AND IF SET ON THE ATTENTION        */ 05750000
 /*           WILL BE IGNORED.                               @YA37243*/ 05800000
 /*                                                                  */ 05850000
 /* OW00765 - ADD A BIT WHICH INDICATES THAT THE REGISTER    @WA00765*/ 05900000
 /*           FUNCTION FOR USAGE BASED PRICING HAS BEEN      @WA00765*/ 05950000
 /*           PERFORMED.                                     @WA00765*/ 06000000
 /*                                                                  */ 06050000
 /* E25D2JC - Prolog updated for SHOWHDR tool.  Size of the  @E25D2JC*/ 06100000
 /*           DSECT increased for TSO/E 2.5 TSOLIB support.  @E25D2JC*/ 06150000
 /*                                                          @E25D2JC*/ 06200000
 /*           JDC note:  Make sure that I did not miss       @E25D2JC*/ 06250000
 /*           JDC note:  any maintenance.                    @E25D2JC*/ 06300000
 /*                                                                  */ 06350000
 /* OW24332 - NEW FLAG INDICATING WHETHER THE ESATE FOR IKJEFT01     */ 06400000
 /*           HAS BEEN ESTABLISHED WITH CANCEL=YES OR NO. FOR MORE   */ 06450000
 /*           INFORMATION ABOUT THIS APAR SEE IKJEFT01 DESCR.@WA24332*/ 06500000
 /*                                                                  */ 06550000
 /* FLAG    REASON   RELEASE DATE   ORIGIN                           */ 06560000
 /* ----    -------- ------- ------ ------                           */ 06570000
 /* $L1=    BASE     HTE77A0 130415 MPK: Fix needed for PLXMAP   @L1A*/ 06580000
 /*                                                                  */ 06590000
 /***End of Specifications********************************************/ 06600000
 /*A000000-999999                                            @E1213G8*/ 06650000
 @SPACE;                                                                06700000
 DECLARE                                                                06750000
   1 TMP3 BASED(LWATMPW3) BDY(DWORD),                                   06800000
     2 TMP3TMP3 CHAR(4),     /* ACRONYM IN EBCDIC 'TMP3'             */ 06850000
     2 TMP3LEV FIXED(8),     /* TMP3 VERSION                         */ 06900000
     2 TMP3FLAG CHAR(1),   /* FLAG NEEDED BY TMP PROCESSING   @ZTS0254*/06950000
       3 TMP3ATTN BIT(1),  /* INDICATE ATTN EXIT ESTABLISHED BY T02 IS  07000000
                              IN CONTROL (IKJEFT03)           @ZTS0254*/07050000
       3 TMP3TSFC BIT(1),  /* AN ATTENTION OCCURRED WHILE IN            07100000
                              TSF/CLIST MODE AND THERE WERE             07150000
                              NO CLIST ATTENTION EXITS TO               07200000
                              PROCESS.                        @PBY0275*/07250000
       3 TMP3NOAT BIT(1),  /* AN ATTENTION OCCURRED WHILE THE           07300000
                              PARALLEL TMP IS INITIALIZING   @YA37243*/ 07350000
       3 TMP3USAG BIT(1),  /* INDIC. REGISTERED FOR USAGE               07400000
                              BASED PRICING                  @WA00765*/ 07450000
       3 TMP3ESTA_CANCEL BIT(1), /* SHOWS HOW THE ESTAE IS SET-UP BY    07500000
                                IKJEFT01, IKJEFTSC YES: CANCEL=YES      07550000
                                NO: CANCEL=NO                @WA24332*/ 07600000
       3 *        BIT(3),    /*  R E S E R V E               @WA24332*/ 07650000
     2 TMP3RS02 BIT(8),      /* RESERVED                     @PBY0239*/ 07700000
     2 TMP3TBIU BIT(1),      /* TMP TIB IN USE BIT MAINTAINED BY        07750000
                                IKJEFTP2 AND IKJEFT08        @E2367I5*/ 07800000
     2 TMP3TSFA BIT(1),      /* AN ATTENTION OCCURRED WHILE IN          07850000
                                TSF/CLIST MODE, AN AUTHORIZED COMMAND   07900000
                                WAS PROCESSING, AND THERE WAS NO        07950000
                                CLIST ATTENTION ROUTINE. THIS INDICATES 08000000
                                THAT THE PARALLEL TMP SHOULD BE         08050000
                                TERMINATED. SET BY IKJEFT03, CHECKED    08100000
                                AND RESET BY IKJEFTP2.       @E2367I5*/ 08150000
     2 TMP3TIP  BIT(1),      /* TERMINATION IN PROGRESS AT THE T01      08200000
                                TASK LEVEL                   @PEI0974*/ 08250000
     2 TMP3RS03 BIT(5),      /* RESERVED                     @PEI0974*/ 08300000
     2 TMP3PECB,             /* ECB USED TO INITIATE PARALLEL TMP       08350000
                                PROCESSING                           */ 08400000
       3 * BIT(1),           /* ECB WAIT BIT                         */ 08450000
       3 TMP3PECP BIT(1),    /* PARALLEL PROCESSING ECB POST BIT     */ 08500000
       3 * BIT(30),          /* ECB COMPLETION CODE                  */ 08550000
     2 TMP3AT02 PTR,         /* TCB ADDR FOR THE T02 CURRENTLY          08600000
                                ACTIVE                               */ 08650000
     2 TMP3TIBQ PTR,         /* ADDR OF THE FIRST BLOCK ON THE TIB      08700000
                                (TMP INTERFACE BLOCK) QUEUE          */ 08750000
     2 TMP3WKA2 PTR,         /* PTR TO AN IMAGE OF TMPWRKA2 USED TO     08800000
                                INITIALIZE THE TMP WORK AREAS PASSED    08850000
                                TO THE PARALLEL T02                  */ 08900000
     2 TMP3ENVB PTR,         /* PTR TO TSO REXX ENVBLOCK     @YA36904*/ 08950000
     2 TMP3WRK2 PTR,         /* PTR TO A TMPWRKA2 (KEY 1) USED BY       09000000
                                T01                                  */ 09050000
     2 TMP3WA2  PTR(31),   /*PTR TO T02'S PROTECTED WORKAREA @ZTS0161*/ 09100000
     2 TMP3AW2  PTR(31),   /*PTR TO ACTIVE T02 PROTECTED WORKAREA       09150000
                             NEED BY ATTN EXIT IN TSC TO GET ACCESS     09200000
                             TO UNPROTECTED WORKAREA TO POST ATTN ECB   09250000
                                                              @ZTS0254*/09300000
     2 TMP3AECB,             /* ECB USED TO INITIATE CONSOLE AUTHORIZED 09350000
                                TASK                         @E22D2D3*/ 09400000
       3 * BIT(1),           /* ECB WAIT BIT                 @E22D2D3*/ 09450000
       3 TMP3AECP BIT(1),    /* ATTACH CONSOLE TASK ECB POST BIT        09500000
                                                             @E22D2D3*/ 09550000
       3 * BIT(30),          /* ECB COMPLETION CODE          @E22D2D3*/ 09600000
     2 TMP3DECB,             /* ECB POSTED BY RTM WHEN THE CONSOLE      09650000
                                AUTHORIZED TASK TERMINATES   @E22D2D3*/ 09700000
       3 * BIT(1),           /* ECB WAIT BIT                 @E22D2D3*/ 09750000
       3 TMP3DECP BIT(1),    /* DETACH CONSOLE TASK ECB POST BIT        09800000
                                                             @E22D2D3*/ 09850000
       3 * BIT(30),          /* ECB COMPLETION CODE          @E22D2D3*/ 09900000
     2 TMP3TECB,             /* TSOLIB's ECB - used to initiate         09950000
                                a TSOLIB request                        10000000
                                within the TMP.              @E25D2JC*/ 10050000
       3 * BIT(1),           /* TSOLIB ECB wait bit          @E25D2JC*/ 10100000
       3 TMP3TECP BIT(1),    /* TSOLIB ECB post bit          @E25D2JC*/ 10150000
       3 * BIT(30),          /* TSOLIB ECB completion code   @E25D2JC*/ 10200000
     2 TMP3FREE(11)  PTR(31),/* Room reserved for                       10250000
                                later use.                       @L1C*/ 10300000
 @SPACE;                                                                10350000
 /********************************************************************/ 10400000
 /*                                                                  */ 10450000
 /* *****    ADD ANY NEW FIELDS BEFORE THE NEXT DECLARE.    *****    */ 10500000
 /*                                                                  */ 10550000
 /********************************************************************/ 10600000
 @SPACE;                                                                10650000
     2 * CHAR(0) BDY(DWORD); /* ASSURE TMP3 ENDS ON A DOUBLE WORD       10700000
                                BOUNDARY                             */ 10750000
 @SPACE;                                                                10800000
 /********************************************************************/ 10850000
 /*                                                                  */ 10900000
 /*    CONSTANTS FOR INITIALIZING THE CONTROL BLOCK ID AND LEVEL     */ 10950000
 /*                                                                  */ 11000000
 /*  **** TMP3LEVL MUST BE INCREMENTED WHEN THE TMP3 IS UPDATED.**** */ 11050000
 /*                                                                  */ 11100000
 /********************************************************************/ 11150000
 @SPACE;                                                                11200000
   DECLARE TMP3CHAR CHAR(4) CONSTANT('TMP3'); /* CHARACTERS FOR         11250000
                                                 INITIALIZING           11300000
                                                 TMP3TMP3            */ 11350000
   DECLARE TMP3LEVL FIXED(8) CONSTANT(3);   /* TMP3 LEVEL = 3           11400000
                                                             @E22D2D3*/ 11450000
