*                                                                               
*        %GOTO TCBL1; /*                                                        
         MACRO                                                                  
         IKJTCB &DSECT=YES,&LIST=NO,&SYS=,&TCBDSECT=NO   */                     
*%TCBL1 : ;                                                                     
*/* START OF SPECIFICATIONS ******************************************/         
*/*                                                                  */         
*/*01* PROPRIETARY STATEMENT =                                       */         
*/*                                                                  */         
*/*      LICENSED MATERIALS - PROPERTY OF IBM                        */         
*/*      5650-ZOS COPYRIGHT IBM CORP. 1977, 2019                     */         
*/*                                                                  */         
*/*01* STATUS = HBB77C0                                              */         
*/*                                                                  */         
*/*01* DESCRIPTIVE NAME = TASK CONTROL BLOCK                         */         
*/*02*  ACRONYM:  TCB                                                */         
*/*                                                                  */         
*/*01* MACRO NAME = IKJTCB                                           */         
*/*                                                                  */         
*/*01* DSECT NAME:                                                   */         
*/*     TCBFIX (DSECT card precedes prefix).  The label, TCB,        */         
*/*     should be used in the USING statement for the TCB proper.    */         
*/*     TCBXTNT2 is the DSECT name for common extension.             */         
*/*                                                                  */         
*/*01* COMPONENT:  Task Management (SC1CL)                           */         
*/*                                                                  */         
*/*01* EYE-CATCHER:  TCB                                             */         
*/*02*  OFFSET:  256                                                 */         
*/*02*  LENGTH:  4                                                   */         
*/*                                                                  */         
*/*01* STORAGE ATTRIBUTES:                                           */         
*/*02*  SUBPOOL: 253                                                 */         
*/*02*  KEY:  0                                                      */         
*/*02*  RESIDENCY:  Below 16 MB line                                 */         
*/*                                                                  */         
*/*01* SIZE:  408 bytes                                              */         
*/*                                                                  */         
*/*01* CREATED BY: IEAMSWCB, ATTACH                                  */         
*/*                                                                  */         
*/*01* DELETED BY : DETACH                                           */         
*/*                                                                  */         
*/*01* POINTED TO BY:                                                */         
*/*     ASMTCBPT field of the ASMVT data area                        */         
*/*     ASXBFTCB field of the ASXB data area (first TCB)             */         
*/*     ASXBLTCB field of the ASXB data area (last TCB)              */         
*/*     CVTSLIDA field of the CVT data area (supervisor lock TCB)    */         
*/*     CVTWTCB field of the CVT data area (dummy WAIT TCB)          */         
*/*     DEBTCBAD field of the DEB data area                          */         
*/*     DSABTCBP field of the DSAB data area                         */         
*/*     EVNTTCBP field of the EVNT data area                         */         
*/*     JSCBTCBP field of the JSCB data area (initiator TCB)         */         
*/*     LCTTCBAD field of the LCT data area                          */         
*/*     ORETCB field of the ORE data area                            */         
*/*     PQETCB field of the PQE data area                            */         
*/*     PSATNEW field of the PSA data area (new TCB to dispatch)     */         
*/*     PSATOLD field of the PSA data area (current TCB              */         
*/*     dispatched)                                                  */         
*/*     QELTCB field of the QEL data area                            */         
*/*     QPLTCB field of the QPL data area                            */         
*/*     RBLINK field of the RB data area                             */         
*/*     RQETCB field of the RQE data area                            */         
*/*     SCVTCTCB field of the SCVT data area (Comm Task TCB)         */         
*/*     SMCAWTCB field of the SMCA data area (SMF writer TCB)        */         
*/*     SQETCB field of the SQE data area                            */         
*/*     SSETCBA field of the EOT SSOB data area (terminating TCB)    */         
*/*     TAXETCB field of the TAXE data area                          */         
*/*     TCBTCB field of the TCB data area (next TCB)                 */         
*/*     TCBJSTCB field of the TCB data area (jobstep TCB)            */         
*/*     TCBNTC field of the TCB data area (sister TCB)               */         
*/*     TCBOTC field of the TCB data area (originating TCB)          */         
*/*     TCBLTC field of the TCB data area (subtask TCB)              */         
*/*     TCBBACK field of the TCB data area (previous TCB)            */         
*/*     TCCWTCB field of the TCCW data area                          */         
*/*     TCTTCB field of the TCT data area                            */         
*/*     TIOCLDS field of the TIOCRPT data area (line                 */         
*/*     disconnect TCB)                                              */         
*/*     TQETCB field of the TQE data area                            */         
*/*     TSBWTCB field of the TSB data area (waiting TCB)             */         
*/*     TSBCTCB field of the TSB data area (TPUT TCB)                */         
*/*     UCMPXA field of the UCM data area (comm task TCB)            */         
*/*     WEBUPTR field of the WEB data area                           */         
*/*     WQETCB field of the WQE data area                            */         
*/*     WQEJSTCB field of the WQE data area                          */         
*/*     (associated jobstep TCB)                                     */         
*/*                                                                  */         
*/*01* SERIALIZATION:                                                */         
*/*     Depends on the field                                         */         
*/*                                                                  */         
*/*01* FUNCTION:                                                     */         
*/*     The task control block (TCB) serves as a repository          */         
*/*     for information and pointers associated with a task.         */         
*/*     Various components of the control program place              */         
*/*     information in the TCB and obtain information from           */         
*/*     the TCB.                                                     */         
*/*                                                                  */         
*/*01* EXTERNAL CLASSIFICATION:                                      */         
*/*                                                                  */         
*/*02*   PI: FIELDS                                                  */         
*/*           TCBAFFN  TCBANDSP TCBARC   TCBBACK  TCBBITCB           */         
*/*           TCBCELAP TCBCMPF  TCBCMP   TCBDEB   TCBFBYT4           */         
*/*           TCBFLGS8 TCBGRES  TCBGRS   TCBJPQB                     */         
*/*           TCBJLB   TCBJSCBB TCBJSTCB                             */         
*/*           TCBLEVEL TCBLLS   TCBLTC   TCBNTC   TCBOTC             */         
*/*           TCBPIE   TCBPKF   TCBRBP   TCBSENV                     */         
*/*           TCBSTCB  TCBSVCA2 TCBSVCSP TCBSVCS  TCBTCBID           */         
*/*           TCBTCB   TCBTCT   TCBTID   TCBTIO   TCBTTIME           */         
*/*           TCBUSER                                                */         
*/*                                                                  */         
*/*02*  NOTPI: BASE                                                  */         
*/*                                                                  */         
*/*01* END OF EXTERNAL CLASSIFICATION:                               */         
*/*                                                                  */         
*/*01* METHOD OF ACCESS:                                             */         
*/*      BAL  - A DSECT IS PRODUCED UNLESS DSECT=NO IS SPECIFIED.    */         
*/*             USING ON TCBFIX GIVES ADDRESSABILITY FOR ALL SYMBOLS */         
*/*             IN PREFIX AND TCB PROPER.  TO GET ADDRESSABILITY FOR */         
*/*             THE TCB EXTENSION, YOU SHOULD CODE:                  */         
*/*                                                                  */         
*/*             L     REG,TCBEXT2                                    */         
*/*             USING TCBXTNT2,REG                                   */         
*/*             WHERE REG IS ANY REGISTER OTHER THAN ZERO.           */         
*/*                                                                  */         
*/*                                                                  */         
*/*      BAL LISTING  - SPECIFY LIST=YES ON MACRO CALL.              */         
*/*                                                                  */         
*/*      PL/S - DCL TCBPTR PTR                                       */         
*/*                                                                  */         
*/*                                                                  */         
*/*             MACRO VARIABLE TCBLEN IS SET TO THE LENGTH OF THE    */         
*/*             TCB INCLUDING THE PREFIX.                            */         
*/*                                                                  */         
*/*             VIA ATTRIBUTE - SPECIFY %IHAVIA='YES' PRIOR TO       */         
*/*                             INCLUDE STATEMENT.                   */         
*/*                             DECLARE TCBALET.                     */         
*/*                                                                  */         
*/*      PL/S LISTING - SPECIFY %IHALIST='YES' BEFORE %INCLUDE.      */         
*/*                                                                  */         
*/*01* DEPENDENCIES:                                                 */         
*/*      RTM MUST BE NOTIFIED of any changes to nondispatchability   */         
*/*      bits (modification of RTM code required).                   */         
*/*                                                                  */         
*/*01* DISTRIBUTION LIBRARY:  AMACLIB                                */         
*/*                                                                  */         
*/* END OF SPECIFICATIONS ********************************************/         
*%GOTO TCBL2;  /*                                                               
.*                                                                              
.**********************************************************************         
.*   CHANGE-ACTIVITY=                                                           
.*                                                                              
.*  OZ56255 - RESERVED FIELD TCBRV123 WILL BE USED BY RTM                       
.*            AS TCBRTM1C TO INDICATE THAT A TASK WITH EUT                      
.*            FRR HAS BEEN CANCELLED.                          @ZA56255         
.*  OZ63673 - CHANGE TCBDBTB TO TCBVAT                         @ZA63673         
.*  OZ67167 - DEFINE TCB NONDISPATCHABILITY BIT IN SUPPORT                      
.*            OF OZ50029.                                      @ZA67167         
.*  OZ72701 - TCB EXPANSION                                    @ZA72701         
.*  OZ84893 - DEFINE TCBNCTL FOR RACF                          @ZA84893         
.*  OZ93650 - DEFINE TCBRTMDE IN TCBFBYT3 TO INDICATE          @ZA93650         
.*                 THAT DETACH HAS BEEN CALLED BY RTM          @ZA93650         
.*  OY02725 - DEFINE TCBFJMCT TO INDICATE THE NUMBER OF        @YA02725         
.*            OUTSTANDING STEP-MUST-COMPLETE REQUESTS ISSUED   @YA02725         
.*            BY THE TASK.                                     @YA02725         
.*                                                                              
.*  $L1=GRSRAS   JBB1326  812104  PD16XB:  GRS END OF TASK                      
.*  $H1=ADVPROC2 JBB2133  821013  PD16F5:  AXP                                  
.*  $H2=VF       JBB2214  840409  PD16XK:  VECTOR FEATURE                       
.*  $L2=AR       HBB3310  860106  PD16Q9:  ACCESS REGISTERS                     
.*  $D1=DCR0060  HBB3310  861020  PD16LD:  NON-RETRYABLE ERROR                  
.*  $01=OY08579  JBB2220  861231  PD16H5:  TCB AND SRB TIMING SUPPORT           
.*  $02=OY43183  HBB3310  910523  PD16IG:  COMMON EXECUTION LIBRARY SPE         
.*  $03=OY44268  JBB2220  910612  PD16IG:  Add TCBNDSMF bit to TCBNDSP3         
.*  $L3=DBFMC    HBB4430  901109  PD16IG:  ADD TCBFBYT4, TCBFMC                 
.*  $L4=DBFMC    HBB4430  910327  PD16CU:  ADD TCBSMCP                          
.*  $04=OY49811  JBB4422  911218  PD16CU:  Add TCBFXSET bit to TCBFLGS3         
.*  $D2=DCR0047  HBB4430  920529  PD16CU:  Change FMC to PMC                    
.*  $L5=DISPR    HBB5510  930503  PD16CU:  Dispatcher Restructure               
.*  $L6=PR510    HBB5510  930520  PD16H5:  Cleanup and CDPI                     
.*  $P1=PIG1087  HBB5510  930520  PD16IG:  Add new GUPI flag byte field         
.*                                         TCBFLGS8, with TCBDYING bit          
.*  $P2=PIG2172  HBB5510  930520  PD16IG:  Add &SYS back                        
.*  $L7=PARAD    HBB5510  930909  PD16IG:  RTM Parallel Detach support:         
.*                                         Add TCBPVICT bit to TCBFBYT3         
.*  $P3=PIG3697  HBB5510  931110  PD16EI:  TCBSTCB GUPI                         
.*  $P4=PIG3637  HBB5510  931129  PD162M:  Add TCBNDNYI bit to TCBNDSP3         
.*  $P5=PN70151  HBB5520  940210  PD162M:  Change TCBFOE, TCBFRS,               
.*                                         TCBMDIDS, TCBRPT, TCBDAR,            
.*                                         TCBTSDP, TCBTSLP to DMTI,            
.*                                         TCBRV316 to GUPI, and                
.*                                         TCBLLS to PSPI                       
.*  $05=OW07164  HBB5510  940804  PD81KD:  Add TCBPKING and also move           
.*                                         TCBPVICT to TCBRBYT1                 
.*  $06=OW14392  HBB5510  950727  PD81KD:  Add TCBPCAND, TCBPTOP,               
.*                                         and TCBTDORM                         
.*  $07=OW18885  HBB5510  960311  PDKD:    Add TCBNOJLB                         
.*  $P6=PWK0719  HBB6608  990208  PDKD:    TCBPIE is now a 31-bit addr          
.*                                         with no subfields                    
.*  $L8=CICSOSUP JBB6609  980928  PD00XB:  KEY=NINE                             
.*  $08=OW47908  HBB6605  010129  U2IAXZ:  Add TCBNOIRB                         
.*  $P7=PYM0360  HBB7706  010720  U2IAXZ:  Clarify the meaning of               
.*                                         TCBTID. FIN APAR OW49439.            
.*  $L9=PADS2    HBB7707  010920  PD00XB:  TCBJTCBA, TCBPROPF                   
.*  $P8=PYN0153  HBB7708  011231  PDKD:    Update TCBPIE documentation\         
.*  $P9=PJKxxxx  HBB7709  030801  PDXB:    TCBDFRBP                             
.*  $LA=ME01601  HBB7720  040303  PD00XB:  Memterm Dump                         
.*  $LB=HCR8     HBB7730  050910  PD00XB:  TCBHCRM                              
.*  $09=OA13705  HBB7707  051012  U2IAXZ:  Make TCBTDORM ABNL.                  
.*  $LC=ME06988  HBB7740  060609  PD00XB:  TCBSENVP                             
.*  $LD=ME06835  HBB7740  060620  PD00KC:  TCBATSKL                             
.*  $LE=ME09493  HBB7740  070301  PD00XB:  TCB_RefrProt_Override                
.*     =ME10085  HBB7750  070613  PD00KD:  Copyright update                     
.*  $LF=DDMINF   HBB7760  080721  PD00JK:  TCBDSECT keyword                     
.*  $LG=ME16308  HBB7770  090701  PD00XB:  TCBSDNDX                             
.*  $0C=OA29419  HBB7730  090611  PD00KD:  TCBENDNG                             
.*  $0D=OA31571  HBB7740  100115  PD00KP:  TCB_KEEP_LS_EXTENT_VALID.            
.*                                         In support of OA31565                
.*  $LH=ME18709  HBB7770  100309  PD00KD:  TCBEndingAbnormally                  
.*  $0E=OA33406  HBB7750  100701  PD00XB:  TCBNDJL                              
.*  $PA=ME19747  HBB7780  100814  PD00XB:  Re-add dropped line                  
.*  $PB=ME27287  HBB77A0  141205  PD00KD:  Remove TCBAECB and update            
.*                                         TCBFDW explanation                   
.*  $LI=ME28886  HBB77A0  150223  PD00XB:  TCBPKFU                              
.*  $0F=OA48019  HBB7780  150612  PD00KP:  TCB_PThreadTermAbnormal. In          
.*                                         support of OA48017/OA48021           
.*  $LJ=RMODE64  HBB77B0  150901  PD00XB:  TCBRSMRC                             
.*  $LK=GSF      HBB77B0  150923  PD00KD:  TCBNDGSF                             
.*  $0G=OA53290  HBB7780  170701  PD00XB:  TCBSIQEO                             
.*  $0H=OA53617  HBB7790  170701  PD00XB:  TCBDEBL                              
.*  $PC=W213593  HBB77C0  171128  PD00XB:  Move TCBDEBL (213412)                
.*  $0I=OA62619  HBB77C0  220301  PD00XB:  TCB_IEAVALCK_1                       
.*                                                                              
.**********************************************************************         
.*                                                                              
.* THE FOLLOWING ARE THE NAMING CONVENTIONS USED FOR RESERVED AREAS             
.*     1. RESERVED FIELDS ARE NAMED AS FOLLOWS                                  
.*        A. TCB PROPER                                                         
.*                     TCBRXXX  DS    ???      - RESERVED.                      
.*                         XXX IS THE OFFSET WITHIN THE TCB PROPER              
.*                         ??? IS THE FIELD SIZE                                
.*        B. TCB EXTENSION                                                      
.*                     TCBRXXX@ DS    ???      - RESERVED.                      
.*                         XXX IS THE OFFSET WITHIN THE TCB EXTENSION           
.*                         @   IS THE CHARACTER X INDICATING EXTENSION          
.*                         ??? IS THE FIELD SIZE                                
.*                                                                              
.*     2. PL/S - RESERVED FIELDS DEFINED AS BIT STRINGS WHICH ARE NOT           
.*               MULTIPLES OF 8 OR DO NOT START ON A BYTE BOUNDARY              
.*               ARE NOT NAMED.                                                 
.*                                                                              
.*     3. A BIT FIELD IS NOT NAMED TO INDICATE IT IS RESERVED.                  
.*                                                                              
.**********************************************************************         
.*                                                                              
         AIF   ('&SYS' EQ '').A1                                   @P2A         
         MNOTE *,'SYS KEYWORD IS NO LONGER SUPPORTED. IT IS IGNORED.'  X        
                                                                   @P2A         
.A1      ANOP                                                                   
         PUSH  PRINT                                                            
         AIF   ('&LIST' EQ 'YES').TCB10                                         
         PRINT OFF                                                              
.TCB10   ANOP                                                                   
*                                                                               
*              TCB PREFIX                                                       
*                                                                               
         AIF   ('&DSECT' EQ 'NO').NODSCT                                        
TCBFIX   DSECT , -     TCBPTR-32                                                
         AGO   .CONT                                                            
.NODSCT  ANOP                                                                   
         DS    0D                                                               
TCBFIX   EQU   * -     TCBPTR-32                                                
.CONT    ANOP                                                                   
*                                                                               
TCBFRS   DS    0CL32 - FLOATING POINT REGISTER SAVE AREA                        
TCBFRS0  DS    D -     SAVE AREA FOR FLOATING POINT REGISTER 0                  
TCBFRS2  DS    D -     SAVE AREA FOR FLOATING POINT REGISTER 2                  
TCBFRS4  DS    D -     SAVE AREA FOR FLOATING POINT REGISTER 4                  
TCBFRS6  DS    D -     SAVE AREA FOR FLOATING POINT REGISTER 6                  
TCBPXLEN EQU   *-TCBFIX LENGTH OF PREFIX SECTION                                
*                                                                               
*              TCB PROPER                                                       
*                                                                               
         DS    0D                                                               
         AIF   ('&TCBDSECT' EQ 'NO').NOTDSCT                    4@LFA           
TCB      DSECT , -     TCBPTR                                                   
         AGO   .TCONT                                                           
.NOTDSCT ANOP                                                                   
TCB      EQU   * -     TCBPTR                                                   
.TCONT   ANOP                                                                   
*                                                                               
TCBRBP   DS    A -     ADDRESS OF THE RB FOR EXECUTING PROGRAM.  THIS           
*                      OFFSET FIXED BY ARCHITECTURE.           @G50EP9A         
TCBPIE   DS    A -     Address of current PIE/EPIE.  This field    @P8C         
*                      may be tested for zero to determine that there           
*                      currently is no SPIE/ESPIE exit established              
*                      for this task                                            
*                      Ownership: RTM                                           
*                      Serialization: Local Lock                                
TCBDEB   DS    A -     ADDRESS OF THE DEB QUEUE                                 
TCBTIO   DS    A -     ADDRESS OF THE TASK I/O TABLE (TIOT)                     
TCBCMP   DS    0BL4 -  TASK COMPLETION CODE AND INDICATORS                      
TCBCMPF  DS    B -     INDICATOR FLAGS                                          
TCBCREQ  EQU   X'80' - A DUMP HAS BEEN REQUESTED                                
TCBCSTEP EQU   X'40' - A STEP ABEND HAS BEEN REQUESTED                          
TCBCPP   EQU   X'20' - SOME PROBLEM PROGRAM STORAGE WAS OVERLAID BY THE         
*                      SECOND LOAD OF ABEND.  A FIRST LOAD OVERLAY IS           
*                      INDICATED IN TCBFLGS FIELD (OFFSET 29 DECIMAL).          
*                      (OS/VS1)                                                 
TCBDMPO  EQU   X'20' - DUMP OPTIONS WERE PROVIDED ON CALLRTM OR SETRP           
*                      MACRO                                                    
TCBSTCC  EQU   X'10' - COMPLETION CODE IS NOT TO BE STORED IN TCBCMPC           
*                      (OFFSET 17 DECIMAL) IF AN ABEND IS ENCOUNTERED.          
*                      THIS IS TO PREVENT AN OVERLAY OF THE ORIGINAL            
*                      COMPLETION CODE.  (OS/VS1)                               
TCBNOCC  EQU   X'10' - A COMPLETION CODE WAS NOT PROVIDED ON CALLRTM            
*                      MACRO.  A DEFAULT CODE IS BEING USED.                    
TCBCDBL  EQU   X'08' - A DOUBLE ABEND HAS OCCURRED (OS/VS1)                     
TCBCASID EQU   X'08' - ABEND WAS SCHEDULED VIA CROSS MEMORY ABTERM              
TCBCWTO  EQU   X'04' - A DUMP MESSAGE (WTO) IS TO BE ISSUED TO THE              
*                      OPERATOR (OS/VS1)                                        
TCBARCV  EQU   X'04' - INDICATES REASON CODE (TCBARC) IS VALID                  
TCBRV316 EQU   X'04' - Same as TCBARCV                                          
TCBCIND  EQU   X'02' - ABEND TO OUTPUT AN INDICATIVE DUMP  (OS/VS1)             
*                                                              @X04DA9A         
TCBCMSG  EQU   X'01' - AN ABEND MESSAGE IS PROVIDED TO BE PRINTED BY            
*                      ABDUMP (OS/VS1)                                          
TCBCMPC  DS    BL3 -   SYSTEM COMPLETION CODE IN FIRST 12 BITS,                 
*                      USER COMPLETION CODE IN LAST 12 BITS                     
TCBTRN   DS    0A -    ADDRESS OF TESTRAN CONTROL CORE TABLE                    
TCBABF   DS    B -     FLAG BYTE                                                
TCBMOD91 EQU   X'80' - BOTH TESTRAN AND DECIMAL SIMULATOR ON A MOD 91           
TCBNOCHK EQU   X'40' - SUPPRESS TAKING CHECKPOINTS FOR THIS STEP                
*                      (JOB STEP TCB)                                           
TCBGRPH  EQU   X'20' - GAM/SP ACTIVE FOR THIS TASK                              
TCB_Refrprot_Override EQU X'10' - Even if the REFRPROT option is                
*                      active, do not apply REFRPROT rules                      
*                      to LOADs under this task.                   @LEA         
TCBTCPP  EQU   X'08' - TCAM POST-PENDING  (RORI)                                
TCBTCP   EQU   X'04' - TEST TASK - USED BY TEST SVC                             
TCBOLTEP EQU   X'02' - OLTEP FUNCTIONS REQUIRE CLEANUP BEFORE ABNORMAL          
*                      TERMINATION CAN BE INVOKED                               
TCBDFRBP EQU   X'01' - Issue SVC 61 upon fetch. Set only when      @P9A         
*                      SVC 61 is being intercepted for deferred    @P9A         
*                      breakpoint processing                       @P9A         
TCBTRNB  DS    AL3 -   ADDRESS OF TESTRAN CONTROL CORE TABLE                    
TCBMSS   DS    0A -    ADDRESS OF LAST SPQE ON MSS QUEUE                        
         DS    X -     HIGH ORDER BYTE OF TCBMSS                   @H2C         
TCBMSSB  DS    AL3 -   SAME AS TCBMSS                              @L6C         
TCBPKF   DS    B -     STORAGE PROTECTION KEY FOR THIS TASK.  IF THERE          
*                      IS NO STORAGE PROTECTION, ALL BITS ARE ZERO.             
TCBPKFU  EQU   X'80'   When on, user key                           @LIA         
TCBFLAG  EQU   X'F0' - STORAGE PROTECTION KEY                                   
TCBZERO  EQU   X'0F' - MUST BE ZERO                                             
TCBFLGS  DS    0BL5 -  FLAG BYTE FIELDS                                         
TCBFLGS1 DS    B -     FIRST TCB FLAG BYTE                                      
TCBFA    EQU   X'80' - May be on when a task is being abnormally   @LHC         
*                      terminated.  Do NOT use this bit as an indicator         
*                      in any program. It is not an intended interface.         
*                      See the TCBEndingAbnormally bit for program use.         
*                      Also see TCBDYING and TCBENDNG.                          
TCBFE    EQU   X'40' - On when the system is calling resource      @L6C         
*                      managers during abnormal termination.                    
TCBFERA  EQU   X'20' - ENTER ABEND ERASE ROUTINE WHEN IN CONTROL AGAIN          
TCBNONPR EQU   X'10' - TASK IS NON-PREEMPTABLE                                  
*                                                              @Z40FP9A         
TCBPDUMP EQU   X'08' - PREVENT DUMP INDICATOR                                   
TCBFT    EQU   X'04' - TOP TASK IN TREE BEING ABTERMED                          
TCBFS    EQU   X'02' - ABTERM DUMP COMPLETED                                    
*                      PROBLEM PROGRAM STORAGE HAS BEEN OVERLAID TO             
*                      PROCESS ABEND  (OS/VS1)                                  
TCBFX    EQU   X'01' - PROHIBIT QUEUEING OF ASYNCHRONOUS EXITS FOR              
*                      THIS TASK                                                
TCBFLGS2 DS    B -     SECOND FLAG BYTE                                         
TCBFOINP EQU   X'80' - THE TASK IS ABENDING AND IS IN THE PROCESS OF            
*                      (1) OPEN FOR DUMP DATA SET PROCESSING,                   
*                      (2) CLOSE FOR USER DATA SET OR                           
*                      (3) PURGE FOR ENQ'ED RESOURCES.  THIS BIT IS             
*                      USED IN CONJUNCTION WITH TCBSTACK.                       
*                                                                ICB374         
TCBFSTI  EQU   X'40' - SECOND JOB STEP INTERVAL HAS EXPIRED                     
*                      (INITIATOR TCB)                                          
TCBFABOP EQU   X'20' - IF 1, THE SYSABEND DUMP DATA SET HAS BEEN OPENED         
*                      FOR ABEND.  IF 0, THE SYSUDUMP DUMP DATA SET WAS         
*                      OPENED.  THIS BIT IS ONLY USED FOR THE JOB STEP          
*                      TCB AND IS USED IN CONJUNCTION WITH TCBFDSOP             
*                      BIT.                                      YM0651         
TCBFSMC  EQU   X'10' - TASK HAS ISSUED A SYSTEM-MUST-COMPLETE AND SET           
*                      ALL OTHER TASKS IN THE SYSTEM NONDISPATCHABLE            
TCBFJMC  EQU   X'08' - TASK HAS ISSUED A STEP-MUST-COMPLETE AND TURNED          
*                      OFF ALL OTHER TASKS IN THE STEP                          
TCBFDSOP EQU   X'04' - SYSABEND OPEN FOR JOB STEP                               
TCBFETXR EQU   X'02' - ETXR TO BE SCHEDULED                                     
TCBFTS   EQU   X'01' - THIS TASK IS A MEMBER OF A TIME-SLICED GROUP             
TCBFLGS3 DS    B -     THIRD FLAG BYTE.                        @G381P9A         
*                      SERIALIZATION - TCBACTIV OR TASK        @G381P9A         
*                      NONDISPATCHABLE AND LOCAL LOCK          @G381P9A         
TCBFSM   EQU   X'80' - ALL PSW'S IN SUPERVISOR STATE                            
TCBRT1S  EQU   X'40' - RTM1 HAS INVOKED SLIP FOR A TASK IN EUT MODE.            
*                      RTM2 MAY BYPASS SLIP PROCESSING                          
*                      OWNERSHIP - RTM                         @G381P9A         
TCBABTRM EQU   X'20' - ABTERM BIT TO PREVENT MULTIPLE ABENDS                    
TCBFXSET EQU   X'10' - TCBFX WAS SET BY STATUS MCSTEP              @04A         
TCBKEY9 EQU    X'04' - TCB was attached using KEY=NINE and so is to be          
*                      treated as having a different key than the               
*                      attacher                                    @L8A         
TCBENQRM EQU   X'02' - ENQ/DEQ RESOURCE MANAGER HAS RECEIVED   @G381P9A         
*                      CONTROL. NO FURTHER DIRECTED ENQS       @G381P9A         
*                      ALLOWED.                                @G381P9A         
*                      SERIALIZATION - TCBACTIV AND CMSEQDQ    @G381P9A         
*                      CLASS LOCK.                             @G381P9A         
*                      OWNERSHIP - GRS.                        @G381P9A         
TCBDWSTA EQU   X'01' - THIS TASK WAS DETACHED WITH STAE=YES OPTION              
*                                                                ICB315         
TCBFLGS4 DS    B -     NONDISPATCHABILITY FLAGS                                 
TCBNDUMP EQU   X'80' - ABDUMP NONDISPATCHABILITY INDICATOR                      
TCBSER   EQU   X'40' - SER1 NONDISPATCHABILITY INDICATOR                        
TCBRQENA EQU   X'20' - I/O RQE'S EXHAUSTED                                      
TCBHNDSP EQU   X'10' - TASK OR JOB STEP IS MOMENTARILY 'FROZEN' UNTIL           
*                      THE REQUIRED RESOURCES ARE AVAILABLE.  THE BIT           
*                      IS SET THROUGH THE USE OF THE 'STATUS' SVC               
*                                                                ICB453         
TCBUXNDV EQU   X'08' - TASK IS TEMPORARILY NONDISPATCHABLE BECAUSE              
*                      SMF TIME LIMIT OR SYSOUT LIMIT USER EXIT                 
*                      ROUTINE IS BEING EXECUTED FOR THIS STEP                  
TCBRBWF  EQU   X'04' - TOP RB IS IN WAIT STATE                 @G50DP9A         
TCBONDSP EQU   X'01' - TASK TERMINATING AND NONDISPATCHABLE BECAUSE             
*                      EITHER OPEN FOR DUMP DATA SET IS IN PROCESS OR           
*                      CLOSE BY ABEND IS IN PROCESS                             
TCBFLGS5 DS    B -     MORE NONDISPATCHABILITY FLAGS.   IF ANY BIT IN           
*                      THIS BYTE IS 1, THE TASK IS NONDISPATCHABLE.             
TCBFC    EQU   X'80' - TASK TERMINATED                                          
TCBABWF  EQU   X'40' - ABNORMAL WAIT                                            
TCBUXNDF EQU   X'40' - TASK IS TEMPORARILY NONDISPATCHABLE BECAUSE              
*                      SMF TIME LIMIT OR SYSOUT LIMIT USER EXIT ROUTINE         
*                      IS BEING EXECUTED FOR THIS STEP.  THIS BIT IS            
*                      SET TO 1 IN ALL TCB'S EXCEPT JOB STEP TCB.               
*                      (OS/VS1)                                  ICB263         
TCBPAGE  EQU   X'20' - TASK IS NONDISPATCHABLE DUE TO EXCESSIVE PAGING          
*                      RATE                                                     
TCBANDSP EQU   X'10' - TASK IS TEMPORARILY NONDISPATCHABLE BECAUSE IT           
*                      WAS ATTACHED UNDER THE DISP=NO OPERAND                   
TCBSYS   EQU   X'08' - ANOTHER TASK IS IN SYSTEM-MUST-COMPLETE STATUS           
*                      OR A SUMMARY BIT FOR FIELD TCBSYSCT                      
TCBSTP   EQU   X'04' - ANOTHER TASK IN THIS JOB STEP IS IN                      
*                      STEP-MUST-COMPLETE STATUS                                
TCBFCD1  EQU   X'02' - INITIATOR WAITING FOR REGION                             
TCBPNDSP EQU   X'01' - PRIMARY NONDISPATCHABILITY BIT.   THIS BIT IS            
*                      SET TO 1 IF ANY OF THE SECONDARY                         
*                      NONDISPATCHABILITY BITS (OFFSETS 173, 174, 175,          
*                      200 OR 201 DECIMAL) IS SET TO 1.  THIS BIT IS            
*                      SET TO 0 IF A SECONDARY NONDISPATCHABILITY BIT           
*                      IS SET TO 0 AND ALL OTHER SECONDARY                      
*                      NONDISPATCHABILITY BITS ARE 0.                           
TCBLMP   DS    FL1 -   TASK LIMIT PRIORITY                                      
TCBDSP   DS    FL1 -   DISPATCHING PRIORITY FOR THIS TASK                       
TCBLLS   DS    A -     ADDRESS OF LAST LOAD LIST ELEMENT (LLE) IN LOAD          
*                      LIST                                                     
TCBJLB   DS    A -     ADDRESS OF A JOBLIB DCB                                  
TCBJPQ   DS    0A -    ADDRESS OF LAST CDE FOR JOB PACK AREA (JPA)              
*                      CONTROL QUEUE                                            
TCBPURGE DS    B -     HIGH ORDER BYTE                         @G860PXB         
TCBJPQF  EQU   X'80' - JPQ PURGE FLAG                                           
TCBJPQB  DS    AL3 -   LOW ORDER 24-BITS OF TCBJPQ             @G860PXB         
TCBGRS   DS    0CL64 - GENERAL REGISTER SAVE AREA.  THIS OFFSET FIXED           
*                      BY ARCHITECTURE.                        @G50EP9A         
TCBGRS0  DS    F -     SAVE AREA FOR GENERAL REGISTER 0                         
TCBGRS1  DS    F -     SAVE AREA FOR GENERAL REGISTER 1                         
TCBGRS2  DS    F -     SAVE AREA FOR GENERAL REGISTER 2                         
TCBGRS3  DS    F -     SAVE AREA FOR GENERAL REGISTER 3                         
TCBGRS4  DS    F -     SAVE AREA FOR GENERAL REGISTER 4                         
TCBGRS5  DS    F -     SAVE AREA FOR GENERAL REGISTER 5                         
TCBGRS6  DS    F -     SAVE AREA FOR GENERAL REGISTER 6                         
TCBGRS7  DS    F -     SAVE AREA FOR GENERAL REGISTER 7                         
TCBGRS8  DS    F -     SAVE AREA FOR GENERAL REGISTER 8                         
TCBGRS9  DS    F -     SAVE AREA FOR GENERAL REGISTER 9                         
TCBGRS10 DS    F -     SAVE AREA FOR GENERAL REGISTER 10                        
TCBGRS11 DS    F -     SAVE AREA FOR GENERAL REGISTER 11                        
TCBGRS12 DS    F -     SAVE AREA FOR GENERAL REGISTER 12                        
TCBGRS13 DS    F -     SAVE AREA FOR GENERAL REGISTER 13                        
TCBGRS14 DS    F -     SAVE AREA FOR GENERAL REGISTER 14                        
TCBGRS15 DS    F -     SAVE AREA FOR GENERAL REGISTER 15                        
TCBFSA   DS    0A -    ADDRESS OF THE FIRST PROBLEM PROGRAM SAVE AREA           
         DS    FL1 -   FIRST BYTE OF TCBFSA                    @G381P9A         
TCBFSAB  DS    AL3 -   ADDRESS OF THE FIRST PROBLEM PROGRAM SAVE AREA           
TCBTCB   DS    A -     Queue of TCBs in an address space.          @L5C         
*                      Note:  The queue is not maintained in priority           
*                             order.                                            
TCBTME   DS    A -     ADDRESS OF THE TIMER QUEUE ELEMENT (TQE)                 
TCBTQET  EQU   X'80' - IF ZERO, TASK TYPE TQE.                                  
*                      IF ONE, REAL/WAIT TYPE TQE.                              
TCBJSTCB DS    0A -    Address of job step TCB for this TCB                     
         DS    X -     HIGH ORDER BYTE OF TCBJSTCB             @G860PXB         
TCBJSTCA DS    AL3 -   LOW ORDER 24 BITS OF TCBJSTCB           @G860PXB         
TCBNTC   DS    A -     ADDRESS OF THE TCB FOR THE TASK PREVIOUSLY               
*                      ATTACHED BY THE TASK THAT ATTACHED THIS TASK.            
*                      FOR EXAMPLE, IF TASK A ATTACHED TASK B AND THEN          
*                      TASK C, THIS FIELD IN TASK C'S TCB POINTS TO             
*                      TASK B'S TCB, AND THIS FIELD IN TASK B'S TCB             
*                      IS ZERO.                                                 
TCBOTC   DS    A -     ADDRESS OF THE TCB FOR THE TASK (THE ORIGINATING         
*                      TASK) THAT ATTACHED THIS TASK.  THIS FIELD IS            
*                      ZERO IN THE TCB FOR A SYSTEM TASK.                       
TCBLTC   DS    A -     ADDRESS OF THE TCB FOR THE TASK LAST ATTACHED BY         
*                      THIS TASK.  NOTE - IF A TASK (THE ORIGINATING            
*                      TASK) HAS ATTACHED OTHER TASKS, THE TCB'S FOR            
*                      THE OTHER TASKS ARE ON THE SUBTASK QUEUE OF THE          
*                      ORIGINATING TASK.  TCBLTC IN THE TCB FOR THE             
*                      ORIGINATING TASK POINTS TO THE LAST TCB (THE             
*                      TCB FOR THE LAST ATTACHED TASK) IN THE SUBTASK           
*                      QUEUE.  IN EACH TCB ON THE SUBTASK QUEUE,                
*                      EXCEPT THE FIRST TCB, TCBNTC POINTS TO THE               
*                      PRECEDING TCB ON THE QUEUE.                              
TCBIQE   DS    A -     ADDRESS OF AN INTERRUPTION QUEUE ELEMENT (IQE)           
*                      FOR SCHEDULING THE ETXR ROUTINE OF THE TASK              
*                      THAT ATTACHED THIS TASK.                                 
TCBECB   DS    A -     ADDRESS OF THE ECB THAT WILL BE POSTED BY THE            
*                      SUPERVISOR'S TASK TERMINATION ROUTINES WHEN              
*                      NORMAL OR ABNORMAL TERMINATION OCCURS.                   
TCBTSFLG DS    B -     TIME SHARING FLAGS                                       
TCBTSTSK EQU   X'80' - SWAPPED TIME SHARING TASK (OS/VS1)                       
TCBSTPPR EQU   X'40' - TASK SHOULD BE MADE NONDISPATCHABLE VIA TCBSTPP          
*                      WHEN IT IS NO LONGER RUNNING A PRIVILEGED                
*                      PROGRAM                                                  
TCBATT   EQU   X'20' - TASK SHOULD NOT HAVE ATTENTION EXITS SCHEDULED           
*                      ON IT BY EXIT EFFECTOR.  THIS OFFSET FIXED BY            
*                      ARCHITECTURE.                           @G50EP9A         
TCBTIOTG EQU   X'10' - PURGE TGET/TPUT AFTER ATTENTION                          
TCBSMCP  EQU   X'08' - STATUS MCSTEP PENDING,TASK IS SUSPENDED     @L4A         
TCBDYDSP EQU   X'02' - M195 TASK IS MEMBER OF DYNAMIC DISPATCHING               
*                      GROUP                                     ICB262         
TCBCPUBN EQU   X'01' - FOR M195, ZERO MEANS I/O BOUND AND ONE MEANS             
*                      CPU BOUND                                 ICB262         
TCBSTPCT DS    FL1 -   NUMBER OF SETTASK STARTS WHICH MUST BE                   
*                      ISSUED BEFORE TASK IS MADE DISPATCHABLE -                
*                      FIELD NOT RESTRICTED TO TSO                              
TCBTSLP  DS    FL1 -   LIMIT PRIORITY OF TIME SHARING TASK                      
TCBTSDP  DS    B -     DISPATCHING PRIORITY OF TIME SHARING TASK                
TCBRD    DS    A       POINTER TO DPQE MINUS 8 FOR THE JOB STEP                 
*                                                              @G860PVB         
*                      SERIALIZATION - THE LOCAL LOCK.         @G860PXU         
*                      OWNERSHIP - VSM.                        @G860PXU         
TCBPQE   EQU   TCBRD   SAME AS TCBRD                           @G860PVB         
TCBAE    DS    A       LIST ORIGIN OF AQE(S) FOR THIS TASK                      
*                      SERIALIZATION - THE LOCAL LOCK.         @G860PXU         
*                      OWNERSHIP - VSM.                        @G860PXU         
TCBAQE   EQU   TCBAE   SAME AS TCBAE                           @G860PVB         
TCBSTAB  DS    0A -    ADDRESS OF THE CURRENT STAE CONTROL BLOCK                
TCBNSTAE DS    B -     FLAGS INTERNAL TO STAE ROUTINE                           
TCBSTABE EQU   X'80' - ABEND ENTERED BECAUSE OF ERROR IN STAE                   
*                      PROCESSING                                               
TCBQUIES EQU   X'40' - STAE INVOKED PURGE I/O ROUTINE WITH QUIESCE I/O          
*                      OPTION                                                   
TCB33E   EQU   X'20' - A 33E ABEND HAS OCCURRED FOR TASK                        
TCBPPSUP EQU   X'10' - 1=SUPERVISOR MODE,0=PROBLEM PROGRAM MODE                 
*                      INDICATOR TO SYNCH OF THE MODE OF THE USER               
*                      EXIT                                    @ZM49655         
TCBHALT  EQU   X'08' - PURGE I/O ROUTINE DID NOT SUCCESSFULLY QUIESCE           
*                      I/O, BUT I/O WAS HALTED                                  
TCBSYNCH EQU   X'04' - SYNCH ISSUED BY ASIR TO SCHEDULE EXIT ROUTINE            
*                                                              @ZM49655         
TCBSTCUR EQU   X'01' - STAE RECURSION VALID                      ICB443         
TCBSTABB DS    AL3 -   ADDRESS OF THE CURRENT STAE CONTROL BLOCK                
TCBTCT   DS    0A -    ADDRESS OF THE TIMING CONTROL TABLE (TCT) IF             
*                      SYSTEM MANAGEMENT FACILITIES (SMF) DATA IS BEING         
*                      COLLECTED FOR THE TASK.  ZERO IF SMF DATA IS NOT         
*                      BEING COLLECTED FOR THE TASK.           @Z30AQ9A         
*                      SERIALIZATION: LOCAL LOCK.                               
TCBTCTGF DS    B -     FLAG BYTE FOR TIMING CONTROL TABLE        ICB318         
TCBSMFGF EQU   X'80' - IF ZERO, THE TCT CORE TABLE IS NOT TO BE                 
*                      UPDATED BY GETMAIN/FREEMAIN.                             
*                      IF ONE, THE TCT CORE TABLE IS TO BE UPDATED BY           
*                      GETMAIN/FREEMAIN.                         ICB318         
TCBTCTB  DS    AL3 -   ADDRESS OF THE TIMING CONTROL TABLE (TCT) IF             
*                      SYSTEM MANAGEMENT FACILITIES (SMF) DATA IS BEING         
*                      COLLECTED FOR THE TASK.  ZERO IF SMF DATA IS NOT         
*                      BEING COLLECTED FOR THE TASK OR FOR OS/VS1, IF           
*                      SMF IS NOT IN THE SYSTEM.               @Z30AQ9A         
TCBUSER  DS    A -     A WORD AVAILABLE TO THE USER                             
TCBSCNDY DS    0BL4 -  SECONDARY NONDISPATCHABILITY BITS.   IF ANY BIT          
*                      IN THE FOLLOWING FOUR BYTES IS 1, THE PRIMARY            
*                      NONDISPATCHABILITY BIT (OFFSET 33.7 DECIMAL)             
*                      IS 1, AND THE TASK IS NONDISPATCHABLE.                   
TCBNDSP  DS    0BL4 -  SAME AS TCBSCNDY                                         
TCBNDSP0 DS    B -     BYTE 0                                                   
TCBNDGSF EQU   X'02'   Temporarily nondispatchable for GSF         @LKA         
TCBNDJL  EQU   X'01'   Join/Leave processing                       @0EA         
TCBNDSP1 DS    B -     BYTE 1                                                   
TCBDARTN EQU   X'80' - THE TASK IS TEMPORARILY NONDISPATCHABLE -                
*                      DAMAGE ASSESSMENT ROUTINE (DAR)                          
TNONDISP EQU   TCBDARTN * ALIAS *                                               
TCBDARPN EQU   X'40' - THE TASK IS PERMANENTLY NONDISPATCHABLE -                
*                      DAMAGE ASSESSMENT ROUTINE (DAR)                          
PNONDISP EQU   TCBDARPN * ALIAS *                                               
TCBRSTND EQU   X'20' - THE TASK IS TEMPORARILY NONDISPATCHABLE -                
*                      RECOVERY MANAGEMENT SUPPORT AND SYSTEM ERROR             
*                      RECOVERY (RMS/SER)                                       
TCBRSPND EQU   X'10' - THE TASK IS PERMANENTLY NONDISPATCHABLE -                
*                      RECOVERY MANAGEMENT SUPPORT AND SYSTEM ERROR             
*                      RECOVERY (RMS/SER)                                       
*                      (IF THIS BIT IS ON THEN THE PREVIOUS BIT                 
*                      MUST BE ON TOO)                                          
TCBDDRND EQU   X'08' - THE TASK IS IN DEVICE ALLOCATION AND DYNAMIC             
*                      DEVICE RECONFIGURATION (DDR) HAS MADE IT                 
*                      NONDISPATCHABLE -                                        
*                      RECOVERY MANAGEMENT SUPPORT AND SYSTEM ERROR             
*                      RECOVERY (RMS/SER)   (OS/VS1)                            
TCBTPSP  EQU   X'04' - DISPATCHING OF TCAM TASK MUST BE DELAYED UNTIL           
*                      TCAM I/O APPENDAGE OR SVC ROUTINE HAS COMPLETED          
*                      EXECUTION  (TCAM IN MULTIPROCESSING ENVIRONMENT)         
TCBPIEND EQU   X'02' - SRB IS TO BE SCHEDULED TO PERFORM PIE/PICA               
*                      PROCESSING (FIRST LEVEL INTERRUPT HANDLER)               
*                                                                               
TCBABTIN EQU   X'01' - THE TASK IS TEMPORARILY NONDISPATCHABLE WHILE            
*                      BEING SET UP FOR ABTERM                 @ZM46205         
TCBNDSP2 DS    B -     BYTE 2                                                   
TCBABD   EQU   X'80' - ABDUMP IS PROCESSING  (OS/VS1)                           
TCBSTPP  EQU   X'40' - TASK SET NONDISPATCHABLE BY SETTASK                      
TCBNDSVC EQU   X'20' - TASK IS NONDISPATCHABLE BECAUSE SVC DUMP IS              
*                      EXECUTING FOR ANOTHER TASK                               
TCBNDTS  EQU   X'10' - TASK IS NONDISPATCHABLE BECAUSE IT IS BEING              
*                      SWAPPED OUT                                              
TCBIWAIT EQU   X'08' - TASK IS NONDISPATCHABLE DUE TO AN INPUT WAIT             
TCBOWAIT EQU   X'04' - TASK IS NONDISPATCHABLE DUE TO AN OUTPUT WAIT            
TCBDSS   EQU   X'02' - DYNAMIC SUPPORT SYSTEM (DSS) HAS SET THIS                
*                      TASK NONDISPATCHABLE                      ICB313         
TCBABE   EQU   X'01' - ABEND ROUTINE WAS ENTERED FOR THIS TASK WHILE            
*                      THE DCB FOR SYSABEND (OR SYSUDUMP) DATA SET WAS          
*                      BEING OPENED FOR ANOTHER TASK  (OS/VS1)                  
TCBNDSP3 DS    B -     BYTE 3                                                   
TCBLJSND EQU   X'80' - TASK IS ABENDING AND NONDISPATCHABLE BECAUSE IT          
*                      HAS A JOB STEP SUBTASK.  TCBONDSP MUST ALSO BE           
*                      ON.                                                      
TCBNDNYI EQU   X'40' - RCT TASK IS NONDISPATCHABLE BECAUSE ADDRESS @P4A         
*                      SPACE IS NOT YET INITIALIZED FULLY                       
TCBSRBND EQU   X'20' - TCB NONDISPATCHABLE BECAUSE SRB'S ARE STOPPED            
TCBSLPER EQU   X'10' - SET NONDISPATCHABLE SO THAT SLIP/PER CAN ALTER           
*                      RB PSW PER BIT                          @G65RP9A         
TCBS3MR  EQU   X'08' - STAGE 3 EXIT EFFECTOR MUST RUN TO SYNCHRONIZE            
*                      ATTENTION INTERRUPT                     @ZM48358         
TCBAREQ  EQU   X'04' - TSO AUTHORIZED REQUEST PROCESSING ACTIVE                 
*                                                              @ZA67167         
TCBNDSMF EQU   X'02' - Indicates task is stopped because its CPU   @03A         
*                      or continuous wait time has been exceeded.  SMF          
*                      determines whether to grant extension or abend           
*                      task.                                                    
*                      Ownership: SMF.                                          
TCBNDINT EQU   X'01' - INITIATOR SETS THIS BIT TO PREVENT JOB STEP              
*                      EXECUTION IN ORDER TO DO CANCEL PROCESSING               
*                      (CAN CANCEL LOOP)                                        
TCBMDIDS DS    F -     RESERVED FOR MODEL-DEPENDENT SUPPORT AND FOR             
*                      IBM PROPRIETARY PROGRAMMING SUPPORT       ICBXXX         
TCBJSCB  DS    0A -    ADDRESS OF THE JOB STEP CONTROL BLOCK                    
TCBRECDE DS    B -     ABEND RECURSION BYTE                      ICB456         
TCBREC   EQU   X'80' - VALID REENTRY TO ABEND IF NON-ZERO VALUE IN              
*                      FOLLOWING 7 BITS                          ICB456         
TCBOPEN  EQU   X'01' - OPEN DUMP DATA SET                        ICB456         
TCBCLOSD EQU   X'02' - CLOSE DIRECT SYSOUT ON TAPE               ICB456         
TCBCLOSE EQU   X'03' - CLOSE OPEN DATA SETS                      ICB456         
TCBCLOSF EQU   X'04' - RESERVED.                                 ICB456         
TCBGREC  EQU   X'05' - GRAPHICS                                  ICB456         
TCBADUMP EQU   X'07' - ABDUMP                                    ICB456         
TCBPTAXE EQU   X'08' - PURGE TAXE                                ICB456         
TCBMESG  EQU   X'09' - MESSAGE RECURSION                         ICB456         
TCBDYNAM EQU   X'0A' - DD-DYNAM TIOT CLEANUP                     ICB456         
TCBDAMSG EQU   X'0B' - ABEND IS ISSUING A WTOR ASKING WHETHER THE JOB           
*                      STEP TASK SHOULD WAIT FOR THE DUMP AREA                  
*                      (OS/VS1)                                                 
TCBQTIP  EQU   X'0C' - PURGE TSO INTERPARTITION POSTS            ICB456         
TCBTCAMP EQU   X'0D' - PURGE TCAM INTERPARTITION POSTS           ICB456         
TCBINDRC EQU   X'0E' - INDICATIVE DUMP (LOAD 8 OF ABEND) HAS ABENDED.           
*                      ABEND WILL HANDLE THIS ABEND.  (OS/VS1)                  
TCBSAVCD EQU   X'0F' - ASIR RECURSION.  SAVE OLD COMPLETION CODE ICB456         
TCBTYP1W EQU   X'10' - TYPE 1 MESSAGE WRITE TO PROGRAMMER        ICB456         
TCBWTPSE EQU   X'20' - WRITE-TO-PROGRAMMER (WTP) FAILED.  JOB STEP              
*                      TIMER EXPIRED DURING JOB STEP ABEND AND THE              
*                      STAE EXIT IS DENIED.  (OS/VS1)          @X04DA9A         
TCBVTAM1 EQU   X'21' - ABEND IS ENTERING FIRST VTAM INTERFACE,                  
*                      ISTRAAA1, FOR TERMINATION OF TASK OR SUBTASK             
*                      (OS/VS1)                                @X31BH9A         
TCBVTAM2 EQU   X'22' - ABEND IS ENTERING SECOND VTAM INTERFACE,                 
*                      ISTRAAA2, BECAUSE ISTRAAA1 ABENDED  (OS/VS1)             
*                                                              @X31BH9A         
TCBVTAM3 EQU   X'23' - ABEND IS ENTERING FIRST VTAM INTERFACE,                  
*                      ISTRAAA0, BECAUSE VTAM ABENDED  (OS/VS1)                 
*                                                              @X04BH9A         
TCBVTAM4 EQU   X'24' - ABEND IS ENTERING SECOND VTAM INTERFACE,                 
*                      ISTRAAA2, BECAUSE ISTRAAA0 ABENDED  (OS/VS1)             
*                                                              @X04BH9A         
TCBNOSTA EQU   X'30' - STAE/STAI NOT TO BE HONORED               ICB456         
TCBSTRET EQU   X'31' - RETURN FROM DUMP PROCESSING               ICB456         
TCBCONVR EQU   X'32' - CONVERT TO STEP ABEND                     ICB456         
TCBDARET EQU   X'33' - RETURN FROM DAMAGE ASSESSMENT ROUTINES    ICB456         
TCBTYP1R EQU   X'34' - RETURN FROM TYPE 1 MESSAGE MODULE         ICB456         
TCBNEWRB EQU   X'35' - ABEND ISSUED SVC 13 TO TRANSFER CONTROL (XCTL)           
*                      TO A NON-ABEND MODULE                     ICB456         
TCBMCCNS EQU   X'40' - A MUST COMPLETE TASK HAS ABNORMALLY TERMINATED           
*                      WITHOUT ENOUGH STORAGE FOR 2 RB'S FOR A WTOR             
*                      ASKING WHETHER THE TASK'S RESOURCES ARE                  
*                      CRITICAL.  THE RESOURCES ARE ASSUMED TO BE               
*                      CRITICAL, AND THE PARTITION IS MARKED                    
*                      PERMANENTLY NONDISPATCHABLE. (OS/VS1)     ICB492         
TCBJSCBB DS    AL3 -   ADDRESS OF THE JOB STEP CONTROL BLOCK                    
TCBSSAT  DS    A -     ADDRESS OF THE SUBSYSTEM AFFINITY TABLE @G381P9A         
*                      (SSAT).                                 @G381P9A         
*                      SERIALIZATION - TCBACTIV.               @G381P9A         
*                      OWNERSHIP - TASK MANAGEMENT.            @G381P9A         
TCBIOBRC DS    A -     ADDRESS OF IOB RESTORE CHAIN FOR I/O QUIESCED            
*                      BY EOT                                    YM2840         
TCBEXCPD DS    A -     ADDRESS OF EXCP DEBUG AREA                YM4297         
TCBEXT1  DS    0A -    ADDRESS OF OS-OS/VS COMMON TCB EXTENSION  ICB311         
         DS    X -     RESERVED.                                   @H2C         
TCBEXT1A DS    AL3 -   ADDRESS OF OS-OS/VS COMMON TCB EXTENSION  ICB311         
*                                                                               
*              OS/VS1 - OS/VS2 COMMON SECTION                                   
*                                                                               
TCBBITS  DS    0BL4 -  FLAG BYTES.  IF A BIT IN THE FOLLOWING TWO BYTES         
*                      IS SET TO 1, THE PRIMARY NONDISPATCHABILITY BIT          
*                      (OFFSET 33.7 DECIMAL) IS SET TO 1, AND THE TASK          
*                      IS NONDISPATCHABLE.                                      
TCBNDSP4 DS    B -     SECONDARY NONDISPATCHABILITY FLAGS COMMON TO             
*                      OS/VS1 AND OS/VS2.  COORDINATED WITH PRIMARY             
*                      NONDISPATCHABILITY FLAG TCBPNDSP.   THIS BYTE IS         
*                      NOT CURRENTLY SUPPORTED BY OS/VS2.                       
TCBNDSP5 DS    B -     SECONDARY NONDISPATCHABILITY FLAGS UNIQUE TO             
*                      OS/VS1 OR OS/VS2.  COORDINATED WITH PRIMARY              
*                      NONDISPATCHABILITY FLAG TCBPNDSP.   THIS BYTE IS         
*                      NOT CURRENTLY SUPPORTED BY OS/VS2.                       
TCBFLGS6 DS    B -     TASK-RELATED FLAGS                                       
TCBRV    EQU   X'80' - THE PARTITION IS FIXED IN REAL STORAGE.  VIRTUAL         
*                      ADDRESSES ARE EQUAL TO REAL ADDRESSES.                   
TCBPIE17 EQU   X'40' - PAGE FAULT INTERRUPT IS TO BE PASSED TO THE              
*                      TASK'S INTERRUPT EXIT AND AN 8-BYTE PICA IS IN           
*                      EFFECT FOR THIS TASK                      ICB339         
TCBCPU   EQU   X'20' - TASK IS CPU-BOUND MEMBER OF AUTOMATIC PRIORITY           
*                      GROUP (APG)                                              
TCBSPVLK EQU   X'10' - TASK SCHEDULED FOR ABTERM WHILE OWNING                   
*                      SUPERVISOR LOCK                                          
TCBHCRM  EQU   X'08' - Health Checker has established a task term               
*                      resmgr for this task                        @LBC         
TCBMIGR  EQU   X'04' - REGION SELECTED FOR MIGRATION FROM PRIMARY               
*                      PAGING DEVICE                                            
TCBAPG   EQU   X'02' - TASK IS IN AUTOMATIC PRIORITY GROUP (APG)                
*                                                                               
TCBNTJS  EQU   X'01' - JOB STEP TASK BUT NOT HIGHEST IN FAILING TREE            
*                                                                               
TCBFLGS7 DS    B -     TASK-RELATED FLAGS                                       
TCBGPECB EQU   X'80' - TASK IS IN AN ECB WAIT FOR A GETPART                     
*                                                                ICB339         
TCBSENVP EQU   X'40' -                                             @LCA         
TCBSVCSP EQU   X'20' - IF 1, SVC SCREENING IS TO BE PROPAGATED TO               
*                      SUBTASKS                                @G860PXB         
TCBSTACK EQU   X'10' - SET IN JOB STEP TCB TO INDICATE THAT A TASK IN           
*                      THE JOB STEP IS IN SERIAL ABEND PROCESSING.              
*                      USED IN CONJUNCTION WITH TCBFOINP.                       
*                                                                ICB374         
TCBSVCS  EQU   X'08' - IF 1, SVC SCREENING IS REQUIRED FOR THE TASK.            
*                      THIS OFFSET FIXED BY ARCHITECTURE.                       
*                                                              @G50EP9A         
TCBRSTSK EQU   X'04' - RESIDENT SYSTEM TASK                                     
TCBADMP  EQU   X'02' - ALL OTHER TASKS IN JOB STEP HAVE BEEN SET                
*                      NONDISPATCHABLE BY ABDUMP.   THIS BIT IS SET TO          
*                      CONTROL JOB STEP DURING THE DUMPING PROCESS.             
*                                                                               
TCBGTOFM EQU   X'01' - GENERALIZED TRACE FACILITY (GTF) TRACING HAS             
*                      BEEN TEMPORARILY DISABLED UNDER THIS TASK ICB402         
TCBDAR   DS    B -     DAMAGE ASSESSMENT ROUTINE (DAR) FLAGS                    
TCBDARP  EQU   X'80' - PRIMARY DAR RECURSION.  DAR HAS BEEN ENTERED FOR         
*                      THIS TASK.                                               
TCBDARS  EQU   X'40' - SECONDARY DAR RECURSION.  IF DAR IS REENTERED,           
*                      THIS TASK WILL BE SET NONDISPATCHABLE.                   
TCBDARD  EQU   X'20' - A DUMP HAS BEEN REQUESTED FOR A WRITER OR                
*                      SCHEDULER ABEND, AND THE USER HAS PROVIDED NO            
*                      SYSABEND DD CARD (OS/VS1)                                
TCBDARC  EQU   X'10' - RECURSION PERMITTED IN CLOSE -                           
*                      AFTER DAR PROCESSING COMPLETED (PCP)                     
TCBDARMC EQU   X'10' - DAR HAS BEEN ENTERED TO HANDLE A VALID RECURSION         
*                      IN MUST-COMPLETE STATUS THROUGH ABEND     ICB264         
TCBDARO  EQU   X'08' - SYSTEM ERROR TASK IS FAILING.  DAR DUMP SHOULD           
*                      NOT REQUEST ANY ERROR RECOVERY PROCEDURE (ERP)           
*                      PROCESSING.                                              
TCBDARWT EQU   X'04' - A WTO OPERATION WITH A 'REINSTATEMENT FAILURE'           
*                      MESSAGE IS IN PROCESS FOR DAR             ICB264         
TCBDARMS EQU   X'02' - WTO OPERATION WITH A 'DAR IN PROGRESS' MESSAGE           
*                      IS IN PROCESS FOR DAR (OS/VS1)          @XA08316         
TCBEXSVC EQU   X'01' - THE DUMP SVC ROUTINE IS EXECUTING FOR THIS TASK          
TCBRSV37 DS    X -     RESERVED FOR USER                                        
TCBSYSCT DS    FL1 -   NUMBER OF OUTSTANDING SYSTEM-MUST-COMPLETE               
*                      REQUESTS (ICB497)                         YM3883         
TCBSTMCT DS    FL1 -   NUMBER OF OUTSTANDING STEP-MUST-COMPLETE                 
*                      REQUESTS (ICB497)                         YM3883         
TCBEXT2  DS    0A -    ADDRESS OF OS/VS1 - OS/VS2 COMMON EXTENSION              
*                                                                ICB311         
         DS    X -     FIRST BYTE OF TCBEXT2                   @G381P9A         
TCBEXT2A DS    AL3 -   ADDRESS OF OS/VS1 - OS/VS2 COMMON EXTENSION              
*                                                                ICB311         
*                                                                               
*              OS/VS2 TCB OVERLAY                                               
*                                                                               
TCBR0D4  DS    F -     Reserved                                    @PBC         
TCBXSB   DS    A -     ADDRESS OF CURRENT XSB FOR TASK.        @G381P9A         
*                      SERIALIZATION - TCBACTIV.               @G381P9A         
*                      OWNERSHIP - SUPERVISOR.                 @G381P9A         
TCBBACK  DS    A -     ADDRESS OF PREVIOUS TCB ON READY QUEUE.  ZERO            
*                      IN TOP TCB.                                              
TCBRTWA  DS    A -     POINTER TO CURRENT RTM2 WORK AREA                        
TCBNSSP  DS    A -     NORMAL STACK SAVE AREA POINTER.                          
*                      SERIALIZATION - TCBACTIV.                                
*                      OWNERSHIP - SUPERVISOR.                 @G381P9A         
TCBNSSQA EQU   X'80' - NORMAL STACK SAVED IN SQA INDICATOR.    @G38CPXB         
TCBXLAS  DS    A -     ASCB ADDRESS OF THE CML LOCK HELD WHILE @G381PXU         
*                      TCB SUSPENDED OR INTERRUPTED.           @G381P9A         
*                      SERIALIZATION - TCBACTIV.               @G381P9A         
*                      OWNERSHIP - SUPERVISOR.                 @G381P9A         
TCBABCUR DS    C -     ABEND RECURSION BYTE                                     
TCBFJMCT DS    FL1 -   NUMBER OF OUTSTANDING STEP-MUST-COMPLETE@YA02725         
*                      REQUESTS ISSUED BY THE TASK             @YA02725         
TCBTID   DS    C -     The task identifier as specified on the     @P7C         
*                      TID parameter of ATTACH or ATTACHX.                      
*                      The following task identifiers are for internal          
*                      use only:                                   @P7A         
TCBPAGID EQU   255 -   ID FOR PAGING SUPERVISOR TASK             ICB403         
TCBSYERR EQU   254 -   ID FOR SYSTEM ERROR TASK                  ICB403         
TCBCOMM  EQU   253 -   ID FOR COMMUNCIATIONS TASK                ICB403         
TCBIORMS EQU   252 -   ID FOR I/O RMS TASK                       ICB403         
TCBMASTR EQU   251 -   ID FOR MASTER SCHEDULER TASK              ICB403         
TCBJES   EQU   250 -   ID FOR JOB ENTRY SUBSYSTEM (JES) MONITOR TASK            
*                                                                ICB403         
TCBDSSID EQU   249 -   ID FOR DYNAMIC SUPPORT SYSTEM (DSS) TASK  ICB403         
TCBLOGID EQU   248 -   ID FOR SYSTEM LOG TASK                                   
TCBFLGS8 DS    B -     GUPI FLAG BYTE FIELD                        @P1A         
*                      SERIALIZATION - TCBACTIV (Must be running under          
*                      this TCB when updating this field.)                      
TCBDYING EQU   X'80' - If on, indicates that this TCB will be      @0CC         
*                      terminating (normally or abnormally) and its             
*                      mainline processing will not be allowed to run           
*                      again.  Also see the TCBENDNG bit.  TCBDYING is          
*                      set when any of the following occur:                     
*                      - the TCB is terminating normally                        
*                      - before Estae-type recovery routines                    
*                        receive control for Cancel and Detach                  
*                        (not including Detach with STAE) abends                
*                      - after all recovery routines have percolated            
*                        for retriable abends                                   
*                      Ownership - RTM.                                         
TCBNOIRB EQU   X'40' - If on, IRBs will not be queued to this TCB. @08A         
*                      A program setting this flag MUST save its                
*                      current value and restore that value either              
*                      when that program can tolerate IRBs being                
*                      queued or before the current RB terminates.              
TCBJTCBA EQU   X'20' - If on, this is the attach of the JSTCB by the            
*                      initiator                                 @L9A           
TCBSDNDX EQU   X'10' - If on, this task is exempt from being set       *        
                       non-dispatchable for SDUMP by STATUS        @LGA         
TCBENDNG EQU   X'08' - If on, indicates that this TCB will be      @0CA         
*                      terminating (normally or abnormally) and its             
*                      mainline processing will not be allowed to run           
*                      again.  The key difference between TCBENDNG and          
*                      TCBDYING is that TCBENDNG is set before all              
*                      types of recovery routine if they will not be            
*                      allowed to retry.  TCBDYING is not set before            
*                      FRRs and is set before Estae-type recovery               
*                      routines only for Cancel and Detach abends.              
*                      TCBENDNG is set when any of the following occur:         
*                      - The TCB is terminating normally                        
*                      - before recovery routines (including FRRs)              
*                        receive control for all non-retriable abends           
*                        including Cancel, Detach, Detach with STAE,            
*                        and RETRY=NO abterms                                   
*                      - after all recovery routines have percolated            
*                        for retriable abends                                   
*                      Ownership - RTM.                                         
TCBEndingAbnormally EQU  X'04' - If On, indicates that this TCB is @LHA         
*                      abnormally terminating or (if the task has               
*                      ended) has abnormally terminated.  This bit is           
*                      a direct intended interface replacement for              
*                      TCBFA.  TCBEndingAbnormally is set when RTM              
*                      detects that a task will terminate abnormally            
*                      and its mainline will not be allowed to run              
*                      again in the following situations:                       
*                      - before Estae-type recovery (not FRRs) receives         
*                        control for all non-retriable abends including         
*                        Cancel, Detach, Detach with STAE, and                  
*                        RETRY=NO abterms                                       
*                      - after all recovery routines have percolated            
*                        for retriable abends                                   
*                      - in all subtasks before TERM=YES Estae-type             
*                        recovery is invoked for a Cancel or Detach             
*                        abend of the current task                              
*                      If the task has ended, TCBEndingAbnormally can           
*                      be used to determine whether STCBCMP contains            
*                      an ABEND code or the contents of GPR 15 when             
*                      the last program returned to the system.                 
*                      Ownership - RTM.                                         
TCBDEBL  EQU   X'02' - Serialization: TCBACTIV                     @PCM         
*                      OWNERSHIP: Supervisor Control                            
TCBSIQEO EQU   X'01' - If on, during task termination, only IQEs set            
*                      for STIMER(M) should be dequeued            @0GA         
TCBXSCT  DS    0F -    DISPATCHER INTERSECT CONTROL WORD       @Z40FP9A         
TCBXSCT1 DS    B -     FLAG BYTE                               @Z40FP9A         
TCBACTIV EQU   X'80' - BIT ON MEANS THIS TCB IS CURRENTLY ACTIVE ON A           
*                      CPU.  USED TO SYNCHRONIZE SOME STATUS SAVING AND         
*                      DISPATCHABILITY INDICATORS WHEN ACTIVE OR NOT            
*                      UNDER THE LOCAL LOCK.                   @Z40FP9A         
TCBS3A   EQU   X'40' - STAGE 3 EXIT EFFECTOR/RESUME/TCTL INTERSECT FLAG         
*                                                              @Z40FP9A         
TCBLLREQ EQU   X'20' - TASK REQUESTED LOCAL LOCK               @G50DP9A         
TCBTDORM EQU   X'08' - Turned on to detect dormant Tasks by        @06A         
*                      Parallel Detach processing.  Turned off by               
*                      the Dispatcher during Task dispatch                      
TCBXSCT2 DS    B -     FLAG BYTE                               @G381P9A         
TCBCMLF  EQU   X'80' - CML RESOURCE MANAGER PROCESSING         @G381P9A         
*                      COMPLETE FOR THIS CML LOCK HOLDER.      @G381P9A         
TCBLLNEW EQU   X'40' - Lock Manager has given this task the local  @L5A         
*                      lock, but its status is in the TCB, not the              
*                      IHSA.                                                    
*                      SERIALIZATION: TCBACTIV                                  
*                      OWNERSHIP: Task Management                               
TCBRSMRC EQU   X'20' - RSM Resmgr processing is complete           @LJA         
*                      Serialization: TCBACTIV                                  
*                      OWNERSHIP: RTM                                           
TCBCCPVI DS    H -     ID OF THE CURRENT CPU RUNNING THIS TASK.  USED           
*                      FOR RECOVERY AND CPU AFFINITY.          @Z40FP9A         
TCBFOE   DS    0A -    ADDRESS OF FIRST FIX OWNERSHIP ELEMENT (FOE)             
*                      IN LIST FOR THIS TASK                     ICB339         
         DS    X -     RESERVED.                                   @H2C         
TCBFOEA  DS    AL3 -   ADDRESS OF FIRST FIX OWNERSHIP ELEMENT (FOE)             
*                      IN LIST FOR THIS TASK                     ICB339         
TCBSWA   DS    A -     ADDRESS OF FIRST SCHEDULER WORK AREA (SWA) SPQE          
*                      ON SWA SPQE CHAIN                       @Z40AQ9A         
TCBSTAWA DS    A -     ESTAE ROUTINE WORK AREA POINTER         @Z40FP9A         
TCBTCBID DS    CL4 -   CONTAINS BLOCK ID - 'TCB '                               
TCBRTM12 DS    A -     POINTER TO PARAMETER AREAS PASSED FROM RTM1 TO           
*                      RTM2                                                     
TCBESTAE DS    0XL4 -  AREA TO CONTAIN RECOVERY DATA FOR RTM                    
TCBSCBKY DS    C -     KEY IN WHICH SYNCH IS TO PASS CONTROL                    
*                      TO THE USER EXIT                        @ZM49655         
TCBESTRM DS    B -     ESTAE TERM OPTIONS                                       
TCBETERM EQU   X'80' - ESTAE EXIT ENTERED WITH TERM OPTION                      
TCBSTAFX EQU   X'40' - SERIALIZED BY TCB ACTIVE                @ZA30005         
TCBERTYP DS    FL1 -   TYPE OF ERROR CAUSING ENTRY TO THE RTM.  SET             
*                      BY RTM1.                                                 
TCBMODE  DS    FL1 -   MASK INDICATING MODE OF SYSTEM AT TIME OF ERROR.         
*                      SEE IHART1W/MODE FOR INDIVIDUAL BIT DEFINITIONS.         
TCBUKYSP DS    A -     ADDRESS OF SPQE'S FOR SUBPOOLS 229 AND 230               
*                      (USER KEY STORAGE IN THE PRIVATE AREA)                   
TCBPROPF DS    0XL2 -  Flags propagated                           @L9C          
TCBPROP0 DS    X    -  Byte 0 of TCBPROPF                         @L9A          
TCBBITCB EQU   X'80' - This task is "below" the initiator TCB     @L9A          
TCBPROP1 DS    X    -  Byte 1 of TCBPROPF                         @L9A          
TCBAFFN  DS    BL2 -   CPU AFFINITY INDICATOR                                   
TCBFBYT1 DS    B -     FLAG BYTE.                              @G381P9A         
*                      SERIALIZATION - TCBACTIV OR TASK        @G381P9A         
*                      NONDISPATCHABLE AND LOCAL LOCK          @G381P9A         
TCBEOTFM EQU   X'80' - END OF TASK FLAG FOR FREEMAIN.  SET TO 1                 
*                      AT START OF ABNORMAL TERMINATION PROCESSING              
*                      AND RESET TO 0 AT FINISH.  INDICATES THAT A              
*                      FREEMAIN ON A BLOCK OF LOCAL STORAGE THAT IS             
*                      STILL FIXED BY RSM SHOULD RESULT IN A RETURN             
*                      CODE OF 8 RATHER THAN ABNORMAL TERMINATION.              
TCBRTM1E EQU   X'40' - RTM1 IS CURRENTLY PROCESSING EUT FRR'S  @G381PXU         
*                      FOR THIS TASK                           @G381PXU         
TCBNDIOS EQU   X'20' - TASK HAS BEEN SET NONDISPATCHABLE VIA STATUSND           
*                      WHILE SVC 16 (PURGE) SCANS THE RB CHAIN PURGING          
*                      APPENDAGE-SCHEDULED ASYNCHRONOUS EXIT ROUTINES           
*                      RUNNING UNDER AN IRB/RQE OR NON-RESIDENT ERP'S           
*                      RUNNING UNDER THE SIRB.                                  
TCBPGNLY EQU   X'10' - SET BY RTM2 TO INDICATE ONLY PURGE PHASE TO BE           
*                      PERFORMED                                                
TCBRTM2  EQU   X'08' - SET BY RTM2 TO INDICATE RTM2 HAS BEEN ENTERED            
*                      FOR THIS TASK                                            
TCBEOT   EQU   X'04' - SET BY RTM2 TO INDICATE TO EXIT THAT END OF TASK         
*                      PROCESSING IS COMPLETE                                   
TCBSATTN EQU   X'02' - SYNCHRONIZATION OF ATTENTION INTERRUPT REQUIRED          
*                      BY EXIT PROLOG                          @ZM48358         
TCBLLH   EQU   X'01' - Task was interrupted holding the local lock.             
TCBFBYT2 DS    B -     FLAG BYTE.                              @G381P9A         
*                      SERIALIZATION - TCBACTIV OR TASK        @G381P9A         
*                      NONDISPATCHABLE AND LOCAL LOCK          @G381P9A         
TCBCNCB  EQU   X'80' - SET BY RTM2 IN THE JOB STEP TCB WHEN IT HAS BEEN         
*                      ENTERED ON THE TCB FOR AN X22 ABEND                      
TCBFMW   EQU   X'40' - MOTHER WAITING FLAG.  TURNED ON IN A SUBTASK IN          
*                      RTM2 PROCESSING WHEN AN ANCESTOR TASK IS WAITING         
*                      TO ABEND IT.                                             
TCBFDW   EQU   X'20' - Set by RTM2 to ensure that only one daughter             
*                      task will terminate its jobstep task.                    
*                      No longer means 'daughter waiting'          @PBC         
TCBFPRAP EQU   X'10' - SET BY RTM2 TO PREVENT PERCOLATION TO THE TASK           
*                      OF AN ASYNCHRONOUS ABEND                                 
TCBRT1NR EQU   X'08' - IF 1, ERROR PROPAGATED FROM RTM1 IS         @D1A         
*                      NON-RETRYABLE                               @D1A         
TCBECBNV EQU   X'04' - IF 1, ECB POINTED TO BY TCBECB IS NOT TO BE              
*                      VALIDITY CHECKED.  IF 0, ECB POINTED TO BY               
*                      TCBECB IS TO BE VALIDITY CHECKED.                        
TCBSSPC  EQU   X'02' - STATUS STOP PENDING,TASK HOLDS A CML LOCK                
*                      OR IS IN FUNCTION MUST COMPLETE MODE.       @L3C         
TCBRTM1C EQU   X'01' - A TASK WITH EUT FRRS HAS BEEN CANCELLED. THIS            
*                      FLAG PASSES THE CANCEL REQUEST FROM RTM1 TO              
*                      RTM2.                                   @ZA56255         
TCBFBYT3 DS    B -     FLAG BYTE                               @ZA72701         
TCBEXP   EQU   X'80' - EXPANDED VERSION OF THE TCB             @ZA72701         
TCBNCTL  EQU   X'40' - IF 1, INDICATES USER PROGRAM IS LOADED  @ZA84893         
*                      UNDER THIS TASK OR A LOWER TASK.        @ZA84893         
*                      OWNERSHIP: RACF                         @ZA84893         
TCBRTMDE EQU   X'20' - DETACH HAS BEEN CALLED BY RTM           @ZA93650         
TCBMTDP  EQU   X'10' - MEMTERM SDUMP                               @LAA         
TCBFBYT4 DS    B -     FLAG BYTE.                                  @L3A         
*                      SERIALIZATION: TCBACTIV.                                 
*                      This is an interface for bit                             
*                      TCB_PThreadTermAbnormal only.                            
TCBPMC   EQU   X'80' - IF 1, INDICATES TASK IS IN PROCESS MUST     @D2C         
*                      COMPLETE MODE.                                           
TCBNOJLB EQU   X'40' - If 1, indicates that TCBJLB is not to be used            
*                                                                  @07A         
TCBATSKL EQU   X'20' - If 1, this task's TASKLIB was provided by   @LDA         
*                      an authorized attacher                      @LDA         
TCB_IEAVALCK_1 EQU X'10' -                                         @0IA         
*                      If 1, IEAVALCK will apply a rule that the   @0IA         
*                      task being checked can be any jobstep task. @0IA         
*                      Valid only for the ASCBXTCB task's TCB      @0IA         
TCB_KEEP_LS_EXTENT_VALID EQU X'08' - If 1, do not unchain and page @0DA         
*                      release a LSS during a Stack Empty (PIC31)               
*                      exception                                                
*                      Ownership: Supervisor                                    
TCB_PThreadTermAbnormal EQU X'04' - If 1, some z/OS Unix thread    @0FA         
*                      terminated abnormally, whether by abend or               
*                      non-zero return code. Note that this bit                 
*                      might be on even if the task terminates                  
*                      normally.                                                
*                      Ownership: z/OS Unix and Context Services                
TCBRPT   DS    A -     ADDRESS OF RADIX PARTITION TREE FOR LOCAL                
*                      STORAGE MANAGEMENT                                       
TCBVAT   DS    A -     ADDRESS OF THE VAT (VSAM). THERE IS ONE @ZA63673         
*                      VAT PER JOB STEP TCB.                   @ZA63673         
TCBSWASA DS    A -     ADDRESS OF SAVE AREA USED BY SWA MANAGER                 
TCBSVCA2 DS    A -     ADDRESS OF SVC SCREENING TABLE          @G50EP9A         
TCBERD   DS    A       EXTENDED REGION DESCRIPTOR.             @G860PXU         
*                      SERIALIZATION - THE LOCAL LOCK.         @G860PXU         
*                      OWNERSHIP - VSM.                        @G860PXU         
TCBEAE   DS    A       EXTENDED ALLOCATED ELEMENT QUEUE        @G860PXU         
*                      ANCHOR.                                 @G860PXU         
*                      SERIALIZATION - THE LOCAL LOCK.         @G860PXU         
*                      OWNERSHIP - VSM.                        @G860PXU         
TCBARC   DS    A       REASON CODE FOR ABEND                   @G860PXB         
*                      OWNERSHIP - RTM                         @G860PXB         
TCBGRES  DS    F -     TASK GLOBAL RESOURCE COUNT - NUMBER OF GLOBAL   *        
                       RESOURCES OWNED BY THIS TASK                @L1A         
TCBSTCB  DS    A       ADDRESS OF STCB                             @H2C         
TCBTTIME DS    CL8  -  TCB'S ACCUMULATED CPU TIME                  @01A         
TCBCELAP DS    AL4  -  COMMON EXECUTION LIBRARY ANCHOR POINTER     @02A         
TCBR148  DS    XL2  -  RESERVED                                    @05C         
TCBRBYT1 DS    B -     RTM Flag byte                               @05A         
*                      Ownership: RTM                                           
*                      Serialization: Local lock.                               
TCBPVICT EQU   X'80' - If 1, indicates that the associated task    @05M         
*                      has received an ABEND13E as a result of Parallel         
*                      Detach processing.  Used by both RTM1 and RTM2.          
TCBPKING EQU   X'40' - If 1, indicates that the associated Task has             
*                      been marked as responsible for the removal of            
*                      its subtasks (in RTM processing)            @05A         
TCBPCAND EQU   X'20' - If 1, indicates that this Task has requested             
*                      Parallel Detach protection and should be on              
*                      the queue pointed to by ASSBPTAR            @06A         
TCBPTOP  EQU   X'10' - If 1, indicates that this Task is at the top             
*                      of a Task structure that was Parallel                    
*                      Detached                                    @06A         
TCBLEVEL DS    B -     LEVEL NUMBER OF TCB                     @ZA72701         
TCBVS02A EQU   X'02' - JBB2110 (NOT IN BASE)                   @ZA72701         
TCBVS02B EQU   X'02' - JBB2125                                 @ZA72701         
TCBVS03  EQU   X'03' - JBB2133                                     @H1A         
TCBVERS  EQU   X'03' - LEVEL OF THIS MAPPING                       @H1C         
TCBBDT   DS    A -     ADDRESS OF BDT'S GSD LINKAGE            @ZA72701         
*                      CONTROL BLOCK                           @ZA72701         
TCBNDAXP DS    F -     COUNT OF NUMBER OF CONSECUTIVE DISPATCHES   @H1A         
*                      REQUIRED ON A CP BEFORE THE TASK SHOULD BE               
*                      REDISPATCHED ON AN AXP.                                  
*                      OWNER:  SUPERVISOR CONTROL                               
*                      SERIALIZATION:  TCBACTIV BIT OF FIELD TCBXSCT1           
TCBSENV  DS    A -     ADDRESS OF ACEE FOR THE TASK.               @H1A         
*                      THE ACEE DESCRIBES THE RACF                              
*                      AUTHORIZATION FOR THE TASK.                              
*                      OWNER:  RACF                                             
*                      SERIALIZATION: NONE,                                     
*                      ONLY UPDATED BY TASK ITSELF                              
         DS    0D                                                               
TCBMNLEN EQU   *-TCB - LENGTH OF MAIN SECTION OF TCB                            
*                                                                               
*              OS/VS1 - OS/VS2 COMMON EXTENSION                                 
*              ADDRESS OF EXTENSION IS IN TCBEXT2                               
*                                                                               
         AIF   ('&DSECT' EQ 'NO').D3                                            
TCBXTNT2 DSECT , -     START OF EXTENSION                                       
         AGO   .D4                                                              
.D3      ANOP                                                                   
TCBXTNT2 EQU   * -     START OF EXTENSION                        ICB311         
.D4      ANOP                                                                   
TCBGTF   DS    0A -    ADDRESS OF GENERALIZED TRACE FACILITY (GTF)              
*                      TEMPORARY TRACE BUFFER                    ICB312         
TCBTFLG  DS    B -     GTF FLAG BYTE                             ICB312         
TCBASYNC EQU   X'80' - GTF ASYNCHRONOUS GATHER ROUTINE IS IN CONTROL            
*                                                                ICB312         
TCBERRTN EQU   X'40' - GTF ASYNCHRONOUS GATHER ERROR ROUTINE IS IN              
*                      CONTROL                                   ICB312         
TCBDSPIT EQU   X'20' - MACHINE CHECK INTERRUPTION HANDLER SHOULD                
*                      UNCONDITIONALLY BRANCH TO THE DISPATCHER  ICB312         
TCBGTFA  DS    AL3 -   ADDRESS OF GTF TEMPORARY TRACE BUFFER     ICB312         
         DS    X -     RESERVED.                                   @H2C         
TCBRCMP  DS    BL3 -   MOST RECENT ABEND COMPLETION CODE (INCLUDING             
*                      VALID RECURSIONS IN STAE)                 ICB411         
TCBEVENT DS    A -     ADDRESS OF EVENT TABLES QUEUE           @X31ED9A         
TCBRTMCT DS    F -     COUNT OF TOKENS USED FOR ESTAE.         @G381PXU         
*                      SERIALIZATION - CS.                     @G381PXU         
*                      OWNERSHIP - RTM.                        @G381PXU         
TCBTQE   DS    A -     ADDRESS OF A REUSABLE TASK-RELATED TQE  @G50EP9A         
TCBCAUF  DS    A -     ADDRESS OF SUBSYSTEM FACILITY CONTROL BLOCK              
*                                                              @ZA27912         
TCBPERCP DS    A -     POINTER TO A QUEUE OF SPIS. AN SPI      @G381P9A         
*                      REPRESENTS THE PERCOLATION OF AN SRB'S  @G381P9A         
*                      FRR TO THE RELATED TASK.                @G381P9A         
*                      SERIALIZATION - TCBACTIV OR TASK        @G381P9A         
*                      NONDISPATCHABLE AND LOCAL LOCK.         @G381P9A         
*                      OWNERSHIP - RTM.                        @G381P9A         
TCBRCVRY EQU   X'80' - TASK IS IN RECOVERY.                    @G381P9A         
*                      SERIALIZATION - TCBACTIV.               @G381P9A         
*                      OWNERSHIP - RTM.                        @G381P9A         
TCBPERCT DS    F -     COUNT OF SRB MODE FRRS WAITING TO       @G381P9A         
*                      PERCOLATE TO THIS TASK, BUT NOT         @G381P9A         
*                      REPRESENTED IN SPI QUEUE (TCBPERCP).    @G381P9A         
*                      SERIALIZATION - TCBACTIV OR TASK        @G381P9A         
*                      NONDISPATCHABLE AND LOCAL LOCK.         @G381P9A         
*                      OWNERSHIP - RTM.                        @G381P9A         
         SPACE 1                                                                
         DS    0D -    FORCE LENGTH EQUATE TO DOUBLE WORD        ICB362         
TCBX2LEN EQU   *-TCBXTNT2 LENGTH OF COMMON EXTENSION                            
         SPACE 2                                                                
TCBLEN   EQU   TCBPXLEN+TCBMNLEN+TCBX2LEN - TCB LENGTH INCLUDING                
*                      PREFIX                                                   
*                                                                               
*                      END OF TCB                                               
         POP   PRINT                                                            
         MEND  , */                                                             
* %TCBL2  :  ;                                                                  
*%IF IKEPLS=''  %THEN                                                           
*    %GOTO TCBL3;                                                               
*%IHALPUSH='@LISTPUSH';                                                         
*%IHALPOP='@LISTPOP';                                                           
*%IHALOFF='@LISTOFF';                                                           
*IHALPUSH;                                                                      
*                                                                               
*%IF IHAVIA='YES'  %THEN                                                        
*   %IHAALET='VIA(TCBALET)' ;          /*                        @L2A*/         
* %ELSE                                                                         
*     %IHAALET=' ';                    /*                        @L2A*/         
*                                                                               
*%IF IHALIST='YES'  %THEN                                                       
*    %GOTO TCBL3;                                                               
*IHALOFF;                                                                       
*%TCBL3 : ;                                                                     
* /*           TCB PREFIX                                            */         
*                                                                               
* DECLARE                                                                       
*   1 TCBFIX   BASED(TCBPTR-32)  BDY(DWORD) IHAALET,   /*        @L2C*/         
*                                                                               
*    2 TCBFRS   CHAR(32) BDY(DWORD), /* FLOATING POINT REGISTER SAVE            
*                                       AREA                         */         
*     3 TCBFRS0 CHAR(8)  BDY(DWORD), /* SAVE AREA FOR FLOATING                  
*                                       POINT REGISTER 0             */         
*     3 TCBFRS2 CHAR(8)  BDY(DWORD), /* SAVE AREA FOR FLOATING                  
*                                       POINT REGISTER 2             */         
*     3 TCBFRS4 CHAR(8)  BDY(DWORD), /* SAVE AREA FOR FLOATING                  
*                                       POINT REGISTER 4             */         
*     3 TCBFRS6 CHAR(8)  BDY(DWORD); /* SAVE AREA FOR FLOATING                  
*                                       POINT REGISTER 6             */         
*                                                                               
* /*           TCB PROPER                                            */         
*                                                                               
* DECLARE                                                                       
*   1 TCB      BASED(TCBPTR)  BDY(DWORD)  IHAALET,     /*        @L2C*/         
*    2 TCBRBP   PTR(31),             /* ADDRESS OF THE RB FOR                   
*                                       EXECUTING PROGRAM.  THIS                
*                                       OFFSET FIXED BY ARCHITECTURE.           
*                                                            @G50EP9A*/         
*    2 TCBPIE   PTR(31),             /* Address of current PIE/EPIE.            
*                                       This field may be tested for            
*                                       zero to determine that there            
*                                       currently is no SPIE/ESPIE              
*                                       exit established for this task          
*                                       Ownership: RTM                          
*                                       Serialization: Local Lock               
*                                                                @P8C*/         
*    2 TCBDEB   PTR(31),             /* ADDRESS OF THE DEB QUEUE     */         
*    2 TCBTIO   PTR(31),             /* ADDRESS OF THE TASK I/O TABLE           
*                                       (TIOT)                       */         
*    2 TCBCMP   CHAR(4) BDY(WORD),   /* TASK COMPLETION CODE AND                
*                                       INDICATORS                   */         
*     3 TCBCMPF  CHAR(1),            /* INDICATOR FLAGS              */         
*      4 TCBCREQ  BIT(1),            /* A DUMP HAS BEEN REQUESTED    */         
*      4 TCBCSTEP BIT(1),            /* A STEP ABEND HAS BEEN                   
*                                       REQUESTED                    */         
*      4 TCBCPP   BIT(1),            /* SOME PROBLEM PROGRAM STORAGE            
*                                       WAS OVERLAID BY THE SECOND              
*                                       LOAD OF ABEND.  A FIRST LOAD            
*                                       OVERLAY IS INDICATED IN                 
*                                       TCBFLGS FIELD (OFFSET 29                
*                                       DECIMAL)  (OS/VS1)           */         
*       5 TCBDMPO  BIT(1),           /* DUMP OPTIONS WERE PROVIDED ON           
*                                       CALLRTM OR SETRP MACRO       */         
*      4 TCBSTCC  BIT(1),            /* COMPLETION CODE IS NOT TO               
*                                       BE STORED IN TCBCMPC (OFFSET            
*                                       17 DECIMAL) IF AN ABEND IS              
*                                       ENCOUNTERED.  THIS IS TO                
*                                       PREVENT AN OVERLAY OF THE               
*                                       ORIGINAL COMPLETION CODE.               
*                                       (OS/VS1)                     */         
*       5 TCBNOCC  BIT(1),           /* A COMPLETION CODE WAS NOT               
*                                       PROVIDED ON CALLRTM MACRO.              
*                                       A DEFAULT CODE IS BEING USED */         
*      4 TCBCDBL  BIT(1),            /* A DOUBLE ABEND HAS OCCURRED             
*                                       (OS/VS1)                     */         
*       5 TCBCASID BIT(1),           /* ABEND WAS SCHEDULED VIA CROSS           
*                                       MEMORY ABTERM                */         
*      4 TCBCWTO  BIT(1),            /* A DUMP MESSAGE (WTO) IS TO BE           
*                                       ISSUED TO THE OPERATOR                  
*                                       (OS/VS1)                     */         
*       5 TCBARCV BIT(1),            /* INDICATES REASON CODE (TCBARC)          
*                                       IS VALID                     */         
*         6 TCBRV316 BIT(1),         /* Same as TCBARCV              */         
*      4 TCBCIND  BIT(1),            /* ABEND TO OUTPUT AN INDICATIVE           
*                                       DUMP  (OS/VS1)                          
*                                                            @X04DA9A*/         
*      4 TCBCMSG  BIT(1),            /* AN ABEND MESSAGE IS PROVIDED            
*                                       TO BE PRINTED BY ABDUMP                 
*                                       (OS/VS1)                     */         
*     3 TCBCMPC  CHAR(3),            /* SYSTEM COMPLETION CODE IN               
*                                       FIRST 12 BITS, USER                     
*                                       COMPLETION CODE IN LAST 12              
*                                       BITS                         */         
*    2 TCBTRN   PTR(31),             /* ADDRESS OF TESTRAN CONTROL              
*                                       CORE TABLE                   */         
*     3 TCBABF   CHAR(1),            /* FLAG BYTE                    */         
*      4 TCBMOD91 BIT(1),            /* BOTH TESTRAN AND DECIMAL                
*                                       SIMULATOR ON A MOD 91        */         
*      4 TCBNOCHK BIT(1),            /* SUPPRESS TAKING CHECKPOINTS             
*                                       FOR THIS STEP (JOB STEP TCB) */         
*      4 TCBGRPH  BIT(1),            /* GAM/SP ACTIVE FOR THIS TASK  */         
*%IF SYSVERSION = '' %THEN %GOTO IKJTCB_1; /* Not PL/AS, skip    @LEA*/         
*%IF SYSRULESMOD='PL/S-III ' %THEN %GOTO IKJTCB_1;          /*   @LEA*/         
*      4 TCB_Refrprot_Override BIT(1), /* Even if the REFRPROT option           
*                       is active, do not apply REFRPROT rules to               
*                       loads under this task.                   @LEA*/         
*%GOTO IKJTCB_1A;                                                               
*%IKJTCB_1:;                                                /*   @LEA*/         
*      4 *        BIT(1),            /*                          @LEA*/         
*%IKJTCB_1A:;                                                                   
*      4 TCBTCPP  BIT(1),            /* TCAM POST-PENDING  (RORI)    */         
*      4 TCBTCP   BIT(1),            /* TEST TASK - USED BY TEST SVC */         
*      4 TCBOLTEP BIT(1),            /* OLTEP FUNCTIONS REQUIRE                 
*                                       CLEANUP BEFORE ABNORMAL                 
*                                       TERMINATION CAN BE INVOKED   */         
*      4 TCBDFRBP BIT(1),            /* Issue SVC 61 upon fetch. Set            
*                                       only when SVC 61 is being               
*                                       intercepted for deferred                
*                                       breakpoint processing    @P9A*/         
*     3 TCBTRNB  PTR(24),            /* ADDRESS OF TESTRAN CONTROL              
*                                       CORE TABLE                   */         
*    2 TCBMSS   PTR(31),             /* ADDRESS OF LAST SPQE ON MSS             
*                                       QUEUE                        */         
*     3 *        CHAR(1),            /* HIGH ORDER BYTE OF TCBMSS               
*                                                                @H2C*/         
*     3 TCBMSSB  PTR(24),            /* SAME AS TCBMSS ABOVE         */         
*    2 TCBPKF   CHAR(1),             /* STORAGE PROTECTION KEY FOR              
*                                       THIS TASK.  IF THERE IS NO              
*                                       STORAGE PROTECTION, ALL BITS            
*                                       ARE ZERO.                    */         
*     3 TCBFLAG  BIT(4),             /* STORAGE PROTECTION KEY       */         
*       5 TCBPKFU BIT(1),            /* When on, user key        @LIA*/         
*     3 TCBZERO  BIT(4),             /* MUST BE ZERO                 */         
*    2 TCBFLGS  CHAR(5),             /* FLAG BYTE FIELDS             */         
*     3 TCBFLGS1 CHAR(1),            /* FIRST TCB FLAG BYTE          */         
*      4 TCBFA    BIT(1),            /* May be on when a task is being          
*                                       abnormally terminated.  Do NOT          
*                                       use this bit as an indicator            
*                                       in any program.  It is not an           
*                                       intended interface.  See the            
*                                       TCBEndingAbnormally bit for             
*                                       program use.  Also see                  
*                                       TCBDYING and TCBENDNG.   @LHC*/         
*      4 TCBFE    BIT(1),            /* NORMAL TERMINATION IN                   
*                                       PROGRESS                     */         
*      4 TCBFERA  BIT(1),            /* ENTER ABEND ERASE ROUTINE               
*                                       WHEN IN CONTROL AGAIN        */         
*      4 TCBNONPR BIT(1),            /* TASK IS NON-PREEMPTABLE                 
*                                                            @Z40FP9A*/         
*      4 TCBPDUMP BIT(1),            /* PREVENT DUMP INDICATOR       */         
*      4 TCBFT    BIT(1),            /* TOP TASK IN TREE BEING                  
*                                       ABTERMED                     */         
*      4 TCBFS    BIT(1),            /* ABTERM DUMP COMPLETED        */         
*      4 TCBFX    BIT(1),            /* PROHIBIT QUEUEING OF                    
*                                       ASYNCHRONOUS EXITS FOR THIS             
*                                       TASK                         */         
*     3 TCBFLGS2 CHAR(1),            /* SECOND FLAG BYTE             */         
*      4 TCBFOINP BIT(1),            /* THE TASK IS ABENDING AND IS             
*                                       IN THE PROCESS OF (1) OPEN              
*                                       FOR DUMP DATA SET PROCESSING,           
*                                       (2) CLOSE FOR USER DATA SET             
*                                       OR (3) PURGE FOR ENQ'ED                 
*                                       RESOURCES.  THIS BIT IS USED            
*                                       IN CONJUNCTION WITH TCBSTACK.           
*                                                              ICB374*/         
*      4 TCBFSTI  BIT(1),            /* SECOND JOB STEP INTERVAL HAS            
*                                       EXPIRED (INITIATOR                      
*                                       TCB)                         */         
*      4 TCBFABOP BIT(1),            /* IF 1, THE SYSABEND DUMP DATA            
*                                       SET HAS BEEN OPENED FOR                 
*                                       ABEND.  IF 0, THE SYSUDUMP              
*                                       DUMP DATA SET WAS OPENED.               
*                                       THIS BIT IS ONLY USED FOR THE           
*                                       JOB STEP TCB AND IS USED IN             
*                                       CONJUNCTION WITH TCBFDSOP               
*                                       BIT.                   YM0651*/         
*      4 TCBFSMC  BIT(1),            /* TASK HAS ISSUED A SYSTEM-               
*                                       MUST-COMPLETE AND SET ALL               
*                                       OTHER TASKS IN THE SYSTEM               
*                                       NONDISPATCHABLE              */         
*      4 TCBFJMC  BIT(1),            /* TASK HAS ISSUED A STEP-MUST-            
*                                       COMPLETE AND TURNED OFF ALL             
*                                       OTHER TASKS IN THE STEP      */         
*      4 TCBFDSOP BIT(1),            /* SYSABEND OPEN FOR JOB STEP   */         
*      4 TCBFETXR BIT(1),            /* ETXR TO BE SCHEDULED         */         
*      4 TCBFTS   BIT(1),            /* THIS TASK IS A MEMBER OF A              
*                                       TIME-SLICED GROUP            */         
*     3 TCBFLGS3 CHAR(1),            /* THIRD FLAG BYTE.                        
*                                       SERIALIZATION- TCBACTIV OR              
*                                       TASK NONDISPATCHABLE AND                
*                                       LOCAL LOCK.          @G381P9A*/         
*      4 TCBFSM   BIT(1),            /* ALL PSW'S IN SUPERVISOR STATE*/         
*      4 TCBRT1S  BIT(1),            /* RTM1 HAS INVOKED SLIP FOR A             
*                                       TASK IN EUT MODE. RTM2 MAY              
*                                       BYPASS SLIP PROCESSING.                 
*                                       OWNERSHIP - RTM.                        
*                                                            @G381P9A*/         
*      4 TCBABTRM BIT(1),            /* ABTERM BIT TO PREVENT                   
*                                       MULTIPLE ABENDS              */         
*      4 TCBFXSET BIT(1),            /* TCBFX SET BY STATUS MCSTEP              
*                                                                @04A*/         
*      4 *        BIT(1),            /* RESERVED.                @L8C*/         
*      4 TCBKEY9 BIT(1),             /* TCB was attached using KEY=NINE         
*                                       and so is to be treated as              
*                                       having a different key than the         
*                                       attacher.                @L8A*/         
*      4 TCBENQRM BIT(1),            /* ENQ/DEQ RESOURCE MANAGER HAS            
*                                       RECEIVED CONTROL. NO FURTHER            
*                                       DIRECTED ENQS ALLOWED.                  
*                                       SERIALIZATION - TCBACTIV AND            
*                                       CMSEQDQ CLASS LOCK.                     
*                                       OWNERSHIP - GRS.                        
*                                                            @G381P9A*/         
*      4 TCBDWSTA BIT(1),            /* TASK WAS DETATCHED WITH                 
*                                       STAE=YES OPTION        ICB315*/         
*     3 TCBFLGS4 CHAR(1),            /* NONDISPATCHABILITY FLAGS     */         
*      4 TCBNDUMP BIT(1),            /* ABDUMP NONDISPATCHABILITY               
*                                       INDICATOR                    */         
*      4 TCBSER   BIT(1),            /* SER1 NONDISPATCHABILITY                 
*                                       INDICATOR                    */         
*      4 TCBRQENA BIT(1),            /* I/O RQE'S EXHAUSTED          */         
*      4 TCBHNDSP BIT(1),            /* TASK OR JOB STEP IS                     
*                                       MOMENTARILY 'FROZEN' UNTIL              
*                                       THE REQUIRED RESOURCES ARE              
*                                       AVAILABLE.  THE BIT IS SET              
*                                       THROUGH THE USE OF THE                  
*                                       'STATUS' SVC.          ICB453*/         
*      4 TCBUXNDV BIT(1),            /* TASK IS TEMPORARILY                     
*                                       NONDISPATCHABLE BECAUSE SMF             
*                                       TIME LIMIT OR SYSOUT LIMIT              
*                                       USER EXIT ROUTINE IS BEING              
*                                       EXECUTED FOR THIS STEP       */         
*      4 TCBRBWF  BIT(1),            /* TOP RB IS IN WAIT    @G50DP9A*/         
*      4 *        BIT(1),            /* RESERVED.            @G50DP9A*/         
*      4 TCBONDSP BIT(1),            /* TASK TERMINATING AND                    
*                                       NONDISPATCHABLE BECAUSE                 
*                                       EITHER OPEN FOR DUMP DATA               
*                                       SET IS IN PROCESS OR CLOSE              
*                                       BY ABEND IS IN PROCESS       */         
*     3 TCBFLGS5 CHAR(1),            /* MORE NONDISPATCHABILITY                 
*                                       FLAGS.  IF ANY BIT IN THIS              
*                                       BYTE IS 1, THE TASK IS                  
*                                       NONDISPATCHABLE.             */         
*      4 TCBFC    BIT(1),            /* TASK TERMINATED              */         
*      4 TCBABWF  BIT(1),            /* ABNORMAL WAIT                */         
*       5 TCBUXNDF BIT(1),           /* TASK IS TEMPORARILY                     
*                                       NONDISPATCHABLE BECAUSE SMF             
*                                       TIME LIMIT OR SYSOUT LIMIT              
*                                       USER EXIT ROUTINE IS BEING              
*                                       EXECUTED FOR THIS STEP.  THIS           
*                                       BIT IS SET TO 1 IN ALL TCB'S            
*                                       EXCEPT JOB STEP TCB.                    
*                                       (OS/VS1)               ICB263*/         
*      4 TCBPAGE  BIT(1),            /* TASK IS NONDISPATCHABLE DUE             
*                                       TO EXCESSIVE PAGING RATE     */         
*      4 TCBANDSP BIT(1),            /* TASK IS TEMPORARILY                     
*                                       NONDISPATCHABLE BECAUSE IT              
*                                       WAS ATTACHED UNDER THE                  
*                                       DISP=NO OPERAND              */         
*      4 TCBSYS   BIT(1),            /* ANOTHER TASK IS IN SYSTEM-              
*                                       MUST-COMPLETE STATUS OR A               
*                                       SUMMARY BIT FOR FIELD                   
*                                       TCBSYSCT                     */         
*      4 TCBSTP   BIT(1),            /* ANOTHER TASK IN THIS JOB STEP           
*                                       IS IN STEP-MUST-COMPLETE                
*                                       STATUS                       */         
*      4 TCBFCD1  BIT(1),            /* INITIATOR WAITING FOR REGION */         
*      4 TCBPNDSP BIT(1),            /* PRIMARY NONDISPATCHABILITY              
*                                       BIT.  THIS BIT IS SET TO 1              
*                                       IF ANY OF THE SECONDARY                 
*                                       NONDISPATCHABILITY BITS                 
*                                       (OFFSETS 173, 174, 175, 200             
*                                       OR 201 DECIMAL) IS SET TO 1.            
*                                       THIS BIT IS SET TO 0 IF A               
*                                       SECONDARY NONDISPATCHABILITY            
*                                       BIT IS SET TO 0 AND ALL OTHER           
*                                       SECONDARY NONDISPATCHABILITY            
*                                       BITS ARE 0.                  */         
*    2 TCBLMP   PTR(8),              /* TASK LIMIT PRIORITY          */         
*    2 TCBDSP   PTR(8),              /* DISPATCHING PRIORITY FOR THIS           
*                                       TASK                         */         
*    2 TCBLLS   PTR(31),             /* ADDRESS OF LAST LOAD LIST               
*                                       ELEMENT (LLE) IN LOAD LIST   */         
*    2 TCBJLB   PTR(31),             /* ADDRESS OF A JOBLIB DCB      */         
*    2 TCBJPQ   PTR(31),             /* ADDRESS OF LAST CDE FOR JOB             
*                                       PACK AREA (JPA) CONTROL QUEUE*/         
*      4 TCBPURGE CHAR(1),           /* HIGH ORDER BYTE      @G860PXB*/         
*       5 TCBJPQF  BIT(1),           /* JPQ PURGE FLAG               */         
*       5 *        BIT(7),           /* RESERVED.            @G860PXB*/         
*      4 TCBJPQB  PTR(24),           /* SAME AS TCBJPQ ABOVE         */         
*    2 TCBGRS   CHAR(64)  BDY(WORD), /* GENERAL REGISTER SAVE AREA.             
*                                       THIS OFFSET FIXED BY                    
*                                       ARCHITECTURE.        @G50EP9A*/         
*     3 TCBGRS0  PTR(31),            /* SAVE AREA FOR REGISTER 0     */         
*     3 TCBGRS1  PTR(31),            /* SAVE AREA FOR REGISTER 1     */         
*     3 TCBGRS2  PTR(31),            /* SAVE AREA FOR REGISTER 2     */         
*     3 TCBGRS3  PTR(31),            /* SAVE AREA FOR REGISTER 3     */         
*     3 TCBGRS4  PTR(31),            /* SAVE AREA FOR REGISTER 4     */         
*     3 TCBGRS5  PTR(31),            /* SAVE AREA FOR REGISTER 5     */         
*     3 TCBGRS6  PTR(31),            /* SAVE AREA FOR REGISTER 6     */         
*     3 TCBGRS7  PTR(31),            /* SAVE AREA FOR REGISTER 7     */         
*     3 TCBGRS8  PTR(31),            /* SAVE AREA FOR REGISTER 8     */         
*     3 TCBGRS9  PTR(31),            /* SAVE AREA FOR REGISTER 9     */         
*     3 TCBGRS10 PTR(31),            /* SAVE AREA FOR REGISTER 10    */         
*     3 TCBGRS11 PTR(31),            /* SAVE AREA FOR REGISTER 11    */         
*     3 TCBGRS12 PTR(31),            /* SAVE AREA FOR REGISTER 12    */         
*     3 TCBGRS13 PTR(31),            /* SAVE AREA FOR REGISTER 13    */         
*     3 TCBGRS14 PTR(31),            /* SAVE AREA FOR REGISTER 14    */         
*     3 TCBGRS15 PTR(31),            /* SAVE AREA FOR REGISTER 15    */         
*    2 TCBFSA   PTR(31),             /* ADDRESS OF THE FIRST PROBLEM            
*                                       PROGRAM SAVE AREA            */         
*     3 *        BIT(8),             /* FIRST BYTE OF TCBFSA @G381P9A*/         
*     3 TCBFSAB  PTR(24),            /* ADDRESS OF THE FIRST PROBLEM            
*                                       PROGRAM SAVE AREA            */         
*    2 TCBTCB   PTR(31),             /* Queue of TCBs in an address             
*                                       space.                                  
*                                       Note:  This queue is not                
*                                              maintained in priority           
*                                              order.            @L5C*/         
*    2 TCBTME   PTR(31),             /* ADDRESS OF THE TIMER QUEUE              
*                                       ELEMENT (TQE)                */         
*     3 TCBTQET  BIT(1),             /* IF ZERO, TASK TYPE TQE.                 
*                                       IF ONE, REAL/WAIT TYPE TQE.  */         
*    2 TCBJSTCB PTR(31),             /* Address of job step TCB for             
*                                       this TCB                     */         
*     3 *        PTR(8),             /* HIGH ORDER BYTE OF                      
*                                       TCBJSTCB             @G860PXB*/         
*     3 TCBJSTCA PTR(24),            /* LOW ORDER 24 BITS OF                    
*                                       TCBJSTCB             @G860PXB*/         
*    2 TCBNTC   PTR(31),             /* ADDRESS OF THE TCB FOR THE              
*                                       TASK PREVIOUSLY ATTACHED BY             
*                                       THE TASK THAT ATTACHED THIS             
*                                       TASK                         */         
*    2 TCBOTC   PTR(31),             /* ADDRESS OF THE TCB FOR THE              
*                                       TASK (THE ORIGINATING TASK)             
*                                       THAT ATTACHED THIS TASK.                
*                                       THIS FIELD IS ZERO IN THE TCB           
*                                       FOR A SYSTEM TASK.           */         
*    2 TCBLTC   PTR(31),             /* ADDRESS OF THE TCB FOR THE              
*                                       TASK LAST ATTACHED BY THIS              
*                                       TASK                         */         
*    2 TCBIQE   PTR(31),             /* ADDRESS OF AN INTERRUPTION              
*                                       QUEUE ELEMENT (IQE) FOR                 
*                                       SCHEDULING THE ETXR ROUTINE             
*                                       OF THE TASK THAT ATTACHED               
*                                       THIS TASK                    */         
*    2 TCBECB   PTR(31),             /* ADDRESS OF THE ECB THAT WILL            
*                                       BE POSTED BY THE SUPERVISOR'S           
*                                       TASK TERMINATION ROUTINES               
*                                       WHEN NORMAL OR ABNORMAL                 
*                                       TERMINATION OCCURS.          */         
*    2 TCBTSFLG BIT(8),              /* TIME SHARING FLAGS           */         
*     3 TCBTSTSK BIT(1),             /* SWAPPED TIME SHARING TASK               
*                                       (OS/VS1)                     */         
*     3 TCBSTPPR BIT(1),             /* TASK SHOULD BE MADE                     
*                                       NONDISPATCHABLE VIA TCBSTPP             
*                                       WHEN IT IS NO LONGER RUNNING            
*                                       A PRIVILEGED PROGRAM         */         
*     3 TCBATT   BIT(1),             /* TASK SHOULD NOT HAVE                    
*                                       ATTENTION EXITS SCHEDULED ON            
*                                       IT BY EXIT EFFECTOR.  THIS              
*                                       OFFSET FIXED BY ARCHITECTURE.           
*                                                            @G50EP9A*/         
*     3 TCBTIOTG BIT(1),             /* PURGE TGET/TPUT AFTER                   
*                                       ATTENTION                    */         
*     3 TCBSMCP  BIT(1),             /* STATUS MCSTEP PENDING,                  
*                                       TASK IS SUSPENDED        @L4A*/         
*     3 *        BIT(1),             /* RESERVED.                @L4C*/         
*     3 TCBDYDSP BIT(1),             /* M195 TASK IS MEMBER OF                  
*                                       DYNAMIC DISPATCHING                     
*                                       GROUP                  ICB262*/         
*     3 TCBCPUBN BIT(1),             /* FOR M195, ZERO MEANS I/O                
*                                       BOUND AND ONE MEANS CPU                 
*                                       BOUND                  ICB262*/         
*    2 TCBSTPCT PTR(8),              /* NUMBER OF SETTASK STARTS                
*                                       WHICH MUST BE ISSUED BEFORE             
*                                       TASK IS MADE DISPATCHABLE -             
*                                       FIELD NOT RESTRICTED TO TSO  */         
*    2 TCBTSLP  PTR(8),              /* LIMIT PRIORITY OF TIME                  
*                                       SHARING TASK                 */         
*    2 TCBTSDP  CHAR(1),             /* DISPATCHING PRIORITY OF TIME            
*                                       SHARING TASK                 */         
*    2 TCBRD    PTR(31),             /* POINTER TO DPQE MINUS 8 FOR             
*                                       THE JOB STEP                            
*                                       SERIALIZATION - THE LOCAL LOCK.         
*                                       OWNERSHIP - VSM.     @G860PXU*/         
*     3 TCBPQE   PTR(31),            /* SAME AS TCBRD        @G860PVB*/         
*                                                                               
*    2 TCBAE    PTR(31),             /* LIST ORIGIN OF AQE(S) FOR               
*                                       THIS TASK                               
*                                       SERIALIZATION - THE LOCAL LOCK.         
*                                       OWNERSHIP - VSM.     @G860PXU*/         
*     3 TCBAQE   PTR(31),            /* SAME AS TCBAE        @G860PVB*/         
*    2 TCBSTAB  PTR(31),             /* ADDRESS OF THE CURRENT STAE             
*                                       CONTROL BLOCK                */         
*     3 TCBNSTAE CHAR(1),            /* FLAGS INTERNAL TO STAE                  
*                                       ROUTINE                      */         
*      4 TCBSTABE BIT(1),            /* ABEND ENTERED BECAUSE OF                
*                                       ERROR IN STAE PROCESSING     */         
*      4 TCBQUIES BIT(1),            /* STAE INVOKED PURGE I/O                  
*                                       ROUTINE WITH QUIESCE I/O                
*                                       OPTION                       */         
*      4 TCB33E   BIT(1),            /* A 33E ABEND HAS OCCURRED FOR            
*                                       TASK                         */         
*      4 TCBPPSUP BIT(1),            /* 1=SUPERVISOR MODE,0=PROBLEM             
*                                       PROGRAM MODE. INDICATOR TO              
*                                       SYNCH OF THE MODE OF THE USER           
*                                       EXIT                 @ZM49655*/         
*      4 TCBHALT  BIT(1),            /* PURGE I/O ROUTINE DID NOT               
*                                       SUCCESSFULLY QUIESCE I/O, BUT           
*                                       I/O WAS HALTED               */         
*      4 TCBSYNCH BIT(1),            /* SYNCH ISSUED BY ASIR TO                 
*                                       SCHEDULE EXIT ROUTINE                   
*                                                            @ZM49655*/         
*      4 *        BIT(1),            /* RESERVED.                @H2C*/         
*      4 TCBSTCUR BIT(1),            /* STAE RECURSION VALID   ICB443*/         
*     3 TCBSTABB PTR(24),            /* ADDRESS OF THE CURRENT STAE             
*                                       CONTROL BLOCK                */         
*    2 TCBTCT   PTR(31),             /* ADDRESS OF THE TIMING CONTROL           
*                                       TABLE (TCT) IF SYSTEM                   
*                                       MANAGEMENT FACILITIES (SMF)             
*                                       DATA IS BEING COLLECTED FOR             
*                                       THE TASK.  ZERO IF SMF DATA             
*                                       IS NOT BEING COLLECTED FOR              
*                                       THE TASK.                               
*                                       SERIALIZATION: LOCAL LOCK.              
*                                                            @Z30AQ9A*/         
*     3 TCBTCTGF BIT(8),             /* FLAG BYTE FOR TIMING CONTROL            
*                                       TABLE                  ICB318*/         
*      4 TCBSMFGF BIT(1),            /* IF ZERO, THE TCT CORE TABLE             
*                                       IS NOT BE TO UPDATED BY                 
*                                       GETMAIN/FREEMAIN.  IF ONE,              
*                                       THE TCT CORE TABLE IS TO BE             
*                                       UPDATED BY GETMAIN/FREEMAIN.            
*                                                              ICB318*/         
*      4 *        BIT(7),            /* RESERVED.                @H2C*/         
*     3 TCBTCTB  PTR(24),            /* SAME AS TCBTCT ABOVE         */         
*    2 TCBUSER  PTR(31),             /* A WORD AVAILABLE TO THE USER */         
*    2 TCBSCNDY CHAR(4) BDY(WORD),   /* SECONDARY NONDISPATCHABILITY            
*                                       BITS.  IF ANY BIT IN THE                
*                                       FOLLOWING FOUR BYTES IS 1, THE          
*                                       PRIMARY NONDISPATCHABILITY              
*                                       BIT (OFFSET 33.7 DECIMAL) IS            
*                                       1, AND THE TASK IS                      
*                                       NONDISPATCHABLE.             */         
*     3 TCBNDSP  CHAR(4) BDY(WORD),  /* SAME AS TCBSCNDY             */         
*      4 TCBNDSP0 CHAR(1),           /* BYTE 0                       */         
*       5 * BIT(6),                  /*                          @LKC*/         
*       5 TCBNDGSF BIT(1),           /* Temporarily nondispatchable             
*                                       for GSF                  @LKA*/         
*       5 TCBNDJL BIT(1),            /* Join/Leave               @0EA*/         
*      4 TCBNDSP1 CHAR(1),           /* BYTE 1                       */         
*       5 TCBDARTN BIT(1),           /* THE TASK IS TEMPORARILY                 
*                                       NONDISPATCHABLE - DAMAGE                
*                                       ASSESSMENT ROUTINE (DAR)     */         
*       5 TCBDARPN BIT(1),           /* THE TASK IS PERMANENTLY                 
*                                       NONDISPATCHABLE - DAMAGE                
*                                       ASSESSMENT ROUTINE (DAR)     */         
*       5 TCBRSTND BIT(1),           /* THE TASK IS TEMPORARILY                 
*                                       NONDISPATCHABLE - RECOVERY              
*                                       MANAGEMENT SUPPORT AND SYSTEM           
*                                       ERROR RECOVERY (RMS/SER)     */         
*       5 TCBRSPND BIT(1),           /* THE TASK IS PERMANENTLY                 
*                                       NONDISPATCHABLE - RECOVERY              
*                                       MANAGEMENT SUPPORT AND SYSTEM           
*                                       ERROR RECOVERY (RMS/SER)                
*                                       (IF THIS FLAG IS ON THEN THE            
*                                       PREVIOUS BIT MUST BE ON TOO) */         
*       5 TCBDDRND BIT(1),           /* THE TASK IS IN DEVICE                   
*                                       ALLOCATION AND DYNAMIC DEVICE           
*                                       RECONFIGURATION (DDR) HAS               
*                                       MADE IT NONDISPATCHABLE -               
*                                       RECOVERY MANAGEMENT SUPPORT             
*                                       AND SYSTEM ERROR RECOVERY               
*                                       (RMS/SER)  (OS/VS1)          */         
*       5 TCBTPSP  BIT(1),           /* DISPATCHING OF TCAM TASK                
*                                       MUST BE DELAYED UNTIL TCAM              
*                                       I/O APPENDAGE OR SVC ROUTINE            
*                                       HAS COMPLETED EXECUTION                 
*                                       (TCAM IN MULTIPROCESSING                
*                                       ENVIRONMENT)                 */         
*       5 TCBPIEND BIT(1),           /* SRB IS TO BE SCHEDULED TO               
*                                       PERFORM PIE/PICA PROCESSING             
*                                       (FIRST LEVEL INTERRUPT                  
*                                       HANDLER)                     */         
*       5 TCBABTIN BIT(1),           /* THE TASK IS TEMPORARILY                 
*                                       NONDISPATCHABLE WHILE BEING             
*                                       SET UP FOR ABTERM    @ZM46205*/         
*      4 TCBNDSP2 CHAR(1),           /* BYTE 2                       */         
*       5 TCBABD   BIT(1),           /* ABDUMP IS PROCESSING (OS/VS1)*/         
*       5 TCBSTPP  BIT(1),           /* TASK SET NONDISPATCHABLE                
*                                       BY SETTASK                   */         
*       5 TCBNDSVC BIT(1),           /* TASK IS NONDISPATCHABLE                 
*                                       BECAUSE SVC DUMP IS                     
*                                       EXECUTING FOR ANOTHER TASK   */         
*       5 TCBNDTS  BIT(1),           /* TASK IS NONDISPATCHABLE                 
*                                       BECAUSE IT IS BEING SWAPPED             
*                                       OUT                          */         
*       5 TCBIWAIT BIT(1),           /* TASK IS NONDISPATCHABLE DUE             
*                                       TO AN INPUT WAIT             */         
*       5 TCBOWAIT BIT(1),           /* TASK IS NONDISPATCHABLE DUE             
*                                       TO AN OUTPUT WAIT            */         
*       5 TCBDSS   BIT(1),           /* DYNAMIC SUPPORT SYSTEM (DSS)            
*                                       HAS SET THIS TASK                       
*                                       NONDISPATCHABLE        ICB313*/         
*       5 TCBABE   BIT(1),           /* ABEND ROUTINE WAS ENTERED BY            
*                                       THIS TASK WHILE THE DCB FOR             
*                                       SYSABEND (OR SYSUDUMP) DATA             
*                                       SET WAS BEING OPENED FOR                
*                                       ANOTHER TASK  (OS/VS1)       */         
*      4 TCBNDSP3 CHAR(1),           /* BYTE 3                       */         
*       5 TCBLJSND BIT(1),           /* TASK IS ABENDING AND                    
*                                       NONDISPATCHABLE BECAUSE IT              
*                                       HAS A JOB STEP SUBTASK.                 
*                                       TCBONDSP MUST ALSO BE ON.    */         
*       5 TCBNDNYI BIT(1),           /* RCT TASK IS NOT DISPATCHABLE            
*                                       BECAUSE THE ADDRESS SPACE IS            
*                                       NOT YET INITIALIZED FULLY               
*                                                                @P4A*/         
*       5 TCBSRBND BIT(1),           /* TCB NONDISPATCHABLE BECAUSE             
*                                       SRB'S ARE STOPPED            */         
*       5 TCBSLPER BIT(1),           /* SET NONDISPATCHABLE SO THAT             
*                                       SLIP/PER CAN ALTER RB PSW               
*                                       PER BIT              @G65RP9A*/         
*       5 TCBS3MR  BIT(1),           /* STAGE 3 EXIT EFFECTOR MUST              
*                                       RUN TO SYNCHRONIZE ATTENTION            
*                                       INTERRUPT            @ZM48358*/         
*       5 TCBAREQ  BIT(1),           /* TSO AUTHORIZED REQUEST                  
*                                       PROCESSING ACTIVE.   @ZA67167*/         
*       5 TCBNDSMF BIT(1),           /* Indicates task is stopped               
*                                       because its CPU or continuous           
*                                       wait time has been exceeded.            
*                                       SMF determines whether to grant         
*                                       extension or abend task.                
*                                       Ownership: SMF.          @03A*/         
*       5 TCBNDINT BIT(1),           /* INITIATOR SETS THIS BIT TO              
*                                       PREVENT JOB STEP EXECUTION              
*                                       IN ORDER TO DO CANCEL                   
*                                       PROCESSING (CAN CANCEL LOOP) */         
*    2 TCBMDIDS FIXED(31),           /* RESERVED FOR MODEL-DEPENDENT            
*                                       SUPPORT AND FOR IBM                     
*                                       PROPRIETARY PROGRAMMING                 
*                                       SUPPORT                ICBXXX*/         
*    2 TCBJSCB  PTR(31),             /* ADDRESS OF THE JOB STEP                 
*                                       CONTROL BLOCK                */         
*     3 TCBRECDE CHAR(1),            /* ABEND RECURSION BYTE   ICB456*/         
*      4 TCBREC   BIT(1),            /* VALID REENTRY TO ABEND IF               
*                                       NON-ZERO VALUE IN FOLLOWING             
*                                       7 BITS                 ICB456*/         
*      4 *        BIT(7),            /* ABEND BITS             ICB456*/         
*%TCBOPEN='''01''X';                 /* OPEN DUMP DATA SET     ICB456*/         
*%TCBCLOSD='''02''X';                /* CLOSE DIRECT SYSOUT ON                  
*                                       TAPE                   ICB456*/         
*%TCBCLOSE='''03''X';                /* CLOSE OPEN DATA SETS   ICB456*/         
*%TCBCLOSF='''04''X';                /* RESERVED.              ICB456*/         
*%TCBGREC='''05''X';                 /* GRAPHICS               ICB456*/         
*%TCBADUMP='''07''X';                /* ABDUMP                 ICB456*/         
*%TCBPTAXE='''08''X';                /* PURGE TAXE             ICB456*/         
*%TCBMESG='''09''X';                 /* MESSAGE RECURSION      ICB456*/         
*%TCBDYNAM='''0A''X';                /* DD-DYNAM TIOT CLEANUP  ICB456*/         
*%TCBDAMSG='''0B''X';                /* ABEND IS ISSUING A WTOR                 
*                                       ASKING WHETHER THE JOB STEP             
*                                       TASK SHOULD WAIT FOR THE                
*                                       DUMP AREA (OS/VS1)           */         
*%TCBQTIP='''0C''X';                 /* PURGE TSO INTERPARTITION                
*                                       POSTS                  ICB456*/         
*%TCBTCAMP='''0D''X';                /* PURGE TCAM INTERPARTITION               
*                                       POSTS                  ICB456*/         
*%TCBINDRC='''0E''X';                /* INDICATIVE DUMP (LOAD 8 OF              
*                                       ABEND) HAS ABENDED.  ABEND              
*                                       WILL HANDLE THIS ABEND.                 
*                                       (OS/VS1)                     */         
*%TCBSAVCD='''0F''X';                /* ASIR RECURSION.  SAVE OLD               
*                                       COMPLETION CODE        ICB456*/         
*%TCBTYP1W='''10''X';                /* TYPE 1 MESSAGE WRITE TO                 
*                                       PROGRAMMER             ICB456*/         
*%TCBWTPSE='''20''X';                /* WRITE-TO-PROGRAMMER (WTP)               
*                                       FAILED.  JOB STEP TIMER                 
*                                       EXPIRED DURING JOB STEP ABEND           
*                                       AND THE STAE EXIT IS DENIED.            
*                                       (OS/VS1)             @X04DA9A*/         
*%TCBVTAM1='''21''X';                /* ABEND IS ENTERING FIRST VTAM            
*                                       INTERFACE, ISTRAAA1, FOR                
*                                       TERMINATION OF TASK OR                  
*                                       SUBTASK (OS/VS1)                        
*                                                            @X31BH9A*/         
*%TCBVTAM2='''22''X';                /* ABEND IS ENTERING SECOND VTAM           
*                                       INTERFACE, ISTRAAA2, BECAUSE            
*                                       ISTRAAA1 ABENDED  (OS/VS1)              
*                                                            @X31BH9A*/         
*%TCBVTAM3='''23''X';                /* ABEND IS ENTERING FIRST VTAM            
*                                       INTERFACE, ISTRAAA0, BECAUSE            
*                                       VTAM ABENDED  (OS/VS1)                  
*                                                            @X04BH9A*/         
*%TCBVTAM4='''24''X';                /* ABEND IS ENTERING SECOND VTAM           
*                                       INTERFACE, ISTRAAA2, BECAUSE            
*                                       ISTRAAA0 ABENDED  (OS/VS1)              
*                                                            @X04BH9A*/         
*%TCBNOSTA='''30''X';                /* STAE/STAI NOT TO BE                     
*                                       HONORED                ICB456*/         
*%TCBSTRET='''31''X';                /* RETURN FROM DUMP PROCESSING             
*                                                              ICB456*/         
*%TCBCONVR='''32''X';                /* CONVERT TO STEP ABEND  ICB456*/         
*%TCBDARET='''33''X';                /* RETURN FROM DAMAGE                      
*                                       ASSESSMENT ROUTINES    ICB456*/         
*%TCBTYP1R='''34''X';                /* RETURN FROM TYPE 1 MESSAGE              
*                                       MODULE                 ICB456*/         
*%TCBNEWRB='''35''X';                /* ABEND ISSUED SVC 13 TO                  
*                                       TRANSFER CONTROL (XCTL) TO A            
*                                       NON-ABEND MODULE       ICB456*/         
*%TCBMCCNS='''40''X';                /* A MUST COMPLETE TASK HAS                
*                                       ABNORMALLY TERMINATED WITHOUT           
*                                       ENOUGH STORAGE FOR 2 RB'S FOR           
*                                       A WTOR ASKING WHETHER THE               
*                                       TASK'S RESOURCES ARE CRITICAL.          
*                                       THE RESOURCES ARE ASSUMED TO            
*                                       BE CRITICAL, AND THE                    
*                                       PARTITION IS MARKED                     
*                                       PERMANENTLY NONDISPATCHABLE.            
*                                       (OS/VS1)               ICB492*/         
*     3 TCBJSCBB PTR(24),            /* ADDRESS OF THE JOB STEP                 
*                                       CONTROL BLOCK                */         
*    2 TCBSSAT PTR(31),              /* ADDRESS OF THE       @G381P9A           
*                                       SUBSYSTEM AFFINITY   @G381P9A           
*                                       TABLE (SSAT).        @G381P9A           
*                                       SERIALIZATION -      @G381P9A           
*                                       TCBACTIV.            @G381P9A           
*                                       OWNERSHIP - TASK     @G381P9A           
*                                       MANAGEMENT.          @G381P9A           
*                                                                    */         
*    2 TCBIOBRC PTR(31),             /* ADDRESS OF IOB RESTORE CHAIN            
*                                       FOR I/O QUIESCED BY EOT                 
*                                                              YM2840*/         
*    2 TCBEXCPD PTR(31),             /* ADDRESS OF EXCP DEBUG AREA              
*                                                              YM4297*/         
*    2 TCBEXT1  PTR(31),             /* ADDRESS OF OS - OS/VS COMMON            
*                                       EXTENSION              ICB311*/         
*     3 *        CHAR(1),            /* RESERVED.                @H2C*/         
*     3 TCBEXT1A PTR(24),            /* ADDRESS OF OS - OS/VS COMMON            
*                                       EXTENSION              ICB311*/         
*                                                                               
* /*           OS/VS1 - OS/VS2 COMMON SECTION                        */         
*                                                                               
*    2 TCBBITS  CHAR(4) BDY(WORD),   /* FLAG BYTES.  IF A BIT IN THE            
*                                       FOLLOWING TWO BYTES IS SET              
*                                       TO 1, THE PRIMARY                       
*                                       NONDISPATCHABILITY BIT                  
*                                       (OFFSET 33.7 DECIMAL) IS SET            
*                                       TO 1, AND THE TASK IS                   
*                                       NONDISPATCHABLE.             */         
*     3 TCBNDSP4 BIT(8),             /* SECONDARY NONDISPATCHABILITY            
*                                       FLAGS COMMON TO OS/VS1 AND              
*                                       OS/VS2.  COORDINATED WITH               
*                                       PRIMARY NONDISPATCHABILITY              
*                                       FLAG TCBPNDSP.  THIS BYTE IS            
*                                       NOT CURRENTLY SUPPORTED BY              
*                                       OS/VS2.                      */         
*     3 TCBNDSP5 BIT(8),             /* SECONDARY NONDISPATCHABILITY            
*                                       FLAGS UNIQUE TO OS/VS1 OR               
*                                       OS/VS2.  COORDINATED WITH               
*                                       PRIMARY NONDISPATCHABILITY              
*                                       FLAG TCBPNDSP.  THIS BYTE IS            
*                                       NOT CURRENTLY SUPPORTED BY              
*                                       OS/VS2.                      */         
*     3 TCBFLGS6 CHAR(1),            /* TASK-RELATED FLAGS           */         
*      4 TCBRV    BIT(1),            /* THE PARTITION IS FIXED IN               
*                                       REAL STORAGE.  VIRTUAL                  
*                                       ADDRESSES ARE EQUAL TO REAL             
*                                       ADDRESSES.                   */         
*      4 TCBPIE17 BIT(1),            /* PAGE FAULT INTERRUPT IS TO              
*                                       BE PASSED TO THE TASK'S                 
*                                       INTERRUPT EXIT AND AN 8-BYTE            
*                                       PICA IS IN EFFECT FOR THIS              
*                                       TASK                   ICB339*/         
*      4 TCBCPU   BIT(1),            /* TASK IS CPU-BOUND MEMBER OF             
*                                       AUTOMATIC PRIORITY GROUP                
*                                       (APG)                        */         
*      4 TCBSPVLK BIT(1),            /* TASK SCHEDULED FOR ABTERM               
*                                       WHILE OWNING SUPERVISOR LOCK */         
*      4 TCBHCRM  BIT(1),            /* Health Checker has established          
*                                       a task term resmgr for this             
*                                       task                     @LBC*/         
*      4 TCBMIGR  BIT(1),            /* REGION SELECTED FOR MIGRATION           
*                                       FROM PRIMARY PAGING DEVICE   */         
*      4 TCBAPG   BIT(1),            /* TASK IS IN AUTOMATIC PRIORITY           
*                                       GROUP (APG)                  */         
*      4 TCBNTJS  BIT(1),            /* JOB STEP TASK BUT NOT HIGHEST           
*                                       IN FAILING TREE              */         
*     3 TCBFLGS7 CHAR(1),            /* TASK-RELATED FLAGS           */         
*      4 TCBGPECB BIT(1),            /* TASK IS IN AN ECB WAIT FOR A            
*                                       GETPART                ICB339*/         
*      4 TCBSENVP BIT(1),            /*                          @LCA*/         
*      4 TCBSVCSP BIT(1),            /* IF 1, PROPAGATION OF SVC                
*                                       SCREENING TO SUBTASKS IS                
*                                       REQUIRED             @G860PXB*/         
*      4 TCBSTACK BIT(1),            /* SET IN JOB STEP TCB TO                  
*                                       INDICATE THAT A TASK IN THE             
*                                       JOB STEP IS IN SERIAL ABEND             
*                                       PROCESSING.  USED IN                    
*                                       CONJUNCTION WITH TCBFOINP.              
*                                                              ICB374*/         
*      4 TCBSVCS  BIT(1),            /* IF 1, SVC SCREENING IS                  
*                                       REQUIRED FOR THE TASK.  THIS            
*                                       OFFSET FIXED BY ARCHITECTURE.           
*                                                            @G50EP9A*/         
*      4 TCBRSTSK BIT(1),            /* RESIDENT SYSTEM TASK         */         
*      4 TCBADMP  BIT(1),            /* ALL OTHER TASKS IN JOB STEP             
*                                       HAVE BEEN SET NONDISPATCHABLE           
*                                       BY ABDUMP.  THIS BIT IS SET             
*                                       TO CONTROL JOB STEP DURING              
*                                       THE DUMPING PROCESS.         */         
*      4 TCBGTOFM BIT(1),            /* GENERALIZED TRACE FACILITY              
*                                       (GTF) TRACING HAS BEEN                  
*                                       TEMPORARILY DISABLED UNDER              
*                                       THIS TASK              ICB402*/         
*    2 TCBDAR   CHAR(1),             /* DAMAGE ASSESSMENT ROUTINE               
*                                       (DAR) FLAGS                  */         
*     3 TCBDARP  BIT(1),             /* PRIMARY DAR RECURSION.  DAR             
*                                       HAS BEEN ENTERED FOR THIS               
*                                       TASK                         */         
*     3 TCBDARS  BIT(1),             /* SECONDARY DAR RECURSION.  IF            
*                                       DAR IS REENTERED, THIS TASK             
*                                       WILL BE SET NONDISPATCHABLE.*/          
*     3 TCBDARD  BIT(1),             /* A DUMP HAS BEEN REQUESTED               
*                                       FOR A WRITER OR SCHEDULER               
*                                       ABEND, AND THE USER HAS NOT             
*                                       PROVIDED A SYSABEND DD CARD             
*                                       (OS/VS1)                     */         
*     3 TCBDARC  BIT(1),             /* RECURSION PERMITTED IN                  
*                                       CLOSE - AFTER DAR PROCESSING            
*                                       COMPLETED  (PCP)             */         
*      4 TCBDARMC BIT(1),            /* DAR HAS BEEN ENTERED TO                 
*                                       HANDLE A VALID RECURSION                
*                                       IN MUST-COMPLETE STATUS                 
*                                       THROUGH ABEND          ICB264*/         
*     3 TCBDARO  BIT(1),             /* SYSTEM ERROR TASK IS FAILING.           
*                                       DAR DUMP SHOULD NOT REQUEST             
*                                       ANY ERROR RECOVERY PROCEDURE            
*                                       (ERP) PROCESSING.            */         
*     3 TCBDARWT BIT(1),             /* A WTO OPERATION WITH A                  
*                                       'REINSTATEMENT FAILURE'                 
*                                       MESSAGE IS IN PROCESS FOR DAR           
*                                                              ICB264*/         
*     3 TCBDARMS BIT(1),             /* WTO OPERATION WITH A 'DAR IN            
*                                       PROGRESS' MESSAGE IS IN                 
*                                       PROCESS FOR DAR (OS/VS1)                
*                                                            @XA08316*/         
*     3 TCBEXSVC BIT(1),             /* THE DUMP SVC ROUTINE IS                 
*                                       EXECUTING FOR THIS TASK      */         
*    2 TCBRSV37 PTR(8),              /* RESERVED FOR USER            */         
*    2 TCBSYSCT PTR(8),              /* NUMBER OF OUTSTANDING                   
*                                       SYSTEM-MUST-COMPLETE                    
*                                       REQUESTS (ICB497)      YM3883*/         
*    2 TCBSTMCT PTR(8),              /* NUMBER OF OUTSTANDING                   
*                                       STEP-MUST-COMPLETE                      
*                                       REQUESTS (ICB497)      YM3883*/         
*    2 TCBEXT2  PTR(31) BDY(DWORD),  /* SAME AS TCBEXT2A       ICB311*/         
*     3 *        BIT(8),             /* FIRST BYTE OF TCBEXT2                   
*                                                            @G381P9A*/         
*     3 TCBEXT2A PTR(24),            /* ADDRESS OF OS/VS1 - OS/VS2              
*                                       COMMON EXTENSION       ICB311*/         
*                                                                               
* /*           OS/VS2 TCB OVERLAY                                    */         
*                                                                               
*    2 TCBR0D4  CHAR(4),             /* Reserved                 @PBC*/         
*    2 TCBXSB   PTR(31),             /* ADDRESS OF CURRENT   @G381P9A           
*                                       XSB FOR TASK.        @G381P9A           
*                                       SERIALIZATION -      @G381P9A           
*                                       TCBACTIV.            @G381P9A           
*                                       OWNERSHIP-SUPERVISOR @G381P9A           
*                                                            @G381P9A*/         
*    2 TCBBACK  PTR(31),             /* ADDRESS OF PREVIOUS TCB ON              
*                                       READY QUEUE.  ZERO IN TOP               
*                                       TCB.                         */         
*    2 TCBRTWA  PTR(31),             /* POINTER TO CURRENT RTM2 WORK            
*                                       AREA                         */         
*    2 TCBNSSP POINTER(31),          /* NORMAL STACK SAVE AREA                  
*                                       POINTER.                                
*                                       SERIALIZATION - TCBACTIV.               
*                                       OWNERSHIP - SUPERVISOR.                 
*                                                            @G381P9A*/         
*     3 TCBNSSQA BIT(1),             /* NORMAL STACK SAVED IN SQA               
*                                       INDICATOR.           @G38CPXB*/         
*    2 TCBXLAS PTR(31),              /* ASCB ADDRESS OF THE CML LOCK            
*                                       HELD WHILE TCB SUSPENDED OR             
*                                       INTERRUPTED.                            
*                                       SERIALIZATION - TCBACTIV.               
*                                       OWNERSHIP - SUPERVISOR.                 
*                                                            @G381P9A*/         
*    2 TCBABCUR CHAR(1),             /* ABEND RECURSION BYTE         */         
*    2 TCBFJMCT PTR(8),              /* NUMBER OF OUTSTANDING                   
*                                       STEP-MUST-COMPLETE REQUESTS             
*                                       ISSUED BY THE TASK.  @YA02725*/         
*    2 TCBTID   CHAR(1),             /* The task identifier as                  
*                                       specified on the TID parameter          
*                                       of ATTACH or ATTACHX.                   
*                                       The following task identifiers          
*                                       are for internal use only:              
*                                                                @P7C*/         
*%TCBPAGID='''FF''X';                /* ID FOR PAGING SUPERVISOR                
*                                       TASK                   ICB403*/         
*%TCBSYERR='''FE''X';                /* ID FOR SYSTEM ERROR                     
*                                       TASK                   ICB403*/         
*%TCBCOMM='''FD''X';                 /* ID FOR COMMUNICATIONS                   
*                                       TASK                   ICB403*/         
*%TCBIORMS='''FC''X';                /* ID FOR I/O RMS                          
*                                       TASK                   ICB403*/         
*%TCBMASTR='''FB''X';                /* ID FOR MASTER SCHEDULER                 
*                                       TASK                   ICB403*/         
*%TCBJES='''FA''X';                  /* ID FOR JOB ENTRY SUBSYSTEM              
*                                       (JES) MONITOR TASK     ICB403*/         
*%TCBDSSID='''F9''X';                /* ID FOR DYNAMIC SUPPORT SYSTEM           
*                                       (DSS) TASK             ICB403*/         
*%TCBLOGID='''F8''X';                /* ID FOR SYSTEM LOG TASK       */         
*    2 TCBFLGS8 CHAR(1),             /* GUPI FLAG BYTE FIELD.                   
*                                       SERIALIZATION - TCBACTIV (Must          
*                                       be running under this TCB when          
*                                       updating this field.)    @P1A*/         
*     3 TCBDYING BIT(1),             /* If on, indicates that this TCB          
*                                       will be terminating (normally           
*                                       or abnormally) and its mainline         
*                                       processing will not be allowed          
*                                       to run again.  Also see the             
*                                       TCBENDNG bit.  TCBDYING is              
*                                       set when any of the following           
*                                       occur:                                  
*                                       - the TCB is terminating                
*                                         normally                              
*                                       - before Estae-type recovery            
*                                         routines receive control for          
*                                         Cancel and Detach (not                
*                                         including Detach with STAE)           
*                                         abends                                
*                                       - after all recovery routines           
*                                         have percolated for retriable         
*                                         abends                                
*                                       Ownership - RTM.         @0CC*/         
*     3 TCBNOIRB BIT(1),             /* If on, IRBs will not be queued          
*                                       to this TCB.  A program                 
*                                       setting this flag MUST save             
*                                       its current value and restore           
*                                       that value either when that             
*                                       program can tolerate IRBs               
*                                       being queued or before the              
*                                       current RB terminates.   @08A*/         
*     3 TCBJTCBA BIT(1),             /* JSTCB being attached by                 
*                                       initiator                @L9A*/         
*     3 TCBSDNDX BIT(1),             /* If on, this task is exempt from         
*                                       being set non-dispatchable for          
*                                       SDUMP by STATUS          @LGA*/         
*     3 TCBENDNG BIT(1),             /* If on, indicates that this TCB          
*                                       will be terminating (normally           
*                                       or abnormally) and its mainline         
*                                       processing will not be allowed          
*                                       to run again.  The key                  
*                                       difference between TCBENDNG and         
*                                       TCBDYING is that TCBENDNG is            
*                                       set before all types of                 
*                                       recovery routine if they will           
*                                       not be allowed to retry.                
*                                       TCBDYING is not set before FRRs         
*                                       and is set before Estae-type            
*                                       recovery routines only for              
*                                       Cancel and Detach abends.               
*                                       TCBENDNG is set when any of the         
*                                       following occur:                        
*                                       - the TCB is terminating                
*                                         normally                              
*                                       - before recovery routines              
*                                         (including FRRs) receive              
*                                         control for all non-retriable         
*                                         abends including Cancel,              
*                                         Detach, Detach with STAE,             
*                                         and RETRY=NO abends                   
*                                       - after all recovery routines           
*                                         have percolated for retriable         
*                                         abends                                
*                                       Ownership - RTM.         @0CA*/         
*%IF SYSVERSION = '' %THEN %GOTO IKJTCB_4; /* Not PL/AS, skip    @LHA*/         
*%IF SYSRULESMOD='PL/S-III ' %THEN %GOTO IKJTCB_4;          /*   @LHA*/         
*     3 TCBEndingAbnormally BIT(1),    /* If On, indicates that this            
*                                       TCB is abnormally terminating           
*                                       or (if the task has ended) has          
*                                       abnormally terminated.  This            
*                                       bit is a direct intended                
*                                       interface replacement for               
*                                       TCBFA.  TCBEndingAbnormally is          
*                                       set when RTM detects that a             
*                                       task will terminate abnormally          
*                                       and its mainline will not be            
*                                       allowed to run again in the             
*                                       following situations:                   
*                                       - before Estae-type recovery            
*                                         (not FRRs) receives control           
*                                         for all non-retriable abends          
*                                         including Cancel, Detach,             
*                                         Detach with STAE, and                 
*                                         RETRY=NO abterms                      
*                                       - after all recovery routines           
*                                         have percolated for retriable         
*                                         abends                                
*                                       - in all subtasks before                
*                                         TERM=YES Estae-type recovery          
*                                         is invoked for a Cancel or            
*                                         Detach abend of the current           
*                                         task                                  
*                                       If the task has ended,                  
*                                       TCBEndingAbnormally can be              
*                                       used to determine whether               
*                                       STCBCMP contains an ABEND code          
*                                       or the contents of GPR 15 when          
*                                       the last program returned to            
*                                       the system.                             
*                                       Ownership - RTM          @LHA*/         
*%GOTO IKJTCB_4A;                                                               
*%IKJTCB_4:;                                                /*   @LEA*/         
*     3 *        BIT(1),             /*                          @PAA*/         
*%IKJTCB_4A:;                                               /*   @LHA*/         
*     3 TCBDEBL   BIT(1),            /* Serialization: TCBACTIV                 
*                                       Ownership: Supervisor    @PCM*/         
*     3 TCBSIQEO BIT(1),             /* If on, during task termination,         
*                                       only IQEs set for STIMER(M)             
*                                       should be dequeued       @0GA*/         
*    2 TCBXSCT  CHAR(4) BDY(WORD),   /* DISPATCHER INTERSECT CONTROL            
*                                       WORD                 @Z40FP9A*/         
*     3 TCBXSCT1 BIT(8),             /* FLAG BYTE            @Z40FP9A*/         
*      4 TCBACTIV BIT(1),            /* BIT ON MEANS THIS TCB IS                
*                                       CURRENTLY ACTIVE ON A CPU.              
*                                       USED TO SYNCHRONIZE SOME                
*                                       STATUS SAVING AND                       
*                                       DISPATCHABILITY INDICATORS              
*                                       WHEN ACTIVE OR NOT UNDER THE            
*                                       LOCAL LOCK.          @Z40FP9A*/         
*      4 TCBS3A   BIT(1),            /* STAGE 3 EXIT EFFECTOR/RESUME/           
*                                       TCTL INTERSECT FLAG                     
*                                                            @Z40FP9A*/         
*      4 TCBLLREQ BIT(1),            /* TASK REQUESTED LOCAL LOCK               
*                                                            @G50DP9A*/         
*      4 *        BIT(1),            /* RESERVED.                @06C*/         
*      4 TCBTDORM BIT(1) ABNORMAL,                                              
*                                    /* Turned on to detect dormant             
*                                       Tasks by Parallel Detach                
*                                       processing.  Turned off by              
*                                       the Dispatcher during Task              
*                                       dispatch                 @09C*/         
*      4 *        BIT(3),            /* RESERVED.                @06C*/         
*     3 TCBXSCT2 BIT(8),             /* FLAG BYTE            @G381P9A*/         
*      4 TCBCMLF BIT(1),             /* CML RESOURCE MANAGER                    
*                                       PROCESSING COMPLETE FOR THIS            
*                                       CML LOCK OWNER.                         
*                                                            @G381P9A*/         
*      4 TCBLLNEW BIT(1),            /* Lock Management has given this          
*                                       task the local lock, but its            
*                                       status is in the TCB, not the           
*                                       IHSA.                                   
*                                       SERIALIZATION: TCBACTIV                 
*                                       OWNERSHIP: Task Management              
*                                                                @L5A*/         
*      4 TCBRSMRC BIT(1),            /* Task RSM RESMGR processing              
*                                       is complete.                            
*                                       Serialization: TCBACTIV                 
*                                       Ownership: RTM           @LJA*/         
*      4 *        BIT(5),            /* RESERVED.                @0HC*/         
*     3 TCBCCPVI FIXED(15),          /* ID OF THE CURRENT CPU RUNNING           
*                                       THIS TASK.  USED FOR RECOVERY           
*                                       AND CPU AFFINITY.                       
*                                                            @Z40FP9A*/         
*    2 TCBFOE   PTR(31),             /* SAME AS TCBFOEA BELOW  ICB339*/         
*     3 *        CHAR(1),            /* RESERVED.                @H2C*/         
*     3 TCBFOEA  PTR(24),            /* ADDRESS OF FIRST FIX                    
*                                       OWNERSHIP ELEMENT (FOE) IN              
*                                       LIST FOR THIS TASK     ICB339*/         
*    2 TCBSWA   PTR(31),             /* ADDRESS OF FIRST SCHEDULER              
*                                       WORK AREA (SWA) SPQE ON SWA             
*                                       SPQE CHAIN           @Z40AQ9A*/         
*    2 TCBSTAWA PTR(31),             /* ESTAE ROUTINE WORK AREA                 
*                                       POINTER              @Z40FP9A*/         
*    2 TCBTCBID CHAR(4) BDY(WORD),   /* CONTAINS BLOCK ID - 'TCB '              
*                                                                    */         
*    2 TCBRTM12 PTR(31),             /* POINTER TO PARAMETER AREAS              
*                                       PASSED FROM RTM1 TO RTM2                
*                                                                    */         
*    2 TCBESTAE CHAR(4) BDY(WORD),   /* AREA TO CONTAIN RECOVERY DATA           
*                                       FOR RTM                      */         
*     3 TCBSCBKY  CHAR(1),           /* KEY IN WHICH SYNCH IS TO PASS           
*                                       CONTROL TO THE USER EXIT                
*                                                            @ZM49655*/         
*     3 TCBESTRM BIT(8),             /* ESTAE TERM OPTIONS           */         
*      4 TCBETERM BIT(1),            /* ESTAE EXIT ENTERED WITH TERM            
*                                       OPTION                       */         
*      4 TCBSTAFX BIT(1),            /* SERIALIZED BY TCB ACTIVE                
*                                                            @ZA30005*/         
*      4 *        BIT(6),            /* RESERVED.                @H2C*/         
*     3 TCBERTYP PTR(8),             /* TYPE OF ERROR CAUSING ENTRY             
*                                       TO THE RTM.  SET BY RTM1.               
*                                                                    */         
*     3 TCBMODE  PTR(8),             /* MASK INDICATING MODE OF                 
*                                       SYSTEM AT TIME OF ERROR.                
*                                       SEE IHART1W/MODE FOR                    
*                                       INDIVIDUAL BIT DEFINITIONS.             
*                                                                    */         
*    2 TCBUKYSP PTR(31),             /* ADDRESS OF SPQE'S FOR                   
*                                       SUBPOOLS 229 AND 230 (USER              
*                                       KEY STORAGE IN THE PRIVATE              
*                                       AREA)                        */         
*    2 TCBPROPF CHAR(2),             /* Flags that are propagated to            
*                                       new TCB                  @L9A*/         
*      3 TCBPROP0 CHAR(1),           /* Byte 0 of TCBPROPF       @L9A*/         
*        5 TCBBITCB BIT(1),          /* This task is "below" the                
*                                       initiator TCB            @L9A*/         
*      3 TCBPROP1 CHAR(1),           /* Byte 1 of TCBPROPF       @L9A*/         
*    2 TCBAFFN  BIT(16),             /* CPU AFFINITY INDICATOR       */         
*    2 TCBFBYT1 BIT(8),              /* FLAG BYTE.                              
*                                       SERIALIZATION - TCBACTIV OR             
*                                       TASK NONDISPATCHABLE AND                
*                                       LOCAL LOCK.          @G381P9A*/         
*     3 TCBEOTFM BIT(1),             /* END OF TASK FLAG FOR FREEMAIN.          
*                                       SET TO 1 AT START OF ABNORMAL           
*                                       TERMINATION PROCESSING                  
*                                       AND RESET TO 0 AT                       
*                                       FINISH.  INDICATES THAT A               
*                                       FREEMAIN ON A BLOCK OF LOCAL            
*                                       STORAGE THAT IS STILL FIXED             
*                                       BY RSM SHOULD RESULT IN A               
*                                       RETURN CODE OF 8 RATHER THAN            
*                                       ABNORMAL TERMINATION.        */         
*     3 TCBRTM1E BIT(1),             /* RTM1 IS CURRENTLY PROCESSING            
*                                       EUT FRR'S FOR THIS TASK                 
*                                                            @G381P9A*/         
*     3 TCBNDIOS BIT(1),             /* TASK HAS BEEN SET                       
*                                       NONDISPATCHABLE VIA STATUSND            
*                                       WHILE SVC 16 (PURGE) SCANS              
*                                       THE RB CHAIN PURGING APPENDAGE-         
*                                       SCHEDULED ASYNCHRONOUS EXIT             
*                                       ROUTINES RUNNING UNDER AN               
*                                       IRB/RQE OR NON-RESIDENT ERP'S           
*                                       RUNNING UNDER THE SIRB       */         
*     3 TCBPGNLY BIT(1),             /* SET BY RTM2 TO INDICATE ONLY            
*                                       PURGE PHASE TO BE PERFORMED             
*                                                                    */         
*     3 TCBRTM2  BIT(1),             /* SET BY RTM2 TO INDICATE RTM2            
*                                       HAS BEEN ENTERED FOR THIS               
*                                       TASK                         */         
*     3 TCBEOT   BIT(1),             /* SET BY RTM2 TO INDICATE TO              
*                                       EXIT THAT END OF TASK                   
*                                       PROCESSING IS COMPLETE       */         
*     3 TCBSATTN BIT(1),             /* SYNCHRONIZATION OF ATTENTION            
*                                       INTERRUPT REQUIRED BY EXIT              
*                                       PROLOG               @ZM48358*/         
*     3 TCBLLH   BIT(1),             /* Task was interrupted holding            
*                                       the local lock.              */         
*    2 TCBFBYT2 BIT(8),              /* FLAG BYTE.                              
*                                       SERIALIZATION - TCBACTIV OR             
*                                       TASK NONDISPATCHABLE AND                
*                                       LOCAL LOCK.          @G381P9A*/         
*     3 TCBCNCB  BIT(1),             /* SET BY RTM2 IN THE JOB STEP             
*                                       TCB WHEN IT HAS BEEN ENTERED            
*                                       ON THE TCB FOR AN X22                   
*                                       ABEND                        */         
*     3 TCBFMW   BIT(1),             /* MOTHER WAITING FLAG.  TURNED            
*                                       ON IN A SUBTASK IN RTM2                 
*                                       PROCESSING WHEN AN ANCESTOR             
*                                       TASK IS WAITING TO ABEND                
*                                       IT.                          */         
*     3 TCBFDW   BIT(1),             /* Set by RTM2 to ensure that              
*                                       only one daughter task will             
*                                       terminate its jobstep task.             
*                                       No longer means 'daughter               
*                                       waiting'                 @PBC*/         
*     3 TCBFPRAP BIT(1),             /* SET BY RTM2 TO PREVENT                  
*                                       PERCOLATION TO THE TASK OF AN           
*                                       ASYNCHRONOUS ABEND           */         
*     3 TCBRT1NR BIT(1),             /* IF 1, ERROR PROPAGATED FROM             
*                                       RTM1 IS NON-RETRYABLE    @D1A*/         
*     3 TCBECBNV BIT(1),             /* IF 1, ECB POINTED TO BY                 
*                                       TCBECB IS NOT TO BE VALIDITY            
*                                       CHECKED.  IF 0, ECB POINTED             
*                                       TO BY TCBECB IS TO BE                   
*                                       VALIDITY CHECKED.            */         
*     3 TCBSSPC BIT(1),              /* STATUS STOP PENDING, TASK HOLDS         
*                                       A CML LOCK OR IS IN FUNCTION            
*                                       MUST COMPLETE MODE.      @L3C*/         
*     3 TCBRTM1C BIT(1),             /* A TASK WITH EUT FRRS HAS BEEN           
*                                       CANCELLED. THIS FLAG PASSES             
*                                       THE CANCEL REQUEST FROM RTM1            
*                                       TO RTM2.             @ZA56255*/         
*    2 TCBFBYT3 BIT(8),              /* FLAG BYTE.                              
*                                       SERIALIZATION=TCBACTIV OR               
*                                       TASK NONDISPATCHABLE AND                
*                                       LOCAL LOCK.          @ZA72701*/         
*     3 TCBEXP   BIT(1),             /* EXPANDED VERSION OF                     
*                                       THE TCB              @ZA72701*/         
*     3 TCBNCTL  BIT(1),             /* IF 1, INDICATES USER PROGRAM            
*                                       IS LOADED UNDER THIS TASK OR            
*                                       A LOWER TASK.                           
*                                       OWNERSHIP: RACF      @ZA84893*/         
*     3 TCBRTMDE BIT(1),             /* DETACH HAS BEEN CALLED BY               
*                                       BY RTM               @ZA93650*/         
*     3 TCBMTDP  BIT(1),             /* Memterm SDUMP            @LAA*/         
*     3 *        BIT(4),             /* RESERVED.                @LAC*/         
*    2 TCBFBYT4 BIT(8),              /* FLAG BYTE.                              
*                                       SERIALIZATION: TCBACTIV.                
*                                       This is an interface for bit            
*                                       TCB_PThreadTermAbnormal only.           
*                                                                @L3A*/         
*     3 TCBPMC  BIT(1),              /* IF 1, INDICATES TASK IS IN              
*                                       PROCESS MUST COMPLETE MODE.             
*                                                                @D2C*/         
*     3 TCBNOJLB BIT(1),             /* If 1, TCBJLB is not to be               
*                                       used                     @07A*/         
*     3 TCBATSKL BIT(1),             /* IF 1, this task's TASKLIB was           
*                                       provided by an authorized               
*                                       attacher                 @LDA*/         
*%IF SYSVERSION = '' %THEN %GOTO IKJTCB_3; /* Not PL/AS, skip    @0DA*/         
*%IF SYSRULESMOD='PL/S-III ' %THEN %GOTO IKJTCB_3;          /*   @0DA*/         
*     3 TCB_IEAVALCK_1 BIT(1),       /* If 1, IEAVALCK will apply a             
*                                       rule that the task being                
*                                       checked can be any jobstep              
*                                       task. Valid only for the                
*                                       ASCBXTCB task's TCB      @0IA*/         
*     3 TCB_KEEP_LS_EXTENT_VALID BIT(1), /* If 1, do not unchain and            
*                                       page release a LSS during a             
*                                       Stack Empty (PIC31) exception           
*                                       Ownership: Supervisor    @0DA*/         
*     3 TCB_PThreadTermAbnormal BIT(1), /* If 1, some z/OS Unix                 
*                                       thread terminated abnormally,           
*                                       whether by abend or non-zero            
*                                       return code. Note that this bit         
*                                       might be on even if the task            
*                                       terminates normally.                    
*                                       Ownership: z/OS Unix and                
*                                       Context Services         @0FA*/         
*     3 *       BIT(2),              /* RESERVED.                @0DC*/         
*%IKJTCB_3:;                                                /*   @0DC*/         
*    2 TCBRPT   PTR(31),             /* ADDRESS OF RADIX PARTITION              
*                                       TREE FOR LOCAL STORAGE                  
*                                       MANAGEMENT                   */         
*    2 TCBVAT   PTR(31),             /* ADDRESS OF THE VAT   @ZA63673           
*                                       (VSAM). THERE IS ONE @ZA63673           
*                                       VAT PER JOB STEP TCB @ZA63673*/         
*    2 TCBSWASA PTR(31),             /* ADDRESS OF SAVE AREA USED BY            
*                                       SWA MANAGER                  */         
*    2 TCBSVCA2 PTR(31),             /* ADDRESS OF SVC SCREENING                
*                                       TABLE                @G50EP9A*/         
*    2 TCBERD  PTR(31),              /* EXTENDED REGION DESCRIPTOR.             
*                                       SERIALIZATION - THE LOCAL LOCK.         
*                                       OWNERSHIP - VSM.     @G860PXU*/         
*    2 TCBEAE  PTR(31),              /* EXTENDED ALLOCATED ELEMENT              
*                                       QUEUE ANCHOR.                           
*                                       SERIALIZATION - THE LOCAL LOCK.         
*                                       OWNERSHIP - VSM.     @G860PXU*/         
*    2 TCBARC  FIXED(31),            /* REASON CODE FOR ABEND.                  
*                                       OWNERSHIP - RTM      @G860PXB*/         
*    2 TCBGRES FIXED(31),            /* TASK GLOBAL RESOURCE COUNT -            
*                                 NUMBER OF GLOBAL RESOURCES OWNED BY           
*                                 THIS TASK                      @L1A*/         
*    2 TCBSTCB  PTR(31),             /* ADDRESS OF STCB          @H2C*/         
*    2 TCBTTIME BIT(64),             /* TCB'S ACCUMULATED CPU TIME              
*                                                                @01A*/         
*    2 TCBCELAP PTR(31),             /* COMMON EXECUTION LIBRARY ANCHOR         
*                                       POINTER                  @02A*/         
*    2 TCBR148  CHAR(2),             /* RESERVED                 @05C*/         
*    2 TCBRBYT1 BIT(8),              /* RTM flag byte                           
*                                       Ownership: RTM                          
*                                      Serialization: Local lock @05A*/         
*     3 TCBPVICT BIT(1),             /* If 1, indicates that the                
*                                       associated task has received an         
*                                       ABEND13E as a result of                 
*                                       Parallel Detach processing.             
*                                       Used by both RTM1 and RTM2.             
*                                                                @05M*/         
*     3 TCBPKING BIT(1),             /* If 1, indicates that the                
*                                       associated Task has been marked         
*                                       as responsible for the removal          
*                                       of its subtasks (in RTM                 
*                                       processing)              @05A*/         
*     3 TCBPCAND BIT(1),             /* If 1, indicates that this               
*                                       Task has requested Parallel             
*                                       Detach protection and should            
*                                       be on the queue pointed to              
*                                       by ASSBPTAR              @06A*/         
*     3 TCBPTOP  BIT(1),             /* If 1, indicates that this               
*                                       Task is at the top of a Task            
*                                       structure that was Parallel             
*                                       Detached                 @06A*/         
*     3 *        BIT(4),             /* Reserved                 @06C*/         
*    2 TCBLEVEL BIT(8),              /* LEVEL NUMBER OF TCB  @ZA72701*/         
*    2 TCBBDT  PTR(31),              /* ADDRESS OF  BDT'S GSD LINKAGE           
*                                       CONTROL BLOCK        @ZA72701*/         
*    2 TCBNDAXP FIXED(31),           /* COUNT OF THE NUMBER OF                  
*                                       CONSECUTIVE DISPATCHES                  
*                                       REQUIRED ON A CP BEFORE THE             
*                                       TASK SHOULD BE REDISPATCHED ON          
*                                       AN AXP.                                 
*                                       OWNER:  SUPERVISOR CONTROL              
*                                       SERIALIZATION:  TCBACTIV BIT            
*                                       OF FIELD TCBXSCT1        @H1A*/         
*    2 TCBSENV  PTR(31),             /* ADDRESS OF ACEE FOR THE TASK.           
*                                       THE ACEE DESCRIBES THE RACF             
*                                       AUTHORIZATION FOR THE TASK.             
*                                       OWNER:  RACF                            
*                                       SERIALIZATION: NONE,                    
*                                       ONLY UPDATED BY TASK                    
*                                       ITSELF.                  @H1A*/         
*    2 *        CHAR(0) BDY(DWORD);                                             
*                                                                               
* /*           OS/VS1 - OS/VS2 COMMON EXTENSION                      */         
*                                                                               
* DECLARE                                                                       
*   1 TCBXTNT2 BASED(TCBEXT2)  BDY(DWORD) IHAALET,     /*        @L2C*/         
*    2 TCBGTF   PTR(31),             /* SAME AS TCBGTFA BELOW  ICB312*/         
*     3 TCBTFLG  BIT(8),             /* GENERALIZED TRACE FACILITY              
*                                       (GTF) FLAG BYTE        ICB312*/         
*      4 TCBASYNC BIT(1),            /* GTF ASYNCHRONOUS GATHER                 
*                                       ROUTINE IS IN CONTROL  ICB312*/         
*      4 TCBERRTN BIT(1),            /* GTF ASYNCHRONOUS GATHER ERROR           
*                                       ROUTINE IS IN CONTROL  ICB312*/         
*      4 TCBDSPIT BIT(1),            /* MACHINE CHECK INTERRUPTION              
*                                       HANDLER SHOULD UNCONDITIONALLY          
*                                       BRANCH TO DISPATCHER   ICB312*/         
*      4 *        BIT(5),            /* RESERVED.                @H2C*/         
*     3 TCBGTFA  PTR(24),            /* ADDRESS OF GTF TEMPORARY                
*                                       TRACE BUFFER           ICB312*/         
*    2 *        CHAR(1),             /* RESERVED.                @H2C*/         
*    2 TCBRCMP  BIT(24),             /* MOST RECENT ABEND COMPLETION            
*                                       CODE (INCLUDING VALID                   
*                                       RECURSIONS IN STAE)    ICB411*/         
*    2 TCBEVENT PTR(31),             /* ADDRESS OF EVENT TABLES QUEUE           
*                                                            @X31ED9A*/         
*    2 TCBRTMCT FIXED(32),           /* COUNT OF TOKENS USED FOR ESTAE.         
*                                       SERIALIZATION - CS.                     
*                                       OWNERSHIP - RTM.     @G381PXU*/         
*    2 TCBTQE   PTR(31),             /* ADDRESS OF A REUSABLE                   
*                                       TASK-RELATED TQE                        
*                                                            @G50EP9A*/         
*    2 TCBCAUF  PTR(31),             /* ADDRESS OF SUBSYSTEM FACILITY           
*                                       CONTROL BLOCK                           
*                                                            @ZA27912*/         
*    2 TCBPERCP PTR(31),             /* POINTER TO A QUEUE OF SPIS.             
*                                       AN SPI REPRESENTS THE                   
*                                       PERCOLATION OF AN SRB'S FRR TO          
*                                       THE RELATED TASK.                       
*                                       SERIALIZATION - TCBACTIV OR             
*                                       TASK NONDISPATCHABLE AND                
*                                       LOCAL LOCK.                             
*                                       OWNERSHIP - RTM.     @G381P9A*/         
*     3 TCBRCVRY BIT(1),             /* TASK IS IN RECOVERY.                    
*                                       SERIALIZATION - TCBACTIV.               
*                                       OWNERSHIP - RTM.     @G381P9A*/         
*    2 TCBPERCT FIXED(31),           /* COUNT OF SRB MODE FRRS WAITING          
*                                       TO PERCOLATE TO THIS TASK, BUT          
*                                       NOT REPRESENTED IN SPI QUEUE            
*                                       (TCBPERCP).                             
*                                       SERIALIZATION - TCBACTIV OR             
*                                       TASK NONDISPATCHABLE AND                
*                                       LOCAL LOCK.                             
*                                       OWNERSHIP - RTM.     @G381P9A*/         
*    2 *        CHAR(0) BDY(DWORD);                                             
*                                                                               
*%TCBLEN='LENGTH(TCBFIX) + LENGTH(TCB) + LENGTH(TCBXTNT2)';  /* TCB             
*                                       LENGTH INCLUDING PREFIX                 
*                                                              ICB362*/         
*                                                                               
*DCL TCBVS02A FIXED(8) CONSTANT( 2); /* JBB2110 (NOT IN BASE)@ZA72701*/         
*DCL TCBVS02B FIXED(8) CONSTANT( 2); /* JBB2125              @ZA72701*/         
*DCL TCBVS03  FIXED(8) CONSTANT( 3); /* JBB2133                  @H1A*/         
*DCL TCBVERS  FIXED(8) CONSTANT( 3); /* LEVEL OF THIS MAPPING    @H1C*/         
*%IF SYSVERSION = '' %THEN %GOTO IKJTCB_2;  /* Not PL/AS, skip   @L3A*/         
*%IF SYSRULESMOD='PL/S-III ' %THEN %GOTO IKJTCB_2;                              
*DCL TCBOPEN_CON BIT(8) Constant('01'X); /* OPEN DUMP DATA SET                  
*                                                              ICB456*/         
*DCL TCBCLOSD_CON BIT(8) Constant('02'X); /* CLOSE DIRECT SYSOUT ON             
*                                       TAPE                   ICB456*/         
*DCL TCBCLOSE_CON BIT(8) Constant('03'X); /*                                    
*                                     CLOSE OPEN DATA SETS ICB456*/             
*DCL TCBCLOSF_CON BIT(8) Constant('04'X); /* RESERVED.         ICB456*/         
*DCL TCBGREC_CON BIT(8) Constant('05'X); /* GRAPHICS           ICB456*/         
*DCL TCBADUMP_CON BIT(8) Constant('07'X); /* ABDUMP            ICB456*/         
*DCL TCBPTAXE_CON BIT(8) Constant('08'X); /* PURGE TAXE        ICB456*/         
*DCL TCBMESG_CON BIT(8) Constant('09'X); /* MESSAGE RECURSION ICB456*/          
*DCL TCBDYNAM_CON BIT(8) Constant('0A'X); /*                                    
*                                     DD-DYNAM TIOT CLEANUP    ICB456*/         
*DCL TCBDAMSG_CON BIT(8) Constant('0B'X); /* ABEND IS ISSUING A WTOR            
*                                       ASKING WHETHER THE JOB STEP             
*                                       TASK SHOULD WAIT FOR THE                
*                                       DUMP AREA (OS/VS1)           */         
*DCL TCBQTIP_CON BIT(8) Constant('0C'X); /* PURGE TSO INTERPARTITION            
*                                       POSTS                  ICB456*/         
*DCL TCBTCAMP_CON BIT(8) Constant('0D'X); /* PURGE TCAM INTERPARTITION          
*                                       POSTS                  ICB456*/         
*DCL TCBINDRC_CON BIT(8) Constant('0E'X); /* INDICATIVE DUMP (LOAD 8            
*                                       OF ABEND) HAS ABENDED.  ABEND           
*                                       WILL HANDLE THIS ABEND.                 
*                                       (OS/VS1)                     */         
*DCL TCBSAVCD_CON BIT(8) Constant('0F'X); /* ASIR RECURSION. SAVE OLD           
*                                       COMPLETION CODE        ICB456*/         
*DCL TCBTYP1W_CON BIT(8) Constant('10'X); /* TYPE 1 MESSAGE WRITE TO            
*                                       PROGRAMMER             ICB456*/         
*DCL TCBWTPSE_CON BIT(8) Constant('20'X); /* WRITE-TO-PROGRAMMER (WTP)          
*                                       FAILED.  JOB STEP TIMER                 
*                                       EXPIRED DURING JOB STEP ABEND           
*                                       AND THE STAE EXIT IS DENIED.            
*                                       (OS/VS1)             @X04DA9A*/         
*DCL TCBVTAM1_CON BIT(8) Constant('21'X); /* ABEND IS ENTERING FIRST            
*                                  VTAM INTERFACE, ISTRAAA1, FOR                
*                                       TERMINATION OF TASK OR                  
*                                       SUBTASK (OS/VS1)                        
*                                                            @X31BH9A*/         
*DCL TCBVTAM2_CON BIT(8) Constant('22'X); /* ABEND IS ENTERING SECOND           
*                                  VTAM INTERFACE, ISTRAAA2, BECAUSE            
*                                       ISTRAAA1 ABENDED  (OS/VS1)              
*                                                            @X31BH9A*/         
*DCL TCBVTAM3_CON BIT(8) Constant('23'X); /* ABEND IS ENTERING FIRST            
*                                  VTAM INTERFACE, ISTRAAA0, BECAUSE            
*                                       VTAM ABENDED  (OS/VS1)                  
*                                                            @X04BH9A*/         
*DCL TCBVTAM4_CON BIT(8) Constant('24'X); /* ABEND IS ENTERING SECOND           
*                                  VTAM INTERFACE, ISTRAAA2, BECAUSE            
*                                       ISTRAAA0 ABENDED  (OS/VS1)              
*                                                            @X04BH9A*/         
*DCL TCBNOSTA_CON BIT(8) Constant('30'X); /* STAE/STAI NOT TO BE                
*                                       HONORED                ICB456*/         
*DCL TCBSTRET_CON BIT(8) Constant('31'X); /* RETURN FROM DUMP                   
*                                     PROCESSING               ICB456*/         
*DCL TCBCONVR_CON BIT(8) Constant('32'X); /* CONVERT TO STEP ABEND              
*                                                              ICB456*/         
*DCL TCBDARET_CON BIT(8) Constant('33'X); /* RETURN FROM DAMAGE                 
*                                       ASSESSMENT ROUTINES    ICB456*/         
*DCL TCBTYP1R_CON BIT(8) Constant('34'X); /* RETURN FROM TYPE 1                 
*                                       MESSAGE MODULE         ICB456*/         
*DCL TCBNEWRB_CON BIT(8) Constant('35'X); /* ABEND ISSUED SVC 13 TO             
*                                       TRANSFER CONTROL (XCTL) TO A            
*                                       NON-ABEND MODULE       ICB456*/         
*DCL TCBMCCNS_CON BIT(8) Constant('40'X); /* A MUST COMPLETE TASK HAS           
*                                       ABNORMALLY TERMINATED WITHOUT           
*                                       ENOUGH STORAGE FOR 2 RB'S FOR           
*                                       A WTOR ASKING WHETHER THE               
*                                       TASK'S RESOURCES ARE CRITICAL.          
*                                       THE RESOURCES ARE ASSUMED TO            
*                                       BE CRITICAL, AND THE                    
*                                       PARTITION IS MARKED                     
*                                       PERMANENTLY NONDISPATCHABLE.            
*                                       (OS/VS1)               ICB492*/         
*DCL TCBPAGID_CON BIT(8) Constant('FF'X); /* ID FOR PAGING SUPERVISOR           
*                                       TASK                   ICB403*/         
*DCL TCBSYERR_CON BIT(8) Constant('FE'X); /* ID FOR SYSTEM ERROR                
*                                       TASK                   ICB403*/         
*DCL TCBCOMM_CON BIT(8) Constant('FD'X); /* ID FOR COMMUNICATIONS               
*                                       TASK                   ICB403*/         
*DCL TCBIORMS_CON BIT(8) Constant('FC'X); /* ID FOR I/O RMS                     
*                                       TASK                   ICB403*/         
*DCL TCBMASTR_CON BIT(8) Constant('FB'X); /* ID FOR MASTER SCHEDULER            
*                                       TASK                   ICB403*/         
*DCL TCBJES_CON BIT(8) Constant('FA'X); /* ID FOR JOB ENTRY SUBSYSTEM           
*                                       (JES) MONITOR TASK     ICB403*/         
*DCL TCBDSSID_CON BIT(8) Constant('F9'X); /* ID FOR DYNAMIC SUPPORT             
*                                SYSTEM (DSS) TASK             ICB403*/         
*DCL TCBLOGID_CON BIT(8) Constant('F8'X); /* ID FOR SYSTEM LOG TASK */          
*%IKJTCB_2:;                             /*                      @L3A*/         
* /*                   END OF TCB                                    */         
*%IF IKEPLS=''  %THEN                                                           
*    %GOTO TCBL4;                                                               
*IHALPOP;                                                                       
*%TCBL4 : ;                                                                     
