*        %GOTO TSVTPRO   ; /*                                           00010000
         MACRO                                                          00020000
         IKJTSVT                                                        00030000
.*/ %TSVTPRO: ;                                                         00040000
*/***Start of Specifications******************************************/ 00050000
*/*                                                                  */ 00060000
*/*01* MACRO-NAME: IKJTSVT                                           */ 00070000
*/*                                                                  */ 00080000
*/*01* DESCRIPTIVE-NAME:  TSO/E Vector Table                         */ 00090000
*/*                                                                  */ 00100000
*/**01* PROPRIETARY STATEMENT=                                       */ 00110000
*/***PROPRIETARY_STATEMENT********************************************/ 00120000
*/*                                                                  */ 00130000
*/*                                                                  */ 00140000
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00150000
*/* 5650-ZOS COPYRIGHT IBM CORP. 1986, 2017                          */ 00160000
*/*                                                                  */ 00170000
*/* STATUS= HTE77B0                                                  */ 00180000
*/*                                                                  */ 00190000
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 00200000
*/*                                                                  */ 00210000
*/*01* EXTERNAL CLASSIFICATION:                                      */ 00220000
*/*02* NOTPI: BASE                                                   */ 00230000
*/*02* PI: FIELDS                                                    */ 00240000
*/*        TSVTVACC                                                  */ 00250000
*/*01* END OF EXTERNAL CLASSIFICATION:                               */ 00260000
*/*                                                                  */ 00270000
*/*01* FUNCTION:                                                     */ 00280000
*/*                                                                  */ 00290000
*/*      Contains addresses of branch entered routines and           */ 00300000
*/*      control blocks.                                             */ 00310000
*/*                                                                  */ 00320000
*/*01* DSECT-NAME: TSVT                                              */ 00330000
*/*                                                                  */ 00340000
*/*02*  ACRONYM: TSVT                                                */ 00350000
*/*                                                                  */ 00360000
*/*01* EYE-CATCHER: TSVT                                             */ 00370000
*/*                                                                  */ 00380000
*/*02*  OFFSET: 0                                                    */ 00390000
*/*                                                                  */ 00400000
*/*02*  LENGTH: 4                                                    */ 00410000
*/*                                                                  */ 00420000
*/*01* MACRO-TYPE: Mapping macro                                     */ 00430000
*/*                                                                  */ 00440000
*/*01* NOTES:                                                        */ 00450000
*/*                                                                  */ 00460000
*/*01* PROCESSOR: PL/AS and Assembler                                */ 00470000
*/*                                                                  */ 00480000
*/*01* COMPONENT: TSO/E Scheduler (28502)                            */ 00490000
*/*                                                                  */ 00500000
*/*01* STORAGE-ATTRIBUTES:                                           */ 00510000
*/*                                                                  */ 00520000
*/*02*  SUBPOOL: 241                                                 */ 00530000
*/*                                                                  */ 00540000
*/*02*  KEY: 0                                                       */ 00550000
*/*                                                                  */ 00560000
*/*02*  RESIDENCY: Below 16M line                                    */ 00570000
*/*                                                                  */ 00580000
*/*01* SIZE: 296 bytes                                               */ 00590000
*/*                                                                  */ 00600000
*/*01* CREATED-BY: IKJEFXSR                                          */ 00610000
*/*                                                                  */ 00620000
*/*01* POINTED-TO-BY: CVTTVT field of the CVT data area              */ 00630000
*/*                                                                  */ 00640000
*/*01* SERIALIZATION: None                                           */ 00650000
*/*                                                                  */ 00660000
*/*01* METHOD-OF-ACCESS: %INCLUDE SYSLIB(IKJTSVT)                    */ 00670000
*/*                                                                  */ 00680000
*/*01* CHANGE-ACTIVITY =                                             */ 00690000
*/*                                                                  */ 00700000
*/*                                                                  */ 00710000
*/*  THE TSO VECTOR TABLE IS BUILT BY IKJEFXSR AND STORED IN A       */ 00720000
*/*  NON-SHARED SUBPOOL(241). THE TABLE CONTAINS THE ADDRESSES OF    */ 00730000
*/*  BRANCH ENTERED ROUTINES AND CONTROL TABLES. THE TSVT CAN BE     */ 00740000
*/*  LOCATED FROM THE CVT IN THE FIELD LABELED CVTTVT.       @PBY0257*/ 00750000
*/*                                                                  */ 00760000
*/* CHANGE ACTIVITY =                                                */ 00770000
*/*                                                                  */ 00780000
*/* @ZTS0005  CORRECT MEND.                                  @ZTS0005*/ 00790000
*/* @ZTS0239  DELETION OF POINTERS TO IKJEFTE8 AND IKJEFTE2  @PBY0257*/ 00800000
*/* @E2267F2  SUPPORT FOR TSO/E REL 2.1                      @E2267F2*/ 00810000
*/* @PBR0129  CHANGE COMMENT TO READ IKJCT440 NOT IKJT440    @PBR0129*/ 00820000
*/* @PBR0135  RETRANSMIT - NO CODE CHANGE                    @PBR0135*/ 00830000
*/* OZ87430   ADD NO IMPLICIT FUNCTION FOR DISPLAY CLIST             */ 00840000
*/*           VARIABLES.                                     @ZA87430*/ 00850000
*/* @E2367H1  ADDRESS FOR THE CLIST ATTENTION FACILITY WAS ADDED     */ 00860000
*/*           FOR TSO/E REL 3.                               @E2367H1*/ 00870000
*/* @PBY0257  ADDITION OF &SYSTSOE TO TSO/E REL 3            @PBY0257*/ 00880000
*/* @E1402S3  NEW RETURN CODES FOR IKJCT441 WERE ADDED               */ 00890000
*/*           FOR TSO/E REL 4.                               @E1402S3*/ 00900000
*/* @E1402C1 ADDITION OF &SYSTSOE TO TSO/E REL 4 DBCS SUPPORT@E1402C1*/ 00910000
*/* @E1402V7  ADDRESSES OF THE BROADCAST DATA SET INTERFACE ROUTINE  */ 00920000
*/*           AND LOGON RACF SUPPORT ROUTINE WERE ADDED FOR TSO/E    */ 00930000
*/*           RELEASE 4.                                     @E1402V7*/ 00940000
*/* @E1402S6  ADDRESS OF THE ROUTER ROUTINE IF IT IS IN LPA.         */ 00950000
*/*           ADDED FOR TSO/E RELEASE 4.                     @E1402S6*/ 00960000
*/* @E21D2G9  TSO/E RELEASE 5 REXX SUPPORT                   @E21D2G9*/ 00970000
*/* @E1502I7  Table Look Up Service and ALTLIB entry points  @E1502I7*/ 00980000
*/* @E1402B1  Common Recovery Code                           @E1402B1*/ 00990000
*/* @PEI0434  Table Lookup Service Routine entry point for           */ 01000000
*/*           IKJTBLSR                                       @PEI0434*/ 01010000
*/* @PEI0617  Add IRXESTK1 to TXVT                           @PEI0617*/ 01020000
*/* @PEI0692  Corrected the status information in the prolog @PEI0692*/ 01030000
*/* @PEI0432  Add IRXTVARS to TSVT                           @PEI0432*/ 01040000
*/* @PEI0709  Add IRXINIT, IRXIOLAR, and IRXSTO00 to TSVT    @PEI0709*/ 01050000
*/* @PEI0791  Add IKJCT44X to TSVT                           @PEI0791*/ 01060000
*/* @PEI0944  Add IKJEFTS2 to TSVT                           @PEI0944*/ 01070000
*/* @OY19182  Add REXX entry addresses to the TSVT in order  @YA19182*/ 01080000
*/*           to provide FORTRAN entry points                @YA19182*/ 01090000
*/* @OY26799  Added pointer to Exits & Tables vector IKJEXTAB@YA26799*/ 01100000
*/* @E22D2D3  TSO/E 2.2.0 NLS Support                        @E22D2D3*/ 01110000
*/* @E22D2E9  TSO/E 2.2.0 support for commands that can      @E22D2E9*/ 01120000
*/*           execute on a TSO/E command platform task.      @E22D2E9*/ 01130000
*/* @DG10015  TSO/E 2.2.0 Performance Enhancement            @DG10015*/ 01140000
*/*            - Fields added for SYS1.BRODCAST I/O avoidance@DG10015*/ 01150000
*/*  OY34930  Add parmlib lock and related IKJBCMSG fields   @YA34930*/ 01160000
*/* @E23D2DB  TSO/E 2.3.0 TSO Environment Service support    @E23D2DB*/ 01170000
*/*           Add the PC number for IKJPCENV to TSVT         @E23D2DB*/ 01180000
*/* @E23D2D5  TSO/E 2.3.0 Performance Enhancement            @E23D2D5*/ 01190000
*/*            - TSO/E Exit Avoidance                        @E23D2D5*/ 01200000
*/*           Add TSVTNETL indicator indicating              @E23D2D5*/ 01210000
*/*           whether any of the TSO/E exits were            @E23D2D5*/ 01220000
*/*           found in LPA/ELPA                              @E23D2D5*/ 01230000
*/*                                                                  */ 01240000
*/* @E23D2F1  TSO/E 2.3.0 Performance Enhancement            @E23D2F1*/ 01250000
*/*            - TSO/E VLF Virtual Storage relief            @E23D2F1*/ 01260000
*/*           Add fields to support the new System           @E23D2F1*/ 01270000
*/*           SNTAB and SVTAB.  Also add some extra          @E23D2F1*/ 01280000
*/*           space for future use                           @E23D2F1*/ 01290000
*/* @PID0187  Blank out column 72 to avoid assembler error   @PID0187*/ 01300000
*/* OY46260   APPC Unauthorized Async Support                @YA46260*/ 01310000
*/*                                                                  */ 01320000
*/* @E24D2H3  TSO/E 2.4.0 support for the Unauthorized       @E24D2H3*/ 01330000
*/*           Resource Processor Service. Added new field    @E24D2H3*/ 01340000
*/*           TSVTURPS to store address of module IKJURPS    @E24D2H3*/ 01350000
*/*                                                                  */ 01360000
*/* @PMH0003  Updated the Prolog to conform to the SHOWHDR   @PMH0003*/ 01370000
*/*           tool standards as required by Information      @PMH0003*/ 01380000
*/*           Development.                                   @PMH0003*/ 01390000
*/*                                                                  */ 01400000
*/* @E24D2D0  TSO/E 2.4.0 MVS Version 3 toleration support.  @E24D2D0*/ 01410000
*/*           Change field TSVTATPL to TSVTAPPC.             @E24D2D0*/ 01420000
*/*                                                                  */ 01430000
*/* @PMH0160  Updated prolog to include CDPI information.    @PMH0160*/ 01440000
*/*                                                                  */ 01450000
*/* @OW03618  Correct the 3 equates to EQU X'..'             @WA03618*/ 01460000
*/*           TSVTNCTU      EQU     X'80'                    @WA03618*/ 01470000
*/*           TSVTNETL      EQU     X'40'                    @WA03618*/ 01480000
*/*           TSVTUPDP      EQU     X'20'                    @WA03618*/ 01490000
*/*                                                                  */ 01500000
*/* @E25D2JC  TSO/E 2.5.0 support for TSOLIB.  Added new     @E25D2JC*/ 01510000
*/*           field TSVTCPCR to store the address of         @E25D2JC*/ 01520000
*/*           module IKJCMDPC.                               @E25D2JC*/ 01530000
*/*                                                                  */ 01540000
*/* @KO10185  Changes to support a system-wide rather than   @KO10185*/ 01550000
*/*           a non-system-wide PC for IKJCMDPC:             @KO10185*/ 01560000
*/*                                                          @KO10185*/ 01570000
*/*           1.  Remove TSVTCPCR.  IKJCMDPC and IKJCMDRC    @KO10185*/ 01580000
*/*               are REQUIRED to reside in LPA so that      @KO10185*/ 01590000
*/*               ETDEF can resolve addressability           @KO10185*/ 01600000
*/*               to them at RIM time in IKJEFXSR.           @KO10185*/ 01610000
*/*           2.  Add TSVTPCN2 to contain the PC number      @KO10185*/ 01620000
*/*               for IKJCMDPC.                              @KO10185*/ 01630000
*/*                                                          @KO10185*/ 01640000
*/* $L1=    OW21341  260     951219 BHBR  : TSO GR Support       @L1A*/ 01650000
*/* $L2=    DYNLPA   260     970229 BHBR  : Dynamic LPA support and  */ 01660000
*/*                                         TSVT Extended        @L2A*/ 01670000
*/* $N1= COPYRITE HTE26D2 19970218 VOHS: Insert/Update Copyrite  @N1A*/ 01680000
*/* $L3=    BCAST   HTE7706  010223 PDD3  : Dynamic broadcast support*/ 01690000
*/*                                                              @L3A*/ 01700000
*/*  OA17180  Incremented TSVTLEV from 7 to 8 to indicate new format */ 01710000
*/*           for SNTAB and SVTAB pointed to by the TSVT.  The new   */ 01720000
*/*           level indicates APAR OA17180 has been installed.  Also */ 01730000
*/*           added new constant TSVTCLEV to show the current level. */ 01740000
*/*           Nothing about the TSVT mapping itself changed. @AA17180*/ 01750000
*/*                                                                  */ 01760000
*/* $L4=    TSOEPASS HTE7750 070523 MPK: TSO/E Passphrase support@L4A*/ 01770000
*/*                                                                  */ 01780000
*/* $L5=    MG10652  HTE7760 080524 MPK: LOGONHERE option support@L5A*/ 01790000
*/* $01=    OA44855  HTE77B0 150401 PDER1: Pre-prompt Support    @01A*/ 01800000
*/* $L6=    UID8     HTE77B0 150331 EXR: 8 Charcter Userid       @L6A*/ 01810000
*/* $02=    OA57937  HTE77C0 190701 PDER1: Timeout Support       @02A*/ 01820002
*/*                                                                  */ 01830000
*/***End of Specifications********************************************/ 01840000
*        %GOTO TSVTPLS   ; /*                                           01850000
TSVT     DSECT                                                          01860000
           DS    0D        BEGIN TSVT ON DOUBLE WORD BDY      @E2267F2  01870000
TSVTTSVT   DS    CL4       ACRONYM IN EBCDIC 'TSVT'                     01880000
TSVTLEV    DS    CL1       TSVT VERSION                                 01890000
TSVTFLG1   DS    CL1       FLAG INDICATORS                    @DG10015  01900000
TSVTUMXL   DS    CL1       USERID MAX LENGTH  <7 MEANS 7          @L6A  01910000
TSVTTO     DS    CL1       LOGON time out value                   @02C  01920000
TSVTNCT    DS    A         ADDRESS OF THE MOST CURRENT NOTICE           01930000
*                          TABLE                                        01940000
TSVTVACC   DS    A         ADDRESS OF THE CLIST VARIABLE ACCESS ROUTINE 01950000
TSVTASF    DS    A         ADDRESS OF THE AUTHORIZED SERVICE            01960000
*                          FACILITY ROUTINE                             01970000
*********************************************************************** 01980000
***                   TSO/E R2.1 SUPPORT                             ** 01990000
***                                                                  ** 02000000
*********************************************************************** 02010000
TSVTLTBL   DS    A         ADDRESS OF LOGON ADDRESS TABLE      @E2267F2 02020000
TSVTFLA1   DS    A         ADDRESS OF LOGON INITIALIZATION     @E2267F2 02030000
*                          MODULE                              @E2267F2 02040000
TSVTCTIO   DS    A         ADDRESS OF CLIST I/O LAR            @E2267F2 02050000
TSVTCTAB   DS    A         ADDRESS OF LOAD MODULE CONTAINING   @E2267F2 02060000
*                          MESSAGES IN TRANSLATE TABLES        @E2267F2 02070000
TSVTT440   DS    A         ADDRESS OF CLIST VARIABLE ACCESS    @E2267F2 02080000
*                          METHOD - IKJCT440                   @PBR0129 02090000
TSVTT441   DS    A         ADDRESS OF GENERAL VARIABLE ACCESS  @E2267F2 02100000
*                          METHOD - IKJT441R                   @E2267F2 02110000
TSVTPUTL   DS    A         ADDRESS OF PUTLINE ROUTINE          @E2267F2 02120000
TSVTPTGT   DS    A         ADDRESS OF PUTGET ROUTINE           @E2267F2 02130000
TSVTGETL   DS    A         ADDRESS OF GETLINE ROUTINE          @E2267F2 02140000
TSVTSTCK   DS    A         ADDRESS OF STACK ROUTINE            @E2267F2 02150000
*                                                                       02160000
TSVTTSL    DS    A         ADDRESS OF TMP LAR                  @E2267F2 02170000
TSVTSCAN   DS    A         ADDRESS OF SCAN ROUTINE             @E2267F2 02180000
TSVTPARS   DS    A         ADDRESS OF PARSE ROUTINE            @E2267F2 02190000
TSVTEF02   DS    A         ADDRESS OF MESSAGE WRITER ROUTINE   @E2267F2 02200000
TSVTTPVT   DS    A         Address of TPVT                     @E1402S6 02210000
TSVTRCVY   DS    A        Address of Recovery Routine IKJCMDRC @E1402B1 02220000
TSVTTRAN   DS    A         IKJTRANS                            @E22D2D3 02230000
TSVTBCMT   DS    CL8       Member Token for Broadcast Notice XCF Group  02240000
*                                                              @DG10015 02250000
*********************************************************************** 02260000
***                   TSO/E R3   SUPPORT                             ** 02270000
***                                                                  ** 02280000
*********************************************************************** 02290000
TSVTCAF    DS    A         CLIST ATTENTION FACILITY ADDR REL 3 @PBY0257 02300000
TSVTTSOL   DS    0CL4      TSO/E LEVEL INDICATOR               @PBY0257 02310000
TSVTLVER   DS    CL1        - VERSION LEVEL                    @PBY0257 02320000
TSVTLREL   DS    CL2        - RELEASE NUMBER                   @PBY0257 02330000
TSVTLMOD   DS    CL1        - MODIFICATION LEVEL               @PBY0257 02340000
*********************************************************************** 02350000
***                   TSO/E R4   SUPPORT                             ** 02360000
***                                                                  ** 02370000
*********************************************************************** 02380000
TSVTCTDB   DS    A         ADDRESS OF DOUBLE BYTE CHAR ROUTINE @E1402C1 02390000
TSVTRIF    DS    A         BROADCAST DATA SET INTERFACE        @E1402V7 02400000
*                          ROUTINE ADDRESS FOR RELEASE 4       @E1402V7 02410000
TSVTRAF    DS    A         LOGON RACF SUPPORT ROUTINE ADDRESS  @E1402V7 02420000
*                          FOR RELEASE 4                       @E1402V7 02430000
TSVTRTRP   DS    A         TSO ROUTER ADDRESS                  @E1402S6 02440000
TSVTTBLS   DS    A         ADDRESS OF TABLE LOOK UP SERVICE    @E1502I7 02450000
TSVTADTB   DS    A         ADDRESS OF ALTLIB                   @E1502I7 02460000
TSVTTBLR   DS    A         ADDRESS OF TABLE LOOKUP SERVICE RTN @PEI0434 02470000
*********************************************************************** 02480000
TSVTESTK   DS    A         Address of IRXESTK1                 @PEI0617 02490000
*********************************************************************** 02500000
TSVTTVAR   DS    A         Address of IRXTVARS                 @PEI0432 02510000
TSVTINIT   DS    A         Address of IRXINIT                  @PEI0709 02520000
TSVTOLAR   DS    A         Address of IRXIOLAR                 @PEI0709 02530000
TSVTTO00   DS    A         Address of IRXSTO00                 @PEI0709 02540000
TSVTT44X   DS    A         Address of IKJCT44X                 @PEI0791 02550000
TSVTFTS2   DS    A         Address of IKJEFTS2                 @PEI0944 02560000
TSVTEXE    DS    A         Address of IRXEXEC                  @YA19182 02570000
TSVTINOU   DS    A         Address of IRXINOUT                 @YA19182 02580000
TSVTLOA    DS    A         Address of IRXLOAD                  @YA19182 02590000
TSVTTER    DS    A         Address of IRXTERM                  @YA19182 02600000
TSVTSUBC   DS    A         Address of IRXSUBCM                 @YA19182 02610000
TSVTMSGI   DS    A         Address of IRXMSGID                 @YA19182 02620000
TSVTEXCO   DS    A         Address of IRXEXCOM                 @YA19182 02630000
TSVTTERM   DS    A         Address of IRXTERMA                 @YA19182 02640000
TSVTETVP   DS    A        Address of Exit & Vector Table       @YA26799 02650000
TSVTTSFI   DS    A         Address of IKJEFTSI                 @E22D2E9 02660000
TSVTTSFT   DS    A         Address of IKJEFTST                 @E22D2E9 02670000
TSVTPCN1   DS    F         PC number for IKJPCENV              @E23D2DB 02680000
TSVTSNTA   DS    A         System copy of the SNTAB            @E23D2F1 02690000
TSVTSVTA   DS    A         System copy of the SVTAB            @E23D2F1 02700000
TSVTSYML   DS    F         Length of system SNTAB and SVTAB    @E23D2F1 02710000
TSVTXCFU   DS    F         Lock for parmlib updating           @YA34930 02720000
TSVTMSTR   DS    A         Address of Master ASCB              @YA34930 02730000
TSVTBECB   DS    F         ECB for IKJBCMSG                    @YA34930 02740000
TSVTAPPC   DS    A         Addr of APPC callable service table @E24D2D0 02750000
TSVTURPS   DS    A         Address of IKJURPS module           @E24D2H3 02760000
TSVTPCN2   DS    F         PC number for IKJCMDPC              @KO10185 02770000
TSVTMSR0   DS    A         Address of IKJMSR0 module               @L1A 02780000
TSVTMDT@   DS    A         Address of module table                 @L2A 02790000
TSVTSECB   DS    F         ECB for broadcast switches              @L3A 02800000
TSVTSWAS   DS    A         Address of ASCB for address space       @L3A 02810000
*                          requesting the broadcast switch         @L3A 02820000
TSVTSWWA   DS    A         Address of switch processing work area  @L3A 02830000
TSVTSWCB   DS    A         Address of switch control block         @L3A 02840000
**********************************************************************/ 02850000
***                  TSO/E  Free Space                             @L2A 02860000
*********************************************************************** 02870000
           DS    7F        Reserved                                @L3C 02880000
TSVTEND    DS    0D        ASSURE TSVT ENDS ON DOUBLE WORD     @E2267F2 02890000
*                          BOUNDRY                             @E2267F2 02900000
TSVTCLEV   EQU   8         CURRENT LEVEL OF THE TSVT           @AA17180 02910000
*********************************************************************** 02920000
***                                                                  ** 02930000
*** THE FOLLOWING DECLARATIONS DEFINE THE ENTRY AND RETURN CODES     ** 02940000
*** USED BY THE CLIST VARIABLE ACCESS ROUTINE (POINTED TO BY         ** 02950000
*** TSVSVACC).                                                       ** 02960000
***                                                                  ** 02970000
*********************************************************************** 02980000
*       ENTRY CODES                                                     02990000
TSVERETR EQU   1                  RETURN VARIABLE VALUE                 03000000
TSVEUPDT EQU   2                  UPDATE VARIABLE                       03010000
TSVELOC  EQU   3                  LOCATE / LOCATE NEXT                  03020000
TSVERSVD EQU   4                  RESERVED                              03030000
TSVNOIMP EQU   18                 NO IMPLICIT                  @ZA87430 03040000
*       RETURN CODES                                                    03050000
TSVROK   EQU   0                  EVERY THING OK                        03060000
TSVRNORS EQU   4                  VARIABLE RETURNED SHOULDN'T           03070000
*                                         BE RE-SCANNED                 03080000
TSVREVAL EQU   8                  VARIABLE RETURNED REQUIRES            03090000
*                                         EVALUATION                    03100000
TSVRLAB  EQU   12                 VARIABLE RETURNED IS A                03110000
*                                         LABEL                         03120000
TSVRNAUP EQU   16                 SYSTEM VARIABLE - CAN'T BE            03130000
*                                        UPDATED BY THE USER            03140000
TSVRNOM  EQU   20                 FOR LOCATE - NO VARIABLE              03150000
*                                         RETURNED - THERE ARE NO       03160000
*                                         MORE VARIABLES                03170000
TSVRPROC EQU   24                 VARIABLE RETURNED IS A PROCEDURE      03180000
*                                         NAME                 @E1402S3 03190000
TSVRSVD2 EQU   30                 RESERVED                     @E21D2G9 03200000
TSVRGETF EQU   32                 GETMAIN/FREEMAIN FAILURE              03210000
TSVRNSIZ EQU   36                 SYMBOL NAME TOO LARGE                 03220000
*                                         OR SMALL                      03230000
TSVRENV  EQU   40                 INCORRECT ENVIRONMENT                 03240000
TSVRPARM EQU   44                 INVALID ENTRY CODE                    03250000
TSVRDUP  EQU   48                 DUPLICATE SYMBOL FOUND                03260000
TSVRUNDF EQU   52                 UNDEFINED VARIABLE                    03270000
TSVRGLER EQU   56                 TOO MANY GLOBAL VARIABLES             03280000
TSVRUNDG EQU   60                 UNDEFINED GLOBAL VARIABLE             03290000
TSVRINVR EQU   64                 VARIABLE NOT VALID AS A CALL BY       03300000
*                                           REFERENCE VARIABLE          03310000
TSVRUNDR EQU   68                 UNDEFINED CALL BY REFERENCE VARIABLE  03320000
TSVIREXX EQU   80                 VARIABLE NAME IS NOT VALID FOR REXX   03330000
*                                                              @E21D2G9 03340000
TSVREXXE EQU   81                 AN UNEXPECTED RETURN CODE WAS         03350000
*                                 RECEIVED FROM A REXX ROUTINE @E21D2G9 03360000
*                                                                       03370000
*       FLAG INDICATORS FOR TSVTFLG1                           @DG10015 03380000
*                                                                       03390000
TSVTNCTU EQU   X'80'              Instorage copy of system notices      03400000
*                                 needs to be updated          @WA03618 03410000
TSVTNETL EQU   X'40'              None of the TSO/E Exits               03420000
*                                 were found in LPA/ELPA       @WA03618 03430000
TSVTUPDP EQU   X'20'              IKJBCMSG posted for parmlib update    03440000
*                                 signalling                   @WA03618 03450000
TSVTSWCH EQU   X'10'              IKJBCMSG posted to switch the         03460000
*                                 broadcast data set               @L3A 03470000
TSVTPHRS EQU   X'08'              Password phrase support active   @L4A 03480000
*                                                                  @L4A 03490000
TSVTAPPL EQU   X'04'              Logon APPLID verification active @L4A 03500000
*                                                                  @L4A 03510000
TSVTLGNH EQU   X'02'              LOGONHERE support is active      @L5A 03520000
*                                                                  @L5A 03530000
TSVTLGPC EQU   X'01'              PASSWORDPREPROMPT is active      @01A 03540000
*                                                                  @01A 03550000
         MEND , */                                                      03560000
* %TSVTPLS  :  ;                                                        03570000
* /* MAPPING OF TSO VECTOR TABLE                                     */ 03580000
* DECLARE                                                               03590000
*   1 TSVT BASED(TSVTPTR) BDY(DWORD),         /*           @E2267F2 */  03600000
*                                                                       03610000
*    2 TSVTTSVT CHAR(4),          /* ACRONYM IN EBCDIC "TSVT"        */ 03620000
*    2 TSVTLEV CHAR(1),           /* TSVT VERSION                    */ 03630000
*    2 TSVTFLG1 CHAR(1),          /* Flag Indicators                    03640000
*                                    Note: Several modules map these    03650000
*                                    bits locally and depend on their   03660000
*                                    current order and location  @L4A*/ 03670000
*      3 TSVTNCTU BIT(1),         /* Instorage copy of system notices   03680000
*                                    needs to be updated     @DG10015*/ 03690000
*      3 TSVTNETL BIT(1),         /* None of the TSO/E Exits            03700000
*                                    were found in LPA/ELPA  @E23D2D5*/ 03710000
*      3 TSVTUPDP BIT(1),         /* IKJBCMSG posted for parmlib update 03720000
*                                    signalling              @YA34930*/ 03730000
*      3 TSVTSWCH BIT(1),         /* IKJBCMSG posted to switch the      03740000
*                                    broadcast data set          @L3A*/ 03750000
*      3 TSVTPHRS BIT(1) ABNL,    /* Password phrase support active     03760000
*                                                                @L4A*/ 03770000
*      3 TSVTAPPL BIT(1) ABNL,    /* Logon APPLID verification active   03780000
*                                                                @L4A*/ 03790000
*      3 TSVTLGNH BIT(1) ABNL,    /* LOGONHERE support is active @L5A*/ 03800000
*      3 TSVTLGPC BIT(1) ABNL,    /* PASSWORDPREPROMPT support is       03810000
*                                    active                      @01C*/ 03820000
*    2 TSVTUMXL FIXED(8),         /* Userid max length           @L6A*/ 03830000
*    2 TSVTTO   FIXED(8),         /* LOGON time out value        @02C*/ 03840000
*    2 TSVTNCT  PTR(31),          /* ADDRESS OF THE MOST CURRENT        03850000
*                                    NOTICE TABLE                    */ 03860000
*    2 TSVTVACC PTR(31),          /* ADDRESS OF THE CLIST VARIABLE      03870000
*                                    ACCESS ROUTINE                  */ 03880000
*    2 TSVTASF PTR(31),           /* ADDRESS OF THE AUTHORIZED          03890000
*                                    SERVICE FACILITY ROUTINE        */ 03900000
*/********************************************************************/ 03910000
*/*                  TSO/E R2.1 SUPPORT                             **/ 03920000
*/*                                                                 **/ 03930000
*/********************************************************************/ 03940000
*   2  TSVTLTBL PTR(31), /* ADDRESS OF LOGON ADDRESS TABLE              03950000
*                                                           @E2267F2 */ 03960000
*   2  TSVTFLA1 PTR(31), /* ADDRESS OF LOGON INITIALIZATION             03970000
*                           MODULE                          @E2267F2 */ 03980000
*   2  TSVTCTIO PTR(31), /* ADDRESS OF CLIST I/O LAR        @E2267F2 */ 03990000
*   2  TSVTCTAB PTR(31), /* ADDRESS OF LOAD MODULE CONTAINING           04000000
*                           MESSAGES IN TRANSLATE TABLES    @E2267F2 */ 04010000
*   2  TSVTT440 PTR(31), /* ADDRESS OF CLIST VARIABLE ACCESS            04020000
*                           METHOD - IKJCT440               @PBR0129 */ 04030000
*   2  TSVTT441 PTR(31), /* ADDRESS OF GENERAL VARIABLE ACCESS          04040000
*                           METHOD - IKJT441R               @E2267F2 */ 04050000
*   2  TSVTPUTL PTR(31), /* ADDRESS OF PUTLINE ROUTINE      @E2267F2 */ 04060000
*   2  TSVTPTGT PTR(31), /* ADDRESS OF PUTGET ROUTINE       @E2267F2 */ 04070000
*   2  TSVTGETL PTR(31), /* ADDRESS OF GETLINE ROUTINE      @E2267F2 */ 04080000
*   2  TSVTSTCK PTR(31), /* ADDRESS OF STACK ROUTINE        @E2267F2 */ 04090000
*   2  TSVTTSL PTR(31),  /* ADDRESS OF TMP LAR              @E2267F2 */ 04100000
*   2  TSVTSCAN PTR(31), /* ADDRESS OF SCAN ROUTINE         @E2267F2 */ 04110000
*   2  TSVTPARS PTR(31), /* ADDRESS OF PARSE ROUTINE        @E2267F2 */ 04120000
*   2  TSVTEF02 PTR(31), /* ADDRESS OF MESSAGE WRITER ROUTINE           04130000
*                                                           @E2267F2 */ 04140000
*   2  TSVTTPVT PTR(31), /* Address of TPVT                 @E1402S6 */ 04150000
*   2  TSVTRCVY PTR(31), /* Address of Recovery Routine IKJCMDRC        04160000
*                                                            @E1402B1*/ 04170000
*   2  TSVTTRAN PTR(31), /* ADDRESS OF IKJTRANS ROUTINE      @E22D2D3*/ 04180000
*   2  TSVTBCMT CHAR(8), /* Member Token for Broadcast Notice XCF       04190000
*                           Group                            @DG10015*/ 04200000
*/********************************************************************/ 04210000
*/*                  TSO/E R3   SUPPORT                             **/ 04220000
*/*                                                                 **/ 04230000
*/********************************************************************/ 04240000
*   2  TSVTCAF  PTR(31),/*CLIST ATTENTION FACILITY ADDR REL3 @PBY0257*/ 04250000
*   2  TSVTTSOL CHAR(4),          /* TSO/E LEVEL INDICATOR   @PBY0257*/ 04260000
*     4  TSVTLVER CHAR(1),        /*  - VERSION LEVEL        @PBY0257*/ 04270000
*     4  TSVTLREL CHAR(2),        /*  - RELEASE NUMBER       @PBY0257*/ 04280000
*     4  TSVTLMOD CHAR(1),        /*  - MODIFICATION LEVEL   @PBY0257*/ 04290000
*/********************************************************************/ 04300000
*/*                  TSO/E R4   SUPPORT                             **/ 04310000
*/*                                                                 **/ 04320000
*/********************************************************************/ 04330000
*   2  TSVTCTDB PTR(31),/* ADDRESS OF DOUBLE BYTE CHAR ROUTINE@E1402C1*/04340000
*   2  TSVTRIF  PTR(31), /* BROADCAST DATA SET INTERFACE ROUTINE        04350000
*                           ADDRESS FOR RELEASE 4            @E1402V7*/ 04360000
*   2  TSVTRAF  PTR(31), /* LOGON RACF SUPPORT ROUTINE ADDRESS FOR      04370000
*                           RELEASE 4                        @E1402V7*/ 04380000
*   2  TSVTRTRP PTR(31), /* TSO ROUTER ADDRESS               @E1402S6*/ 04390000
*   2  TSVTTBLS PTR(31),          /* Address of table look up service   04400000
*                                    used by IKJTSLAR        @PEI0434*/ 04410000
*   2  TSVTADTB PTR(31),          /* Address of ALTLIB       @E1502I7*/ 04420000
*   2  TSVTTBLR PTR(31),          /* Address of table look up service   04430000
*                                    Routine used by TSOCALL @PEI0434*/ 04440000
*   2  TSVTESTK PTR(31),          /* Address of IRXESTK1     @PEI0617*/ 04450000
*   2  TSVTTVAR PTR(31),          /* Address of IRXTVARS     @PEI0432*/ 04460000
*   2  TSVTINIT PTR(31),          /* Address of IRXINIT      @PEI0709*/ 04470000
*      3  TSVTINI  PTR(31),       /* Address of IRXINIT (for the        04480000
*                                    TSOCALL macro)          @YA19182*/ 04490000
*   2  TSVTOLAR PTR(31),          /* Address of IRXIOLAR     @PEI0709*/ 04500000
*   2  TSVTTO00 PTR(31),          /* Address of IRXSTO00     @PEI0709*/ 04510000
*   2  TSVTT44X PTR(31),          /* Address of IKJCT44X     @PEI0791*/ 04520000
*   2  TSVTFTS2 PTR(31),          /* Address of IKJEFTS2     @PEI0944*/ 04530000
*   2  TSVTEXE  PTR(31),          /* Address of IRXEXEC      @YA19182*/ 04540000
*   2  TSVTINOU PTR(31),          /* Address of IRXINOUT     @YA19182*/ 04550000
*   2  TSVTLOA  PTR(31),          /* Address of IRXLOAD      @YA19182*/ 04560000
*   2  TSVTTER  PTR(31),          /* Address of IRXTERM      @YA19182*/ 04570000
*   2  TSVTSUBC PTR(31),          /* Address of IRXSUBCM     @YA19182*/ 04580000
*   2  TSVTMSGI PTR(31),          /* Address of IRXMSGID     @YA19182*/ 04590000
*   2  TSVTEXCO PTR(31),          /* Address of IRXEXCOM     @YA19182*/ 04600000
*   2  TSVTTERM PTR(31),          /* Address of IRXTERMA     @YA19182*/ 04610000
*   2  TSVTETVP PTR(31), /* Address of Exit & Tables Vector  @YA26799*/ 04620000
*   2  TSVTTSFI PTR(31),          /* Address of IKJEFTSI     @E22D2E9*/ 04630000
*   2  TSVTTSFT PTR(31),          /* Address of IKJEFTST     @E22D2E9*/ 04640000
*   2  TSVTPCN1 FIXED(32),        /* PC number for IKJPCENV  @E23D2DB*/ 04650000
*   2  TSVTSNTA PTR(31),          /* System copy of SNTAB    @E23D2F1*/ 04660000
*   2  TSVTSVTA PTR(31),          /* System copy of the SVTAB@E23D2F1*/ 04670000
*   2  TSVTSYML FIXED(31),        /* Length of system SNTAB and         04680000
*                                    SVTAB                   @E23D2F1*/ 04690000
*   2  TSVTXCFU FIXED(31),        /* Lock for updating parmlib between  04700000
*                                    PARMLIB and the SYS1.BRODCAST XCF  04710000
*                                    notify routine.         @YA34930*/ 04720000
*   2  TSVTMSTR PTR(31),          /* Master AS's ASCB address@YA34930*/ 04730000
*   2  TSVTBECB FIXED(31),        /* ECB that IKJBCMSG waits            04740000
*                                    on                      @YA34930*/ 04750000
*   2  TSVTAPPC PTR(31),          /* Address of APPC TABLE   @E24D2D0*/ 04760000
*   2  TSVTURPS PTR(31),          /* Address of IKJURPS      @E24D2H3*/ 04770000
*   2  TSVTPCN2 FIXED(32),        /* PC number for IKJCMDPC  @KO10185*/ 04780000
*   2  TSVTMSR0 PTR(31),          /* Address of IKJMSR0          @L1A*/ 04790000
*   2  TSVTMDT@ PTR(31),          /* Address of module table     @L2A*/ 04800000
*   2  TSVTSECB FIXED(32),        /* ECB for broadcast switches  @L3A*/ 04810000
*   2  TSVTSWAS PTR(31),          /* Address of ASCB for address        04820000
*                                    space requesting the broadcast     04830000
*                                    switch                      @L3A*/ 04840000
*   2  TSVTSWWA PTR(31),          /* Address of switch processing       04850000
*                                    work area                   @L3A*/ 04860000
*   2  TSVTSWCB PTR(31),          /* Address of switch processing       04870000
*                                    control block               @L3A*/ 04880000
*/********************************************************************/ 04890000
*/*                  TSO/E  Free Space                           @L2A*/ 04900000
*/********************************************************************/ 04910000
*   2  *(7)     FIXED(31),        /* Reserved                    @L3C*/ 04920000
*/********************************************************************/ 04930000
*   2  TSVTEND CHAR(0) BDY(DWORD); /* ASSURE TSVT ENDS ON DOUBLE WORD   04940000
*                                     BOUNDRY               @E2267F2 */ 04950000
* DCL TSVTCLEV FIXED(8) CONSTANT(8); /* Current TSVT level   @AA17180*/ 04960000
*@EJECT;                                                  /* @PBY0257*/ 04970000
*/********************************************************************/ 04980000
*/*                                                                  */ 04990000
*/* THE FOLLOWING DECLARATIONS DEFINE THE ENTRY AND RETURN CODES     */ 05000000
*/* USED BY THE CLIST VARIABLE ACCESS ROUTINE (POINTED TO BY         */ 05010000
*/* TSVSVACC).                                                       */ 05020000
*/*                                                                  */ 05030000
*/********************************************************************/ 05040000
* DECLARE                                                               05050000
*/*     ENTRY CODES                                                  */ 05060000
*   TSVERETR   FIXED(31) CONSTANT(1),   /* RETURN VARIABLE VALUE     */ 05070000
*   TSVEUPDT   FIXED(31) CONSTANT(2),   /* UPDATE VARIABLE           */ 05080000
*   TSVELOC    FIXED(31) CONSTANT(3),   /* LOCATE / LOCATE NEXT      */ 05090000
*   TSVERSVD   FIXED(31) CONSTANT(4),   /* RESERVED                  */ 05100000
*   TSVNOIMP   FIXED(31) CONSTANT(18),  /* NO IMPLICIT       @ZA87430*/ 05110000
*/*     RETURN CODES                                                 */ 05120000
*   TSVROK     FIXED(31) CONSTANT(0),   /* EVERY THING OK            */ 05130000
*   TSVRNORS   FIXED(31) CONSTANT(4),   /* VARIABLE RETURNED SHOULDN'T  05140000
*                                         BE RE-SCANNED              */ 05150000
*   TSVREVAL   FIXED(31) CONSTANT(8),   /* VARIABLE RETURNED REQUIRES   05160000
*                                         EVALUATION                 */ 05170000
*   TSVRLAB    FIXED(31) CONSTANT(12),  /* VARIABLE RETURNED IS A       05180000
*                                         LABEL                      */ 05190000
*   TSVRNAUP   FIXED(31) CONSTANT(16),  /* SYSTEM VARIABLE - CAN'T BE   05200000
*                                        UPDATED BY THE USER        */  05210000
*   TSVRNOM    FIXED(31) CONSTANT(20),  /* FOR LOCATE - NO VARIABLE     05220000
*                                         RETURNED - THERE ARE NO       05230000
*                                         MORE VARIABLES             */ 05240000
*   TSVRPROC   FIXED(31) CONSTANT(24),  /* VARIABLE RETURNED IS A       05250000
*                                          PROCEDURE NAME    @E1402S3*/ 05260000
*   TSVRSVD2   FIXED(31) CONSTANT(30),  /* RESERVED          @E21D2G9*/ 05270000
*   TSVRGETF   FIXED(31) CONSTANT(32),  /* GETMAIN/FREEMAIN FAILURE  */ 05280000
*   TSVRNSIZ   FIXED(31) CONSTANT(36),  /* SYMBOL NAME TOO LARGE        05290000
*                                         OR SMALL                   */ 05300000
*   TSVRENV    FIXED(31) CONSTANT(40),  /* INCORRECT ENVIRONMENT     */ 05310000
*   TSVRPARM   FIXED(31) CONSTANT(44),  /* INVALID ENTRY CODE        */ 05320000
*   TSVRDUP    FIXED(31) CONSTANT(48),  /* DUPLICATE SYMBOL FOUND    */ 05330000
*   TSVRUNDF   FIXED(31) CONSTANT(52),  /* UNDEFINED VARIABLE        */ 05340000
*   TSVRGLER   FIXED(31) CONSTANT(56),  /* TOO MANY GLOBAL VARIABLES */ 05350000
*   TSVRUNDG   FIXED(31) CONSTANT(60),  /* UNDEFINED GLOBAL VARIABLE */ 05360000
*   TSVRINVR   FIXED(31) CONSTANT(64),  /* VARIABLE NOT VALID AS A CALL 05370000
*                                          BY REFERENCE VARIABLE        05380000
*                                                            @E1402S3*/ 05390000
*   TSVRUNDR   FIXED(31) CONSTANT(68),  /* UNDEFINED CALL BY REFERENCE  05400000
*                                          VARIABLE          @E1402S3*/ 05410000
*   TSVIREXX   FIXED(31) CONSTANT(80),  /* VARIABLE NAME IS NOT VALID   05420000
*                                          FOR REXX          @E21D2G9*/ 05430000
*   TSVREXXE   FIXED(31) CONSTANT(81);  /* AN UNEXPECTED RETURN CODE    05440000
*                                          WAS RECEIVED FROM A REXX     05450000
*                                          ROUTINE           @E21D2G9*/ 05460000
