*        %GOTO TAIEBSL  ; /*                                            03000000
*                                                                       03049100
*** START OF SPECIFICATIONS ****************************************    03098200
*                                                                       03147300
*01* MACRO NAME:    IKJTAIE                                             03196400
*                                                                       03245500
*01* DESCRIPTIVE NAME: TSO Terminal Attention Interrupt Element         03294600
*02* ACRONYM: TAIE                                                      03343700
*                                                                       03392800
*01* COPYRIGHT =                                                        03441900
*        5650-ZOS                                                       03491900
*        COPYRIGHT IBM CORP. 1977, 2019                                 03541900
*        LICENSED MATERIALS - PROPERTY OF IBM                           03638300
*                                                                       03687400
*01* STATUS = HBB77C0                                                   03736500
*                                                                       03785600
*                                                                       03834700
*01* EXTERNAL CLASSIFICATION: PI                                        03883800
*01* END OF EXTERNAL CLASSIFICATION:                                    03932900
*                                                                       03982000
*01* DSECT NAME:                                                        04031100
*     TAIE                                                              04080200
*                                                                       04129300
*01* COMPONENT:  Region Control Task (SC1CU)                            04178400
*                                                                       04227500
*01* EYE-CATCHER:  NONE                                                 04276600
*                                                                       04325700
*01* STORAGE ATTRIBUTES:                                                04374800
*02*  SUBPOOL:  User                                                    04423900
*02*  KEY:  User                                                        04473000
*02*  RESIDENCY:  below 16M                                             04522100
*                                                                       04571200
*01* SIZE:  X'D8' bytes                                                 04620300
*                                                                       04669400
*01* CREATED BY:                                                        04718500
*     IEAVAR05                                                          04767600
*                                                                       04816700
*01* POINTED TO BY:                                                     04865800
*     TAXETAIE field of the TAXE data area.                             04914900
*                                                                       04964000
*01* SERIALIZATION:                                                     05013100
*     None                                                              05062200
*                                                                       05111300
*01* FUNCTION:                                                          05160400
*02* This is the interface containing data for the user's               05209500
*    attention exit.                                                    05258600
*                                                                       05307700
*01* METHOD OF ACCESS:                                                  05356800
*02*  ASM:                                                              05405900
*      IKJTAIE                                                          05455000
*                                                                       05504100
*02*  PL/AS:                                                            05553200
*      %INCLUDE SYSLIB(IKJTAIE)                                         05602300
*                                                                       05651400
*01* DISTRIBUTION LIBRARY:  ATSOLIB                                     05700500
*                                                                       05749600
*01* CHANGE ACTIVITY:                                                   05798700
*     $L1=64BITSUP HBB7703 981204 PD00XB: ESAME                         05847800
*     $L2=W213454  HBB77C0 171201 PD00XB: 64-bit regs                   05847900
*                                                                       05896900
* END OF SPECIFICATIONS *********************************************   05946000
         MACRO                                                          06000000
         IKJTAIE                                                        09000000
TAIE     DSECT                                                          12000000
TAIEMSGL DS    CL2 .    MESSAGE LENGTH                                  15000000
TAIETGET DS    CL1 .    RET CODE FROM TGET ISSUED BY ATTN PROL LOG      18000000
*                       TO BE CHECKED BY USER ATTN RTN                  21000000
TAIEATTN DS    CL1 .    TO BE USED BY THE TMP                  @ZA08099 21050000
TAIEIAD  DS    1F .     RIGHT HALF OF INTERRUPT PSW                     27000000
         ORG   TAIEIAD                                             @L1A 27050000
         DS    XL3      BYTES 0-2                                  @L1A 27100000
TAIEIAD3 DS    X        BYTE 3 OF TAIEIAD                          @L1A 27150000
TAIEIA64 EQU   X'01'    WHEN ON, AMODE 64                          @L1A 27200000
TAIERSAV DS    CL64 .   Bits 32-63 of 64-bit GRs 0-15 when an interrupt 30000000
*                       to mainline or attention exit occurs            33000000
TAIEPSWE DS    XL16     Interrupt PSWE                             @L2A 33010000
TAIEG64  DS    XL128    64-bit GRs 0-15 when an interrupt to mainline  *33020000
                        or attention exit occurs                   @L2A 33030000
TAIELNGT EQU   *-TAIE   LENGTH OF TAIE                                  36000000
**/                                                                     39000000
         MEND                                                           42000000
* %TAIEBSL :  ;                                                         45000000
* DECLARE                                                               48000000
*   1 TAIE     BASED(TAIEPTR),                                          51000000
*    2 TAIEMSGL FIXED(15),           /* MESSAGE LENGTH               */ 54000000
*    2 TAIETGET PTR(8),              /* RET CODE FROM TGET ISSUED BY    57000000
*                                       ATTN PROL LOG TO BE CHECKED     60000000
*                                       BY USER ATTN RTN             */ 63000000
*    2 TAIEATTN FIXED(8),            /* TO BE USED BY THE TMP. IF       63050000
*                                       TAIEATTN NOT = 0 THEN ATTN IS   63100000
*                                       IN EFFECT            @ZA08099*/ 63150000
*    2 TAIEIAD  FIXED(31),           /* RIGHT HALF OF INTERRUPT PSW  */ 69000000
*      3 * BIT(31),                  /*                          @L1A*/ 69050000
*      3 TAIEIA64 BIT(1),            /* WHEN ON, AMODE 64        @L1A*/ 69100000
*    2 TAIERSAV CHAR(64),            /* Bits 32-63 of 64-bit GRs 0-15   72000000
*                                       when an interrupt to mainline   75000000
*                                       or attention exit occurs @L2C*/ 78000000
*    2 TAIEPSWE CHAR(16),            /* Interrupt PSWE           @L2A*/ 78010000
*    2 TAIEG64  CHAR(128);           /* 64-bit GRs 0-15                 78050000
*                                       when an interrupt to mainline   78060000
*                                       or attention exit occurs @L2A*/ 78070000
*                                                                       81000000
