*/** Start of Specifications******************************************/ 00003500
*/*                                                                  */ 00007000
*/*01* MACRO-NAME: IKJTMPWA                                          */ 00010500
*/*                                                                  */ 00014000
*/*01* DESCRIPTIVE-NAME: TMP Work Area                               */ 00017500
*/*                                                                  */ 00021000
*/*01* PROPRIETARY STATEMENT=                                        */ 00024500
*/***PROPRIETARY_STATEMENT***************************************@N1C*/ 00028000
*/*                                                                  */ 00031500
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00035001
*/* 5650-ZOS COPYRIGHT IBM CORP. 1976, 2015                          */ 00038501
*/*                                                                  */ 00066500
*/* STATUS = HTE77A0                                                 */ 00070000
*/*                                                                  */ 00073500
*/***END_OF_PROPRIETARY_STATEMENT********************************@N1C*/ 00077000
*/*                                                                  */ 00080500
*/*01* FUNCTION:                                                     */ 00084000
*/*                                                                  */ 00087500
*/*      Contains major internal work areas for the TMP. These       */ 00091000
*/*      include:                                                    */ 00094500
*/*        > TMPWRKA1 - parameter lists and control information      */ 00098000
*/*                     needed for normal operation of the TMP.      */ 00101500
*/*        > TMPWA2   - contains information needed by the           */ 00105000
*/*                     TMPESTAE retry routine.                      */ 00108500
*/*        > TMPWRKA2 - a protected work area that contains infor-   */ 00112000
*/*                     mation needed by the TMP mainline to         */ 00115500
*/*                     indicate what processing the mainline        */ 00119000
*/*                     needs to perform.                            */ 00122500
*/*                                                                  */ 00126000
*/*01* DSECT-NAME: IKJTMPWA                                          */ 00129500
*/*                                                                  */ 00133000
*/*02*  ACRONYM: TMPWA                                               */ 00136500
*/*                                                                  */ 00140000
*/*01* EYE-CATCHER: None                                             */ 00143500
*/*                                                                  */ 00147000
*/*02*  OFFSET: N/A                                                  */ 00150500
*/*                                                                  */ 00154000
*/*02*  LENGTH: N/A                                                  */ 00157500
*/*                                                                  */ 00161000
*/*01* MACRO-TYPE: Bilingual Mapping macro                           */ 00164500
*/*                                                                  */ 00168000
*/*01* NOTES:                                                        */ 00171500
*/*                                                                  */ 00175000
*/*01* PROCESSOR: PL/AS and Assembler                                */ 00178500
*/*                                                                  */ 00182000
*/*01* COMPONENT: TSO/E Scheduler (28502)                            */ 00185500
*/*                                                                  */ 00189000
*/*01* STORAGE-ATTRIBUTES:                                           */ 00192500
*/*                                                                  */ 00196000
*/*02*  SUBPOOL:  230                                                */ 00199500
*/*                                                                  */ 00203000
*/*02*  KEY: 0,1                                                     */ 00206500
*/*                                                                  */ 00210000
*/*02*  RESIDENCY:  Above 16M line                                   */ 00213500
*/*                                                                  */ 00217000
*/*01* SIZE: See listing                                             */ 00220500
*/*                                                                  */ 00224000
*/*01* CREATED-BY:  IKJEFT01, IKJEFTSC                               */ 00227500
*/*                                                                  */ 00231000
*/*01* POINTED-TO-BY: WRKAPTR1 - Program Problem State Work Area Ptr.*/ 00234500
*/*                   WRKAPTR2 - Supervisor State Work Area Ptr.     */ 00238000
*/*                                                                  */ 00241500
*/*01* SERIALIZATION:  None                                          */ 00245000
*/*                                                                  */ 00248500
*/*01* METHOD-OF-ACCESS: See additional Prolog information below     */ 00252000
*/*                                                                  */ 00255500
*/*01* External Classification: GUPI                                 */ 00259000
*/*01* End of External Classification:                               */ 00262500
*/*                                                                  */ 00266000
*/*01* CHANGE-ACTIVITY: See additional Prolog information below      */ 00269500
*/*                                                                  */ 00273000
*/***End of Specifications********************************************/ 00276500
*       %GOTO TMPWABSL;                                                 00280000
* TO EXCLUDE THE MAPPING OF TMPWRKA1 FROM THE PROGRAM       @E1213F3*/  00283501
* SPECIFY THE FOLLOWING OPERAND WHEN INVOKING THE MAPPING   @E1213F3*/  00287001
*        1)WORKA1=NO                                        @E1213F3*/  00290501
****                                                        @E1213F3*/  00294000
****   CHANGE ACTIVITY =                                            */  00297500
****    A 0-999999                               @ZA40795 & @ZA40796*/  00301000
****    SUPPORT FOR MVS/SE 2                                @ZA39401*/  00304500
****    SUPPRORT FOR EXTENDED RC SUPPORT                    @E1113KJ*/  00308000
****    CHANGE COPYRITE DATE                                @ZMT0073*/  00311500
****    SUPPORT FOR INTEGRITY PTF                           @E1213F3*/  00315000
****    OZ66275 -ADD TSEVENT ISSUED FLAG                    @ZA66275*/  00318500
****    ZTY0011 -REMOVE RETURN CODE REG 0 SUPPORT           @ZTY0011*/  00322000
****    ZTS0162 -CALL COMMAND RECOVERY PROCESSING           @ZTS0162*/  00325500
****    @E2267H1-INCLUDED POINTERS NEED FOR VSCR            @E2267H1*/  00329000
****    @PBB0045-GET RID OF TMP2ATT                         @PBB0045    00332500
****    @OZ85291- 0C4 IN IKJEFTP2 FOLLOWING A RETRY TO      @ZA85291*/  00336000
****              IKJTWAIT FROM IKJEFT05                    @ZA85291*/  00339500
****    @E2367S4- TSO/E RELEASE 3 SUPPORT FOR THE           @E2367S4*/  00343000
****              CLIST ATTENTION FACILITY AND CLISTS       @E2367S4*/  00346500
****              INVOKED THROUGH THE TSO SERVICE FACILITY. @E2367S4*/  00350000
****    @OZ89253- ADD SKPATTN TO INDICATE WHEN IKJEFT03     @ZA89253*/  00353500
****              CAN PROCESS AN ATTENTION.                 @ZA89253*/  00357000
****                                                                */  00360500
****    @PBY0271- ADDED CODE TO SKIP PPL                    @PBY0271*/  00364000
****     THE LENGTH OF THE PPL (PARSE PARAMETER LIST) IS HARD CODED */  00367500
****     BECAUSE IKJEFTSC CONTAINS ANOTHER MACRO WITH THE SAME NAME.*/  00371000
****     BOTH IKJPPL AND IECDPPL (PURGE PARAMETER LIST) USE PPL.    */  00374500
****                                                        @PBY0271*/  00378000
****                                                                */  00381500
****    @PBY0285- ADD TMP1TSFE BIT. SET BY IKJEFT04 WHEN    @PBY0285*/  00385000
****              AN ERROR OCCURS IN A CLIST RUNNING IN     @PBY0285*/  00388500
****              TSF/CLIST MODE AND THE CLIST HAS BEEN     @PBY0285*/  00392000
****              FLUSHED. THIS INDICATES TO IKJEFT02 THAT  @PBY0285*/  00395500
****              IT SHOULD FLUSH THE STACK.                @PBY0285*/  00399000
****                                                                */  00402500
****    @PBY0306- MERGE OF APAR OZ96882. ADDED PROTECTED            */  00406000
****              SAVEAREAS FOR IKJEFT02 AND IKJEFTP2. MOVED        */  00409500
****              PARAMETER LIST FOR IKJEFT03 INTO TMPWRKA2.        */  00413000
****              ADDED SYNCH PARAMETER LIST.               @ZA96882*/  00416500
****                                                                */  00420000
****    @OZ91237- DEFINE AN ECB FOR IKJEFTSC ATTENTION EXIT         */  00423500
****              (IKJATTN) TO WAIT ON WHILE IKJEFT03 PROCESSES     */  00427000
****              AN ATTENTION.                             @ZA91237*/  00430500
****                                                                */  00434000
****    @PBY0316- MOVED TMP1TSFE BIT (INTRODUCED VIA PTM            */  00437500
****              PBY0285) FROM CALLSWS STRUCTURE TO RESERVED       */  00441000
****              AREA IN TMPSWS. IKJEFT08 REMAPPED THIS AREA       */  00444500
****              CAUSING A CONFLICT.                       @PBY0316*/  00448000
****                                                                */  00451500
****    @E21D2I6- TSOE AUTHORIZED TESTING SUPPORT           @E21D2I6*/  00455000
****                                                                */  00458500
****    @PEI0432- ADDED FIELDS FOR REXX PROTECTION AND      @PEI0432*/  00462000
****              UNPROTECTION.                             @PEI0432*/  00465500
****                                                                */  00469000
****    @PEI0966- INSERT THE TEXT VERSION OF THE COPYRITE   @PEI0966*/  00472500
****                                                                */  00476000
****    OY18897 - ADD A BIT WHICH WILL BE USED TO INDICATE THAT PCF */  00479500
****              HAS ASKED THE TMP TO DO A DIRECT ATTACH OF THE    */  00483000
****              COMMAND PROCESSOR.  THIS WILL BE TURNED ON WHEN   */  00486500
****              THE PCF EXIT RETURNS A RETURN CODE 0.     @YA18897*/  00490000
****                                                                */  00493500
****    OY25597 - CHANGE THE LENGTH OF STPBSP TO 6 WORDS AND        */  00497000
****              THE LENGTH OF STPLSP TO 4 WORDS (ASSEMBLER        */  00500500
****              VERSION ONLY).                            @YA25597*/  00504000
****                                                                */  00507500
****    OY25427 - CHANGE ABEND SUBCODE AND ERROR MESSAGE AREA TO    */  00511000
****              ALLOW FOR 4-BYTE REASON CODES.            @YA25427*/  00514500
****                                                                */  00518000
****    @E23D2I6- TSO/E AUTHORIZED PLATFORM SUPPORT         @E23D2I6*/  00521500
****                                                                */  00525000
****    @PID0180- EXPAND DYNASP, MDYNASP, AND DYNAPARM      @PID0180*/  00528500
****              TO 10 FULLWORDS FOR USE WITH DRITCBAD.    @PID0180*/  00532000
****              TMPWRKA1 RESERVED SPACE IS EXPANDED.      @PID0180*/  00535500
****                                                                */  00539000
****    @PID0241- FIX THE ABMSGSP FIELD IN THE ASM          @PID0241*/  00542500
****              BROKEN BY OY25427                                 */  00546000
****                                                                */  00549500
****    OY34525 - DECLARE A FOOTPRINT SET BY IKJEFTP2 BEFORE        */  00553000
****              ISSUING DETACH AND RESET ON RETURN FROM           */  00556500
****              DETACH. CHECKED BY IKJEFT05 TO DETERMINE IF       */  00560000
****              DETACH SHOULD BE ISSUED BY IKJEFT05.      @YA34525*/  00563500
****                                                                */  00567000
****    OY40214 - DECLARE A FLAG SET BY IKJEFT04 WHEN THE TMP       */  00570500
****              HAS RECEIVED AN ABEND806 WHILE ATTACHING A        */  00574000
****              COMMAND.                                  @YA40214*/  00577500
****                                                                */  00581000
****   @PMH0003 - UPDATED PROLOG TO CONFORM TO THE SHOWHDR  @PMH0003*/  00584500
****              TOOLS STANDARDS REQUIRED BY INFORMATION   @PMH0003*/  00588000
****              DEVELOPMENT.                              @PMH0003*/  00591500
****   @PMH0160 - Added CDPI information                    @PMH0160*/  00595000
****                                                                */  00598500
****   @E25D2JC - Added the following fields:               @E25D2JC*/  00602000
****              -   TMP2TSLB                              @E25D2JC*/  00605500
****              -   TMP2RGQ2                              @E25D2JC*/  00609000
****              -   TMP2DYDC                              @E25D2JC*/  00612500
****              -   TMP1TQ2S                              @E25D2JC*/  00616000
****   @E25D2JC - Added the following fields:               @E25D2JC*/  00619500
****              -   TMP2T01E                              @E25D2JC*/  00623000
****                                                        @E25D2JC*/  00626500
****              -   TMP2ET01                              @E25D2JC*/  00630000
****              -   TMP2ET1A                              @E25D2JC*/  00633500
****              -   TMP2ET1B                              @E25D2JC*/  00637000
****              -   TMP2ET1I                              @E25D2JC*/  00640500
****              Removed the following fields:             @E25D2JC*/  00644000
****              -   T1AENTRY                              @E25D2JC*/  00647500
****                                                                */  00651000
****   @OW21212 - Add three new fields to save R15,R0,R1 for@WA21212*/  00654500
****              IKJEFT05 recovery routine.                @WA21212*/  00658000
****              -   TMP2T5R0                              @WA21212*/  00661500
****              -   TMP2T5R1                              @WA21212*/  00665000
****              -   TMP2T5RF                              @WA21212*/  00668500
****                                                                */  00672000
****   @OW19057 - Enablement of PWS exits introduced in     @WA19057*/  00675500
****              TSO/E 2.5.                                @WA19057*/  00679000
****   @KX00014 - Add two new fields: address and length of @KX00014*/  00682500
****              IKJEFT05 Key 1 save area                  @KX00014*/  00686000
****              -   TMP2T5WL len of T05 key1 GETMAIN area @KX00014*/  00689500
****              -   TMP2T5W1 addr of T05 key1 GETMAIN area@KX00014*/  00693000
****                                                                */  00696500
****   @L1=     - Update PL/X definition to eliminate informational */  00700000
****              compiler messages                             @L1=*/  00703500
****                                                                */  00707000
****   @OW23000 - Add definition for TMP2NTSL to indicate   @WA23000*/  00710500
****              that a command is not eligible to be      @WA23000*/  00714000
****              invoked from a dataset defined by TSOLIB  @WA23000*/  00717500
****                                                                */  00721000
****   @OW25066 - Update BAL portion of OW19057 to remove   @WA25066*/  00724500
****              compiler error                            @WA25066*/  00728000
****                                                                */  00731500
*/* FLAG REASON   RELEASE DATE     ORIGIN                        @N1A*/ 00735000
*/* ---- ------   ------- -------- ------                        @N1A*/ 00738500
*/* $N1= COPYRITE HTE26D2 19970213 VOHS: Insert/Update Copyright @N1A*/ 00742000
*/* $L2= REQ59149 HTE26D2 19970326 VOHS: Add field TMP1CDCA      @L2A*/ 00745500
*/*                                                                  */ 00749000
****   @OW30624 - Update assembler portion of @L2A to remove        */  00752500
****              assembler error                           @WA30624*/  00756000
****                                                                */  00759500
****    OW36096 - Allow the CALL * command to CALL modules which    */  00763000
****              reside only in LPA.  A module is considered to    */  00766500
****              reside only in LPA if a BLDL for the module in    */  00770000
****              the standard search order (DCB=0) fails, but a    */  00773500
****              CSVQUERY is successful.  In this case, the ATTACH */  00777000
****              macro must be coded with the EPLOC parameter,     */  00780500
****              because the DE parameter does not point to a      */  00784000
****              valid Directory Entry list (because the BLDL      */  00787500
****              failed.)  This APAR adds fields BLDLTMP_TT and    */  00791000
****              BLDLTMP_R to the mappings.  These fields simply   */  00794500
****              break down the BLDLTTRZ field so that the TT      */  00798000
****              (relative track) and R (record number) fields     */  00801500
****              returned by BLDL can be addressed directly.       */  00805000
****                                                        @WA36096*/  00808500
****                                                                */  00808601
****    OA44804 - Define TMP2RWAP to point to the IKJEFTOP          */  00808701
****              Recovery Work Area (RECOV_WA). Area is gotten     */  00808801
****              and freed by IKJEFT01.                    @AA44804*/  00808901
****                                                                */  00812000
****                                                                */  00815500
.* A 0-999999                                      @ZA40795 & @ZA40796  00819000
          MACRO                                                         00822500
          IKJTMPWA &WORKA1=YES                                          00826000
          AIF   ('&WORKA1' EQ 'NO').WORKA2                              00829500
*********************************************************************/  00833000
**** TMPWRKA1 -- TMP PROBLEM PROGRAM STATE DYNAMIC WORK AREA        */  00836500
****                                                                */  00840000
****   THIS DYNAMIC WORK AREA IS GOTTEN FROM SUBPOOL 1, PP KEY, BY  */  00843500
****   IKJEFT01  DURING  TMP INITIALIZATION AND ANOTHER ONE         */  00847000
****   WILL BE GOTTEN IN IKJEFTSC IF A PARALLEL TMP IS NEEDED AND   */  00850500
****   THIS WORKAREA WILL BE FREED WHEN THE PARALLEL TMP IS FINISHED*/  00854000
****   WHILE THE ONE GOTTEN FOR THE NON-PARALLEL SIDE BY IKJEFT01   */  00857500
****   WILL NOT BE FREED UNTIL THE END OF THE TERMINAL SESSION.     */  00861000
****   DURING THE TMP SEVERITY 2 STAE RETRY ALL OF STORAGE IS FREED */  00864500
****   AND THIS WORKAREA MUST BE REINITIALIZED.                     */  00868000
****                                                        @E1113KJ*/  00871500
*********************************************************************/  00875000
         IKJTPL                                                         00878500
TMPWRKA1 EQU  TPL    WORK AREA BEGINS WITH TEST PARAMETER LIST          00882000
*     /* TMP COMMON VARIABLES AND WORK AREAS                        */  00885500
TMPNECB  DS    F                     /* ECB FOR STAI WAIT           */  00889000
TMPCECB  DS    F                     /* ECB FOR ATTACHED CP         */  00892500
TMPIECB  DS    F                     /* ECB FOR STAI POST           */  00896000
TMPAECB  DS    F                     /* ECB FOR ATTN POST           */  00899500
TMPCMDWT DS    F                     /* PTR TO CMD FROM ATTN EXIT   */  00903000
*                                                                       00906500
TMPSWS   DS    F                     /* TMP INTERNAL SWITCHES       */  00910000
TMPTEST  EQU   X'80'                 /* TEST PROGRAM IN CONTROL     */  00913500
TMPCMDW  EQU   X'40'                 /* COMMAND WAITING             */  00917000
TMPNFCMD EQU   X'20'                 /* FIRST COMMAND IS PROCESSED  */  00920500
TMPACTRL EQU   X'10'                 /* TMP ATTN EXIT IS IN CONTROL */  00924000
TMPSCTRL EQU   X'08'                 /* TMP STAI EXIT IS IN CONTROL */  00927500
ABND806  EQU   X'04'                 /* NO-MODULE FOUND BY FETCH    */  00931000
FRSTLAB  EQU   X'02'                 /* 1ST LEVEL ATTACHEE ABENDED  */  00934500
NONSCUR  EQU   X'01'                /* SECURITY AUTHORIZATION FAILS */  00938000
*                                                                       00941500
ATCHNOW  EQU   X'80'                 /* ABEND OCCURRED IN ATTACH    */  00945000
LOADNOW  EQU   X'40'                 /* ABEND OCCURRED IN LOAD      */  00948500
LINKNOW  EQU   X'20'                 /* ABEND OCCURRED IN LINK      */  00952000
FRSTEX   EQU   X'10'                /* FIRST EXPL/IMPLICIT EXEC TRY */  00955500
CALLNOW  EQU   X'08'                 /* CALL FUNCTION ACTIVE        */  00959000
TMP1TIME EQU   X'04'                 /* ESTAI ENTERED(TEST) @ZTM5046*/  00962500
T7TDONE  EQU   X'02'                 /* TSEVENT ISSUED      @ZA66275*/  00966001
SKPATTN  EQU   X'01'                 /* 1-BYPASS ATTN       @ZA89253*/  00969500
*                                                                       00973000
TMP1TSFE EQU   X'80'                 /* ERROR OCCURRED IN CLIST         00976500
*                                       WHILE IN TSF/CLIST MODE.        00980000
*                                                           @PBY0316*/  00983500
CALLSWS  EQU   TMPSWS+3              /* TMP-CALL INTERNAL SWITCHES  */  00987000
PDLPRES  EQU   X'80'                 /* PDL RETURNED BY PARSE       */  00990500
DSOPEN   EQU   X'40'                 /* DATA SET IS OPEN            */  00994000
BLANKB   EQU   X'10'                 /* DATA SET NAME PROCESSED     */  00997500
DORELS   EQU   X'08'                 /* RELEASE PDL NOW             */  01001000
GMBRNOW  EQU   X'04'                 /* GET MEMBER NAME             */  01004500
PCFDA    EQU   X'02'                 /* PCF DIRECT ATTACH   @YA18897*/  01008000
*        EQU   X'01'                 /* RESERVED FLAG               */  01011501
*     /* RESERVED AREAS                                             */  01015000
TMPT9ECB DS  A                       /* ECB USED FOR COMMUNICATION      01018500
*                                       BETWEEN IKJEFT09 AND IKJURPS    01022000
*                                                           @E24D2H3*/  01025500
TMPURPA  DS  A                       /* ANCHOR FOR URP REQUEST BLOCK    01029000
*                                       CHAIN FOR IKJEFT09  @E24D2H3*/  01032500
RESCOMM  DS     CL8                  /*                     @E24D2H3*/  01036000
RESCOM2  DS     CL16                                                    01039500
RESCOM3  DS     CL16                                                    01043000
RESCOM4  DS     CL16                                                    01046500
         DS     CL4                /* RESERVED WAS FLOFLGS  @ZA46174*/  01050000
CPPLPTR  DS     F                    /* PTR TO CP PARM LIST         */  01053500
CSOAPTR  DS     F                    /* PTR TO CMD SCAN PARM LIST   */  01057000
CSPLPTR  DS     F                    /* PTR TO CMD SCAN PARM LIST   */  01060500
DAPLPTR  DS     F                    /* PTR TO DAIR PARM LIST       */  01064000
GTPBPTR  DS     F                    /* PTR TO GETLINE PARM BLOCK   */  01067500
IOPLPTR  DS     F                    /* PTR TO I/O RTNS PARM LIST   */  01071000
PGPBPTR  DS     F                    /* PTR TO PUTGET PARM BLOCK    */  01074500
PPLPTR   DS     F                    /* PTR TO PARSE PARM LIST      */  01078000
PTPBPTR  DS     F                    /* PTR TO PUTLINE PARM BLOCK   */  01081500
STPLPTR  DS     F                    /* PTR TO STACK PARM LIST      */  01085000
ACEEPTR  DS     F                    /* ADDR OF ACEE                */  01088500
ASCANAP  DS     F                    /* ADDR OF ATTN SCAN ANSWER    */  01092000
ASRPLPTR DS     F                    /* ADDR OF ATTN SRPL           */  01095500
ATTCHPTR DS     F                    /* ADDR OF ATTACH PARM LIST    */  01099000
CDCBPTR  DS     F                    /* PTR TO CALL DCB             */  01102500
DCBPTR   DS     F                    /* PTR TO DCB                  */  01106000
DYNAPPTR DS     F                    /* PTR TO DYNALLOC PARM LIST   */  01109500
EBCDPTR  DS     F                    /* PTR TO TRANSLATE TABLE      */  01113000
READYPTR DS     F                    /* ADDR OF TMP MODE MESSAGE    */  01116500
SCANAP   DS     F                    /* ADDR OF SCAN ANSWER AREA    */  01120000
SRPLPTR  DS     F                    /* ADDR OF SRPL                */  01123500
         DS     F                    /* RESERVED            @ZA96882*/  01127000
STPBPTR  DS     F                    /* ADDR OF STACK PARM LIST     */  01130500
*     /* RESERVE SPACE FOR PARAMETER LISTS, BLOCKS                  */  01134000
         DS     0D                   /* ALIGN TO DOUBLEWORD         */  01137500
ABMSGSP  DS     CL41                  /* MESSAGE AREA       @PID0241*/  01141000
*     /* PUTLINE ACTIVE SEGMENT LIST    LIST                        */  01144500
ACTSL    DS     0F                   /* NAME OF LIST                */  01148000
ACTSEG   DS     28F                  /* SEGMENTS                    */  01151500
ACTSEGA  EQU    ACTSEG               /* FIRST HWORD OF SEGMENT      */  01155000
ACTSEGB  EQU    ACTSEG+2             /* SECOND HWORD OF SEGMENT     */  01158500
AMSGLIST DS     0F                   /* ATTN MESSAGE LIST           */  01162000
ANUMSEG  DS     F                    /* NUMBER OF MESSAGE SEGMENTS  */  01165500
AMSGSEG  DS     2F                   /* ARRAY OF SEGMENT PTRS       */  01169000
ARCODE   DS     F                    /* ATTN RETURN CODE SAVE AREA  */  01172500
ASCANFLG DS     F                    /* ATTN SCAN FLAGS             */  01176000
ASRPARM  DS     5F                   /* ATTN SR PARM AREA           */  01179500
ATTCHSP  DS     18F                  /* ATTACH PARM LIST SP @ZTY0371*/  01183000
BLDLLST  DS     0CL68                /* BLDL ENTRY                  */  01186500
XTRCLST  DS     0CL12                /* EXTRACT LIST                */  01190000
BLDLENT  DS     H                    /* NUM OF ENTRIES              */  01193500
BLDLELNG DS     H                    /* LENGTH OF ENTRY             */  01197000
BLDLNAME DS     CL8                  /* NAME OF COMMAND             */  01200500
BLDLTTRZ DS     CL56                 /* PAD TO FULL WORD    @ZA40795*/  01204000
         ORG    BLDLTTRZ             /* Redefine BLDLTTRZ   @WA36096*/  01207500
BLDLTMP_TT DS   CL2                  /* TT (relative track) returned    01211000
*                                       from BLDL           @WA36096*/  01214500
BLDLTMP_R DS    C                    /* R (record number) returned      01218000
*                                       from BLDL           @WA36096*/  01221500
         ORG    ,                    /* End of redefine     @WA36096*/  01225000
         DS     0D                   /* ALIGN TO DWORD              */  01228500
CDCBSP   DS     CL140                /* CALL DCB SPACE              */  01232000
CLOSESP  DS     CL12                 /* CLOSE PL SPACE              */  01235500
CPPLSP   DS     4F                   /* CPPL SPACE                  */  01239000
CSOASP   DS     2F                   /* CSOA SPACE                  */  01242500
CSOASP2  DS     2F                   /* 2ND CSOA SP (ATTN)          */  01246000
CSPLSP   DS     6F                   /* CSPL SPACE                  */  01249500
CSPLSP2  DS     6F                   /* 2ND CSPL SP (ATTN)          */  01253000
CTLBKSP  DS     0F                   /* NAME OF BLOCK SPACE         */  01256500
CTLBLKL  DS     F                    /* LENGTH OF BLOCK SPACE       */  01260000
CTLBLKA  DS     F                    /* LOC OF BLOCK SPACE          */  01263500
CTLBLKN  DS     F                    /* SUBPOOL                     */  01267000
DAPBSP   DS     21F                  /* DAIR PARM BLK SPACE         */  01270500
DAPLSP   DS     5F                   /* DAIR PARM LIST SPACE        */  01274000
         DS     0D                   /* ALIGN TO DOUBLEWORD         */  01277500
DCBSP    DS     CL140                /* DCB SPACE                   */  01281000
DYNASP   DS     10F                  /* DYNALLOC PL         @PID0180*/  01284500
DYNATUB  DS     BL4                  /* BIT FORM OF THE PLATFORM        01288000
*                                       TCB ADDRESS USED SO THAT THE    01291500
*                                       ADDRESS, NORMALLY ON A          01295000
*                                       WORD BOUNDARY, CAN BE COPIED    01298500
*                                       INTO THE TEXT UNIT PARM THAT'S  01302000
*                                       ON A HALFWORD                   01305500
*                                       BOUNDARY.           @PID0180*/  01309000
ECTSP    DS     14F                  /* ECT SPACE                   */  01312500
FMLCSP   DS     CL10                 /* FREEM PL SPACE              */  01316000
GTPBSP   DS     2F                   /* GTPB SPACE                  */  01319500
MODESSP  DS     F                    /* MODESET PARM LIST SPACE     */  01323000
NXTCMD   DS     2F                   /* COMMAND NAME FIELD          */  01326500
OPENSP   DS     3F                   /* OPEN PL SPACE               */  01330000
PGPBSP   DS     4F                   /* PGPB SPACE                  */  01333500
PPLSP    DS     7F                   /* PARSE PARM LIST SPACE       */  01337000
PRSMSSP  DS     3F                   /* MESSAGE AREA                */  01340500
PTPBSP   DS     3F                   /* PTPB SPACE                  */  01344000
RCODE    DS     F                    /* RETURN CODE SAVE AREA       */  01347500
R3SAVE   DS     F                    /* SAVE PDL PTR                */  01351000
SAVAR    DS     14F                  /* SAVE REGISTER ENVIRONMENT   */  01354500
SCANFLG  DS     F                    /* SCAN FLAGS                  */  01358000
SNAPSP   DS     10F                  /* SNAP PL SPACE               */  01361500
STPBSP   DS     6F                   /* STPB SPACE          @YA25597*/  01365000
STPLSP   DS     4F                   /* STACK PL SPACE      @YA25597*/  01368500
TMPZEROS DS     F                    /* ALL ZEROS WORD - DUMMY CBUF */  01372000
MODEMSP  DS     5F                  /* DUMMY SPACE FOR MODE MESSAGE */  01375500
         DS     CL20                 /* RESERVED                    */  01379000
*     /* WORK AREA FOR TMP-CALL FUNCTION                            */  01382500
CALLWA   DS     0F                                                      01386000
*       /* PROBLEM PROGRAM WORK AREA FOR CALL FUNCTION              */  01389500
PPWORKAR DS     0F                                                      01393000
PPLIST   DS     0F                                                      01396500
SWBIT    DS     C                                                       01400000
         DS     CL3                                                     01403500
PARMFLD  DS     0F                                                      01407000
LENPARM  DS     H                                                       01410500
PARMS    DS     CL100                                                   01414000
*       /* CALL INTERNAL WORK AREA                                  */  01417500
WORK1    DS     0F                                                      01421000
PARSPARM DS     0F                   /* PARSE PARMS                 */  01424500
PDLADDR  DS     F                   /* PTR TO PARM DESCRIPTOR LIST  */  01428000
PDLADDR2 DS     F                                                       01431500
DSNBUFFR DS     0H                                                      01435000
DSNLENG  DS     H                    /* LENGTH OF DATA SET NAME     */  01438500
DSNBUF   DS     CL44                 /* DSNAME                      */  01442000
         DS     CL2                  /* ALIGNMENT                   */  01445500
MSGNO    DS     F                    /* MESSAGE NUMBER              */  01449000
DAPB0PTR DS     F                                                       01452500
*       /* MEMBER NAME SEGMENT FOR MESSAGE                          */  01456000
MBRSEG   DS     0F                   /* NAME OF AREA                */  01459500
MBRSLEN  DS     H                    /* SEGMENT LENGTH              */  01463000
MBRSOFF  DS     H                    /* SEGMENT OFFSET              */  01466500
MBRSTXT  DS     CL8                  /* MEMBER NAME TEXT            */  01470000
*       /* MEMBER NAME SEGMENT FOR DAIR                             */  01473500
MBRDSEG  DS     0F                   /*   NAME OF AREA              */  01477000
MBRDLEN  DS     H                    /* SEGMENT LENGTH              */  01480500
MBRDTXT  DS     CL8                  /* NAME TEXT                   */  01484000
*       /* DATA SET NAME SEGMENT FOR MESSAGE                        */  01487500
DSSEG    DS     0F                   /* NAME OF AREA                */  01491000
DSSGLEN  DS     H                    /* SEGMENT LENGTH              */  01494500
DSSGOFF  DS     H                    /* SEGMENT OFFSET              */  01498000
DSSGTXT  DS     CL44                 /* DATA SET NAME TEXT          */  01501500
*       /* RETURN CODE RESERVE AREAS                                */  01505000
BLDLRC   DS     F              /* FOR BLDL RETURN CODE              */  01508500
DAIRRC   DS     F              /* FOR DAIR RETURN CODE              */  01512000
PUTLRC   DS     F              /* FOR PUTLINE RETURN CODE           */  01515500
CRCODE   DS     F              /* FOR GENERAL CALL RETURN CODE      */  01519000
*                                                                       01522500
*     /*  TMP RESTRUCTURE WORK AREAS                                */  01526001
TMPCTCB  DS     A              /* PTR TO ATTACH CP TCB      @ZA40795*/  01529501
TMPTECB  DS     F              /* TEST RETURNED ECB         @ZA40795*/  01533001
TMPECB2  DS     F              /* IKJEFTXX EOT ECB          @ZA40795*/  01536501
CPABECB  DS     F              /* TEST RQST AFTER ABEND     @ZA40795*/  01540001
ECBLPTR  DS     A              /* PTR ECB WAIT LISTS        @ZA40795*/  01543501
TMPECBL2 DS     0F             /*                           @ZA40795*/  01547001
TMPCECB2 DS     A              /* PTR TO ATTACH CP ECB      @ZA40795*/  01550501
TMPIECB2 DS     A              /* PTR TO TMP STAI ECB       @ZA40795*/  01554001
TMPAECB2 DS     A              /* PTR TO TMP ATTN ECB       @ZA40795*/  01557501
         DS     0F             /*                           @E2367S4*/  01561001
*     /* TMP PTF                                                    */  01564501
TMPECBAT DS     A              /* TMP ATTN ECB              @E2367S4*/  01568001
TMPSCECB DS     F              /* IKJEFTSC ATTENTION ECB    @ZA91237*/  01571501
TMPSWAIT EQU  X'80'            /* TESTED BY IKJEFT03 AND                01575000
*                                 IKJEFT05.                 @ZA91237*/  01578501
TMP1ECB2 DS     F              /* T02 ATTACH ECB            @E1213F3*/  01582001
         DS    F               /* RESERVED                  @ZTY0011*/  01585501
TMPR15RC DS    F               /* R15 RC FROM CP            @E121324*/  01589001
TMP1RSNC DS    F              /* REASON CODE WHEN CP ABEND  @E1213F3*/  01592501
TMP1ABNC DS    F              /* ABEND CODE WHEN CP ABEND   @E1213F3*/  01596001
TMP1NAME DS    CL8            /* NAME OF TMPWRKA1           @E1213F3*/  01599501
TMP1LEV  DS    CL4            /* LEVEL OF TMPWRKA1          @E1213F3*/  01603001
TMPECBL3 DS     0F             /*                           @E2367S4*/  01606501
TMPTECB3 DS     A              /* PTR TO TEST COMPLETE EC   @E2367S4*/  01610001
TMPCECB3 DS     A              /* PTR TO ATTACH CP ECB      @E2367S4*/  01613501
TMPAECB3 DS     A              /* PTR TO TMP ATTN ECB       @E2367S4*/  01617001
TMP1TQ2S DS     18F            /* Savearea for functions that           01620500
*                                 IKJEFTQ2 invokes.         @E25D2JC*/  01624001
TMP1CDCA DS    F               /* Address of DCB for CALL command to    01627500
*                                 use or 0 for LINKLIST request         01631000
*                                                           @WA30624*/  01634501
         DS    CL36           /* RESERVE                        @L2C*/  01638001
TMP1END  DS    0D                /* ASSURE THAT THIS WORKAREA END IN    01641500
*                                   A DOUBLE WORD BOUNDARY. ANY         01645000
*                                   ADDITION TO WORKAREA SHOULD BE      01648500
*                                   PUT BEFORE TMP1END      @E1213F3*/  01652001
*                                                                       01655500
.WORKA2  ANOP                                                           01659000
*********************************************************************/  01662500
**** TMPWRKA2 -- TMP SUPERVISOR STATE DYNAMIC WORK AREA             */  01666000
****                                                                */  01669500
****   THIS DYNAMIC WORK AREA  IS GOTTEN  FROM SUBPOOL 230 KEY 1,   */  01673000
****   BY IKJEFT01 DURING TMP INITIALIZATION.   NORMALLY IT IS NOT  */  01676500
****   FREED  UNTIL  END OF THE TERMINAL SESSION. OTHERS WILL BE    */  01680000
****   GOTTEN BY IKJEFTSC WHEN A PARALLEL T02 IS INITIATED          */  01683500
****   AND FREED WHEN PARALLEL T02 FINISHED IT PROCESSING.          */  01687000
****   SEVERITY 2 STAE RETRY  ALL OF CORE  IS FREED  AND THIS WORK  */  01690500
****   AREA MUST BE REINITALIZED.   THIS WORK AREA  IS  REFERENCED  */  01694000
****   BY ALL OF THE TMP MODULES.                                   */  01697500
****                                                        @E1213F3*/  01701000
****   CHANGE ACTIVITY =                                            */  01704500
****    A 0-999999                               @ZA40795 & @ZA40796*/  01708000
****    SUPPORT FOR MVS/SE 2                                @ZA39401*/  01711500
****    SUPPRORT FOR EXTENDED RC SUPPORT                    @E1113KJ*/  01715000
****    CHANGE COPYRITE DATE                                @ZMT0073*/  01718500
****    SUPPORT FOR INTEGRITY PTF                           @E1213F3*/  01722000
****    OZ66275 -ADD TSEVENT ISSUED FLAG                    @ZA66275*/  01725500
****    ZTS0254 CLIST ATTN                                  @E1213F3*/  01729000
****    ZTY0256 MP PROBLEM                                  @E1213F3*/  01732500
****    @E2267H1-INCLUDED POINTERS NEED FOR VSCR            @E2267H1*/  01736000
****    @OZ85291- 0C4 IN IKJEFTP2 FOLLOWING A RETRY TO      @ZA85291*/  01739500
****              IKJTWAIT FROM IKJEFT05                    @ZA85291*/  01743000
****    @E2367S4- TSO/E RELEASE 3 SUPPORT FOR THE           @E2367S4*/  01746500
****              CLIST ATTENTION FACILITY AND CLISTS       @E2367S4*/  01750000
****              INVOKED THROUGH THE TSO SERVICE FACILITY. @E2367S4*/  01753500
****                                                                */  01757000
****    PBY0160 ADDED 2 BITS (TMP2SYN1 AND TMP2SYN2) TO     @PBY0160*/  01760500
****            INDICATE TO IKJEFT03 WHETHER IT WAS ENTERED @PBY0160*/  01764000
****            VIA A SYNCH FROM IKJEFT02. IF TMP2SYN1      @PBY0160*/  01767500
****            IS SET, IT INDICATES THAT IKJEFT02 SYNCHED  @PBY0160*/  01771000
****            TO IKJEFT03 FROM ROUTINE TTSKCHK. IF        @PBY0160*/  01774500
****            TMP2SYN2 IS SET, IT INDICATES THAT IKJEFT02 @PBY0160*/  01778000
****            SYNCHED TO IKJEFT03 FROM ROUTINE TGETCDX.   @PBY0160*/  01781500
****                                                                */  01785000
****     OZ97523- ADDED TMP2TPS3 - IKJEFTP2'S ADDITIONAL    @ZA97523*/  01788500
****              PROTECTED SAVEAREA                        @ZA97523*/  01792000
****                                                                */  01795500
****     E21D2G9- TSO/E VERSION 2 RELEASE 1 REXX DATA STACK @E21D2G9*/  01799000
****    @E21D2I6- TSOE AUTHORIZED TESTING SUPPORT           @E21D2I6*/  01802500
****     PEI0701- ADD REXX REINITIALIZATION INDICATOR       @PEI0701*/  01806000
****    @E23D2I6- TSO/E AUTHORIZED PLATFORM SUPPORT         @E23D2I6*/  01809500
****    @PID0180- EXPAND DYNASP, MDYNASP, AND DYNAPARM      @PID0180*/  01813000
****              TO 10 FULLWORDS FOR USE WITH DRITCBAD.    @PID0180*/  01816500
****              TMPWRKA1 RESERVED SPACE IS EXPANDED.      @PID0180*/  01820000
****    @PMH0003- UPDATED PROLOG TO CONFORM TO THE SHOWHDR  @PMH0003*/  01823500
****              TOOLS STANDARDS REQUIRED BY INFORMATION   @PMH0003*/  01827000
****              DEVELOPMENT.                              @PMH0003*/  01830500
****    @PMH0057- Added ENQ/DEQ storage to the TMPWRKA2     @PMH0057*/  01834000
****              for IKJEFT08 subrtns TIBENQ and TIBDEQ    @PMH0057*/  01837500
****              and for IKJEFTP2 subrtns TSFENQ and       @PMH0057*/  01841000
****              TSFDEQ.  Added reserved space following   @PMH0057*/  01844500
****              this storage.                             @PMH0057*/  01848000
****    @PMH0071- Ensure all ENQ/DEQ fields are prefixed    @PMH0071*/  01851500
****              with TMP2 for uniqueness.                 @PMH0071*/  01855000
****    @OY58978- Add the length in bytes to the ASM        @PMH0071*/  01858500
****              storage declarations for TMP2EDST         @YA58978*/  01862000
****              and TMP2ENQR.                             @YA58978*/  01865500
****   @E25D2JC - Added the following fields:               @E25D2JC*/  01869000
****              -   TMP2TSLB                              @E25D2JC*/  01872500
****              -   TMP2RGQ2                              @E25D2JC*/  01876000
****              -   TMP2DYDC                              @E25D2JC*/  01879500
****              -   TMP1TQ2S                              @E25D2JC*/  01883000
****   @E25D2JC - Added the following fields:               @E25D2JC*/  01886500
****              -   TMP2T01E                              @E25D2JC*/  01890000
****                                                        @E25D2JC*/  01893500
****              -   TMP2ET01                              @E25D2JC*/  01897000
****              -   TMP2ET1A                              @E25D2JC*/  01900500
****              -   TMP2ET1B                              @E25D2JC*/  01904000
****              -   TMP2ET1I                              @E25D2JC*/  01907500
****              Removed the following fields:             @E25D2JC*/  01911000
****              -   T1AENTRY                              @E25D2JC*/  01914500
****   @KO10167 - Reserve TMP2ET1I                          @KO10167*/  01918000
****                                                                */  01921500
.* A 0-999999                                      @ZA40795 & @ZA40796  01925000
****                                                        @E1113KJ*/  01928500
*********************************************************************/  01932000
TMPWRKA2 DSECT                                                          01935500
TWRKA2A  DS     0D                                                      01939000
WRKA1PTR DS     F                   /* PTR TO PROB PROG WORK AREA   */  01942500
WRKA2PTR DS     F                   /* PTR TO TMP PRIVATE WORK AREA */  01946000
TMPWA2P  DS     F                   /* PTR TO STAE/STAI WORK AREA   */  01949500
SAVARPTR DS     F                   /* PTR TO ORIGINAL SAVE AREA    */  01953000
TMPTIME  DS     F                   /* ADDR OF TIME ROUTINE         */  01956500
TMPT04   DS     F                   /* ADDR OF STAI EXIT ROUTINE    */  01960000
TMPT042  DS     F                   /* ADDR2 OF STAI EXIT ROUTINE   */  01963500
TMPT05   DS     F                   /* ADDR OF STAE EXIT ROUTINE    */  01967000
TEPKEY   DS     F                   /* TMP ENTRY PSW PROTECT KEY    */  01970500
TCBPTR   DS     F                   /* PTR TO TCB                   */  01974000
UPTPTR   DS     F                   /* PTR TO UPT                   */  01977500
ECTPTR   DS     F                   /* PTR TO ECT                   */  01981000
PSCBPTR  DS     F                   /* PTR TO PSCB                  */  01984500
ASCBPTR  DS     F                   /* PTR TO ASCB                  */  01988000
ASXBPTR  DS     F                   /* PTR TO ASXB                  */  01991500
RLGBPTR  DS     F                   /* PTR TO RELOGON BUFFER        */  01995000
LWAPTR   DS     F                   /* PTR TO LOGON WORK AREA       */  01998500
JSCBPTR  DS     F                   /* PTR TO JSCB (IEZJSCB)        */  02002000
CMDACTP  DS     A                   /* PTR SRM PARM LIST    @ZA39401*/  02005500
TMPT043  DS     A                   /* PTR TO ESTAI MSG RTN @ZA40795*/  02009000
*     /* TMP MAINLINE FLOW CONTROL FLAGS                            */  02012500
FLOFLGS  DS     CL4                                                     02016000
FLOFLGS1 EQU    FLOFLGS                                                 02019500
*        EQU    X'80'                                                   02023000
*        EQU    X'40'                                                   02026500
DOLIST   EQU    X'20'                                                   02030000
DOGETC   EQU    X'10'                                                   02033500
DODONE   EQU    X'08'                                                   02037000
DOINVOK  EQU    X'04'                                                   02040500
DOSCAN   EQU    X'02'                                                   02044000
*        EQU    X'01'                                                   02047500
*                                                                       02051000
FLOFLGS2 EQU    FLOFLGS+1                                               02054500
DOPUTM   EQU    X'80'                                                   02058000
DOFRECB  EQU    X'40'                                                   02061500
DOPSTRT  EQU    X'20'                                                   02065000
DOACTV   EQU    X'10'                                                   02068500
DOCHKAT  EQU    X'08'                                                   02072000
DOWAIT   EQU    X'04'                                                   02075500
DOATTN   EQU    X'02'                                                   02079000
DOCHKCP  EQU    X'02'                                                   02082500
*        EQU    X'01'                                                   02086000
*                                                                       02089500
FLOFLGS3 EQU    FLOFLGS+2                                               02093000
*        EQU    X'80'                                                   02096500
DOIMPLX  EQU    X'40'                                                   02100000
DOTEST   EQU    X'20'                                                   02103500
DOSETBF  EQU    X'10'                                                   02107000
DOSETTB  EQU    X'08'               /*                             */   02110500
FLOFLGS4 EQU    FLOFLGS+3                                               02114000
T0ASAVEP DS     F                   /* ADDR OF SAVEAREA FOR RETRY TO    02117500
*                                      IKJEFT0A             @E2267H1*/  02121000
LWAPTR1  DS     A                   /* PTR TO LWA FOR T02   @E23D2I6*/  02124500
TMP2RWAP DS     A                   /* IKJEFTOP Recovery Work Area ptr  02131601
*                                      to RECOV_WA, which contains      02131701
*                                      the IKJEFTOP ESTAE parm, namely  02131801
*                                      TOP_PARMWA. Area is Gotten/Freed 02131901
*                                      by IKJEFT01.         @AA44804*/  02132001
         DS     F                   /* RESERVED                     */  02133001
*       /* TEMPORARY SAVE AREAS FOR CALL LINK REGISTERS             */  02135000
*       /* SAVE AREAS FOR TMP-CALL                                  */  02138500
SAVRA    DS     F                                                       02142000
SAVRB    DS     F                                                       02145500
SAVRC    DS     F                                                       02149000
SAVRM    DS     F                                                       02152500
SVLNKE   DS     F                                                       02156000
*       /* SAVE AREAS FOR TMP MAINLINE LINK REGISTERS               */  02159500
SAVLNKRS DS     0F                   /* NAME OF AREA                */  02163000
SAVLNKA  DS     F                                                       02166500
SAVLNKB  DS     F                                                       02170000
SAVLNKC  DS     F                                                       02173500
SAVLNKD  DS     F                                                       02177000
SAVLNKE  DS     F                                                       02180500
SAVLNKF  DS     F                                                       02184000
SAVLNKG  DS     F                                                       02187500
SAVLNKH  DS     F                                                       02191000
SAVLNKJ  DS     F                                                       02194500
SAVLNKK  DS     F                                                       02198000
SAVLNKL  DS     F                                                       02201500
SAVLNKM  DS     F                                                       02205000
TWRKA2B  DS     0F                   /* DEFINE SECOND AREA          */  02208500
*       /* CONTROL FLAGS                                            */  02212000
MCTLFLGS DS     0F                   /*   NAME OF AREA              */  02215500
MCFLGS1  DS     C                                                       02219000
BKGMODE  EQU    X'80'               /* EXECUTING IN BACKGROUND MODE */  02222500
DRSAPF   EQU    X'40'               /* ON - ATTACH WITH APF         */  02226000
TMP2TSLB EQU    X'20'               /* 1=FOUND IN TSOLIB    @E25D2JC*/  02229500
TMP2NTSL EQU    X'10'               /* 1=NOT ELIGIBLE FOR LOADING FROM  02233000
*                                      A DATASET DEFINED BY THE TSOLIB  02236500
*                                      COMMAND              @WA23000*/  02240000
         DS     CL3                 /* RESERVED                     */  02243500
*        EQU    X'80'               /* Hi-order bit is                  02247000
*                                      now reserved                 */  02250501
TMP2TSFC EQU    X'40'               /* 1=TMP IS EXECUTING IN            02254000
*                                      TSF/CLIST MODE       @E2367S4*/  02257500
*                                                                       02261000
ATTEXC2  EQU    X'20'               /* 1=EXC2 ATTACHED FOR TSF/CLIST    02264500
*                                      MODE PROCESSING      @E2367S4*/  02268000
*                                                                       02271500
TMP2TSCA EQU    X'10'               /* 1=IKJEFTSC ATTENTION EXIT        02275000
*                                      (IKJATTN) RECEIVED CONTROL       02278500
*                                                           @E2367S4*/  02282000
TMP2SVCI EQU    X'08'               /* 1=TMP PARALLEL SIDE IS SVC       02285500
*                                      INITIATED            @E2367S4*/  02289000
TMP2SYN1 EQU    X'02'               /* 1=SYNCHED TO IKJEFT03 FROM       02292500
*                                      IKJEFT02 IN ROUTINE TTSKCHK      02296000
*                                                           @PBY0160*/  02299500
TMP2SYN2 EQU    X'01'               /* 1=SYNCHED TO IKJEFT03 FROM       02303000
*                                      IKJEFT02 IN ROUTINE TGETCDX      02306500
*                                                           @PBY0160*/  02310000
MTPL     DS     0F                  /* NAME OF MODEL TPL            */  02313500
MTPLCBUF DS     F                   /* POINTER TO COMMAND BUFFER    */  02317000
MTPLPS   DS     0F                  /*   NAME OF POINTER AREA       */  02320500
MTPLUPT  DS     F                   /* POINTER TO UPT               */  02324000
MTPLPSCB DS     F                   /* POINTER TO PSCB              */  02327500
MTPLECT  DS     F                   /* POINTER TO ECT               */  02331000
*                                                                       02334500
RTRYSA   DS     0F                  /* ENVIRONMENTAL AREA           */  02338000
RTRY51   DS     F                   /* T02 BASE PTR 1               */  02341500
RTRY52   DS     F                   /* T02 BASE PTR 2               */  02345000
RTRY53   DS     F                   /* T02 DATAREG                  */  02348500
*                                                                       02352000
MDYNASP  DS     10F                 /* MODEL DYNALLOC PL    @PID0180*/  02355501
TWRKA2C  DS     0F                  /* DEFINE THIRD AREA    @ZA40795*/  02359001
TMPBLDL  DS     0CL68               /* BLDL REQUEST PL      @ZA40795*/  02362501
TMPBLDNR DS     H                   /* BLDL NUMBER OF       @ZA40795*/  02366001
*                                   /* ENTRIES IN LIST      @ZA40795*/  02369501
TMPBLDN  DS     H                   /* BLDL LENGTH OF PL    @ZA40795*/  02373001
TMPBLDNM DS     CL8                 /* BLDL PROGRAM NAME    @ZA40795*/  02376501
TMPBLDAT DS     CL56               /* BLDL USER INFO RETURNED       */  02380001
*                                   /*                      @ZA40795*/  02383501
TMPFLAG1 DS     X                   /* LOCAL FLAGS 1        @ZA40795*/  02387001
TMPCP    EQU    X'80'              /*1=CP ATTACH REQUESTED  @ZA40795*/  02390501
TMPCPCAL EQU    X'40'               /* 1=CALL COMMAND ATTACH        */  02394000
*                                   /* REQUESTED            @ZA40795*/  02397501
TMPCPTST EQU    X'20'               /* 1=TEST COMMAND LINK          */  02401000
*                                   /* REQUESTED            @ZA40795*/  02404501
TMPCPABN EQU    X'10'               /*1=CURRENT CMD ABENDED @ZA40795*/  02408001
TMPAPF   EQU    X'08'               /* 1=APF ATTACH ACTIVE  @ZA40795*/  02411501
TMPDE    EQU    X'04'               /* 1=DE ATTACH ACTIVE   @ZA40795*/  02415001
TMPTSTAU EQU    X'02'               /* 1=TESTAUTH COMMAND   @E21D2I6*/  02418501
*                                   /*  ENTERED             @E21D2I6*/  02422001
TMPBIT07 EQU    X'01'               /*  R E S E R V E D     @ZA40795*/  02425501
TMPFLAG2 DS     X                   /*  LOCAL FLAGS 2       @ZA40795*/  02429001
TMPFORCE EQU    X'80'               /* FORCE CMD DETACH     @ZA40795*/  02432501
TMPFLAG3 DS     X                   /*  R E S E R V E D     @ZA40795*/  02436001
TMPFLAG4 DS     X                   /*  R E S E R V E D     @ZA40795*/  02439501
TMPTEST@ DS     A                   /*  ADDR OF TEST CMD    @ZA40795*/  02443001
TMPTSKLB DS     A                   /* DCB ADDR FOR TASKLIB         */  02446500
*                                   /* ON ATTACH            @ZA40795*/  02450001
TMPCALST DS     A                   /* ADDR CALL COMMAND PARAMETER  */  02453500
*                                   /* STRING               @ZA40795*/  02457001
TMPCPPL@ DS     A                   /* ADDRESS TPLCPPL  OR  @E121324    02460501
*                                      USER PARM LIST FOR   @E121324    02464001
*                                      TSF SVC PGM REQUEST  @E121324*/  02467501
TMPABECB DS     A                   /* ADDR ECB POSTED AFTER ABEND  */  02471000
*                                   /* OR ATTENTION         @ZA40795*/  02474501
TMPSTAI  DS     A                   /* PTR TO ESTAI RTN     @ZA40795*/  02478001
TMPSPLS  DS     A                   /* PTR TO ESTAI PARMS   @ZA40795*/  02481501
TMPTSKRC DS     F                   /* SUBTASK CPL CODE R15 @ZA40795*/  02485001
         DS     X                   /* RESERVE              @E1213F3*/  02488500
         DS     X                   /* RESERVE              @E1213F3*/  02492000
         DS     X                   /* RESERVE              @E1213F3*/  02495500
         DS     X                   /* RESERVE              @E1213F3*/  02499000
TMP2ATNP DS    A              /* @ OF ATTN ROUTINE          @E1213F3*/  02502500
TMP2PARM DS    F              /* INDICATE WHETHER PARAMETER IS          02506000
*                                      GOOD OR BAD          @E1213F3*/  02509500
TMP2SA@  DS    A              /* PTR TO KEY 1 SAVE AREA     @E1213F3*/  02513001
TMP2TIB@ DS    A              /* TIB @ USED BY IKJEFT02     @E1213F3*/  02516501
TMP2ATIB DS    A              /* THE @ OF ACTIVE TIB        @E1213F3*/  02520001
TMP2MECB DS    A              /* @ OF TMP2MECB IN WRKA1     @E1213F3*/  02523501
TMP2AECB DS    A              /* @ OF TMP1ECB2 IN WRKA1     @E1213F3*/  02527001
TMPW1LEN DS    F              /* LENGTH OF TMPWRKA1         @E1213F3*/  02530501
TMPW2LEN DS    F              /* LENGTH OF TMPWA            @E1213F3*/  02534001
TMPBUFF@ DS    F              /* BUFFER @ OBTAINED BY       @E121324*/  02537501
*                             /* IKJEFT02                   @E121324*/  02541001
TMP2PPTR DS    A              /* THE PTR TO ITS OWN PURGE PARM LIST     02544500
*                                                           @E1213F3*/  02548001
TMP2PLEN DS    F              /* LENGTH OF RESTORE PARM AND PURGE       02551500
*                                PARM LIST TO GET AND FREE  @E1213F3*/  02555001
TMP2NAME DS   CL8             /* NAME OF TMPWRKA2           @E1213F3*/  02558501
TMP2LEV  DS   CL4             /* LEVEL OF TMPWRKA2          @E1213F3*/  02562001
TMP2FFLG DS   0CL56           /* FLAGS USED FOR DEBUGGING AND           02565500
*                                RECOVERY PURPOSES          @E1213F3*/  02569001
TMP2DBUG DS   0CL4            /* TRACE OF FUNCTIONS PERFORMED WHICH     02572500
*                                CAN BE USED FOR DEBUGGING  @E1213F3*/  02576001
TMP2TSFG DS   CL1                   /* FLAGS USED TO INDICATE WHAT      02579500
*                                      FUNCTION WAS PERFORMED BY        02583000
*                                      IKJEFTSC             @E1213F3*/  02586500
TMP2PUR  EQU   X'80'                /* PURGE IS DONE        @E1213F3*/  02590000
TMP2STAT EQU   X'40'                /* STATUS STOP DONE     @E1213F3*/  02593500
TMP2WAIT EQU   X'10'                /* WAIT IS DONE         @E1213F3*/  02597000
TMP2POST EQU   X'08'                /* POST IS DONE         @E1213F3*/  02600500
TMP2W1ST EQU   X'04'                /* BUILD TMPWRKA1       @E1213F3*/  02604000
TMP2WA2S EQU   X'02'                /* BUILD TMPWA2         @E1213F3*/  02607500
TMP2W2ST EQU   X'01'                /* BUILD TMPWRKA2       @E1213F3*/  02611000
T2FLGT08 DS    CL1                  /* FLAG FOR IKJEFT08    @E1213F3*/  02614500
TMP2NPAR EQU   X'80'                /* NO PARALLEL TMP      @E1213F3*/  02618000
TMP2VFPR DS    CL1                  /* TSF PARAMETER VERIFICATION       02621500
*                                      ROUTINE FOOTPRINT                02625000
*                                      (IKJEFTPV)           @E1213F3*/  02628500
TMP2READ EQU   X'80'                /* READING PARAMTERS    @E1213F3*/  02632000
TMP2WRIT EQU   X'40'                /* WRITING PARAMETERS   @E1213F3*/  02635500
TMP2MAIN EQU   X'20'                /* MAINLINE             @E1213F3*/  02639000
TMP2PAGE EQU   X'10'                /* READING FUNCTION BUFF@E1213F3*/  02642500
TMP2PGM  EQU   X'08'                /* READING PGMPARMS     @E1213F3*/  02646000
TMP2CODE EQU   X'04'                /* SETTING RETURN CODES @E1213F3*/  02649500
TMP2TPVR EQU   X'02'                /* RESERVED             @E1213F3*/  02653000
TMP2DONE EQU   X'01'                /* IKJEFTPV DONE        @E1213F3*/  02656500
TMPFLG1  DS    CL1                  /* USED BY T02          @E1213F3*/  02660000
TMPARALL EQU   X'80'           /*PARALLEL TMP ENVIRONMENT   @E121324*/  02663500
TMPAPFCK EQU   X'40'          /* TSRCHAPF HAS BEEN CALLED   @E1213F3*/  02667000
TMPLOAD  EQU   X'20'          /* LOAD WAS ISSUED            @E121324*/  02670500
DIDCALL  EQU   X'10'          /* CALL HAS BEEN PERFORMED BY @E121324*/  02674000
*                             /* THE PARALLEL TMP           @E121324*/  02677500
R1PGMLST EQU   X'08'          /* PGM THRU SVC, R1 SET TO    @E121324*/  02681000
*                             /* PARAMETER LIST FOR PROGRAM @E121324*/  02684500
TMPDETCH EQU   X'04'          /* IKJEFTP2 IS DETACHING      @YA34525*/  02688000
TMPRESV7 EQU   X'02'          /* RESERVED                   @E121324*/  02691500
TMPRESV8 EQU   X'01'          /* RESERVED                   @E121324*/  02695000
TMP2RCOV DS    0CL52          /* FLAGS USED BY RECOVERY     @E1213F3*/  02698500
TMP2MCTL DS    CL2            /* MODULE IN CONTROL FLAGS, SET BY        02702000
*                                ALL TMP MODULES THAT ARE IN            02705500
*                                CONTROL                    @E1213F3*/  02709000
TMP2MT01 EQU   X'8000'         /* IKJEFT01 IN CONTROL       @E1213F3*/  02712500
TMP2MTSC EQU   X'4000'         /* IKJEFTSC IN CONTROL       @E1213F3*/  02716000
TMP2MT02 EQU   X'2000'         /* IKJEFT02 IN CONTROL       @E1213F3*/  02719500
TMP2MTPV EQU   X'1000'         /* IKJEFTPV IN CONTROL       @E1213F3*/  02723000
TMP2MT08 EQU   X'0800'         /* IKJEFT08 IN CONTROL       @E1213F3*/  02726500
TMP2MCAF EQU   X'0400'         /* IKJCAF   IN CONTROL       @E2367S4*/  02730000
TMP2FCTL DS    0CL8            /* MODULAR FUNCTION IN CONTROL, SET      02733500
*                                 BY ALL TMP MODULES THAT ARE IN        02737000
*                                 CONTROL                   @E1213F3*/  02740500
TMP2FT01 DS    CL1              /* IKJEFT01 FUNCTION IN CONTROL         02744000
*                                                           @E1213F3*/  02747501
TMP2FI01 EQU   X'80'            /* IKJEFT01 INITIALIZATION  @E1213F3*/  02751001
TMP2FTM1 EQU   X'40'            /* IKJEFT01 TERMINATION     @E1213F3*/  02754501
TMP2FTSC DS    CL1               /* IKJEFTSC FUNCTION IN CONTROL        02758000
*                                                           @E1213F3*/  02761501
TMP2FISC EQU   X'80'             /* IKJEFTSC INITIALIZATION @E1213F3*/  02765001
TMP2FBSC EQU   X'40'             /* IKJEFTSC IN CONTROL AFTER WAIT OF   02768500
*                                   TIBRECB AND BEFORE TERMINATION      02772000
*                                   CODE                    @E1213F3*/  02775501
TMP2FTMC EQU   X'20'             /* IKJEFTSC TERMINATION    @E1213F3*/  02779001
TMP2FT02 DS    CL1               /* IKJEFT02 FUNCTION IN CONTROL        02782500
*                                                           @E1213F3*/  02786001
TMP2FTPV DS    CL1               /* IKJEFTPV FUNCTION IN CONTROL        02789500
*                                                           @E1213F3*/  02793001
TMP2FSUV EQU   X'80'             /* IKJEFTPV SYSTEM/USER FUNCTION,      02796500
*                                   ON IF USER AND OFF IF SYSTEM        02800000
*                                                           @E1213F3*/  02803501
TMP2FT08 DS    CL1               /* IKJEFT08 FUNCTION IN CONTROL        02807000
*                                                           @E1213F3*/  02810501
RESERVE5 DS    CL(3)            /* RESERVED                 @E1213F3*/  02814001
TMP2FLRC DS    CL2               /* SET BY IKJEFT05 (RECOVERY) TO       02817500
*                                   INDICATE THE RETRY TARGET CODE      02821000
*                                   (FIRST LEVEL)           @E1213F3*/  02824501
TMP2FLI1 EQU   X'8000'           /*IKJEFT01 INITIALIZATION  @E1213F3*/  02828001
TMP2FLIC EQU   X'4000'           /*IKJEFTSC INITIALIZATION  @E1213F3*/  02831501
TMP2FLBC EQU   X'2000'           /* IKJEFTSC AFTER WAIT FOR PARALLEL    02835000
*                                   SIDE FOR CLEANUP        @E1213F3*/  02838501
TMP2FL02 EQU   X'1000'           /* IKJEFT02                @E1213F3*/  02842001
TMP2FLTV EQU   X'0800'           /* IKJEFTPV TERMINATION    @E1213F3*/  02845501
TMP2TSFR EQU   X'0400'           /* PARALLEL IKJEFT02       @E2367S4*/  02849001
TMP2SLRC DS    CL2               /* SET BY IKJEFT05 (RECOVERY) TO       02852500
*                                   INDICATE CAUSES FOR A PREVIOUS      02856000
*                                   RETRY TO IKJEFT01                   02859500
*                                   (SECOND LEVEL)          @E1213F3*/  02863001
TMP2SL01 EQU   X'8000'           /* IKJEFT01                @E1213F3*/  02866501
TMP2SLIC EQU   X'4000'           /* IKJEFTSC INITIALIZATION @E1213F3*/  02870001
TMP2SLBC EQU   X'2000'           /* IKJEFTSC AFTER FIRST ATTACH OF      02873500
*                                   IKJEFT02                @E1213F3*/  02877001
TMP2SL02 EQU   X'1000'           /* IKJEFT02                @E1213F3*/  02880501
TMP2SL08 EQU   X'0800'           /* IKJEFT08                @E1213F3*/  02884001
TMP2SLPV EQU   X'0400'           /* IKJEFTPV                @E1213F3*/  02887501
TMP2FAIL DS    CL2              /* SET ON BY IKJEFT05 (RECOVERY) TO     02891000
*                                   INDICATE FAILURE IN A SPECIFIC      02894500
*                                   TMP MODULE. TMP MODULES USE FLAG    02898000
*                                   TO RESET RECURSION FLAGS.           02901500
*                                                           @E1213F3*/  02905001
TMP2DMPF EQU   X'8000'           /* SET BE IKJEFT05 TO INDICATE         02908500
*                                   THAT A SETRP DUMP IS TO BE          02912000
*                                   TAKEN                   @E2267H1*/  02915501
TMP2TSCF EQU   X'4000'           /* IKJEFTSC FAILED         @E1213F3*/  02919001
TMP2T02F EQU   X'2000'           /* IKJEFT02 FAILED         @E1213F3*/  02922501
T2T8T9F  EQU   X'1000'           /* T08 T09 ATTACH FAIL     @ZTS0162*/  02926001
TMP2RTRY DS    0CL20             /* SET BY IKJEFT01 AND IKJEFT02 TO     02929500
*                                   INDICATING ADDRESSES OF RETRY       02933000
*                                   CODE.  IKJEFT05 WILL USE THESE      02936500
*                                   ADDRESSES IN ORDER TO RETRY         02940000
*                                                           @E1213F3*/  02943501
TMP2RBSC DS    A              /* BEGINNING OF IKJEFTSC, SET             02947000
*                                   BY IKJEFT01             @E1213F3*/  02950501
TMP2RWSC DS    A                 /* AFTER WAIT BEFORE TERMINATION       02954000
*                                   CODE IN IKJEFTSC, SET BY            02957500
*                                   IKJEFT01                @E1213F3*/  02961001
TMP2RW02 DS    A                 /* AFTER WAIT ON TIBRECB: SET BY       02964500
*                                   IKJEFT02                @E1213F3*/  02968001
TMP2RT02 DS    A                 /* TERMINATION CODE IN IKJEFT02        02971500
*                                   IN ORDER TO RETURN TO IKJEFT01 FOR  02975000
*                                   A RETRY, SET BY IKJEFT02            02978500
*                                                           @E1213F3*/  02982001
TMP2RTPV DS    A                 /* TERMINATION CODE IN IKJEFTPV        02985500
*                                   IN ORDER TO RETURN TO IKJEFTSC,     02989000
*                                   SET BY IKJEFT02         @E1213F3*/  02992501
TMP2MRG1 DS    0CL16             /* FIRST GROUP OF POINTERS TO MODULE   02996000
*                                   SAVEAREAS - SEE TMP2MRG2 FOR THE    02999500
*                                   REMAINING POINTERS                  03003000
*                                                                       03006500
*                                   EACH TMP MODULE STORE ADDRESS TO    03010000
*                                   ITS REGISTERS SO IKJEFT05 CAN       03013500
*                                   ESTABLISH ADDRESSABILITY DURING     03017000
*                                   A RETRY                 @ZA85291*/  03020501
TMP2RG01 DS    A                 /* ADDRESS IKJEFT01'S REGISTERS        03024000
*                                                           @E1213F3*/  03027501
TMP2RGSC DS    A                 /* ADDRESS IKJEFTSC'S REGISTERS        03031000
*                                                           @E1213F3*/  03034501
TMP2RG02 DS    A                 /* ADDRESS IKJEFT02'S REGISTERS        03038000
*                                                           @E1213F3*/  03041501
TMP2RGPV DS    A                 /* ADDRESS IKJEFTPV'S REGISTERS        03045000
*                                                           @E1213F3*/  03048501
TMP2RET@ DS    A                 /* TO INDICATE RETRY ADDRESS ON SETRP  03052000
*                                  MACRO ISSUED IN IKJEFT05 @E1213F3*/  03055501
TMP2SR14 DS    A                 /* USED BY RECOVERY ROUTINE TO SAVE    03059000
*                                  RETURN POINT WHEN IT DOES A CALL     03062500
*                                  TO A SUBROUTINE.         @E1213F3*/  03066001
TMP2TSC2 DS    CL1               /* FLAG NEEDED BY TSC                  03069500
*                                                           @E1213F3*/  03073001
TMP2CLR  EQU   X'80'             /* FLAGS NEEDED USED BY TSC TO         03076500
*                                   INDICATE WHAT IS DONE TO INITIATE   03080000
*                                   PARALLEL SIDE           @E1213F3*/  03083501
TMP2REC EQU    X'40'             /* INDICATE RETRY TO IKJEFT01          03087000
*                                                           @E1213F3*/  03090501
TMP2SRCT EQU   X'20'             /* INDICATE TIB IS TO BE UPDATED BY    03094000
*                                    RECOVERY               @ZTY0256*/  03097501
TMP2INIT EQU   X'10'             /* INDICATE T01 GOT CONTROL FROM       03101000
*                                    RECOVERY               @ZTY0336*/  03104501
TMP2RINT EQU   X'08'             /* RESTART REXX            @PEI0701*/  03108001
          DS    CL3               /* RESERVE                @E1213F3*/  03111501
TMP2TAIE  DS    A                 /* PTR TO TAIE USED BY IKJEFT02       03115000
*                                                           @ZTS0254*/  03118501
TMP2TSP   DS    A                /* PTR TO IKJTSP MAPPING MACRO         03122000
*                                                           @E2267H1*/  03125501
TMP2TP2W  DS    A                /* PTR TO SHARED DYNAMIC AREA BETWEEN  03129000
*                                   IKJEFT02 AND IKJEFTP2   @E2267H1*/  03132501
TMP2CAFP  DS    A                /* PTR TO IKJCAFPL PARAMETER LIST      03136000
*                                                           @E2367S4*/  03139501
TMP2MRG2 DS    0CL4              /* SECOND GROUP OF POINTERS TO         03143000
*                                   MODULE SAVEAREAS                    03146500
*                                                                       03150000
*                                   EACH TMP MODULE STORES THE ADDRESS  03153500
*                                   OF ITS REGISTERS SO IKJEFT05 CAN    03157000
*                                   ESTABLISH ADDRESSABILITY DURING     03160500
*                                   A RETRY                 @ZA85291*/  03164001
TMP2RGP2 DS    A                 /* ADDRESS IKJEFTP2'S REGISTERS        03167500
*                                                           @ZA85291*/  03171001
TMP2TPSA DS    CL72              /* IKJEFTP2'S PROTECTED SAVEAREA       03174500
*                                   PASSED BY IKJEFT02      @ZA96882*/  03178001
TMP2TPS2 DS    CL72              /* IKJEFTP2'S PROTECTED SAVEAREA       03181500
*                                   USED BY TP2 TO CALL ITS OWN         03185000
*                                   PROCEDURES.              @ZA96882*/ 03188501
T3PARMS  DS    0D                /* PARAMETER LIST PASSED TO ATTENTION  03192000
*                                   ROUTINE IKJEFT03.        @ZA96882*/ 03195500
T3TAIE@  DS    A                 /* ADDRESS OF THE TAIE      @ZA96882*/ 03199000
         DS    A                 /* NOT USED                 @ZA96882*/ 03202500
T3WKPTR2 DS    A                 /* ADDRESS OF TMPWRKA2      @ZA96882*/ 03206000
STAXPPTR DS    F                 /* ADDRESS OF STAX PARM LIST@ZA96882*/ 03209500
SYNCHSP  DS    CL16              /* SYNCH PARM LIST          @ZA96882*/ 03213000
TMP2TPS3 DS    CL72              /* IKJEFTP2'S ADDITIONAL PROTECTED     03216500
*                                   SAVEAREAS USED BY TP2 TO CALL       03220000
*                                   ITS OWN PROCEDURES       @ZA97523*/ 03223500
TMP2T08S DS    CL72              /* IKJEFT08'S PROTECTED SAVEAREA       03227000
*                                   USED BY T02 TO FOR LINK             03230500
*                                                            @E21D2G9*/ 03234000
SAVLNKN  DS     F                /* FOR IKJEFT08             @E21D2G9*/ 03237500
**********************************************************************  03241000
*      THE FOLLOWING ARE FOR IKJEFTP2 LINKS TO IRXESTK1      @E21D2G9*  03244500
**********************************************************************  03248000
TMP2FUN@ DS    A                 /* ADDRESS OF IRXESTK1 FUNCTION        03251500
*                                                            @E21D2G9*/ 03255000
TMP2DAT@ DS    A                 /* ADDRESS OF POINTER TO IRXESTK1      03258500
*                                   DATA                     @E21D2G9*/ 03262000
TMP2DAL@ DS    A                 /* ADDRESS OF IRXESTK1 DATA LENGTH     03265500
*                                                            @E21D2G9*/ 03269000
TMP2FUNC DS    F                 /* IRXESTK1 FUNCTION        @E21D2G9*/ 03272500
TMP2DATA DS    A                 /* IRXESTK1 DATA STACK ELEMENT ADDRESS 03276000
*                                                            @E21D2G9*/ 03279500
TMP2DATL DS    F                 /* IRXESTK1 DATA STACK ELEMENT LENGTH  03283000
*                                                            @E21D2G9*/ 03286500
**********************************************************************  03290000
*      THE FOLLOWING ARE FOR IKJEFT08 LINKS TO IRXESTK1      @E21D2G9*  03293500
**********************************************************************  03297000
TMP2FU@2 DS    A                 /* ADDRESS OF IRXESTK1 FUNCTION        03300500
*                                                            @E21D2G9*/ 03304000
TMP2DA2@ DS    A                 /* ADDRESS OF POINTER TO IRXESTK1      03307500
*                                   DATA                     @E21D2G9*/ 03311000
TMP2DL2@ DS    A                 /* ADDRESS OF IRXESTK1 DATA LENGTH     03314500
*                                                            @E21D2G9*/ 03318000
TMP2FUN2 DS    F                 /* IRXESTK1 FUNCTION        @E21D2G9*/ 03321500
TMP2DAT2 DS    A                 /* IRXESTK1 DATA STACK ELEMENT ADDRESS 03325000
*                                                            @E21D2G9*/ 03328500
TMP2DAL2 DS    F                 /* IRXESTK1 DATA STACK ELEMENT LENGTH  03332000
*                                                            @E21D2G9*/ 03335500
**********************************************************************  03339000
TMP2PRO1 DS    F                 /* FUNCTION TO BE PASSED TO IRXESTK1   03342500
*                                                            @PEI0432*/ 03346000
TMP2PRO2 DS    F                 /* FUNCTION TO BE PASSED TO IRXTVARS   03349500
*                                                            @PEI0432*/ 03353000
TMP2EXDP DS    A                 /* ADDRESS OF EXECDATA TO BE PASSED    03356500
*                                   TO IRXTVARS              @PEI0432*/ 03360000
SAVLNKO  DS    F                 /* FOR IKJEFT08             @PEI0432*/ 03363500
TMP2RSVD DS    F                 /* RESERVED                 @E21D2G9*/ 03367000
TMP2EDST DS   0CL24              /* Storage for IKJEFT08 subrtns        03370500
*                                   TIBENQ and TIBDEQ and IKJEFTP2      03374000
*                                   subrtns TSFENQ and                  03377500
*                                   TSFDEQ                   @YA58978*/ 03381000
TMP2ENQR DS   0CL8               /* RNAME FOR ENQUE ON                  03384500
*                                   TMP3TIBQ                 @YA58978*/ 03388000
TMP2TCBA DS    CL4               /* CONTAINS LITERAL CHARACTER          03391500
*                                   STRING 'TCBA'            @PMH0071*/ 03395000
TMP2T02A DS    F                 /* ADDRESS OF ACTIVE                   03398500
*                                   IKJEFT02 TCB             @PMH0071*/ 03402000
TMP2ENDQ DS    CL16                                       /* @PMH0057*/ 03405500
*                                /* Area for ENQ/DEQ         @PMH0057*/ 03409000
TMP2RGQ2 DS    A                 /* Address of the                      03412500
*                                   IKJEFTQ2 storage.        @E25D2JC*/ 03416000
TMP2DYDC DS    A                 /* DY DCB address           @E25D2JC*/ 03419500
TMP2T01E DS    F                 /* T01 entry indicator      @E25D2JC*/ 03423000
TMP2T5R0 DS    F                 /* Reg 0  save area for T05 @WA21212*/ 03426500
TMP2T5R1 DS    F                 /* Reg 1  save area for T05 @WA21212*/ 03430000
TMP2T5RF DS    F                 /* Reg 15 save area for T05 @WA21212*/ 03433500
TMP2T5WL DS    F                 /* len of key1 T05 dyn area @KX00014*/ 03437000
TMP2T5W1 DS    F                 /* adr of key1 T05 dyn area @KX00014*/ 03440501
         DS    CL8               /* RESERVE                  @KX00014*/ 03444000
TMP2END  DS    0D                /* ASSURE THAT THIS WORKAREA END IN    03447500
*                                   A DOUBLE WORD BOUNDARY. ANY         03451000
*                                   ADDITION TO WORKAREA SHOULD BE      03454500
*                                   PUT BEFORE TMP2END       @E1213F3*/ 03458001
TMP2ET01 EQU X'00000001'         /* Indicates that the                  03461500
*                                   IKJEFT01 entry point is             03465000
*                                   being processed.         @E25D2JC*/ 03468500
TMP2ET1A EQU X'00000002'         /* Indicates that the                  03472000
*                                   IKJEFT1A entry point is             03475500
*                                   being processed.         @E25D2JC*/ 03479000
TMP2ET1B EQU X'00000003'         /* Indicates that the                  03482500
*                                   IKJEFT1B entry point is             03486000
*                                   being processed.         @E25D2JC*/ 03489500
TMP2ET1I EQU X'0000000A'         /* Indicates that the PWS exits are    03493000
*                                   enabled                  @WA25066*/ 03496500
*  WHEN SETTING A MODULE IN CONTROL FLAG,EACH MODULE WILL HAVE A        03500000
*  SPECIFIC BIT VALUE. WHEN SETTING ONE OF THESE FLAGS, ALL OTHER       03503500
*  MODULE FLAGS WILL BE TURNED OFF                           @E1213F3   03507001
*                                /* IKJEFT01'S BIT VALUE     @E1213F3*/ 03510501
TMP2VT01 EQU X'8000'                                                    03514000
*                                /* IKJEFTSC'S BIT VALUE     @E1213F3*/ 03517501
TMP2VTSC EQU X'4000'                                                    03521000
*                                /* IKJEFT02'S BIT VALUE     @E1213F3*/ 03524501
TMP2VT02 EQU X'2000'                                                    03528000
*                                /* IKJEFTPV'S BIT VALUE     @E1213F3*/ 03531501
TMP2VTPV EQU X'1000'                                                    03535000
*                                /* IKJEFT08'S BIT VALUE     @E1213F3*/ 03538501
TMP2VT08 EQU X'0800'                                                    03542000
         MEND                                                           03545500
                                                                        03550000
*%TMPWABSL: ;                                                           03551400
* /* INCLUDE MAPPING MACROS FOR PARAMETER LISTS AND BLOCKS           */ 03552800
*                                                                       03554200
*/*                                                                 */  03555600
*/*******************************************************************/  03557000
*/* TO EXCLUDE THE MAPPING OF TMPWRKA1 THE FOLLOWING MUST   @E1213F3*/  03558400
*/*     BE DONE:                                            @E1213F3*/  03559800
*/*         1) WORKA1 MUST BE INITIALIZED TO CONTAIN A NON- @E1213F3*/  03561200
*/*                   BLANK                                 @E1213F3*/  03562600
*/*             A) THIS WILL EXCLUDE ALL MAPPING REFERENCING@E1213F3*/  03564000
*/*                FIELD IN TMPWRKA1                        @E1213F3*/  03565400
*/*         2) SKIPW1  MUST BE INITIALIZED TO CONTAIN A NON-@E1213F3*/  03566800
*/*                   BLANK                                 @E1213F3*/  03568200
*/*             A) THIS WILL EXCLUDE THE MAPPING FOR        @E1213F3*/  03569600
*/*                TMPWRKA1                                 @E1213F3*/  03571000
*/*******************************************************************/  03572400
* %IF WORKA1 ^='' %THEN                 /*                  @E1213F3*/  03573801
*  %GOTO WRKA2;                         /*                  @E1213F3*/  03575200
* %INCLUDE SYSLIB(IKJDAPL);                                             03576600
* %INCLUDE SYSLIB(IKJDAP08);                                            03578000
* /* MAPPING MACRO FOR CPPL                                          */ 03579400
* %  INCLUDE  SYSLIB(IKJCPPL);                                          03580800
* /* MAPPING MACRO FOR CSPL                                          */ 03582200
* %  INCLUDE  SYSLIB(IKJCSPL);                                          03583600
* /* MAPPING MACRO FOR CSOA                                          */ 03585000
* %  INCLUDE  SYSLIB(IKJCSOA);                                          03586400
* %  INCLUDE  SYSLIB(IKJECT);                                           03587800
* /* MAPPING MACRO FOR IOPL                                          */ 03589200
* %  INCLUDE  SYSLIB(IKJIOPL);                                          03590600
* /* MAPPING MACRO FOR GTPB                                          */ 03592000
* %  INCLUDE  SYSLIB(IKJGTPB);                                          03593400
* /* MAPPING MACRO FOR PGPB                                          */ 03594800
* %  INCLUDE  SYSLIB(IKJPGPB);                                          03596200
* /* MAPPING MACRO FOR PTPB                                          */ 03597600
* %  INCLUDE  SYSLIB(IKJPTPB);                                          03599000
* %  INCLUDE  SYSLIB(IKJSTPB);                                          03600400
* /* MAPPING MACRO FOR PSCB                                          */ 03601800
* %  INCLUDE  SYSLIB(IKJPSCB);                                          03603200
* %  INCLUDE  SYSLIB(IEZATTCH);                                         03604600
* /* MAPPING MACRO FOR LSD                                           */ 03606000
* %  INCLUDE  SYSLIB(IKJLSD);                                           03607400
* /* MAPPING MACRO FOR EXEC DB                                       */ 03608800
* % IKJECDA = 'NO';                                                     03610200
* % IKJCOMP = 'NO';                                                     03611600
* % IKJNTAB = 'NO';                                                     03613000
* % IKJVTAB = 'NO';                                                     03614400
* % IKJCVMAP = 'NO';                                                    03615800
*@LISTPUSH;                                                             03617200
*@LISTOFF;                                                              03618600
* %  INCLUDE  SYSLIB(IKJEXEC);                                          03620000
*@LISTPOP;                                                              03621400
* %  /* PARAMETERIZATION VALUES FOR DCB MAPPING MACRO                */ 03622800
*    INCLUDE  SYSLIB(IHADCBDF);                                         03624200
* %  DSORGPO = 1;                                                       03625600
* %  DEVDDA = 1;                                                        03627000
* %  INCLUDE  SYSLIB(IHADCB);                                           03628400
* %IF SKIPPPL = 'YES' %THEN                  /* SHOULD IKJPPL BE        03629800
*                                               INCLUDED     @PBY0271*/ 03631200
*  %GOTO PPLSKIP;                            /* NO SKIP IT   @PBY0271*/ 03632600
* %INCLUDE SYSLIB(IKJPPL);                                              03634000
* %PPLSKIP:  ;                               /* LABEL TO SKIP IKJPPL    03635400
*                                                            @PBY0271*/ 03636800
* %INCLUDE SYSLIB(IKJSTPL);                                             03638200
*@EJECT;                                                                03639600
*                                                                       03641000
*                                                                       03642400
* DECLARE                                                               03643800
*   /* ABEND ERROR CODE AND ERROR MESSAGE AREA                       */ 03645200
*   1 ABMSGAR  CHAR(41) BDY(DWORD) BASED,    /* NAME OF MESSAGE AREA    03646600
*                                                            @YA25427*/ 03648000
*     2 MSGBASE  CHAR(25) BDY(DWORD),        /* BASIC MESSAGE AREA   */ 03649400
*       3 *      CHAR(12) BDY(DWORD),        /* SPACER               */ 03650800
*         4 CVDAR  CHAR(8) BDY(DWORD),       /* DECIMAL CONVERSION   */ 03652200
*       3 ABNDCD PTR(31) BDY(WORD),          /* ABEND CODE RECEIVER  */ 03653600
*         4 ABNDCDA CHAR(4) BDY(WORD),       /* ABEND CODE (CHARS)   */ 03655000
*     2 * CHAR(3),                           /* SPACER           @L1A*/ 03656400
*     /* ABEND SUBCODE AND ERROR MESSAGE AREA                        */ 03657800
*     2 SUBCDAR CHAR(13) BDY(WORD), /* NAME OF MESSAGE AREA  @YA25427*/ 03659200
*       3 SUBCDBI  CHAR(5) BDY(WORD),    /* UNPK SOURCE FIELD    @L1C*/ 03660600
*         4 SUBCDRS CHAR(4) BDY(WORD),   /* ERROR SUBCODE AREA   @L1C*/ 03662000
*                                                                       03663400
*   /* THE FOLLOWING DEFINITIONS REDEFINE THE ABMSGAR STRUCTURE  @L1A*/ 03664800
*   1 * DEFINED(MSGBASE) BDY(DWORD),         /* REDEFINE LWR LVL @L1A*/ 03666200
*     2 * CHAR(5) BDY(DWORD),                /* SPACER           @L1C*/ 03667600
*     2 USRCDEC CHAR(4),                     /* CONVERSION AREA  @L1C*/ 03669000
*     2 * CHAR(5),                           /* SPACER           @L1C*/ 03670400
*     2 USRCDBI  PTR(15) BDY(HWORD),         /* USER CODE AREA   @L1C*/ 03671800
*     2 HOLCHAR  CHAR(1),                    /* WORK AREA        @L1C*/ 03673200
*   1 * DEFINED(MSGBASE) BDY(DWORD),         /* REDEFINE LWR LVL @L1A*/ 03674600
*     2 * CHAR(13) BDY(DWORD),               /* SPACER           @L1A*/ 03676000
*     2 SYSCDAR CHAR(3),                     /* SYSTEM CODE AREA @L1C*/ 03677400
*   1 * DEFINED(MSGBASE) BDY(DWORD),         /* REDEFINE LWR LVL @L1A*/ 03678800
*     2 ABMLEN  PTR(15) BDY(DWORD),          /* MESSAGE LENGTH   @L1C*/ 03680200
*     2 ABMOFF  PTR(15) BDY(HWORD),          /* OFFSET TO TEXT   @L1C*/ 03681600
*     2 TRUMSG  CHAR(21),                    /* WHOLE TEXT AREA  @L1C*/ 03683000
*       3 MSGTXT CHAR(16),                   /* BASE TEXT AREA   @L1C*/ 03684400
*       3 TYPAR CHAR(1),                     /* ABEND TYPE AREA  @L1C*/ 03685800
*       3 L1AP1 CHAR(1),                     /* NEXT BYTE        @L1A*/ 03687200
*   1 * DEFINED(TYPAR),                      /* REDEFINE LWR LVL @L1A*/ 03688600
*     2 CODEAR CHAR(6),                      /* ERROR CODE AREA  @L1C*/ 03690000
*   1 * DEFINED(L1AP1),                      /* REDEFINE LWR LVL @L1A*/ 03691400
*     2 VALAR6 CHAR(6),                      /* CONVERSION AREA  @L1C*/ 03692800
*       3 VALAR CHAR(3),                     /* CONVERTED CODE   @L1C*/ 03694200
*   1 * DEFINED(SUBCDAR) BDY(WORD),          /* REDEFINE LWR LVL @L1A*/ 03695600
*     2 SUBCLEN  PTR(15) BDY(WORD),          /* SUBCODE MESSAGE LENGTH  03697000
*                                                                @L1C*/ 03698400
*     2 SUBCOFF  PTR(15) BDY(HWORD),         /* SUBCODE MSG OFFSET      03699800
*                                                                @L1C*/ 03701200
*     2 SUBCAR   CHAR(9) BDY(BYTE),          /* UNPACK TARGET FIELD     03702600
*                                                                @L1C*/ 03704000
*       3 SUBCTXT  CHAR(8) BDY(BYTE),        /* TRANSLATION TARGET      03705400
*                                                                @L1C*/ 03706800
*                                                                       03708200
*   /* PARSE RETURN CODE HOLD AND MESSAGE SEGMENT AREA               */ 03709600
*   1 PRSMAR  CHAR(12) BDY(DWORD) BASED,  /* NAME OF AREA            */ 03711000
*     2 PRSMCVA  CHAR(8) BDY(DWORD),  /* CONVERSION AREA             */ 03712400
*       3 PRSMSAV  CHAR(4) BDY(DWORD),  /* HOLD AREA(CHAR)           */ 03713800
*         4 PARSRC  PTR(32),          /* HOLD PARSE RETURN CODE      */ 03715200
*           5 PRSMLEN  PTR(15),       /* SEGMENT LENGTH              */ 03716600
*           5 PRSMOFF  PTR(15),       /* SEGMENT OFFSET              */ 03718000
*   /* THE FOLLOWING DEFINITIONS REDEFINE THE PRSMAR STRUCTURE   @L1A*/ 03719400
*   1 * DEFINED(PRSMAR),                     /* REDEFINE LWR LVL @L1A*/ 03720800
*     2 * CHAR(4),                           /* SPACER           @L1A*/ 03722200
*     2 PRSMVAL CHAR(6),                     /* TEXT AREA        @L1C*/ 03723600
*       3 PRSMTXT CHAR(4),                   /* SEGMENT TEXT     @L1C*/ 03725000
*   1 * DEFINED(PRSMAR),                     /* REDEFINE LWR LVL @L1A*/ 03726400
*     2 * CHAR(5),                           /* SPACER           @L1A*/ 03727800
*     2 PRSMDEC CHAR(4),                     /* DECIMAL AREA     @L1C*/ 03729200
*@EJECT;                                                                03730600
*                                                                       03732000
*                                                                       03733400
*   /* TMP MAPPING OF DYNAMIC ALLOCATION PARAMETER BLOCKS            */ 03734800
*   1 DYNAPARM  BDY(WORD) BASED(DYNAPPTR),                              03736200
*     2 DYNARBP  CHAR(4),             /* PTR TO REQUEST BLOCK        */ 03737600
*     2 DYNARB   CHAR(20),            /* DYNALLOC REQUEST BLOCK      */ 03739000
*     2 DYNATUP  CHAR(4),             /* PTR TO TEXT UNIT            */ 03740400
*     2 DYNATU,                       /* TEXT UNIT:          @PID0180*/ 03741800
*       3 DYNATUK  CHAR(2),           /*   TEXT UNIT KEY     @PID0180*/ 03743200
*       3 DYNATUN  FIXED(15),         /*   TEXT UNIT NUM     @PID0180*/ 03744600
*       3 DYNATUL  FIXED(15),         /*   TEXT UNIT LEN     @PID0180*/ 03746000
*       3 DYNATUD  CHAR(4),           /*   TEXT UNIT PARM    @PID0180*/ 03747400
*       3 *        CHAR(2),           /* BACK ON FWD BDY     @PID0180*/ 03748800
*                                                                       03750200
*   /* MASK FOR CPPL POINTERS                                        */ 03751600
*   1 CPPLRF  CHAR(LENGTH(CPPL)) DEFINED(CPPL),  /* NAME OF AREA     */ 03753000
*     2 *      PTR(31),               /* RESERVED                    */ 03754400
*     2 CPPLPS  CHAR(12),             /* POINTER AREA                */ 03755800
*                                                                       03757200
*   /* MASK FOR TPL POINTERS                                         */ 03758600
*   1 TPLRF  CHAR(LENGTH(TPL)) DEFINED(TPL),  /* NAME OF AREA        */ 03760000
*     2 *      PTR(31),               /* RESERVED                    */ 03761400
*     2 TPLPS  CHAR(12),              /* POINTER AREA                */ 03762800
*                                                                       03764200
*   /* DCB FLAG FIELD -- OPEN FLAG                                   */ 03765600
*   1 TDCBFLGS  DEFINED(DCBOFLGS) BDY(BYTE),  /* DCB FLAGS           */ 03767000
*     2 *       BIT(3),             /* SPACER                        */ 03768400
*       2 DCBOPEN BIT(1),           /* DCB OPEN FLAG                 */ 03769800
*                                                                       03771200
*   /* I/0 SERVICE ROUTINES LIST -- 1ST ELEMENT                      */ 03772600
*   TIOSRL  PTR(31) BASED(ECTIOWA),   /* NAME OF IOSRL AREA          */ 03774000
*                                                                       03775400
*   /* MAPPING OF TOP ELEMENT OF STACK                               */ 03776800
*   1 TOPSTKL  BDY(WORD) BASED(TIOSRL),  /* NAME OF AREA             */ 03778200
*     2 *        CHAR(4) BDY(WORD),   /* RESERVED                    */ 03779600
*       3 *        CHAR(1),           /* RESERVED                    */ 03781000
*         4 *        BIT(4),          /* RESERVED                    */ 03782400
*         4 XECNOW   BIT(1),          /* CLIST MODE FLAG             */ 03783800
*         4 *        BIT(2),          /* RESERVED                    */ 03785200
*       3 STLLSDP  PTR(24),           /* PTR TO LSD                  */ 03786600
*         4 LSDPTR  PTR(24);          /* PTR TO LSD                  */ 03788000
*                                                                       03789400
* /* MAPPING MACRO FOR GETMAIN                                       */ 03790800
* ?  GETMAIN   MF(L,MDLGML,BASED BDY(WORD));                            03792200
*                                                                       03793600
* /* MAPPING MACRO FOR FREEMAIN                                      */ 03795000
* ?  FREEMAIN   MF(L,MDLFML,BASED BDY(WORD));                           03796400
* @EJECT;                                                               03797800
*                                                                       03799200
*                                                                       03800600
* DECLARE                                                               03802000
*   /* DEFINE REGISTER 13                                            */ 03803400
*   R13  PTR(31) REG(13) RSTD;                                          03804800
*                                                                       03806200
*   /* ENQ PARAMETER LIST MASK                                       */ 03807600
*?  ENQ  LS(1) MF(L,STYNQL,BASED(R1));                                  03809000
*                                                                       03810400
*   /* DEQ PARAMETER LIST MASK                                       */ 03811800
*?  DEQ  LS(1) MF(L,STYDQL,BASED(R1));                                  03813200
*                                                                       03814600
*                                                                       03816000
* /* MAPPINGS OF LINKAGE SAVE AREA                                   */ 03817400
* DECLARE                                                               03818800
*   /* CURRENT POINTERS                                              */ 03820200
*   1 CURPTRS  BASED(R13),           /* NAME OF CURRENT AREA         */ 03821600
*     2 *         PTR(31),           /* *                            */ 03823000
*     2 SAVRBAK   PTR(31),           /* CURRENT BACKWARD POINTER     */ 03824400
*     2 SAVRFOR   PTR(31),           /* CURRENT FORWARD POINTER      */ 03825800
*                                                                       03827200
*   /* SAVE AREA                                                     */ 03828600
*   1 SAVARY  BASED(SAVRBAK),        /* NAME OF AREA                 */ 03830000
*     2 *         PTR(31),           /* *                            */ 03831400
*     2 SR13BAK   PTR(31),           /* BACKWARD LINK AREA POINTER   */ 03832800
*     2 SR13FOR   PTR(31),           /* FORWARD LINK AREA POINTER    */ 03834200
*     2 REG14     PTR(31),           /* SAVED REGISTER 14            */ 03835600
*     2 REG15     PTR(31),           /* SAVED REGISTER 15            */ 03837000
*     2 REG0      PTR(31),           /* SAVED REGISTER 0             */ 03838400
*     2 REG1      PTR(31),           /* SAVED REGISTER 1             */ 03839800
*     2 REG2      PTR(31),           /* SAVED REGISTER 2             */ 03841200
*     2 REG3      PTR(31),           /* SAVED REGISTER 3             */ 03842600
*     2 REG4      PTR(31),           /* SAVED REGISTER 4             */ 03844000
*     2 REG5      PTR(31),           /* SAVED REGISTER 5             */ 03845400
*     2 REG6      PTR(31),           /* SAVED REGISTER 6             */ 03846800
*     2 REG7      PTR(31),           /* SAVED REGISTER 7             */ 03848200
*     2 REG8      PTR(31),           /* SAVED REGISTER 8             */ 03849600
*     2 REG9      PTR(31),           /* SAVED REGISTER 9             */ 03851000
*     2 REG10     PTR(31),           /* SAVED REGISTER 10            */ 03852400
*     2 REG11     PTR(31),           /* SAVED REGISTER 11            */ 03853800
*     2 REG12     PTR(31);           /* SAVED REGISTER 12            */ 03855200
*@EJECT;                                                                03856600
*%WRKA2:    ;                        /*                      @E1213F3*/ 03858000
* /******************************************************************/  03859400
* /* TMPWRKA2 -- TMP SUPERVISOR STATE DYNAMIC WORK AREA             */  03860800
* /*                                                                */  03862200
* /*   THIS DYNAMIC WORK AREA  IS GOTTEN  FROM SUBPOOL 230 KEY 1,   */  03863600
* /*   BY IKJEFT01 DURING TMP INITIALIZATION.   NORMALLY IT IS NOT  */  03865000
* /*   FREED  UNTIL  END OF THE TERMINAL SESSION. OTHERS WILL BE    */  03866400
* /*   GOTTEN BY IKJEFTSC WHEN A PARALLEL T02 IS INITIATED          */  03867800
* /*   AND FREED WHEN PARALLEL T02 FINISHED IT PROCESSING.          */  03869200
* /*   SEVERITY 2 STAE RETRY  ALL OF CORE  IS FREED  AND THIS WORK  */  03870600
* /*   AREA MUST BE REINITALIZED.   THIS WORK AREA  IS  REFERENCED  */  03872000
* /*   BY ALL OF THE TMP MODULES.                                   */  03873400
* /*                                                        @E1113KJ*/  03874800
* /******************************************************************/  03876200
*                                                                       03877600
* DECLARE                                                               03879000
*   1 TMPWRKA2  BASED(WRKAPTR2) BDY(DWORD),                             03880400
*     2 TWRKA2A  BDY(WORD),          /* DEFINE FIRST AREA            */ 03881800
*       3 WRKA1PTR PTR(32),          /* PTR TO PROB PROG WORK AREA   */ 03883200
*       3 WRKA2PTR PTR(32),          /* PTR TO TMP PRIVATE WORK AREA */ 03884600
*       3 TMPWA2P  PTR(32),          /* PTR TO STAE/STAI WORK AREA   */ 03886000
*       3 SAVARPTR PTR(32),          /* PTR TO ORIGINAL SAVE AREA    */ 03887400
*       3 TMPTIME  PTR(32),          /* ADDR OF TIME ROUTINE         */ 03888800
*       3 TMPT04   PTR(32),          /* ADDR OF STAI EXIT ROUTINE    */ 03890200
*       3 TMPT042  PTR(32),          /* ADDR2 OF STAI EXIT ROUTINE   */ 03891600
*       3 TMPT05   PTR(32),          /* ADDR OF STAE EXIT ROUTINE    */ 03893000
*       3 TEPKEY   PTR(32),          /* TMP ENTRY PSW PROTECT KEY    */ 03894400
*       3 TCBPTR   PTR(32),          /* PTR TO TCB                   */ 03895800
*       3 UPTPTR   PTR(32),          /* PTR TO UPT                   */ 03897200
*       3 ECTPTR   PTR(32),          /* PTR TO ECT                   */ 03898600
*       3 PSCBPTR  PTR(32),          /* PTR TO PSCB                  */ 03900000
*       3 ASCBPTR  PTR(32),          /* PTR TO ASCB                  */ 03901400
*       3 ASXBPTR  PTR(32),          /* PTR TO ASXB                  */ 03902800
*       3 RLGBPTR  PTR(32),          /* PTR TO RELOGON BUFFER        */ 03904200
*       3 LWAPTR   PTR(32),          /* PTR TO LOGON WORK AREA       */ 03905600
*       3 JSCBPTR  PTR(32),          /* PTR TO JSCB (IEZJSCB)        */ 03907000
*       3 CMDACTP  PTR(32),          /* PTR SRM PARM LIST    @ZA39401*/ 03908400
*       3 TMPT043  PTR(32),          /* PTR TO ESTAI MSG RTN @ZA40795*/ 03909800
*       @EJECT;                                                         03911200
*     /* TMP MAINLINE FLOW CONTROL FLAGS                             */ 03912600
*     3 FLOFLGS  CHAR(4) BDY(WORD),                                     03914000
*       4 FLOFLGS1 CHAR(1),                                             03915400
*         5 *       BIT(1),                                             03916800
*         5 *       BIT(1),                                             03918200
*         5 DOLIST  BIT(1),                                             03919600
*         5 DOGETC  BIT(1),                                             03921000
*         5 DODONE  BIT(1),                                             03922400
*         5 DOINVOK BIT(1),                                             03923800
*         5 DOSCAN  BIT(1),                                             03925200
*         5 *       BIT(1),                                             03926600
*                                                                       03928000
*       4 FLOFLGS2 CHAR(1),                                             03929400
*         5 DOPUTM  BIT(1),                                             03930800
*         5 DOFRECB BIT(1),                                             03932200
*         5 DOPSTRT BIT(1),                                             03933600
*         5 DOACTV  BIT(1),                                             03935000
*         5 DOCHKAT BIT(1),                                             03936400
*         5 DOWAIT  BIT(1),                                             03937800
*         5 DOATTN  BIT(1),                                             03939200
*           6 DOCHKCP  BIT(1),                                          03940600
*         5 *       BIT(1),                                             03942000
*                                                                       03943400
*       4 FLOFLGS3 CHAR(1),                                             03944800
*         5 *       BIT(1),                                             03946200
*         5 DOIMPLX BIT(1),                                             03947600
*         5 DOTEST  BIT(1),                                             03949000
*         5 DOSETBF BIT(1),                                             03950400
*         5 DOSETTB BIT(1),                                             03951800
*         5 *       BIT(3),                                             03953200
*                                                                       03954600
*       4 FLOFLGS4 CHAR(1),                                             03956000
*         5 *       BIT(8),                                             03957400
*                                                                       03958800
*@EJECT;                            /*                      @ZA40795*/  03960201
*       /* GRAPHIC BIT MAP FOR EASY REFERENCE TO TMP BITS   @ZA40795*/  03961601
*/*******************************************************************/  03963000
*/*                                                                 */  03964400
*/*           8    4    2      1      8      4       2      1       */  03965800
*/* FLOFLGS1                                                        */  03967200
*/*           0    1    2      3      4      5       6      7       */  03968600
*/*                                                                 */  03970000
*/*           *    *    DOLIST DOGETC DODONE DOINVOK DOSCAN *       */  03971400
*/*                                                                 */  03972800
*/* DOWATF1             *      *      *      *       *              */  03974200
*/* DOATTNF1            *      *      *      *                      */  03975600
*/* DOACTF1             *      *      *                             */  03977000
*/* DOTSKF1                    *      *      *       *              */  03978400
*/* DOCHKAF1                   *      *                             */  03979800
*/* DOSTCDF1                   *      *                             */  03981200
*/* DOMPLXF1                   *      *                             */  03982600
*/* DOGTCDF1                          *      *       *              */  03984000
*/*                                                                 */  03985400
*/*******************************************************************/  03986800
*/*                                                                 */  03988200
*/*          8      4       2       1      8       4      2         */  03989600
*/* FLOFLGS2                                                        */  03991000
*/*          0      1       2       3      4       5      6       7 */  03992400
*/*                                                                 */  03993800
*/*          DOPUTM DOFRECB DOPSTRT DOACTV DOCHKAT DOWAIT DOATTN  * */  03995200
*/*                                                       DOCHKCP * */  03996600
*/*                                                                 */  03998000
*/* DOMPLXF2 *      *       *       *      *                        */  03999400
*/* DOGTCDF2                *       *      *       *      *         */  04000800
*/* DOSTCDF2                *       *      *                        */  04002200
*/* DOCHKAF2                *       *                               */  04003600
*/*                                                                 */  04005000
*/*******************************************************************/  04006400
*/*                                                                 */  04007800
*/*           8      4       2       1       8       4 2   1        */  04009200
*/* FLOFLGS3                                                        */  04010600
*/*           0      1       2       3       4       5  6  7        */  04012000
*/*                                                                 */  04013400
*/*           *      DOIMPLX DOTEST  DOSETBF DOSETTB *  *  *        */  04014800
*/*                                                                 */  04016200
*/*******************************************************************/  04017600
*/*                                                                 */  04019000
*/* FLOFLGS4                                                        */  04020400
*/*           0      1       2       3       4       5  6  7        */  04021800
*/*           *      *       *       *       *       *  *  *        */  04023200
*/*                                                                 */  04024600
*/*******************************************************************/  04026000
*       @EJECT;                                                         04027400
*       3 T0ASAVEP PTR(31),          /* ADDR OF SAVEAREA FOR RETRY TO   04028800
*                                       IKJEFT0A             @E2267H1*/ 04030200
*       3 LWAPTR1  PTR(31),          /* ADDR OF LWA FOR T02  @E23D2I6*/ 04031600
*       3 TMP2RWAP PTR(31),          /* IKJEFTOP Recovery Work Area ptr 04034001
*                                       to RECOV_WA, which contains     04034101
*                                       the IKJEFTOP ESTAE parm, namely 04034201
*                                       TOP_PARMWA. Area is Gotten/Freed04034301
*                                       by IKJEFT01.         @AA44804*/ 04034401
*       3 *        PTR(32),          /* RESERVED                     */ 04034500
*                                                                       04035800
*       /* TEMPORARY SAVE AREAS FOR CALL LINK REGISTERS              */ 04037200
*       /* SAVE AREAS FOR TMP-CALL                                   */ 04038600
*       3 SAVRA  PTR(31),                                               04040000
*       3 SAVRB  PTR(31),                                               04041400
*       3 SAVRC  PTR(31),                                               04042800
*       3 SAVRM  PTR(31),                                               04044200
*       3 SVLNKE PTR(31),                                               04045600
*       /* SAVE AREAS FOR TMP MAINLINE LINK REGISTERS                */ 04047000
*       3 SAVLNKRS  BDY(WORD),       /* NAME OF AREA                 */ 04048400
*         4 SAVLNKA  PTR(31),                                           04049800
*         4 SAVLNKB  PTR(31),                                           04051200
*         4 SAVLNKC  PTR(31),                                           04052600
*         4 SAVLNKD  PTR(31),                                           04054000
*         4 SAVLNKE  PTR(31),                                           04055400
*         4 SAVLNKF  PTR(31),                                           04056800
*         4 SAVLNKG  PTR(31),                                           04058200
*         4 SAVLNKH  PTR(31),                                           04059600
*         4 SAVLNKJ  PTR(31),                                           04061000
*         4 SAVLNKK  PTR(31),                                           04062400
*         4 SAVLNKL  PTR(31),                                           04063800
*         4 SAVLNKM  PTR(31),                                           04065200
*@EJECT;                                                                04066600
* /*******************************************************************/ 04068000
* /* TMPWRKA2 -- CONTINUED                                           */ 04069400
* /*******************************************************************/ 04070800
*                                                                       04072200
*     2 TWRKA2B  BDY(WORD),          /* DEFINE SECOND AREA           */ 04073600
*       /* CONTROL FLAGS                                             */ 04075000
*       3 MCTLFLGS  CHAR(4) BDY(WORD), /* NAME OF AREA               */ 04076400
*         4 MCFLGS1 CHAR(1),                                            04077800
*           5 BKGMODE  BIT(1),       /* EXECUTING IN BACKGROUND MODE */ 04079200
*           5 DRSAPF   BIT(1),       /* ON - ATTACH WITH APF         */ 04080600
*           5 TMP2TSLB BIT(1),       /* 1=FOUND IN TSOLIB    @E25D2JC*/ 04082000
            5 TMP2NTSL BIT(1),       /* 1=NOT ELIGIBLE TO BE LOADED FROM04083400
                                        A DATASET DEFINED BY THE TSOLIB 04084800
                                        COMMAND              @WA23000*/ 04086200
*           5 *        BIT(4),       /* RESERVED             @WA23000*/ 04087600
*         4 *       CHAR(3),         /* RESERVED                     */ 04089000
*           5 *        BIT(1),       /* Hi-order bit is                 04090400
*                                       now reserved         @E25D2JC*/ 04091800
*           5 TMP2TSFC BIT(1),       /* 1=TMP IS EXECUTING IN           04093200
*                                       TSF/CLIST MODE       @E2367S4*/ 04094600
*           5 ATTEXC2  BIT(1),       /* 1=EXC2 ATTACHED FOR TSF/CLIST   04096000
*                                       MODE PROCESSING      @E2367S4*/ 04097400
*           5 TMP2TSCA BIT(1),       /* 1=IKJEFTSC ATTENTION EXIT       04098800
*                                       (IKJATTN) RECEIVED CONTROL      04100200
*                                                            @E2367S4*/ 04101600
*           5 TMP2SVCI BIT(1),       /* 1=TMP PARALLEL SIDE IS SVC      04103000
*                                       INITIATED            @E2367S4*/ 04104400
*           5 *        BIT(1),       /* RESERVED             @PBY0160*/ 04105800
*           5 TMP2SYN1 BIT(1),       /* 1=SYNCHED TO IKJEFT03 FROM      04107200
*                                       IKJEFT02 IN ROUTINE TTSKCHK.    04108600
*                                                            @PBY0160*/ 04110000
*           5 TMP2SYN2 BIT(1),       /* 1=SYNCHED TO IKJEFT03 FROM      04111400
*                                      IKJEFT02 IN ROUTINE TGETCDX      04112800
*                                                            @PBY0160*/ 04114200
*           5 TMP2PLAT BIT(1),       /* 1=RUNNING ON TMP AUTHORIZED     04115600
*                                      PLATFORM              @E23D2I6*/ 04117000
*       3 MTPL    BDY(WORD),         /* NAME OF MODEL TPL            */ 04118400
*         4 MTPLCBUF  PTR(31),       /* POINTER TO COMMAND BUFFER    */ 04119800
*         4 MTPLPS CHAR(12) BDY(WORD), /* NAME OF POINTER AREA       */ 04121200
*           5 MTPLUPT  PTR(31),      /* POINTER TO UPT               */ 04122600
*           5 MTPLPSCB PTR(31),      /* POINTER TO PSCB              */ 04124000
*           5 MTPLECT  PTR(31),      /* POINTER TO ECT               */ 04125400
*                                                                       04126800
*       3 RTRYSA     BDY(WORD),      /* ENVIRONMENTAL AREA           */ 04128200
*         4 RTRY51   PTR(31),        /* T02 BASE PTR 1               */ 04129600
*         4 RTRY52   PTR(31),        /* T02 BASE PTR 2               */ 04131000
*         4 RTRY53   PTR(31),        /* T02 DATAREG                  */ 04132400
*                                                                       04133800
*       3 MDYNASP   CHAR(40) BDY(WORD),/* MODEL DYNALLOC PL  @PID0180*/ 04135201
*       @EJECT;                     /*                       @ZA40795*/ 04136601
* /*******************************************************************/ 04138000
* /* TMPWRKA2 -- CONTINUED                                   @ZA40795*/ 04139401
* /*******************************************************************/ 04140800
*    2 TWRKA2C BDY(WORD),            /* DEFINE THIRD AREA    @ZA40795*/ 04142201
*     3 TMPBLDL BDY(WORD) CHAR(68),  /* BLDL REQUEST PL      @ZA40795*/ 04143601
*       4 TMPBLDNR FIXED(15),        /* BLDL NUMBER OF ENTRIES IN    */ 04145000
*                                    /* LIST                 @ZA40795*/ 04146401
*       4 TMPBLDN FIXED(15),         /* BLDL LENGTH OF PL    @ZA40795*/ 04147801
*       4 TMPBLDNM CHAR(8),          /* BLDL PROGRAM NAME    @ZA40795*/ 04149201
*       4 TMPBLDAT CHAR(56),         /* BLDL USER INFO RETURNED      */ 04150600
*                                    /*                      @ZA40795*/ 04152001
*     3 TMPFLAG1 CHAR(1),            /* LOCAL FLAGS 1        @ZA40795*/ 04153401
*       4 TMPCP BIT(1),              /* 1=CP COMMAND ATTACH REQUESTED*/ 04154800
*                                    /*                      @ZA40795*/ 04156201
*       4 TMPCPCAL BIT(1),           /* 1=CALL COMMAND ATTACH        */ 04157600
*                                    /*            REQUESTED @ZA40795*/ 04159001
*       4 TMPCPTST BIT(1),           /* 1=TEST COMMAND LINK REQUESTED*/ 04160400
*                                    /*                      @ZA40795*/ 04161801
*       4 TMPCPABN BIT(1),           /*1=CURRENT CMD ABENDED @ZA40795*/ 04163201
*       4 TMPAPF BIT(1),             /* 1=APF ATTACH ACTIVE  @ZA40795*/ 04164601
*       4 TMPDE BIT(1),              /* 1=DE ATTACH REQ      @ZA40795*/ 04166001
*       4 TMPTSTAU BIT(1),           /* 1=TESTAUTH COMMAND   @E21D2I6*/ 04167401
*                                    /*  ENTERED             @E21D2I6*/ 04168801
*       4 TMPBIT07 BIT(1),           /*  R E S E R V E D     @ZA40795*/ 04170201
*     3 TMPFLAG2 CHAR(1),            /*  LOCAL FLAGS 2       @ZA40795*/ 04171601
*       4 TMPFORCE BIT(1),           /*  FORCE CP DETACH     @ZA40795*/ 04173001
*     3 TMPFLAG3 CHAR(1),            /*  R E S E R V E D     @ZA40795*/ 04174401
*     3 TMPFLAG4 CHAR(1),            /*  R E S E R V E D     @ZA40795*/ 04175801
*     3 TMPTEST@ PTR(31),            /* ADDR OF TEST CMD     @ZA40795*/ 04177201
*     3 TMPTSKLB PTR(31),            /* DCB ADDR FOR TASKLIB KEYWORD */ 04178600
*                                    /* ON ATTACH            @ZA40795*/ 04180001
*     3 TMPCALST PTR(31),            /* ADDR CALL COMMAND PARAMETER  */ 04181400
*                                    /* STRING               @ZA40795*/ 04182801
*     3 TMPCPPL@ PTR(31),            /* ADDRESS TPLCPPL OR ADDRESS      04184200
*                                       TO TSO SERVICE FACILITY PROGRAM 04185600
*                                       PARAMETER LIST       @E121324*/ 04187001
*     3 TMPABECB PTR(31),            /* ADDR ECB POSTED AFTER ABEND  */ 04188400
*                                    /* OR ATTENTION         @ZA40795*/ 04189801
*     3 TMPSTAI PTR(31),             /* PTR TO ESTAI RTN     @ZA40795*/ 04191201
*     3 TMPSPLS PTR(31),             /* PTR TO ESTAI PARMS   @ZA40795*/ 04192601
*     3 TMPTSKRC FIXED(31),          /* SUBTASK CPL CODE (R15)       */ 04194000
*    2 RESERVE1 CHAR(1),             /* RESERVED             @E1213F3*/ 04195401
*    2 RESERVE2 CHAR(1),             /* RESERVED             @E1213F3*/ 04196801
*    2 RESERVE3 CHAR(1),             /* RESERVED             @E1213F3*/ 04198201
*    2 RESERVE4 CHAR(1),             /* RESERVED             @E1213F3*/ 04199601
*    2 TMP2ATNP PTR(31),        /* @ OF ATTN ROUTINE         @E1213F3*/ 04201001
*    2 TMP2PARM FIXED(31),      /* PARM GOOD OR NOT          @E1213F3*/ 04202401
*    2 TMP2SA@  PTR(31),        /* PTR TO KEY 1 SAVEAREA     @E1213F3*/ 04203801
*    2 TMP2TIB@ PTR(31),        /* @ OF TIB WHICH IS USED BY IKJEFT02   04205200
*                                  IT IS GOTTEN BY IKJEFT01 AND WILL    04206600
*                                  FREED BY IKJEFT01         @E1213F3*/ 04208001
*    2 TMP2ATIB PTR(31),        /* @ OF THE ACTIVE TIB       @E1213F3*/ 04209401
*    2 TMP2MECB PTR(31),        /* @ OF TPLMECB (STOP/MODIFY ECB)       04210800
*                                  WITHIN TMPWRKA1           @E1213F3*/ 04212201
*    2 TMP2AECB PTR(31),        /* @ OF END OF T02 ECB                  04213600
*                                  WITHIN TMPWRKA1           @E1213F3*/ 04215001
*    2 TMPW1LEN FIXED(31),      /* LENGTH OF TMPWRKA1        @E1213F3*/ 04216401
*    2 TMPW2LEN FIXED(31),      /* LENGTH OF TMPWA2          @E1213F3*/ 04217801
*    2 TMPBUFF@ FIXED(31),      /* BUFFER @ OBTAINED BY      @E1213F3*/ 04219201
*                               /* IKJEFT02                  @E1213F3*/ 04220601
*    2 TMP2PPTR PTR(31),        /* @ OF ITS OWN PURGE PARM LIST         04222000
*                                                            @E1213F3*/ 04223401
*    2 TMP2PLEN FIXED(31),       /* LENGTH OF RESTORE PARM AND PURGE    04224800
*                                PARM LIST TO GET AND FREE   @E1213F3*/ 04226201
*    2 TMP2NAME CHAR(8),         /* NAME OF TMPWRKA2         @E1213F3*/ 04227601
*    2 TMP2LEV  CHAR(4),         /* LEVEL OF TMPWRKA2        @E1213F3*/ 04229001
*  2 TMP2FFLG,                   /* FLAGS USED FOR DEBUGGING AND        04230400
*                                   RECOVERY PURPOSES        @E1213F3*/ 04231801
*    3 TMP2DBUG,                 /* TRACE OF FUNCTIONS PERFORMED WHICH  04233200
*                                   CAN BE USED FOR DEBUGGING           04234600
*                                                            @E1213F3*/ 04236001
*    4 TMP2TSFG CHAR(1),             /* FLAGS USED TO INDICATE WHAT     04237400
*                                       FUNCTION WAS PERFORMED BY       04238800
*                                       IKJEFTSC             @E1213F3*/ 04240200
*     5 TMP2PUR BIT(1),              /* PURGE I/O WAS DONE   @E1213F3*/ 04241600
*     5 TMP2STAT BIT(1),            /* STATUS RESET WAS DONE @E1213F3*/ 04243001
*     5 *       BIT(1),              /* RESERVE              @PBB0045*/ 04244400
*     5 TMP2WAIT BIT(1),             /* WAIT WAS BEING DONE  @E1213F3*/ 04245800
*     5 TMP2POST BIT(1),             /* POST WAS BEING DONE  @E1213F3*/ 04247200
*     5 TMP2W1ST BIT(1),             /* BUILDING THE WORKAREA           04248600
*                                                            @E1213F3*/ 04250001
*     5 TMP2WA2S BIT(1),             /* BUILDING THE WORKAREA           04251400
*                                                            @E1213F3*/ 04252801
*     5 TMP2W2ST BIT(1),             /* BUILDING THE WORKAREA           04254200
*                                                            @E1213F3*/ 04255601
*    4 T2FLGT08 CHAR(1),             /* FLAG FOR IKJEFT08    @E1213F3*/ 04257001
*      5 TMP2NPAR BIT(1),            /* INDICATE NO PARALLEL TMP        04258400
*                                                            @E1213F3*/ 04259801
*      5 * BIT(7),                    /*                     @E1213F3*/ 04261201
*    4 TMP2VFPR CHAR(1),             /* TSF PARAMETER VERIFICATION      04262600
*                                       DEBUGGING FOOTPRINTS            04264000
*                                       (IKJEFTPV)           @E1213F3*/ 04265401
*      5 TMP2READ BIT(1),            /* READING PARAMETERS   @E1213F3*/ 04266801
*      5 TMP2WRIT BIT(1),            /* WRITING PARAMETERS   @E1213F3*/ 04268201
*      5 TMP2MAIN BIT(1),            /* MAINLINE             @E1213F3*/ 04269601
*      5 TMP2PAGE BIT(1),            /*READING FUNCTION BUFF @E1213F3*/ 04271001
*      5 TMP2PGM  BIT(1),            /* READING PGM PARMS    @E1213F3*/ 04272401
*      5 TMP2CODE BIT(1),            /* SETTING RETURN CODES @E1213F3*/ 04273801
*      5 TMP2TPVR BIT(1),            /* RESERVED             @E1213F3*/ 04275201
*      5 TMP2DONE BIT(1),            /* IKJEFTPV DONE        @E1213F3*/ 04276601
*    4 TMPFLG1 CHAR(1),              /* USED BY IKJEFT02     @E121324*/ 04278001
*      5 TMPARALL BIT(1),       /* PARALLEL TMP ENVIRONMENT  @E121324*/ 04279401
*      5 TMPAPFCK BIT(1),       /* TSRCHAPF HAS BEEN CALLED  @E121324*/ 04280801
*      5 TMPLOAD  BIT(1),       /* LOAD WAS ISSUED           @E121324*/ 04282201
*      5 DIDCALL  BIT(1),       /* CALL HAS BEEN PERFORMED   @E121324*/ 04283601
*                               /* BY THE PARALLEL TMP       @E121324*/ 04285001
*      5 R1PGMLST BIT(1),       /* R1 SET TO PGM PARM LIST   @E121324*/ 04286401
*                               /* FROM SVC                  @E121324*/ 04287801
*      5 TMPDETCH BIT(1),       /* IKJEFTP2 IS DETACHING     @YA34525*/ 04289201
*      5 * BIT(2),              /* RESERVED                  @YA34525*/ 04290601
                                                                        04300000
*    3 TMP2RCOV,                 /* FLAGS USED BY RECOVERY   @E1213F3*/ 04350001
*      4 TMP2MCTL CHAR(2),       /* MODULE IN CONTROL FLAGS, SET BY     04400000
*                                   ALL TMP MODULES THAT ARE IN         04450000
*                                   CONTROL                  @E1213F3*/ 04500001
*        5 TMP2MT01 BIT(1),      /* IKJEFT01 IN CONTROL      @E1213F3*/ 04550001
*        5 TMP2MTSC BIT(1),      /* IKJEFTSC IN CONTROL      @E1213F3*/ 04600001
*        5 TMP2MT02 BIT(1),      /* IKJEFT02 IN CONTROL      @E1213F3*/ 04650001
*        5 TMP2MTPV BIT(1),      /* IKJEFTPV IN CONTROL      @E1213F3*/ 04700001
*        5 TMP2MT08 BIT(1),      /* IKJEFT08 IN CONTROL      @E1213F3*/ 04750001
*        5 TMP2MCAF BIT(1),      /* IKJCAF   IN CONTROL      @E2367S4*/ 04800001
*        5 *        BIT(10),     /* RESERVED                 @E2367S4*/ 04850001
*      4 TMP2FCTL,               /* MODULAR FUNCTION IN CONTROL, SET    04900000
*                                   BY ALL TMP MODULES THAT ARE IN      04950000
*                                   CONTROL                  @E1213F3*/ 05000001
*        5 TMP2FT01 CHAR(1),     /* IKJEFT01 FUNCTION IN CONTROL        05050000
*                                                            @E1213F3*/ 05100001
*          6 TMP2FI01 BIT(1),    /* IKJEFT01 INITIALIZATION  @E1213F3*/ 05150001
*          6 TMP2FTM1 BIT(1),    /* IKJEFT01 TERMINATION     @E1213F3*/ 05200001
*          6 *        BIT(6),    /* RESERVED                 @E1213F3*/ 05250001
*        5 TMP2FTSC CHAR(1),     /* IKJEFTSC FUNCTION IN CONTROL        05300000
*                                                            @E1213F3*/ 05350001
*          6 TMP2FISC BIT(1),    /* IKJEFTSC INITIALIZATION  @E1213F3*/ 05400001
*          6 TMP2FBSC BIT(1),    /* IKJEFTSC IN CONTROL AFTER WAIT OF   05450000
*                                   TIBRECB AND BEFORE TERMINATION      05500000
*                                   CODE                     @E1213F3*/ 05550001
*          6 TMP2FTMC BIT(1),    /* IKJEFTSC TERMINATION     @E1213F3*/ 05600001
*          6 *        BIT(5),    /* RESERVED                 @E1213F3*/ 05650001
*        5 TMP2FT02 CHAR(1),     /* IKJEFT02 FUNCTION IN CONTROL        05700000
*                                                            @E1213F3*/ 05750001
*          6 *        BIT(8),    /* RESERVED                 @E1213F3*/ 05800001
*        5 TMP2FTPV CHAR(1),     /* IKJEFTPV FUNCTION IN CONTROL        05850000
*                                                            @E1213F3*/ 05900001
*          6 TMP2FSUV BIT(1),    /* IKJEFTPV SYSTEM/USER FUNCTION,      05950000
*                                   ON IF USER AND OFF IF SYSTEM        06000000
*                                                            @E1213F3*/ 06050001
*          6 *        BIT(7),    /* RESERVED                 @E1213F3*/ 06100001
*        5 TMP2FT08 CHAR(1),     /* IKJEFT08 FUNCTION IN CONTROL        06150000
*                                                            @E1213F3*/ 06200001
*          6 *        BIT(8),    /* RESERVED                 @E1213F3*/ 06250001
*        5 RESERVE5 CHAR(3),    /* RESERVED                  @E1213F3*/ 06300001
*      4 TMP2FLRC CHAR(2),       /* SET BY IKJEFT05 (RECOVERY) TO       06350000
*                                   INDICATE THE RETRY TARGET CODE      06400000
*                                   (FIRST LEVEL)            @E1213F3*/ 06450001
*        5 TMP2FLI1 BIT(1),      /*IKJEFT01 INITIALIZATION   @E1213F3*/ 06500001
*        5 TMP2FLIC BIT(1),      /*IKJEFTSC INITIALIZATION   @E1213F3*/ 06550001
*        5 TMP2FLBC BIT(1),      /* IKJEFTSC AFTER WAIT FOR PARALLEL    06600000
*                                   SIDE FOR CLEANUP         @E1213F3*/ 06650001
*        5 TMP2FL02 BIT(1),      /* IKJEFT02                 @E1213FE*/ 06700001
*        5 TMP2FLTV BIT(1),      /* IKJEFTPV TERMINATION     @E1213F3*/ 06750001
*        5 TMP2TSFR BIT(1),      /* PARALLEL IKJEFT02        @E2367S4*/ 06800001
*        5 *        BIT(10),     /* RESERVED                 @E2367S4*/ 06850001
*      4 TMP2SLRC CHAR(2),       /* SET BY IKJEFT05 (RECOVERY) TO       06900000
*                                   INDICATE CAUSES FOR A PREVIOUS      06950000
*                                   RETRY TO IKJEFT01                   07000000
*                                   (SECOND LEVEL)           @E1213F3*/ 07050001
*        5 TMP2SL01 BIT(1),      /* IKJEFT01                 @E1213F3*/ 07100001
*        5 TMP2SLIC BIT(1),      /* IKJEFTSC INITIALIZATION  @E1213F3*/ 07150001
*        5 TMP2SLBC BIT(1),      /* IKJEFTSC AFTER FIRST ATTACH OF      07200000
*                                   IKJEFT02                 @E1213F3*/ 07250001
*        5 TMP2SL02 BIT(1),      /* IKJEFT02                 @E1213F3*/ 07300001
*        5 TMP2SLPV BIT(1),      /* IKJEFTPV                 @E1213F3*/ 07350001
*        5 *        BIT(11),     /* RESERVED                 @E1213F3*/ 07400001
*      4 TMP2FAIL CHAR(2),       /* SET ON BY IKJEFT05 (RECOVERY) TO    07450000
*                                   INDICATE FAILURE IN A SPECIFIC      07500000
*                                   TMP MODULE. TMP MODULES USE FLAG    07550000
*                                   TO RESET RECURSION FLAGS.           07600000
*                                                            @E1213F3*/ 07650001
*        5 TMP2DMPF BIT(1),     /* SET BY IKJEFT05 TO INDICATE          07700000
*                                  THAT A SETRP DUMP IS TO BE           07750000
*                                  TAKEN                     @E2267H1*/ 07800001
*        5 TMP2TSCF BIT(1),      /* IKJEFTSC FAILED          @E1213F3*/ 07850001
*        5 TMP2T02F BIT(1),      /* IKJEFT02 FAILED          @E1213F3*/ 07900001
*        5 T2T8T9F  BIT(1),      /* T08 T09 ATTACH FAIL      @ZTS0162*/ 07950001
*        5 *        BIT(12),     /* RESERVED                 @ZTS0162*/ 08000001
*      4 TMP2RTRY,               /* SET BY IKJEFT01 AND IKJEFT02 TO     08050000
*                                   INDICATING ADDRESSES OF RETRY       08100000
*                                   CODE.  IKJEFT05 WILL USE THESE      08150000
*                                   ADDRESSES IN ORDER TO RETRY         08200000
*                                                            @E1213F3*/ 08250001
*        5 TMP2RBSC PTR(31),     /* BEGINNING OF IKJEFTSC, SET          08300000
*                                   BY IKJEFT01              @E1213F3*/ 08350001
*        5 TMP2RWSC PTR(31),     /* AFTER WAIT BEFORE TERMINATION       08400000
*                                   CODE IN IKJEFTSC, SET BY            08450000
*                                   IKJEFT01                 @E1213F3*/ 08500001
*        5 TMP2RW02 PTR(31),     /* AFTER WAIT ON TIBRECB: SET BY       08550000
*                                   IKJEFT02                 @E1213F3*/ 08600001
*        5 TMP2RT02 PTR(31),     /* TERMINATION CODE IN IKJEFT02        08650000
*                                   IN ORDER TO RETURN TO IKJEFT01 FOR  08700000
*                                   A RETRY, SET BY IKJEFT02            08750000
*                                                            @E1213F3*/ 08800001
*        5 TMP2RTPV PTR(31),     /* TERMINATION CODE IN IKJEFTPV        08850000
*                                   IN ORDER TO RETURN TO IKJEFTSC,     08900000
*                                   SET BY IKJEFT02          @E1213F3*/ 08950001
*      4 TMP2MRG1,               /* FIRST GROUP OF POINTERS TO MODULE   09000000
*                                   SAVEAREAS - SEE TMP2MRG2 FOR THE    09050000
*                                   REMAINING POINTERS                  09100000
*                                                                       09150000
*                                   EACH TMP MODULE STORES ADDRESS TO   09200000
*                                   ITS REGISTERS SO IKJEFT05 CAN       09250000
*                                   ESTABLISH ADDRESSABILITY DURING     09300000
*                                   A RETRY                  @ZA85291*/ 09350001
*        5 TMP2RG01 PTR(31),     /* ADDRESS IKJEFT01'S REGISTERS        09400000
*                                                            @E1213F3*/ 09450001
*        5 TMP2RGSC PTR(31),     /* ADDRESS IKJEFTSC'S REGISTERS        09500000
*                                                            @E1213F3*/ 09550001
*        5 TMP2RG02 PTR(31),     /* ADDRESS IKJEFT02'S REGISTERS        09600000
*                                                            @E1213F3*/ 09650001
*        5 TMP2RGPV PTR(31),     /* ADDRESS IKJEFTPV'S REGISTERS        09700000
*                                                            @E1213F3*/ 09750001
* 2 TMP2RET@ PTR(31),            /* TO INDICATE RETRY ADDRESS ON SETRP  09800000
*                                  MACRO ISSUED IN IKJEFT05  @E1213F3*/ 09850001
* 2 TMP2SR14 PTR(31),            /* USED BY RECOVERY ROUTINE TO SAVE    09900000
*                                  RETURN POINT WHEN IT DOES A CALL     09950000
*                                  TO A SUBROUTINE.          @E1213F3*/ 10000001
* 2 TMP2TSC2 CHAR(1),            /* FLAGS USED BY TSC WITH REC          10050000
*                                                            @E1213F3*/ 10100001
*   3 TMP2CLR  BIT(1),                 /* FLAGS NEEDED USED BY TSC TO   10150000
*                                   INDICATE WHAT IS DONE TO INITIATE   10200000
*                                   PARALLEL SIDE            @E1213F3*/ 10250001
*   3 TMP2REC  BIT(1),            /* INDICATE RETRY TO IKJEFT01         10300000
*                                                            @E1213F3*/ 10350001
*   3 TMP2SRCT BIT(1),            /* INDICATE WHETHER TO UPDATE TIB     10400000
*                                    BY RECOVERY-UPDATE IF IT FUNCTION  10450000
*                                    REQUEST BY USER IS NOT DONE        10500000
*                                                            @ZTY0256*/ 10550001
*   3 TMP2INIT BIT(1),            /* INDICATE RETRY TO IKJEFT01         10600000
*                                                            @ZTY0336*/ 10650001
*   3 TMP2RINT BIT(1),            /* INDICATE REXX NEEDS TO BE          10700000
*                                    REINITIALIZED           @PEI0701*/ 10750001
*   3 *         BIT(3),          /* RESERVE                  @PEI0701*/ 10800001
* 2 *       CHAR(3),             /* RESERVE                  @E1213F3*/ 10850001
* 2 TMP2TAIE PTR(31),            /* PTR TO TAIE USED BY T02  @ZTS0254*/ 10900001
* 2 TMP2TSP  PTR(31),            /* PTR TO IKJTSP MAPPING MACRO         10950000
*                                                            @E2267H1*/ 11000001
* 2 TMP2TP2W PTR(31),            /* PTR TO SHARED DYNAMIC AREA BETWEEN  11050000
*                                   IKJEFT02 AND IKJEFTP2    @E2267H1*/ 11100001
* 2 TMP2CAFP PTR(31),            /* PTR TO IKJCAFPL PARAMETER LIST      11150000
*                                                            @E2367S4*/ 11200001
* 2 TMP2MRG2,                    /* SECOND GROUP OF POINTERS TO         11250000
*                                   MODULE SAVEAREAS                    11300000
*                                                                       11350000
*                                   EACH TMP MODULE STORES ADDRESS TO   11400000
*                                   ITS REGISTERS SO IKJEFT05 CAN       11450000
*                                   ESTABLISH ADDRESSABILITY DURING     11500000
*                                   A RETRY                  @ZA85291*/ 11550001
*        3 TMP2RGP2 PTR(31),     /* ADDRESS IKJEFTP2'S REGISTERS        11600000
*                                                            @ZA85291*/ 11650001
* 2 TMP2TPSA CHAR(72),           /* IKJEFTP2'S PROTECTED SAVEAREA       11700000
*                                   PASSED BY IKJEFT02       @ZA96882*/ 11750001
* 2 TMP2TPS2 CHAR(72),           /* IKJEFTP2'S PROTECTED SAVEAREA       11800000
*                                   USED BY TP2 TO CALL ITS OWN         11850000
*                                   PROCEDURES.              @ZA96882*/ 11900001
* /*******************************************************/             11950000
* /*  PARAMETER LIST PASSED TO ATTENTION ROUTINE         */             12000000
* /*  IKJEFT03:                                          */             12050000
* /*                                                     */             12100000
* /*  REG1 ---------------!                              */             12150000
* /*                      !                              */             12200000
* /*                      V                              */             12250000
* /*            --------------------!                    */             12300000
* /*            ! TAIE @            !                    */             12350000
* /*            !                   !                    */             12400000
* /*            !-------------------!                    */             12450000
* /*            !  CMD BUFFER @     !                    */             12500000
* /*            !                   !  NOT USED          */             12550000
* /*            !-------------------!                    */             12600000
* /*            !  TMP PRIVATE WORK !                    */             12650000
* /*            !  AREA @           !    WRKAPTR2        */             12700000
* /*            !-------------------!                    */             12750000
* /*                                                     */             12800000
* /*                                                     */             12850000
* /*******************************************************/             12900000
*                                                                       12950000
* 2 T3PARMS BDY(DWORD),        /*                            @ZA96882*/ 13000000
*   5 T3TAIE@ PTR(31),         /*                            @ZA96882*/ 13050000
*   5 *       PTR(31),         /*                            @ZA96882*/ 13100000
*   5 T3WKPTR2 PTR(31),        /*                            @ZA96882*/ 13150000
*                                                                       13200000
* 2 STAXPPTR PTR(31),          /* ADDRESS OF STAX PARM LIST  @ZA96882*/ 13250000
*                                                                       13300000
* 2 SYNCHSP  CHAR(16),         /* SYNCH PARM LIST            @ZA96882*/ 13350000
*                                                                       13400000
* 2 TMP2TPS3 CHAR(72),           /* IKJEFTP2'S ADDITIONAL PROTECTED     13450000
*                                   SAVEAREAS USED BY TP2 TO CALL       13500000
*                                   ITS OWN PROCEDURES       @ZA97523*/ 13550000
*                                                                       13600000
* 2 TMP2T08S CHAR(72),           /* IKJEFT08'S PROTECTED SAVEAREA       13650000
*                                   USED BY T02 TO FOR LINK             13700000
*                                                            @E21D2G9*/ 13750000
*                                                                       13800000
* 2 SAVLNKN  PTR(31),               /* FOR IKJEFT08          @E21D2G9*/ 13850000
*     /*  FOR IKJEFTP2 CALLS TO IRXESTK1                     @E21D2G9*/ 13900000
* 2 TMP2STK@,                       /* PARAMETER LIST FOR IKJEFTP2      13950000
*                                      LINK TO IRXESTK1      @E21D2G9*/ 14000000
*   3 TMP2FUN@ PTR(31),             /* ADDRESS OF IRXESTK1 FUNCTION     14050000
*                                                            @E21D2G9*/ 14100000
*   3 TMP2DAT@ PTR(31),             /* ADDRESS OF POINTER TO IRXESTK1   14150000
*                                      DATA                  @E21D2G9*/ 14200000
*   3 TMP2DAL@ PTR(31),             /* ADDRESS OF IRXESTK1 DATA         14250000
*                                      LENGTH                @E21D2G9*/ 14300000
* 2 TMP2STKP,                       /* PARAMETERS FOR IKJEFTP2          14350000
*                                      LINK TO IRXESTK1      @E21D2G9*/ 14400000
*   3 TMP2FUNC FIXED(32),           /* IRXESTK1 FUNCTION     @E21D2G9*/ 14450000
*   3 TMP2DATA PTR(31),             /* STACK ELEMENT ADDRESS @E21D2G9*/ 14500000
*   3 TMP2DATL FIXED(32),           /* STACK ELEMENT LENGTH  @E21D2G9*/ 14550000
*     /*  FOR IKJEFT08 CALLS TO IRXESTK1                     @E21D2G9*/ 14600000
* 2 TMP2ST@2,                       /* PARAMETER LIST FOR IKJEFT08      14650000
*                                      LINK TO IRXESTK1      @E21D2G9*/ 14700000
*   3 TMP2FU@2 PTR(31),             /* ADDRESS OF IRXESTK1 FUNCTION     14750000
*                                                            @E21D2G9*/ 14800000
*   3 TMP2DA@2 PTR(31),             /* ADDRESS OF POINTER TO IRXESTK1   14850000
*                                      DATA                  @E21D2G9*/ 14900000
*   3 TMP2DL@2 PTR(31),             /* ADDRESS OF IRXESTK1 DATA         14950000
*                                      LENGTH                @E21D2G9*/ 15000000
* 2 TMP2ST2P,                       /* PARAMETERS FOR IKJEFT08          15050000
*                                      LINK TO IRXESTK1      @E21D2G9*/ 15100000
*   3 TMP2FUN2 FIXED(32),           /* IRXESTK1 FUNCTION     @E21D2G9*/ 15150000
*   3 TMP2DAT2 PTR(31),             /* STACK ELEMENT ADDRESS @E21D2G9*/ 15200000
*   3 TMP2DAL2 FIXED(32),           /* STACK ELEMENT LENGTH  @E21D2G9*/ 15250000
* 2 TMP2PRO1 FIXED(31),          /* FUNCTION TO BE PASSED TO IRXESTK1   15300000
*                                                            @PEI0432*/ 15350000
* 2 TMP2PRO2 FIXED(31),          /* FUNCTION TO BE PASSED TO IRXTVARS   15400000
*                                                            @PEI0432*/ 15450000
* 2 TMP2EXDP PTR(31),            /* ADDRESS OF EXECDATA TO BE PASSED    15500000
*                                   TO IRXTVARS              @PEI0432*/ 15550000
* 2 SAVLNKO FIXED(31),           /* FOR IKJEFT08             @PEI0432*/ 15600000
* 2 TMP2RSVD FIXED(32),          /* RESERVED                 @E21D2G9*/ 15650000
* 2 TMP2EDST,                    /* Storage for IKJEFT08 subrtns        15700000
*                                   TIBENQ and TIBDEQ and IKJEFTP2      15750000
*                                   subrtns TSFENQ and                  15800000
*                                   TSFDEQ:                  @PMH0057*/ 15850000
*   3 TMP2ENQR,                  /* RNAME FOR ENQUE ON                  15900000
*                                   TMP3TIBQ                 @PMH0071*/ 15950000
*     4 TMP2TCBA CHAR(4),        /* CONTAINS LITERAL CHARACTER          16000000
*                                   STRING 'TCBA'            @PMH0071*/ 16050000
*     4 TMP2T02A PTR(31),        /* ADDRESS OF ACTIVE                   16100000
*                                   IKJEFT02 TCB             @PMH0071*/ 16150000
*   3 TMP2ENDQ CHAR(16)                                                 16200000
*              BDY(WORD),        /* Area for ENQ/DEQ         @PMH0057*/ 16250000
* 2 TMP2RGQ2 PTR(31),            /* Address of the                      16300000
*                                   IKJEFTQ2 storage.        @E25D2JC*/ 16350000
* 2 TMP2DYDC PTR(31),            /* DY DCB address           @E25D2JC*/ 16400000
* 2 TMP2T01E FIXED(31),          /* T01 entry indicator      @E25D2JC*/ 16450000
* 2 TMP2T5R0 PTR(31),            /* Reg 0  save area for T05 @WA21212*/ 16500000
* 2 TMP2T5R1 PTR(31),            /* Reg 1  save area for T05 @WA21212*/ 16550000
* 2 TMP2T5RF PTR(31),            /* Reg 15 save area for T05 @WA21212*/ 16600000
* 2 TMP2T5WL PTR(32),            /* len of key1 T05 dyn area @KX00014*/ 16650000
* 2 TMP2T5W1 PTR(32),            /* adr of key1 T05 dyn area @KX00014*/ 16700001
* 2 *        CHAR(8),            /* RESERVE                  @KX00014*/ 16750000
* 2 TMP2END CHAR(0) BDY(DWORD);  /* ASSURE THAT THIS WORKAREA END IN    16800000
*                                   A DOUBLE WORD BOUNDARY. ANY         16850000
*                                   ADDITION TO WORKAREA SHOULD BE      16900000
*                                   PUT BEFORE TMP2END       @E1213F3*/ 16950001
*  DCL    TMP2ET01 CONSTANT(1)                                          17000000
*                  FIXED(31),    /* Indicates that the                  17050000
*                                   IKJEFT01 entry point is             17100000
*                                   being processed.         @E25D2JC*/ 17150001
*         TMP2ET1A CONSTANT(2)                                          17200000
*                  FIXED(31),    /* Indicates that the                  17250000
*                                   IKJEFT1A entry point is             17300000
*                                   being processed.         @E25D2JC*/ 17350001
*         TMP2ET1B CONSTANT(3)                                          17400000
*                  FIXED(31),    /* Indicates that the                  17450000
*                                   IKJEFT1B entry point is             17500000
*                                   being processed.         @E25D2JC*/ 17550001
*         TMP2ET1I CONSTANT(10)                                         17600000
*                  FIXED(31);    /* Indicates that the PWS exits are    17650000
*                                   enabled                  @WA19057*/ 17700001
*  DCL                           /* WHEN SETTING A MODULE IN CONTROL    17750000
*                                   FLAG, EACH MODULE WILL HAVE A       17800000
*                                   SPECIFIC BIT VALUE.  WHEN SETTING   17850000
*                                   ONE OF THESE FLAGS, ALL OTHER       17900000
*                                   MODULE FLAGS WILL BE TURNED OFF     17950000
*                                                            @E1213F3*/ 18000001
*                                /* IKJEFT01'S BIT VALUE     @E1213F3*/ 18050001
*         TMP2VT01 BIT(16) CONSTANT('8000'X),                           18100000
*                                /* IKJEFTSC'S BIT VALUE     @E1213F3*/ 18150001
*         TMP2VTSC BIT(16) CONSTANT('4000'X),                           18200000
*                                /* IKJEFT02'S BIT VALUE     @E1213F3*/ 18250001
*         TMP2VT02 BIT(16) CONSTANT('2000'X),                           18300000
*                                /* IKJEFTPV'S BIT VALUE     @E1213F3*/ 18350001
*         TMP2VTPV BIT(16) CONSTANT('1000'X),                           18400000
*                                /* IKJEFT08'S BIT VALUE     @E1213F3*/ 18450001
*         TMP2VT08 BIT(16) CONSTANT('0800'X);                           18500000
*@EJECT;                                                                18550000
* %IF SKIPW1^='' %THEN         /* IF NOT NULL SKIP OVER MAPPING OF      18600000
*                                 TMPWRKA1                   @E1213F3*/ 18650001
*  %GOTO SKIPWRK1;             /*                            @E1213F3*/ 18700001
* /******************************************************************/  18750000
* /* TMPWRKA1 -- TMP PROBLEM PROGRAM STATE DYNAMIC WORK AREA        */  18800000
* /*                                                                */  18850000
* /*   THIS DYNAMIC WORK AREA IS GOTTEN FROM SUBPOOL 1, PP KEY, BY  */  18900000
* /*   IKJEFT01  DURING  TMP INITIALIZATION AND ANOTHER ONE         */  18950000
* /*   WILL BE GOTTEN IN IKJEFTSC IF A PARALLEL TMP IS NEEDED AND   */  19000000
* /*   THIS WORKAREA WILL BE FREED WHEN THE PARALLEL TMP IS FINISHED*/  19050000
* /*   WHILE THE ONE GOTTEN FOR THE NON-PARALLEL SIDE BY IKJEFT01   */  19100000
* /*   WILL NOT BE FREED UNTIL THE END OF THE TERMINAL SESSION.     */  19150000
* /*   DURING THE TMP SEVERITY 2 STAE RETRY ALL OF STORAGE IS FREED */  19200000
* /*   AND THIS WORKAREA MUST BE REINITIALIZED.                     */  19250000
* /*                                                                */  19300000
* /*   CHANGE ACTIVITY =                                            */  19350000
* /*    OZ66275 -ADD TSEVENT ISSUED FLAG                    @ZA66275*/  19400000
* /*                                                                */  19450000
* /******************************************************************/  19500000
*                                                                       19550000
* DECLARE                                                               19600000
*   1 TMPWRKA1 BASED(WRKAPTR1) BDY(DWORD),                              19650000
*                                                                       19700000
*     /* TMP-TEST DYNAMIC INTERFACE AREA                             */ 19750000
*%       TPLSLEV='2';                 /* SET TPL LEVEL TO 2          */ 19800000
*%       TPLOPT1='CONTINUE';          /* INDICATE MORE TO FOLLOW TPL */ 19850000
*%       INCLUDE SYSLIB(IKJTPL);                                        19900000
*%       DEACTIVATE TPLSLEV,TPLOPT1;                                    19950000
*                                                                       20000000
*     /* TMP COMMON VARIABLES AND WORK AREAS                         */ 20050000
*     2 TMPNECB  PTR(31),            /* ECB FOR STAI WAIT            */ 20100000
*     2 TMPCECB  PTR(31),            /* ECB FOR ATTACHED CP          */ 20150000
*     2 TMPIECB  PTR(31),            /* ECB FOR STAI POST            */ 20200000
*     2 TMPAECB  PTR(31),            /* ECB FOR ATTN POST            */ 20250000
*     2 TMPCMDWT PTR(31),            /* PTR TO CMD FROM ATTN EXIT    */ 20300000
*                                                                       20350000
*     2 TMPSWS   CHAR(4),            /* TMP INTERNAL SWITCHES        */ 20400000
*       3 TMPTEST  BIT(1),           /* TEST PROGRAM IN CONTROL      */ 20450000
*       3 TMPCMDW  BIT(1),           /* COMMAND WAITING              */ 20500000
*       3 TMPNFCMD BIT(1),           /* FIRST COMMAND IS PROCESSED   */ 20550000
*       3 TMPACTRL BIT(1),           /* TMP ATTN EXIT IS IN CONTROL  */ 20600000
*       3 TMPSCTRL BIT(1),           /* TMP STAI EXIT IS IN CONTROL  */ 20650000
*       3 ABND806  BIT(1),           /* NO-MODULE FOUND BY FETCH     */ 20700000
*       3 FRSTLAB  BIT(1),           /* 1ST LEVEL ATTACHEE ABENDED   */ 20750000
*       3 NONSCUR  BIT(1),           /* SECURITY AUTHORIZATION FAILS */ 20800000
*                                                                       20850000
*       3 ATCHNOW  BIT(1),           /* ABEND OCCURRED IN ATTACH     */ 20900000
*       3 LOADNOW  BIT(1),           /* ABEND OCCURRED IN LOAD       */ 20950000
*       3 LINKNOW  BIT(1),           /* ABEND OCCURRED IN LINK       */ 21000000
*       3 FRSTEX   BIT(1),           /* FIRST EXPL/IMPLICIT EXEC TRY */ 21050000
*       3 CALLNOW  BIT(1),           /* CALL FUNCTION ACTIVE         */ 21100000
*       3 TMP1TIME BIT(1),           /* ESTAI ENTERED (TEST) @ZTM5046*/ 21150000
*       3 T7TDONE  BIT(1),           /* TSEVENT ISSUED       @ZA66275*/ 21200000
*       3 SKPATTN  BIT(1),           /* 1-BYPASS ATTN        @ZA89253*/ 21250000
*                                                                       21300000
*       3 TMP1TSFE BIT(1),            /* ERROR OCCURRED IN CLIST        21350000
*                                       WHILE IN TSF/CLIST MODE.        21400000
*                                                            @PBY0316*/ 21450000
*       3 *        BIT(7),           /* RESERVED             @PBY0316*/ 21500000
*                                                                       21550000
*       3 CALLSWS  CHAR(1),          /* TMP-CALL INTERNAL SWITCHES   */ 21600000
*         4 PDLPRES  BIT(1),         /* PDL RETURNED BY PARSE        */ 21650000
*         4 DSOPEN   BIT(1),         /* DATA SET IS OPEN             */ 21700000
*         4 *        BIT(1),         /* RESERVED. MAPPED AND USED BY    21750000
*                                       IKJEFT08.            @PBY0316*/ 21800001
*         4 BLANKB   BIT(1),         /* DATA SET NAME PROCESSED      */ 21850000
*         4 DORELS   BIT(1),         /* RELEASE PDL NOW              */ 21900000
*         4 GMBRNOW  BIT(1),         /* GET MEMBER NAME              */ 21950000
*         4 PCFDA    BIT(1),         /* PCF DIRECT ATTACH    @YA18897*/ 22000000
*         4 *        BIT(1),         /* RESERVED FLAG        @YA18897*/ 22050000
*@EJECT;                                                                22100000
*     /* RESERVED AREAS                                              */ 22150000
*     2 TMPT9ECB    BIT(32),         /* ECB USED FOR COMMUNICATION      22200000
*                                       BETWEEN IKJEFT09 AND IKJURPS    22250000
*                                                            @E24D2H3*/ 22300000
*      4 TMPT9ECW    BIT(1),         /* WAIT BIT                        22350000
*                                                            @E24D2H3*/ 22400000
*      4 TMPT9ECP    BIT(1),         /* POST BIT                        22450000
*                                                            @E24D2H3*/ 22500000
*      4 TMPT9ECC    BIT(30),        /* COMPLETION CODE                 22550000
*                                                            @E24D2H3*/ 22600000
*     2 TMPURPA     PTR(31),         /* ANCHOR FOR URP REQUEST BLOCK    22650000
*                                       CHAIN FOR IKJEFT09   @E24D2H3*/ 22700000
*     2 RESCOMM  CHAR(8),            /*                      @E24D2H3*/ 22750000
*     2 RESCOM2  CHAR(16),                                              22800000
*     2 RESCOM3  CHAR(16),                                              22850000
*     2 RESCOM4  CHAR(16),                                              22900000
*     2 *        CHAR(4),            /* RESERVED WAS FLOFLGS @ZA46174*/ 22950000
*                                                                       23000000
*% DEFPTRS:  MACRO;                                                     23050000
*   ANSWER                                                              23100000
* ('2 CPPLPTR  PTR(31),            /* PTR TO CP PARM LIST          */') 23150000
*     NORESCAN COL(7);                                                  23200000
*   ANSWER                                                              23250000
* ('2 CSOAPTR  PTR(31),            /* PTR TO CMD SCAN PARM LIST    */') 23300000
*     NORESCAN COL(7);                                                  23350000
*   ANSWER                                                              23400000
* ('2 CSPLPTR  PTR(31),            /* PTR TO CMD SCAN PARM LIST    */') 23450000
*     NORESCAN COL(7);                                                  23500000
*   ANSWER                                                              23550000
* ('2 DAPLPTR  PTR(31),            /* PTR TO DAIR PARM LIST        */') 23600000
*     NORESCAN COL(7);                                                  23650000
*   ANSWER                                                              23700000
* ('2 GTPBPTR  PTR(31),            /* PTR TO GETLINE PARM BLOCK    */') 23750000
*     NORESCAN COL(7);                                                  23800000
*   ANSWER                                                              23850000
* ('2 IOPLPTR  PTR(31),            /* PTR TO I/O RTNS PARM LIST    */') 23900000
*     NORESCAN COL(7);                                                  23950000
*   ANSWER                                                              24000000
* ('2 PGPBPTR  PTR(31),            /* PTR TO PUTGET PARM BLOCK     */') 24050000
*     NORESCAN COL(7);                                                  24100000
*   ANSWER                                                              24150000
* ('2 PPLPTR   PTR(31),            /* PTR TO PARSE PARM LIST       */') 24200000
*     NORESCAN COL(7);                                                  24250000
*   ANSWER                                                              24300000
* ('2 PTPBPTR  PTR(31),            /* PTR TO PUTLINE PARM BLOCK    */') 24350000
*     NORESCAN COL(7);                                                  24400000
*   ANSWER                                                              24450000
* ('2 STPLPTR  PTR(31),            /* PTR TO STACK PARM LIST       */') 24500000
*     NORESCAN COL(7);                                                  24550000
*%  END;                                                                24600000
*? DEFPTRS;                                                             24650000
*     2 ACEEPTR  PTR(31),            /* ADDR OF ACEE                 */ 24700000
*     2 ASCANAP  PTR(31),            /* ADDR OF ATTN SCAN ANSWER     */ 24750000
*     2 ASRPLPTR PTR(31),            /* ADDR OF ATTN SRPL            */ 24800000
*     2 ATTCHPTR PTR(31),            /* ADDR OF ATTACH PARM LIST     */ 24850000
*     2 CDCBPTR  PTR(31),            /* PTR TO CALL DCB              */ 24900000
*     2 DCBPTR   PTR(31),            /* PTR TO DCB                   */ 24950000
*     2 DYNAPPTR PTR(31),            /* PTR TO DYNALLOC PARM LIST    */ 25000000
*     2 EBCDPTR  PTR(31),            /* PTR TO TRANSLATE TABLE       */ 25050000
*     2 READYPTR PTR(31),            /* ADDR OF TMP MODE MESSAGE     */ 25100000
*     2 SCANAP   PTR(31),            /* ADDR OF SCAN ANSWER AREA     */ 25150000
*     2 SRPLPTR  PTR(31),            /* ADDR OF SRPL                 */ 25200000
*     2 *        PTR(31),            /* RESERVED             @ZA96882*/ 25250000
*     2 STPBPTR  PTR(31),            /* ADDR OF STACK PARM LIST      */ 25300000
*     2 * CHAR(4),                   /* SPACER                   @L1A*/ 25350000
*                                                                       25400000
*     /* RESERVE SPACE FOR PARAMETER LISTS, BLOCKS                   */ 25450000
*     2 ABMSGSP CHAR(LENGTH(ABMSGAR)) BDY(DWORD),  /* MESSAGE AREA   */ 25500000
*     2 * CHAR(3),                   /* SPACER                   @L1A*/ 25550000
*     /* PUTLINE ACTIVE SEGMENT LIST    LIST                         */ 25600000
*     2 ACTSL  CHAR(112) BDY(WORD),  /* NAME OF LIST                 */ 25650000
*       3 ACTSEG (28) PTR(32),       /* SEGMENTS                     */ 25700000
*         4 ACTSEGA   PTR(16),       /* FIRST HWORD OF SEGMENT       */ 25750000
*         4 ACTSEGB   PTR(16),       /* SECOND HWORD OF SEGMENT      */ 25800000
*     2 AMSGLIST,                    /* ATTN MESSAGE LIST            */ 25850000
*       3 ANUMSEG  FIXED(31),        /* NUMBER OF MESSAGE SEGMENTS   */ 25900000
*       3 AMSGSEG(2) PTR(31),        /* ARRAY OF SEGMENT PTRS        */ 25950000
*     2 ARCODE   PTR(31),            /* ATTN RETURN CODE SAVE AREA   */ 26000000
*     2 ASCANFLG FIXED(31),          /* ATTN SCAN FLAGS              */ 26050000
*     2 ASRPARM  CHAR(20) BDY(WORD), /* ATTN SR PARM AREA            */ 26100000
*     2 ATTCHSP CHAR(LENGTH(ATTCHLST)) BDY(WORD),  /* ATTACH PL SP   */ 26150000
*     2 BLDLLST  CHAR(68) BDY(WORD), /* BLDL ENTRY                   */ 26200000
*       3 XTRCLST  CHAR(12) BDY(WORD),  /* EXTRACT LIST              */ 26250000
*         4 BLDLENT  FIXED(15),      /* NUM OF ENTRIES               */ 26300000
*         4 BLDLELNG FIXED(15),      /* LENGTH OF ENTRY              */ 26350000
*         4 BLDLNAME CHAR(8),        /* NAME OF COMMAND              */ 26400000
*       3 BLDLTTRZ CHAR(56),         /* PAD TO FULL WORD     @ZA40795*/ 26450001
*         4 BLDLTMP_TT  CHAR(2),     /* TT (relative track) returned    26500000
*                                       from BLDL            @WA36096*/ 26550001
*         4 BLDLTMP_R   CHAR(1),     /* R (record number) returned      26600000
*                                       from BLDL            @WA36096*/ 26650001
*@EJECT;                                                                26700000
*     2 CDCBSP  CHAR(140) BDY(DWORD),  /* CALL DCB SPACE             */ 26750000
*     2 CLOSESP CHAR(12) BDY(WORD),  /* CLOSE PL SPACE               */ 26800000
*     2 CPPLSP  CHAR(LENGTH(CPPL)) BDY(WORD),  /* CPPL SPACE         */ 26850000
*     2 CSOASP  CHAR(LENGTH(CSOA)) BDY(WORD),  /* CSOA SPACE         */ 26900000
*     2 CSOASP2 CHAR(LENGTH(CSOA)) BDY(WORD),  /* 2ND CSOA SP (ATTN) */ 26950000
*     2 CSPLSP  CHAR(LENGTH(CSPL)) BDY(WORD),  /* CSPL SPACE         */ 27000000
*     2 CSPLSP2 CHAR(LENGTH(CSPL)) BDY(WORD),  /* 2ND CSPL SP (ATTN) */ 27050000
*     2 CTLBKSP  BDY(WORD),          /* NAME OF BLOCK SPACE          */ 27100000
*       3 CTLBLKL  PTR(32),          /* LENGTH OF BLOCK SPACE        */ 27150000
*       3 CTLBLKA  PTR(31),          /* LOC OF BLOCK SPACE           */ 27200000
*       3 CTLBLKN  PTR(31),          /* SUBPOOL                      */ 27250000
*     2 DAPBSP  CHAR(LENGTH(DAPB08)) BDY(WORD),  /* DAIR PARM BLK SP */ 27300000
*     2 DAPLSP  CHAR(LENGTH(DAPL)) BDY(WORD),  /* DAIR PL SPACE      */ 27350000
*     2 * CHAR(4),                     /* SPACER                 @L1A*/ 27400000
*     2 DCBSP   CHAR(140) BDY(DWORD),  /* DCB SPACE                  */ 27450000
*     2 DYNASP  CHAR(LENGTH(DYNAPARM))  BDY(WORD), /* DYNALLOC PL SP */ 27500000
*     2 DYNATUB BIT(32) BDY(WORD),     /* BIT FORM OF THE PLATFORM      27550000
*                                         TCB ADDRESS USED SO THAT      27600000
*                                         THE ADDRESS, NORMALLY ON A    27650000
*                                         WORD BOUNDARY, CAN BE COPIED  27700000
*                                         INTO THE TEXT UNIT PARM       27750000
*                                         THAT'S ON A HALFWORD          27800000
*                                         BOUNDARY.          @PID0180*/ 27850001
*     2 ECTSP   CHAR(LENGTH(ECT))  BDY(WORD),  /* ECT SPACE          */ 27900000
*     2 FMLCSP  CHAR(10) BDY(WORD),  /* FREEM PL SPACE               */ 27950000
*     2 * CHAR(2),                     /* SPACER                 @L1A*/ 28000000
*     2 GTPBSP  CHAR(LENGTH(GTPB)) BDY(WORD),  /* GTPB SPACE         */ 28050000
*     2 MODESSP CHAR(4) BDY(WORD),  /* MODESET PARM LIST SPACE       */ 28100000
*     2 NXTCMD  CHAR(8) BDY(WORD),   /* COMMAND NAME FIELD           */ 28150000
*     2 OPENSP  CHAR(12) BDY(WORD),  /* OPEN PL SPACE                */ 28200000
*     2 PGPBSP  CHAR(LENGTH(PGPB)) BDY(WORD),  /* PGPB SPACE         */ 28250000
*     2 PPLSP   CHAR(28) BDY(WORD),       /* PARSE PL SPACE  @PBY0271*/ 28300000
*     2 PRSMSSP CHAR(LENGTH(PRSMAR)) BDY(WORD),  /* MESSAGE AREA     */ 28350000
*     2 PTPBSP  CHAR(LENGTH(PTPB)) BDY(WORD),  /* PTPB SPACE         */ 28400000
*     2 RCODE    PTR(31),            /* RETURN CODE SAVE AREA        */ 28450000
*     2 R3SAVE   PTR(31),            /* SAVE PDL PTR                 */ 28500000
*     2 SAVAR    (14) PTR(32),       /* SAVE REGISTER ENVIRONMENT    */ 28550000
*     2 SCANFLG  FIXED(31),          /* SCAN FLAGS                   */ 28600000
*     2 SNAPSP  CHAR(40) BDY(WORD),  /* SNAP PL SPACE                */ 28650000
*     2 STPBSP  CHAR(LENGTH(STPB)) BDY(WORD),      /* STPB SPACE     */ 28700000
*     2 STPLSP  CHAR(LENGTH(STPL)) BDY(WORD),  /* STACK PL SPACE     */ 28750000
*     2 TMPZEROS FIXED(31),          /* ALL ZEROS WORD - DUMMY CBUF  */ 28800000
*     2 MODEMSP CHAR(20) BDY(WORD),  /* DUMMY SPACE FOR MODE MESSAGE */ 28850000
*     2 *       CHAR(20) BDY(WORD),  /* RESERVED                     */ 28900000
*@EJECT;                                                                28950000
*     /* WORK AREA FOR TMP-CALL FUNCTION                             */ 29000000
*     2 CALLWA  BDY(WORD),                                              29050000
*       /* PROBLEM PROGRAM WORK AREA FOR CALL FUNCTION               */ 29100000
*       3 PPWORKAR,                                                     29150000
*         4 PPLIST  BDY(WORD),                                          29200000
*           5 SWBIT  CHAR(1),                                           29250000
*           5 *      CHAR(3),                                           29300000
*         4 PARMFLD  BDY(WORD),                                         29350000
*           5 LENPARM  FIXED(15),                                       29400000
*           5 PARMS    CHAR(100),                                       29450000
*           5 * CHAR(2),               /* SPACER                 @L1A*/ 29500000
*                                                                       29550000
*       /* CALL INTERNAL WORK AREA                                   */ 29600000
*       3 WORK1,                                                        29650000
*         4 PARSPARM,                /* PARSE PARMS                  */ 29700000
*           5 PDLADDR  PTR(31),      /* PTR TO PARM DESCRIPTOR LIST  */ 29750000
*           5 PDLADDR2  PTR(31),                                        29800000
*         4 DSNBUFFR CHAR(48) BOUNDARY(HWORD),                          29850000
*           5 DSNLENG  FIXED(15),    /* LENGTH OF DATA SET NAME      */ 29900000
*           5 DSNBUF   CHAR(44),     /* DSNAME                       */ 29950000
*           5 *        CHAR(2),      /* ALIGNMENT                    */ 30000000
*       3 MSGNO    FIXED(31),        /* MESSAGE NUMBER               */ 30050000
*       3 DAPB0PTR PTR(31),                                             30100000
*                                                                       30150000
*       /* MEMBER NAME SEGMENT FOR MESSAGE                           */ 30200000
*       3 MBRSEG CHAR(12) BDY(WORD), /* NAME OF AREA                 */ 30250000
*         4 MBRSLEN  PTR(15),        /* SEGMENT LENGTH               */ 30300000
*         4 MBRSOFF  PTR(15),        /* SEGMENT OFFSET               */ 30350000
*         4 MBRSTXT  CHAR(8),        /* MEMBER NAME TEXT             */ 30400000
*                                                                       30450000
*       /* MEMBER NAME SEGMENT FOR DAIR                              */ 30500000
*       3 MBRDSEG CHAR(12) BDY(WORD),  /* NAME OF AREA               */ 30550000
*         4 MBRDLEN  PTR(15),        /* SEGMENT LENGTH               */ 30600000
*         4 MBRDTXT  CHAR(8),        /* NAME TEXT                    */ 30650000
*         4 * CHAR(2),                 /* SPACER                 @L1A*/ 30700000
*                                                                       30750000
*       /* DATA SET NAME SEGMENT FOR MESSAGE                         */ 30800000
*       3 DSSEG CHAR(48) BDY(WORD),  /* NAME OF AREA                 */ 30850000
*         4 DSSGLEN  PTR(15),        /* SEGMENT LENGTH               */ 30900000
*         4 DSSGOFF  PTR(15),        /* SEGMENT OFFSET               */ 30950000
*         4 DSSGTXT  CHAR(44),       /* DATA SET NAME TEXT           */ 31000000
*                                                                       31050000
*       /* RETURN CODE RESERVE AREAS                                 */ 31100000
*       3 BLDLRC  PTR(32),     /* FOR BLDL RETURN CODE               */ 31150000
*       3 DAIRRC  PTR(32),     /* FOR DAIR RETURN CODE               */ 31200000
*       3 PUTLRC  PTR(32),     /* FOR PUTLINE RETURN CODE            */ 31250000
*       3 CRCODE  PTR(32),     /* FOR GENERAL CALL RETURN CODE       */ 31300000
*       /* TMP RE-STRUCTURE WORK AREAS                       @ZA40795*/ 31350001
*    2 TMPCTCB PTR(31),              /* PTR TO ATTCH CP TCB  @ZA40795*/ 31400001
*    2 TMPTECB FIXED(31),         /* TEST COMPLETE ECB       @ZA40795*/ 31450001
*    2 TMPECB2 FIXED(31),         /* IKJEFTXX EOT ECB        @ZA40795*/ 31500001
*    2 CPABECB FIXED(31),         /* TEST RQST AFTER ABEND   @ZA40795*/ 31550001
*    2 ECBLPTR PTR(31),           /* PTR ECB WAIT LISTS      @ZA40795*/ 31600001
*    2 TMPECBL2,                  /*                         @ZA40795*/ 31650001
*     3 TMPCECB2 PTR(31),         /* PTR TO ATTCH CP ECB     @ZA40795*/ 31700001
*     3 TMPIECB2 PTR(31),         /* PTR TO TMP STAI ECB     @ZA40795*/ 31750001
*     3 TMPAECB2 PTR(31),         /* PTR TO TMP ATTN ECB     @ZA40795*/ 31800001
*    2 TMPECBAT PTR(31),          /* ATTN ECB                @E2367S4*/ 31850001
*    2 TMPSCECB,                  /* ECB USED BY IKJATTN ROUTINE IN     31900000
*                                    IKJEFTSC TO WAIT FOR IKJEFT03      31950000
*                                    TO PROCESS THE ATTENTION. IT IS    32000000
*                                    POSTED BY IKJEFT03 NORMALLY AND    32050000
*                                    IKJEFT05 IF WAITING AT ABEND       32100000
*                                                            @ZA91237*/ 32150001
*      3 TMPSWAIT BIT(1),        /* CHECKED BY IKJEFT03 AND             32200000
*                                   IKJEFT05                 @ZA91237*/ 32250001
*      3 * BIT(31),              /* POST AND COMPLETION CODE            32300000
*                                                            @ZA91237*/ 32350001
*    2 TMP1ECB2,                 /* ECB INDICATING END OF T02 PROCESS   32400000
*                                                            @E1213F3*/ 32450001
*      3 * BIT(1),               /* ECB WAIT BIT             @E1213F3*/ 32500001
*      3 TP1ECB2P BIT(1),        /* ECB POST BIT             @E1213F3*/ 32550001
*      3 * BIT(30),              /* ECB COMPLETION CODE      @E1213F3*/ 32600001
*    2  *       FIXED(31),      /* RESERVED                  @ZTY0011*/ 32650001
*    2 TMPR15RC FIXED(31),      /* R15 RC FROM CP            @E121324*/ 32700001
*    2 TMP1RSNC FIXED(31),    /* REASON CODE WHEN CP ABEND   @E1213F3*/ 32750001
*    2 TMP1ABNC FIXED(31),    /* ABEND CODE WHEN CP ABEND    @E1213F3*/ 32800001
*    2 TMP1NAME CHAR(8),      /* NAME OF TMPWRKA1            @E1213F3*/ 32850001
*    2 TMP1LEV  CHAR(4),      /* LEVEL OF TMPWRKA1           @E1213F3*/ 32900001
*    2 TMPECBL3,                  /*                         @E2367S4*/ 32950001
*     3 TMPTECB3 PTR(31),         /* PTR TO TEST FINIS ECB   @E2367S4*/ 33000001
*     3 TMPCECB3 PTR(31),         /* PTR TO ATTACH CP ECB    @E2367S4*/ 33050001
*     3 TMPAECB3 PTR(31),         /* PTR TO TMP ATTN ECB     @E2367S4*/ 33100001
*    2 TMP1TQ2S  CHAR(72) BDY(WORD), /* Savearea for functions that     33150000
*                                    IKJEFTQ2 invokes.       @E25D2JC*/ 33200001
*    2 TMP1CDCA PTR(31),       /* Address of DCB for CALL command to    33250000
*                                 use or 0 for LINKLIST request         33300000
*                                                                @L1A*/ 33350001
*    2 *        CHAR(36),     /* RESERVE                     @PID0180*/ 33400001
*    2 TMP1END  CHAR(0) BDY(DWORD);  /* ASSURE THAT THIS WORKAREA END   33450000
*                                   IN A DOUBLE WORD BOUNDARY. ANY      33500000
*                                   ADDITION TO WORKAREA SHOULD BE      33550000
*                                   PUT BEFORE TMP1END       @E1213F3*/ 33600001
*@EJECT;                                                                33650000
*    DECLARE                                                            33700000
*     1 MULTLLST  DEFINED(ACTSL),    /* MULTILEVEL MESSAGE LIST      */ 33750000
*       2 MSGLCHP  PTR(31),          /* CHAIN PTR TO 2ND MSG LIST    */ 33800000
*       2 MSGLIST,                   /* FIRST MESSAGE LIST           */ 33850000
*         3 NUMSEG   FIXED(31),      /* NO. OF MESSAGE SEGMENTS      */ 33900000
*         3 MSGSEG(3) PTR(31),       /* ARRAY OF SEGMENT PTRS        */ 33950000
*       2 SECLLIST,                  /* 2ND LEVEL MSG LIST           */ 34000000
*         3 SMSGLCHP PTR(31),        /* LAST CHAIN PTR               */ 34050000
*         3 SNUMSEG  FIXED(31),      /* NO. OF MESSAGE SEGMENTS      */ 34100000
*         3 SMSGSEG(3) PTR(31);      /* ARRAY OF SEGMENT PTRS        */ 34150000
*                                                                       34200000
* DECLARE                                                               34250000
*   /* STAX PARAMETER LIST SPACE                                     */ 34300000
*   STAXSP  CHAR(256) BASED(STAXPPTR);                                  34350000
*                                                                       34400000
* DECLARE                                                               34450000
*   /* MODE MESSAGE IMAGE                                            */ 34500000
*   MODEMSG  CHAR(256) BASED(READYPTR);                                 34550000
*@EJECT;                                                                34600000
*                                                                       34650000
* DECLARE                                                               34700000
*   /* ABEND EXIT PARM AREA -- SUBPOOL 0, PP KEY, WORK AREA  GOTTEN  */ 34750000
*   /*   IN  IKJEFT01 (TMP INITIALIZATION)  AND  USED BY  IKJEFT04   */ 34800000
*   /*   (STAI EXIT), IKJEFT05 (STAE EXIT) AND IKJEFT07 (STAE RETRY) */ 34850000
*   /*   DURING TMP/SUBTASK LEVEL ABEND HANDLING                     */ 34900000
*                                                                       34950000
*   1 TMPWA2 BASED(TMPWA2P),                                            35000000
*                                                                       35050000
*     2 TMPWA2A    BDY(WORD),        /* NAME OF AREA                 */ 35100000
*       3 SVT040A CHAR(72) BDY(WORD),  /* LINKAGE SAVE AREA -- CHARS */ 35150000
*         4 SAVT040  (18) PTR(32),   /*   -- AS POINTERS             */ 35200000
*       3 SVT041A CHAR(72) BDY(WORD),  /* LINKAGE SAVE AREA -- CHARS */ 35250000
*         4 SAVT041  (18) PTR(32),   /*   -- AS POINTERS             */ 35300000
*       3 SVT042A CHAR(72) BDY(WORD),  /* LINKAGE SAVE AREA -- CHARS */ 35350000
*         4 SAVT042  (18) PTR(32),   /*   -- AS POINTERS             */ 35400000
*       3 STYNQWA   BDY(WORD),       /* NAME OF ENQ WORK AREA        */ 35450000
*         4 STYNQLA  CHAR(LENGTH(STYDQL)) BDY(WORD), /* PL AREA      */ 35500000
*         4 MINQNAM  CHAR(8),        /* ENQ MINOR NAME AREA          */ 35550000
*       3 *         CHAR(12),        /* RESERVED                     */ 35600000
*     2 TMPWA2B   BDY(WORD),         /* NAME OF AREA                 */ 35650000
*       3 REG14SAV  PTR(32),         /* TEMPORARY SAVE AREA          */ 35700000
*       3 GMRETC    PTR(32),         /* TEMPORARY SAVE AREA          */ 35750000
*       3 RETRYFLG CHAR(1),          /* TMP RETRY FLAGS              */ 35800000
*         4 TMPRINIT BIT(1),         /* REINITIALIZATION IN PROCESS  */ 35850000
*         4 TMPRTRY  BIT(1),         /* RETRY IN PROCESS             */ 35900000
*       3 *        CHAR(3),          /* RESERVED                     */ 35950000
*       3 GMLNG5  PTR(32),           /* LENGTH OF GETMAIN AREA       */ 36000000
*       3 GMLOC5  PTR(32),           /* LOCATION OF GETMAIN AREA     */ 36050000
*       3 TMPT04F CHAR(1),           /* FLAG FOR IKJEFT04    @ZA89253*/ 36100000
*         4 TWA2POST BIT(1),         /* 1-POST 0-DO NOT POST @ZA89253*/ 36150000
*         4 TWA2CONT BIT(1),         /* 1-CONTINUE 0-GET OUT @ZA89253*/ 36200000
*         4 TMPATTCH BIT(1),         /* 1-TMP ATTACH ABEND   @YA40214*/ 36250000
*       3 *        CHAR(3),          /* RESERVED             @ZA89253*/ 36300000
*       3 TWA2SARB PTR(31),          /* SAVE ADDRESS OF RB   @ZA89253*/ 36350000
*       3 SECNBASE PTR(31),          /* SECOND BASE REGISTER            36400000
*                                       FOR STAI PROCESSING  @YA40214*/ 36450000
*       3 NAMEFCDE CHAR(8),          /* NAME FROM THE CDE    @YA40214*/ 36500000
*         4 NAMESIX CHAR(6),         /* FIRST SIX CHARACTERS @YA40214*/ 36550000
*         4 *       CHAR(2),         /* LAST TWO CHARACTERS  @YA40214*/ 36600000
*       3 *        CHAR(12),         /* RESERVED             @YA40214*/ 36650000
*                                                                       36700000
*                                                                       36750000
*                                                                       36800000
*   /* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */ 36850000
*                                                                       36900000
*   /* COMMAND BUFFER --                                             */ 36950000
*   1 CBUF BASED(TPLCBUF) BDY(WORD),                                    37000000
*     2 CBUFLNG  FIXED(15),          /* TOTAL LENGTH OF CBUF         */ 37050000
*     2 CBUFOFF  FIXED(15),          /* CURRENT DATA FIELD OFFSET    */ 37100000
*     2 CBUFDATA CHAR(256),          /* VAR LENGTH DATA FIELD        */ 37150000
*                                                                       37200000
*   /* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */ 37250000
*                                                                       37300000
*   /* STAI MESSAGE ROUTINE PARAMETER AREA -- SUBPOOL 1, PP KEY AREA */ 37350000
*   /*   GOTTEN IN IKJEFT04 (STAI EXIT) AND USED BY TMP AND TEST     */ 37400000
*   1 STRTPARM BASED(TMPIECB),                                          37450000
*     2 STRTPTR PTR(31),             /* ADDR OF STAI MESSAGE RTN     */ 37500000
*     2 STRTTMPA PTR(31),            /* ADDR OF TMP MAIN WORK AREA   */ 37550000
*     2 STRTBASE PTR(31),            /* BASE REGISTER FOR STAI       */ 37600000
*     2 STRTDYNA PTR(31);            /* ADDR OF STAI DYNAMIC STORAGE */ 37650000
*%SKIPWRK1:   ;                      /*                      @E1213F3*/ 37700001
*                                                                       37750000
