         MACRO                                                          00050000
         IKJUNFLD &VERIFCK=,&SUBFLD=,&EXT                    @E23X2C6   00100000
.**01* PROPRIETARY STATEMENT=                                         * 00110001
.* **PROPRIETARY_STATEMENT********************************************* 00120001
.*                                                                    * 00130001
.*                                                                    * 00140001
.*  LICENSED MATERIALS - PROPERTY OF IBM                              * 00141001
.*  5650-ZOS COPYRIGHT IBM CORP. 1981, 2013                           * 00142002
.*                                                                    * 00143001
.*  STATUS= HTE7790                                                   * 00144001
.*                                                                    * 00145001
.* **END_OF_PROPRIETARY_STATEMENT************************************** 00146001
.*                                                                      00147001
.**01* EXTERNAL CLASSIFICATION: PI                                 @L1A 00148001
.**01* END OF EXTERNAL CLASSIFICATION:                             @L1A 00149001
.*                                                                      00149101
.*                                                                      00149201
.*  TITLE - IKJUNFLD MACRO                                              00800000
.*                                                                      00850000
.*  FUNCTION - THE IKJUNFLD MACRO IS USED BY COMMAND                    00900000
.*             PROCESSORS TO DEFINE TO PARSE ANY PARAMETERS             00950000
.*             THAT ARE TO BE VERIFIED BY A VERIFY EXIT                 01000000
.*                                                                      01050000
.*  INPUT - THE PROTOTYPE STATEMENT SHOWN ABOVE AND BELOW:              01450000
.*                                                                      01500000
.*             IKJUNFLD &SUBFLD=,&VERIFCK=,&EXT              @E23X2C6   01550000
.*                                                                      01600000
.*          ITS PARAMETERS REPRESENT THE FOLLOWING:                     01650000
.*                                                                      01700000
.*             &SUBFLD -  Represents the label on the                   01750000
.*                        CORRESPONDING IKJSUBF MACRO.                  01800000
.*             &VERIFCK - SPECIFIES THE ADDRESS OF A USER               01850000
.*                        SUPPLIED VERIFY EXIT ROUTINE                  01900000
.*             &EXT -     New keyword parameter to specify              01950000
.*                        option for extended support.       @E23X2C6   02000000
.*                                                                      02050000
.*  OUTPUT - THIS MACRO PRODUCES A PARAMETER CONTROL ENTRY              02100000
.*          (PCE) TO BE PASSED TO THE PARSE SERVICE ROUTINE.            02150000
.*                                                                      02200000
.*  MESSAGES:                                                           02250000
.*        - IKJUNFLD CAN HAVE ONLY 1 POSITIONAL PARAMETER    @E23X2C6   02300000
.*                                                                      02350000
.*        - REQUIRED OPERAND VERIFCK WAS OMITTED                        02400000
.*                                                                      02450000
.*        - '&EXT' IS AN INVALID PARAMETER                   @E23X2C6   02500000
.*                                                                      02550000
.*  CHANGE-ACTIVITY =                                                   02660001
.*                                                                      02660101
.*             CREATED FOR TSO/E RELEASE 4                              02660201
.*                                                                      02660301
.* E23X2C6 - JTE23X2 TSO/E 2.3.1 EXTENDED IKJUNFLD SUPPORT   @E23X2C6*  02662001
.*                                                                      02663001
.* FLAG REASON   RELEASE DATE     ORIGIN                           @L1A 02670001
.* ---- ------   ------- -------- ------                           @L1A 02680001
.* $L1= MG08414  HTE7790 120619   MPK: ALLOW FOR USE WITHIN RSECT  @L1A 02690001
.*                                                                      02691001
.********************************************************************** 02800000
.*A-000000-999999                                            @E2467K7*  02850000
         GBLC  &IKJCSNM,&IKJKWST                                        02900000
         GBLA  &UNKSUB                                       @E23X2C6   02950000
         LCLA  &LASTNDX                                      @E23X2C6   03000000
&LASTNDX SETA  &SYSNDX-1                                     @E23X2C6   03050000
         LCLC  &KWSTSAV                                                 03100000
         LCLB  &FSUBF,&KWSTSW,&FEXT                          @E23X2C6   03150000
         AIF   (N'&SYSLIST LE 2).A0  ONLY 1 POSIT. PARM      @E23X2C6   03200000
         MNOTE 8,'IKJUNFLD CAN HAVE ONLY 1 POSITIONAL PARAMETER'        03250000
*                                                            @E23X2C6   03300000
         AGO   .END                           TERMINATE      @E23X2C6   03350000
.A0      ANOP                                                           03400000
&FEXT    SETB  ('&EXT' EQ 'EXT')                             @E23X2C6   03450000
         AIF   ('&EXT' EQ 'EXT').TESTEXT                     @E23X2C6   03500000
         AIF   ('&EXT' EQ '').VALID                          @E23X2C6   03550000
         MNOTE 8,'''&EXT'' IS AN INVALID PARAMETER'                     03600000
*                                                            @E23X2C6   03650000
         AGO   .END                           TERMINATE      @E23X2C6   03700000
.TESTEXT ANOP                                                @E23X2C6   03750000
         AIF   (&UNKSUB EQ &LASTNDX).VALID                   @E23X2C6   03800000
         MNOTE 8,'IKJUNFLD with EXT must be preceded by the IKJSUBF mac*03850000
               ro'                                           @E23X2C6   03900000
         AGO   .END                           TERMINATE      @E23X2C6   03950000
.VALID   ANOP                                                           04000000
         AIF   ('&VERIFCK' NE '').A1          WAS VERIFCK ENTERED       04050000
         MNOTE 8,'REQUIRED OPERAND VERIFCK WAS OMITTED'                 04100000
         AGO .END                             TERMINATE                 04150000
.A1      ANOP                                                           04200000
&FSUBF   SETB  ('&SUBFLD' NE '')              SUBFIELD FLAG             04250000
&IKJCSNM CSECT ,                              RESUME PCL CSECT          04300000
         AIF   ('&IKJKWST' EQ '').NOSET IF NULL, NO SET NECESSARY       04350000
&IKJKWST EQU   *-&IKJCSNM              OFFSET TO FIRST KEYWORD          04400000
&IKJKWST SETC  ''                                                       04450000
.NOSET   ANOP                                                           04500000
UFLD&SYSNDX EQU *                                                       04550000
         DC    BL2'0101&FEXT.00000000000'     FLAGS          @E23X2C6   04600000
         DC    AL2(UEND&SYSNDX-UFLD&SYSNDX)   LENGTH OF UNFLD PCE       04650000
         DC    AL4(&VERIFCK)                  VERIFY EXIT ADDRESS       04700000
UKWD&SYSNDX IKJKEYWD                                                    04750000
.*********************************************************************  04800000
.* ISSUE THE APPROPRIATE CALL TO THE IKJNAME MACRO BASED ON WHETHER     04850000
.* THE SUBFLD AND EXT OPERANDS WERE ENTERED ON THE IKJUNFLD MACRO.      04900000
.* FIRST CHECK FOR EXT OPERAND, THEN BRANCH TO APPROPRIATE SECTION      04950000
.* AND CHECK FOR THE SUBFLD OPERAND.                                    05000000
.*                                                                      05050000
.* A2 = IKJNAME 31  blanks + subfield                                   05100000
.* A3 = IKJNAME 31  blanks                                              05150000
.* A4 = IKJNAME 250 blanks ext + subfield                               05200000
.* A5 = IKJNAME 250 blanks ext                                          05250000
.*                                                           @E23X2C6   05300000
.*********************************************************************  05350000
         AIF   ('&FEXT' EQ '1').A4                           @E23X2C6   05400000
         AIF   ('&FSUBF' EQ '0').A3                          @E23X2C6   05450000
.A2      ANOP                                                @E23X2C6   05500000
*        IKJNAME  '       31 Blanks long          ',SUBFLD=&SUBFLD      05550000
*                                                            @E23X2C6   05600000
         IKJNAME  '                               ',SUBFLD=&SUBFLD      05650000
         AGO   .A6                                           @E23X2C6   05700000
.A3      ANOP                                                           05750000
*        IKJNAME  '       31 Blanks long          '          @E23X2C6   05800000
         IKJNAME  '                               '                     05850000
         AGO   .A6                                           @E23X2C6   05900000
.A4      ANOP                                                @E23X2C6   05950000
         AIF   ('&FSUBF' EQ '0').A5                          @E23X2C6   06000000
*        IKJNAME  '       250 blanks long                              *06050000
                                                                       *06100000
                                                                       *06150000
                                                                       *06200000
                                             ',SUBFLD=&SUBFLD @E23X2C6  06250000
         IKJNAME  '                                                    *06300000
                                                                       *06350000
                                                                       *06400000
                                                                       *06450000
                                             ',SUBFLD=&SUBFLD @E23X2C6  06500000
         AGO   .A6                                           @E23X2C6   06550000
.A5      ANOP                                                @E23X2C6   06600000
*        IKJNAME  '       250 blanks long                              *06650000
                                                                       *06700000
                                                                       *06750000
                                                                       *06800000
                                             '               @E23X2C6   06850000
         IKJNAME  '                                                    *06900000
                                                                       *06950000
                                                                       *07000000
                                                                       *07050000
                                             '               @E23X2C6   07100000
.A6      ANOP                                                @E23X2C6   07150000
UEND&SYSNDX EQU *                                                       07200000
&SYSECT  &SYSSTYP ,                    RESUME USERS CSECT OR RSECT @L1A 07250001
.END     MEXIT                                                          07300000
         MEND                                                           07350000
