*                                                                       00000100
* %DCL IOSDPAVA_INCLUDED CHAR EXT;                                      00000200
* %DEACTIVATE IOSDPAVA_INCLUDED;                                        00000300
* %IF IOSDPAVA_INCLUDED = '' %THEN                                      00000400
* %DO;                                                                  00000500
*% /*                                                                   00000600
         MACRO                                                          00000700
         IOSDPAVA &DSECT=YES,&LIST=YES,&TITLE=YES,&PAVA=YES,           *00000800
               &EXTFORMAT=NO                                            00000900
         GBLC  &IOSDPAVA_INCLUDED                                       00001000
         GBLC  &ZCBPRINT                                                00001100
&IOSDPAVA_INCLUDED SETC 'YES'                                           00001200
         AIF   ('&LIST' EQ 'NONE').P0                                   00001300
         AIF   ('&TITLE' EQ 'NO').P5                                    00001400
 TITLE   'IOSDPAVA  - Parallel Access Volume Array (PAVA) mapping     '*00001500
                                                                        00001600
.P5      ANOP                                                           00001700
**/ IOSDPAVA_1:;                                                        00001800
*/****START OF SPECIFICATIONS*****************************************  00001900
*                                                                       00002000
*01* MACRO-NAME: IOSDPAVA                                               00002100
*                                                                       00002200
*01* DESCRIPTIVE-NAME: Parallel Access Volume Array (PAVA) mapping      00002300
*                                                                       00002400
*02*   ACRONYM: PAVA                                                    00002500
*                                                                       00002600
*01*   DSECT-NAME: PAVA                                                 00002700
*                                                                       00002800
*                                                                    */ 00002900
*/*01* PROPRIETARY STATEMENT=                                        */ 00003000
*/***PROPRIETARY_STATEMENT********************************************/ 00003100
*/*                                                                  */ 00003200
*/*                                                                  */ 00003300
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00003400
*/* 5650-ZOS COPYRIGHT IBM CORP. 1994, 2015                          */ 00003500
*/*                                                                  */ 00003600
*/* STATUS= HBB77A0                                                  */ 00003700
*/*                                                                  */ 00003800
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 00003900
*/*                                                                     00004000
*                                                                       00004100
*01* COMPONENT: IOS (SC1C3)                                             00004200
*                                                                       00004300
*01* FUNCTION =                                                  @06M   00004400
*                                                                       00004500
*    The IOSDPAVA macro maps the input/output area that is specified    00004600
*    via the PAVAREA keyword when the PAVINFO or HYPERPAVALIASES        00004700
*    function is specified on the UCBINFO macro.                        00004800
*                                                                       00004900
*    The PAVA consists of the following:                                00005000
*                                                                       00005100
*    -- A header that contains information such as the version number,  00005200
*       the total size of the PAVA, and the number of entries.          00005300
*                                                                       00005400
*    -- One or more entries that contains I/O response time             00005500
*       statistics such as the accumulated connect and pending          00005600
*       times from the channel measurement block.                       00005700
*                                                                       00005800
*       If PAVINFOSUM=YES is specified on the UCBINFO PAVINFO           00005900
*       macro, a single entry is created that contains the sum of       00006000
*       the I/O response time statistics from the base device and       00006100
*       all aliases bound to the base device at the time the            00006200
*       UCBINFO PAVINFO macro is issued.                                00006300
*                                                                       00006400
*       If PAVINFOSUM=NO is specified on the UCBINFO PAVINFO macro,     00006500
*       a separate entry is created for the base or non-PAV device,     00006600
*       and each alias that is bound to the base device.                00006700
*                                                                       00006800
*       If UCBINFO HYPERPAVALIASES is specified, a separate entry       00006900
*       is created for each HyperPAV alias for the logical              00007000
*       subsystem associated with the input base device.                00007100
*                                                                       00007200
*--------------------------------------------------------------------*  00007300
*                                                                       00007400
*     For UCBINFO PAVINFO requests, the EXTFORMAT keyword specifies     00007500
*     whether the extended or non-extended format of the PAVA is        00007600
*     being requested.  The extended format is required if your         00007700
*     program needs to obtain new information that is added to the      00007800
*     PAVA, and also allows z/OS to extend the length of the PAVA       00007900
*     entry in the future without affecting existing programs.          00008000
*                                                                       00008100
*     The value specified for the EXTFORMAT keyword on the UCBINFO      00008200
*     PAVINFO macro must match the value specified on the IOSDPAVA      00008300
*     macro.  Otherwise, your program may not work correctly.           00008400
*                                                                       00008500
*     If the extended format PAVA is requested, the following           00008600
*     occurs:                                                           00008700
*                                                                       00008800
*     -- IOSDPAVA macro - The PAVA device entry will be generated       00008900
*        as a separate DSECT/structure instead of an array              00009000
*        following the PAVA header.                                     00009100
*                                                                       00009200
*     -- UCBINFO PAVINFO service                                        00009300
*                                                                       00009400
*        -- The PAVA header will contain a version of 3 or higher       00009500
*           depending on the output version specified on the            00009600
*           UCBINFO macro and the highest version supported by the      00009700
*           service routine.                                            00009800
*                                                                       00009900
*        -- PAVAELEN will contain the length of each device entry.      00010000
*           This length should be used to access the next device        00010100
*           entry instead of the compile time length.                   00010200
*                                                                       00010300
*     If the non-extended format PAVA is requested, the following       00010400
*     occurs:                                                           00010500
*                                                                       00010600
*     -- IOSDPAVA macro - The PAVA device entry will be generated       00010700
*        as an array following the PAVA header.                         00010800
*                                                                       00010900
*     -- UCBINFO PAVINFO service                                        00011000
*                                                                       00011100
*        -- The PAVA header will contain a version of 2 or lower.       00011200
*                                                                       00011300
*        -- PAVAELen will be unpredictable depending on the level       00011400
*           of the UCBINFO PAVINFO service routine code.  For PLX,      00011500
*           the next device entry may be accessed by incrementing       00011600
*           the index used to address the PAVA array element.  For      00011700
*           assembler, the next device entry may be accessed by         00011800
*           adding the length of PAVArray to the current pointer.       00011900
*                                                                       00012000
*     The following shows what the PAVA looks like depending on         00012100
*     whether the extended or non-extended was requested:               00012200
*                                                                       00012300
*     Extended Format = Yes         Extended Format = No                00012400
*     ---------------------         --------------------                00012500
*     1 PAVA                        1 PAVA                              00012600
*       3 PAVAHead                    3 PAVAHead                        00012700
*         5 PAVAId                      5 PAVAId                        00012800
*         5 PAVAVers (3 or higher)      5 PAVAVers (2 or lower)         00012900
*           ...                           ...                           00013000
*         5 PAVATokn                    5 PAVATokn                      00013100
*         5 PAVAHend (End of header)                                    00013200
*                                                                       00013300
*     1 PAVAEntry Based               3 PAVAArray(*)                    00013400
*         5 PAVADevn                    5 PAVADevn                      00013500
*         5 Flags and statistics        5 Flags and statistics          00013600
*         5 PAVAELen (non-zero)         5 PAVAELen (unpredictable)      00013700
*       3 PAVAEfStart (extfmt start)                                    00013800
*         5 Version 3 information                                       00013900
*         5 Version x information...                                    00014000
*                                                                       00014100
*                                                                       00014200
*     Note: If your program is compiled with the level of the           00014300
*     UCBINFO PAVINFO macro that supports the EXTFORMAT keyword,        00014400
*     but your program runs on a system that does not have the          00014500
*     extended format support, a non-extended format PAVA will be       00014600
*     returned.  Your program can detect this condition by checking     00014700
*     the version number.  If the version number is less than 3,        00014800
*     then a non-extended format PAVA was returned.  In this case,      00014900
*     you may still use the extended format IOSDPAVA macro to           00015000
*     access the data.  However, you cannot use the PAVAElen field      00015100
*     to address the subsequent PAVA entries, and you cannot access     00015200
*     any fields that appear in version 3 and higher sections.          00015300
*                                                                @06A   00015400
*---------------------------------------------------------------------* 00015500
*                                                                       00015600
*01* EYE-CATCHER: PAVA                                                  00015700
*02*   OFFSET: 0                                                        00015800
*02*   LENGTH: 4                                                        00015900
*                                                                       00016000
*01* STORAGE ATTRIBUTES:                                                00016100
*02*   SUBPOOL:  caller-provided                                        00016200
*02*   KEY:  caller-provided                                            00016300
*02*   RESIDENCY: caller-provided                                       00016400
*                                                                       00016500
*01* METHOD OF ACCESS:                                                  00016600
*                                                                       00016700
*02*   ASM: IOSDPAVA                                                    00016800
*             ,DSECT=YES!NO to specify if the macro should be           00016900
*                           defined as a DSECT.                         00017000
*             ,LIST=YES!NO to control whether or not the macro will     00017100
*                          appear in the assembler listing.             00017200
*             ,PAVA=YES!NO to control whether or not the PAVA mapping   00017300
*                          is expanded.                                 00017400
*             ,EXTFORMAT=YES!NO to control whether or not the           00017500
*                          extended format of the PAVA mapping is       00017600
*                          generated                             @06A   00017700
*                                                                       00017800
*02*   PL/X: %INCLUDE SYSLIB(IOSDPAVA)                           @06C   00017900
*                                                                       00018000
*      To control whether the extended format of the IOSDPAVA macro     00018100
*      is generated, specify one of the following:                      00018200
*                                                                       00018300
*        %IOSDPAVA_ExtFormat = 'YES' Generate extended format           00018400
*        %IOSDPAVA_ExtFormat = 'NO'  Don't generate extended format     00018500
*                                    (default)                   @06A   00018600
*                                                                       00018700
*      Printing of the macro expansion can be controlled by the         00018800
*      IOSDPAVA_LIST global macro variable.                             00018900
*      Any value other than 'NO' will result in                         00019000
*      the  macro  expansion being printed.  The default is 'YES'.      00019100
*      The following examples illustrate how the                        00019200
*      IOSDPAVA_LIST variable should be set.                            00019300
*                                                                       00019400
*        %IOSDPAVA_LIST='YES'                                    @06C   00019500
*        %IOSDPAVA_LIST='NO'                                     @06A   00019600
*                                                                       00019700
*01* CREATED BY = issuer of UCBINFO PAVINFO                             00019800
*                                                                       00019900
*01* DELETED BY =  issuer of UCBINFO PAVINFO                            00020000
*                                                                       00020100
*01* POINTED TO BY:                                                     00020200
*      N/A                                                              00020300
*                                                                       00020400
*01* SIZE: PAVA header - 20 bytes                                @06C   00020500
*          PAVA entry  - 60 bytes per entry if non-extended format      00020600
*                        was requested.                          @06A   00020700
*                      - 96 bytes per entry if extended format          00020800
*                        was requested.                          @06A   00020900
*                                                                       00021000
*01* STORAGE ESTIMATE =                                                 00021100
*   One per issuance of UCBINFO PAVINFO                                 00021200
*                                                                       00021300
*01* SERIALIZATION = N/A                                                00021400
*                                                                       00021500
* EXTERNAL CLASSIFICATION: GUPI                                       * 00021600
* END OF EXTERNAL CLASSIFICATION                                      * 00021700
*                                                                     * 00021800
*01* NOTES =                                                            00021900
*                                                                       00022000
*      1.  Printing of the macro expansion is controlled by the         00022100
*          ZCBPRINT global macro variable.  Any value other than 'NO'   00022200
*          will result in the macro expansion being printed.  The       00022300
*          default is 'YES'.  The following examples illustrate how the 00022400
*          ZCBPRINT variable should be set.                             00022500
*                                                                       00022600
*               ASM:  GBLC &ZCBPRINT                                    00022700
*                     &ZCBPRINT SETC 'YES'  or   &ZCBPRINT SETC 'NO'    00022800
*              PLAS:  %DCL ZCBPRINT CHAR EXT                            00022900
*                     %ZCBPRINT='YES'       or   %ZCBPRINT='NO'         00023000
*                                                                       00023100
*     2.  A  global  variable IOSDPAVA_INCLUDED is set to YES the first 00023200
*          time the macro is invoked.                                   00023300
*               ASM:  This variable can be checked by the caller, to    00023400
*                     determine if the macro has already been invoked.  00023500
*              PLAS:  This variable is checked in the macro code to     00023600
*                     determine if the control block should be          00023700
*                     included.                                         00023800
*                                                                       00023900
*01* CHANGE ACTIVITY =                                                  00024000
*        $L0=PAVS    ,HBB5520,940210,PDLP:  UCBINFO PAVINFO Service     00024100
*                                                                @L0A   00024200
*        $L1=Shark   ,JBB6607,950811,PDNO:  Pre-Shipping IOSDPAVA to    00024300
*                                           have the PAVADAO field      00024400
*                                           set for RMF          @L1A   00024500
*        $L2=MCSEX   ,HBB7707,020215,PDON:  Multiple Channel Subsystem  00024600
*                                           Migration and Coexistence   00024700
*                                           Support              @L2A   00024800
*        $L3=MCSEX   ,HBB7707,020215,PDON:  Multiple Channel Subsystem  00024900
*                                           (supercedes Migration       00025000
*                                           and Coexistence support)    00025100
*                                                                @L3A   00025200
*        $L4=SCHSET  ,HBB7720,040315,PDSC:  Subchannel sets      @L4A   00025300
*        $L5=IOSODA  ,HBB7730,060331,PDSC:  HyperPAV Support            00025400
*                                           Changes flagged by apar     00025500
*                                           OA13915              @L5A   00025600
*        $L6=ME24883 ,HBB7790,121008,PDDR:  Reship macro after metadata 00025700
*                                           change from CBGEN to macro. 00025800
*                                           OA37160 added keywords to   00025900
*                                           conditionally generate      00026000
*                                           different sections of the   00026100
*                                           macro, so the assembler     00026200
*                                           part must be updated        00026300
*                                           manually.                   00026400
*                                                                       00026500
*        $A1=OA13915 ,HBB7709,061115,PDSC:  HyperPAV support            00026600
*                                           - Add PAVAPAVH and PAVAPCNT 00026700
*                                           - Update PAVATCNT and       00026800
*                                             PAVARRAY for function     00026900
*                                             HYPERPAVALIASES    @A1A   00027000
*                                                                       00027100
*        $P1=PN71322 ,HBB5520,940912,PDLP:  Re-run CBGEN to clean up    00027200
*                                           all hand-modified errors    00027300
*                                                                @P1A   00027400
*        $P2=PWA0210 ,JBB6607,980630,PDNO:  Clean up comments for       00027500
*                                           PAVATCNT and PAVARCNT       00027600
*                                           fields.  Note: This fix     00027700
*                                           is flagged by the shark     00027800
*                                           apar flagging.       @P2A   00027900
*        $P3=PWA0393 ,JBB6607,980915,PDNO:  Add indicator to show when  00028000
*                                           a Pav device is managed     00028100
*                                           by WLM               @P3A   00028200
*        $P4=ME09176 ,HBB7740,070213,PDSC:  Clarify PAVATCNT            00028300
*                                           description          @P4A   00028400
*        $P5=ME10087 ,HBB7750,070213,PDSC:  Updated proprietary         00028500
*                                           information          @P5A   00028600
*                                                                       00028700
*        $01=OW37980 ,HBB6603,990531,PDLZ:  Dynamic PAV support. Note:  00028800
*                                           This mapping is completely  00028900
*                                           redesigned, no change       00029000
*                                           flags are added      @01A   00029100
*        $02=OW42289 ,HBB6603,000131,PDNO:  Fix PAVAPAVW assembler      00029200
*                                           mapping              @02A   00029300
*        $03=OW43831 ,HBB6603,000915,PDNO:  - Comment changes to        00029400
*                                           clarify fields       @03A   00029500
*        $04=OW57714 ,HBB7703,030331,PDON:  No code changes. Shipped    00029600
*                                           for completeness.    @04A   00029700
*        $05=OA11635 ,HBB7720,050805,PDNO:  Correct copyright info      00029800
*                                                                @05A   00029900
*        $06=OA37160 ,HBB7770,120901,PDDR:  - Allow PAV device list to  00030000
*                                           be addressed as individual  00030100
*                                           entries instead of an array 00030200
*                                           to allow it to be expanded  00030300
*                                           compatibly in the future.   00030400
*                                           This type of PAVA will have 00030500
*                                           a version number of at      00030600
*                                           least 3.                    00030700
*                                           - Added I/O priority delay  00030800
*                                           and interrupt delay times   00030900
*        $07=OA43453 ,HBB7780,141130,PDSC:  Alias Throttling            00031000
*                                                                       00031100
*****END OF SPECIFICATIONS********************************************/ 00031200
*% /*                                                                   00031300
.P0      ANOP                                                           00031400
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 00031500
         AIF   ('&LIST' EQ 'YES').P2                                    00031600
.P1      ANOP                                                           00031700
         PUSH  PRINT                                                    00031800
         PRINT OFF                                                      00031900
.P2      ANOP                                                           00032000
         AIF   ('&PAVA' EQ 'NO').L0002                                  00032100
         AIF   ('&DSECT' EQ 'YES').L0003                                00032200
         AIF   ('&PAVA' NE 'YES').L0002                                 00032300
PAVA     DS    0F        PAVA information mapping                       00032400
         AGO   .L0004                                                   00032500
.L0003   ANOP                                                           00032600
PAVA     DSECT           PAVA information mapping                       00032700
.L0004   ANOP                                                           00032800
PAVAHEAD DS    0CL20     Header                                         00032900
PAVAID   DS    CL4       Eye catcher                                    00033000
PAVAVERS DS    X         Version                                        00033100
PAVAPCNT DS    X         If the requested device is a HyperPAV base    *00033200
                         device, this field contains the count of      *00033300
                         HyperPAV alias devices configured in the LSS  *00033400
                         pool.                                          00033500
PAVALNTH DS    H         Length of PAVA as input to UCBINFO service     00033600
PAVATCNT DS    H         --- For PAVINFO requests: If PAVAPAVB is on   *00033700
                         indicating the input device is an active      *00033800
                         PAV-base, then this field contains the        *00033900
                         current total number of PAV devices           *00034000
                         associated with the input device (i.e., the   *00034100
                         count of bound PAV-alias devices plus 1 for   *00034200
                         the PAV-base). Otherwise, this field is set   *00034300
                         to one. Note: If the PAVINFO service          *00034400
                         indicates the PAVAREA was not large enough to *00034500
                         contain all of the device entries, this field  00034600
*                        should be used to recalculate the new size    *00034700
                         for the PAVAREA. The new size is the PAVA     *00034800
                         header plus the size of a PAVA entry          *00034900
                         multiplied by the PAVATCNT --- For            *00035000
                         HYPERPAVALIASES requests: If the input device *00035100
                         is a HyperPAV device, this field contains the *00035200
                         current total number of alias exposures in    *00035300
                         the logical subsystem for the input device.    00035400
PAVARCNT DS    H         Count of the number of PAVA entries           *00035500
                         filled in by this service. Notes: . This      *00035600
                         field is not equal to PAVATCNT when the       *00035700
                         PAVAREA passed by the caller is not large     *00035800
                         enough to contain all of the PAV devices      *00035900
                         associated with the input device . If         *00036000
                         PAVINFOSUM=YES is specified, PAVARCNT is set  *00036100
                         equal to PAVATCNT by this service         @06C 00036200
PAVAIOQ  DS    0CL4      IOQ counts                                     00036300
PAVAIOQS DS    H         Number of started IOQs                         00036400
PAVAIOQC DS    H         Total number of IOQs                           00036500
PAVATOKN DS    CL4       PAV token - changes every time the set of     *00036600
                         PAV-Alias devices change in any way            00036700
.*                                                                      00036800
.*--------------------------------------------------------------------* 00036900
.* If an extended format PAVA was requested, generate a label for     * 00037000
.* the end of the PAVA header and a DSECT for the PAVA entry.         * 00037100
.* Otherwise, generate a label for the fixed size PAVA array          * 00037200
.* element.                                                       @06A* 00037300
.*--------------------------------------------------------------------* 00037400
         AIF   ('&EXTFORMAT' NE 'YES').PAVARRAY                         00037500
.*                       Check if extended format requested        @06A 00037600
PAVAHEnd DS    0F        End of PAVA header                        @06A 00037700
         SPACE 1                                                        00037800
PAVAEntry DSECT ,        PAVA Entry                                     00037900
.*                                                                      00038000
         AGO   .PAVCOMMN  Go to common mapping                     @06A 00038100
.*                                                                      00038200
.PAVARRAY ANOP ,                                                   @06A 00038300
PAVARRAY DS    0CL60     PAVA array element. Each element represents a *00038400
                         single exposure in the PAV. The first element *00038500
                         contains information on the PAV-base device   *00038600
                         and the subsequent entries contain            *00038700
                         information on the bound PAV-alias device(s). *00038800
                         If HYPERPAVALIASES is selected, each element  *00038900
                         represents a single HyperPAV-alias device in  *00039000
                         the logical subsystem for the input device.   *00039100
                         Note: If the input device is a non-PAV DASD,  *00039200
                         only the first element will be filled in and   00039300
*                        will contain information for the input        *00039400
                         device.                                        00039500
.PAVCOMMN ANOP ,                                                   @06A 00039600
PAVADEVN DS    H         Device number                                  00039700
PAVAFLG1 DS    0CL2      Flag byte                                      00039800
PAVAPAVC EQU   X'80'     PAV-base capability                            00039900
PAVAPAVB EQU   X'40'     Indicates that the input device is an active  *00040000
                         PAV-base. This implies the PAV-base has one   *00040100
                         or more bound PAV-alias devices associated    *00040200
                         with it.                                       00040300
PAVAPAVA EQU   X'20'     PAV-Alias device                               00040400
PAVAPAVW EQU   X'10'     Customer has requested that this PAV device   *00040500
                         be WLM managed                                 00040600
PAVAMCMB EQU   X'08'     Indicates if measurement data is collected    *00040700
                         for this device                                00040800
PAVASTSC EQU   X'04'     Indicates if model dependent subchannel data  *00040900
                         was stored                                     00041000
PAVADBTS EQU   X'02'     Indicates if device busy time was stored      *00041100
                         (version 1 and above)                          00041200
PAVAPAVH EQU   X'01'     Indicates if the device is a HyperPAV device.  00041300
         ORG   PAVAFLG1+2                                               00041400
PAVACMB  DS    0CL32     If PAVAMCMB is set, Channel Measurement Block *00041500
                         Data                                           00041600
PAVASCHC DS    H         SSCH+RSCH instruction count                    00041700
PAVASAMP DS    H         Sample count                                   00041800
PAVACONN DS    F         Connect time                                   00041900
PAVAPEND DS    F         Pending time                                   00042000
PAVADISC DS    F         Disconnect time                                00042100
PAVACUQT DS    F         Control unit queue time                        00042200
PAVADAO  DS    F         Device-active-only time                        00042300
         DS    F         Reserved                                       00042400
PAVAICMR DS    F         Initial command response time                  00042500
PAVASMDB DS    0CL12     Subchannel model dependent data                00042600
PAVADBSY DS    F         Device Busy time                               00042700
PAVACBSY DS    F         Control-Unit Busy time                         00042800
PAVASBSY DS    F         Switch Busy time                               00042900
PAVAECMB DS    0CL8      If PAVAMCMB is set, 4 byte ECMB channel       *00043000
                         measurement counts (version 1 and above)       00043100
PAVASCH4 DS    F         4-byte SSCH+RSCH count                         00043200
PAVASAM4 DS    F         4-byte sample count                            00043300
PAVASSID DS    X         Subchannel set id (version 2 and above)        00043400
         DS    CL1       Reserved                                  @06C 00043500
PAVAELen DS    H         Length of entry.  This field is filled in     *00043600
                         for version 3 and above                   @06A 00043700
PAVANEFEnd DS  0F        End of non-extended format entry          @06A 00043800
.*                                                                      00043900
.*--------------------------------------------------------------------* 00044000
.* If an extended format PAVA was requested, generate the             * 00044100
.* extended format entry, which will contain information for          * 00044200
.* version 3 and above.                                           @06A* 00044300
.*--------------------------------------------------------------------* 00044400
         AIF   ('&EXTFORMAT' NE 'YES').PAVACONST                        00044500
.*                       Check if extended format requested        @06A 00044600
PAVAEFStart DS 0F        Start of area for extended format entry       *00044700
                         (version 3 and above)                     @06A 00044800
PAVAInterruptDelay  DS F Interrupt delay time                      @06A 00044900
PAVAIOPriorityDelay DS F I/O Priority delay time                   @06A 00045000
PAVAThrottleDelayCount DS F Accumulated count of I/Os that had imposed *00045100
                         delay times                               @07A 00045200
         DS    CL24      Reserved                                  @07C 00045300
PAVAV3End DS   0X        End of version 3 entry                    @06A 00045400
.*                                                                      00045500
.PAVACONST ANOP ,                                                  @06A 00045600
*                                                                       00045700
PAVANAME EQU   C'PAVA'   Defines PAVAID field                           00045800
PAVAVER1 EQU   1         PAVAVERS version 1                             00045900
PAVAVER2 EQU   2         PAVAVERS version 2                             00046000
PAVAVER3 EQU   3         PAVAVERS version 3                        @06A 00046100
PAVA_LEN EQU   L'PAVAHead+(PAVANEFEnd-PAVADevn)                         00046200
*                        Length of PAVA header plus one                 00046300
*                        non-extended format PAVA entry            @06C 00046400
.L0002   ANOP                                                           00046500
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 00046600
         AIF   ('&LIST' EQ 'YES').P4                                    00046700
.P3      ANOP                                                           00046800
         POP   PRINT                                                    00046900
.P4      ANOP                                                           00047000
.P_EXIT  ANOP                                                           00047100
         MEND                                                           00047200
**/ IOSDPAVA_2:;                                                        00047300
* %IOSDPAVA_INCLUDED = 'YES';                                           00047400
* %DCL ZCBPRINT CHAR EXT;                                               00047500
* %DEACTIVATE ZCBPRINT;                                                 00047600
* %DCL IOSDPAVA_LIST CHAR EXT;                                          00047700
* %DEACTIVATE IOSDPAVA_LIST;                                            00047800
* %IF IOSDPAVA_LIST ^= 'NO' &                                           00047900
*    ZCBPRINT ^= 'NO' %THEN                                             00048000
*   %GOTO IOSDPAVA_3;                                                   00048100
*   @LIST PUSH NOECHO;                                                  00048200
*   @LIST NOASSEMBLE NOECHO;                                            00048300
*   @LIST OFF C NOECHO;                                                 00048400
* %IOSDPAVA_3:;                                                         00048500
*/* Start of PL/X Source                                             */ 00048600
*@LOGIC;                                                                00048700
*#PRAGMA TOOL=PADI                                                      00048800
* #PADIDELETE.PAVA_LEN                                                  00048900
*#EPRAGMA                                                               00049000
*@ENDLOGIC;                                                             00049100
*/********************************************************************/ 00049200
*/*                                                                  */ 00049300
*/* PAVA Header Definition                                           */ 00049400
*/*                                                              @06A*/ 00049500
*/********************************************************************/ 00049600
*DCL 1  PAVA  BDY(WORD) BASED,  /* PAVA information mapping          */ 00049700
*       3 PAVAHEAD,             /* Header                            */ 00049800
*         5 PAVAID   CHAR(4),   /* Eye catcher                       */ 00049900
*         5 PAVAVERS FIXED(8),  /* Version                           */ 00050000
*         5 PAVAPCNT FIXED(8),  /* If the requested device is a         00050100
*                                  HyperPAV base device, this field     00050200
*                                  contains the count of HyperPAV       00050300
*                                  alias devices configured in the      00050400
*                                  LSS pool.                     @A1A*/ 00050500
*         5 PAVALNTH FIXED(16), /* Length of PAVA as input to UCBINFO   00050600
*                                  service                           */ 00050700
*         5 PAVATCNT FIXED(16), /* --- For PAVINFO requests:            00050800
*                                  If PAVAPAVB is on indicating the     00050900
*                                  input device is an active PAV-base,  00051000
*                                  then this field contains the         00051100
*                                  current total number of PAV devices  00051200
*                                  associated with the input device     00051300
*                                  (i.e., the count of bound PAV-alias  00051400
*                                  devices plus 1 for the PAV-base).    00051500
*                                  Otherwise, this field is set to one. 00051600
*                                  Note: If the PAVINFO service         00051700
*                                  indicates the PAVAREA was not large  00051800
*                                  enough to contain all of the device  00051900
*                                  entries, this field should be used   00052000
*                                  to recalculate the new size for the  00052100
*                                  PAVAREA.  The new size is the PAVA   00052200
*                                  header plus the size of a PAVA       00052300
*                                  entry multiplied by the PAVATCNT     00052400
*                                  --- For HYPERPAVALIASES requests: If 00052500
*                                  the input device is a HyperPAV       00052600
*                                  device, this field contains          00052700
*                                  the current total number of alias    00052800
*                                  exposures in the logical subsystem   00052900
*                                  for the input device.                00053000
*                                                                @P4C*/ 00053100
*         5 PAVARCNT  FIXED(16), /* Count of the number of PAVA         00053200
*                                  entries filled in by this service.   00053300
*                                  Notes:                               00053400
*                                   . This field is not equal to        00053500
*                                     PAVATCNT when the PAVAREA passed  00053600
*                                     by the caller is not large        00053700
*                                     enough to contain all of the      00053800
*                                     PAV devices associated with the   00053900
*                                     input device                      00054000
*                                   . If PAVINFOSUM=YES is specified,   00054100
*                                     PAVARCNT is set equal to          00054200
*                                     PAVATCNT by this service   @06C*/ 00054300
*         5 PAVAIOQ,            /* IOQ counts                        */ 00054400
*           7 PAVAIOQS FIXED(16), /* Number of started IOQs          */ 00054500
*           7 PAVAIOQC FIXED(16), /* Total number of IOQs            */ 00054600
*         5 PAVATOKN CHAR(4),   /* PAV token - changes every time       00054700
*                                  the set of PAV-Alias devices change  00054800
*                                  in any way                        */ 00054900
*                                                                       00055000
*%IF IOSDPAVA_ExtFormat = 'YES' %THEN /* Extended format         @06A*/ 00055100
*  %DO;                             /*                           @06A*/ 00055200
*         5 PAVAHEnd CHAR(0);   /* End of PAVA header            @06A*/ 00055300
*  %END;                            /*                           @06A*/ 00055400
*                                                                       00055500
*/********************************************************************/ 00055600
*/*                                                                  */ 00055700
*/* PAVA Entry Definition                                            */ 00055800
*/*                                                                  */ 00055900
*/* Each entry represents a single exposure in the PAV.  The first   */ 00056000
*/* entry contains information on the PAV-base device and the        */ 00056100
*/* subsequent entries contain information on the bound PAV-alias    */ 00056200
*/* device(s).  If HYPERPAVALIASES is selected, each element         */ 00056300
*/* represents a single HyperPAV-alias device in the logical         */ 00056400
*/* subsystem for the input device.  Note: If the input device is a  */ 00056500
*/* non-PAV DASD, only the first element will be filled in and will  */ 00056600
*/* contain information for the input device.                        */ 00056700
*/*                                                              @06A*/ 00056800
*/********************************************************************/ 00056900
*%IF IOSDPAVA_ExtFormat = 'YES' %THEN /* Extended format         @06A*/ 00057000
*  %DO;                                                                 00057100
*                                                                       00057200
*DCL 1 PAVAEntry BDY(WORD) BASED, /* PAVA Entry                  @06A*/ 00057300
*                                                                       00057400
*  %END;                        /* Extended format               @06A*/ 00057500
*%ELSE                          /* Else non-extended format      @06A*/ 00057600
*  %DO;                                                                 00057700
*                                                                       00057800
*       3 PAVARRAY(*) BDY(WORD),/* PAVA array                    @06C*/ 00057900
*                                                                       00058000
*  %END;                        /* Non-extended format           @06A*/ 00058100
*                                                                       00058200
*         5 PAVADEVN FIXED(16), /* Device number                     */ 00058300
*         5 PAVAFLG1 CHAR(2),   /* Flag byte                         */ 00058400
*           7 PAVAPAVC BIT(1),  /* PAV-base capability               */ 00058500
*           7 PAVAPAVB BIT(1),  /* Indicates that the input device      00058600
*                                  is an active PAV-base.  This         00058700
*                                  implies the PAV-base has one or      00058800
*                                  more bound PAV-alias devices         00058900
*                                  associated with it.           @03C*/ 00059000
*           7 PAVAPAVA BIT(1),  /* PAV-Alias device                  */ 00059100
*           7 PAVAPAVW BIT(1),  /* Customer has requested that this     00059200
*                                  PAV device be WLM managed     @P3A*/ 00059300
*           7 PAVAMCMB BIT(1),  /* Indicates if measurement data        00059400
*                                  is collected for this device      */ 00059500
*           7 PAVASTSC BIT(1),  /* Indicates if model dependent         00059600
*                                  subchannel data was stored        */ 00059700
*           7 PAVADBTS BIT(1),  /* Indicates if device busy time was    00059800
*                                  stored (version 1 and above)  @L3C*/ 00059900
*           7 PAVAPAVH BIT(1),  /* Indicates if the device is a         00060000
*                                  HyperPAV device.              @A1A*/ 00060100
*         5 PAVACMB  CHAR(32) BDY(WORD), /*  If PAVAMCMB is set,        00060200
*                                    Channel Measurement Block Data  */ 00060300
*           7 PAVASCHC FIXED(16), /* SSCH+RSCH instruction count     */ 00060400
*           7 PAVASAMP FIXED(16), /* Sample count                    */ 00060500
*           7 PAVACONN FIXED(32), /* Connect time                    */ 00060600
*           7 PAVAPEND FIXED(32), /* Pending time                    */ 00060700
*           7 PAVADISC FIXED(32), /* Disconnect time                 */ 00060800
*           7 PAVACUQT FIXED(32), /* Control unit queue time         */ 00060900
*           7 PAVADAO  FIXED(32), /* Device-active-only time     @L1A*/ 00061000
*           7 *        FIXED(32), /* Reserved                        */ 00061100
*           7 PAVAICMR FIXED(32), /* Initial command response time      00061200
*                                                                @L2C*/ 00061300
*         5 PAVASMDB CHAR(12) BDY(WORD),/* Subchannel model dependent   00061400
*                                    data                            */ 00061500
*           7 PAVADBSY Fixed(32), /* Device Busy time                */ 00061600
*           7 PAVACBSY Fixed(32), /* Control-Unit Busy time          */ 00061700
*           7 PAVASBSY Fixed(32), /* Switch Busy time                */ 00061800
*         5 PAVAECMB CHAR(8) BDY(WORD),/* If PAVAMCMB is set, 4 byte    00061900
*                                    ECMB channel measurement counts    00062000
*                                    (version 1 and above)       @L3C*/ 00062100
*           7 PAVASCH4 FIXED(32), /* 4-byte SSCH+RSCH count      @L3C*/ 00062200
*           7 PAVASAM4 FIXED(32), /* 4-byte sample count         @L3C*/ 00062300
*         5 PAVASSID FIXED(8),  /* Subchannel set id (version 2 and     00062400
*                                  above)                        @L4A*/ 00062500
*         5 *        CHAR(1)    /* Reserved                      @06C*/ 00062600
*        ,5 PAVAELen FIXED(15)  /* Length of entry.  This field is      00062700
*                                  filled in for version 3 and          00062800
*                                  above.  It is unpredictable          00062900
*                                  for versions 0 through 2.     @06A*/ 00063000
*        ,5 PAVANEFEnd CHAR(0)  /* End of area for non-extended         00063100
*                                  format entry                  @06A*/ 00063200
*                                                                       00063300
*%IF IOSDPAVA_ExtFormat = 'YES' %THEN /* Extended format         @06A*/ 00063400
*  %DO;                                                                 00063500
*                                                                       00063600
*      ,3 PAVAEFStart           /* Start of area for extended           00063700
*                                  format entry (version 3 and          00063800
*                                  above)                        @06A*/ 00063900
*        ,5 PAVAInterruptDelay FIXED(32) /*                             00064000
*                                  Interrupt delay time          @06A*/ 00064100
*        ,5 PAVAIOPriorityDelay FIXED(32) /*                            00064200
*                                  I/O priority delay time       @06A*/ 00064300
*        ,5 PAVAThrottleDelayCount Fixed(32) /*                         00064400
*                                  Accumulated count of I/Os that had   00064500
*                                  imposed delay times           @07A*/ 00064600
*        ,5 * CHAR(24)          /* Reserved                      @07C*/ 00064700
*        ,5 PAVAV3End CHAR(0)   /* End of version 3 entry        @06A*/ 00064800
*                                                                       00064900
*  %END;                        /* Extended format               @06A*/ 00065000
*                                                                       00065100
*        ;                      /* End of PAVA entry             @06A*/ 00065200
*                                                                       00065300
*/********************************************************************/ 00065400
*/*                                                                  */ 00065500
*/* PAVA Constants.                                                  */ 00065600
*/*                                                              @06A*/ 00065700
*/********************************************************************/ 00065800
*  DCL PAVANAME CHAR(4) CONSTANT('PAVA'); /* Defines PAVAID field    */ 00065900
*  DCL PAVAVER1 FIXED(8) CONSTANT(1); /* PAVAVERS version 1      @L3A*/ 00066000
*  DCL PAVAVER2 FIXED(8) CONSTANT(2); /* PAVAVERS version 2      @L4A*/ 00066100
*  DCL PAVAVER3 FIXED(8) CONSTANT(3); /* PAVAVERS version 3      @06A*/ 00066200
*/* End of PL/X Source                                               */ 00066300
* %IF IOSDPAVA_LIST ^= 'NO' &                                           00066400
*    ZCBPRINT ^= 'NO' %THEN                                             00066500
*   %GOTO IOSDPAVA_4;                                                   00066600
*   @LIST POP NOECHO;                                                   00066700
* %IOSDPAVA_4:;                                                         00066800
* %END;                                                                 00066900
