*                                                                       00001000
* %DCL IOSDS124_INCLUDED CHAR EXT;                                      00002000
* %DEACTIVATE IOSDS124_INCLUDED;                                        00003000
* %IF IOSDS124_INCLUDED = '' %THEN                                      00004000
* %DO;                                                                  00005000
*/* Macro made bi-lingual on 21195. CBGEN compile date 21138         */ 00006000
*% /*                                                                   00007000
         MACRO                                                          00008000
         IOSDS124 &DSECT=YES,&LIST=YES,&TITLE=YES,&SMF124REC=YES,      *00009000
               &SMF124S1_PORTSECT=COND,                                *00010000
               &SMF124S2_EPSECSTAT_SECTION=COND,                       *00011000
               &SMF124S3_AUTHKEYUPD_SECTION=COND,                      *00012000
               &SMF124S4_ENCRKEYUPD_SECTION=COND,                      *00013000
               &SMF124S5_EXTKEYMGRINFO_SECTION=COND                     00014000
         GBLC  &IOSDS124_INCLUDED                                       00015000
         GBLC  &ZCBPRINT                                                00016000
&IOSDS124_INCLUDED SETC 'YES'                                           00017000
         AIF   ('&LIST' EQ 'NONE').P0                                   00018000
         AIF   ('&TITLE' EQ 'NO').P5                                    00019000
 TITLE   'IOSDS124  - SMF Record Type 124                            '  00020000
.P5      ANOP                                                           00021000
**/ ;                                                                   00022000
*/* START OF SPECIFICATIONS ******************************************* 00023000
*                                                                       00024000
*01* PROPRIETARY STATEMENT=                                             00025000
*                                                                       00026000
*   LICENSED MATERIALS - PROPERTY OF IBM                                00027000
*   5650-ZOS                                                            00028000
*   COPYRIGHT IBM CORP. 2019                                            00029000
*                                                                       00030000
*01* STATUS = HBB77C0                                                   00031000
*                                                                       00032000
*01* END OF PROPRIETARY STATEMENT                                       00033000
*                                                                       00034000
*01* EXTERNAL CLASSIFICATION: PI                                        00035000
*01* END OF EXTERNAL CLASSIFICATION:                                    00036000
*                                                                       00037000
*01* DESCRIPTIVE NAME:  SMF Record Type 124                             00038000
*                                                                       00039000
*01* MACRO NAME:  IOSDS124                                              00040000
*                                                                       00041000
*01* DSECT NAME:                                                        00042000
*     SMF124REC                                                         00043000
*                                                                       00044000
*01* COMPONENT:  IOS (SC1C3)                                            00045000
*                                                                       00046000
*01* EYE-CATCHER:  None                                                 00047000
*                                                                       00048000
*01* STORAGE ATTRIBUTES:                                                00049000
*02*  SUBPOOL:  Caller-supplied                                         00050000
*02*  KEY:  Caller-supplied                                             00051000
*02*  RESIDENCY:  Caller-supplied                                       00052000
*                                                                       00053000
*01* SIZE:                                                              00054000
*            SMF124REC                      -- X'0020' bytes            00055000
*            SMF124S1_PORTSECT              -- X'0100' bytes            00056000
*            SMF124S2_EPSECSTAT_SECTION     -- X'0039' bytes            00057000
*            SMF124S3_AUTHKEYUPD_SECTION    -- X'0028' bytes            00058000
*            SMF124S4_ENCRKEYUPD_SECTION    -- X'0037' bytes            00059000
*            SMF124S5_EXTKEYMGRINFO_SECTION -- X'0122' bytes            00060000
*    Variable, see field SMF124LEN                                      00061000
*                                                                       00062000
*01* CREATED BY: IOSVLKSM                                               00063000
*                                                                       00064000
*01* POINTED TO BY: N/A                                                 00065000
*                                                                       00066000
*01* SERIALIZATION: None                                                00067000
*                                                                       00068000
*01* FUNCTION:                                                          00069000
*02* The SMF record 124 starts with a standard header for SMF           00070000
*    records which support sub-types. The header is followed by a       00071000
*    field count and a list of field information blocks containing      00072000
*    the offset to and length of the actual field data located further  00073000
*    into the individual SMF record.                                    00074000
*                                                                       00075000
*01* METHOD OF ACCESS:                                                  00076000
*02*  ASM:                                                              00077000
*      IOSDS124                                                         00078000
*                                                                       00079000
*02*  PL/X:                                                             00080000
*      %INCLUDE SYSLIB(IOSDS124)                                        00081000
*                                                                       00082000
*01* DELETED BY:                                                        00083000
*      N/A                                                              00084000
*                                                                       00085000
*01* FREQUENCY:                                                         00086000
*      One SMF record for each unique tracked instances if SMF          00087000
*      recording is enabled.                                            00088000
*                                                                       00089000
*01* DEPENDENCIES:                                                      00090000
*      None                                                             00091000
*                                                                       00092000
*01* DISTRIBUTION LIBRARY:  AMACLIB                                     00093000
*                                                                       00094000
*01* CHANGE ACTIVITY:                                                   00095000
*                                                                       00096000
*    $00=OA49089  HBB7790  160215 PDMD: Read Diagnostic Parameters      00097000
*    $01=OA51642  HBB7790  170228 PDB7: RDP updates                     00098000
*                                   - Add the attached port name        00099000
*    $02=OA51289  HBB7790  170915 PDB7: RDP updates                     00100000
*                                   - Associated CHPID will be filled   00101000
*                                     in for all port types             00102000
*    $03=OA56924  HBB77A0  200227 PDMD: Encryption of Data in Flight    00103000
*                                       - story 353419                  00104000
*    $04=OA59792  HBB77B0  210630 PDMD: Encryption of Data in Flight    00105000
*                                       part 2                          00106000
*                                   - D349300, interface id validity    00107000
*                                                                       00108000
*    $L1=302448   HBB77C0  190225 PDXB: Accommodate C                   00109000
*                                                                       00110000
* END OF SPECIFICATIONS *********************************************/  00111000
*% /*                                                                   00112000
.P0      ANOP                                                           00113000
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 00114000
         AIF   ('&LIST' EQ 'YES').P2                                    00115000
.P1      ANOP                                                           00116000
         PUSH  PRINT                                                    00117000
         PRINT OFF                                                      00118000
.P2      ANOP                                                           00119000
*                                                                       00120000
* ********************************************************************  00121000
* *                                                                  *  00122000
* * SMF Record Type and Subtype Constants                            *  00123000
* *                                                                  *  00124000
* ********************************************************************  00125000
*                                                                       00126000
*                                                                       00127000
SMF124RECORDTYPE EQU 124 SMF record type                                00128000
SMF124RECORDSUBTYPELINKDIAG EQU 1 Subtype 1 - Link Diagnostic          *00129000
                         Information                                    00130000
SMF124RECORDSUBTYPEEPSECSTAT EQU 2 Subtype 2 - Endpoint security       *00131000
                         Status                                         00132000
SMF124RECORDSUBTYPEEPSECAUTHKEYUPD EQU 3 Subtype 3 - Endpoint security *00133000
                         authentication key update                      00134000
SMF124RECORDSUBTYPEEPSECENCRKEYUPD EQU 4 Subtype 4 - Endpoint security *00135000
                         encryption key update                          00136000
SMF124RECORDSUBTYPEEXTKEYMGR EQU 5 Subtype 5 - External key manager    *00137000
                         event record                                   00138000
         AIF   ('&SMF124REC' EQ 'NO').L0002                             00139000
         AIF   ('&DSECT' EQ 'YES').L0003                                00140000
         AIF   ('&SMF124REC' NE 'YES').L0002                            00141000
.L0003   ANOP                                                           00142000
*                                                                       00143000
* ********************************************************************  00144000
* *                                                                  *  00145000
* * SMF 124 Record Header                                            *  00146000
* *                                                                  *  00147000
* ********************************************************************  00148000
*                                                                       00149000
*                                                                       00150000
         AIF   ('&DSECT' EQ 'YES').L0004                                00151000
SMF124REC DS   0F                                                       00152000
         AGO   .L0005                                                   00153000
.L0004   ANOP                                                           00154000
SMF124REC DSECT                                                         00155000
.L0005   ANOP                                                           00156000
SMF124HDRPFX DS CL24     Standard SMF header w/subtype                  00157000
         ORG   SMF124HDRPFX                                             00158000
SMF124LEN DS   H         Record length                                  00159000
SMF124SEG DS   H         Segment descriptor                             00160000
SMF124FLG DS   B         Flags                                          00161000
*  Bit definitions:                                                     00162000
SMF124FLG_SUBSYS EQU X'80' Subsystem id specified                       00163000
SMF124FLG_SUBTYPE EQU X'40' Subtypes are used                           00164000
SMF124RTY DS   X         Record Type (=124 '7C'X)                       00165000
SMF124TME DS   FL4       Time since midnight in hundredths of a second *00166000
                         that the record was moved into the SMF buffer  00167000
SMF124DTE DS   BL4       Date when record was moved into the SMF       *00168000
                         buffer. Format: 0cyydddF                       00169000
SMF124SID DS   CL4       System identification                          00170000
SMF124SSI DS   CL4       Subsystem identification                       00171000
SMF124STY DS   H         Record subtype. See Smf124RecordSubType above  00172000
SMF124HDR DS   CL8       Self-defining header                           00173000
         ORG   SMF124HDR                                                00174000
SMF124HDR_LEN DS H       Length of header                               00175000
SMF124HDR_TRPLCNT DS H   Number of triplets in header                   00176000
SMF124HDR_FLAGS DS BL2   Header flags                                   00177000
         DS    CL2       Reserved                                       00178000
SMF124HDRTRIPLETS DS 0C  Start of subtype triplets. See the individual *00179000
                         subtypes for the definition of the triplets   *00180000
                         for the particular subtype.                    00181000
SMF124REC_LEN EQU *-SMF124REC                                           00182000
*                                                                       00183000
* ********************************************************************  00184000
* *                                                                  *  00185000
* * Subtype 1 (Link Diagnostic Information) - Triplets               *  00186000
* *                                                                  *  00187000
* ********************************************************************  00188000
*                                                                       00189000
*                                                                       00190000
         ORG   SMF124HDRTRIPLETS                                        00191000
SMF124S1_TRIPLETS DS 0X                                                 00192000
SMF124S1_PORT_OFFSET DS F Offset of port section from start of record   00193000
SMF124S1_PORT_LEN DS H   Length of port section                         00194000
SMF124S1_PORT_NUM DS H   Number of port sections                        00195000
SMF124S1_TRIPLETS_LEN EQU *-SMF124S1_TRIPLETS                           00196000
         ORG   ,                                                        00197000
*                                                                       00198000
* ********************************************************************  00199000
* *                                                                  *  00200000
* * Subtype 2 (Endpoint Security Status) Triplets                    *  00201000
* *                                                                     00202000
* ********************************************************************  00203000
*                                                                       00204000
*                                                                       00205000
         ORG   SMF124HDRTRIPLETS                                        00206000
SMF124S2_TRIPLETS DS 0X                                                 00207000
SMF124S2_EPSECSTAT_OFFSET DS F Offset of Endpoint-Security Status      *00208000
                         section from start of record                   00209000
SMF124S2_EPSECSTAT_LEN DS H Length of Endpoint-Security Status section *00210000
                         from start of record                           00211000
SMF124S2_EPSECSTAT_NUM DS H Number of Endpoint-Security Status         *00212000
                         sections                                       00213000
SMF124S2_TRIPLETS_LEN EQU *-SMF124S2_TRIPLETS                           00214000
         ORG   ,                                                        00215000
*                                                                       00216000
* ********************************************************************  00217000
* *                                                                  *  00218000
* * Subtype 3 (Endpoint Security Authentication Key Update) Triplets *  00219000
* *                                                                     00220000
* ********************************************************************  00221000
*                                                                       00222000
*                                                                       00223000
         ORG   SMF124HDRTRIPLETS                                        00224000
SMF124S3_TRIPLETS DS 0X                                                 00225000
SMF124S3_AUTHKEYUPD_OFFSET DS F Offset of endpoint security            *00226000
                         authentication key update section from start  *00227000
                         of the record                                  00228000
SMF124S3_AUTHKEYUPD_LEN DS H Length of endpoint security               *00229000
                         authentication key update section              00230000
SMF124S3_AUTHKEYUPD_NUM DS H Number of endpoint security               *00231000
                         authentication key update sections             00232000
SMF124S3_TRIPLETS_LEN EQU *-SMF124S3_TRIPLETS                           00233000
         ORG   ,                                                        00234000
*                                                                       00235000
* ********************************************************************  00236000
* *                                                                  *  00237000
* * Subtype 4 (Endpoint Security Encryption Key Update) Triplets     *  00238000
* *                                                                     00239000
* ********************************************************************  00240000
*                                                                       00241000
*                                                                       00242000
         ORG   SMF124HDRTRIPLETS                                        00243000
SMF124S4_TRIPLETS DS 0X                                                 00244000
SMF124S4_ENCRKEYUPD_OFFSET DS F Offset of endpoint security encryption *00245000
                         key update section from start of the record    00246000
SMF124S4_ENCRKEYUPD_LEN DS H Length of endpoint security encryption    *00247000
                         key update section                             00248000
SMF124S4_ENCRKEYUPD_NUM DS H Number of endpoint security encryption    *00249000
                         key update sections                            00250000
SMF124S4_TRIPLETS_LEN EQU *-SMF124S4_TRIPLETS                           00251000
         ORG   ,                                                        00252000
*                                                                       00253000
* ********************************************************************  00254000
* *                                                                  *  00255000
* * Subtype 5 (External Key Manager Info) Triplets                   *  00256000
* *                                                                     00257000
* ********************************************************************  00258000
*                                                                       00259000
*                                                                       00260000
         ORG   SMF124HDRTRIPLETS                                        00261000
SMF124S5_TRIPLETS DS 0X                                                 00262000
SMF124S5_EXTKEYMGRINFO_OFFSET DS F Offset of external key manager      *00263000
                         information from start of record               00264000
SMF124S5_EXTKEYMGRINFO_LEN DS H Length of external key manager         *00265000
                         information section                            00266000
SMF124S5_EXTKEYMGRINFO_NUM DS H Number of external key manager         *00267000
                         information sections                           00268000
SMF124S5_TRIPLETS_LEN EQU *-SMF124S5_TRIPLETS                           00269000
         ORG   ,                                                        00270000
.L0002   ANOP                                                           00271000
         AIF   ('&SMF124S1_PORTSECT' EQ 'NO').L0006                     00272000
         AIF   ('&DSECT' EQ 'YES').L0007                                00273000
         AIF   ('&SMF124S1_PORTSECT' NE 'YES').L0006                    00274000
.L0007   ANOP                                                           00275000
*                                                                       00276000
* ********************************************************************  00277000
* *                                                                  *  00278000
* * Subtype 1 (Link Diagnostic Information) - Port Section           *  00279000
* *                                                                  *  00280000
* ********************************************************************  00281000
*                                                                       00282000
*                                                                       00283000
         AIF   ('&DSECT' EQ 'YES').L0008                                00284000
SMF124S1_PORTSECT DS 0F  Start of port section                          00285000
         AGO   .L0009                                                   00286000
.L0008   ANOP                                                           00287000
SMF124S1_PORTSECT DSECT   Start of port section                         00288000
.L0009   ANOP                                                           00289000
SMF124S1_RETDATE DS F    Date the information was retrieved in         *00290000
                         0cyymmmF format                                00291000
SMF124S1_RETTIME DS F    Time since midnight, in hundredths of a       *00292000
                         second, that the information was retrieved     00293000
SMF124S1_WWPN DS CL8     World wide port name (WWPN) of the port        00294000
SMF124S1_REPORTSRC DS X  Reporting source - see constant definitions   *00295000
                         below *****************************************00296000
                         ************** Port Identifier and Port Type  *00297000
                         The contents and size of the identifier is    *00298000
                         dependent on the port type                    *00299000
                         (SMF124S1_PortType) and the identifier size   *00300000
                         in SMF124S1_IdSize. -- Channel port - Byte 1  *00301000
                         contains the CHPID. Bytes 2 and 3 contain the *00302000
                         physical channel identifier (PCHID). The      *00303000
                         identifier size is 3. -- Entry or exit switch  00304000
*                        port - If a one byte link address is used,    *00305000
                         then byte 1 contains the link address and     *00306000
                         bytes 2 and 3 are zero. If a two byte link    *00307000
                         address is used, then bytes 1 and 2 contain   *00308000
                         the link address and byte 3 is zero. The      *00309000
                         identifier size is 1 or 2. -- Control unit    *00310000
                         port - Bytes 1 and 2 contain the interface    *00311000
                         identifier. Byte 3 is zero. The identifier    *00312000
                         size is 2. ************************************00313000
                         *******************                            00314000
SMF124S1_PORTID DS CL3   Port identifier                                00315000
         ORG   SMF124S1_PORTID                                          00316000
SMF124S1_ID_CHANNEL DS CL3 Channel port identifiers                     00317000
         ORG   SMF124S1_ID_CHANNEL                                      00318000
SMF124S1_ID_CHPID DS CL1 CHPID                                          00319000
SMF124S1_ID_PCHID DS CL2 Physical channel id (PCHID)                    00320000
         ORG   SMF124S1_PORTID                                          00321000
SMF124S1_ID_SWITCH DS CL3 Switch port identifiers                       00322000
         ORG   SMF124S1_ID_SWITCH                                       00323000
SMF124S1_ID_LA2 DS CL2   Two byte link address                          00324000
         ORG   SMF124S1_ID_LA2                                          00325000
SMF124S1_ID_LA1 DS CL1   One byte link address                          00326000
         ORG   SMF124S1_ID_LA2+2                                        00327000
         DS    CL1       Reserved                                       00328000
         ORG   SMF124S1_PORTID                                          00329000
SMF124S1_ID_CU DS CL3    Control unit port identifiers                  00330000
         ORG   SMF124S1_ID_CU                                           00331000
SMF124S1_ID_INTID DS CL2 Interface id                                   00332000
         DS    CL1       Reserved                                       00333000
SMF124S1_PORTTYPE DS X   Port type - see constant definitions below     00334000
SMF124S1_ASSOCCHPID DS X The associated CHPID (filled in for all port  *00335000
                         types) ****************************************00336000
                         *************** Flags *************************00337000
                         ******************************                 00338000
SMF124S1_FLAG1 DS B      Flag byte 1                                    00339000
*  Bit definitions:                                                     00340000
SMF124S1_VALSPEED EQU X'80' Port speed information valid                00341000
SMF124S1_VALSFPDP EQU X'40' SFP diagnostic parameters valid             00342000
SMF124S1_VALBUFF EQU X'20' Buffer credit information valid              00343000
SMF124S1_VALLESB EQU X'10' Link Error Status Block (LESB) information  *00344000
                         valid                                          00345000
SMF124S1_VALFEC EQU X'08' Forward error correction (FEC) information   *00346000
                         valid                                          00347000
SMF124S1_VALATTWWPN EQU X'04' Attached port name SMF124S1_AttWWPN is   *00348000
                         valid                                          00349000
SMF124S1_IDSIZE EQU X'03' Port identifier size - see constants below    00350000
         ORG   SMF124S1_FLAG1+1                                         00351000
SMF124S1_FLAG2 DS B      Flag byte 2                                    00352000
*  Bit definitions:                                                     00353000
SMF124S1_VALTHRESH_TEMP EQU X'80' Temperature threshold values are     *00354000
                         valid                                          00355000
SMF124S1_VALTHRESH_VOLTAGE EQU X'40' Voltage threshold values are      *00356000
                         valid                                          00357000
SMF124S1_VALTHRESH_BIAS EQU X'20' Transmitter laser bias current (Tx   *00358000
                         bias) threshold values are valid               00359000
SMF124S1_VALTHRESH_TXPOWER EQU X'10' Optical transmit (Tx) power       *00360000
                         threshold values are valid                     00361000
SMF124S1_VALTHRESH_RXPOWER EQU X'08' Optical receive (Rx) power        *00362000
                         threshold values are valid                     00363000
         ORG   SMF124S1_FLAG2+1                                         00364000
SMF124S1_FLAG3 DS B      Flag byte 3                                    00365000
*  Bit definitions:                                                     00366000
SMF124S1_OPSPEEDUNKNOWN EQU X'80' The operating speed is not known to  *00367000
                         the port                                       00368000
SMF124S1_OPSPEEDUNRECOG EQU X'40' The operating speed is not           *00369000
                         recognized by z/OS                             00370000
SMF124S1_OPSPEEDNOTEST EQU X'20' The operating speed has not been      *00371000
                         established by the port                        00372000
SMF124S1_CAPSPEEDUNKNOWN EQU X'10' The capable speed is not known to   *00373000
                         the port                                       00374000
SMF124S1_CAPSPEEDUNRECOG EQU X'08' The capable speed is not recognized *00375000
                         by z/OS                                        00376000
SMF124S1_FECACTIVE EQU X'04' Indicates whether forward error           *00377000
                         correction (FEC) for a 16Gb port is active.   *00378000
                         If on, FEC for this 16Gb port is active. If   *00379000
                         off, FEC for the 16Gb port is not active or   *00380000
                         the state is unknown. This field is not       *00381000
                         relevant to ports whose operating link speed  *00382000
                         is not 16Gbs. FEC for ports with speeds 32Gbs *00383000
                         or higher, will always be active               00384000
         ORG   SMF124S1_FLAG3+1                                         00385000
SMF124S1_FLAG4 DS B      Flag byte 4                                    00386000
*  Bit definitions:                                                     00387000
SMF124S1_ID_INTID_VAL EQU X'80' This bit is on when SMF124S1_ID_IntId  *00388000
                         is valid and SMFS124S1_Level is not 0          00389000
         ORG   SMF124S1_FLAG4+1                                         00390000
SMF124S1_FLAG5 DS B      Flag byte 5                                    00391000
SMF124S1_FLAG6 DS B      Flag byte 6                                    00392000
SMF124S1_FLAG7 DS B      Flag byte 7                                    00393000
SMF124S1_FLAG8 DS B      Flag byte 8 ***********************************00394000
                         ******************** Port Speed Information ***00395000
                         ***********************************************00396000
                         ******                                         00397000
SMF124S1_PORTSPEED DS CL4 Port speed information. This information is  *00398000
                         valid if SMF124S1_ValSpeed is on.              00399000
         ORG   SMF124S1_PORTSPEED                                       00400000
SMF124S1_OPERSPEED DS H  Current operating speed in gigabits per       *00401000
                         second (Gbs). If zero, see operating speed    *00402000
                         flags in SMF124S1_Flag3 for more information.  00403000
SMF124S1_CAPSPEED DS H   Maximum capable speed in gigabits per second  *00404000
                         (Gbs) If zero, see capable speed flags in     *00405000
                         SMF124S1_Flag3 for more information. **********00406000
                         *******************************************   *00407000
                         Optical Transceiver/Small Form-Factor         *00408000
                         Pluggable (SFP) Diagnostic Parameters. ********00409000
                         *********************************************  00410000
SMF124S1_SFPDP DS CL10   Optical transceiver/Small Form-factor         *00411000
                         Pluggable (SFP) diagnostic parameters. This   *00412000
                         information is valid if SMF124S1_ValSFPDP is  *00413000
                         on.                                            00414000
         ORG   SMF124S1_SFPDP                                           00415000
SMF124S1_SFP_TEMP DS H   Transceiver temperature. This field contains  *00416000
                         a signed, two's complement value in           *00417000
                         increments of 1/256 of a degree centigrade    *00418000
                         (C). It represents a range of -128 C to 128   *00419000
                         (127.996) C.                                   00420000
SMF124S1_SFP_VOLTAGE DS H Voltage. This field is in units of 100       *00421000
                         microvolts (uV). It represents a range of 0   *00422000
                         to 6.55 volts (V).                             00423000
SMF124S1_SFP_TXBIAS DS H Transmitter laser bias current (Tx bias).     *00424000
                         This field is in units of 2 microamps (uA).   *00425000
                         It represents a range of 0 to 131 milliamps   *00426000
                         (mA).                                          00427000
SMF124S1_SFP_TXPOWER DS H Transmit power (Tx). This field is in units  *00428000
                         of 0.1 microwatts (uW). It represents a range *00429000
                         of 0 to 6.5 milliwatts (mW).                   00430000
SMF124S1_SFP_RXPOWER DS H Receive power (Rx). This field is in units   *00431000
                         of 0.1 microwatts (uW). It represents a range *00432000
                         of 0 to 6.5 milliwatts (mW). ******************00433000
                         *********************************** Buffer    *00434000
                         Credit and Distance Information ***************00435000
                         **************************************         00436000
SMF124S1_BUFFCRED DS CL16 Buffer credit and distance information. This *00437000
                         information is valid if SMF124S1_ValBuff is   *00438000
                         on.                                            00439000
         ORG   SMF124S1_BUFFCRED                                        00440000
SMF124S1_THISPORT_B2BCREDIT DS F The number of buffer-to-buffer        *00441000
                         credits for this port                          00442000
SMF124S1_ATTPORT_B2BCREDIT DS F The number of buffer-to-buffer credits *00443000
                         for the attached port                          00444000
SMF124S1_RTT DS F        Round trip time from this port to the         *00445000
                         attached port in nanoseconds. A value of zero *00446000
                         means that the round trip time is unknown.     00447000
SMF124S1_EST_DISTANCE DS F Estimated distance in meters based on the   *00448000
                         round trip time. A value of zero means that   *00449000
                         the estimated distance is unknown. ************00450000
                         *****************************************     *00451000
                         Error Information *****************************00452000
                         ************************                       00453000
SMF124S1_ERRORINFO DS CL40 Error information. See individual fields to *00454000
                         determine how to check for validity.           00455000
         ORG   SMF124S1_ERRORINFO                                       00456000
SMF124S1_LESB_LINKFAILURECOUNT DS F Link failure count for this        *00457000
                         monitoring interval. This information is      *00458000
                         valid if SMF124S1_ValLESB is on.               00459000
SMF124S1_LESB_LOSSOFSYNCCOUNT DS F Loss of synchronization count for   *00460000
                         this monitoring interval. This information is *00461000
                         valid if SMF124S1_ValLESB is on.               00462000
SMF124S1_LESB_LOSSOFSIGNALCOUNT DS F Loss of signal count for this     *00463000
                         monitoring interval. This information is      *00464000
                         valid if SMF124S1_ValLESB is on.               00465000
SMF124S1_LESB_PRIMITIVESEQPROTOCOL DS F Primitive sequence protocol    *00466000
                         error count for this monitoring interval.     *00467000
                         This information is valid if SMF124S1_ValLESB *00468000
                         is on.                                         00469000
SMF124S1_LESB_INVALIDTRANSWORD DS F Invalid transmission word count    *00470000
                         for this monitoring interval. This            *00471000
                         information is valid if SMF124S1_ValLESB is   *00472000
                         on.                                            00473000
SMF124S1_LESB_INVALIDCRCCOUNT DS F Invalid CRC count for this          *00474000
                         monitoring interval. This information is      *00475000
                         valid if SMF124S1_ValLESB is on.               00476000
SMF124S1_FEC_UNCORRECTED_BLKS DS F Number of FEC uncorrected blocks    *00477000
                         for this monitoring interval. This            *00478000
                         information is valid if SMF124S1_ValFEC is    *00479000
                         on.                                            00480000
         DS    F         Reserved **************************************00481000
                         *************** Temperature Threshold         *00482000
                         Information ***********************************00483000
                         ******************                             00484000
         ORG   SMF124S1_ERRORINFO+40                                    00485000
SMF124S1_THRESHOLDS_TEMP DS CL8 Transceiver temperature thresholds.    *00486000
                         Each field contains a signed, two's           *00487000
                         complement value in increments of 1/256 of a  *00488000
                         degree centigrade (C). This represents a      *00489000
                         range of -128 C to 128 (127.996) C. This      *00490000
                         information is valid if                       *00491000
                         SMF124S1_ValThresh_Temp is on.                 00492000
         ORG   SMF124S1_THRESHOLDS_TEMP                                 00493000
SMF124S1_THRESHOLD_TEMP_HIGHALARM DS H High alarm threshold             00494000
SMF124S1_THRESHOLD_TEMP_LOWALARM DS H Low alarm threshold               00495000
SMF124S1_THRESHOLD_TEMP_HIGHWARN DS H High warning threshold            00496000
SMF124S1_THRESHOLD_TEMP_LOWWARN DS H Low warning threshold *************00497000
                         ****************************************      *00498000
                         Voltage Threshold Information *****************00499000
                         ************************************           00500000
SMF124S1_THRESHOLDS_VOLTAGE DS CL8 Voltage thresholds. Each field is   *00501000
                         in units of 100 microvolts (uV). This         *00502000
                         represents a range of 0 to 6.55 volts (V).    *00503000
                         This information is valid if                  *00504000
                         SMF124S1_ValThresh_Voltage is on.              00505000
         ORG   SMF124S1_THRESHOLDS_VOLTAGE                              00506000
SMF124S1_THRESHOLD_VOLTAGE_HIGHALARM DS H High alarm threshold          00507000
SMF124S1_THRESHOLD_VOLTAGE_LOWALARM DS H Low alarm threshold            00508000
SMF124S1_THRESHOLD_VOLTAGE_HIGHWARN DS H High warning threshold         00509000
SMF124S1_THRESHOLD_VOLTAGE_LOWWARN DS H Low warning threshold **********00510000
                         *******************************************   *00511000
                         Transmitter Laser Bias Current (Tx Bias)      *00512000
                         Thresholds ************************************00513000
                         *****************                              00514000
SMF124S1_THRESHOLDS_TXBIAS DS CL8 Transmitter laser bias current (Tx   *00515000
                         Bias) thresholds. Each field is in units of 2 *00516000
                         microamps (uA). This represents a range of 0  *00517000
                         to 131 milliamps (mA). This information is    *00518000
                         valid if SMF124S1_ValThresh_Bias is on.        00519000
         ORG   SMF124S1_THRESHOLDS_TXBIAS                               00520000
SMF124S1_THRESHOLD_TXBIAS_HIGHALARM DS H High alarm threshold           00521000
SMF124S1_THRESHOLD_TXBIAS_LOWALARM DS H Low alarm threshold             00522000
SMF124S1_THRESHOLD_TXBIAS_HIGHWARN DS H High warning threshold          00523000
SMF124S1_THRESHOLD_TXBIAS_LOWWARN DS H Low warning threshold ***********00524000
                         ******************************************    *00525000
                         Transmit (Tx) Power Optical Thresholds. *******00526000
                         ***********************************************00527000
                                                                        00528000
SMF124S1_THRESHOLDS_TXPOWER DS CL8 Tx Power thresholds. Each field is  *00529000
                         in units of 0.1 microwatts (uW). This         *00530000
                         represents a range of 0 to 6.5 milliwatts     *00531000
                         (mW). This information is valid if            *00532000
                         SMF124S1_ValThresh_TxPower is on.              00533000
         ORG   SMF124S1_THRESHOLDS_TXPOWER                              00534000
SMF124S1_THRESHOLD_TXPOWER_HIGHALARM DS H High alarm threshold          00535000
SMF124S1_THRESHOLD_TXPOWER_LOWALARM DS H Low alarm threshold            00536000
SMF124S1_THRESHOLD_TXPOWER_HIGHWARN DS H High warning threshold         00537000
SMF124S1_THRESHOLD_TXPOWER_LOWWARN DS H Low warning threshold **********00538000
                         *******************************************   *00539000
                         Receive (Rx) Power Optical Threshold          *00540000
                         Information ***********************************00541000
                         ******************                             00542000
SMF124S1_THRESHOLDS_RXPOWER DS CL8 Rx Power thresholds. Each field is  *00543000
                         in units of 0.1 microwatts (uW). This         *00544000
                         represents a range of 0 to 6.5 milliwatts     *00545000
                         (mW). This information is valid if            *00546000
                         SMF124S1_ValThresh_RxPower is on.              00547000
         ORG   SMF124S1_THRESHOLDS_RXPOWER                              00548000
SMF124S1_THRESHOLD_RXPOWER_HIGHALARM DS H High alarm threshold          00549000
SMF124S1_THRESHOLD_RXPOWER_LOWALARM DS H Low alarm threshold            00550000
SMF124S1_THRESHOLD_RXPOWER_HIGHWARN DS H High warning threshold         00551000
SMF124S1_THRESHOLD_RXPOWER_LOWWARN DS H Low warning threshold **********00552000
                         *******************************************   *00553000
                         Attached Port Name ****************************00554000
                         *************************                      00555000
SMF124S1_ATTWWPN DS CL8  World wide port name of the attached port.    *00556000
                         This information is valid if                  *00557000
                         SMF124S1_ValAttWWPN flag is on                 00558000
SMF124S1_LEVEL DS X      Level indicator of record '01' - indicates    *00559000
                         that SMF124S1_ID_IntID_Val has been set        00560000
         DS    CL107     Reserved                                       00561000
SMF124S1_PORTSECT_LEN EQU *-SMF124S1_PORTSECT                           00562000
.L0006   ANOP                                                           00563000
         AIF   ('&SMF124S2_EPSECSTAT_SECTION' EQ 'NO').L000A            00564000
         AIF   ('&DSECT' EQ 'YES').L000B                                00565000
         AIF   ('&SMF124S2_EPSECSTAT_SECTION' NE 'YES').L000A           00566000
.L000B   ANOP                                                           00567000
*                                                                       00568000
* ********************************************************************  00569000
* *                                                                  *  00570000
* * Subtype 2 (Endpoint Security Status) Section                     *  00571000
* *                                                                     00572000
* ********************************************************************  00573000
*                                                                       00574000
*                                                                       00575000
         AIF   ('&DSECT' EQ 'YES').L000C                                00576000
SMF124S2_EPSECSTAT_SECTION DS 0F Start of Endpoint-Security Status     *00577000
                         mode change section                            00578000
         AGO   .L000D                                                   00579000
.L000C   ANOP                                                           00580000
SMF124S2_EPSECSTAT_SECTION DSECT   Start of Endpoint-Security Status   *00581000
                         mode change section                            00582000
.L000D   ANOP                                                           00583000
SMF124S2_CHPID DS X      CHPID                                          00584000
SMF124S2_PCHID DS CL2    Physical channel id of CHPID                   00585000
SMF124S2_CHPWWPN DS CL8  WWPN of channel                                00586000
SMF124S2_LADDR DS CL3    Destination link address                       00587000
SMF124S2_INTID DS CL2    Interface ID of CU port                        00588000
SMF124S2_CUWWPN DS CL8   WWPN of CU port                                00589000
SMF124S2_REPORTSRC DS X  Reporting source. Constants:                  *00590000
                         SMF124S2_ReportSrc_x                           00591000
SMF124S2_EPSEC_CURR DS X Current endpoint security status. Constants:  *00592000
                         SMF124S2_EpSec_xxxxx                           00593000
SMF124S2_CHPIDCAPABILITY DS X Endpoint security capability of the      *00594000
                         CHPID. Constants: SMF124S2_EpSec_xxxxx         00595000
SMF124S2_FLAG1 DS B      Flag 1                                         00596000
*  Bit definitions:                                                     00597000
SMF124S2_EPSEC_SUMM EQU X'C0' Summary flag. The two flags below are    *00598000
                         mutually exclusive. If neither flag is on,    *00599000
                         then no endpoint security is in effect         00600000
SMF124S2_EPSEC_AUTH EQU X'80' Authentication is in effect               00601000
SMF124S2_EPSEC_ENCR EQU X'40' Encryption is in effect                   00602000
SMF124S2_INTID_VAL EQU X'20' This bit is on when SMF124S2_IntId is     *00603000
                         valid and SMF124S2_Level is not 0              00604000
SMF124S2_LEVEL DS X      Level indicator of record '01' - indicates    *00605000
                         that SMF124S2_IntId_Val has been set           00606000
         DS    CL28      Reserved                                       00607000
SMF124S2_EPSECSTAT_SECTION_LEN EQU *-SMF124S2_EPSECSTAT_SECTION         00608000
.L000A   ANOP                                                           00609000
         AIF   ('&SMF124S3_AUTHKEYUPD_SECTION' EQ 'NO').L000E           00610000
         AIF   ('&DSECT' EQ 'YES').L000F                                00611000
         AIF   ('&SMF124S3_AUTHKEYUPD_SECTION' NE 'YES').L000E          00612000
.L000F   ANOP                                                           00613000
*                                                                       00614000
* ********************************************************************  00615000
* *                                                                  *  00616000
* * Subtype 3 (Endpoint Security Authentication Key Update) Section  *  00617000
* *                                                                  *  00618000
* * This section represents an update of the authentication key      *  00619000
* * (shared secret) between the CPC and a peer node.                 *  00620000
* *                                                                     00621000
* ********************************************************************  00622000
*                                                                       00623000
*                                                                       00624000
         AIF   ('&DSECT' EQ 'YES').L0010                                00625000
SMF124S3_AUTHKEYUPD_SECTION DS 0F Start of section                      00626000
         AGO   .L0011                                                   00627000
.L0010   ANOP                                                           00628000
SMF124S3_AUTHKEYUPD_SECTION DSECT   Start of section                    00629000
.L0011   ANOP                                                           00630000
SMF124S3_PEERWWNN DS CL8 WWNN of peer node                              00631000
         DS    CL32      Reserved                                       00632000
SMF124S3_AUTHKEYUPD_SECTION_LEN EQU *-SMF124S3_AUTHKEYUPD_SECTION       00633000
.L000E   ANOP                                                           00634000
         AIF   ('&SMF124S4_ENCRKEYUPD_SECTION' EQ 'NO').L0012           00635000
         AIF   ('&DSECT' EQ 'YES').L0013                                00636000
         AIF   ('&SMF124S4_ENCRKEYUPD_SECTION' NE 'YES').L0012          00637000
.L0013   ANOP                                                           00638000
*                                                                       00639000
* ********************************************************************  00640000
* *                                                                  *  00641000
* * Subtype 4 (Endpoint Security Encryption Key Update) Section      *  00642000
* *                                                                  *  00643000
* * This section represents an update of the encryption key          *  00644000
* * (session key) between the channel and its endpoint (another      *  00645000
* * channel or a control unit port).                                 *  00646000
* *                                                                     00647000
* ********************************************************************  00648000
*                                                                       00649000
*                                                                       00650000
         AIF   ('&DSECT' EQ 'YES').L0014                                00651000
SMF124S4_ENCRKEYUPD_SECTION DS 0F Start of section                      00652000
         AGO   .L0015                                                   00653000
.L0014   ANOP                                                           00654000
SMF124S4_ENCRKEYUPD_SECTION DSECT   Start of section                    00655000
.L0015   ANOP                                                           00656000
SMF124S4_CHPID DS CL1    CHPID associated with the event                00657000
SMF124S4_PCHID DS CL2    Physical channel id of CHPID                   00658000
SMF124S4_CHPWWPN DS CL8  WWPN of CHPID                                  00659000
SMF124S4_LINKADDR DS CL2 Link address associated with the event         00660000
SMF124S4_CUINTID DS CL2  Interface id of CU port                        00661000
SMF124S4_CUWWPN DS CL8   WWPN of CU port                                00662000
SMF124S4_FLAG1 DS B                                                     00663000
*  Bit definitions:                                                     00664000
SMF124S4_CUINTID_VAL EQU X'80' This bit is on when SMF124S4_CUIntId is *00665000
                         valid and SMF124S4_Level is not 0              00666000
SMF124S4_LEVEL DS X      Level indicator of record '01' - indicates    *00667000
                         that SMF124S4_CUIntId_Val has been set         00668000
         DS    CL30      Reserved                                       00669000
SMF124S4_ENCRKEYUPD_SECTION_LEN EQU *-SMF124S4_ENCRKEYUPD_SECTION       00670000
.L0012   ANOP                                                           00671000
         AIF   ('&SMF124S5_EXTKEYMGRINFO_SECTION' EQ 'NO').L0016        00672000
         AIF   ('&DSECT' EQ 'YES').L0017                                00673000
         AIF   ('&SMF124S5_EXTKEYMGRINFO_SECTION' NE 'YES').L0016       00674000
.L0017   ANOP                                                           00675000
*                                                                       00676000
* ********************************************************************  00677000
* *                                                                  *  00678000
* * Subtype 5 (External Key Manager Information) Section             *  00679000
* *                                                                     00680000
* ********************************************************************  00681000
*                                                                       00682000
*                                                                       00683000
         AIF   ('&DSECT' EQ 'YES').L0018                                00684000
SMF124S5_EXTKEYMGRINFO_SECTION DS 0F Start of section                   00685000
         AGO   .L0019                                                   00686000
.L0018   ANOP                                                           00687000
SMF124S5_EXTKEYMGRINFO_SECTION DSECT   Start of section                 00688000
.L0019   ANOP                                                           00689000
SMF124S5_AVSTATUS DS CL1 Availablity status of the external key        *00690000
                         manager. Constants: SMF124S5_AvStatus_xx       00691000
SMF124S5_IDTYPE DS CL1   Identifier type of the External Key Manager.  *00692000
                         Constants: SMF124S5_IdType_xx                  00693000
SMF124S5_ID_LENGTH DS X  length of Identifier when id type is 3        *00694000
                         (hostname)                                     00695000
SMF124S5_IDENTIFIER DS CL255 External Key Manager Identifier            00696000
         DS    CL32      Reserved                                       00697000
*                                                                       00698000
* ********************************************************************  00699000
* *                                                                  *  00700000
* * SMF124S1_PortType Constants                                      *  00701000
* *                                                                  *  00702000
* ********************************************************************  00703000
*                                                                       00704000
*                                                                       00705000
SMF124S1_PORTTYPE_CHANNEL EQU 1 Channel port                            00706000
SMF124S1_PORTTYPE_ENTRYSWITCH EQU 2 Entry switch port                   00707000
SMF124S1_PORTTYPE_EXITSWITCH EQU 3 Exit switch port                     00708000
SMF124S1_PORTTYPE_CU EQU 4 Control unit port                            00709000
*                                                                       00710000
* ********************************************************************  00711000
* *                                                                  *  00712000
* * SMF124S1_IdSize Constants                                        *  00713000
* *                                                                  *  00714000
* ********************************************************************  00715000
*                                                                       00716000
*                                                                       00717000
SMF124S1_IDSIZE1 EQU X'01' Identifier size is 1                         00718000
SMF124S1_IDSIZE2 EQU X'02' Identifier size is 2                         00719000
SMF124S1_IDSIZE3 EQU X'03' Identifier size is 3                         00720000
*                                                                       00721000
* ********************************************************************  00722000
* *                                                                  *  00723000
* * SMF124S1_ReportSrc Constants.                                    *  00724000
* *                                                                  *  00725000
* ********************************************************************  00726000
*                                                                       00727000
*                                                                       00728000
SMF124S1_REPORTSRC_MONITOR EQU 1 Periodic monitoring                    00729000
*                                                                       00730000
* ********************************************************************  00731000
* *                                                                  *  00732000
* * SMF124S1_Level Constants.                                        *  00733000
* *                                                                     00734000
* ********************************************************************  00735000
*                                                                       00736000
*                                                                       00737000
SMF124S1_LEVEL0 EQU 0    Initial level                                  00738000
SMF124S1_LEVEL1 EQU 1    Level of record where SMF124S1_ID_IntID_Val   *00739000
                         was introduced                                 00740000
SMF124S1_LEVELCURRENT EQU 1 Current level of record                     00741000
*                                                                       00742000
* ********************************************************************  00743000
* *                                                                  *  00744000
* * SMF124S2_ReportSrc Constants.                                    *  00745000
* *                                                                     00746000
* ********************************************************************  00747000
*                                                                       00748000
*                                                                       00749000
SMF124S2_REPORTSRC_INIT EQU 1 Initial endpoint security status          00750000
SMF124S2_REPORTSRC_STATCHG EQU 2 Endpoint security status change        00751000
*                                                                       00752000
* ********************************************************************  00753000
* *                                                                  *  00754000
* * SMF124S2_EPSec_Curr and SMF124S2_CHPIDCapability Constants       *  00755000
* *                                                                     00756000
* ********************************************************************  00757000
*                                                                       00758000
*                                                                       00759000
SMF124S2_EPSEC_NE EQU 0  Endpoint-Security is not enabled or not       *00760000
                         supported                                      00761000
SMF124S2_EPSEC_AUTHENTICATED EQU 1 Authentication is enabled            00762000
SMF124S2_EPSEC_FCSP2 EQU 2 Encryption is enabled with FC-SP-2          *00763000
                         compliant integrity checking                   00764000
SMF124S2_EPSEC_RAS EQU 3 Encryption is enabled with enhanced-RAS       *00765000
                         integrity checking                             00766000
*                                                                       00767000
* ********************************************************************  00768000
* *                                                                  *  00769000
* * SMF124S2_Level Constants.                                        *  00770000
* *                                                                     00771000
* ********************************************************************  00772000
*                                                                       00773000
*                                                                       00774000
SMF124S2_LEVEL0 EQU 0    Initial level                                  00775000
SMF124S2_LEVEL1 EQU 1    Level of record where SMF124S2_IntId_Val was  *00776000
                         introduced                                     00777000
SMF124S2_LEVELCURRENT EQU 1 Current level of record                     00778000
*                                                                       00779000
* ********************************************************************  00780000
* *                                                                  *  00781000
* * SMF124S4_Level Constants.                                        *  00782000
* *                                                                     00783000
* ********************************************************************  00784000
*                                                                       00785000
*                                                                       00786000
SMF124S4_LEVEL0 EQU 0    Initial level                                  00787000
SMF124S4_LEVEL1 EQU 1    Level of record where SMF124S4_IntId_Val was  *00788000
                         introduced                                     00789000
SMF124S4_LEVELCURRENT EQU 1 Current level of record                     00790000
*                                                                       00791000
* ********************************************************************  00792000
* *                                                                  *  00793000
* * SMF124S5_AvStatus Constants                                      *  00794000
* *                                                                     00795000
* ********************************************************************  00796000
*                                                                       00797000
*                                                                       00798000
SMF124S5_AVSTATUS_AVAILABLE EQU 1 Available                             00799000
SMF124S5_AVSTATUS_UNAVAILABLE EQU 2 Unavailable                         00800000
*                                                                       00801000
* ********************************************************************  00802000
* *                                                                  *  00803000
* * SMF124S5_IdType Constants.                                       *  00804000
* *                                                                     00805000
* ********************************************************************  00806000
*                                                                       00807000
*                                                                       00808000
SMF124S5_IDTYPE_UNKNOWN EQU 0 Format is unknown                         00809000
SMF124S5_IDTYPE_IPV4 EQU 1 Format is IPv4                               00810000
SMF124S5_IDTYPE_IPV6 EQU 2 Format is IPv6                               00811000
SMF124S5_IDTYPE_HOST EQU 3 Format is EBCDIC hostname                    00812000
SMF124S5_EXTKEYMGRINFO_SECTION_LEN EQU *-SMF124S5_EXTKEYMGRINFO_SECTION*00813000
                                                                        00814000
.L0016   ANOP                                                           00815000
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 00816000
         AIF   ('&LIST' EQ 'YES').P4                                    00817000
.P3      ANOP                                                           00818000
         POP   PRINT                                                    00819000
.P4      ANOP                                                           00820000
.P_EXIT  ANOP                                                           00821000
         MEND                                                           00822000
**/ ;                                                                   00823000
* %IOSDS124_INCLUDED = 'YES';                                           00824000
* %DCL ZCBPRINT CHAR EXT;                                               00825000
* %DEACTIVATE ZCBPRINT;                                                 00826000
* %DCL IOSDS124_LIST CHAR EXT;                                          00827000
* %DEACTIVATE IOSDS124_LIST;                                            00828000
* %IF IOSDS124_LIST = 'NO' !                                            00829000
*    ZCBPRINT = 'NO' %THEN                                              00830000
* %DO;                                                                  00831000
*   @LIST PUSH NOECHO;                                                  00832000
*   @LIST NOASSEMBLE NOECHO;                                            00833000
*   @LIST OFF C NOECHO;                                                 00834000
* %END;                                                                 00835000
*/* Start of PL/X Source                                             */ 00836000
*/* Start of PL/X Source                                             */ 00837000
*                                                                       00838000
*/********************************************************************/ 00839000
*/*                                                                  */ 00840000
*/* SMF Record Type and Subtype Constants                            */ 00841000
*/*                                                                  */ 00842000
*/********************************************************************/ 00843000
*Dcl SMF124RecordType Fixed(8) Constant(124);                           00844000
*                                   /* SMF record type               */ 00845000
*Dcl SMF124RecordSubTypeLinkDiag Fixed(16) Constant(1);                 00846000
*                                   /* Subtype 1 - Link Diagnostic      00847000
*                                      Information                   */ 00848000
*Dcl SMF124RecordSubTypeEPSecStat Fixed(16) Constant(2);                00849000
*                                   /* Subtype 2 - Endpoint security    00850000
*                                      Status                    @03A*/ 00851000
*Dcl SMF124RecordSubTypeEpSecAuthKeyUpd Fixed(16) Constant(3);          00852000
*                                   /* Subtype 3 - Endpoint security    00853000
*                                      authentication key update @03A*/ 00854000
*Dcl SMF124RecordSubTypeEpSecEncrKeyUpd Fixed(16) Constant(4);          00855000
*                                   /* Subtype 4 - Endpoint security    00856000
*                                      encryption key update     @03A*/ 00857000
*Dcl SMF124RecordSubTypeExtKeyMgr Fixed(16) Constant(5);                00858000
*                                   /* Subtype 5 - External key         00859000
*                                      manager event record      @03A*/ 00860000
*                                                                       00861000
*/********************************************************************/ 00862000
*/*                                                                  */ 00863000
*/* SMF 124 Record Header                                            */ 00864000
*/*                                                                  */ 00865000
*/********************************************************************/ 00866000
*Dcl                                                                    00867000
*  1 SMF124Rec Bdy(Word) Based                                          00868000
*   ,3 SMF124HdrPfx                 /* Standard SMF header w/subtype */ 00869000
*     ,5 SMF124Len Fixed(16)        /* Record length                 */ 00870000
*     ,5 SMF124Seg Fixed(16)        /* Segment descriptor            */ 00871000
*     ,5 SMF124Flg Bit(8)           /* Flags                         */ 00872000
*       ,7 SMF124Flg_Subsys Bit(1)  /* Subsystem id specified        */ 00873000
*       ,7 SMF124Flg_Subtype Bit(1) /* Subtypes are used             */ 00874000
*     ,5 SMF124Rty Fixed(8)         /* Record Type (=124 '7C'X)      */ 00875000
*     ,5 SMF124Tme Fixed(32) Bdy(HWord)                                 00876000
*                                   /* Time since midnight in           00877000
*                                      hundredths of a second that      00878000
*                                      the record was moved into        00879000
*                                      the SMF buffer                */ 00880000
*     ,5 SMF124Dte Bit(32)          /* Date when record was moved       00881000
*                                      into the SMF buffer.             00882000
*                                      Format: 0cyydddF              */ 00883000
*     ,5 SMF124SID Char(4)          /* System identification         */ 00884000
*     ,5 SMF124SSI Char(4)          /* Subsystem identification      */ 00885000
*     ,5 SMF124Sty Fixed(16)        /* Record subtype. See              00886000
*                                      Smf124RecordSubType above     */ 00887000
*                                                                       00888000
*   ,3 SMF124Hdr                    /* Self-defining header          */ 00889000
*     ,5 SMF124Hdr_Len Fixed(16)    /* Length of header              */ 00890000
*     ,5 SMF124Hdr_TrplCnt Fixed(16)/* Number of triplets in header  */ 00891000
*     ,5 SMF124Hdr_Flags Bit(16)    /* Header flags                  */ 00892000
*     ,5 * Char(2)                  /* Reserved                      */ 00893000
*     ,5 SMF124HdrTriplets Char(0)  /* Start of subtype triplets.       00894000
*                                      See the individual subtypes      00895000
*                                      for the definition of the        00896000
*                                      triplets for the particular      00897000
*                                      subtype.                      */ 00898000
* %If IBM_CBGENC ^= 'YES' %Then                                         00899000
* %Do;                                                                  00900000
*     ;                                                                 00901000
* %End;                                                                 00902000
* %Else %Do;                                                            00903000
*   ,2 SMF124Triplets Union                                             00904000
* %End;                                                                 00905000
*                                                                       00906000
*/********************************************************************/ 00907000
*/*                                                                  */ 00908000
*/* Subtype 1 (Link Diagnostic Information) - Triplets               */ 00909000
*/*                                                                  */ 00910000
*/********************************************************************/ 00911000
* %If IBM_CBGENC ^= 'YES' %Then                                         00912000
* %Do;                                                                  00913000
*Dcl                                                                    00914000
*  1 SMF124S1_Triplets Bdy(Word) Defined(SMF124HdrTriplets)             00915000
*                                   /* Start of triplets             */ 00916000
* %End;                                                                 00917000
* %Else %Do;                                                            00918000
*  ,3 SMF124S1_Triplets Bdy(Word)                                       00919000
*                                   /* Start of triplets             */ 00920000
* %End;                                                                 00921000
*   ,5 SMF124S1_Port_Offset Fixed(31) /* Offset of port section from    00922000
*                                      start of record               */ 00923000
*   ,5 SMF124S1_Port_Len Fixed(16)  /* Length of port section        */ 00924000
*   ,5 SMF124S1_Port_Num Fixed(16)  /* Number of port sections       */ 00925000
* %If IBM_CBGENC ^= 'YES' %Then                                         00926000
* %Do;                                                                  00927000
*   ;                                                                   00928000
* %End;                                                                 00929000
*                                                                       00930000
*/********************************************************************/ 00931000
*/*                                                                  */ 00932000
*/* Subtype 2 (Endpoint Security Status) Triplets                    */ 00933000
*/*                                                              @03A*/ 00934000
*/********************************************************************/ 00935000
* %If IBM_CBGENC ^= 'YES' %Then                                         00936000
* %Do;                                                                  00937000
*Dcl                                                                    00938000
*  1 SMF124S2_Triplets Bdy(Word) Defined(SMF124HdrTriplets)             00939000
*                                   /* Start of triplets         @03A*/ 00940000
* %End;                                                                 00941000
* %Else %Do;                                                            00942000
*  ,3 SMF124S2_Triplets Bdy(Word)                                       00943000
*                                   /* Start of triplets         @03A*/ 00944000
* %End;                                                                 00945000
*   ,5 SMF124S2_EPSecStat_Offset Fixed(31) /*                           00946000
*                                      Offset of Endpoint-Security      00947000
*                                      Status section from start of     00948000
*                                      record                    @03A*/ 00949000
*   ,5 SMF124S2_EPSecStat_Len Fixed(16) /*                              00950000
*                                      Length of Endpoint-Security      00951000
*                                      Status section from start of     00952000
*                                      record                    @03A*/ 00953000
*   ,5 SMF124S2_EPSecStat_Num Fixed(16) /*                              00954000
*                                      Number of Endpoint-Security      00955000
*                                      Status sections           @03A*/ 00956000
* %If IBM_CBGENC ^= 'YES' %Then                                         00957000
* %Do;                                                                  00958000
*   ;                                                                   00959000
* %End;                                                                 00960000
*                                                                       00961000
*/********************************************************************/ 00962000
*/*                                                                  */ 00963000
*/* Subtype 3 (Endpoint Security Authentication Key Update) Triplets */ 00964000
*/*                                                              @03A*/ 00965000
*/********************************************************************/ 00966000
* %If IBM_CBGENC ^= 'YES' %Then                                         00967000
* %Do;                                                                  00968000
*Dcl                                                                    00969000
*  1 SMF124S3_Triplets Bdy(Word) Defined(SMF124HdrTriplets)             00970000
*                                   /* Start of triplets         @03A*/ 00971000
* %End;                                                                 00972000
* %Else %Do;                                                            00973000
*  ,3 SMF124S3_Triplets Bdy(Word)                                       00974000
*                                   /* Start of triplets         @03A*/ 00975000
* %End;                                                                 00976000
*   ,5 SMF124S3_AuthKeyUpd_Offset Fixed(31) /*                          00977000
*                                      Offset of endpoint security      00978000
*                                      authentication key update        00979000
*                                      section from start of the        00980000
*                                      record                    @03A*/ 00981000
*   ,5 SMF124S3_AuthKeyUpd_Len Fixed(16) /*                             00982000
*                                      Length of endpoint security      00983000
*                                      authentication key update        00984000
*                                      section                   @03A*/ 00985000
*   ,5 SMF124S3_AuthKeyUpd_Num Fixed(16) /*                             00986000
*                                      Number of endpoint security      00987000
*                                      authentication key update        00988000
*                                      sections                  @03A*/ 00989000
* %If IBM_CBGENC ^= 'YES' %Then                                         00990000
* %Do;                                                                  00991000
*   ;                                                                   00992000
* %End;                                                                 00993000
*                                                                       00994000
*/********************************************************************/ 00995000
*/*                                                                  */ 00996000
*/* Subtype 4 (Endpoint Security Encryption Key Update) Triplets     */ 00997000
*/*                                                              @03A*/ 00998000
*/********************************************************************/ 00999000
* %If IBM_CBGENC ^= 'YES' %Then                                         01000000
* %Do;                                                                  01001000
*Dcl                                                                    01002000
*  1 SMF124S4_Triplets Bdy(Word) Defined(SMF124HdrTriplets)             01003000
*                                   /* Start of triplets         @03A*/ 01004000
* %End;                                                                 01005000
* %Else %Do;                                                            01006000
*  ,3 SMF124S4_Triplets Bdy(Word)                                       01007000
*                                   /* Start of triplets         @03A*/ 01008000
* %End;                                                                 01009000
*   ,5 SMF124S4_EncrKeyUpd_Offset Fixed(31) /*                          01010000
*                                      Offset of endpoint security      01011000
*                                      encryption key update            01012000
*                                      section from start of the        01013000
*                                      record                    @03A*/ 01014000
*   ,5 SMF124S4_EncrKeyUpd_Len Fixed(16) /*                             01015000
*                                      Length of endpoint security      01016000
*                                      encryption key update            01017000
*                                      section                   @03A*/ 01018000
*   ,5 SMF124S4_EncrKeyUpd_Num Fixed(16) /*                             01019000
*                                      Number of endpoint security      01020000
*                                      encryption key update            01021000
*                                      sections                  @03A*/ 01022000
* %If IBM_CBGENC ^= 'YES' %Then                                         01023000
* %Do;                                                                  01024000
*   ;                                                                   01025000
* %End;                                                                 01026000
*                                                                       01027000
*/********************************************************************/ 01028000
*/*                                                                  */ 01029000
*/* Subtype 5 (External Key Manager Info) Triplets                   */ 01030000
*/*                                                              @03A*/ 01031000
*/********************************************************************/ 01032000
* %If IBM_CBGENC ^= 'YES' %Then                                         01033000
* %Do;                                                                  01034000
*Dcl                                                                    01035000
*  1 SMF124S5_Triplets Bdy(Word) Defined(SMF124HdrTriplets)             01036000
*                                   /* Start of triplets         @03A*/ 01037000
* %End;                                                                 01038000
* %Else %Do;                                                            01039000
*  ,3 SMF124S5_Triplets Bdy(Word)                                       01040000
*                                   /* Start of triplets         @03A*/ 01041000
* %End;                                                                 01042000
*   ,5 SMF124S5_ExtKeyMgrInfo_Offset Fixed(31) /*                       01043000
*                                      Offset of external key manager   01044000
*                                      information from start of record 01045000
*                                                                @03A*/ 01046000
*   ,5 SMF124S5_ExtKeyMgrInfo_Len Fixed(16)   /*                        01047000
*                                      Length of external key manager   01048000
*                                      information section       @03A*/ 01049000
*   ,5 SMF124S5_ExtKeyMgrInfo_Num Fixed(16)   /*                        01050000
*                                      Number of external key manager   01051000
*                                      information sections      @03A*/ 01052000
*   ;                                                                   01053000
*                                                                       01054000
*/********************************************************************/ 01055000
*/*                                                                  */ 01056000
*/* Subtype 1 (Link Diagnostic Information) - Port Section           */ 01057000
*/*                                                                  */ 01058000
*/********************************************************************/ 01059000
*Dcl                                                                    01060000
*  1 SMF124S1_PortSect Bdy(Word)                                        01061000
*             Based(Addr(SMF124Rec) + SMF124S1_Port_Offset)             01062000
*                                   /* Start of port section         */ 01063000
*                                                                       01064000
*   ,3 SMF124S1_RetDate Fixed(32)   /* Date the information was         01065000
*                                      retrieved in 0cyymmmF format  */ 01066000
*   ,3 SMF124S1_RetTime Fixed(32)   /* Time since midnight, in          01067000
*                                      hundredths of a second, that     01068000
*                                      the information was              01069000
*                                      retrieved                     */ 01070000
*   ,3 SMF124S1_WWPN Char(8)        /* World wide port name (WWPN)      01071000
*                                      of the port                   */ 01072000
*   ,3 SMF124S1_ReportSrc Fixed(8)  /* Reporting source - see constant  01073000
*                                      definitions below             */ 01074000
*                                                                       01075000
*    /****************************************************************/ 01076000
*    /* Port Identifier and Port Type                                */ 01077000
*    /*                                                              */ 01078000
*    /* The contents and size of the identifier is dependent on the  */ 01079000
*    /* port type (SMF124S1_PortType) and the identifier size in     */ 01080000
*    /* SMF124S1_IdSize.                                             */ 01081000
*    /*                                                              */ 01082000
*    /* -- Channel port - Byte 1 contains the CHPID. Bytes 2 and 3   */ 01083000
*    /*    contain the physical channel identifier (PCHID).  The     */ 01084000
*    /*    identifier size is 3.                                     */ 01085000
*    /*                                                              */ 01086000
*    /* -- Entry or exit switch port - If a one byte link address    */ 01087000
*    /*    is used, then byte 1 contains the link address and bytes  */ 01088000
*    /*    2 and 3 are zero.  If a two byte link  address is used,   */ 01089000
*    /*    then bytes 1 and 2 contain the link address and byte 3    */ 01090000
*    /*    is zero.  The identifier size is 1 or 2.                  */ 01091000
*    /*                                                              */ 01092000
*    /* -- Control unit port - Bytes 1 and 2 contain the interface   */ 01093000
*    /*    identifier.  Byte 3 is zero.  The identifier size is 2.   */ 01094000
*    /*                                                              */ 01095000
*    /****************************************************************/ 01096000
*   ,3 SMF124S1_PortID Char(3) Union /* Port identifier              */ 01097000
*     ,5 SMF124S1_Id_Channel        /* Channel port identifiers      */ 01098000
*       ,7 SMF124S1_Id_CHPID Char(1) /* CHPID                        */ 01099000
*       ,7 SMF124S1_Id_PCHID Char(2) /* Physical channel id (PCHID)  */ 01100000
*                                                                       01101000
*     ,5 SMF124S1_Id_Switch         /* Switch port identifiers       */ 01102000
*       ,7 SMF124S1_Id_LA2 Char(2)  /* Two byte link address         */ 01103000
*         ,9 SMF124S1_Id_LA1 Char(1) /* One byte link address        */ 01104000
*       ,7 * Char(1)                /* Reserved                      */ 01105000
*                                                                       01106000
*     ,5 SMF124S1_Id_CU             /* Control unit port identifiers */ 01107000
*       ,7 SMF124S1_Id_IntId Char(2) /* Interface id                 */ 01108000
*       ,7 * Char(1)                /* Reserved                      */ 01109000
*                                                                       01110000
*   ,3 SMF124S1_PortType Fixed(8)   /* Port type - see constant         01111000
*                                      definitions below             */ 01112000
*   ,3 SMF124S1_AssocCHPID Fixed(8) /* The associated CHPID (filled     01113000
*                                      in for all port types)    @02C*/ 01114000
*                                                                       01115000
*    /****************************************************************/ 01116000
*    /* Flags                                                        */ 01117000
*    /****************************************************************/ 01118000
*   ,3 SMF124S1_Flag1 Bit(8)        /* Flag byte 1                   */ 01119000
*     ,5 SMF124S1_ValSpeed Bit(1)   /* Port speed information valid  */ 01120000
*     ,5 SMF124S1_ValSFPDP Bit(1)   /* SFP diagnostic parameters        01121000
*                                      valid                         */ 01122000
*     ,5 SMF124S1_ValBuff Bit(1)    /* Buffer credit information        01123000
*                                      valid                         */ 01124000
*     ,5 SMF124S1_ValLESB Bit(1)    /* Link Error Status Block (LESB)   01125000
*                                      information valid             */ 01126000
*     ,5 SMF124S1_ValFEC Bit(1)     /* Forward error correction (FEC)   01127000
*                                      information valid             */ 01128000
*     ,5 SMF124S1_ValAttWWPN Bit(1) /* Attached port name               01129000
*                                      SMF124S1_AttWWPN is valid @01A*/ 01130000
*     ,5 SMF124S1_IdSize Bit(2)     /* Port identifier size - see       01131000
*                                      constants below               */ 01132000
*                                                                       01133000
*   ,3 SMF124S1_Flag2 Bit(8)        /* Flag byte 2                   */ 01134000
*     ,5 SMF124S1_ValThresh_Temp Bit(1)                                 01135000
*                                   /* Temperature threshold values     01136000
*                                      are valid                     */ 01137000
*     ,5 SMF124S1_ValThresh_Voltage Bit(1)                              01138000
*                                   /* Voltage threshold values are     01139000
*                                      valid                         */ 01140000
*     ,5 SMF124S1_ValThresh_Bias Bit(1)                                 01141000
*                                   /* Transmitter laser bias           01142000
*                                      current (Tx bias) threshold      01143000
*                                      values are valid              */ 01144000
*     ,5 SMF124S1_ValThresh_TxPower Bit(1)                              01145000
*                                   /* Optical transmit (Tx) power      01146000
*                                      threshold values are valid    */ 01147000
*     ,5 SMF124S1_ValThresh_RxPower Bit(1)                              01148000
*                                   /* Optical receive (Rx) power       01149000
*                                      threshold values are valid    */ 01150000
*     ,5 * Bit(3)                   /* Reserved                      */ 01151000
*                                                                       01152000
*   ,3 SMF124S1_Flag3 Bit(8)        /* Flag byte 3                   */ 01153000
*     ,5 SMF124S1_OpSpeedUnknown Bit(1)                                 01154000
*                                   /* The operating speed is not       01155000
*                                      known to the port             */ 01156000
*     ,5 SMF124S1_OpSpeedUnRecog Bit(1)                                 01157000
*                                   /* The operating speed is not       01158000
*                                      recognized by z/OS            */ 01159000
*     ,5 SMF124S1_OpSpeedNotEst  Bit(1)                                 01160000
*                                   /* The operating speed has not      01161000
*                                      been established by the port  */ 01162000
*     ,5 SMF124S1_CapSpeedUnknown Bit(1)                                01163000
*                                   /* The capable speed is not         01164000
*                                      known to the port             */ 01165000
*     ,5 SMF124S1_CapSpeedUnRecog Bit(1)                                01166000
*                                   /* The capable speed is not         01167000
*                                      recognized by z/OS            */ 01168000
*     ,5 SMF124S1_FECActive Bit(1)  /* Indicates whether forward error  01169000
*                                      correction (FEC) for a 16Gb port 01170000
*                                      is active.  If on, FEC for this  01171000
*                                      16Gb port is active. If off,     01172000
*                                      FEC for the 16Gb port is not     01173000
*                                      active or the state is unknown.  01174000
*                                      This field is not relevant to    01175000
*                                      ports whose operating link speed 01176000
*                                      is not 16Gbs.  FEC for ports     01177000
*                                      with speeds 32Gbs or higher,     01178000
*                                      will always be active     @01A*/ 01179000
*     ,5 * Bit(2)                   /* Reserved                      */ 01180000
*                                                                       01181000
*   ,3 SMF124S1_Flag4 Bit(8)        /* Flag byte 4                   */ 01182000
*     ,5 SMF124S1_ID_IntID_Val Bit(1) /* This bit is on when            01183000
*                                        SMF124S1_ID_IntId is valid     01184000
*                                        and SMFS124S1_Level is not 0   01185000
*                                                                @04A*/ 01186000
*   ,3 SMF124S1_Flag5 Bit(8)        /* Flag byte 5                   */ 01187000
*   ,3 SMF124S1_Flag6 Bit(8)        /* Flag byte 6                   */ 01188000
*   ,3 SMF124S1_Flag7 Bit(8)        /* Flag byte 7                   */ 01189000
*   ,3 SMF124S1_Flag8 Bit(8)        /* Flag byte 8                   */ 01190000
*                                                                       01191000
*    /****************************************************************/ 01192000
*    /* Port Speed Information                                       */ 01193000
*    /****************************************************************/ 01194000
*   ,3 SMF124S1_PortSpeed           /* Port speed information.          01195000
*                                      This information is valid if     01196000
*                                      SMF124S1_ValSpeed is on.      */ 01197000
*     ,5 SMF124S1_OperSpeed Fixed(16) /* Current operating speed in     01198000
*                                      gigabits per second (Gbs).       01199000
*                                      If zero, see operating speed     01200000
*                                      flags in SMF124S1_Flag3 for      01201000
*                                      more information.             */ 01202000
*     ,5 SMF124S1_CapSpeed Fixed(16) /* Maximum capable speed in        01203000
*                                      gigabits per second (Gbs)        01204000
*                                      If zero, see capable speed       01205000
*                                      flags in SMF124S1_Flag3 for      01206000
*                                      more information.             */ 01207000
*                                                                       01208000
*    /****************************************************************/ 01209000
*    /* Optical Transceiver/Small Form-Factor Pluggable (SFP)        */ 01210000
*    /* Diagnostic Parameters.                                       */ 01211000
*    /****************************************************************/ 01212000
*   ,3 SMF124S1_SFPDP Bdy(Hword)    /* Optical transceiver/Small        01213000
*                                      Form-factor Pluggable (SFP)      01214000
*                                      diagnostic parameters.  This     01215000
*                                      information is valid if          01216000
*                                      SMF124S1_ValSFPDP is on.      */ 01217000
*                                                                       01218000
*     ,5 SMF124S1_SFP_Temp Fixed(16) /* Transceiver temperature.        01219000
*                                      This field contains a signed,    01220000
*                                      two's complement value in        01221000
*                                      increments of 1/256 of a         01222000
*                                      degree centigrade (C).           01223000
*                                      It represents a range of         01224000
*                                      -128 C to 128 (127.996) C.    */ 01225000
*                                                                       01226000
*     ,5 SMF124S1_SFP_Voltage Fixed(16) /* Voltage.                     01227000
*                                      This field is in units of 100    01228000
*                                      microvolts (uV).                 01229000
*                                      It represents a range of         01230000
*                                      0 to 6.55 volts (V).          */ 01231000
*                                                                       01232000
*     ,5 SMF124S1_SFP_TxBias Fixed(16) /* Transmitter laser bias        01233000
*                                      current (Tx bias).               01234000
*                                      This field is in units of 2      01235000
*                                      microamps (uA).                  01236000
*                                      It represents a range of         01237000
*                                      0 to 131 milliamps (mA).      */ 01238000
*                                                                       01239000
*     ,5 SMF124S1_SFP_TxPower Fixed(16) /* Transmit power (Tx).         01240000
*                                      This field is in units of        01241000
*                                      0.1 microwatts (uW).             01242000
*                                      It represents a range of 0 to    01243000
*                                      6.5 milliwatts (mW).          */ 01244000
*                                                                       01245000
*     ,5 SMF124S1_SFP_RxPower Fixed(16) /* Receive power (Rx).          01246000
*                                      This field is in units of        01247000
*                                      0.1 microwatts (uW).             01248000
*                                      It represents a range of 0 to    01249000
*                                      6.5 milliwatts (mW).          */ 01250000
*                                                                       01251000
*    /****************************************************************/ 01252000
*    /* Buffer Credit and Distance Information                       */ 01253000
*    /****************************************************************/ 01254000
*   ,3 SMF124S1_BuffCred Bdy(Word)  /* Buffer credit and distance       01255000
*                                      information.  This information   01256000
*                                      is valid if SMF124S1_ValBuff     01257000
*                                      is on.                        */ 01258000
*     ,5 SMF124S1_ThisPort_B2BCredit Fixed(32)                          01259000
*                                   /* The number of buffer-to-buffer   01260000
*                                      credits for this port         */ 01261000
*     ,5 SMF124S1_AttPort_B2BCredit Fixed(32)                           01262000
*                                   /* The number of buffer-to-buffer   01263000
*                                      credits for the attached port */ 01264000
*     ,5 SMF124S1_RTT Fixed(32)     /* Round trip time from this        01265000
*                                      port to the attached port in     01266000
*                                      nanoseconds.  A value of zero    01267000
*                                      means that the round trip        01268000
*                                      time is unknown.              */ 01269000
*     ,5 SMF124S1_Est_Distance Fixed(32)                                01270000
*                                   /* Estimated distance in meters     01271000
*                                      based on the round trip time.    01272000
*                                      A value of zero means that       01273000
*                                      the estimated distance is        01274000
*                                      unknown.                      */ 01275000
*                                                                       01276000
*    /****************************************************************/ 01277000
*    /* Error Information                                            */ 01278000
*    /****************************************************************/ 01279000
*   ,3 SMF124S1_ErrorInfo Bdy(Word) /* Error information.  See          01280000
*                                      individual fields to determine   01281000
*                                      how to check for validity.    */ 01282000
*     ,5 SMF124S1_LESB_LinkFailureCount Fixed(32)                       01283000
*                                   /* Link failure count for this      01284000
*                                      monitoring interval.  This       01285000
*                                      information is valid if          01286000
*                                      SMF124S1_ValLESB is on.       */ 01287000
*     ,5 SMF124S1_LESB_LossOfSyncCount Fixed(32)                        01288000
*                                   /* Loss of synchronization count    01289000
*                                      for this monitoring interval.    01290000
*                                      This information is valid if     01291000
*                                      SMF124S1_ValLESB is on.       */ 01292000
*     ,5 SMF124S1_LESB_LossOfSignalCount Fixed(32)                      01293000
*                                   /* Loss of signal count for this    01294000
*                                      monitoring interval.  This       01295000
*                                      information is valid if          01296000
*                                      SMF124S1_ValLESB is on.       */ 01297000
*     ,5 SMF124S1_LESB_PrimitiveSeqProtocol Fixed(32)                   01298000
*                                   /* Primitive sequence protocol      01299000
*                                      error count for this monitoring  01300000
*                                      interval.  This information      01301000
*                                      is valid if SMF124S1_ValLESB     01302000
*                                      is on.                        */ 01303000
*     ,5 SMF124S1_LESB_InvalidTransWord Fixed(32)                       01304000
*                                   /* Invalid transmission word        01305000
*                                      count for this monitoring        01306000
*                                      interval.  This information is   01307000
*                                      valid if SMF124S1_ValLESB        01308000
*                                      is on.                        */ 01309000
*     ,5 SMF124S1_LESB_InvalidCRCcount Fixed(32)                        01310000
*                                   /* Invalid CRC count for this       01311000
*                                      monitoring interval.  This       01312000
*                                      information is valid if          01313000
*                                      SMF124S1_ValLESB is on.       */ 01314000
*     ,5 SMF124S1_FEC_UnCorrected_Blks Fixed(32)                        01315000
*                                   /* Number of FEC uncorrected        01316000
*                                      blocks for this monitoring       01317000
*                                      interval. This information is    01318000
*                                      valid if SMF124S1_ValFEC         01319000
*                                      is on.                        */ 01320000
*     ,5 *(3) Fixed(32)             /* Reserved                      */ 01321000
*                                                                       01322000
*    /****************************************************************/ 01323000
*    /* Temperature Threshold Information                            */ 01324000
*    /****************************************************************/ 01325000
*   ,3 SMF124S1_Thresholds_Temp     /* Transceiver temperature          01326000
*                                      thresholds.                      01327000
*                                      Each field contains a signed,    01328000
*                                      two's complement value in        01329000
*                                      increments of 1/256 of a         01330000
*                                      degree centigrade (C).           01331000
*                                      This represents a range of       01332000
*                                      -128 C to 128 (127.996) C.       01333000
*                                      This information is valid if     01334000
*                                      SMF124S1_ValThresh_Temp          01335000
*                                      is on.                        */ 01336000
*                                                                       01337000
*     ,5 SMF124S1_Threshold_Temp_HighAlarm Fixed(16)                    01338000
*                                   /* High alarm threshold          */ 01339000
*     ,5 SMF124S1_Threshold_Temp_LowAlarm Fixed(16)                     01340000
*                                   /* Low alarm threshold           */ 01341000
*     ,5 SMF124S1_Threshold_Temp_HighWarn Fixed(16)                     01342000
*                                   /* High warning threshold        */ 01343000
*     ,5 SMF124S1_Threshold_Temp_LowWarn Fixed(16)                      01344000
*                                   /* Low warning threshold         */ 01345000
*                                                                       01346000
*    /****************************************************************/ 01347000
*    /* Voltage Threshold Information                                */ 01348000
*    /****************************************************************/ 01349000
*   ,3 SMF124S1_Thresholds_Voltage  /* Voltage thresholds.              01350000
*                                      Each field is in units of 100    01351000
*                                      microvolts (uV).                 01352000
*                                      This represents a range of       01353000
*                                      0 to 6.55 volts (V).             01354000
*                                      This information is valid if     01355000
*                                      SMF124S1_ValThresh_Voltage       01356000
*                                      is on.                        */ 01357000
*                                                                       01358000
*     ,5 SMF124S1_Threshold_Voltage_HighAlarm Fixed(16)                 01359000
*                                   /* High alarm threshold          */ 01360000
*     ,5 SMF124S1_Threshold_Voltage_LowAlarm Fixed(16)                  01361000
*                                   /* Low alarm threshold           */ 01362000
*     ,5 SMF124S1_Threshold_Voltage_HighWarn Fixed(16)                  01363000
*                                   /* High warning threshold        */ 01364000
*     ,5 SMF124S1_Threshold_Voltage_LowWarn Fixed(16)                   01365000
*                                   /* Low warning threshold         */ 01366000
*                                                                       01367000
*    /****************************************************************/ 01368000
*    /* Transmitter Laser Bias Current (Tx Bias) Thresholds          */ 01369000
*    /****************************************************************/ 01370000
*   ,3 SMF124S1_Thresholds_TxBias   /* Transmitter laser bias current   01371000
*                                      (Tx Bias) thresholds.            01372000
*                                      Each field is in units of 2      01373000
*                                      microamps (uA).                  01374000
*                                      This represents a range of       01375000
*                                      0 to 131 milliamps (mA).         01376000
*                                      This information is valid if     01377000
*                                      SMF124S1_ValThresh_Bias          01378000
*                                      is on.                        */ 01379000
*                                                                       01380000
*     ,5 SMF124S1_Threshold_TxBias_HighAlarm Fixed(16)                  01381000
*                                   /* High alarm threshold          */ 01382000
*     ,5 SMF124S1_Threshold_TxBias_LowAlarm Fixed(16)                   01383000
*                                   /* Low alarm threshold           */ 01384000
*     ,5 SMF124S1_Threshold_TxBias_HighWarn Fixed(16)                   01385000
*                                   /* High warning threshold        */ 01386000
*     ,5 SMF124S1_Threshold_TxBias_LowWarn Fixed(16)                    01387000
*                                   /* Low warning threshold         */ 01388000
*                                                                       01389000
*    /****************************************************************/ 01390000
*    /* Transmit (Tx) Power Optical Thresholds.                      */ 01391000
*    /****************************************************************/ 01392000
*   ,3 SMF124S1_Thresholds_TxPower  /* Tx Power thresholds.             01393000
*                                      Each field is in units of 0.1    01394000
*                                      microwatts (uW).                 01395000
*                                      This represents a range of       01396000
*                                      0 to 6.5 milliwatts (mW).        01397000
*                                      This information is valid if     01398000
*                                      SMF124S1_ValThresh_TxPower       01399000
*                                      is on.                        */ 01400000
*                                                                       01401000
*     ,5 SMF124S1_Threshold_TxPower_HighAlarm Fixed(16)                 01402000
*                                   /* High alarm threshold          */ 01403000
*     ,5 SMF124S1_Threshold_TxPower_LowAlarm Fixed(16)                  01404000
*                                   /* Low alarm threshold           */ 01405000
*     ,5 SMF124S1_Threshold_TxPower_HighWarn Fixed(16)                  01406000
*                                   /* High warning threshold        */ 01407000
*     ,5 SMF124S1_Threshold_TxPower_LowWarn Fixed(16)                   01408000
*                                   /* Low warning threshold         */ 01409000
*                                                                       01410000
*    /****************************************************************/ 01411000
*    /* Receive (Rx) Power Optical Threshold Information             */ 01412000
*    /****************************************************************/ 01413000
*   ,3 SMF124S1_Thresholds_RxPower  /* Rx Power thresholds.             01414000
*                                      Each field is in units of 0.1    01415000
*                                      microwatts (uW).                 01416000
*                                      This represents a range of       01417000
*                                      0 to 6.5 milliwatts (mW).        01418000
*                                      This information is valid if     01419000
*                                      SMF124S1_ValThresh_RxPower       01420000
*                                      is on.                        */ 01421000
*                                                                       01422000
*     ,5 SMF124S1_Threshold_RxPower_HighAlarm Fixed(16)                 01423000
*                                   /* High alarm threshold          */ 01424000
*     ,5 SMF124S1_Threshold_RxPower_LowAlarm Fixed(16)                  01425000
*                                   /* Low alarm threshold           */ 01426000
*     ,5 SMF124S1_Threshold_RxPower_HighWarn Fixed(16)                  01427000
*                                   /* High warning threshold        */ 01428000
*     ,5 SMF124S1_Threshold_RxPower_LowWarn Fixed(16)                   01429000
*                                   /* Low warning threshold         */ 01430000
*                                                                       01431000
*    /****************************************************************/ 01432000
*    /* Attached Port Name                                       @01A*/ 01433000
*    /****************************************************************/ 01434000
*   ,3 SMF124S1_AttWWPN Char(8)     /* World wide port name of the      01435000
*                                      attached port.  This information 01436000
*                                      is valid if SMF124S1_ValAttWWPN  01437000
*                                      flag is on                @01A*/ 01438000
*   ,3 SMF124S1_Level Fixed(8)      /* Level indicator of record        01439000
*                                       '01' - indicates that           01440000
*                                              SMF124S1_ID_IntID_Val    01441000
*                                              has been set      @04A*/ 01442000
*   ,3 * Char(107)                  /* Reserved                  @04C*/ 01443000
*   ;                                                                   01444000
*                                                                       01445000
*/********************************************************************/ 01446000
*/*                                                                  */ 01447000
*/* Subtype 2 (Endpoint Security Status) Section                     */ 01448000
*/*                                                              @03A*/ 01449000
*/********************************************************************/ 01450000
*Dcl                                                                    01451000
*  1 SMF124S2_EPSecStat_Section Bdy(Word)                               01452000
*             Based(Addr(SMF124Rec) + SMF124S2_EPSecStat_Offset)        01453000
*                                   /* Start of Endpoint-Security       01454000
*                                      Status mode change section       01455000
*                                                                @03A*/ 01456000
*   ,3 SMF124S2_CHPID Fixed(8)      /* CHPID                     @03A*/ 01457000
*   ,3 SMF124S2_PCHID Char(2)       /* Physical channel id of CHPID     01458000
*                                                                @03A*/ 01459000
*   ,3 SMF124S2_ChpWWPN Char(8)     /* WWPN of channel           @03A*/ 01460000
*   ,3 SMF124S2_LAddr Char(3)       /* Destination link address  @03A*/ 01461000
*   ,3 SMF124S2_IntID Char(2)       /* Interface ID of CU port   @03A*/ 01462000
*   ,3 SMF124S2_CUWWPN Char(8)      /* WWPN of CU port           @03A*/ 01463000
*   ,3 SMF124S2_ReportSrc Fixed(8)  /* Reporting source.  Constants:    01464000
*                                      SMF124S2_ReportSrc_x             01465000
*                                                                @03A*/ 01466000
*   ,3 SMF124S2_EPSec_Curr Fixed(8) /* Current endpoint security        01467000
*                                      status.  Constants:              01468000
*                                      SMF124S2_EpSec_xxxxx      @03A*/ 01469000
*   ,3 SMF124S2_CHPIDCapability Fixed(8)                                01470000
*                                   /* Endpoint security capability     01471000
*                                      of the CHPID.  Constants:        01472000
*                                      SMF124S2_EpSec_xxxxx      @03A*/ 01473000
*                                                                       01474000
*   ,3 SMF124S2_Flag1 Bit(8)        /* Flag 1                    @03A*/ 01475000
*     ,5 SMF124S2_EPSec_Summ Bit(2)  /* Summary flag.  The two flags    01476000
*                                      below are mutually exclusive.    01477000
*                                      If neither flag is on, then      01478000
*                                      no endpoint security is in       01479000
*                                      effect                    @03A*/ 01480000
*       ,7 SMF124S2_EPSec_Auth Bit(1) /* Authentication is in effect    01481000
*                                                                @03A*/ 01482000
*       ,7 SMF124S2_EPSec_Encr Bit(1) /* Encryption is in effect @03A*/ 01483000
*     ,5 SMF124S2_IntId_Val Bit(1)    /* This bit is on when            01484000
*                                        SMF124S2_IntId is valid and    01485000
*                                        SMF124S2_Level is not 0 @04A*/ 01486000
*   ,3 SMF124S2_Level Fixed(8)      /* Level indicator of record        01487000
*                                      '01' - indicates that            01488000
*                                             SMF124S2_IntId_Val        01489000
*                                             has been set       @04A*/ 01490000
*   ,3 * Char(28)                   /* Reserved                  @04C*/ 01491000
*   ;                               /*                           @03A*/ 01492000
*                                                                       01493000
*/********************************************************************/ 01494000
*/*                                                                  */ 01495000
*/* Subtype 3 (Endpoint Security Authentication Key Update) Section  */ 01496000
*/*                                                                  */ 01497000
*/* This section represents an update of the authentication key      */ 01498000
*/* (shared secret) between the CPC and a peer node.                 */ 01499000
*/*                                                              @03A*/ 01500000
*/********************************************************************/ 01501000
*Dcl                                                                    01502000
*  1 SMF124S3_AuthKeyUpd_Section Bdy(Word)                              01503000
*             Based(Addr(SMF124Rec) + SMF124S3_AuthKeyUpd_Offset)       01504000
*                                   /* Start of section          @03A*/ 01505000
*   ,3 SMF124S3_PeerWWNN Char(8)    /* WWNN of peer node         @03A*/ 01506000
*   ,3 * Char(32)                   /* Reserved                  @03A*/ 01507000
*   ;                               /*                           @03A*/ 01508000
*                                                                       01509000
*/********************************************************************/ 01510000
*/*                                                                  */ 01511000
*/* Subtype 4 (Endpoint Security Encryption Key Update) Section      */ 01512000
*/*                                                                  */ 01513000
*/* This section represents an update of the encryption key          */ 01514000
*/* (session key) between the channel and its endpoint (another      */ 01515000
*/* channel or a control unit port).                                 */ 01516000
*/*                                                              @03A*/ 01517000
*/********************************************************************/ 01518000
*Dcl                                                                    01519000
*  1 SMF124S4_EncrKeyUpd_Section Bdy(Word)                              01520000
*             Based(Addr(SMF124Rec) + SMF124S4_EncrKeyUpd_Offset)       01521000
*                                   /* Start of section          @03A*/ 01522000
*   ,3 SMF124S4_CHPID Char(1)       /* CHPID associated with the        01523000
*                                      event                     @03A*/ 01524000
*   ,3 SMF124S4_PCHID Char(2)       /* Physical channel id of CHPID     01525000
*                                                                @03A*/ 01526000
*   ,3 SMF124S4_ChpWWPN Char(8)     /* WWPN of CHPID             @03A*/ 01527000
*   ,3 SMF124S4_LinkAddr Char(2)    /* Link address associated          01528000
*                                      with the event            @03A*/ 01529000
*   ,3 SMF124S4_CUIntId Char(2)     /* Interface id of CU port   @03A*/ 01530000
*   ,3 SMF124S4_CUWWPN Char(8)      /* WWPN of CU port           @03A*/ 01531000
*                                                                       01532000
*   ,3 SMF124S4_Flag1 Bit(8)        /*                           @04A*/ 01533000
*     ,5 SMF124S4_CUIntId_Val Bit(1) /* This bit is on when             01534000
*                                       SMF124S4_CUIntId is valid and   01535000
*                                       SMF124S4_Level is not 0  @04A*/ 01536000
*   ,3 SMF124S4_Level Fixed(8)      /* Level indicator of record        01537000
*                                      '01' - indicates that            01538000
*                                             SMF124S4_CUIntId_Val      01539000
*                                             has been set       @04A*/ 01540000
*   ,3 * Char(30)                   /* Reserved                  @04C*/ 01541000
*   ;                               /*                           @03A*/ 01542000
*                                                                       01543000
*/********************************************************************/ 01544000
*/*                                                                  */ 01545000
*/* Subtype 5 (External Key Manager Information) Section             */ 01546000
*/*                                                              @03A*/ 01547000
*/********************************************************************/ 01548000
*Dcl                                                                    01549000
*  1 SMF124S5_ExtKeyMgrInfo_Section Bdy(Word)                           01550000
*             Based(Addr(SMF124Rec) + SMF124S5_ExtKeyMgrInfo_Offset)    01551000
*                                   /* Start of section          @03A*/ 01552000
*   ,3 SMF124S5_AvStatus Char(1)    /* Availablity status of            01553000
*                                      the external key manager.        01554000
*                                      Constants: SMF124S5_AvStatus_xx  01555000
*                                                                @03A*/ 01556000
*   ,3 SMF124S5_IDType Char(1)      /* Identifier type of the           01557000
*                                      External Key Manager.            01558000
*                                      Constants: SMF124S5_IdType_xx    01559000
*                                                                @03A*/ 01560000
*   ,3 SMF124S5_Id_Length Fixed(8)  /* length of Identifier when id     01561000
*                                      type is 3 (hostname)      @03A*/ 01562000
*   ,3 SMF124S5_Identifier Char(255) /* External Key Manager Identifier 01563000
*                                                                @03A*/ 01564000
*   ,3 * Char(32)                   /* Reserved                  @03A*/ 01565000
*   ;                               /*                           @03A*/ 01566000
*                                                                       01567000
*/********************************************************************/ 01568000
*/*                                                                  */ 01569000
*/* SMF124S1_PortType Constants                                      */ 01570000
*/*                                                                  */ 01571000
*/********************************************************************/ 01572000
*Dcl                                                                    01573000
*  SMF124S1_PortType_Channel Fixed(8) Constant(1)                       01574000
*                                   /* Channel port                  */ 01575000
* ,SMF124S1_PortType_EntrySwitch Fixed(8) Constant(2)                   01576000
*                                   /* Entry switch port             */ 01577000
* ,SMF124S1_PortType_ExitSwitch Fixed(8) Constant(3)                    01578000
*                                   /* Exit switch port              */ 01579000
* ,SMF124S1_PortType_CU Fixed(8) Constant(4)                            01580000
*                                   /* Control unit port             */ 01581000
* ;                                                                     01582000
*                                                                       01583000
*/********************************************************************/ 01584000
*/*                                                                  */ 01585000
*/* SMF124S1_IdSize Constants                                        */ 01586000
*/*                                                                  */ 01587000
*/********************************************************************/ 01588000
*Dcl                                                                    01589000
*  SMF124S1_IdSize1 Bit(8) Constant('01'x)                              01590000
*                                   /* Identifier size is 1          */ 01591000
* ,SMF124S1_IdSize2 Bit(8) Constant('02'x)                              01592000
*                                   /* Identifier size is 2          */ 01593000
* ,SMF124S1_IdSize3 Bit(8) Constant('03'x)                              01594000
*                                   /* Identifier size is 3          */ 01595000
* ;                                                                     01596000
*                                                                       01597000
*/********************************************************************/ 01598000
*/*                                                                  */ 01599000
*/* SMF124S1_ReportSrc Constants.                                    */ 01600000
*/*                                                                  */ 01601000
*/********************************************************************/ 01602000
*Dcl                                                                    01603000
*  SMF124S1_ReportSrc_Monitor Fixed(8) Constant(1)                      01604000
*                                   /* Periodic monitoring           */ 01605000
* ;                                                                     01606000
*                                                                       01607000
*/********************************************************************/ 01608000
*/*                                                                  */ 01609000
*/* SMF124S1_Level Constants.                                        */ 01610000
*/*                                                              @04A*/ 01611000
*/********************************************************************/ 01612000
*Dcl                                                                    01613000
*  SMF124S1_Level0 Fixed(8) Constant(0)                                 01614000
*                                   /* Initial level             @04A*/ 01615000
* ,SMF124S1_Level1 Fixed(8) Constant(1)                                 01616000
*                                   /* Level of record where            01617000
*                                       SMF124S1_ID_IntID_Val was       01618000
*                                       introduced               @04A*/ 01619000
* ,SMF124S1_LevelCurrent Fixed(8) Constant(1)                           01620000
*                                   /* Current level of record   @04A*/ 01621000
* ;                                                                     01622000
*                                                                       01623000
*/********************************************************************/ 01624000
*/*                                                                  */ 01625000
*/* SMF124S2_ReportSrc Constants.                                    */ 01626000
*/*                                                              @03A*/ 01627000
*/********************************************************************/ 01628000
*Dcl                                                                    01629000
*  SMF124S2_ReportSrc_Init Fixed(8) Constant(1)                         01630000
*                                   /* Initial endpoint security        01631000
*                                      status                    @03A*/ 01632000
* ,SMF124S2_ReportSrc_StatChg Fixed(8) Constant(2)                      01633000
*                                   /* Endpoint security status         01634000
*                                      change                    @03A*/ 01635000
* ;                                                                     01636000
*                                                                       01637000
*/********************************************************************/ 01638000
*/*                                                                  */ 01639000
*/* SMF124S2_EPSec_Curr and SMF124S2_CHPIDCapability Constants       */ 01640000
*/*                                                              @03A*/ 01641000
*/********************************************************************/ 01642000
*Dcl                                                                    01643000
*  SMF124S2_EpSec_NE Fixed(8) Constant(0)                               01644000
*                                   /* Endpoint-Security is not         01645000
*                                      enabled or not supported  @03A*/ 01646000
* ,SMF124S2_EpSec_Authenticated Fixed(8) Constant(1)                    01647000
*                                   /* Authentication is enabled @03A*/ 01648000
* ,SMF124S2_EpSec_FCSP2 Fixed(8) Constant(2)                            01649000
*                                   /* Encryption is enabled with       01650000
*                                      FC-SP-2 compliant integrity      01651000
*                                      checking                  @03A*/ 01652000
* ,SMF124S2_EpSec_RAS Fixed(8) Constant(3)                              01653000
*                                   /* Encryption is enabled with       01654000
*                                      enhanced-RAS integrity checking  01655000
*                                                                @03A*/ 01656000
* ;                                                                     01657000
*                                                                       01658000
*/********************************************************************/ 01659000
*/*                                                                  */ 01660000
*/* SMF124S2_Level Constants.                                        */ 01661000
*/*                                                              @04A*/ 01662000
*/********************************************************************/ 01663000
*Dcl                                                                    01664000
*  SMF124S2_Level0 Fixed(8) Constant(0)                                 01665000
*                                   /* Initial level             @04A*/ 01666000
* ,SMF124S2_Level1 Fixed(8) Constant(1)                                 01667000
*                                   /* Level of record where            01668000
*                                       SMF124S2_IntId_Val was          01669000
*                                       introduced               @04A*/ 01670000
* ,SMF124S2_LevelCurrent Fixed(8) Constant(1)                           01671000
*                                   /* Current level of record   @04A*/ 01672000
* ;                                                                     01673000
*                                                                       01674000
*/********************************************************************/ 01675000
*/*                                                                  */ 01676000
*/* SMF124S4_Level Constants.                                        */ 01677000
*/*                                                              @04A*/ 01678000
*/********************************************************************/ 01679000
*Dcl                                                                    01680000
*  SMF124S4_Level0 Fixed(8) Constant(0)                                 01681000
*                                   /* Initial level             @04A*/ 01682000
* ,SMF124S4_Level1 Fixed(8) Constant(1)                                 01683000
*                                   /* Level of record where            01684000
*                                       SMF124S4_IntId_Val was          01685000
*                                       introduced               @04A*/ 01686000
* ,SMF124S4_LevelCurrent Fixed(8) Constant(1)                           01687000
*                                   /* Current level of record   @04A*/ 01688000
* ;                                                                     01689000
*                                                                       01690000
*/********************************************************************/ 01691000
*/*                                                                  */ 01692000
*/* SMF124S5_AvStatus Constants                                      */ 01693000
*/*                                                              @03A*/ 01694000
*/********************************************************************/ 01695000
*Dcl                                                                    01696000
*  SMF124S5_AvStatus_Available Fixed(8) Constant(1)                     01697000
*                                   /* Available                 @03A*/ 01698000
* ,SMF124S5_AvStatus_Unavailable Fixed(8) Constant(2)                   01699000
*                                   /* Unavailable               @03A*/ 01700000
* ;                                                                     01701000
*                                                                       01702000
*/********************************************************************/ 01703000
*/*                                                                  */ 01704000
*/* SMF124S5_IdType Constants.                                       */ 01705000
*/*                                                              @03A*/ 01706000
*/********************************************************************/ 01707000
*Dcl                                                                    01708000
*  SMF124S5_IdType_Unknown Fixed(8) Constant(0)                         01709000
*                                   /* Format is unknown         @03A*/ 01710000
* ,SMF124S5_IdType_IPv4 Fixed(8) Constant(1)                            01711000
*                                   /* Format is IPv4            @03A*/ 01712000
* ,SMF124S5_IdType_IPv6 Fixed(8) Constant(2)                            01713000
*                                   /* Format is IPv6            @03A*/ 01714000
* ,SMF124S5_IdType_Host Fixed(8) Constant(3)                            01715000
*                                   /* Format is EBCDIC hostname @03A*/ 01716000
* ;                                                                     01717000
*                                                                       01718000
*@LOGIC;                                                                01719000
*   #PRAGMA TOOL=CBGEN.                                                 01720000
*   #ENV.Z/OS                                                           01721000
*   #EPRAGMA.                                                           01722000
*@ENDLOGIC;                                                             01723000
*/* End of PL/X Source                                               */ 01724000
*/* End of PL/X Source                                               */ 01725000
* %IF IOSDS124_LIST = 'NO' !                                            01726000
*    ZCBPRINT = 'NO' %THEN                                              01727000
* %DO;                                                                  01728000
*   @LIST POP NOECHO;                                                   01729000
* %END;                                                                 01730000
* %END;                                                                 01731000
