*                                                                       00010000
* %DCL IOSDIECA_INCLUDED CHAR EXT;                                      00020000
* %DEACTIVATE IOSDIECA_INCLUDED;                                        00030000
* %IF IOSDIECA_INCLUDED = '' %THEN                                      00040000
* %DO;                                                                  00050000
*/* Macro made bi-lingual on 02080. CBGEN compile date 02060         */ 00060000
*% /*                                                                   00070000
         MACRO                                                          00080000
         IOSDIECA &DSECT=YES,&LIST=YES,&TITLE=YES,&CSECT=NO             00090000
         GBLC  &IOSDIECA_INCLUDED                                       00100000
         GBLC  &ZCBPRINT                                                00110000
&IOSDIECA_INCLUDED SETC 'YES'                                           00120000
         AIF   ('&LIST' EQ 'NONE').P0                                   00130000
         AIF   ('&TITLE' EQ 'NO').P5                                    00140000
 TITLE   'IOSDIECA  - IOS Extended Communication Area               '   00150000
.P5      ANOP                                                           00160000
**/ IOSDIECA_1:;                                                        00170000
*/*** Start Of Specifications ****************************************  00180000
*                                                                    *  00190000
*01* Macro Name: IOSDIECA                                            *  00200000
*                                                                    *  00210000
*01* Descriptive Name: IOS Extended Communication Area               *  00220000
*                                                                    *  00230000
*02*  Acronym: IECA                                                  *  00240000
*                                                                    *  00250000
*02*  Dsect Name: IECA                                               *  00260000
*                                                                    *  00270000
*01* Proprietary Statement                                           *  00280000
*    Licensed Materials - Property of IBM                            *  00290000
*    5650-ZOS COPYRIGHT IBM CORP. 2002, 2013                         *  00300000
*                                                                    *  00310000
*01* Status: HBB7790                                                 *  00320000
*                                                                    *  00330000
*01* Component: I/O Supervisor (SC1C3)                               *  00340000
*                                                                    *  00350000
*01* Function:                                                       *  00360000
*       Provide an area for communication between IOS and other      *  00370000
*       programs.                                                    *  00380000
*                                                                    *  00390000
*01* Eye-Catcher: IECA                                               *  00400000
*02*  Offset: 0                                                      *  00410000
*02*  Length: 4                                                      *  00420000
*                                                                    *  00430000
*01* Created By: IOSVDATA                                            *  00440000
*                                                                    *  00450000
*01* Deleted By: N/A                                                 *  00460000
*                                                                    *  00470000
*01* Pointed To By: IOCIECAA field of the writable IOCOM             *  00480000
*                                                                    *  00490000
*01* Size: 64 bytes                                                  *  00500000
*                                                                    *  00510000
*01* Module Type: Mapping macro                                      *  00520000
*                                                                    *  00530000
*01* Method Of Access:                                               *  00540000
*                                                                    *  00550000
*     ASM:   IOSDIECA CSECT=value                                    *  00560000
*              Where value is:                                       *  00570000
*              YES - Maps the IECA as a CSECT.                       *  00580000
*                    Note:  This option is used by                   *  00590000
*                           IOSVDATA to allocate the                 *  00600000
*                           communication area                       *  00610000
*               NO - Maps the IECA as a DSECT.                       *  00620000
*                                                                    *  00630000
*     PL/X:  %INCLUDE SYSLIB(IOSDIECA)                               *  00640000
*                                                                    *  00650000
*            Note: PL/X users must also include the I/O              *  00660000
*                  Communication area mapped by IECDIOCM             *  00670000
*                                                                    *  00680000
*01* Dependencies: None                                              *  00690000
*                                                                    *  00700000
*01* Serialization:  Compare and Swap (CS) when setting the          *  00710000
*                    Fsdq queue header                               *  00720000
*                                                                    *  00730000
*01* Restrictions: None                                              *  00740000
*                                                                    *  00750000
*01* Storage Attributes:                                             *  00760000
*02*  Subpool: Nucleus                                               *  00770000
*02*  Key: N/A                                                       *  00780000
*02*  Data Space: N/A                                                *  00790000
*02*  Residency: Above 16M Line                                      *  00800000
*02*  Frequency: One                                                 *  00810000
*02*  Main Storage: Yes                                              *  00820000
*02*  Auxiliary Storage: N/A                                         *  00830000
*02*  Virtual Storage: N/A                                           *  00840000
*                                                                    *  00850000
*01* Distribution Library (DLIB): AMACLIB                            *  00860000
*                                                                    *  00870000
*01* External Classification: PI                                     *  00880000
*01* End of External Classification:                                 *  00890000
*                                                                    *  00900000
*01* Change Activity:                                                *  00910000
*                                                                    *  00920000
* Flag Item     FMID    Date   ID      Comment                       *  00930000
* ---- -------- ------- ------ ----    ----------------------------- *  00940000
* $L0  OW51415  HBB7703 020409 PDHC    Winterpark II fixes           *  00950000
* $01  OA43308  HBB7780 150401 PDB7    Dynamic Routing Health Check  *  00951000
*                                      support                       *  00952000
* $02  OA44529  HBB7780 140615 PDSW    Fabric I/O Priority Support   *  00953000
*                                                                    *  00954000
**** End Of Specifications *******************************************/ 00955000
*% /*                                                                   00956000
.P0      ANOP                                                           00957000
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 00958000
         AIF   ('&LIST' EQ 'YES').P2                                    00959000
.P1      ANOP                                                           00960000
         PUSH  PRINT                                                    00970000
         PRINT OFF                                                      00980000
.P2      ANOP                                                           00990000
         AIF   ('&CSECT' EQ 'YES').L0002                                01000000
         AIF   ('&DSECT' EQ 'YES').L0003                                01010000
         AGO   .L0005                                                   01020000
.L0002   ANOP                                                           01030000
IECA     DS    0D                                                       01040000
         ENTRY IECA                                                     01050000
         AGO   .L0004                                                   01060000
.L0003   ANOP                                                           01070000
IECA     DSECT                                                          01080000
.L0004   ANOP                                                           01090000
IECA_ID  DC    1CL4'IECA'  Eye catcher                                  01100000
IECA_IOSAS_ASCB_ADDR DC 1AL4(0) For cross-memory POST                   01110000
IECA_IOSVFSD_TTOKEN DC 1XL0016'00' For cross-memory POST                01120000
IECA_IOSVFSD_ECB DS 0BL4 ECB to invoke IOSVFSD                          01130000
IECA_IOSVFSD_ECB_WAIT EQU X'80'                                         01140000
IECA_IOSVFSD_ECB_POST EQU X'40'                                         01150000
         ORG   IECA_IOSVFSD_ECB+X'00000004'                             01160000
IECA_FSDQ_HEADER DC 1AL4(0) Fsdq queue header                           01170000
IECA_IRDVFSD_EP@ DC 1AL4(0) E.P. address of IRDVFSD                     01180000
IECA_FLAGS DS  0BL1                                                     01190000
IECA_IOSVFSD_IS_READY EQU X'80' OK to invoke IOSVFSD                    01200000
IECA_RunDynRoutHealth EQU X'40' The dynamic routing check should be run 01210000
*                               due to changes in the configuration     01220000
         ORG   IECA_FLAGS+X'00000001'                                   01230000
IECA_VERS DC   XL1'00'   Version Number                                 01240000
IECA_MAXFABRIC_PRTY DS X Max Fabric I/O Priority                        01250000
         DC    XL1'00'   Reserved                                       01260000
IECA_NUMDYNROUTSWITCHES DC XL4'0'                                       01270000
         DC    1XL20'00' Reserved                                       01270100
IECA_NAME EQU  C'IECA'   Characters for acronym                         01270200
IECA_LEN EQU   *-IECA                                                   01270300
IECA_CURRVERS  EQU 0                                                    01270400
.L0005   ANOP                                                           01270500
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 01270600
         AIF   ('&LIST' EQ 'YES').P4                                    01270700
.P3      ANOP                                                           01270800
         POP   PRINT                                                    01270900
.P4      ANOP                                                           01271000
.P_EXIT  ANOP                                                           01272000
         MEND                                                           01273000
**/ IOSDIECA_2:;                                                        01274000
* %IOSDIECA_INCLUDED = 'YES';                                           01275000
* %DCL ZCBPRINT CHAR EXT;                                               01276000
* %DEACTIVATE ZCBPRINT;                                                 01277000
* %DCL IOSDIECA_LIST CHAR EXT;                                          01278000
* %DEACTIVATE IOSDIECA_LIST;                                            01279000
* %IF IOSDIECA_LIST ^= 'NO' &                                           01280000
*    ZCBPRINT ^= 'NO' %THEN                                             01290000
*   %GOTO IOSDIECA_3;                                                   01300000
*   @LIST PUSH NOECHO;                                                  01310000
*   @LIST NOASSEMBLE NOECHO;                                            01320000
*   @LIST OFF C NOECHO;                                                 01330000
* %IOSDIECA_3:;                                                         01340000
*/* Start of PL/X Source                                             */ 01350000
*                                                                       01360000
*DECLARE                                                                01370000
*  1 IECA Char(64) Bdy(DWORD) Based(IOCIECAA),                          01380000
*    3 IECA_ID                  Char(4),  /* Eye catcher             */ 01390000
*    3 IECA_IOSAS_ASCB_ADDR     Ptr(31),  /* For cross-memory POST   */ 01400000
*    3 IECA_IOSVFSD_TTOKEN      Char(16), /* For cross-memory POST   */ 01410000
*    3 IECA_IOSVFSD_ECB         Bit(32),  /* ECB to invoke IOSVFSD   */ 01420000
*      5 IECA_IOSVFSD_ECB_WAIT    Bit(1),                               01430000
*      5 IECA_IOSVFSD_ECB_POST    Bit(1),                               01440000
*    3 IECA_FSDQ_HEADER         Ptr(31) Abnl, /* Fsdq queue header   */ 01450000
*    3 IECA_IRDVFSD_EP@         Ptr(31),  /* E.P. address of IRDVFSD */ 01460000
*    3 IECA_FLAGS               Bit(8) Abnl,                  /* @01C*/ 01470000
*      5 IECA_IOSVFSD_IS_READY    Bit(1), /* OK to invoke IOSVFSD    */ 01480000
*      5 IECA_RunDynRoutHealth    Bit(1), /* The dynamic routing        01490000
*                                            health check should be     01500000
*                                            run, due to changes in     01510000
*                                            the configuration   @01A*/ 01520000
*      5 *                        Bit(6), /* Reserved            @01C*/ 01530000
*    3 IECA_Vers                Fixed(8), /* Version Number      @01A*/ 01540000
*    3 IECA_MaxFabric_Prty      Fixed(8), /* Max Fabric I/O Priority    01550000
*                                                                @02A*/ 01560000
*    3 *                        Char(1),  /* Reserved            @02C*/ 01570000
*    3 IECA_NumDynRoutSwitches  Fixed(32),/* The number of switches     01580000
*                                            known by IOS to have       01590000
*                                            dynamic routing enabled.   01600000
*                                            Set by FICON director      01610000
*                                            component.                 01620000
*                                            Serialized by CS    @01A*/ 01630000
*    3 *                        Char(20); /* Reserved            @01C*/ 01640000
*                                                                       01650000
*                                                                       01660000
*DECLARE                                                                01670000
*  IECA_NAME CHAR(4)  CONSTANT('IECA')    /* Acronym constant        */ 01680000
* ,IECA_CurrVers Fixed(8) Constant(0)     /* Version constant    @01A*/ 01690000
* ;                                                                     01700000
*/* End of PL/X Source                                               */ 01710000
* %IF IOSDIECA_LIST ^= 'NO' &                                           01720000
*    ZCBPRINT ^= 'NO' %THEN                                             01730000
*   %GOTO IOSDIECA_4;                                                   01740000
*   @LIST POP NOECHO;                                                   01750000
* %IOSDIECA_4:;                                                         01760000
* %END;                                                                 01770000
