*%GOTO   SHIDX1;                  /* BILINGUAL MAPPING                  00010000
         MACRO                                                          00020000
         IOSDSHID &ENTRY=NO                                             00030000
.*                                                                   */ 00040000
*%SHIDX1: ;                       /*                                 */ 00050000
*/***START OF SPECIFICATIONS******************************************/ 00060000
*/*                                                                  */ 00070000
*/*01*  MACRO NAME = IOSDSHID                                        */ 00080000
*/*                                                                  */ 00090000
*/*01*  DESCRIPTIVE NAME = System Host ID Mapping                    */ 00100000
*/*                                                                  */ 00110000
*/* PROPRIETARY STATEMENT =                                          */ 00120000
*/*                                                                  */ 00130000
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00131006
*/* 5650-ZOS COPYRIGHT IBM CORP. 1993, 2017                          */ 00132007
*/*                                                                  */ 00133006
*/* STATUS = HBB7790                                             @L1C*/ 00190006
*/*                                                                  */ 00200000
*/*01*  FUNCTION = Maps the System Host ID, Alternate System Host    */ 00210000
*/*                ID, Central Processing Complex Node Descriptor    */ 00220000
*/*                and Central Processing Complex Node Identifier    */ 00230000
*/*                                                              @L1C*/ 00240000
*/*                                                                  */ 00250000
*/*02*  ACRONYM = SHID                                               */ 00260000
*/*                                                                  */ 00270000
*/*01* MACRO NAME = IOSDSHID                                         */ 00280000
*/*                                                                  */ 00290000
*/*01* DSECT NAME = SHID                                             */ 00300000
*/*                                                                  */ 00310000
*/*01* COMPONENT = I/O Supervisor (SC1C3)                            */ 00320000
*/*                                                                  */ 00330000
*/*01* EYE-CATCHER = None                                            */ 00340000
*/*                                                                  */ 00350000
*/*01* STORAGE ATTRIBUTES:                                           */ 00360000
*/*02*  Subpool: N/A - Nucleus resident                              */ 00370000
*/*02*  Key: 0                                                       */ 00380000
*/*02*  Residency: Any                                               */ 00390000
*/*02*  Main Storage: YES                                            */ 00400000
*/*02*  Auxiliary Storage: N/A                                       */ 00410000
*/*02*  Virtual Storage: N/A                                         */ 00420000
*/*                                                                  */ 00430000
*/*01* SIZE:  56 bytes                                               */ 00440000
*/*                                                                  */ 00450000
*/*01* CREATED BY: IOSVDATA                                          */ 00460000
*/*                                                                  */ 00470000
*/*01* POINTED TO BY: CVTHID field of the CVT data area              */ 00480000
*/*                                                                  */ 00490000
*/*01* SERIALIZATION = None                                          */ 00500000
*/*                                                                  */ 00510000
*/*01* EXTERNAL CLASSIFICATION: PSPI                                 */ 00520000
*/*    END OF EXTERNAL CLASSIFICATION                                */ 00530000
*/*                                                                  */ 00540000
*/*01* METHOD OF ACCESS =                                            */ 00550000
*/*02*      ASM: IOSDSHID                                            */ 00560000
*/*                                                                  */ 00570000
*/*02*    PL/AS: %INCLUDE SYSLIB(IOSDSHID)                           */ 00580000
*/*                                                                  */ 00590000
*/*              To define structure SHID as BASED, specify:         */ 00600000
*/*                                                                  */ 00610000
*/*                %IOSDSHID_BASE = 'BASED'                          */ 00620000
*/*                                                                  */ 00630000
*/*              If %IOSDSHID_BASE is not specified, the SHID will   */ 00640000
*/*              be based on CVTHID, and therefore the CVT macro     */ 00650000
*/*              must also be included.                          @L2C*/ 00660000
*/*                                                                  */ 00670000
*/*                                                                  */ 00680000
*/*01* DEPENDENCIES - None                                           */ 00690000
*/*                                                                  */ 00700000
*/*01* RESTRICTIONS - None                                           */ 00710000
*/*                                                                  */ 00720000
*/*01* MODULE TYPE - Bilingual macro                                 */ 00730000
*/*                                                                  */ 00740000
*/*01* PROCESSOR - PL/AS Compiler or Assembler H                     */ 00750000
*/*                                                                  */ 00760000
*/*01*  CHANGE ACTIVITY =                                            */ 00770000
*/*                                                                  */ 00780000
*/*   $MAC(IOSDSHID),COMP(SC1C3): System Host ID Mapping             */ 00790000
*/*                                                                  */ 00800000
*/*   PN  REASON   RLSE    DATE   ORG   COMMENTS                     */ 00810000
*/*                                                                  */ 00820000
*/*   $L0=OW13347  HBB4430 950915 PDMC: Externalized version of      */ 00830000
*/*                                     IHAHID mapping macro.        */ 00840000
*/*   $L1=MCSEX    HBB7707 020222 PDKB: MCSS Support - define new    */ 00850000
*/*                                     path group id            @L1A*/ 00860000
*/*   $L2=MCSEX    HBB7707 020430 PDDR: Define VM generated path     */ 00870000
*/*                                     group id bit and allow SHID  */ 00880000
*/*                                     to be defined as BASED   @L2A*/ 00890000
*/*                                                                  */ 00900000
*/*   $01=OW57714  HBB7703 030331 PDON: No code changes.  Shipped    */ 00910000
*/*                                     for completeness.        @01A*/ 00920000
*/*                                                                  */ 00920100
*/*   $AB=OA50653  HBB7790 170915 PDMD: Synchronous I/O support      */ 00920200
*/*                                     - add WWNN, CHImageId        */ 00920304
*/*                                                                  */ 00920500
*/***END OF SPECIFICATIONS********************************************/ 00920600
*%GOTO SHIDX2;                        /*                                00920700
         SPACE 1                                                        00920800
         AIF   ('&ENTRY' EQ 'YES').SHID1A                               00920900
SHID     DSECT                                                          00921000
         AGO   .SHID1B                                                  00921100
.SHID1A  ANOP                                                           00922000
IOSVHID  DS    0D                                                       00923000
         ENTRY IOSVHID                                                  00924000
.SHID1B  ANOP                                                           00925000
**********************************************************************  00926000
* System Host ID Mapping                                                00927000
**********************************************************************  00928000
SHID_SHID   DS   0CL11                   System Host Identifier         00929000
SHID_BYTES01 DS    CL2                   Byte 0 and 1 definitions @L1C  00930000
SHID_CPUAD   EQU   SHID_BYTES01+0,2      CPU address format 0 PGID      00940000
*                                                                 @L1A  00950000
SHID_FMT1_BYTES01 EQU SHID_BYTES01+0,2   Byte 0 and 1 definitions for   00960000
*                                        format 1 path group id (PGID)  00970000
*                                                                 @L1A  00980000
SHID_FORMAT   EQU   SHID_FMT1_BYTES01+0,1  Format byte                  00990000
SHID_PGIDFMT0 EQU   X'00'                  PGID format zero       @L1A  01000000
SHID_PGIDFMT1 EQU   X'80'                  PGID format one        @L1A  01010000
SHID_VM       EQU   X'08'                  VM hipervisor created        01020000
*                                            the PGID             @L2A  01030000
SHID_CSSID    EQU   SHID_FMT1_BYTES01+1,1  Channel Subsystem ID   @L1A  01040000
SHID_INFO   DS   0CL5                    CPU serial/model numbers       01050000
SHID_BYTES234 DS  CL3                    Define Bytes 2 3 and 4   @L1C  01060000
SHID_CPUID  EQU   SHID_BYTES234+0,3      CPU serial number format 0     01070000
*                                        PGID                     @L1A  01080000
SHID_FMT1_BYTES234 EQU SHID_BYTES234+0,3 Define bytes 2,3 and 4 for     01090000
*                                        format 1 PGID            @L1A  01100000
SHID_LPID   EQU   SHID_FMT1_BYTES234+0,1 LPAR ID                  @L1A  01110000
SHID_CPSN   EQU   SHID_FMT1_BYTES234+1,2 CPU serial number        @L1A  01120000
SHID_MODNO  DS    CL2                    CPU model number               01130000
SHID_TODCL  DS    CL4                    Time of day clock (left half)  01140000
**********************************************************************  01150000
* Alternate System Host ID Mapping                                      01160000
**********************************************************************  01170000
SHID_AHID   DS   0CL11                   Alternate System Host ID       01180000
AHID_BYTES01 DS    CL2                   Byte 0 and 1 definitions @L1C  01190000
AHID_CPUAD   EQU   SHID_BYTES01+0,2      CPU address format 0 PGID      01200000
*                                                                 @L1A  01210000
AHID_FMT1_BYTES01 EQU SHID_BYTES01+0,2   Byte 0 and 1 definitions for   01220000
*                                        format 1 path group id   @L1A  01230000
AHID_FORMAT   EQU   SHID_FMT1_BYTES01+0,1  Format byte                  01240000
AHID_PGIDFMT0 EQU   X'00'                  PGID format zero       @L1A  01250000
AHID_PGIDFMT1 EQU   X'80'                  PGID format one        @L1A  01260000
AHID_VM       EQU   X'08'                  VM hipervisor created        01270000
*                                            the PGID             @L2A  01280000
AHID_CSSID    EQU   SHID_FMT1_BYTES01+1,1  Channel Subsystem ID   @L1A  01290000
AHID_INFO   DS   0CL5                    CPU serial/model numbers       01300000
AHID_BYTES234 DS  CL3                    Define Bytes 2 3 and 4   @L1C  01310000
AHID_CPUID  EQU   SHID_BYTES234+0,3      CPU serial number format 0     01320000
*                                        PGID                     @L1A  01330000
AHID_FMT1_BYTES234 EQU SHID_BYTES234+0,3 Define bytes 2,3 and 4 for     01340000
*                                        format 1 PGID            @L1A  01350000
AHID_LPID   EQU   SHID_FMT1_BYTES234+0,1 LPAR ID                  @L1A  01360000
AHID_CPSN   EQU   SHID_FMT1_BYTES234+1,2 CPU serial number        @L1A  01370000
AHID_MODNO  DS    CL2                    CPU model number               01380000
AHID_TODCL  DS    CL4                    Time of day clock (left half)  01390000
**********************************************************************  01400000
* Central Processing Complex Node Descriptor                            01410000
*                                                                       01420000
*  Note - The data indicated by CPCND_SDC is only valid when            01430000
*         the first three bits of CPCND_FLAGS (CPCND_VALID)             01440000
*         do not equal CPCND_INVAL.                                     01450000
**********************************************************************  01460000
SHID_CPCND  DS   0CL32                   CPC Node Descriptor            01470000
CPCND_FLAGS DS    BL1                    Flags                          01480000
CPCND_VALID EQU  X'E0'                   Node descriptor validity       01490000
CPCND_INVAL EQU  X'40'                   Node descriptor invalid        01500000
CPCND_NTYPE EQU  X'10'                   Node type                      01510000
*           EQU  X'0F'                   Reserved                       01520000
CPCND_PARMS DS    CL3                    Node parameters                01530000
CPCND_SDC   DS   0CL28                   Self-describing component      01540000
*                                        (SDC) Identifier               01550000
CPCND_TYPE  DS    CL6                    Type number                    01560000
CPCND_MODEL DS    CL3                    Model number                   01570000
CPCND_MAN   DS    CL3                    Manufacturer                   01580000
CPCND_PLANT DS    CL2                    Plant of manufacture           01590000
CPCND_SEQNO DS    CL12                   Sequence number                01600000
CPCND_TAG   DS    CL2                    Tag                            01610000
**********************************************************************  01620000
* Central Processing Complex Node Identifier Mapping             @L1C   01630000
**********************************************************************  01640000
SHID_CPCID  DS 0CL2                                              @L1C   01650000
CPCID_FLAGS DS  BL1                    Validity Flags            @L1A   01660000
CPCID_VALID EQU X'80'                  Valid indicator           @L1A   01670000
CPCID_MAP   DS CL1                     The last six bits of this byte   01680000
*                                      must be filled with the CPCID    01690000
*                                                                @L1A   01700000
**********************************************************************  01710000
* Central Processing Complex World Wide Node Name                @ABA   01720000
**********************************************************************  01730000
SHID_CPCWWNN DS BL8                    CPC WWNN - if all zeros, WWNN    01740003
*                                      could not be retrieved    @ABA   01750000
**********************************************************************  01751005
* Channel Image Id                                               @ABA   01752005
**********************************************************************  01753005
SHID_CHImageId DS BL1                  Channel Image Id          @ABA   01760003
         MEND                                                        */ 01770000
*%SHIDX2: ;                                                             01780000
*/********************************************************************/ 01790000
*/*                                                                  */ 01800000
*/*  System Host ID Mapping                                          */ 01810000
*/*                                                                  */ 01820000
*/********************************************************************/ 01830000
*%DCL SHIDBASE CHAR;                 /* SHID basing expression   @L2A*/ 01840000
*%SHIDBASE = 'BASED(CVTHID)';        /* Base SHID on CVTHID      @L2A*/ 01850000
*%IF IOSDSHID_BASE ^= 'BASED' %THEN  /* If BASED not specified   @L2A*/ 01860000
*  %GOTO SHIDDCL;                    /* Use default basing       @L2A*/ 01870000
*%SHIDBASE = 'BASED';                /* Just make SHID based     @L2A*/ 01880000
*%SHIDDCL:;                          /*                          @L2A*/ 01890000
*   DECLARE                                                             01900000
*     1 SHID      SHIDBASE,          /*                          @L2C*/ 01910000
*       2 SHID_SHID CHAR(11),        /* System Host ID               */ 01920000
*         3 SHID_BYTES01 UNION,      /* Define bytes 0 and 1     @L1A*/ 01930000
*           5 SHID_CPUAD CHAR(2),    /* CPU address format 0 PGID       01940000
*                                                                @L1A*/ 01950000
*           5 SHID_FMT1_BYTES01 CHAR(2), /* Define bytes 0 and 1 @L1A*/ 01960000
*             7 SHID_FORMAT BIT(2),  /* Format bytes '00'B format 0     01970000
*                                       PGID and '10'B format 1 PGID    01980000
*                                                                @L1A*/ 01990000
*             7 *       BIT(2),      /* Reserved                 @L2A*/ 02000000
*             7 SHID_VM BIT(1),      /* VM hipervisor created           02010000
*                                       the PGID                 @L2A*/ 02020000
*             7 *       BIT(3),      /* Reserved                 @L2C*/ 02030000
*             7 SHID_CSSID CHAR(1),  /* Channel Subsystem Id     @L1A*/ 02040000
*         3 SHID_INFO CHAR(5),       /* CPU serial/model numbers     */ 02050000
*           5 SHID_BYTES234 UNION,   /* Define bytes 2,3 and 4   @L1C*/ 02060000
*             7 SHID_CPUID CHAR(3),  /* CPU ID                   @L1A*/ 02070000
*               9 * BIT(4),          /*                          @L1A*/ 02080000
*               9 SHID_LPARID BIT(4),  /* LPAR ID format 0 PGID  @L1A*/ 02090000
*               9 SHID_CPUSN CHAR(2),  /* CPU serial number format 0    02100000
*                                         PGID                   @L1A*/ 02110000
*             7 SHID_FMT1_CPUID  CHAR(3),   /* CPU ID            @L1A*/ 02120000
*               9 SHID_FMT1_LPARID CHAR(1),  /* LPAR ID format 1 PGID   02130000
*                                                               @L1A*/  02140000
*               9 SHID_FMT1_CPUSN CHAR(2),   /* CPU serial number       02150000
*                                               format 1 PGID    @L1A*/ 02160000
*           5 SHID_MODNO CHAR(2),    /* CPU model number             */ 02170000
*         3 SHID_TODCL CHAR(4),      /* TOD clock left half          */ 02180000
*                                                                       02190000
*/********************************************************************/ 02200000
*/*                                                                  */ 02210000
*/*  Alternate System Host ID Mapping                                */ 02220000
*/*                                                                  */ 02230000
*/********************************************************************/ 02240000
*       2 SHID_AHID CHAR(11),        /* Alternate System Host ID     */ 02250000
*         3 AHID_BYTES01 UNION,      /* Define bytes 0 and 1     @L1A*/ 02260000
*           5 AHID_CPUAD CHAR(2),    /* CPU address format 0 PGID       02270000
*                                                                @L1A*/ 02280000
*           5 AHID_FMT1_BYTES01 CHAR(2), /* Define bytes 0 and 1 @L1A*/ 02290000
*             7 AHID_FORMAT BIT(2),  /* Format bytes '00'B format 0     02300000
*                                       PGID and '10'B format 1 PGID    02310000
*                                                                @L1A*/ 02320000
*             7 *       BIT(2),      /* Reserved                 @L2A*/ 02330000
*             7 AHID_VM BIT(1),      /* VM hipervisor created           02340000
*                                       the PGID                 @L2A*/ 02350000
*             7 *       BIT(3),      /* Reserved                 @L2C*/ 02360000
*             7 AHID_CSSID CHAR(1),  /* Channel subsystem ID     @L2C*/ 02370000
*         3 AHID_INFO CHAR(5),       /* CPU serial/model numbers     */ 02380000
*           5 AHID_BYTES234 UNION,   /* Define bytes 2,3 and 4   @L1C*/ 02390000
*             7 AHID_CPUID CHAR(3),  /* CPU ID                   @L1A*/ 02400000
*               9 * BIT(4),          /*                          @L1A*/ 02410000
*               9 AHID_LPARID BIT(4),  /* LPAR ID format 0 PGID  @L1A*/ 02420000
*               9 AHID_CPUSN CHAR(2),  /* CPU serial number format 0    02430000
*                                         PGID                   @L1A*/ 02440000
*             7 AHID_FMT1_CPUID  CHAR(3),   /* CPU ID            @L1A*/ 02450000
*               9 AHID_FMT1_LPARID CHAR(1),  /* LPAR ID format 1 PGID   02460000
*                                                                @L1A*/ 02470000
*               9 AHID_FMT1_CPUSN CHAR(2),   /* CPU serial number       02480000
*                                               format 1 PGID    @L1A*/ 02490000
*           5 AHID_MODNO CHAR(2),    /* CPU model number             */ 02500000
*         3 AHID_TODCL CHAR(4),      /* TOD clock left half          */ 02510000
*                                                                       02520000
*/********************************************************************/ 02530000
*/*                                                                  */ 02540000
*/*  Central Processing Complex Node Descriptor Mapping              */ 02550000
*/*                                                                  */ 02560000
*/*  Note - The data indicated by CPCND_SDC is only valid when       */ 02570000
*/*         CPCND_VALID ^= CPCND_INVAL                               */ 02580000
*/*                                                                  */ 02590000
*/********************************************************************/ 02600000
*       2 SHID_CPCND CHAR(32),       /* Central Processing Complex      02610000
*                                       Node Descriptor              */ 02620000
*         3 CPCND_FLAGS BIT(8),      /* Flags                        */ 02630000
*           5 CPCND_VALID BIT(3),    /* Node validity                */ 02640000
*           5 CPCND_NTYPE BIT(1),    /* Node type                    */ 02650000
*           5 *           BIT(4),    /* Reserved                     */ 02660000
*         3 CPCND_PARMS CHAR(3),     /* Node parameters              */ 02670000
*         3 CPCND_SDC   CHAR(28),    /* Self-describing component       02680000
*                                       (SDC) Identifier             */ 02690000
*           5 CPCND_TYPE  CHAR(6),   /* Type number                  */ 02700000
*           5 CPCND_MODEL CHAR(3),   /* Model number                 */ 02710000
*           5 CPCND_MAN   CHAR(3),   /* Manufacturer                 */ 02720000
*           5 CPCND_PLANT CHAR(2),   /* Plant of Manufacture         */ 02730000
*           5 CPCND_SEQNO CHAR(12),  /* Sequence Number              */ 02740000
*           5 CPCND_TAG   CHAR(2),   /* Tag                          */ 02750000
*                                                                       02760000
*/********************************************************************/ 02770000
*/*                                                                  */ 02780000
*/*  Central Processing Complex Node Identifier Mapping              */ 02790000
*/*                                                                  */ 02800000
*/*  Note - The data indicated by CPCID_MAP is only valid when       */ 02810000
*/*         CPCID_VALID ^= CPCID_INVALID                             */ 02820000
*/*                                                              @L1C*/ 02830000
*/********************************************************************/ 02840000
*       2 SHID_CPCID CHAR(2),        /* Central Processing              02850000
*                                       Complex identifier @L1A*/       02860000
*         3 CPCID_FLAGS BIT(8),      /* Flags                    @L1A*/ 02870000
*           5 CPCID_VALID BIT(1),    /* Identifier validity      @L1A*/ 02880000
*           5 *           BIT(7),    /* Reserved                 @L1A*/ 02890000
*         3 CPCID_MAP   CHAR(1),     /* CPC ID mapping - This is        02900000
*                                       filled in via the Store CPC     02910000
*                                       Identifier CHSC          @L1A*/ 02920000
*           5 *           BIT(2),    /* Reserved                 @L1A*/ 02930000
*           5 CPCID_ID    BIT(6),    /* CPC ID                   @ABC*/ 02940000
*/********************************************************************/ 02950000
*/*                                                                  */ 02960000
*/*  Central Processing Complex World Wide Node Name                 */ 02970000
*/*                                                              @ABA*/ 02980000
*/********************************************************************/ 02990000
*       2 SHID_CPCWWNN Bit(64),      /* CPC WWNN - if all zeros, WWNN   03000000
*                                       could not be retrieved   @ABA*/ 03010000
*/********************************************************************/ 03020000
*/*                                                                  */ 03030000
*/*  Channel Image Id                                                */ 03040000
*/*                                                              @ABA*/ 03041000
*/********************************************************************/ 03042000
*       2 SHID_CHImageId Bit(8);     /* Channel Image Id         @ABA*/ 03043000
*                                                                       03044000
*/********************************************************************/ 03045000
*/*                                                                  */ 03046000
*/*  Constants                                                       */ 03047000
*/*                                                                  */ 03048000
*/********************************************************************/ 03049000
*   DECLARE                                                             03050000
*     CPCND_INVALID  BIT(3) CONSTANT('010'B), /* Invalid node           03060000
*                                       Descriptor               @L1C*/ 03070000
*     CPCID_INVALID  BIT(1) CONSTANT('1'B),  /* Invalid CPC identifier  03080000
*                                                                @L1A*/ 03090000
*     SHID_FORMAT0 BIT(2) CONSTANT('00'B), /* Format 0 PGID old format  03100000
*                                                                @L1A*/ 03110000
*     SHID_FORMAT1 BIT(2) CONSTANT('10'B); /* Format 1 PGID new format  03120000
*                                                                @L1A*/ 03130000
