* %      GOTO SMF22P1;             /* BILINGUAL MAPPING                 00010000
         MACRO                                                          00020000
         IOSDSMFR                                                       00030000
.*                                                                   */ 00040000
*%SMF22P1 : ;                                                           00050000
*/*START OF SPECIFICATIONS ******************************************** 00060000
*                                                                       00070000
* MACRO-NAME: IOSDSMFR                                                  00080000
*                                                                       00090000
* DESCRIPTIVE-NAME: SMF Record Type 22 I/O Configuration Change Element 00100000
*                                                                       00110000
* COMPONENT:  IOS (SC1C3)                                               00120000
*                                                                       00130000
* PROPRIETARY STATEMENT=                                                00140000
*                                                                       00150000
*       LICENSED MATERIALS - PROPERTY OF IBM                            00160000
*       5650-ZOS COPYRIGHT IBM CORP. 1992, 2013                         00170000
*                                                                       00180000
* STATUS: HBB7790                                                       00190000
*                                                                       00200000
* FUNCTION:  IOSDSMFR maps the I/O Configuration Change Element         00210000
*            (subtype 9) contained within SMF record type 22            00220000
*                                                                       00230000
.*                                                                   */ 00240000
*%GOTO SMF22P2;                                                         00250000
         AGO   .SMF22A2                                                 00260000
*%SMF22P2 : ;                                                           00270000
*/*                                                                     00280000
* EYE-CATCHER: NONE                                                     00290000
*                                                                       00300000
*  ACRONYM: SMF22IOS                                                    00310000
*                                                                       00320000
* DSECT NAME:                                                           00330000
*                                                                       00340000
*   SMF22IOC                                                            00350000
*   SMF22ARY                                                            00360000
*   SMF22EDV                                                            00370000
*   SMF22EPC                                                            00380000
*   SMF22ECH                                                            00390000
*                                                                       00400000
* METHOD-OF-ACCESS:                                                     00410000
*                                                                       00420000
*   PLAS: %INCLUDE SYSLIB(IOSDSMFR)                                     00430000
*                                                                       00440000
*   ASSEMBLER: IOSDSMFR                                                 00450000
*                                                                       00460000
*   NOTES:                                                              00470000
*               PL/AS - INCLUDED by IFASMFR2                            00480000
*               BAL   - CALLED from IFASMFR2                            00490000
*                                                                       00500000
*                                                                       00510000
* CREATED-BY: The IOS Configuration Change Manager.                     00520000
*                                                                       00530000
* DELETED-BY: The IOS Configuration Change Manager                      00540000
*                                                                       00550000
* STORAGE-ATTRIBUTES:                                                   00560000
*                                                                       00570000
*   ALLOCATION-METHOD: GETMAIN                                          00580000
*                                                                       00590000
*   SUBPOOL: ANY                                                        00600000
*                                                                       00610000
* POINTED-TO-BY: SMF22IOC BASED(SMF22PTR+LENGTH(SMFRCD22))              00620000
*                                                                       00630000
* SIZE: VARIABLE                                                        00640000
*                                                                       00650000
* SERIALIZATION: None                                                   00660000
*                                                                       00670000
* DEPENDENCIES: None                                                    00680000
*                                                                       00690000
*   NOTE: Be aware that label offset mismatches are possible if         00700000
*         Assembler variables are defined such that the Assembler       00710000
*         adds padding for boundary alignment (ie, DS F).               00720000
*         Either ensure that the associated PL/x label offset is        00730000
*         the same or use a length attribute such as DS FL4 to          00740000
*         inhibit the boundary alignment padding if not desired. @01A   00750000
*                                                                       00760000
* EXTERNAL CLASSIFICATION:  NONE                                        00770000
* END OF EXTERNAL CLASSIFICATION:                                       00780000
*                                                                       00790000
*                                                                       00800000
* CHANGE-ACTIVITY:                                                      00810000
*                                                                       00820000
*   $L0=PRSMM,HBB4430,920211,PDLQ: Transfer I/O Configuration Change    00830000
*                                  element of SMF Record Type 22 to     00840000
*                                  SC1C3                                00850000
*   $L1=PRSMM,HBB4430,920211,PDLQ: Constants defined for new Modify     00860000
*                                  requests to add or delete device     00870000
*                                  or CHPID access.              @L1A   00880000
*                                  Also, SMF22FRC was removed (unused). 00890000
*                                                                @L1D   00900000
*   $L2=SYSLK   HBB5510 930325 PDLS: Dynamic XES support         @L2A   00910000
*   $L3=MCSEX   HBB7707 020215 PDPS: Multiple Channel Subsystems        00920000
*                                    support                     @L3A   00930000
*   $L4=DLPAR   HBB7709 030731 PDON: Dynamic LPAR Support        @L4A   00940000
*   $L5=SCHSET  HBB7720 040315 PDSK: Subchannel Set Support      @L5A   00950000
*   $L6=IOSIBC  HBB7740 071130 PDAS: Support for Coupling Over          00960000
*                                    Infiniband flagged as APAR         00970000
*                                    OA17177                     @L6A   00980000
*   $L7=PCIEDYN HBB7790 110415 PDB7: PCIe Support                @L7A   00981001
*   $L8=IOSPEN  HBB7790 110530 PDJI: Config PFID support         @L8A   00982001
*      =IOSPEN  HBB7790 110530 PDJI: Remove SMF22PCI constant    @L8A   00983002
*                                                                       00984002
*   $01=OA36510 HBB7760 110815 PDWV: Fix Assembler field offsets        00990000
*                                    to match PL/x for sub-type 11      01000000
*                                    field definitions           @01A   01010000
*                                    - Added by rollup:                 01020000
*                                      Put '*' in Column 1 for new      01030000
*                                      PL/x variables added by $L7      01040000
*                                      to avoid assembler errors        01050000
*                                      if doing COPY(IOSDSMFR)          01060000
*                                                                       01090000
*   $A3=OA17177 HBB7709 071130 PDAS: Support for Coupling over          01100000
*                                    Infiniband                  @A3A   01110000
*                                                                       01120000
*   $D1=DIG0108 HBB5510 930520 PDLS: Name changes                @D1A   01130000
*                                                                       01140000
*   $P1=PKB3748 HBB4430 920729 PDLS: DCCD and SMF record changes for    01150000
*                                  activating partition indicator @P1A  01160000
*   $P2=PJK0139 HBB7707 020731 PDON: Remove add and delete CSS access   01170000
*                                    constants                   @P2A   01180000
*   $P3=ME03231 HBB7720 050328 PDNO: Add continuation character for     01190000
*                                    SMF22EDVE                   @P3A   01200000
*   $P4=ME10087 HBB7750 070915 PDSK: Corrected proprietary statement    01210000
*                                                                @P4A   01220000
*                                                                       01230000
*END OF SPECIFICATIONS ***********************************************/ 01240000
* %      GOTO SMF22P3;             /* BILINGUAL MAPPING                 01250000
.SMF22A2 ANOP                                                           01260000
         SPACE 1                                                        01270000
*********************************************************************** 01280000
*                                                                     * 01290000
*    The following structure maps the I/O configuration change        * 01300000
*    element which applies to SMF22IND=9. The I/O configuration       * 01310000
*    change element consists of a header section mapped by SMF22IOC,  * 01320000
*    followed by an array containing a variable number of entries     * 01330000
*    mapped by SMF22ARY. Each entry identifies an I/O device,         * 01340000
*    I/O control unit, message device, message processor,             * 01350000
*    or CHPID that has been added, deleted, or modified.              * 01360000
*    If the space required for all entries exceeds the                * 01370000
*    maximum length of SMF record type 22, subsequent SMF type 22     * 01380000
*    records are written containing the remaining entries. The SMF    * 01390000
*    type 22 record header (SMFRCD22) and the I/O configuration       * 01400000
*    change element header (SMF22IOC) is replicated for each record.  * 01410000
*                                                                     * 01420000
*********************************************************************** 01430000
SMF22IOC ORG   SMF22RSC                                                 01440000
         DS    BL1                 Reserved                             01450000
SMF22OID DS    BL1                 I/O configuration change             01460000
*                                  element ID (x'0B')                   01470000
SMF22R#  DS    BL1                 Record number of this record         01480000
SMF22TR  DS    BL1                 Total number of records for this     01490000
*                                  I/O configuration change. For        01500000
*                                  example, if there are 3 records      01510000
*                                  total, and this record is the first, 01520000
*                                  SMF22R# would contain 1, and SMF22TR 01530000
*                                  would contain 3, indicating record   01540000
*                                  1 of 3.                              01550000
SMF22OFF DS    BL2                 Offset of first entry in this        01560000
*                                  record                               01570000
SMF22ELN DS    BL2                 Length of each entry                 01580000
SMF22T#E DS    FL4                 Total number of entries for this     01590000
*                                  I/O configuration change        @01C 01600000
SMF22#E  DS    FL4                 Number of entries in this            01610000
*                                  record                          @01C 01620000
SMF22FLS DS    B                   Flags                                01630000
SMF22SFT EQU   X'80'               Indicates that requestor of the      01640000
*                                  ACTIVATE specified the SOFT option   01650000
*                                  indicating that only software        01660000
*                                  configuration changes are to         01670000
*                                  be made.                             01680000
*                                                                @L1D   01690000
*        EQU   X'7F'               Reserved                      @L1C   01700000
         DS    B                   Reserved                             01710000
SMF22IOD DS    0CL48               IODF dataset which contains the      01720000
*                                  new I/O configuration                01730000
SMF22IDN DS    CL44                IODF dataset name                    01740000
         DS    CL4                 Reserved                             01750000
SMF22EDT DS    CL2                 ID of new EDT                        01760000
SMF22CFI DS    CL8                 Operating system configuration ID    01770000
*                                  for new configuration                01780000
SMF22HCT DS    CL64                Hardware configuration token that    01790000
*                                  represents the new I/O               01800000
*                                  configuration                        01810000
SMF22#UA DS    FL4                 Number of UCBs added for this        01820000
*                                  I/O configuration change      @01C   01830000
SMF22#UD DS    FL4                 Number of UCBs deleted for this      01840000
*                                  I/O configuration change      @01C   01850000
SMF22FNC DS    FL1                 Activate function requested          01860000
*                                  (activate or recover)                01870000
         DS    CL3                 Reserved                             01880000
*********************************************************************** 01890000
*                                                                     * 01900000
*    The following structure maps the entry array in the I/O          * 01910000
*    configuration change element.                                    * 01920000
*                                                                     * 01930000
*********************************************************************** 01940000
SMF22ARY DSECT                     Entry array                          01950000
SMF22ENT DS    0XL32               Entry                                01960000
SMF22EHD DS    0F                  Entry header                         01970000
SMF22ETY DS    XL1                 Entry type                           01980000
SMF22ERQ DS    XL1                 Entry request                        01990000
SMF22EFL DS    B                   Entry flags                          02000000
SMF22EHW EQU   X'80'               Hardware change                      02010000
SMF22ESW EQU   X'40'               Software change                      02020000
SMF22EST EQU   X'20'               Indicates that this entry was        02030000
*                                  created because a static device is   02040000
*                                  being changed to a dynamic device.   02050000
*                                  This entry represents the delete     02060000
*                                  request (SMF22ERQ=SMF22DD). There    02070000
*                                  will be another entry which          02080000
*                                  represents the add request           02090000
SMF22ECN EQU   X'10'               Indicates whether the UCB for the    02100000
*                                  device is connected to a subchannel. 02110000
*                                  Valid only when SMF22ETY=SMF22DEV    02120000
*                                  and SMF22ERQ=SMF22DA.                02130000
SMF22ETHISCSS  EQU X'08'            Indicates that the SMF entry        02140000
*                                  represents a change that affects     02150000
*                                  current CSS.                  @L3A   02160000
*        EQU   X'04'               Reserved                      @L3C   02170000
SMF22EAP EQU   X'02'               The activating partition will lose   02180000
*                                  access to the device because either  02190000
*                                  the device is deleted from the       02200000
*                                  configuration, or the activating     02210000
*                                  partition is being removed from the  02220000
*                                  candidate list of the device.        02230000
*                                  Valid when:                          02240000
*                                  SMF22ETY=SMF22DEV and                02250000
*                                    SMF22ERQ=SMF22DDD           @P1A   02260000
*                                  The activating partition will lose   02261000
*                                  or gain access to the PCIe function. 02262000
*                                  Valid when SMF22ETY=SMF22PF.  @L7C   02263000
SMF22ECC EQU   X'01'               Indicates that this entry was        02270000
*                                  created because the candidate        02280000
*                                  list of the device was changed.      02290000
*                                  When SMF22ETY=SMF22DEV,              02300000
*                                  SMF22ERQ=SMF22DDD and SMF22ECC       02310000
*                                  is on, partition(s)                  02320000
*                                  were deleted from the device         02330000
*                                  candidate list.                      02340000
*                                  When SMF22ETY=SMF22DEV,              02350000
*                                  SMF22ERQ=SMF22DAD and SMF22ECC       02360000
*                                  is on, partition(s)                  02370000
*                                  were added to the device             02380000
*                                  candidate list.               @P1A   02390000
SMF22ECSS DS    XL1                Channel Subsystem ID          @L3A   02400000
SMF22ESI DS    0XL28               Entry type specific information      02410000
*                                  described below                      02420000
*********************************************************************** 02430000
*                                                                     * 02440000
*    The following structure maps SMF22ESI for device                 * 02450000
*    entries (SMF22ETY = SMF22DEV, SMF22MDEV, or SMF22SDEV)       @L5C* 02460000
*                                                                     * 02470000
*********************************************************************** 02480000
SMF22EDV ORG   SMF22ESI            Device entry                         02490000
SMF22DVN DS    FL2                 Device number                        02500000
SMF22DCM DS    BL1                 Mask of CHPIDs contained in SMF22DCH 02510000
*                                  that were added to or deleted        02520000
*                                  from this device. Valid only when    02530000
*                                  SMF22ERQ = SMF22DAH OR SMF22DDH.     02540000
*                                  Otherwise, zero.                     02550000
SMF22DPM DS    BL1                 Mask of physical control unit        02560000
*                                  numbers in SMF22DPC that were        02570000
*                                  added to or deleted from this        02580000
*                                  device. Valid only when              02590000
*                                  SMF22ERQ = SMF22DAP or SMF22DDP.     02600000
*                                  Otherwise, zero.                     02610000
SMF22DCH DS    8FL1                Array of CHPIDs that were            02620000
*                                  added to or deleted from this        02630000
*                                  device. Valid only when              02640000
*                                  SMF22ERQ = SMF22DAH OR SMF22DDH.     02650000
*                                  Otherwise, zero.                     02660000
SMF22DPC DS    8FL2                Array of physical control unit       02670000
*                                  numbers that were added to or        02680000
*                                  deleted from this device. Valid only 02690000
*                                  when SMF22ERQ = SMF22DAP or          02700000
*                                  SMF22DDP. Otherwise, zero.           02710000
*********************************************************************** 02720000
*                                                                     * 02730000
*    The following structure provides the mapping for device          * 02740000
*    expansion entries.  This entry immediately follows entry         * 02750000
*    SMF22SDEV.                                                       * 02760000
*                                                                 @L5A* 02770000
*********************************************************************** 02780000
SMF22EDVE ORG  SMF22ESI            Device entry, subchannel set         02790000
*                                  id (SSID) greater than zero    @P3C  02800000
SMF22SSID DS   FL1                 Subchannel set id (SSID)       @L5A  02810000
          DS   CL27                Reserved                       @L5A  02820000
*********************************************************************** 02830000
*                                                                     * 02840000
*    The following structure maps SMF22ESI for control unit           * 02850000
*    entries (SMF22ETY = SMF22PCU or SMF22MP).                    @L2A* 02860000
*                                                                     * 02870000
*********************************************************************** 02880000
SMF22EPC ORG   SMF22ESI            Physical control unit entry          02890000
SMF22PCN DS    FL2                 Physical control unit number         02900000
         DS    CL1                 Reserved                             02910000
SMF22PCM DS    BL1                 Mask of channel path IDs in          02920000
*                                  SMF22PCH that were added to or       02930000
*                                  deleted from this control unit.      02940000
*                                  Valid only when SMF22ERQ = SMF22PAH  02950000
*                                  or SMF22PDH. Otherwise, zero.        02960000
SMF22PCH DS    8FL1                Array of CHPIDs that were added to   02970000
*                                  or deleted from this control unit.   02980000
*                                  Valid only when SMF22ERQ = SMF22PAH  02990000
*                                  or SMF22PDH. Otherwise, zero.        03000000
SMF22PUA DS    0F                  Range of unit addresses that were    03010000
*                                  added to or deleted from this        03020000
*                                  control unit. Valid only when        03030000
*                                  SMF22ERQ = SMF22PMA or SMF22PMD.     03040000
*                                  Otherwise, zero.                     03050000
         DS    CL1                 Reserved                             03060000
SMF22PUC DS    XL1                 Count of unit addresses              03070000
         DS    CL1                 Reserved                             03080000
SMF22PSU DS    XL1                 Starting unit address                03090000
*********************************************************************** 03100000
*                                                                     * 03110000
*    The following structure maps SMF22ESI for CHPID                  * 03120000
*    entries (SMF22ETY = SMF22CH).                                    * 03130000
*                                                                     * 03140000
*********************************************************************** 03150000
SMF22ECH ORG   SMF22ESI            CHPID entry                          03160000
SMF22CCH DS    XL1                 Channel path ID                      03170000
         DS    CL3                 Reserved                             03180000
*********************************************************************** 03190000
*                                                                     * 03200000
*    The following structure maps SMF22ESI for logical partition      * 03210000
*    entries (SMF22ETY = SMF22LP).                                    * 03220000
*                                                                 @L4A* 03230000
*********************************************************************** 03240000
SMF22ELP ORG   SMF22ESI            Logical partition entry        @L4A  03250000
SMF22LP_Name  DS CL8               Logical partition name         @L4A  03260000
SMF22LP_MIFID DS XL1               MIF identifier                 @L4A  03270000
*********************************************************************** 03280000
*                                                                     * 03290000
*    The following structure maps SMF22ESI for PCIe Function          * 03300000
*    entries (SMF22ETY = SMF22PF).                                    * 03310000
*                                                                 @L7A* 03320000
*********************************************************************** 03330000
SMF22EPF ORG SMF22ESI              PCIe Function entry            @L7A  03340000
SMF22PF_PFID  DS F                 PCIe-Function ID               @L7A  03350000
*********************************************************************** 03360000
*                                                                     * 03370000
*    The following constants are used to identify the function in     * 03380000
*    SMF22FNC.                                                        * 03390000
*                                                                     * 03400000
*********************************************************************** 03410000
SMF22ACT EQU   X'01'               Activate function                    03420000
SMF22REC EQU   X'05'               Recover function                     03430000
*********************************************************************** 03440000
*                                                                     * 03450000
*    The following constants identify the entry type in SMF22ETY.     * 03460000
*                                                                     * 03470000
*********************************************************************** 03480000
SMF22DEV EQU   X'01'               Device entry                         03490000
SMF22PCU EQU   X'02'               Control unit entry                   03500000
SMF22CH  EQU   X'03'               CHPID entry                          03510000
SMF22MDEV EQU   X'04'              coupling facility device entry  @D1C 03520000
SMF22MP   EQU   X'05'              coupling facility CU entry      @D1C 03530000
SMF22LP   EQU   X'06'              Logical partition entry         @L4A 03540000
SMF22SDEV EQU   X'07'              Device entry for devices in          03550000
*                                  subchannel set ids (SSIDs) other     03560000
*                                  than zero (0)                   @L5A 03570000
SMF22DEVE EQU   X'08'              Expansion entry for devices in       03580000
*                                  subchannel set ids (SSIDs) other     03590000
*                                  than zero (0)                   @L5A 03600000
SMF22PF   EQU   X'09'              PCIe Function entry             @L7A 03610000
*********************************************************************** 03630000
*                                                                     * 03640000
*    The following constants define SMF22ERQ when SMF22ETY is         * 03650000
*    SMF22DEV or SMF22MDEV                                        @L2C* 03660000
*                                                                     * 03670000
*********************************************************************** 03680000
SMF22DDD EQU   X'01'               Delete device                        03690000
SMF22DAD EQU   X'02'               Add device                           03700000
*********************************************************************** 03710000
*                                                                     * 03720000
*    The following constants define SMF22ERQ when SMF22ETY is         * 03730000
*    SMF22DEV.                                                    @L2A* 03740000
*                                                                     * 03750000
*********************************************************************** 03760000
SMF22DDH EQU   X'03'               Modify to remove CHPID(s)            03770000
SMF22DAH EQU   X'04'               Modify to add CHPID(s)               03780000
SMF22DDP EQU   X'05'               Modify to remove CU(s)               03790000
SMF22DAP EQU   X'06'               Modify to add CU(s)                  03800000
SMF22DMC EQU   X'07'               Modify subchannel characteristics    03810000
*                                  (illegal status detection, and/or    03820000
*                                  interface timeout)                   03830000
SMF22DMP EQU   X'08'               Modify preferred path                03840000
*                                                               2@P1D   03850000
*********************************************************************** 03860000
*                                                                     * 03870000
*    The following constants define SMF22ERQ when SMF22ETY is         * 03880000
*    SMF22PCU or SMF22MP.                                         @L2C* 03890000
*                                                                     * 03900000
*********************************************************************** 03910000
SMF22PDP EQU   X'01'               Delete control unit                  03920000
SMF22PAP EQU   X'02'               Add control unit                     03930000
SMF22PDH EQU   X'03'               Modify to delete CHPID(s)            03940000
SMF22PAH EQU   X'04'               Modify to add CHPID(s)               03950000
*********************************************************************** 03960000
*                                                                     * 03970000
*    The following constants define SMF22ERQ when SMF22ETY is         * 03980000
*    SMF22PCU.                                                    @L2A* 03990000
*                                                                     * 04000000
*********************************************************************** 04010000
SMF22PDU EQU   X'05'               Modify to delete unit address        04020000
*                                  range                                04030000
SMF22PAU EQU   X'06'               Modify to add unit address           04040000
*                                  range                                04050000
SMF22PNM EQU   X'07'               Modify to change the number of       04060000
*                                  managed chpids                 @L3A  04070000
SMF22PDM EQU   X'08'               Modify to delete a managed chpid     04080000
*                                                                 @L3A  04090000
SMF22PAS EQU   X'09'               Modify to delete a managed chpid     04100000
*                                  with intent to add a static chpid    04110000
*                                                                 @L3A  04120000
*********************************************************************** 04130000
*                                                                     * 04140000
*    The following constants define SMF22ERQ when SMF22ETY is         * 04150000
*    SMF22CH.                                                         * 04160000
*                                                                     * 04170000
*********************************************************************** 04180000
SMF22CDH EQU   X'01'               Delete CHPID                         04190000
SMF22CAH EQU   X'02'               Add CHPID                            04200000
SMF22CDI EQU   X'03'               Modify to delete logical             04210000
*                                  partition(s) from the                04220000
*                                  CHPID candidate list          @L1A   04230000
SMF22CAI EQU   X'04'               Modify to add logical                04240000
*                                  partitions to the                    04250000
*                                  CHPID candidate list          @L1A   04260000
SMF22CCAC EQU  X'05'               Modify to change the Associated      04270000
*                                  CPC Designation (ACDES) of a         04280000
*                                  CIB CHPID                      @A3A  04290000
*********************************************************************** 04300000
*                                                                     * 04310000
*    The following constants define SMF22ERQ when SMF22ETY is         * 04320000
*    SMF22DEV or SMF22LP                                              * 04330000
*                                                                 @L4A* 04340000
*********************************************************************** 04350000
SMF22LDEL EQU   X'01'              Delete logical partition       @L4A  04360000
SMF22LADD EQU   X'02'              Add logical partition          @L4A  04370000
*********************************************************************** 04380000
*                                                                     * 04390000
*    The following constants define SMF22ERQ when SMF22ETY is         * 04400000
*    SMF22PF.                                                         * 04410000
*                                                                     * 04420000
*********************************************************************** 04430000
SMF22FDEL EQU   X'01'              Delete PCIe Function          @L7A   04440000
SMF22FADD EQU   X'02'              Add PCIe Function             @L7A   04450000
SMF22FDI  EQU   X'03'              Modify to delete access              04460000
*                                  for one or more logical              04470000
*                                  partitions to the                    04480000
*                                  specified PCIe Function       @L7A   04490000
SMF22FAI  EQU   X'04'              Modify to add access                 04500000
*                                  for one or more logical              04510000
*                                  partitions to the                    04520000
*                                  specified PCIe Function       @L7A   04530000
         MEXIT                                                          04540000
         MEND       */                                                  04550000
*                                                                       04560000
*%SMF22P3: ;                                                            04570000
*/********************************************************************/ 04580000
*/*                                                                  */ 04590000
*/*  The following structure maps the I/O configuration change       */ 04600000
*/*  element which applies to SMF22IND=9. The I/O configuration      */ 04610000
*/*  change element consists of a header section mapped by SMF22IOC, */ 04620000
*/*  followed by an array containing a variable number of entries    */ 04630000
*/*  mapped by SMF22ARY. Each entry identifies an I/O device,    @L2C*/ 04640000
*/*  I/O contorl unit, coupling facility device,                 @D1C*/ 04650000
*/*  coupling facility CU or                                     @D1A*/ 04660000
*/*  CHPID that has been added, deleted, or modified.            @L2C*/ 04670000
*/*  If the space required for all entries exceeds the           @L2C*/ 04680000
*/*  maximum length of SMF record type 22, subsequent SMF type 22    */ 04690000
*/*  records are written containing the remaining entries. The SMF   */ 04700000
*/*  type 22 record header (SMFRCD22) and the I/O configuration      */ 04710000
*/*  change element header (SMF22IOC) is replicated for each record. */ 04720000
*/*                                                                  */ 04730000
*/********************************************************************/ 04740000
* DECLARE                                                               04750000
* 1 SMF22IOC BASED BDY(WORD),     /* I/O configuration change           04760000
*                                    element                        */  04770000
*   3 * CHAR(1),                  /* Reserved                       */  04780000
*   3 SMF22OID FIXED(8),          /* Element ID, x'0B' for I/O          04790000
*                                    configuration change           */  04800000
*   3 SMF22R#  FIXED(8),          /* Record number of this record       04810000
*                                                                   */  04820000
*   3 SMF22TR  FIXED(8),          /* Total number of records for this   04830000
*                                    I/O configuration change. For      04840000
*                                    example, if there are 3 records    04850000
*                                    total, and this record is the      04860000
*                                    first, SMF22R# would contain 1,    04870000
*                                    and SMF22TR would contain 3,       04880000
*                                    indicating record 1 of 3.      */  04890000
*   3 SMF22OFF  FIXED(16),        /* Offset of first entry in this      04900000
*                                    record                         */  04910000
*   3 SMF22ELN  FIXED(16),        /* Length of each entry           */  04920000
*   3 SMF22T#E  FIXED(32),        /* Total number of entries for this   04930000
*                                    I/O configuration change       */  04940000
*   3 SMF22#E   FIXED(32),        /* Number of entries in this record   04950000
*                                                                   */  04960000
*   3 SMF22FLS BIT(8),            /* Flags                          */  04970000
*     5 SMF22SFT BIT(1),          /* Indicates that software only       04980000
*                                    configuration changes              04990000
*                                    are to be made             @L1D*/  05000000
*     5 *        BIT(7),          /* Reserved                   @L1C*/  05010000
*   3 * BIT(8),                   /* Reserved                       */  05020000
*   3 SMF22IOD  CHAR(48),         /* IODF dataset which contains the    05030000
*                                    new I/O configuration          */  05040000
*     5 SMF22IDN CHAR(44),        /* IODF dataset name              */  05050000
*     5 * CHAR(4),                /* Reserved                       */  05060000
*   3 SMF22EDT  CHAR(2),          /* ID of new EDT                  */  05070000
*   3 SMF22CFI  CHAR(8),          /* Operating system configuration     05080000
*                                    ID for new configuration       */  05090000
*   3 SMF22HCT  CHAR(64),         /* Hardware configuration token that  05100000
*                                    represents the new I/O             05110000
*                                    configuration                  */  05120000
*   3 SMF22#UA  FIXED(32),        /* Number of UCBs added for this I/O  05130000
*                                    configuration change           */  05140000
*   3 SMF22#UD  FIXED(32),        /* Number of UCBs deleted for this    05150000
*                                    I/O configuration change       */  05160000
*   3 SMF22FNC  FIXED(8),         /* Activate function requested        05170000
*                                    (activate or recover)          */  05180000
*   3 * CHAR(3);                  /* Reserved                       */  05190000
*/********************************************************************/ 05200000
*/*                                                                  */ 05210000
*/*  The following structure maps the entry array in the I/O         */ 05220000
*/*  configuration change element.                                   */ 05230000
*/*                                                                  */ 05240000
*/********************************************************************/ 05250000
* DECLARE                                                               05260000
* 1 SMF22ARY BASED(ADDR(SMFRCD22)+SMF22OFF) BDY(WORD), /* Entry         05270000
*                                    array                          */  05280000
*   3 SMF22ENT(*) BDY(WORD),      /* Entry                          */  05290000
*     5 SMF22EHD,                 /* Entry header                   */  05300000
*       7 SMF22ETY FIXED(8),      /* Entry type                     */  05310000
*       7 SMF22ERQ FIXED(8),      /* Entry request                  */  05320000
*       7 SMF22EFL BIT(8),        /* Entry flags                    */  05330000
*         9 SMF22EHW BIT(1),      /* Hardware change                */  05340000
*         9 SMF22ESW BIT(1),      /* Software change                */  05350000
*         9 SMF22EST BIT(1),      /* Indicates that this entry was      05360000
*                                  created because a static device      05370000
*                                  is being changed to a dynamic        05380000
*                                  device. This entry represents the    05390000
*                                  delete request (SMF22ERQ=SMF22DD).   05400000
*                                  There will be another entry which    05410000
*                                  represents the add request.      */  05420000
*         9 SMF22ECN BIT(1),      /* Indicates whether UCB for device   05430000
*                                  is connected to a subchannel. Valid  05440000
*                                  only when SMF22ETY=SMF22DEV and      05450000
*                                  SMF22ERQ=SMF22DA.                */  05460000
*         9 SMF22ETHISCSS BIT(1), /* Indicates that the SMF entry       05470000
*                                  represents a change that affects     05480000
*                                  current CSS.                 @L3A*/  05490000
*         9 * BIT(1),             /* Reserved                   @L3C*/  05500000
*         9 SMF22EAP BIT(1),      /* The activating partition will lose 05510000
*                                  access to the device because either  05520000
*                                  the device is deleted from the       05530000
*                                  configuration, or the activating     05540000
*                                  partition is being removed from the  05550000
*                                  candidate list of the device.        05560000
*                                  Valid when:                          05570000
*                                  SMF22ETY=SMF22DEV and                05580000
*                                    SMF22ERQ=SMF22DDD                  05590000
*                                  The activating partition will lose   05591000
*                                  or gain access to the PCIe function. 05592000
*                                  Valid when SMF22ETY=SMF22PF. @L7C*/  05593000
*         9 SMF22ECC BIT(1),      /* Indicates that this entry was      05600000
*                                  created because the candidate        05610000
*                                  list of the device was changed.      05620000
*                                  When SMF22ETY=SMF22DEV,              05630000
*                                  SMF22ERQ=SMF22DDD and SMF22ECC       05640000
*                                  is on, partition(s)                  05650000
*                                  were deleted from the device         05660000
*                                  candidate list.                      05670000
*                                  When SMF22ETY=SMF22DEV,              05680000
*                                  SMF22ERQ=SMF22DAD and SMF22ECC       05690000
*                                  is on, partition(s)                  05700000
*                                  were added to the device             05710000
*                                  candidate list.              @P1A*/  05720000
*       7 SMF22ECSS FIXED(8),     /* Channel Subsystem ID       @L3A*/  05730000
*     5 SMF22ESI CHAR(28) BDY(WORD); /* Entry type specific information 05740000
*                                    described below                */  05750000
*/********************************************************************/ 05760000
*/*                                                                  */ 05770000
*/*  The following structure maps SMF22ESI for device                */ 05780000
*/*  entries (SMF22ETY = SMF22DEV, SMF22MDEV, or SMF22SDEV)      @L5C*/ 05790000
*/*                                                                  */ 05800000
*/********************************************************************/ 05810000
* DECLARE                                                               05820000
* 1 SMF22EDV BASED CHAR(LENGTH(SMF22ESI)) BDY(WORD), /* Device          05830000
*                                    entry                          */  05840000
*   3 SMF22DVN FIXED(16),         /* Device number                  */  05850000
*   3 SMF22DCM BIT(8),            /* Mask of CHPIDs contained in        05860000
*                                    SMF22DCH that were added to or     05870000
*                                    deleted from this device. Valid    05880000
*                                    only when SMF22ERQ = SMF22DAH or   05890000
*                                    SMF22DDH. Otherwise, zero.     */  05900000
*   3 SMF22DPM BIT(8),            /* Mask of physical control unit      05910000
*                                    numbers in SMF22DPC that were      05920000
*                                    added to or deleted from this      05930000
*                                    device. Valid only when SMF22ERQ = 05940000
*                                    SMF22DAP or SMF22DDP. Otherwise,   05950000
*                                    zero.                          */  05960000
*   3 SMF22DCH(8) CHAR(1),        /* Array of CHPIDs that were added    05970000
*                                    to or deleted from this device.    05980000
*                                    Valid only when SMF22ERQ =         05990000
*                                    SMF22DAH or SMF22DDH.              06000000
*                                    Otherwise, zero.               */  06010000
*   3 SMF22DPC(8) CHAR(2);        /* Array of physical control unit     06020000
*                                    numbers that were added to or      06030000
*                                    deleted from this device. Valid    06040000
*                                    only when SMF22ERQ = SMF22DAP or   06050000
*                                    SMF22DDP. Otherwise, zero.     */  06060000
*/********************************************************************/ 06070000
*/*                                                                  */ 06080000
*/*  The following structure provides the mapping for device         */ 06090000
*/*  expansion entries.  This entry immediately follows entry        */ 06100000
*/*  SMF22SDEV.                                                      */ 06110000
*/*                                                              @L5A*/ 06120000
*/********************************************************************/ 06130000
* DECLARE                                                               06140000
* 1 SMF22EDVE BASED CHAR(LENGTH(SMF22ESI)) BDY(WORD), /* Subchannel     06150000
*                                    set id device entry         @L5A*/ 06160000
*   3 SMF22SSID FIXED(8),         /* Subchannel set id           @L5A*/ 06170000
*   3 *         CHAR(27);         /* Reserved                    @L5A*/ 06180000
*/********************************************************************/ 06190000
*/*                                                                  */ 06200000
*/*  The following structure maps SMF22ESI for control unit          */ 06210000
*/*  entries (SMF22ETY = SMF22PCU or SMF22MP).                   @L2C*/ 06220000
*/*                                                                  */ 06230000
*/********************************************************************/ 06240000
* DECLARE                                                               06250000
* 1 SMF22EPC BASED CHAR(LENGTH(SMF22ESI)) BDY(WORD), /* Physical        06260000
*                                    control unit entry             */  06270000
*   3 SMF22PCN FIXED(16),         /* Physical control unit number       06280000
*                                                                   */  06290000
*   3 *        CHAR(1),           /* Reserved                       */  06300000
*   3 SMF22PCM BIT(8),            /* Mask of channel path IDs in        06310000
*                                    SMF22PCH that were                 06320000
*                                    added or deleted from this         06330000
*                                    control unit. Valid only when      06340000
*                                    SMF22ERQ = SMF22PAH or SMF22PDH.   06350000
*                                    Otherwise, zero.               */  06360000
*   3 SMF22PCH(8) CHAR(1),        /* Array of CHPIDs that were added to 06370000
*                                    or deleted from this control unit. 06380000
*                                    Valid only when SMF22ERQ =         06390000
*                                    SMF22PAH or SMF22PDH. Otherwise,   06400000
*                                    zero.                          */  06410000
*   3 SMF22PUA CHAR(4),           /* Range of unit addresses that were  06420000
*                                    added to or deleted from the       06430000
*                                    control unit. Valid only when      06440000
*                                    SMF22ERQ = SMF22PMA or SMF22PMD.   06450000
*                                    Otherwise, zero.               */  06460000
*     5 * CHAR(1),                /* Reserved                       */  06470000
*     5 SMF22PUC FIXED(8),        /* Count of unit addresses        */  06480000
*     5 * CHAR(1),                /* Reserved                       */  06490000
*     5 SMF22PSU FIXED(8);        /* Starting unit address          */  06500000
*/********************************************************************/ 06510000
*/*                                                                  */ 06520000
*/*  The following structure maps SMF22ESI for CHPID                 */ 06530000
*/*  entries (SMF22ETY = SMF22CH).                                   */ 06540000
*/*                                                                  */ 06550000
*/********************************************************************/ 06560000
* DECLARE                                                               06570000
* 1 SMF22ECH BASED CHAR(LENGTH(SMF22ESI)) BDY(WORD), /* CHPID           06580000
*                                    entry                          */  06590000
*   3 SMF22CCH FIXED(8),          /* Channel path ID                */  06600000
*   3 *        CHAR(3);           /* Reserved                       */  06610000
*/********************************************************************/ 06620000
*/*                                                                  */ 06630000
*/*  The following structure maps SMF22ESI for logical partition     */ 06640000
*/*  entries (SMF22ETY = SMF22LP).                                   */ 06650000
*/*                                                              @L4A*/ 06660000
*/********************************************************************/ 06670000
* DECLARE                                                               06680000
* 1 SMF22ELP BASED CHAR(LENGTH(SMF22ESI)) BDY(WORD), /* Logical         06690000
*                                    partition entry             @L4A*/ 06700000
*   3 SMF22LP_Name  CHAR(8),      /* Logical partition name      @L4A*/ 06710000
*   3 SMF22LP_MIFID FIXED(8);     /* MIF identifier              @L4A*/ 06720000
*/********************************************************************/ 06730000
*/*                                                                  */ 06740000
*/*  The following structure maps SMF22ESI for PCIe Function         */ 06750000
*/*  entries (SMF22ETY = SMF22PF).                                   */ 06760000
*/*                                                              @L7A*/ 06770000
*/********************************************************************/ 06780000
* DECLARE                                                               06790000
* 1 SMF22EPF BASED CHAR(LENGTH(SMF22ESI)) BDY(WORD), /* PCIe Function   06800000
*                                    entry                       @L7A*/ 06810000
*   3 SMF22PF_PFID  FIXED(32);    /* PCIe-Function ID            @L7A*/ 06820000
*/********************************************************************/ 06830000
*/*                                                                  */ 06840000
*/*  The following constants are used to identify the function in    */ 06850000
*/*  SMF22FNC.                                                       */ 06860000
*/*                                                                  */ 06870000
*/********************************************************************/ 06880000
*DECLARE SMF22ACT FIXED(8) CONSTANT(1);   /* Activate function       */ 06890000
*DECLARE SMF22REC FIXED(8) CONSTANT(5);   /* Recover function        */ 06900000
*/********************************************************************/ 06910000
*/*                                                                  */ 06920000
*/*  The following constants identify the entry type in SMF22ETY.    */ 06930000
*/*                                                                  */ 06940000
*/********************************************************************/ 06950000
*DECLARE SMF22DEV FIXED(8) CONSTANT(1);   /* Device entry            */ 06960000
*DECLARE SMF22PCU FIXED(8) CONSTANT(2);   /* Control unit entry      */ 06970000
*DECLARE SMF22CH  FIXED(8) CONSTANT(3);   /* CHPID entry             */ 06980000
*DECLARE SMF22MDEV FIXED(8) CONSTANT(4);  /* coupling facility          06990000
*                                            device entry        @D1C*/ 07000000
*DECLARE SMF22MP   FIXED(8) CONSTANT(5);  /* coupling facility control  07010000
*                                            unit entry          @D1C*/ 07020000
*DECLARE SMF22LP   FIXED(8) CONSTANT(6);  /* Logical partition entry    07030000
*                                                                @L4A*/ 07040000
*DECLARE SMF22SDEV FIXED(8) CONSTANT(7);  /* Device entry for devices   07050000
*                                            in subchannel set ids      07060000
*                                            (SSIDs) other than         07070000
*                                            zero (0)            @L5A*/ 07080000
*DECLARE SMF22DEVE FIXED(8) CONSTANT(8);  /* Expansion entry for        07090000
*                                            devices in subchannel set  07100000
*                                            ids (SSIDs) other than     07110000
*                                            zero (0)            @L5A*/ 07120000
*DECLARE SMF22PF   FIXED(8) CONSTANT(9);  /* PCIe Function entry @L7A*/ 07130000
*/********************************************************************/ 07160000
*/*                                                                  */ 07170000
*/*  The following constants define SMF22ERQ when SMF22ETY is        */ 07180000
*/*  SMF22DEV or SMF22MDEV.                                      @L2C*/ 07190000
*/*                                                                  */ 07200000
*/********************************************************************/ 07210000
*DECLARE SMF22DDD FIXED(8) CONSTANT(01), /* Delete device            */ 07220000
*        SMF22DAD FIXED(8) CONSTANT(02), /* Add device               */ 07230000
*/********************************************************************/ 07240000
*/*                                                                  */ 07250000
*/*  The following constants define SMF22ERQ when SMF22ETY is        */ 07260000
*/*  SMF22DEV.                                                   @L2A*/ 07270000
*/*                                                                  */ 07280000
*/********************************************************************/ 07290000
*        SMF22DDH FIXED(8) CONSTANT(03), /* Modify to remove CHPID(s)*/ 07300000
*        SMF22DAH FIXED(8) CONSTANT(04), /* Modify to add CHPID(s)   */ 07310000
*        SMF22DDP FIXED(8) CONSTANT(05), /* Modify to remove CU(s)   */ 07320000
*        SMF22DAP FIXED(8) CONSTANT(06), /* Modify to add CU(s)      */ 07330000
*        SMF22DMC FIXED(8) CONSTANT(07), /* Modify subchannel           07340000
*                                           characteristics (illegal    07350000
*                                           status detection, and       07360000
*                                           interface timeout)       */ 07370000
*        SMF22DMP FIXED(8) CONSTANT(08); /* Modify preferred path       07380000
*                                                                @P2C*/ 07390000
*                                        /*                     2@P1D*/ 07400000
*/********************************************************************/ 07410000
*/*                                                                  */ 07420000
*/*  The following constants define SMF22ERQ when SMF22ETY is        */ 07430000
*/*  SMF22PCU or SMF22MP.                                        @L2C*/ 07440000
*/*                                                                  */ 07450000
*/********************************************************************/ 07460000
*DECLARE SMF22PDP FIXED(8) CONSTANT(01), /* Delete control unit      */ 07470000
*        SMF22PAP FIXED(8) CONSTANT(02), /* Add control unit         */ 07480000
*        SMF22PDH FIXED(8) CONSTANT(03), /* Modify to delete CHPID(s)*/ 07490000
*        SMF22PAH FIXED(8) CONSTANT(04), /* Modify to add CHPID(s)   */ 07500000
*/********************************************************************/ 07510000
*/*                                                                  */ 07520000
*/*  The following constants define SMF22ERQ when SMF22ETY is        */ 07530000
*/*  SMF22PCU.                                                   @L2A*/ 07540000
*/*                                                                  */ 07550000
*/********************************************************************/ 07560000
*        SMF22PDU FIXED(8) CONSTANT(05), /* Modify to delete unit       07570000
*                                           address range            */ 07580000
*        SMF22PAU FIXED(8) CONSTANT(06), /* Modify to add unit address  07590000
*                                           range                @L3C*/ 07600000
*        SMF22PNM FIXED(8) CONSTANT(07), /* Modify to change the        07610000
*                                           number of managed chpids    07620000
*                                                                @L3A*/ 07630000
*        SMF22PDM FIXED(8) CONSTANT(08), /* Modify to delete a managed  07640000
*                                           chpid                @L3A*/ 07650000
*        SMF22PAS FIXED(8) CONSTANT(09); /* Modify to delete a managed  07660000
*                                           chpid with intent to add    07670000
*                                           a static chpid       @P2C*/ 07680000
*/********************************************************************/ 07690000
*/*                                                                  */ 07700000
*/*  The following constants define SMF22ERQ when SMF22ETY is        */ 07710000
*/*  SMF22CH.                                                        */ 07720000
*/*                                                                  */ 07730000
*/********************************************************************/ 07740000
*DECLARE SMF22CDH  FIXED(8) CONSTANT(01), /* Delete CHPID            */ 07750000
*        SMF22CAH  FIXED(8) CONSTANT(02), /* Add CHPID           @L1C*/ 07760000
*        SMF22CDI  FIXED(8) CONSTANT(03), /* Modify to delete logical   07770000
*                                            partition(s) from the      07780000
*                                            CHPID candidate list       07790000
*                                                                @L1A*/ 07800000
*        SMF22CAI  FIXED(8) CONSTANT(04), /* Modify to add logical      07810000
*                                            partition(s) to the        07820000
*                                            CHPID candidate list       07830000
*                                                                @A3C*/ 07840000
*        SMF22CCAC FIXED(8) CONSTANT(05); /* Modify to Change the       07850000
*                                            Associated CPC             07860000
*                                            Designation (ACDES) of     07870000
*                                            a CIB CHPID         @A3A*/ 07880000
*/********************************************************************/ 07890000
*/*                                                                  */ 07900000
*/*  The following constants define SMF22ERQ when SMF22ETY is        */ 07910000
*/*  SMF22LP.                                                        */ 07920000
*/*                                                              @L4A*/ 07930000
*/********************************************************************/ 07940000
*DECLARE SMF22LDEL FIXED(8) CONSTANT(1), /* Delete logical partition    07950000
*                                                                @L4A*/ 07960000
*        SMF22LADD FIXED(8) CONSTANT(2); /* Add logical partition       07970000
*                                                                @L4A*/ 07980000
*/********************************************************************/ 07990000
*/*                                                                  */ 08000000
*/*  The following constants define SMF22ERQ when SMF22ETY is        */ 08010000
*/*  SMF22PF.                                                        */ 08020000
*/*                                                              @L7A*/ 08030000
*/********************************************************************/ 08040000
*DECLARE SMF22FDEL FIXED(8) CONSTANT(1), /* Delete PCIe Function @L7A*/ 08050000
*        SMF22FADD FIXED(8) CONSTANT(2), /* Add PCIe Function    @L7A*/ 08060000
*        SMF22FDI  FIXED(8) CONSTANT(3), /* Modify to delete access     08070000
*                                          for one or more logical      08080000
*                                          partitions to the            08090000
*                                          specified PCIe Function      08100000
*                                                                @L7A*/ 08110000
*        SMF22FAI  FIXED(8) CONSTANT(4); /* Modify to add access        08120000
*                                          for one or more logical      08130000
*                                          partitions to the            08140000
*                                          specified PCIe Function      08150000
*                                                                @L7A*/ 08160000
