* %      GOTO DCCPLS1;             /* BILINGUAL MAPPING                 00010000
         MACRO                                                          00020000
         IOSDDCCD                                                       00030000
*                                  */                                   00040000
*%DCCPLS1: ;                       /*                                */ 00050000
*/*START OF SPECIFICATIONS ******************************************** 00060000
*                                                                       00070000
* MACRO-NAME: IOSDDCCD                                                  00080000
*                                                                       00090000
* DESCRIPTIVE-NAME: Dynamic Configuration Change Data                   00100000
*                                                                       00110000
*  ACRONYM: DCCD                                                        00120000
*                                                                       00130000
* COMPONENT:  I/O Supervisor (SC1C3)                                    00140000
*                                                                       00150000
* EYE-CATCHER: DCCD                                                     00160000
*                                                                       00170000
*     OFFSET: 0                                                         00180000
*                                                                       00190000
*     LENGTH: 4                                                         00200000
*                                                                       00210000
* PROPRIETARY STATEMENT =                                               00220000
*  LICENSED MATERIALS - PROPERTY OF IBM                                 00230000
*  5650-ZOS COPYRIGHT IBM CORP. 1990, 2013                              00240000
*                                                                       00250000
* STATUS = HBB7790                                                      00260000
*                                                                       00270000
* FUNCTION:  IOSDDCCD maps the Dynamic Configuration Change Data        00280000
*            which contains the I/O components and                      00290000
*            coupling facility components                               00300000
*            that were changed as a result of a dynamic configuration   00310000
*            change.  The DCCD is passed as input to the CONFCHG        00320000
*            CHGREQ and CONFCHG CHGCOMPL exits.  In addition, fields    00330000
*            from the DCCD are placed in the SMF record type 22         00340000
*            subtype 9, which identifies a dynamic configuration        00350000
*            change.                                               @D1C 00360000
*                                                                       00370000
* METHOD-OF-ACCESS:                                                     00380000
*                                                                       00390000
*   PLAS: %INCLUDE SYSLIB(IOSDDCCD)                                     00400000
*   ASSEMBLER: IOSDDCCD                                                 00410000
*                                                                       00420000
* POINTED-TO-BY: Register 1 points to the address of IOSDDCCD when      00430000
*                the Configuration Change Exit receives control.        00440000
*                                                                       00450000
*01* DSECT Name: DCCD, DCCDARRY, DCCDEDEV, DCCDEPCU, DCCDECHP           00460000
*                                                                       00470000
* CREATED-BY: The IOS Configuration Change Manager.                     00480000
*                                                                       00490000
* DELETED-BY: The IOS Configuration Change Manager.                     00500000
*                                                                       00510000
* STORAGE-ATTRIBUTES:                                                   00520000
*                                                                       00530000
*   ALLOCATION-METHOD: GETMAIN                                          00540000
*                                                                       00550000
*   SUBPOOL: 1                                                          00560000
*                                                                       00570000
*   KEY: 0                                                              00580000
*                                                                       00590000
*                                                                       00600000
* SIZE: VARIABLE                                                        00610000
*                                                                       00620000
* SERIALIZATION: None                                                   00630000
*                                                                       00640000
* DEPENDENCIES: None                                                    00650000
*                                                                       00660000
* NOTES: None                                                           00670000
*                                                                       00680000
* EXTERNAL CLASSIFICATION: GUPI                                         00690000
* END OF EXTERNAL CLASSIFICATION:                                       00700000
*                                                                       00710000
* CHANGE-ACTIVITY:                                                      00720000
*   $L0=DYNAM,HBB4410,891231,PDLG: Dynamic I/O Configuration            00730000
*   $L1=PRSMM,HBB4430,911202,PDLQ: MIF support                          00740000
*   $L2=SYSLK,HBB5510,930325,PDLS: Dynamic XES support. Added two new   00750000
*                                  entries DCCDMDEV and DCCDMP for      00760000
*                                  coupling facility device and         00770000
*                                  coupling facility control unit  @L2A 00780000
*   $L3=DYCHM,HBB7703,991231,PDGG: Add new request code for DCCDEREQU   00790000
*                                                                  @L3A 00800000
*   $L4=DYCHM,HBB7703,991231,PDGG: Add logical control unit number for  00810000
*                                  RMF                             @L4A 00820000
*   $L5=DYCHM,JBB7713,000630,PDDR: Add internal modify control          00830000
*                                  unit function, add missing           00840000
*                                  constants                       @L5A 00850000
*   $L6=MCSEX,HBB7707,020215,PDPS: Multiple Channel Subsystem           00860000
*                                  support                         @L6A 00870000
*   $L7=DLPAR,HBB7709,030731,PDON: Dynamic LPAR Support            @L7A 00880000
*   $L8=SCHSET,HBB7720,040315,PDPY: Subchannel Sets                @L8A 00890000
*   $L9=IOSIBC,HBB7740 071130,PDAS: Support for Coupling Over           00900000
*                                   Infiniband flagged as APAR          00910000
*                                   OA17177                        @L9A 00920000
*   $LA=PCIEDYN HBB7790 110415 PDB7: PCIe Support                  @LAA 00921000
*                                                                       00922000
*   $A3=OA17177 HBB7709 071130 PDAS: Support for Coupling over          00923000
*                                    Infiniband                    @A3A 00924000
*                                                                       00925000
*   $D1=DIG0108,HBB5510,930520,PDLS: Name changes                  @D1A 00926000
*                                                                       00927000
*   $P1=PEO4245,HBB4410,900508,PDLG: Split up 2-byte flag fields with   00928000
*                                  equates into 1-byte fields, so       00929000
*                                  that TM can be used in assembler.    00930000
*                                  Also create constant for length      00940000
*                                  of a CCB entry in assembler          00950000
*                                  version.                             00960000
*   $P2=PKB3748 HBB4430 920729 PDLS: DCCD and SMF record changes for    00970000
*                                  activating partition indicator  @P2A 00980000
*   $P3=PIG2270 HBB5510 930823 PDLU: Prolog updates                @P3A 00990000
*   $P4=PIG3270 HBB5510 931104 PDLU: Prolog updates, CDPI          @P4A 01000000
*   $P5=PXD1206 HBB7703 990131 PDNO: Propcheck errors on copyright      01010000
*                                    statement.                    @P5A 01020000
*   $P6=PYD0140 JBB7713 000615 PDDR: Add LCU to DCCD entry         @P6A 01030000
*   $P7=PYD0338 JBB7713 000815 PDGG: Add count fields to DCCD PCU       01040000
*                                    entry                         @P7A 01050000
*   $P8=PJK0139 HBB7707 020731 PDON: Remove add and delete CSS access   01060000
*                                    constants                     @P8A 01070000
*   $P9=ME10087 HBB7750 070915 PDSK: Corrected proprietary statement    01080000
*                                                                  @P9A 01090000
*   $PA=ME18898 HBB7780 100618 PDNO: Allow macro to assemble            01100000
*                                    "Stand-alone".                     01110000
*                                    (Changes not flagged).        @PAA 01120000
*                                                                       01130000
*   $01=OW45982 HBB7703 000910 PDDR: Correct assembly errors and        01140000
*                                    add new fields/constants.          01150000
*                                    Note: Support added in JBB7713     01160000
*                                    by PTM PYD0338                @01A 01161000
*   $02=OW47846 HBB7703 010815 PDNO: Pass device type information       01162000
*                                    for delete device requests    @02A 01163000
*   $03=OW49943 JBB7713 010831 PDGG: Add bit for secondary queue        01164000
*                                    measurements valid            @03A 01165000
*                                                                       01166000
*END OF SPECIFICATIONS ***********************************************/ 01167000
*%GOTO DCCPLS2;   /*                                                    01168000
         SPACE 1                                                        01169000
DCCD     DSECT                                                          01170000
DCCDHDR  EQU   *                   Header information                   01180000
DCCDID   DS    CL4                 Control block acronym                01190000
DCCDVERN DS    XL1                 DCCD version number                  01200000
DCCDFUNC DS    FL1                 For CONFCHG CHGREQ exit, indicates   01210000
*                                  function to be performed. Otherwise, 01220000
*                                  zero.                                01230000
DCCDFLGS DS    B                   Flags                           @P1C 01240000
DCCDSOFT EQU   X'80'               Software-only configuration          01250000
*                                  change                          @P1C 01260000
*        EQU   X'7F'               Reserved                        @P1C 01270000
         DS    B                   Reserved                        @P1C 01280000
DCCDSIZE DS    F                   Total size of DCCD                   01290000
DCCDSTRT DS    F                   Offset of first DCCD entry           01300000
DCCDENTC DS    F                   Number of entries in the DCCD        01310000
DCCDIODF DS    0CL48               IODF dataset which contains new      01320000
*                                  configuration                        01330000
DCCDIODN DS    CL44                IODF dataset name                    01340000
         DS    CL4                 Reserved                             01350000
DCCDEDT  DS    CL2                 ID of new EDT                        01360000
         DS    CL2                 Reserved                             01370000
DCCDCFID DS    CL8                 Operating system configuration ID    01380000
*                                  for new configuration                01390000
DCCD#UA  DS    F                   Number of UCBs added                 01400000
DCCD#UD  DS    F                   Number of UCBs deleted               01410000
DCCDACTF DS    FL1                 Activate function requested          01420000
*                                  (activate or recover)                01430000
         DS    CL3                 Reserved                             01440000
DCCDHLEN EQU   *-DCCD              Length of DCCD header                01450000
         SPACE 1                                                        01460000
*********************************************************************** 01470000
*                                                                     * 01480000
* The following structure maps the DCCD entry array.                  * 01490000
*                                                                     * 01500000
*********************************************************************** 01510000
DCCDARRY DSECT                     DCCD entry array                     01520000
DCCDE    DS    0XL32               DCCD entry                           01530000
DCCDEHDR DS    0F                  DCCD entry header                    01540000
DCCDETYP DS    XL1                 DCCD entry type                      01550000
DCCDEREQ DS    XL1                 DCCD entry request type              01560000
DCCDEFLG DS    B                   DCCD entry flags                @P1C 01570000
DCCDEHDW EQU   X'80'               Hardware change                 @P1C 01580000
DCCDESFT EQU   X'40'               Software change                 @P1C 01590000
DCCDESTA EQU   X'20'               Indicates that this entry was        01600000
*                                  created because a static device      01610000
*                                  is being changed to a dynamic        01620000
*                                  device. This entry represents the    01630000
*                                  delete request (DCCDEREQ=DCCDDDEL).  01640000
*                                  There will be another entry which    01650000
*                                  represents the add request.     @P1C 01660000
DCCDECON EQU   X'10'               Indicates whether UCB for device is  01670000
*                                  connected to a subchannel. Valid     01680000
*                                  only when DCCDETYP=DCCDDEV or        01690000
*                                  DCCDETYPE=DCCDSDEV, and              01700000
*                                  DCCDEREQ=DCCDADD. Also, valid only   01710000
*                                  for CONFCHG CHGCOMPL exit       @L8C 01720000
DCCDETHISCSS EQU  X'08'            Indicates that the DCCD entry        01730000
*                                  represents a change that affects     01740000
*                                  the current CSS.                @L6A 01750000
*        EQU   X'04'               Reserved                        @L6C 01760000
DCCDEAP  EQU   X'02'               The activating partition will lose   01770000
*                                  access to the device because either  01780000
*                                  the device is deleted from the       01790000
*                                  configuration, or the activating     01800000
*                                  partition is being removed from the  01810000
*                                  candidate list of the device.        01820000
*                                  Valid when:  DCCDETYP=DCCDDEV or     01830000
*                                  DCCDETYP=DCCDSDEV, and               01840000
*                                  DCCDEREQ=DCCDDDEL               @L8C 01850000
*                                  The activating partition will lose   01851001
*                                  or gain access to a PCIe function.   01852001
*                                  Valid when:  DCCDETYP=DCCDPCIF  @LAC 01853001
DCCDECC  EQU   X'01'               Indicates that this entry was        01860000
*                                  created because the candidate        01870000
*                                  list of the device was changed.      01880000
*                                  When DCCDETYP=DCCDDEV or             01890000
*                                  DCCDETYP=DCCDSDEV,                   01900000
*                                  DCCDEREQ=DCCDDDEL and DCCDECC        01910000
*                                  is on, partition(s)                  01920000
*                                  were deleted from the device         01930000
*                                  candidate list.                      01940000
*                                  When DCCDETYP=DCCDDEV or             01950000
*                                  DCCDETYP=DCCDSDEV,                   01960000
*                                  DCCDEREQ=DCCDDADD and DCCDECC        01970000
*                                  is on, partition(s)                  01980000
*                                  were added to the device             01990000
*                                  candidate list.                 @L8C 02000000
DCCDECSS DS    XL1                 Channel Subsystem ID            @L6C 02010000
DCCDENTY DS    XL28                Entry type specific information      02020000
*                                  described below                 @P1C 02030000
DCCDELEN EQU   *-DCCDARRY          Length of DCCD entry            @P1A 02040000
         SPACE 1                                                        02050000
*********************************************************************** 02060000
*                                                                     * 02070000
* The following structure provides the mapping for device entries     * 02080000
* in the DCCD (DCCDETYP = DCCDDEV, DCCDSDEV, or DCCDMDEV).        @L8C* 02090000
*                                                                     * 02100000
*********************************************************************** 02110000
DCCDEDEV ORG   DCCDENTY            DCCD device entry                    02120000
DCCDDEVN DS    FL2                 Device number                        02130000
DCCDDEVA DS   0CL26                Device entry area               @02A 02140000
DCCDDCMK DS    BL1                 Mask of CHPIDs contained in DCCDDCHP 02150000
*                                  that are to be added/deleted from    02160000
*                                  this device. Valid only when         02170000
*                                  DCCDEREQ = DCCDDAC, DCCDDDC, DCCDDDP 02180000
*                                  or DCCDDDP. Otherwise, zero.         02190000
DCCDDPMK DS    BL1                 Mask of physical control unit        02200000
*                                  numbers in DCCDDPCU that are to be   02210000
*                                  added/deleted from this device.      02220000
*                                  Valid only when DCCDEREQ = DCCDDAP   02230000
*                                  or DCCDDP. Otherwise, zero.          02240000
DCCDDCHP DS    8FL1                Array of CHPIDs that are to be       02250000
*                                  added/deleted from this device.      02260000
*                                  Valid only when DCCDEREQ = DCCDDAC,  02270000
*                                  DCCDDDC, DCCDDDP or DCCDDAP.         02280000
*                                  Otherwise, zero.                     02290000
DCCDDPCU DS    8FL2                Array of physical control unit       02300000
*                                  numbers that are to be               02310000
*                                  added/deleted from this device.      02320000
*                                  Valid only when DCCDEREQ = DCCDDAP   02330000
*                                  or DCCDDDP. Otherwise, zero.         02340000
*********************************************************************** 02350000
*                                                                     * 02360000
* The following structure provides the mapping for device             * 02370000
* expansion entries. This entry immediately follows entry DCCDSDEV.   * 02380000
*                                                                 @L8A* 02390000
*********************************************************************** 02400000
DCCDEDEVE ORG DCCDENTY             DCCD Device entry, subchannel set    02410000
*                                  greater than 0                  @L8A 02420000
DCCDSSID DS    FL1                 Subchannel set number           @L8A 02430000
*        DS    CL27                Reserved                        @L8A 02440000
*---------------------------------------------------------------------* 02450000
*  Remap of the device entry area when DCCDEREQ = DCCDDDEL        @02A* 02460000
*---------------------------------------------------------------------* 02470000
         ORG DCCDDEVA              Remap of area to be used when        02480000
*                                  DCCDEREQ = DCCDDDEL            @02A  02490000
DCCDDTYP DS    BL1                 Device type.  This field is copied   02500000
*                                  from UCBTBYT3                  @02A  02510000
DCCDDTYF DS    B                   Device type flags              @02A  02520000
*------------------- Unit Record Flags                            @02A  02530000
DCCDSWTC EQU   X'80'               If 1, indicates that the device      02540000
*                                  being deleted is a switch device.    02550000
*                                  Valid when DCCDDTYP indicates a      02560000
*                                  device type of Unit Record     @02A  02570000
*------------------- DASD Flags                                   @02A  02580000
DCCDPAVB EQU   X'80'               If 1, indicates that the device      02590000
*                                  being deleted is a PAV Base device.  02600000
*                                  Valid when DCCDDTYP indicates a      02610000
*                                  device type of DASD            @02A  02620000
DCCDPAVA EQU   X'40'               If 1, indicates that the device      02630000
*                                  being deleted is a PAV Alias         02640000
*                                  device.  Valid when DCCDDTYP         02650000
*                                  indicates a device type of           02660000
*                                  DASD                           @02A  02670000
         DS    CL24                Reserved for future use        @02A  02680000
         SPACE 1                                                        02690000
*********************************************************************** 02700000
*                                                                     * 02710000
* The following structure provides the mapping for control unit       * 02720000
* entries in the DCCD (DCCDETYP = DCCDPCU or DCCDMP).             @L2C* 02730000
*                                                                     * 02740000
*********************************************************************** 02750000
DCCDEPCU ORG   DCCDENTY            DCCD control unit entry              02760000
DCCDPCUN DS    FL2                 Physical control unit number         02770000
DCCDFLG2 DS    B                   Flag byte                       @P7C 02780000
DCCDVLD  EQU   X'80'               If 1, indicates DCCDLCU is valid     02790000
*                                                                  @03C 02800000
DCCDSQV  EQU   X'40'               If 1, indicates DCCDSBC,             02810000
*                                  DCCDCUBC and DCCDSCNT are valid @03A 02820000
DCCDPCMK DS    BL1                 Mask of channel path IDs that are to 02830000
*                                  be added/deleted from this CU. Valid 02840000
*                                  only when DCCDEREQ = DCCDPAC or      02850000
*                                  DCCDPDC. Otherwise, zero.            02860000
DCCDPCHP DS    8FL1                Array of CHPIDs that are to be       02870000
*                                  added/deleted from this CU. Valid    02880000
*                                  only when DCCDEREQ = DCCDPAC or      02890000
*                                  DCCDPDC. Otherwise, zero.            02900000
DCCDPUA  DS    0F                  Represents the range of unit         02910000
*                                  addresses that are to be added to or 02920000
*                                  deleted from the control unit. Valid 02930000
*                                  only when DCCDEREQ = DCCDPMA or      02940000
*                                  DCCDPMD. Otherwise, zero.            02950000
         DS    CL1                 Reserved                             02960000
DCCDPUAC DS    XL1                 Count of unit addresses              02970000
         DS    CL1                 Reserved                             02980000
DCCDPSUA DS    XL1                 Starting unit address                02990000
*********************************************************************** 03000000
*                                                                     * 03010000
* The following fields are counts required by RMF. They are valid     * 03020000
* only when DCCDACTF = (DCCDDCM or DCCDIMCU), DCCDETYP=DCCDPCU,       * 03030000
* DCCDEREQ=DCCDPDC and DCCDSQV equal 1                                * 03040000
*                                                                 @03C* 03050000
*********************************************************************** 03060000
DCCDSBC  DS    F                   Switch busy count               @P7A 03070000
DCCDCUBC DS    F                   Control unit busy count         @P7A 03080000
DCCDSCNT DS    F                   Success count                   @P7A 03090000
*                                                                       03100000
DCCDFLTN EQU   DCCDPUA+2,2         Number of managed CHPIDs.  Valid     03110000
*                                  only when DCCDACTF=DCCDACTV and      03120000
*                                  DCCDEREQ=DCCDPMNF               @P6A 03130000
*                                                                       03140000
DCCDLCU  EQU   DCCDPUA,2           Logical control unit number.         03150000
*                                  Valid only when DCCDACTF=DCCDDCM     03160000
*                                  or DCCDIMCU.                    @P6A 03170000
         SPACE 1                                                        03180000
*********************************************************************** 03190000
*                                                                     * 03200000
* The following structure provides the mapping for CHPID              * 03210000
* entries in the DCCD (DCCDETYP = DCCDCHP).                           * 03220000
*                                                                     * 03230000
*********************************************************************** 03240000
DCCDECHP ORG   DCCDENTY            DCCD CHPID entry                     03250000
DCCDCCHP DS    XL1                 Channel path ID                      03260000
         DS    CL3                 Reserved                             03270000
         SPACE 1                                                        03280000
*********************************************************************** 03290000
*                                                                     * 03300000
* The following structure provides the mapping for logical partition  * 03310000
* entries in the DCCD (DCCDETYP = DCCDLPAR).                          * 03320000
*                                                                 @L7A* 03330000
*********************************************************************** 03340000
DCCDELP  ORG   DCCDENTY            DCCD logical partition entry    @L7A 03350000
DCCDLP_Name  DS CL8                Logical partition name          @L7A 03360000
DCCDLP_MIFID DS XL1                MIF image identifier            @L7A 03370000
         SPACE 1                                                        03380000
*********************************************************************** 03390000
*                                                                     * 03400000
* The following structure provides the mapping for PCIe Function      * 03410000
* entries in the DCCD (DCCDETYP = DCCDPCIF).                          * 03420000
*                                                                 @LAA* 03430000
*********************************************************************** 03440000
DCCDEPF  ORG   DCCDENTY            DCCD PCIe Function entry        @LAA 03450000
DCCDPF_PFID  DS F                  PCIe-Function ID                @LAA 03460000
         SPACE 1                                                        03461000
*********************************************************************** 03462000
*                                                                     * 03463000
*    The following constant is used to place an identifier in the     * 03464000
*    DCCD (field DCCDID).                                             * 03465000
*                                                                     * 03466000
*********************************************************************** 03467000
DCCDCBID EQU   C'DCCD'             DCCD control block acronym           03468000
         SPACE 1                                                        03469000
*********************************************************************** 03470000
*                                                                     * 03480000
*    The following constant is used to place the version number in    * 03490000
*    the DCCD (field DCCDVERN).                                       * 03500000
*                                                                     * 03510000
*********************************************************************** 03520000
DCCDCBVN EQU   X'01'               DCCD version number                  03530000
         SPACE 1                                                        03540000
*********************************************************************** 03550000
*                                                                     * 03560000
* The following constants are used to identify the function requested * 03570000
* in DCCDFUNC. These functions are valid only on input to the CONFCHG * 03580000
* CHGREQ exit.                                                        * 03590000
*                                                                     * 03600000
*********************************************************************** 03610000
DCCDFPFC EQU   X'01'               Prepare for configuration change     03620000
DCCDFCCR EQU   X'02'               Configuration change rejected        03630000
         SPACE 1                                                        03640000
*********************************************************************** 03650000
*                                                                     * 03660000
* The following constants are used to identify the function           * 03670000
* in DCCDACTF.                                                        * 03680000
*                                                                     * 03690000
*********************************************************************** 03700000
DCCDACTV EQU   X'01'               Activate function                    03710000
DCCDRECV EQU   X'05'               Recover function                     03720000
DCCDDCM  EQU   X'06'               DCM change function            @L3A  03730000
DCCDIMCU EQU   X'07'               Internal IOS request to modify       03740000
*                                    a control unit (e.g. to            03750000
*                                    remove a managed CHPID)      @L5A  03760000
         SPACE 1                                                        03770000
*********************************************************************** 03780000
*                                                                     * 03790000
* The following constants are used to identify the entry type in      * 03800000
* DCCDETYP.                                                           * 03810000
*                                                                     * 03820000
*********************************************************************** 03830000
DCCDDEV  EQU   X'01'               Device entry                         03840000
DCCDPCU  EQU   X'02'               Control unit entry                   03850000
DCCDCHP  EQU   X'03'               CHPID entry                          03860000
DCCDMDEV EQU   X'04'               coupling facility device entry @D1C  03870000
DCCDMP   EQU   X'05'               coupling facility CU entry     @D1C  03880000
DCCDLPAR EQU   X'06'               Logical partition entry        @L7A  03890000
DCCDSDEV EQU   X'07'               Device entry for devices in channel  03900000
*                                  sets other than zero           @L8A  03910000
DCCDDEVE EQU   X'08'               Expansion entry for devices in       03920000
*                                  channel sets other than zero   @L8A  03930000
DCCDPCIF EQU   X'09'               PCIe Function Entry            @LAA  03940000
         SPACE 1                                                        03950000
*********************************************************************** 03960000
*                                                                     * 03970000
* The following constants define DCCDEREQ when DCCDETYP is            * 03980000
* equal to DCCDDEV, DCCDSDEV or DCCDMDEV.                         @L8C* 03990000
*                                                                     * 04000000
*********************************************************************** 04010000
DCCDDDEL EQU   X'01'               Delete device                        04020000
DCCDDADD EQU   X'02'               Add device                           04030000
*********************************************************************** 04040000
*                                                                     * 04050000
* The following constants define DCCDEREQ when DCCDETYP is            * 04060000
* equal to DCCDDEV or DCCDSDEV.                                   @L8C* 04070000
*                                                                     * 04080000
*********************************************************************** 04090000
DCCDDDC  EQU   X'03'               Modify to remove CHPID(s)            04100000
DCCDDAC  EQU   X'04'               Modify to add CHPID(s)               04110000
DCCDDDP  EQU   X'05'               Modify to remove CU(s)               04120000
DCCDDAP  EQU   X'06'               Modify to add CU(s)                  04130000
DCCDDMSC EQU   X'07'               Modify subchannel characteristics    04140000
*                                  (illegal status detection and        04150000
*                                  interface timeout facility)          04160000
DCCDDMPP EQU   X'08'               Modify preferred path                04170000
*                                                                 2@P2D 04180000
         SPACE 1                                                        04190000
*********************************************************************** 04200000
*                                                                     * 04210000
* The following constants define DCCDEREQ when DCCDETYP is            * 04220000
* equal to DCCDPCU or DCCDMP.                                     @L2C* 04230000
*                                                                     * 04240000
*********************************************************************** 04250000
DCCDPDEL EQU   X'01'               Delete control unit                  04260000
DCCDPADD EQU   X'02'               Add control unit                     04270000
DCCDPDC  EQU   X'03'               Modify to delete CHPID(s)            04280000
DCCDPAC  EQU   X'04'               Modify to add CHPID(s)               04290000
         SPACE 1                                                        04300000
*********************************************************************** 04310000
*                                                                     * 04320000
* The following constants define DCCDEREQ when DCCDETYP is            * 04330000
* equal to DCCDPCU.                                               @L2A* 04340000
*                                                                     * 04350000
*********************************************************************** 04360000
DCCDPMDU EQU   X'05'               Modify to delete unit address range  04370000
DCCDPMAU EQU   X'06'               Modify to add unit address range     04380000
DCCDPMNF EQU   X'07'               Modify to change the number          04390000
*                                  of managed CHPIDs              @L5C  04400000
DCCDPMDF EQU   X'08'               Modify to delete a managed           04410000
*                                  CHPID                          @L5A  04420000
DCCDPMAF EQU   X'09'               Modify to delete a managed           04430000
*                                  CHPID with intent to add a           04440000
*                                  static CHPID                   @L5C  04450000
         SPACE 1                                                        04460000
*********************************************************************** 04470000
*                                                                     * 04480000
* The following constants define DCCDEREQ when DCCDETYP is            * 04490000
* equal to DCCDCHP.                                                   * 04500000
*                                                                     * 04510000
*********************************************************************** 04520000
DCCDCDEL EQU   X'01'               Delete CHPID                         04530000
DCCDCADD EQU   X'02'               Add CHPID                            04540000
DCCDCDI  EQU   X'03'               Modify to delete logical             04550000
*                                  partition(s) from the                04560000
*                                  CHPID candidate list            @L1A 04570000
DCCDCAI  EQU   X'04'               Modify to add logical                04580000
*                                  partition(s) to the                  04590000
*                                  CHPID candidate list            @L1A 04600000
DCCDCCAC EQU   X'05'               Modify to change the Associated      04610000
*                                  CPC Designation (ACDES) of a         04620000
*                                  CIB CHPID                       @A3A 04630000
         SPACE 1                                                        04640000
*********************************************************************** 04650000
*                                                                     * 04660000
* The following constants define DCCDEREQ when DCCDETYP is            * 04670000
* equal to DCCDLPAR.                                                  * 04680000
*                                                                 @L7A* 04690000
*********************************************************************** 04700000
DCCDLDEL EQU   X'01'               Delete logical partition        @L7A 04710000
DCCDLADD EQU   X'02'               Add logical partition           @L7A 04720000
         SPACE 1                                                        04730000
*********************************************************************** 04740000
*                                                                     * 04750000
* The following constants define DCCDEREQ when DCCDETYP is            * 04760000
* equal to DCCDPCIF                                                   * 04770000
*                                                                     * 04780000
*********************************************************************** 04790000
DCCDFDEL EQU   X'01'               Delete PCIe Function            @LAA 04791000
DCCDFADD EQU   X'02'               Add PCIe Function               @LAA 04792000
DCCDFDI  EQU   X'03'               Modify to delete access              04793000
*                                  for one or more logical              04794000
*                                  partitions to the                    04795000
*                                  specified PCIe Function         @LAA 04796000
DCCDFAI  EQU   X'04'               Modify to add access                 04797000
*                                  for one or more logical              04798000
*                                  partitions to the                    04799000
*                                  specified PCIe Function         @LAA 04799100
         MEND ,                    */                                   04799200
*%DCCPLS2: ;                                                            04799300
* DECLARE                                                               04799400
* 1 DCCD BASED,                   /* Dynamic Configuration Change       04799500
*                                    Data                            */ 04799600
*   3 DCCDHDR BDY(WORD),          /* Header information              */ 04799700
*     5 DCCDID   CHAR(4),         /* Control block acronym           */ 04799800
*     5 DCCDVERN BIT(8),          /* DCCD version number             */ 04799900
*     5 DCCDFUNC FIXED(8),        /* For CONFCHG CHGREQ exit,           04800000
*                                    indicates function to be           04810000
*                                    performed. Otherwise, zero.     */ 04820000
*     5 DCCDFLGS BIT(8),          /* Flags                       @P1C*/ 04830000
*       7 DCCDSOFT BIT(1),        /* Software-only configuration        04840000
*                                    change                      @P1C*/ 04850000
*       7 *        BIT(7),        /* Reserved                    @P1C*/ 04860000
*     5 * BIT(8),                 /* Reserved                    @P1C*/ 04870000
*     5 DCCDSIZE FIXED(31),       /* Total size of DCCD              */ 04880000
*     5 DCCDSTRT  FIXED(31),      /* Offset of first DCCD entry      */ 04890000
*     5 DCCDENTC  FIXED(31),      /* Number of entries in the DCCD   */ 04900000
*     5 DCCDIODF  CHAR(48),       /* IODF dataset which contains new    04910000
*                                    configuration                   */ 04920000
*       7 DCCDIODN CHAR(44),      /* IODF dataset name               */ 04930000
*       7 * CHAR(4),              /* Reserved                        */ 04940000
*     5 DCCDEDT   CHAR(2),        /* ID of new EDT                   */ 04950000
*     5 *         CHAR(2),        /* Reserved                        */ 04960000
*                                                                       04970000
*     5 DCCDCFID  CHAR(8),        /* Operating system configuration     04980000
*                                    ID for new configuration        */ 04990000
*     5 DCCD#UA   FIXED(31),      /* Number of UCBs added            */ 05000000
*     5 DCCD#UD   FIXED(31),      /* Number of UCBs deleted          */ 05010000
*     5 DCCDACTF  FIXED(8),       /* Activate function requested        05020000
*                                    (activate or recover)           */ 05030000
*     5 * CHAR(3);                /* Reserved                        */ 05040000
*/********************************************************************/ 05050000
*/*                                                                  */ 05060000
*/*  The following structure maps the DCCD entry array.              */ 05070000
*/*                                                                  */ 05080000
*/********************************************************************/ 05090000
* DECLARE                                                               05100000
* 1 DCCDARRY BASED(ADDR(DCCD)+DCCDSTRT) BDY(WORD), /* DCCD entry        05110000
*                                    array                           */ 05120000
*   3 DCCDE(*) BDY(WORD),         /* DCCD entries                    */ 05130000
*     5 DCCDEHDR,                 /* DCCD entry header               */ 05140000
*       7 DCCDETYP FIXED(8),      /* DCCD entry type                 */ 05150000
*       7 DCCDEREQ FIXED(8),      /* DCCD entry request type         */ 05160000
*       7 DCCDEFLG BIT(8),        /* DCCD entry flags            @P1C*/ 05170000
*         9 DCCDEHDW BIT(1),      /* Hardware change                 */ 05180000
*         9 DCCDESFT BIT(1),      /* Software change                 */ 05190000
*         9 DCCDESTA BIT(1),      /* Indicates that this entry was      05200000
*                                  created because a static device      05210000
*                                  is being changed to a dynamic        05220000
*                                  device. This entry represents the    05230000
*                                  delete request (DCCDEREQ=DCCDDDEL).  05240000
*                                  There will be another entry which    05250000
*                                  represents the add request.       */ 05260000
*         9 DCCDECON BIT(1),      /* Indicates whether UCB for device   05270000
*                                  is connected to a subchannel. Valid  05280000
*                                  only when DCCDETYP=DCCDDEV or        05290000
*                                  DCCDETYP=DCCDSDEV, and               05300000
*                                  DCCDEREQ=DCCDADD. Also, valid only   05310000
*                                  for CONFCHG CHGCOMPL exit     @L8C*/ 05320000
*         9 DCCDETHISCSS BIT(1),  /* Indicates that the DCCD entry      05330000
*                                  represents a change that affects     05340000
*                                  the current CSS.              @L6A*/ 05350000
*         9 * BIT(1),             /* Reserved                    @L6C*/ 05360000
*                                                                       05370000
*         9 DCCDEAP BIT(1),       /* The activating partition will lose 05380000
*                                  access to the device because either  05390000
*                                  the device is deleted from the       05400000
*                                  configuration, or the activating     05410000
*                                  partition is being removed from the  05420000
*                                  candidate list of the device.        05430000
*                                  Valid when:  DCCDETYP=DCCDDEV or     05440000
*                                  DCCDETYP=DCCDSDEV, and               05450000
*                                  DCCDEREQ=DCCDDDEL                    05460001
*                                  The activating partition will lose   05461001
*                                  or gain access to a PCIe function.   05462001
*                                  Valid when:  DCCDETYP=DCCDPCIF       05463001
*                                                                @LAC*/ 05464001
*         9 DCCDECC BIT(1),       /* Indicates that this entry was      05470000
*                                  created because the candidate        05480000
*                                  list of the device was changed.      05490000
*                                  When DCCDETYP=DCCDDEV or             05500000
*                                  DCCDETYP=DCCDSDEV,                   05510000
*                                  DCCDEREQ=DCCDDDEL and DCCDECC        05520000
*                                  is on, partition(s)                  05530000
*                                  were deleted from the device         05540000
*                                  candidate list.                      05550000
*                                  When DCCDETYP=DCCDDEV or             05560000
*                                  DCCDETYP=DCCDSDEV,                   05570000
*                                  DCCDEREQ=DCCDDADD and DCCDECC        05580000
*                                  is on, partition(s)                  05590000
*                                  were added to the device             05600000
*                                  candidate list.               @L8C*/ 05610000
*       7 DCCDECSS FIXED(8),      /* Channel Subsystem ID        @L6C*/ 05620000
*     5 DCCDENTY CHAR(28) BDY(WORD); /* Entry type specific information 05630000
*                                    described below                 */ 05640000
*/********************************************************************/ 05650000
*/*                                                                  */ 05660000
*/*  The following structure provides the mapping for device         */ 05670000
*/*  entries in the DCCD (DCCDETYP = DCCDDEV, DCCDSDEV or DCCDMDEV)  */ 05680000
*/*                                                              @L8C*/ 05690000
*/********************************************************************/ 05700000
*DCL 1 DCCDEDEV BASED CHAR(LENGTH(DCCDENTY)) BDY(WORD),                 05710000
*                                      /* DCCD device                   05720000
*                                         entry                      */ 05730000
*       3 DCCDDEVN FIXED(16),          /* Device number              */ 05740000
*       3 DCCDDEVA CHAR(26),           /* Device entry area      @02A*/ 05750000
*         5 DCCDDCMK BIT(8),           /* Mask of CHPIDs contained      05760000
*                                         in DCCDDCHP that are to be    05770000
*                                         added/deleted from this       05780000
*                                         device. Valid only when       05790000
*                                         DCCDEREQ = DCCDDAC, DCCDDDC,  05800000
*                                         DCCDDAP or DCCDDAP.           05810000
*                                         Otherwise, zero.       @02C*/ 05820000
*         5 DCCDDPMK BIT(8),           /* Mask of physical control unit 05830000
*                                         numbers in DCCDDPCU that are  05840000
*                                         to be added/deleted from this 05850000
*                                         device. Valid only when       05860000
*                                         DCCDEREQ = DCCDDAP or         05870000
*                                         DCCDDDP. Otherwise, zero.     05880000
*                                                                @02C*/ 05890000
*         5 DCCDDCHP(8) CHAR(1),       /* Array of CHPIDs that are      05900000
*                                         to be added/deleted from      05910000
*                                         this device. Valid only when  05920000
*                                         DCCDEREQ = DCCDDAC, DCCDDDC,  05930000
*                                         DCCDDAP or DCCDDDP.           05940000
*                                         Otherwise, zero.       @02C*/ 05950000
*         5 DCCDDPCU(8) CHAR(2);       /* Array of physical control     05960000
*                                         unit numbers that are         05970000
*                                         to be added/deleted from      05980000
*                                         this device. Valid only when  05990000
*                                         DCCDEREQ = DCCDDAP or         06000000
*                                         DCCDDDP. Otherwise, zero.     06010000
*                                                                @02C*/ 06020000
*                                                                       06030000
*/*------------------------------------------------------------------*/ 06040000
*/*  Remap of the device entry area when DCCDEREQ = DCCDDDEL     @02A*/ 06050000
*/*------------------------------------------------------------------*/ 06060000
*DCL 1 * CHAR(LENGTH(DCCDDEVA)) DEF(DCCDDEVA), /* Device entry area     06070000
*                                         when DCCDEREQ=DCCDDDEL @02A*/ 06080000
*         5 DCCDDTYP BIT(8),           /* Device type.  This field      06090000
*                                         is copied from UCBTBYT3       06100000
*                                                                @02A*/ 06110000
*         5 DCCDDTYF BIT(8),           /* Device type flags.            06120000
*                                         (Mapped Below)         @02A*/ 06130000
*         5 * CHAR(24);                /* Reserved for future use       06140000
*                                                                @02A*/ 06150000
*DCL 1 * CHAR(LENGTH(DCCDDTYF)) DEF(DCCDDTYF), /* Unit Record           06160000
*                                         flags                  @02A*/ 06170000
*           7 DCCDSWTC BIT(1);         /* If 1, indicates that the      06180000
*                                         device being deleted is a     06190000
*                                         switch device.  Valid when    06200000
*                                         DCCDDTYP indicates a          06210000
*                                         device type of Unit           06220000
*                                         Record                 @02A*/ 06230000
*DCL 1 * CHAR(LENGTH(DCCDDTYF)) DEF(DCCDDTYF), /* DASD flags     @02A*/ 06240000
*           7 DCCDPAVB BIT(1),         /* If 1, indicates that the      06250000
*                                         device being deleted is a     06260000
*                                         PAV Base device.  Valid       06270000
*                                         when DCCDDTYP indicates a     06280000
*                                         device type of DASD    @02A*/ 06290000
*           7 DCCDPAVA BIT(1);         /* If 1, indicates that the      06300000
*                                         device being deleted is a     06310000
*                                         PAV Alias device.  Valid      06320000
*                                         when DCCDDTYP indicates a     06330000
*                                         device type of DASD    @02A*/ 06340000
*/********************************************************************/ 06350000
*/*                                                                  */ 06360000
*/*  The following structure provides the mapping for device         */ 06370000
*/*  expansion entries. This entry immediately follows entry         */ 06380000
*/*  DCCDSDEV                                                    @L8A*/ 06390000
*/*                                                                  */ 06400000
*/********************************************************************/ 06410000
*DCL 1 DCCDEDEVE BASED CHAR(LENGTH(DCCDENTY)) BDY(WORD),                06420000
*                                      /* DCCD device entry, subchannel 06430000
*                                         set greater than 0     @L8A*/ 06440000
*       3 DCCDSSID FIXED(8),           /* Subchannel set number  @L8A*/ 06450000
*       3 *        CHAR(27);           /* Reserved               @L8A*/ 06460000
*/********************************************************************/ 06470000
*/*                                                                  */ 06480000
*/*  The following structure provides the mapping for control unit   */ 06490000
*/*  entries in the DCCD (DCCDETYP = DCCDPCU or DCCDMP)          @L2C*/ 06500000
*/*                                                                  */ 06510000
*/********************************************************************/ 06520000
*DCL 1 DCCDEPCU BASED CHAR(LENGTH(DCCDENTY)) BDY(WORD),                 06530000
*                                      /* DCCD control unit entry    */ 06540000
*       3 DCCDPCUN FIXED(16),          /* Physical control unit         06550000
*                                         number                     */ 06560000
*       3 DCCDFLG2 BIT(8),             /* Flag byte              @P7C*/ 06570000
*         5 DCCDVLD BIT(1),            /* If equal 1, indicates that    06580000
*                                         the DCCDLCU is valid   @03C*/ 06590000
*         5 DCCDSQV BIT(1),            /* If equal 1, indicates that    06600000
*                                         the DCCDSBC,DCCDCUBC          06610000
*                                         and DCCDSCNT are valid @03A*/ 06620000
*         5 *       BIT(6),            /* Reserved               @03C*/ 06630000
*       3 DCCDPCMK BIT(8),             /* Mask of channel path IDs      06640000
*                                         that are to be added/deleted  06650000
*                                         from this CU. Valid only when 06660000
*                                         DCCDEREQ = DCCDPAC or         06670000
*                                         DCCDPDC. Otherwise, zero.  */ 06680000
*       3 DCCDPCHP(8) CHAR(1),         /* Array of CHPIDs that are      06690000
*                                         to be added/deleted from      06700000
*                                         this CU. Valid only when      06710000
*                                         DCCDEREQ = DCCDPAC or         06720000
*                                         DCCDPDC. Otherwise, zero.  */ 06730000
*       3 DCCDPUA CHAR(4) BDY(WORD),   /* Represents the range of unit  06740000
*                                         addresses that are to be      06750000
*                                         added to or deleted from the  06760000
*                                         control unit. Valid only when 06770000
*                                         DCCDEREQ = DCCDPMA or         06780000
*                                         DCCDPMD. Otherwise, zero.     06790000
*                                                                @L3C*/ 06800000
*         5 * CHAR(1),                 /* Reserved                   */ 06810000
*         5 DCCDPUAC FIXED(8),         /* Count of unit addresses    */ 06820000
*         5 * CHAR(1),                 /* Reserved                   */ 06830000
*         5 DCCDPSUA FIXED(8),         /* Starting unit address  @P7C*/ 06840000
*                                                                       06850000
*       3 DCCDSBC FIXED(31),           /* Switch busy count      @P7A*/ 06860000
*       3 DCCDCUBC FIXED(31),          /* Control unit busy count       06870000
*                                                                @P7A*/ 06880000
*       3 DCCDSCNT FIXED(31);          /* Success count          @P7A*/ 06890000
*DCL DCCDFLTN FIXED(16) DEFINED(DCCDPUA) POS(3);                        06900000
*                                      /* Number of managed CHPIDs.     06910000
*                                         Valid only when               06920000
*                                         DCCDACTF=DCCDACTV and         06930000
*                                         DCCDEREQ=DCCDPMNF      @P6A*/ 06940000
*DCL DCCDLCU  FIXED(16) DEFINED(DCCDPUA);                               06950000
*                                      /* Logical control unit          06960000
*                                         number.  Valid only when      06970000
*                                         DCCDACTF=DCCDDCM or           06980000
*                                         DCCDIMCU.              @P6A*/ 06990000
*                                                                       07000000
*/********************************************************************/ 07010000
*/*                                                                  */ 07020000
*/*  The following structure provides the mapping for CHPID          */ 07030000
*/*  entries in the DCCD (DCCDETYP = DCCDCHP).                       */ 07040000
*/*                                                                  */ 07050000
*/********************************************************************/ 07060000
*DCL 1 DCCDECHP BASED CHAR(LENGTH(DCCDENTY)) BDY(WORD),                 07070000
*                                      /* DCCD CHPID                    07080000
*                                         entry                      */ 07090000
*       3 DCCDCCHP FIXED(8),           /* Channel path ID            */ 07100000
*       3 *        CHAR(3);            /* Reserved                   */ 07110000
*                                                                       07120000
*/********************************************************************/ 07130000
*/*                                                                  */ 07140000
*/*  The following structure provides the mapping for logical        */ 07150000
*/*  partition entries in the DCCD (DCCDETYP = DCCDLPAR).            */ 07160000
*/*                                                              @L7A*/ 07170000
*/********************************************************************/ 07180000
*DCL 1 DCCDELP BASED CHAR(LENGTH(DCCDENTY)) BDY(WORD),                  07190000
*                                      /* DCCD logical partition        07200000
*                                         entry                  @L7A*/ 07210000
*       3 DCCDLP_Name  CHAR(8),        /* Logical partition name @L7A*/ 07220000
*       3 DCCDLP_MIFID FIXED(8);       /* MIF image identifier   @L7A*/ 07230000
*/********************************************************************/ 07240000
*/*                                                                  */ 07250000
*/*  The following structure provides the mapping for PCIe Function  */ 07260000
*/*  entries in the DCCD (DCCDETYP = DCCDPCIF).                      */ 07270000
*/*                                                              @LAA*/ 07280000
*/********************************************************************/ 07290000
*DCL 1 DCCDEPF BASED CHAR(LENGTH(DCCDENTY)) BDY(WORD), /* PCIe Function 07300000
*                                         entry                  @LAA*/ 07310000
*       3 DCCDPF_PFID   FIXED(32);      /* PCIe-Function ID      @LAA*/ 07311000
*/********************************************************************/ 07312000
*/*                                                                  */ 07313000
*/*  The following constant is used to place an identifier in the    */ 07314000
*/*  DCCD (field DCCDID).                                            */ 07315000
*/*                                                                  */ 07316000
*/********************************************************************/ 07317000
*DECLARE DCCDCBID CHAR(4) CONSTANT('DCCD'); /* DCCD identifier       */ 07318000
*/********************************************************************/ 07319000
*/*                                                                  */ 07320000
*/*  The following constant is used to place the version number in   */ 07330000
*/*  the DCCD (field DCCDVERN).                                      */ 07340000
*/*                                                                  */ 07350000
*/********************************************************************/ 07360000
*DECLARE DCCDCBVN FIXED(8) CONSTANT(1); /* DCCD version number       */ 07370000
*/********************************************************************/ 07380000
*/*                                                                  */ 07390000
*/*  The following constants are used to identify the function       */ 07400000
*/*  requested in DCCDFUNC. These functions are valid only on input  */ 07410000
*/*  to the CONFCHG CHGREQ exit.                                     */ 07420000
*/*                                                                  */ 07430000
*/********************************************************************/ 07440000
*DECLARE DCCDFPFC FIXED(8) CONSTANT(1);   /* Prepare for configuration  07450000
*                                            change                  */ 07460000
*DECLARE DCCDFCCR FIXED(8) CONSTANT(2);   /* Configuration change       07470000
*                                            rejected                */ 07480000
*/********************************************************************/ 07490000
*/*                                                                  */ 07500000
*/*  The following constants are used to identify the function       */ 07510000
*/*  in DCCDACTF.                                                    */ 07520000
*/*                                                                  */ 07530000
*/********************************************************************/ 07540000
*DECLARE DCCDACTV FIXED(8) CONSTANT(1);   /* Activate function       */ 07550000
*DECLARE DCCDRECV FIXED(8) CONSTANT(5);   /* Recover function        */ 07560000
*DECLARE DCCDDCM  FIXED(8) CONSTANT(6);   /* DCM change function @L3A*/ 07570000
*DECLARE DCCDIMCU FIXED(8) CONSTANT(7);   /* Internal IOS request       07580000
*                                            to modify a control        07590000
*                                            unit (e.g. to delete       07600000
*                                            a managed CHPID)    @L5A*/ 07610000
*                                                                       07620000
*/********************************************************************/ 07630000
*/*                                                                  */ 07640000
*/*  The following constant places the entry type in DCCDETYP.       */ 07650000
*/*                                                                  */ 07660000
*/********************************************************************/ 07670000
*DECLARE DCCDDEV  FIXED(8) CONSTANT(1);   /* Device entry            */ 07680000
*DECLARE DCCDPCU  FIXED(8) CONSTANT(2);   /* Control unit entry      */ 07690000
*DECLARE DCCDCHP  FIXED(8) CONSTANT(3);   /* CHPID entry             */ 07700000
*DECLARE DCCDMDEV FIXED(8) CONSTANT(4);   /* coupling facility          07710000
*                                            device entry        @D1C*/ 07720000
*DECLARE DCCDMP   FIXED(8) CONSTANT(5);   /* coupling facility          07730000
*                                            control unit entry  @D1C*/ 07740000
*DECLARE DCCDLPAR FIXED(8) CONSTANT(6);   /* Logical partition entry    07750000
*                                                                @L7A*/ 07760000
*DECLARE DCCDSDEV FIXED(8) CONSTANT(7);   /* Device entry for devices   07770000
*                                            in channel sets other than 07780000
*                                            zero                @L8A*/ 07790000
*DECLARE DCCDDEVE FIXED(8) CONSTANT(8);   /* Expansion entry for        07800000
*                                            devices in channel sets    07810000
*                                            other than zero     @L8A*/ 07820000
*DECLARE DCCDPCIF FIXED(8) CONSTANT(9);   /* PCIe Function entry @LAA*/ 07830000
*/********************************************************************/ 07840000
*/*                                                                  */ 07850000
*/*  The following constants define DCCDEREQ when DCCDETYP is        */ 07860000
*/*  equal to DCCDDEV,DCCDSDEV or DCCDMDEV                       @L8C*/ 07870000
*/*                                                                  */ 07880000
*/********************************************************************/ 07890000
*DECLARE DCCDDDEL FIXED(8) CONSTANT(01), /* Delete device            */ 07900000
*        DCCDDADD FIXED(8) CONSTANT(02), /* Add device               */ 07910000
*/********************************************************************/ 07920000
*/*                                                                  */ 07930000
*/*  The following constants define DCCDEREQ when DCCDETYP is        */ 07940000
*/*  equal to DCCDDEV or DCCDSDEV                                @L8C*/ 07950000
*/*                                                                  */ 07960000
*/********************************************************************/ 07970000
*        DCCDDDC FIXED(8) CONSTANT(03),  /* Modify to remove CHPID(s)*/ 07980000
*        DCCDDAC FIXED(8) CONSTANT(04),  /* Modify to add CHPID(s)   */ 07990000
*        DCCDDDP FIXED(8) CONSTANT(05),  /* Modify to remove CU(s)   */ 08000000
*        DCCDDAP FIXED(8) CONSTANT(06),  /* Modify to add CU(s)      */ 08010000
*        DCCDDMSC FIXED(8) CONSTANT(07), /* Modify subchannel           08020000
*                                           characteristics (illegal    08030000
*                                           status detection, and       08040000
*                                           interface timeout)       */ 08050000
*        DCCDDMPP FIXED(8) CONSTANT(08); /* Modify preferred path       08060000
*                                                                @P8C*/ 08070000
*                                        /*                     2@P2D*/ 08080000
*/********************************************************************/ 08090000
*/*                                                                  */ 08100000
*/*  The following constants define DCCDEREQ when DCCDETYP is        */ 08110000
*/*  equal to DCCDPCU or DCCDMP                                  @L2C*/ 08120000
*/*                                                                  */ 08130000
*/********************************************************************/ 08140000
*DECLARE DCCDPDEL FIXED(8) CONSTANT(01), /* Delete control unit      */ 08150000
*        DCCDPADD FIXED(8) CONSTANT(02), /* Add control unit         */ 08160000
*        DCCDPDC FIXED(8) CONSTANT(03),  /* Modify to delete CHPID(s)*/ 08170000
*        DCCDPAC FIXED(8) CONSTANT(04),  /* Modify to add CHPID(s)   */ 08180000
*                                                                       08190000
*/********************************************************************/ 08200000
*/*                                                                  */ 08210000
*/*  The following constants define DCCDEREQ when DCCDETYP is        */ 08220000
*/*  equal to DCCDPCU.                                           @L2A*/ 08230000
*/*                                                                  */ 08240000
*/********************************************************************/ 08250000
*        DCCDPMDU FIXED(8) CONSTANT(05), /* Modify to delete unit       08260000
*                                           address range            */ 08270000
*        DCCDPMAU FIXED(8) CONSTANT(06), /* Modify to add unit address  08280000
*                                           range                @L5C*/ 08290000
*        DCCDPMNF FIXED(8) CONSTANT(07), /* Modify to change the        08300000
*                                           number of managed           08310000
*                                           CHPIDs               @L5A*/ 08320000
*        DCCDPMDF FIXED(8) CONSTANT(08), /* Modify to delete a          08330000
*                                           managed CHPID        @L5A*/ 08340000
*        DCCDPMAF FIXED(8) CONSTANT(09); /* Modify to delete a          08350000
*                                           managed CHPID with the      08360000
*                                           intent to add a static      08370000
*                                           CHPID                @P8C*/ 08380000
*                                                                       08390000
*/********************************************************************/ 08400000
*/*                                                                  */ 08410000
*/*  The following constants define DCCDEREQ when DCCDETYP is        */ 08420000
*/*  equal to DCCDCHP.                                               */ 08430000
*/*                                                                  */ 08440000
*/********************************************************************/ 08450000
*DECLARE DCCDCDEL  FIXED(8) CONSTANT(01), /* Delete CHPID            */ 08460000
*        DCCDCADD  FIXED(8) CONSTANT(02), /* Add CHPID           @L1C*/ 08470000
*        DCCDCDI   FIXED(8) CONSTANT(03), /* Modify to delete logical   08480000
*                                            partition(s) from the      08490000
*                                            CHPID candidate list       08500000
*                                                                @L1A*/ 08510000
*        DCCDCAI   FIXED(8) CONSTANT(04), /* Modify to add logical      08520000
*                                            partition(s) to the        08530000
*                                            CHPID candidate list       08540000
*                                                                @A3C*/ 08550000
*        DCCDCCAC  FIXED(8) CONSTANT(05); /* Modify to change the       08560000
*                                            Associated CPC             08570000
*                                            Designation (ACDES)        08580000
*                                            of a CIB CHPID      @A3A*/ 08590000
*/********************************************************************/ 08600000
*/*                                                                  */ 08610000
*/*  The following constants define DCCDEREQ when DCCDETYP is        */ 08620000
*/*  equal to DCCDLPAR                                               */ 08630000
*/*                                                              @L7A*/ 08640000
*/********************************************************************/ 08650000
*DECLARE DCCDLDEL FIXED(8) CONSTANT(01), /* Delete logical partition    08660000
*                                                                @L7A*/ 08670000
*        DCCDLADD FIXED(8) CONSTANT(02); /* Add logical partition       08680000
*                                                                @L7A*/ 08690000
*/********************************************************************/ 08700000
*/*                                                                  */ 08710000
*/*  The following constants define DCCDEREQ when DCCDETYP is        */ 08720000
*/*  equal to DCCDPCIF                                               */ 08730000
*/*                                                                  */ 08740000
*/********************************************************************/ 08750000
*DECLARE DCCDFDEL  FIXED(8) CONSTANT(1), /* Delete PCIe Function @LAA*/ 08760002
*        DCCDFADD  FIXED(8) CONSTANT(2), /* Add PCIe Function    @LAA*/ 08770002
*        DCCDFDI   FIXED(8) CONSTANT(3), /* Modify to delete access     08780002
*                                           for one or more logical     08790002
*                                           partitions to the           08800002
*                                           specified PCIe Function     08810002
*                                                                @LAA*/ 08820002
*        DCCDFAI   FIXED(8) CONSTANT(4); /* Modify to add access        08830002
*                                           for one or more logical     08840002
*                                           partitions to the           08850002
*                                           specified PCIe Function     08860002
*                                                                @LAA*/ 08870002
