*                                                                       00001000
* %DCL IOSDDEVI_INCLUDED CHAR EXT;                                      00002000
* %DEACTIVATE IOSDDEVI_INCLUDED;                                        00003000
* %IF IOSDDEVI_INCLUDED = '' %THEN                                      00004000
* %DO;                                                                  00005000
*/* Macro made bi-lingual on 21295. CBGEN compile date 21138         */ 00006000
*% /*                                                                   00007000
         MACRO                                                          00008000
         IOSDDEVI &DSECT=YES,&LIST=YES,&TITLE=YES,&DEVI=YES             00009000
         GBLC  &IOSDDEVI_INCLUDED                                       00010000
         GBLC  &ZCBPRINT                                                00011000
&IOSDDEVI_INCLUDED SETC 'YES'                                           00012000
         AIF   ('&LIST' EQ 'NONE').P0                                   00013000
         AIF   ('&TITLE' EQ 'NO').P5                                    00014000
 TITLE   'IOSDDEVI  - Device information mapping                      '*00015000
                                                                        00016000
.P5      ANOP                                                           00017000
**/ ;                                                                   00018000
*/****START OF SPECIFICATIONS*****************************************  00019000
*                                                                       00020000
*01* MACRO-NAME: IOSDDEVI                                               00021000
*                                                                       00022000
*01* DESCRIPTIVE-NAME: Device information mapping                       00023000
*                                                                       00024000
*02*   ACRONYM: DEVI                                                    00025000
*                                                                       00026000
*01*   DSECT-NAME: DEVI                                                 00027000
*                                                                       00028000
*                                                                    */ 00029000
*/*01* PROPRIETARY STATEMENT=                                        */ 00030000
*/***PROPRIETARY_STATEMENT********************************************/ 00031000
*/*                                                                  */ 00032000
*/*                                                                  */ 00033000
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00034000
*/* 5650-ZOS COPYRIGHT IBM CORP. 1994, 2015                          */ 00035000
*/*                                                                  */ 00036000
*/* STATUS= HBB77A0                                                  */ 00037000
*/*                                                                  */ 00038000
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 00039000
*/*                                                                     00040000
*                                                                       00041000
*01* COMPONENT: IOS (SC1C3)                                             00042000
*                                                                       00043000
*01* EYE-CATCHER: none                                                  00044000
*02*   OFFSET: N/A                                                      00045000
*02*   LENGTH: N/A                                                      00046000
*                                                                       00047000
*01* STORAGE ATTRIBUTES:                                                00048000
*02*   SUBPOOL:  caller-provided                                        00049000
*02*   KEY:  caller-provided                                            00050000
*02*   RESIDENCY: caller-provided                                       00051000
*                                                                       00052000
*01* METHOD OF ACCESS:                                                  00053000
*                                                                       00054000
*02*   ASM: IOSDDEVI                                                    00055000
*             ,DSECT=YES!NO to specify if the macro should be           00056000
*                           defined as a DSECT.                         00057000
*             ,LIST=YES!NO to control whether or not the macro will     00058000
*                          appear in the assembler listing.             00059000
*             ,DEVI=YES!NO to control whether or not the DEVI mapping   00060000
*                          is expanded.                                 00061000
*                                                                       00062000
*02*   PL/AS: %INCLUDE SYSLIB(IOSDDEVI)                                 00063000
*                                                                       00064000
*      Printing of the macro expansion can be controlled by the         00065000
*      IOSDDEVI_LIST global macro variable.                             00066000
*      Any value other than 'NO' will result in                         00067000
*      the  macro  expansion being printed.  The default is 'YES'.      00068000
*      The following examples illustrate how the                        00069000
*      IOSDDEVI_LIST variable should be set.                            00070000
*                                                                       00071000
*            PLAS:  %IOSDDEVI_LIST='YES'     %IOSDDEVI_LIST='NO'        00072000
*                                                                       00073000
*01* FUNCTION =                                                         00074000
* Maps the input/output area for the DEVIAREA keyword                   00075000
* associated with UCBINFO DEVINFO.                                      00076000
*                                                                       00077000
*01* CREATED BY = issuer of UCBINFO DEVINFO                             00078000
*                                                                       00079000
*01* DELETED BY =  issuer of UCBINFO DEVINFO                            00080000
*                                                                       00081000
*01* POINTED TO BY:                                                     00082000
*      N/A                                                              00083000
*                                                                       00084000
*01* SIZE:                                                              00085000
*          DEVI -- X'0100' bytes                                        00086000
*                                                                       00087000
*01* STORAGE ESTIMATE =                                                 00088000
*   One per issuance of UCBINFO DEVINFO                                 00089000
*                                                                       00090000
*01* SERIALIZATION = N/A                                                00091000
*                                                                       00092000
* EXTERNAL CLASSIFICATION: GUPI                                       * 00093000
* END OF EXTERNAL CLASSIFICATION                                      * 00094000
*                                                                     * 00095000
*01* NOTES =                                                            00096000
*                                                                       00097000
*      1.  Printing of the macro expansion is controlled by the         00098000
*          ZCBPRINT global macro variable.  Any value other than 'NO'   00099000
*          will result in the macro expansion being printed.  The       00100000
*          default is 'YES'.  The following examples illustrate how the 00101000
*          ZCBPRINT variable should be set.                             00102000
*                                                                       00103000
*               ASM:  GBLC &ZCBPRINT                                    00104000
*                     &ZCBPRINT SETC 'YES'  or   &ZCBPRINT SETC 'NO'    00105000
*              PLAS:  %DCL ZCBPRINT CHAR EXT                            00106000
*                     %ZCBPRINT='YES'       or   %ZCBPRINT='NO'         00107000
*                                                                       00108000
*     2.  A  global  variable IOSDDEVI_INCLUDED is set to YES the first 00109000
*          time the macro is invoked.                                   00110000
*               ASM:  This variable can be checked by the caller, to    00111000
*                     determine if the macro has already been invoked.  00112000
*              PLAS:  This variable is checked in the macro code to     00113000
*                     determine if the control block should be          00114000
*                     included.                                         00115000
*                                                                       00116000
*01* CHANGE ACTIVITY =                                                  00117000
*        $L0=DCR097  ,HBB5510,930520,PDLU:  UCBINFO DEVINFO Service     00118000
*                                                                @L0A   00119000
*        $L1=PAVS    ,HBB5520,940210,PDLP:  PAVS, add count of alias    00120000
*                                           for a multiple exposure     00121000
*                                           device               @L1A   00122000
*        $L2=IOSODA  ,HBB7730,060331,PDSC:  HyperPAV Support            00123000
*                                           Changes flagged by apar     00124000
*                                           OA13915              @L2A   00125000
*        $L3=IOSHPF  ,HBB7740,070331,PDDR:  High Performance FICON      00126000
*                                           Support - Changes flagged   00127000
*                                           by APAR OA18766             00128000
*        $L4=IOSUCBX ,HBB7750,070831,PDSC:  UCBVSCR                     00129000
*                                                                       00130000
*        $P1=PN71322 ,HBB5520 940912,PDLP:  Re-run CBGEN to clean up    00131000
*                                           all hand-modified errors    00132000
*                                                                @P1A   00133000
*        $P2=PWA0208 ,JBB6607 980630,PDNO:  Remove obsolete copyright   00134000
*                                           statement            @P2A   00135000
*                                                                       00136000
*        $02=OW25260 ,HBB4430,970331,PDNO:  3590 support for OS/390     00137000
*                                           R3                   @02A   00138000
*        $03=OW37980 ,HBB6603,990531,PDLZ:  Dynamic PAV support  @03A   00139000
*        $04=OW43831 ,HBB6603,000915,PDNO:  Comment changes to          00140000
*                                           clarify fields       @04A   00141000
*        $05=OA45662 ,HBB7790,141130,PDSC:  HyperWrite                  00142000
*        $06=OA50189 ,HBB7790,161230,PDDV:  Read-Only devices           00143000
*        $07=OA58531 ,HBB77A0,191228,PDB7:  Return a pool closed        00144000
*                                           indicator on                00145000
*                                           UCBINFO DEVINFO             00146000
*        $08=OA61131 ,HBB77B0,210831,PDDR:  Consistent read from        00147000
*                                           secondary                   00148000
*                                                                       00149000
*        $A1=OA13915  HBB7707 060331 PDSC:  HyperPAV support            00150000
*                                           - Add HyperPAV pool         00151000
*                                             count and device flag     00152000
*                                                                @A1A   00153000
*        $A4=OA18766  HBB7720 080930 PDDR:  High Performance FICON      00154000
*                                           Support                     00155000
*                                           - Add DEVIFACA and DEVIFCX  00156000
*                                             flags              @A4A   00157000
*        $AA=OA49090  HBB7790 160501 PDSC:  SuperPAV                    00158000
*        $AB=OA50653  HBB7790 170915 PDDR:  Synchronous I/O support     00159000
*                                                                       00160000
*****END OF SPECIFICATIONS********************************************/ 00161000
*% /*                                                                   00162000
.P0      ANOP                                                           00163000
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 00164000
         AIF   ('&LIST' EQ 'YES').P2                                    00165000
.P1      ANOP                                                           00166000
         PUSH  PRINT                                                    00167000
         PRINT OFF                                                      00168000
.P2      ANOP                                                           00169000
         AIF   ('&DEVI' EQ 'NO').L0002                                  00170000
         AIF   ('&DSECT' EQ 'YES').L0003                                00171000
         AIF   ('&DEVI' NE 'YES').L0002                                 00172000
DEVI     DS    0F        DEVI information mapping                       00173000
         AGO   .L0004                                                   00174000
.L0003   ANOP                                                           00175000
DEVI     DSECT           DEVI information mapping                       00176000
.L0004   ANOP                                                           00177000
DEVIFCTN DS    BL2       Indicates which device information areas will *00178000
                         be filled in.                                  00179000
*  Bit definitions:                                                     00180000
DEVIOFSA EQU   X'80'     Indicates that the device offline reasons     *00181000
                         area is filled in.                             00182000
DEVIALVA EQU   X'40'     Indicates that the PAV info is filled in       00183000
DEVIFACA EQU   X'20'     Indicates that the device facilities area is  *00184000
                         filled in                                      00185000
         DS    BL.013    Reserved.                                      00186000
         ORG   DEVIFCTN+2                                               00187000
DEVIOFRS DS    BL2       Device offline reasons. Reasons why device is *00188000
                         being held in the offline state.               00189000
*  Bit definitions:                                                     00190000
DEVIORSN EQU   X'80'     Offline for operator reasons.                  00191000
DEVIHRSN EQU   X'40'     Offline for hierarchy reasons.                 00192000
DEVIALOC EQU   X'20'     Allocated offline because in use by a system  *00193000
                         component.                                     00194000
DEVILRSN EQU   X'10'     Offline for tape library reasons.              00195000
DEVICRSN EQU   X'08'     Offline for configuration manager reasons.     00196000
DEVICUIR EQU   X'04'     Offline for conditional CUIR reasons           00197000
DEVIUCUI EQU   X'02'     Offline for unconditional CUIR reasons         00198000
         DS    BL.009    Reserved.                                      00199000
         ORG   DEVIOFRS+2                                               00200000
DEVIPAVI DS    CL8       Parallel Access Volume Info                    00201000
         ORG   DEVIPAVI                                                 00202000
DEVIHPPC DS    H         If DEVIPAVH is on, this field contains the    *00203000
                         number of HyperPAV alias devices for the      *00204000
                         input device                                   00205000
DEVIPAVT DS    H         If DEVIPAVB is on indicating the input device *00206000
                         is an active PAV-base, then this field        *00207000
                         contains the current total number of PAV      *00208000
                         devices associated with the input device      *00209000
                         (i.e., the count of bound PAV-alias devices   *00210000
                         plus 1 for the PAV-base). Otherwise, this     *00211000
                         field is set to zero                           00212000
DEVIPAVF DS    CL2       PAV flags                                      00213000
*  Bit definitions:                                                     00214000
DEVIPAVC EQU   X'80'     PAV-base capability                            00215000
DEVIPAVB EQU   X'40'     Indicates that the input device is an active  *00216000
                         PAV-base. This implies the PAV-base has one   *00217000
                         or more bound PAV-alias devices associated    *00218000
                         with it.                                       00219000
DEVIPAVH EQU   X'20'     Indicates that the input device is a HyperPAV *00220000
                         device. This implies that DEVIHPPC contains   *00221000
                         the count of the number of HyperPAV aliases   *00222000
                         configured for the input device                00223000
DEVITEMPNOHPAV EQU X'10' HyperPAV devices for the LSS are temporarily  *00224000
                         unavailable                                    00225000
         DS    BL.012    Reserved                                       00226000
         ORG   DEVIPAVF+2                                               00227000
         DS    CL2       Reserved                                       00228000
DEVIFACL DS    F         Device facilities area                         00229000
         ORG   DEVIFACL                                                 00230000
DEVIFACL_BYTE0 DS B                                                     00231000
*                                                                       00232000
*      ***************************************************************  00233000
*      *                                                             *  00234000
*      * Device facilities area byte 0                                  00235000
*      *                                                             *  00236000
*      ***************************************************************  00237000
*                                                                       00238000
*                                                                       00239000
*  Bit definitions:                                                     00240000
DEVIFCX  EQU   X'80'     The FICON Channel Extensions (FCX) facility   *00241000
                         (i.e., High Performance FICON) is supported    00242000
DEVIMIDA EQU   X'40'     Device supports MIDAWs                         00243000
DEVISYNCHIOR EQU X'20'   Device supports synchronous I/O reads          00244000
DEVISYNCHIOW EQU X'10'   Device supports synchronous I/O writes         00245000
DEVICRS  EQU   X'08'     Device supports consistent read from          *00246000
                         secondary                                      00247000
DEVIFACL_BYTE1 DS B                                                     00248000
*                                                                       00249000
*      ***************************************************************  00250000
*      *                                                             *  00251000
*      * Device facilities area byte 1                                  00252000
*      *                                                             *  00253000
*      ***************************************************************  00254000
*                                                                       00255000
*                                                                       00256000
         ORG   DEVIFACL_BYTE1                                           00257000
         DS    B         Reserved                                       00258000
DEVIFACL_BYTE2 DS B                                                     00259000
*                                                                       00260000
*      ***************************************************************  00261000
*      *                                                             *  00262000
*      * Device facilities area byte 2                                  00263000
*      *                                                             *  00264000
*      ***************************************************************  00265000
*                                                                       00266000
*                                                                       00267000
         ORG   DEVIFACL_BYTE2                                           00268000
         DS    B         Reserved                                       00269000
DEVIFACL_BYTE3 DS B                                                     00270000
*                                                                       00271000
*      ***************************************************************  00272000
*      *                                                             *  00273000
*      * Device facilities area byte 3                                  00274000
*      *                                                             *  00275000
*      ***************************************************************  00276000
*                                                                       00277000
*                                                                       00278000
         ORG   DEVIFACL_BYTE3                                           00279000
         DS    B         Reserved                                       00280000
DEVIFLAG1 DS   CL2       Device information flags                       00281000
         ORG   DEVIFLAG1                                                00282000
DEVIFLAG1_BYTE0 DS B     Device information flags byte 0                00283000
*  Bit definitions:                                                     00284000
DEVIDYNSUP EQU X'80'     This device supports dynamic                   00285000
DEVIDYN  EQU   X'40'     This device is dynamic                         00286000
DEVIPAVW EQU   X'20'     Customer has requested dynamic alias tuning   *00287000
                         by WLM for this device                         00288000
DEVIPIN  EQU   X'10'     This device is currently pinned                00289000
DEVIUAVL EQU   X'08'     This device is currently unavailable for      *00290000
                         allocation                                     00291000
DEVIMONR EQU   X'04'     This device should be monitored for I/O       *00292000
                         activity                                       00293000
DEVIXPAV EQU   X'02'     This device is in XPAV mode                    00294000
         ORG   DEVIFLAG1+2                                              00295000
DEVIAMG  DS    X         For DASD subsystems that support alias        *00296000
                         management groups, the AMG # defined on the   *00297000
                         controller for this alias management group.    00298000
         DS    CL1       Reserved                                       00299000
DEVISYSAMG DS  F         For DASD subsystems that support alias        *00300000
                         management groups, the AMG # associated with  *00301000
                         this device on this system (this may vary     *00302000
                         from system to system)                         00303000
         DS    CL4       Reserved                                       00304000
DEVIFLAG2 DS   B         Device flag 2                                  00305000
*  Bit definitions:                                                     00306000
DEVIRODEV EQU  X'80'     If 1, device is read-only                      00307000
DEVIROSS EQU   X'40'     If 1, a PPRC secondary device can vary online *00308000
                         with read-only access. DEVIROSS is only valid *00309000
                         when DEVIRODEV=1.                              00310000
DEVIRONSER EQU X'20'     If 1, read access to this device is not       *00311000
                         serialized with other systems that share      *00312000
                         write access to overlapping extents. IOSXNSER *00313000
                         is set to permit overlapping write requests.  *00314000
                         DEVIRONSER is only valid when DEVIRODEV=1.     00315000
         DS    CL227     Reserved                                       00316000
DEVI_LEN EQU   *-DEVI                                                   00317000
.L0002   ANOP                                                           00318000
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 00319000
         AIF   ('&LIST' EQ 'YES').P4                                    00320000
.P3      ANOP                                                           00321000
         POP   PRINT                                                    00322000
.P4      ANOP                                                           00323000
.P_EXIT  ANOP                                                           00324000
         MEND                                                           00325000
**/ ;                                                                   00326000
* %IOSDDEVI_INCLUDED = 'YES';                                           00327000
* %DCL ZCBPRINT CHAR EXT;                                               00328000
* %DEACTIVATE ZCBPRINT;                                                 00329000
* %DCL IOSDDEVI_LIST CHAR EXT;                                          00330000
* %DEACTIVATE IOSDDEVI_LIST;                                            00331000
* %IF IOSDDEVI_LIST = 'NO' !                                            00332000
*    ZCBPRINT = 'NO' %THEN                                              00333000
* %DO;                                                                  00334000
*   @LIST PUSH NOECHO;                                                  00335000
*   @LIST NOASSEMBLE NOECHO;                                            00336000
*   @LIST OFF C NOECHO;                                                 00337000
* %END;                                                                 00338000
*/* Start of PL/X Source                                             */ 00339000
*DCL 1  DEVI CHAR(256) BDY(WORD) BASED, /* DEVI information mapping  */ 00340000
*       3 DEVIFCTN BIT(16),   /* Indicates which device information     00341000
*                                areas will be filled in.            */ 00342000
*         5 DEVIOFSA BIT(1),  /* Indicates that the device offline      00343000
*                                reasons area is filled in.          */ 00344000
*         5 DEVIALVA BIT(1),  /* Indicates that the PAV info is         00345000
*                                filled in                       @03C*/ 00346000
*         5 DEVIFACA BIT(1),  /* Indicates that the device facilities   00347000
*                                area is filled in               @A4A*/ 00348000
*         5 * BIT(13),        /* Reserved.                       @A4C*/ 00349000
*                                                                       00350000
*       3 DEVIOFRS BIT(16),   /* Device offline reasons.  Reasons why   00351000
*                                device is being held in the            00352000
*                                offline state.                      */ 00353000
*         5 DEVIORSN BIT(1),  /* Offline for operator reasons.       */ 00354000
*         5 DEVIHRSN BIT(1),  /* Offline for hierarchy reasons.      */ 00355000
*         5 DEVIALOC BIT(1),  /* Allocated offline because in use       00356000
*                                by a system component.              */ 00357000
*         5 DEVILRSN BIT(1),  /* Offline for tape library reasons.   */ 00358000
*         5 DEVICRSN BIT(1),  /* Offline for configuration manager      00359000
*                                reasons.                            */ 00360000
*         5 DEVICUIR BIT(1),  /* Offline for conditional CUIR           00361000
*                                reasons                         @02C*/ 00362000
*         5 DEVIUCUI BIT(1),  /* Offline for unconditional CUIR         00363000
*                                reasons                         @02A*/ 00364000
*         5 * BIT(9),         /* Reserved.                       @02C*/ 00365000
*                                                                       00366000
*       3 DEVIPAVI CHAR(8) BDY(WORD), /*                                00367000
*                                Parallel Access Volume Info     @03C*/ 00368000
*         5 DEVIHPPC FIXED(16),/* If DEVIPAVH is on, this field         00369000
*                                contains the number of HyperPAV alias  00370000
*                                devices for the input device    @A1C*/ 00371000
*         5 DEVIPAVT FIXED(16),/* If DEVIPAVB is on indicating the      00372000
*                                input device is an active PAV-base,    00373000
*                                then this field contains the current   00374000
*                                total number of PAV devices associated 00375000
*                                with the input device (i.e., the count 00376000
*                                of bound PAV-alias devices plus 1 for  00377000
*                                the PAV-base).  Otherwise, this field  00378000
*                                is set to zero                  @04C*/ 00379000
*         5 DEVIPAVF CHAR(2), /* PAV flags                       @03A*/ 00380000
*           7 DEVIPAVC BIT(1),/* PAV-base capability             @03A*/ 00381000
*           7 DEVIPAVB BIT(1),/* Indicates that the input device is     00382000
*                                an active PAV-base.  This implies the  00383000
*                                PAV-base has one or more bound         00384000
*                                PAV-alias devices associated with      00385000
*                                it.                             @04C*/ 00386000
*           7 DEVIPAVH BIT(1), /* Indicates that the input device is    00387000
*                                a HyperPAV device.  This implies that  00388000
*                                DEVIHPPC contains the count of the     00389000
*                                number of HyperPAV aliases configured  00390000
*                                for the input device            @A1A*/ 00391000
*           7 DEVITempNoHPAV Bit(1), /* HyperPAV devices for the LSS    00392000
*                                are temporarily unavailable     @07A*/ 00393000
*           7 *       BIT(12),/* Reserved                        @07C*/ 00394000
*         5 *        CHAR(2), /* Reserved                        @03A*/ 00395000
*                                                                       00396000
*       3 DEVIFACL FIXED(32), /* Device facilities area          @A4A*/ 00397000
*         5 DEVIFACL_Byte0 BIT(8),                                      00398000
*                             /* Device facilities area byte 0   @A4A*/ 00399000
*           7 DEVIFCX BIT(1), /* The FICON Channel Extensions (FCX)     00400000
*                                facility (i.e., High Performance       00401000
*                                FICON) is supported             @A4A*/ 00402000
*           7 DEVIMIDA BIT(1), /* Device supports MIDAWs         @L4A*/ 00403000
*           7 DEVISynchIOR Bit(1), /* Device supports synchronous       00404000
*                                 I/O reads                      @ABA*/ 00405000
*           7 DEVISynchIOW Bit(1), /* Device supports synchronous       00406000
*                                 I/O writes                     @ABA*/ 00407000
*           7 DEVICRS Bit(1), /* Device supports consistent read        00408000
*                                from secondary                  @08A*/ 00409000
*           7 *       BIT(3), /* Reserved                        @08C*/ 00410000
*         5 DEVIFACL_Byte1 BIT(8),                                      00411000
*                             /* Device facilities area byte 1   @A4A*/ 00412000
*           7 *       BIT(8), /* Reserved                        @A4A*/ 00413000
*         5 DEVIFACL_Byte2 BIT(8),                                      00414000
*                             /* Device facilities area byte 2   @A4A*/ 00415000
*           7 *       BIT(8), /* Reserved                        @A4A*/ 00416000
*         5 DEVIFACL_Byte3 BIT(8),                                      00417000
*                             /* Device facilities area byte 3   @A4A*/ 00418000
*           7 *       BIT(8), /* Reserved                        @A4A*/ 00419000
*                                                                       00420000
*       3 DEVIFLAG1   CHAR(2), /* Device information flags       @L4A*/ 00421000
*         5 DEVIFLAG1_Byte0 BIT(8), /* Device information flags byte    00422000
*                                0                               @L4A*/ 00423000
*           7 DEVIDynSup BIT(1), /* This device supports dynamic @L4A*/ 00424000
*           7 DEVIDyn BIT(1), /* This device is dynamic          @L4A*/ 00425000
*           7 DEVIPAVW BIT(1), /* Customer has requested dynamic alias  00426000
*                                tuning by WLM for this device   @L4A*/ 00427000
*           7 DEVIPIN  BIT(1), /* This device is currently pinned       00428000
*                                                                @L4A*/ 00429000
*           7 DEVIUAVL BIT(1), /* This device is currently unavailable  00430000
*                                for allocation                  @L4A*/ 00431000
*           7 DEVIMONR BIT(1), /* This device should be monitored       00432000
*                                for I/O activity                @05A*/ 00433000
*           7 DEVIXPAV BIT(1), /* This device is in XPAV mode           00434000
*                                                                @AAA*/ 00435000
*           7 *       BIT(1), /* Reserved                        @AAC*/ 00436000
*       3 DEVIAMG     FIXED(8), /* For DASD subsystems that support     00437000
*                                alias management groups, the AMG #     00438000
*                                defined on the controller for this     00439000
*                                alias management group.         @AAA*/ 00440000
*       3 * CHAR(1),          /* Reserved                        @AAC*/ 00441000
*       3 DEVISysAMG  FIXED(32), /* For DASD subsystems that support    00442000
*                                alias management groups, the AMG #     00443000
*                                associated with this device on this    00444000
*                                system (this may vary from system      00445000
*                                to system)                      @AAA*/ 00446000
*       3 * CHAR(4),          /* Reserved                        @06A*/ 00447000
*       3 DEVIFLAG2   BIT(8), /* Device flag 2                   @06A*/ 00448000
*         5 DEVIRODEV BIT(1), /* If 1, device is read-only       @06A*/ 00449000
*         5 DEVIROSS BIT(1),  /* If 1, a PPRC secondary device          00450000
*                                can vary online with read-only         00451000
*                                access. DEVIROSS is only valid         00452000
*                                when DEVIRODEV=1.               @06A*/ 00453000
*         5 DEVIRONSER BIT(1), /* If 1, read access to this device      00454000
*                                is not serialized with other           00455000
*                                systems that share write access        00456000
*                                to overlapping extents.                00457000
*                                IOSXNSER is set to permit              00458000
*                                overlapping write requests.            00459000
*                                DEVIRONSER is only valid when          00460000
*                                DEVIRODEV=1.                    @06A*/ 00461000
*       3 * CHAR(227);        /* Reserved                        @06C*/ 00462000
* @LOGIC;                                                               00463000
*#PRAGMA TOOL=PADI                                                      00464000
* #PADIDELETE.DEVI_LEN                                                  00465000
*#EPRAGMA                                                               00466000
*@ENDLOGIC;                                                             00467000
*/* End of PL/X Source                                               */ 00468000
* %IF IOSDDEVI_LIST = 'NO' !                                            00469000
*    ZCBPRINT = 'NO' %THEN                                              00470000
* %DO;                                                                  00471000
*   @LIST POP NOECHO;                                                   00472000
* %END;                                                                 00473000
* %END;                                                                 00474000
