*                                                                       00001000
* %DCL IOSDSLPD_INCLUDED CHAR EXT;                                      00002000
* %DEACTIVATE IOSDSLPD_INCLUDED;                                        00003000
* %IF IOSDSLPD_INCLUDED = '' %THEN                                      00004000
* %DO;                                                                  00005000
*/* Macro made bi-lingual on 18338. CBGEN compile date 15295         */ 00006000
*% /*                                                                   00007000
         MACRO                                                          00008000
         IOSDSLPD &DSECT=YES,&LIST=YES,&TITLE=YES,&SLPDHDR=YES,        *00009000
               &SLPDRRT=COND,&SLPDWRT=COND,&SLPDUTIL_STRINGS=COND       00010000
         GBLC  &IOSDSLPD_INCLUDED                                       00011000
         GBLC  &ZCBPRINT                                                00012000
&IOSDSLPD_INCLUDED SETC 'YES'                                           00013000
         AIF   ('&LIST' EQ 'NONE').P0                                   00014000
         AIF   ('&TITLE' EQ 'NO').P5                                    00015000
 TITLE   'IOSDSLPD  - Synchronous I/O Link Performance Data          '  00016000
.P5      ANOP                                                           00017000
**/ IOSDSLPD_1:;                                                        00018000
*/** Start of Specifications ****************************************** 00019000
*                                                                     * 00020000
*01* Macro Name: IOSDSLPD                                             * 00021000
*                                                                     * 00022000
*01* Descriptive Name: Synchronous I/O Link Performance Data          * 00023000
*                                                                     * 00024000
*02*  Dsect Name: SLPD                                                * 00025000
*                                                                     * 00026000
*01* Proprietary Statement:                                           * 00027000
*                                                                     * 00028000
*     LICENSED MATERIALS - PROPERTY OF IBM                            * 00029000
*     5650-ZOS COPYRIGHT IBM CORP. 2017                               * 00030000
*                                                                     * 00031000
*01* Status: HBB7790                                                  * 00032000
*                                                                     * 00033000
*01* Component: I/O Supervisor (SC1C3)                                * 00034000
*                                                                     * 00035000
*01* Function:                                                        * 00036000
*                                                                     * 00037000
*      This is a mapping for the synchronous I/O link specific        * 00038000
*      performance data that is returned by the IQPINFO macro for a   * 00039000
*      PCIE function.  This information follows the device type       * 00040000
*      header mapped by PerfDTHdr in macro IQPYPERF.                  * 00041000
*                                                                     * 00042000
*      The synchronous I/O link specific performance data consists    * 00043000
*      of the following sections:                                     * 00044000
*                                                                     * 00045000
*      -- Header - This section contains the node descriptor of       * 00046000
*         the storage controller for this link, as well as the        * 00047000
*         offsets of the read and write response time sections.       * 00048000
*                                                                     * 00049000
*         This section is mapped by structure SLPDHdr in this macro.  * 00050000
*         The length of this section and all subsequent sections      * 00051000
*         is put into field PerfDTHdr_Length in the PCIE              * 00052000
*         device type header in macro IQPYPERF.                       * 00053000
*                                                                     * 00054000
*      -- Read response time section - This section contains a set    * 00055000
*         of buckets that represent a range of read response time     * 00056000
*         values for the synchronous I/O link.  The number of         * 00057000
*         buckets and the range of values represented are static      * 00058000
*         during the life of an IPL.  Each bucket contains a range    * 00059000
*         value in microseconds and a sample count.  The range        * 00060000
*         values are interpreted as follows:                          * 00061000
*                                                                     * 00062000
*         -- The first range represents response times less than the  * 00063000
*            range value.  For example, if the range value is 10,     * 00064000
*            then this bucket represents response time values less    * 00065000
*            than 10 microseconds.                                    * 00066000
*                                                                     * 00067000
*         -- The remaining ranges represent response times less than  * 00068000
*            the range value and greater than or equal to the prior   * 00069000
*            range value.  For example, if the range value is 30 and  * 00070000
*            the prior range value was 20, this represents responses  * 00071000
*            in the range:                                            * 00072000
*                                                                     * 00073000
*            20 microseconds <= n < 30 microseconds                   * 00074000
*                                                                     * 00075000
*         Example:                                                    * 00076000
*                                                                     * 00077000
*           Bucket  Value  Meaning                                    * 00078000
*           --------------------------------------------------        * 00079000
*             1      20    R/T samples < 20 usec                      * 00080000
*             2      30    R/T samples between 20 and 29 usec         * 00081000
*             3      40    R/T samples between 30 and 39 usec         * 00082000
*             4      50    R/T samples between 40 and 49 usec         * 00083000
*             5    FFFF    R/T samples 50 usec or greater             * 00084000
*                                                                     * 00085000
*         This section is mapped by structure SLPDRRT in this macro.  * 00086000
*                                                                     * 00087000
*      -- Write response time section - This section contains a set   * 00088000
*         of buckets that represent a range of write response time    * 00089000
*         values for the synchronous I/O link.  The number of         * 00090000
*         buckets and the range of values represented are static      * 00091000
*         during the life of an IPL.  Each bucket contains a range    * 00092000
*         value in microseconds and a sample count.  The range        * 00093000
*         values are interpreted the same as described by the         * 00094000
*         Read response time bucket ranges.                           * 00095000
*                                                                     * 00096000
*         This section is mapped by structure SLPDWRT in this macro.  * 00097000
*                                                                     * 00098000
*                                                                     * 00099000
*01* Eye-Catcher: None                                                * 00100000
*                                                                     * 00101000
*01* Created by:                                                      * 00102000
*                                                                     * 00103000
*     - IOSSILPF (Synch I/O Link Performance Exit)                    * 00104000
*                                                                     * 00105000
*01* Deleted by: None                                                 * 00106000
*                                                                     * 00107000
*                                                                     * 00108000
*01* Pointed to by:                                                   * 00109000
*                                                                     * 00110000
*      Contained within the performance data return area that is      * 00111000
*      passed as a parameter on the IQPINFO macro call.               * 00112000
*                                                                     * 00113000
*                                                                     * 00114000
*01* Size: Release Dependent.  Refer to the mapping.                  * 00115000
*                                                                     * 00116000
*01* Module Type: Mapping macro                                       * 00117000
*                                                                     * 00118000
*01* Method of Access:                                                * 00119000
*                                                                     * 00120000
*      PL/X:                                                          * 00121000
*                                                                     * 00122000
*        %INCLUDE SYSLIB(IOSDSLPD)                                    * 00123000
*                                                                     * 00124000
*      ASM:                                                           * 00125000
*                                                                     * 00126000
*        With DSECT=NO, storage is allocated in line                  * 00127000
*        and addressability is provided thru that DSECT or CSECT.     * 00128000
*        With DSECT=YES, a DSECT is produced and "USING SLPDHdr,reg"  * 00129000
*        is required for addressability.  Here "reg" contains the     * 00130000
*        address of the SLPDHdr control block.                        * 00131000
*        The default is DSECT=YES.                                    * 00132000
*                                                                     * 00133000
*                                                                     * 00134000
*01* Dependencies: None                                               * 00135000
*                                                                     * 00136000
*01* Restrictions: None                                               * 00137000
*                                                                     * 00138000
*01* Serialization: None                                              * 00139000
*                                                                     * 00140000
*                                                                     * 00141000
*01* Storage Attributes:                                              * 00142000
*02*  Subpool:   Caller supplied                                      * 00143000
*02*  Key:       0                                                    * 00144000
*02*  Dataspace: N/A                                                  * 00145000
*02*  Residency: Caller supplied                                      * 00146000
*02*  Frequency: 1                                                    * 00147000
*                                                                     * 00148000
*01* Distribution Library (DLIB): AMACLIB                             * 00149000
*                                                                     * 00150000
*01* External Classification: PI                                      * 00151000
*01* End of External Classification:                                  * 00152000
*                                                                     * 00153000
*01* Change Activity:                                                 * 00154000
*                                                                     * 00155000
* $AB=OA50653  HBB7790 170915 PDDR: Synchronous I/O                   * 00156000
*                                                                     * 00157000
* $01=OA54600  HBB7790 181130 PDMD: Synchronous I/O                   * 00158000
*                                   - Add accumulated read/write times* 00159000
*                                   - Add degraded flag               * 00160000
*                                                                     * 00161000
**** End Of Specifications *******************************************/ 00162000
*% /*                                                                   00163000
.P0      ANOP                                                           00164000
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 00165000
         AIF   ('&LIST' EQ 'YES').P2                                    00166000
.P1      ANOP                                                           00167000
         PUSH  PRINT                                                    00168000
         PRINT OFF                                                      00169000
.P2      ANOP                                                           00170000
         AIF   ('&SLPDHDR' EQ 'NO').L0002                               00171000
         AIF   ('&DSECT' EQ 'YES').L0003                                00172000
         AIF   ('&SLPDHDR' NE 'YES').L0002                              00173000
.L0003   ANOP                                                           00174000
*                                                                       00175000
* ********************************************************************  00176000
* *                                                                  *  00177000
* * Synchronous I/O Link Performance Data Header                     *  00178000
* *                                                                  *  00179000
* * This structure appears after the device type header defined in   *  00180000
* * macro IQPYPERF.  It contains the node descriptor of the storage  *  00181000
* * controller as well as the offsets of other sections.             *  00182000
* *                                                                  *  00183000
* ********************************************************************  00184000
*                                                                       00185000
*                                                                       00186000
         AIF   ('&DSECT' EQ 'YES').L0004                                00187000
SLPDHDR  DS    0D        Synchronous I/O Link Performance Data Header   00188000
         AGO   .L0005                                                   00189000
.L0004   ANOP                                                           00190000
SLPDHDR  DSECT           Synchronous I/O Link Performance Data Header   00191000
.L0005   ANOP                                                           00192000
SLPDHDR_LENGTH DS H      Length of the header                           00193000
         DS    CL2       Reserved                                       00194000
SLPDHDR_ND_SDC DS CL26   Self describing component (SDC) of the node   *00195000
                         descriptor                                     00196000
         ORG   SLPDHDR_ND_SDC                                           00197000
SLPDHDR_ND_TYPE DS CL6   Type number                                    00198000
SLPDHDR_ND_MODEL DS CL3  Model number                                   00199000
SLPDHDR_ND_MAN DS CL3    Manufacturer                                   00200000
SLPDHDR_ND_PLANT DS CL2  Plant of Manufacture                           00201000
SLPDHDR_ND_SEQNO DS CL12 Sequence Number                                00202000
SLPDHDR_FLAGS DS X       Flags                                          00203000
*  Bit definitions:                                                     00204000
SLPDHDR_DEGRADED EQU X'80' Port link speed or link width is degraded    00205000
         DS    CL5       Reserved                                       00206000
SLPDHDR_RRT_OFFSET DS H  Offset of the read response time section       00207000
SLPDHDR_WRT_OFFSET DS H  Offset of the write response time section      00208000
SLPDHDR_#R_LINKBUSY DS F The number of synchronous I/O read link busy  *00209000
                         conditions                                     00210000
SLPDHDR_#W_LINKBUSY DS F The number of synchronous I/O write link busy *00211000
                         conditions                                     00212000
SLPDHDR_#R_TIMEOUT DS F  The number of synchronous I/O read timeout    *00213000
                         conditions                                     00214000
SLPDHDR_#W_TIMEOUT DS F  The number of synchronous I/O write timeout   *00215000
                         conditions                                     00216000
SLPDHDR_#R_ACCUMTIME DS FL8 Accumulated response time for reads in 0.5 *00217000
                         usec                                           00218000
SLPDHDR_#W_ACCUMTIME DS FL8 Accumulated response time for writes in    *00219000
                         0.5 usec                                       00220000
         DS    CL24      Reserved                                       00221000
.L0002   ANOP                                                           00222000
         AIF   ('&SLPDRRT' EQ 'NO').L0006                               00223000
         AIF   ('&DSECT' EQ 'YES').L0007                                00224000
         AIF   ('&SLPDRRT' NE 'YES').L0006                              00225000
.L0007   ANOP                                                           00226000
*                                                                       00227000
* ********************************************************************  00228000
* *                                                                  *  00229000
* * Read Response Time Section                                       *  00230000
* *                                                                  *  00231000
* * This section contains a set of buckets that represent a range    *  00232000
* * of read response time values for the synchronous I/O link.       *  00233000
* * Each bucket contains a range value in microseconds and a sample  *  00234000
* * count.                                                           *  00235000
* *                                                                  *  00236000
* * The address of this section is obtained by adding field          *  00237000
* * SLPDHdr_RRT_Offset to the address of the SLPD header.            *  00238000
* *                                                                  *  00239000
* ********************************************************************  00240000
*                                                                       00241000
*                                                                       00242000
         AIF   ('&DSECT' EQ 'YES').L0008                                00243000
SLPDRRT  DS    0D                                                       00244000
         AGO   .L0009                                                   00245000
.L0008   ANOP                                                           00246000
SLPDRRT  DSECT                                                          00247000
.L0009   ANOP                                                           00248000
*                                                                       00249000
*                                      Read response time section       00250000
*                                                                       00251000
SLPDRRT_HDR DS CL8                                                      00252000
         ORG   SLPDRRT_HDR                                              00253000
SLPDRRT_BUCKET_CNT DS H  Number of response time buckets                00254000
         DS    CL6       Reserved                                       00255000
SLPDRRT_BUCKET DS CL8    Response time bucket                           00256000
         ORG   SLPDRRT_BUCKET                                           00257000
SLPDRRT_RANGE DS F       Range value                                    00258000
SLPDRRT_SAMPLES DS F     Sample count                                   00259000
.L0006   ANOP                                                           00260000
         AIF   ('&SLPDWRT' EQ 'NO').L000A                               00261000
         AIF   ('&DSECT' EQ 'YES').L000B                                00262000
         AIF   ('&SLPDWRT' NE 'YES').L000A                              00263000
.L000B   ANOP                                                           00264000
*                                                                       00265000
* ********************************************************************  00266000
* *                                                                  *  00267000
* * Write Response Time Section                                      *  00268000
* *                                                                  *  00269000
* * This section contains a set of buckets that represent a range    *  00270000
* * of write response time values for the synchronous I/O link.      *  00271000
* * Each bucket contains a range value in microseconds and a sample  *  00272000
* * count.                                                           *  00273000
* *                                                                  *  00274000
* * The address of this section is obtained by adding field          *  00275000
* * SLPDHdr_WRT_Offset to the address of the SLPD header.            *  00276000
* *                                                                  *  00277000
* ********************************************************************  00278000
*                                                                       00279000
*                                                                       00280000
         AIF   ('&DSECT' EQ 'YES').L000C                                00281000
SLPDWRT  DS    0D                                                       00282000
         AGO   .L000D                                                   00283000
.L000C   ANOP                                                           00284000
SLPDWRT  DSECT                                                          00285000
.L000D   ANOP                                                           00286000
*                                                                       00287000
*                                      Write response time section      00288000
*                                                                       00289000
SLPDWRT_HDR DS CL8                                                      00290000
         ORG   SLPDWRT_HDR                                              00291000
SLPDWRT_BUCKET_CNT DS H  Number of response time buckets                00292000
         DS    CL6       Reserved                                       00293000
SLPDWRT_BUCKET DS CL8    Response time bucket                           00294000
         ORG   SLPDWRT_BUCKET                                           00295000
SLPDWRT_RANGE DS F       Range value                                    00296000
SLPDWRT_SAMPLES DS F     Sample count                                   00297000
.L000A   ANOP                                                           00298000
         AIF   ('&SLPDUTIL_STRINGS' EQ 'NO').L000E                      00299000
         AIF   ('&DSECT' EQ 'YES').L000F                                00300000
         AIF   ('&SLPDUTIL_STRINGS' NE 'YES').L000E                     00301000
.L000F   ANOP                                                           00302000
*                                                                       00303000
* ********************************************************************  00304000
* *                                                                  *  00305000
* * Utility Strings Mapping                                          *  00306000
* *                                                                  *  00307000
* * The following structure maps the utility strings for a           *  00308000
* * synchronous I/O link.  The utility strings are returned in the   *  00309000
* * PerfUtilStrings field of the IQPYPERF macro.                     *  00310000
* *                                                                  *  00311000
* ********************************************************************  00312000
*                                                                       00313000
*                                                                       00314000
         AIF   ('&DSECT' EQ 'YES').L0010                                00315000
SLPDUTIL_STRINGS DS 0X   Utility strings                                00316000
         AGO   .L0011                                                   00317000
.L0010   ANOP                                                           00318000
SLPDUTIL_STRINGS DSECT   Utility strings                                00319000
.L0011   ANOP                                                           00320000
SLPDUTIL_STR1 DS CL16    Utility string 1                               00321000
         ORG   SLPDUTIL_STR1                                            00322000
SLPDUTIL_WWNN DS CL8     World wide node name of the attached storage  *00323000
                         controller                                     00324000
SLPDUTIL_LINKID DS CL2   Synch I/O link identifier (CULID) of the      *00325000
                         control unit interface                         00326000
         DS    CL6       Reserved                                       00327000
SLPDUTIL_STR2 DS CL16    Utility string 2 - not used                    00328000
SLPDUTIL_STR3 DS CL16    Utility string 3 - not used                    00329000
SLPDUTIL_STR4 DS CL16    Utility string 4 - not used                    00330000
*                                                                       00331000
* ********************************************************************  00332000
* *                                                                  *  00333000
* * Constants                                                        *  00334000
* *                                                                  *  00335000
* ********************************************************************  00336000
*                                                                       00337000
*                                                                       00338000
SLPDHDR_CURRVER EQU 1    Current version of synchronous I/O link       *00339000
                         performance data header. Set in the           *00340000
                         PerfDTHdr_Version field of the device type    *00341000
                         header in macro IQPYPERF                       00342000
SLPDHDR_VER1 EQU 1       Version 1 of the header                        00343000
.L000E   ANOP                                                           00344000
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 00345000
         AIF   ('&LIST' EQ 'YES').P4                                    00346000
.P3      ANOP                                                           00347000
         POP   PRINT                                                    00348000
.P4      ANOP                                                           00349000
.P_EXIT  ANOP                                                           00350000
         MEND                                                           00351000
**/ IOSDSLPD_2:;                                                        00352000
* %IOSDSLPD_INCLUDED = 'YES';                                           00353000
* %DCL ZCBPRINT CHAR EXT;                                               00354000
* %DEACTIVATE ZCBPRINT;                                                 00355000
* %DCL IOSDSLPD_LIST CHAR EXT;                                          00356000
* %DEACTIVATE IOSDSLPD_LIST;                                            00357000
* %IF IOSDSLPD_LIST ^= 'NO' &                                           00358000
*    ZCBPRINT ^= 'NO' %THEN                                             00359000
*   %GOTO IOSDSLPD_3;                                                   00360000
*   @LIST PUSH NOECHO;                                                  00361000
*   @LIST NOASSEMBLE NOECHO;                                            00362000
*   @LIST OFF C NOECHO;                                                 00363000
* %IOSDSLPD_3:;                                                         00364000
*/* Start of PL/X Source                                             */ 00365000
*                                                                       00366000
*/********************************************************************/ 00367000
*/*                                                                  */ 00368000
*/* Synchronous I/O Link Performance Data Header                     */ 00369000
*/*                                                                  */ 00370000
*/* This structure appears after the device type header defined in   */ 00371000
*/* macro IQPYPERF.  It contains the node descriptor of the storage  */ 00372000
*/* controller as well as the offsets of other sections.             */ 00373000
*/*                                                                  */ 00374000
*/********************************************************************/ 00375000
*Dcl                                                                    00376000
*  1 SLPDHdr Bdy(Dword) Based,      /* Synchronous I/O Link             00377000
*                                      Performance Data Header       */ 00378000
*    3 SLPDHdr_Length Fixed(16),    /* Length of the header          */ 00379000
*    3 * Char(2),                   /* Reserved                      */ 00380000
*    3 SLPDHdr_ND_SDC Char(26),     /* Self describing component        00381000
*                                      (SDC) of the node descriptor  */ 00382000
*      5 SLPDHdr_ND_Type  CHAR(6),  /* Type number                   */ 00383000
*      5 SLPDHdr_ND_Model CHAR(3),  /* Model number                  */ 00384000
*      5 SLPDHdr_ND_Man   CHAR(3),  /* Manufacturer                  */ 00385000
*      5 SLPDHdr_ND_Plant CHAR(2),  /* Plant of Manufacture          */ 00386000
*      5 SLPDHdr_ND_Seqno CHAR(12), /* Sequence Number               */ 00387000
*                                                                       00388000
*    3 SLPDHdr_Flags Fixed(8),      /* Flags                         */ 00389000
*      5 SLPDHdr_Degraded Bit(1),   /* Port link speed or link width    00390000
*                                      is degraded                   */ 00391000
*    3 * Char(5),                   /* Reserved                      */ 00392000
*    3 SLPDHdr_RRT_Offset Fixed(16),/* Offset of the read response      00393000
*                                      time section                  */ 00394000
*    3 SLPDHdr_WRT_Offset Fixed(16),/* Offset of the write response     00395000
*                                      time section                  */ 00396000
*    3 SLPDHdr_#R_LinkBusy Fixed(32),/* The number of synchronous I/O   00397000
*                                      read link busy conditions     */ 00398000
*    3 SLPDHdr_#W_LinkBusy Fixed(32),/* The number of synchronous I/O   00399000
*                                      write link busy conditions    */ 00400000
*    3 SLPDHdr_#R_Timeout  Fixed(32),/* The number of synchronous I/O   00401000
*                                      read timeout conditions       */ 00402000
*    3 SLPDHdr_#W_Timeout  Fixed(32),/* The number of synchronous I/O   00403000
*                                      write timeout conditions      */ 00404000
*    3 SLPDHdr_#R_AccumTime Fixed(64), /* Accumulated response time     00405000
*                                      for reads in 0.5 usec         */ 00406000
*    3 SLPDHdr_#W_AccumTime Fixed(64), /* Accumulated response time     00407000
*                                      for writes in 0.5 usec        */ 00408000
*    3 * Char(24);                  /* Reserved                      */ 00409000
*                                                                       00410000
*/********************************************************************/ 00411000
*/*                                                                  */ 00412000
*/* Read Response Time Section                                       */ 00413000
*/*                                                                  */ 00414000
*/* This section contains a set of buckets that represent a range    */ 00415000
*/* of read response time values for the synchronous I/O link.       */ 00416000
*/* Each bucket contains a range value in microseconds and a sample  */ 00417000
*/* count.                                                           */ 00418000
*/*                                                                  */ 00419000
*/* The address of this section is obtained by adding field          */ 00420000
*/* SLPDHdr_RRT_Offset to the address of the SLPD header.            */ 00421000
*/*                                                                  */ 00422000
*/********************************************************************/ 00423000
*Dcl                                                                    00424000
*  1 SLPDRRT Bdy(Dword) Based(Addr(SLPDHdr)+SLPDHdr_RRT_Offset),        00425000
*                                   /* Read response time section    */ 00426000
*    3 SLPDRRT_Hdr,                                                     00427000
*      5 SLPDRRT_Bucket_Cnt Fixed(15),/* Number of response time        00428000
*                                      buckets                       */ 00429000
*      5 * Char(6),                 /* Reserved                      */ 00430000
*    3 SLPDRRT_Bucket(*),           /* Response time bucket          */ 00431000
*      5 SLPDRRT_Range Fixed(31),   /* Range value                   */ 00432000
*      5 SLPDRRT_Samples Fixed(31); /* Sample count                  */ 00433000
*                                                                       00434000
*/********************************************************************/ 00435000
*/*                                                                  */ 00436000
*/* Write Response Time Section                                      */ 00437000
*/*                                                                  */ 00438000
*/* This section contains a set of buckets that represent a range    */ 00439000
*/* of write response time values for the synchronous I/O link.      */ 00440000
*/* Each bucket contains a range value in microseconds and a sample  */ 00441000
*/* count.                                                           */ 00442000
*/*                                                                  */ 00443000
*/* The address of this section is obtained by adding field          */ 00444000
*/* SLPDHdr_WRT_Offset to the address of the SLPD header.            */ 00445000
*/*                                                                  */ 00446000
*/********************************************************************/ 00447000
*Dcl                                                                    00448000
*  1 SLPDWRT Bdy(Dword) Based(Addr(SLPDHdr)+SLPDHdr_WRT_Offset),        00449000
*                                   /* Write response time section   */ 00450000
*    3 SLPDWRT_Hdr,                                                     00451000
*      5 SLPDWRT_Bucket_Cnt Fixed(15),/* Number of response time        00452000
*                                      buckets                       */ 00453000
*      5 * Char(6),                 /* Reserved                      */ 00454000
*    3 SLPDWRT_Bucket(*),           /* Response time bucket          */ 00455000
*      5 SLPDWRT_Range Fixed(31),   /* Range value                   */ 00456000
*      5 SLPDWRT_Samples Fixed(31); /* Sample count                  */ 00457000
*                                                                       00458000
*/********************************************************************/ 00459000
*/*                                                                  */ 00460000
*/* Utility Strings Mapping                                          */ 00461000
*/*                                                                  */ 00462000
*/* The following structure maps the utility strings for a           */ 00463000
*/* synchronous I/O link.  The utility strings are returned in the   */ 00464000
*/* PerfUtilStrings field of the IQPYPERF macro.                     */ 00465000
*/*                                                                  */ 00466000
*/********************************************************************/ 00467000
*Dcl                                                                    00468000
*  1 SLPDUtil_Strings Char(64) Based, /* Utility strings             */ 00469000
*    3 SLPDUtil_Str1 Char(16),      /* Utility string 1              */ 00470000
*      5 SLPDUtil_WWNN Char(8),     /* World wide node name of the      00471000
*                                      attached storage controller   */ 00472000
*      5 SLPDUtil_LinkId Char(2),   /* Synch I/O link identifier        00473000
*                                      (CULID) of the control unit      00474000
*                                      interface                     */ 00475000
*      5 * Char(6),                 /* Reserved                      */ 00476000
*                                                                       00477000
*    3 SLPDUtil_Str2 Char(16),      /* Utility string 2 - not used   */ 00478000
*    3 SLPDUtil_Str3 Char(16),      /* Utility string 3 - not used   */ 00479000
*    3 SLPDUtil_Str4 Char(16);      /* Utility string 4 - not used   */ 00480000
*                                                                       00481000
*/********************************************************************/ 00482000
*/*                                                                  */ 00483000
*/* Constants                                                        */ 00484000
*/*                                                                  */ 00485000
*/********************************************************************/ 00486000
*Dcl                                                                    00487000
*  SLPDHdr_CurrVer Fixed(16) Constant(SLPDHdr_Ver1),                    00488000
*                                   /* Current version of synchronous   00489000
*                                      I/O link performance data        00490000
*                                      header.  Set in the              00491000
*                                      PerfDTHdr_Version field of the   00492000
*                                      device type header in macro      00493000
*                                      IQPYPERF                      */ 00494000
*                                                                       00495000
*  SLPDHdr_Ver1 Fixed(16) Constant(1); /* Version 1 of the header    */ 00496000
*                                                                       00497000
*@logic;                                                                00498000
*#PRAGMA TOOL=CBGEN.                                                    00499000
* #USEORG.                                                              00500000
* #NOLEN.                                                               00501000
*#EPRAGMA.                                                              00502000
*@endlogic;                                                             00503000
*                                                                       00504000
*/* End of PL/X Source                                               */ 00505000
* %IF IOSDSLPD_LIST ^= 'NO' &                                           00506000
*    ZCBPRINT ^= 'NO' %THEN                                             00507000
*   %GOTO IOSDSLPD_4;                                                   00508000
*   @LIST POP NOECHO;                                                   00509000
* %IOSDSLPD_4:;                                                         00510000
* %END;                                                                 00511000
