*        %GOTO CHPDATTR;                                                00010000
         MACRO                                                          00020000
         IOSDCHPD                                                       00030000
*%CHPDATTR: ;                                                           00040000
*/**START OF SPECIFICATIONS*******************************************/ 00050000
*/*                                                                  */ 00060000
*/* MACRO NAME = IOSDCHPD                                            */ 00070000
*/*                                                                  */ 00080000
*/* DESCRIPTIVE NAME = IOSCHPD ATTRIBUTES MAPPING                    */ 00090000
*/*  ACRONYM = N/A                                                   */ 00100000
*/*                                                                  */ 00110000
*/* EXTERNAL CLASSIFICATION: GUPI                                    */ 00120000
*/* END OF EXTERNAL CLASSIFICATION                                   */ 00130000
*/*                                                                  */ 00140000
*/*01* PROPRIETARY STATEMENT=                                        */ 00150000
*/***PROPRIETARY_STATEMENT********************************************/ 00160000
*/*                                                                  */ 00170000
*/*                                                                  */ 00180000
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00190000
*/* 5650-ZOS COPYRIGHT IBM CORP. 2001, 2013                          */ 00200000
*/*                                                                  */ 00210000
*/* STATUS= HBB7790                                                  */ 00220000
*/*                                                                  */ 00230000
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 00240000
*/*                                                                  */ 00250000
*/* DSECT NAME = CHPDATTR                                            */ 00260000
*/*                                                                  */ 00270000
*/* COMPONENT = IOS (SC1C3)                                          */ 00280000
*/*                                                                  */ 00290000
*/* EYE-CATCHER = CHPDA                                              */ 00300000
*/*   OFFSET = X'0'                                                  */ 00310000
*/*   LENGTH = 5 bytes                                               */ 00320000
*/*                                                                  */ 00330000
*/* STORAGE ATTRIBUTES =                                             */ 00340000
*/*     SUBPOOL = Subpool of caller                                  */ 00350000
*/*     KEY = Key of caller                                          */ 00360000
*/*     RESIDENCY = Any                                              */ 00370000
*/*                                                                  */ 00380000
*/* SIZE = 32 bytes                                                  */ 00390000
*/*                                                                  */ 00400000
*/* FUNCTION   = PROVIDES A MAPPING OF THE IOSCHPD ATTRIBUTES        */ 00410000
*/*                                                                  */ 00420000
*/* INVOCATION = BAL - SPECIFY  IOSDCHPD.                            */ 00430000
*/*                    A USING ON CHPDATTR GIVES ADDRESSABILITY      */ 00440000
*/*                    TO ALL SYMBOLS.                               */ 00450000
*/*                                                                  */ 00460000
*/*              PLS,                                                */ 00470000
*/*              PL/AS  - SPECIFY %INCLUDE SYSLIB(IOSDCHPD)          */ 00480000
*/*                                                                  */ 00490000
*/*                               TO GET:                            */ 00500000
*/*                                                                  */ 00510000
*/*                           DCL 1 CHPDATTR BASED BDY(WORD),        */ 00520000
*/*                                                                  */ 00530000
*/* USAGE NOTES =                                                    */ 00540000
*/*                                                                  */ 00550000
*/* CREATED BY = Caller of IOSCHPD service                           */ 00560000
*/*                                                                  */ 00570000
*/* POINTED TO BY = N/A                                              */ 00580000
*/*                                                                  */ 00590000
*/* SERIALIZATION = NONE                                             */ 00600000
*/*                                                                  */ 00610000
*/* LIBRARY = AMACLIB                                                */ 00620000
*/*                                                                  */ 00630000
*/* CHANGE-ACTIVITY =                                                */ 00640000
*/*   $L0=DYCHM,    JBB7713, 000817 PDED: DYNAMIC CHPID MANAGEMENT   */ 00650000
*/*   $L1=IQDX,     HBB7780, 101215 PDGG: IQDX Support               */ 00660000
*/*                                       Add the channel path       */ 00670000
*/*                                       parameter                  */ 00680000
*/*   $L2=PORTDEC,  HBB7790, 110731 PDMD: Switch Port Decommissioning*/ 00690001
*/*                                       Changes flagged as OA38303 */ 00700001
*/*                                                                  */ 00720000
*/*   $A4=OA18766   HBB7720, 080930 PDDR: High Performance FICON     */ 00730000
*/*                                       - Add CHPD_FCX             */ 00740000
*/*   $A8=OA38303,  HBB7770, 120831 PDMD: Switch Port Decommissioning*/ 00741003
*/*                                       - Add CHPDA_OFFLINE_SWITCH */ 00742001
*/*                                       - Add CHPDA_OFFLINE_HMC    */ 00743001
*/*                                                                  */ 00750000
*/*   $P1=PYD0402,  JBB7713, 000908 PDPS: Change the copyright       */ 00760000
*/*                                       information                */ 00770000
*/*                                                                  */ 00780000
*/*   $P2=PZJ0037,  HBB7707, 020930 PDDR: Add channel id related     */ 00790000
*/*                                       information            @P2A*/ 00800000
*/*   $P3=ME20860,  HBB7780, 110201 PDGG: Define CHPDA_CHPP_IQD_Parms*/ 00810000
*/*                                       as DEFINED(CHPDA_CHPP)     */ 00820000
*/*                                                                  */ 00830000
*/*   $01=OW54840,  HBB6608, 020615 PDUU: Include the chp type       */ 00840000
*/*                                       within the attributes      */ 00850000
*/*                                       mapping                @01A*/ 00860000
*/*   $02=OW57714,  HBB7703, 030331 PDB6: No code changes. Shipped   */ 00870000
*/*                                       for completeness.          */ 00880000
*/*                                       (OW57714 rolled down the   */ 00890000
*/*                                       support provided by        */ 00900000
*/*                                       PZJ0037.)              @02A*/ 00910000
*/*                                                                  */ 00920000
*/**END OF SPECIFICATIONS*********************************************/ 00930000
*%GOTO CHPDATTRPLAS;                                                    00940000
*                                                                       00950000
CHPDATTR DSECT                         IOSDCHPD ATTRIBUTES LIST         00960000
         DS    0D                                                       00970000
CHPDACRO DS    CL5                     ACRONYM- 'Chpda'                 00980000
CHPDAVRS DS    CL1                     VERSION LEVEL                    00990000
CHPDAR1  DS    CL2                     Reserved                         01000000
CHPDAFLG DS    0XL4                    Attribute flags             @A4C 01010000
CHPDAFL1 DS    XL1                     Attribute flag one          @A4A 01020000
CHPDAON  EQU   X'80'                   ON - Indicates ONLINE            01030000
CHPDAOFF EQU   X'40'                   ON - Indicates OFFLINE           01040000
CHPDAMAN EQU   X'20'                   ON - Indicates MANAGED           01050000
CHPDA_CHID_Valid    EQU X'10'          ON - Indicates that CHPDA_CHID   01060000
*                                      contains a valid channel id @P2A 01070000
CHPDA_CHID_External EQU X'08'          ON - indicates that CHPDA_CHID   01080000
*                                      contains an external or physical 01090000
*                                      channel id (PCHID).              01100000
*                                      OFF - indicates that CHPDA_CHID  01110000
*                                      contains an internal channel id. 01120000
*                                      This bit is valid only when      01130000
*                                      CHPDA_CHID_Valid is on.     @P2A 01140000
CHPDA_FCX EQU  X'04'                   ON - indicates that the FICON    01150000
*                                      Channel Extensions (FCX)         01160000
*                                      facility (i.e., High Performance 01170000
*                                      FICON) is supported         @A4A 01180000
CHPDA_OFFLINE_SWITCH EQU X'02'         ON - indicates that the channel  01190000
*                                      port is offline due to switch    01200000
*                                      port decommissioning        @A8A 01210001
CHPDA_OFFLINE_HMC    EQU X'01'         ON - indicates that the channel  01220000
*                                      port is offline due to HMC       01230000
*                                      repair and verify           @A8A 01240001
CHPDAFL2 DS    XL1                     Attribute flag two          @A4A 01250000
CHPDAFL3 DS    XL1                     Attribute flag three        @A4A 01260000
CHPDAFL4 DS    XL1                     Attribute flag four         @A4A 01270000
CHPDATYP DS    CL1                     Channel path type - Defined      01280000
*                                      by PathInttype constants         01290000
*                                      described in mapping macro       01300000
*                                      IOSDPATH.                   @01A 01310000
CHPDA_CHPP DS  XL1                     Channel path parameter      @L1C 01320000
* IQD Specific channel path parameter data                         @L1A 01330000
CHPDA_MFS_16KB EQU X'00'               16KB frame size             @L1A 01340000
CHPDA_MFS_24KB EQU X'40'               24KB frame size             @L1A 01350000
CHPDA_MFS_40KB EQU X'80'               40KB frame size             @L1A 01360000
CHPDA_MFS_64KB EQU X'C0'               64KB frame size             @L1A 01370000
CHPDA_IQD_OSD EQU X'04'                When 1, this CHPID is connected  01380000
*                                      to an OSA direct-express channel 01390000
*                                                                  @L1A 01400000
CHPDA_IQD_IQDX EQU X'02'               When 1, this CHPID provides      01410000
*                                      connectivity to the IEDN via     01420000
*                                      a bridge function           @L1A 01430000
* END - IQD Specific channel path parameter data                   @L1A 01440000
CHPDA_CHID DS  CL2                     Channel id (CHID)           @P2A 01450000
CHPDAR2    DS  CL16                    Reserved                    @P2C 01460000
CHPDALEN EQU   *-CHPDATTR              Length of CHPDATTR               01470000
         EJECT                                                          01480000
         MEND                                                           01490000
*%CHPDATTRPLAS: ;                                                       01500000
*                                                                       01510000
*DECLARE                                                                01520000
*  1 CHPDA BASED BDY(DWORD),        /* CHPDA attributes list         */ 01530000
*   3 CHPDACRO    CHAR(5),          /* Acronym - 'CHPDA'             */ 01540000
*   3 CHPDAVRS    FIXED(8),         /* Version level                 */ 01550000
*   3 CHPDAR1     CHAR(2),          /* Reserved                      */ 01560000
*   3 CHPDAFLG    BIT(32),          /* Attribute flags               */ 01570000
*    5 CHPDAFL1    BIT(8),          /* Attribute flag one        @A4A*/ 01580000
*     7 CHPDAON    BIT(1),          /* ON - indicates ONLINE         */ 01590000
*     7 CHPDAOFF   BIT(1),          /* ON - indicates OFFLINE        */ 01600000
*     7 CHPDAMAN   BIT(1),          /* ON - indicates MANAGED        */ 01610000
*     7 CHPDA_CHID_Valid BIT(1),    /* ON - indicates that CHPDA_CHID   01620000
*                                      contains a valid channel id      01630000
*                                                                @P2A*/ 01640000
*     7 CHPDA_CHID_External BIT(1), /* ON - indicates that CHPDA_CHID   01650000
*                                      contains an external or physical 01660000
*                                      channel id (PCHID).              01670000
*                                      OFF - indicates that CHPDA_CHID  01680000
*                                      contains an internal channel id. 01690000
*                                      This bit is valid only when      01700000
*                                      CHPDA_CHID_Valid is on.   @P2A*/ 01710000
*     7 CHPDA_FCX BIT(1),           /* ON - indicates that the FICON    01720000
*                                      Channel Extensions (FCX)         01730000
*                                      facility (i.e., High Performance 01740000
*                                      FICON) is supported       @A4A*/ 01750000
*     7 CHPDA_OFFLINE_SWITCH BIT(1), /* ON - indicates that the channel 01760000
*                                      port is offline due to switch    01770000
*                                      port decommissioning      @A8A*/ 01780001
*     7 CHPDA_OFFLINE_HMC    BIT(1), /* ON - indicates that the channel 01790000
*                                      port is offline due to HMC       01800000
*                                      repair and verify         @A8A*/ 01810001
*    5 CHPDAFL2   BIT(8),           /* Attribute flag one        @A4A*/ 01820000
*     7 *         BIT(8),           /* Reserved                  @A4A*/ 01830000
*    5 CHPDAFL3   BIT(8),           /* Attribute flag one        @A4A*/ 01840000
*     7 *         BIT(8),           /* Reserved                  @A4A*/ 01850000
*    5 CHPDAFL4   BIT(8),           /* Attribute flag one        @A4A*/ 01860000
*     7 *         BIT(8),           /* Reserved                  @A4A*/ 01870000
*   3 CHPDATYP    CHAR(1),          /* Channel path type - Defined      01880000
*                                      by PathInttype constants         01890000
*                                      described in mapping macro       01900000
*                                      IOSDPATH.                 @01A*/ 01910000
*   3 CHPDA_CHPP Bit(8),            /* Channel path parameter specific  01920000
*                                      data. This information is        01930000
*                                      dependent on the channel path    01940000
*                                      type in CHPDATYP. See below      01950000
*                                      for definitions of this field    01960000
*                                                                @L1A*/ 01970000
*   3 CHPDA_CHID  CHAR(2),          /* Channel id (CHID)         @P2A*/ 01980000
*   3 CHPDAR2     CHAR(16);         /* Reserved                  @P2C*/ 01990000
*                                                                       02000000
* /*******************************************************************/ 02010000
* /*                                                                 */ 02020000
* /* Definition of CHPDA_CHPP for IQD Channels                   @L1A*/ 02030000
* /*                                                                 */ 02040000
* /*******************************************************************/ 02050000
* DCL 1 CHPDA_CHPP_IQD_Parms Bit(8) DEFINED(CHPDA_CHPP),/* IQD Parms    02060000
*                                                                @P3C*/ 02070000
*       3 CHPDA_IQD_MFS Bit(2),    /* Maximum frame size         @L1A*/ 02080000
*       3 *        Bit(3),         /* Reserved                   @L1A*/ 02090000
*       3 CHPDA_IQD_OSD Bit(1),    /* When 1, this CHPID is connected   02100000
*                                     to an OSA direct-express channel  02110000
*                                                                @L1A*/ 02120000
*       3 CHPDA_IQD_IQDX Bit(1),   /* When 1, this CHPID provides       02130000
*                                     connectivity to the IEDN via a    02140000
*                                     bridge                     @L1A*/ 02150000
*       3 *        Bit(1);         /* Reserved                   @L1A*/ 02160000
*                                                                       02170000
*                                                                       02180000
*DECLARE                                                                02190000
*  CHPDACHR CHAR(5)  CONSTANT('CHPDA'), /* Characters for acronym    */ 02200000
*  CHPDAV1  FIXED(8) CONSTANT(1),       /* Version level 1       @01C*/ 02210000
*  CHPDARID FIXED(8) CONSTANT(CHPDAV1); /* Current version level @01C*/ 02220000
*/********************************************************************/ 02230000
*/* Maximum Frame Size Constants                                 @L1A*/ 02240000
*/********************************************************************/ 02250000
*DECLARE                                                                02260000
*  CHPDA_MFS_16KB Bit(2) Constant('00'B), /* 16 kilobytes        @L1A*/ 02270000
*  CHPDA_MFS_24KB Bit(2) Constant('01'B), /* 24 kilobytes        @L1A*/ 02280000
*  CHPDA_MFS_40KB Bit(2) Constant('10'B), /* 40 kilobytes        @L1A*/ 02290000
*  CHPDA_MFS_64KB Bit(2) Constant('11'B); /* 64 kilobytes        @L1A*/ 02300000
*                                                                       02310000
