*                                                                       00001000
* %DCL IOSDTCW_INCLUDED CHAR EXT;                                       00002000
* %DEACTIVATE IOSDTCW_INCLUDED;                                         00003000
* %IF IOSDTCW_INCLUDED = '' %THEN                                       00004000
* %DO;                                                                  00005000
*/* Macro made bi-lingual on 11070. CBGEN compile date 11015         */ 00006000
*% /*                                                                   00007000
         MACRO                                                          00008000
         IOSDTCW &DSECT=YES,&LIST=YES,&TITLE=YES,&TCW=YES,&TIDAW0=COND  00009000
         GBLC  &IOSDTCW_INCLUDED                                        00010000
         GBLC  &ZCBPRINT                                                00011000
&IOSDTCW_INCLUDED SETC 'YES'                                            00012000
         AIF   ('&LIST' EQ 'NONE').P0                                   00013000
         AIF   ('&TITLE' EQ 'NO').P5                                    00014000
 TITLE   'IOSDTCW  - Transport Control Word                     '       00015000
.P5      ANOP                                                           00016000
**/ IOSDTCW_1:;                                                         00017000
*/* Start of Specifications ******************************************/ 00018000
*/*                                                                  */ 00019000
*/*01* Macro Name: IOSDTCW                                           */ 00020000
*/*                                                                  */ 00021000
*/*01* Descriptive Name = Transport Control Word                     */ 00022000
*/*                                                                  */ 00023000
*/*02*   Acronym:  TCW                                               */ 00024000
*/*                                                                  */ 00025000
*/*02*   DSECT Name: TCW and TIDAW                                   */ 00026000
*/*                                                                  */ 00027000
*/*01* Proprietary Statement =                                       */ 00028000
*/*                                                                  */ 00029000
*/*    LICENSED MATERIALS - PROPERTY OF IBM                          */ 00030000
*/*    5694-A01 COPYRIGHT IBM CORP. 2010                             */ 00031000
*/*                                                                  */ 00032000
*/*01* Status= HBB7770                                               */ 00033000
*/*                                                                  */ 00034000
*/*01* Component: I/O Supervisor (SC1C3)                             */ 00035000
*/*                                                                  */ 00036000
*/*01* Function =                                                    */ 00037000
*/*                                                                  */ 00038000
*/*    IOSDTCW maps the Transport Control Word (TCW) which contains  */ 00039000
*/*    all of the information needed by the channel to drive an      */ 00040000
*/*    FCX I/O operation.  It includes the following information:    */ 00041000
*/*                                                                  */ 00042000
*/*    -- A pointer to a Transport Command Control Block (TCCB)      */ 00043000
*/*       that contains the commands to be executed.  See macro      */ 00044000
*/*       IOSDTCCB.                                                  */ 00045000
*/*                                                                  */ 00046000
*/*    -- For write requests, a pointer to a data buffer or a list   */ 00047000
*/*       of data buffers (see TIDAL description below) that         */ 00048000
*/*       contain information that is transferred to the device.     */ 00049000
*/*                                                                  */ 00050000
*/*    -- For read requests, a pointer to a data buffer or a list    */ 00051000
*/*       of data buffers (see TIDAL description below) that will    */ 00052000
*/*       contain information that is transferred from the device.   */ 00053000
*/*                                                                  */ 00054000
*/*    -- A pointer to a Transport Status Block (TSB) that contains  */ 00055000
*/*       additional completion status over and above the status     */ 00056000
*/*       information stored in the IRB.  See macro IOSDTSB.         */ 00057000
*/*                                                                  */ 00058000
*/*    The TCW is built by the I/O driver or its callers and passed  */ 00059000
*/*    to IOS in the IOSB.  The first TCW is always copied to the    */ 00060000
*/*    IOQ by the device dependent STARTIO exit.  This allows the    */ 00061000
*/*    exit to modify the channel program and also allows IOS to     */ 00062000
*/*    assign a Transport Status Block (TSB).                        */ 00063000
*/*                                                                  */ 00064000
*/*    This macro also contains the mapping for the Transport        */ 00065000
*/*    Indirect Address Word (TIDAW).  The TIDAW allows the TCCB     */ 00066000
*/*    and read/write data to be scattered in storage.  The TCW      */ 00067000
*/*    points to an area of storage called a TIDAL list or TIDAL.    */ 00068000
*/*    Each quadword in the list is a TIDAW which points to either   */ 00069000
*/*    an area of storage or another TIDAL.                          */ 00070000
*/*                                                                  */ 00071000
*/*                                                                  */ 00072000
*/*01* Notes =                                                       */ 00073000
*/*                                                                  */ 00074000
*/*    -- The TCW must begin on a 64-byte boundary                   */ 00075000
*/*    -- TIDAWs must begin on a quadword boundary                   */ 00076000
*/*                                                                  */ 00077000
*/*01* Eye-Catcher: None                                             */ 00078000
*/*                                                                  */ 00079000
*/*01* Created By: User                                              */ 00080000
*/*                                                                  */ 00081000
*/*01* Deleted By: User                                              */ 00082000
*/*                                                                  */ 00083000
*/*01* Pointed to By:                                                */ 00084000
*/*                                                                  */ 00085000
*/*    TCW Pointers:                                                 */ 00086000
*/*                                                                  */ 00087000
*/*      IOSRST   in IECDIOSB (real address)                         */ 00088000
*/*      IOSVST   in IECDIOSB (virtual address)                      */ 00089000
*/*      IOSTCWAD in IECDIOSB (real or virtual address)              */ 00090000
*/*      ORBCPA   in IHAORB   (real address)                         */ 00091000
*/*      IRBTCWAD in IHAIRB   (real address)                         */ 00092000
*/*      TCWInterrogateAddr in IOSDTCW (real address)                */ 00093000
*/*                                                                  */ 00094000
*/*    TIDAW Pointers:                                               */ 00095000
*/*                                                                  */ 00096000
*/*      TCWTCCBAddr   in IOSDTCW (real address)                     */ 00097000
*/*      TCWInputAddr  in IOSDTCW (real address)                     */ 00098000
*/*      TCWOutputAddr in IOSDTCW (real address)                     */ 00099000
*/*      TCWOutputAddr in IOSDTCW (real address)                     */ 00100000
*/*      TIDAW0_Addr   in IOSDTCW (real address)                     */ 00101000
*/*                                                                  */ 00102000
*/*01* Size: 64 Bytes for TCW,                                       */ 00103000
*/*          16 bytes for TIDAW                                      */ 00104000
*/*                                                                  */ 00105000
*/*01* Module Type: Mapping macro                                    */ 00106000
*/*                                                                  */ 00107000
*/*01* Method of Access:                                             */ 00108000
*/*                                                                  */ 00109000
*/*02*   ASM:                                                        */ 00110000
*/*       IOSDTCW DSECT=YES!NO  -- Request DSECT definition          */ 00111000
*/*                                                                  */ 00112000
*/*      Default: DSECT=YES                                          */ 00113000
*/*                                                                  */ 00114000
*/*02*   PL/X:                                                       */ 00115000
*/*       %INCLUDE SYSLIB(IOSDTCW)                                   */ 00116000
*/*                                                                  */ 00117000
*/*       To define structure TCW as BASED on a specific address     */ 00118000
*/*       specify the following:                                     */ 00119000
*/*                                                                  */ 00120000
*/*          %TCWBASE = 'BASED(basing expression)'                   */ 00121000
*/*                                                                  */ 00122000
*/*       If %TCWBASE is not specified, TCW will be                  */ 00123000
*/*       declared as BASED.                                         */ 00124000
*/*                                                                  */ 00125000
*/*       To define structure TIDAW0 as BASED on a specific          */ 00126000
*/*       address, specify the following:                            */ 00127000
*/*                                                                  */ 00128000
*/*          %TIDAW0BASE = 'BASED(basing expression)'                */ 00129000
*/*                                                                  */ 00130000
*/*       If %TIDAW0BASE is not specified, TIDAW0 will be            */ 00131000
*/*       declared as BASED.                                         */ 00132000
*/*                                                                  */ 00133000
*/*01* Dependencies: None                                            */ 00134000
*/*                                                                  */ 00135000
*/*01* Restrictions: None                                            */ 00136000
*/*                                                                  */ 00137000
*/*01* Serialization: None                                           */ 00138000
*/*                                                                  */ 00139000
*/*01* Storage Attributes:                                           */ 00140000
*/*02*   Subpool: Any                                                */ 00141000
*/*02*   Key: Any                                                    */ 00142000
*/*02*   Dataspace: IOS CADS (SYSCOMDS) for copied TCW               */ 00143000
*/*02*   Residency: Below 2G in virtual and real storage             */ 00144000
*/*02*   Main Storage: Yes                                           */ 00145000
*/*02*   Auxiliary Storage: N/A                                      */ 00146000
*/*02*   Virtual Storage: Yes                                        */ 00147000
*/*02*   Frequency: One per FCX I/O or interrogate request           */ 00148000
*/*                                                                  */ 00149000
*/*01* Distribution Library: AMACLIB                                 */ 00150000
*/*                                                                  */ 00151000
*/*01* External Classification: PI                                   */ 00152000
*/*01* End of External Classification:                               */ 00153000
*/*                                                                  */ 00154000
*/*01* Change Activity:                                              */ 00155000
*/*                                                                  */ 00156000
*/* $MAC(IOSDTCW),COMP(SC1C3): Transport Control Word                */ 00157000
*/*                                                                  */ 00158000
*/*  PN REASON  RELEASE  DATE   ORG   COMMENTS                       */ 00159000
*/* $L0=IOSHPF  HBB7740  070331 PDHC: High Performance FICON support,*/ 00160000
*/*                                   flagged as APAR OA18766        */ 00161000
*/* $L1=ZDAC    HBB7770  090331 PDON: Discovery and                  */ 00162000
*/*                                   AutoConfiguration - Add        */ 00163000
*/*                                   TCWTSRQB                   @L1A*/ 00164000
*/*                                                                  */ 00165000
*/* $A4=OA18766 HBB7720  080930 PDHC: High Performance FICON support */ 00166000
*/* $P1=ME18102 HBB7770  100205 PDMD: Update DISTLIB                 */ 00167000
*/* $P2=ME21254 HBB7780  110311 PDCC: Remove OA34785 Metadata Editor */ 00168000
*/*                                   changes.                       */ 00169000
*/*                                                                  */ 00170000
*/*                                                                  */ 00171000
*/* $01=OA34785 HBB7750  101130 PDCC: Update DISTLIB                 */ 00172000
*/*                                                                  */ 00173000
*/* End of Specifications ********************************************/ 00174000
*% /*                                                                   00175000
.P0      ANOP                                                           00176000
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 00177000
         AIF   ('&LIST' EQ 'YES').P2                                    00178000
.P1      ANOP                                                           00179000
         PUSH  PRINT                                                    00180000
         PRINT OFF                                                      00181000
.P2      ANOP                                                           00182000
         AIF   ('&TCW' EQ 'NO').L0002                                   00183000
         AIF   ('&DSECT' EQ 'YES').L0003                                00184000
         AIF   ('&TCW' NE 'YES').L0002                                  00185000
.L0003   ANOP                                                           00186000
*                                                                       00187000
* ********************************************************************  00188000
* *                                                                  *  00189000
* * Transport Control Word (TCW)                                     *  00190000
* *                                                                  *  00191000
* ********************************************************************  00192000
*                                                                       00193000
*                                                                       00194000
         AIF   ('&DSECT' EQ 'YES').L0004                                00195000
TCW      DS    0D        Transport Control Word                         00196000
         AGO   .L0005                                                   00197000
.L0004   ANOP                                                           00198000
TCW      DSECT           Transport Control Word                         00199000
.L0005   ANOP                                                           00200000
TCWWORD0 DS    0CL4      Word 0                                         00201000
TCWWORD0BYTE0 DS 0B      Word 0, byte 0                                 00202000
TCWFORMAT EQU  X'C0'     TCW format                                     00203000
TCWFORMATRSVD1 EQU X'3F' Reserved, zeroes                               00204000
         ORG   TCWWORD0BYTE0+1                                          00205000
TCWFLAGS DS    0CL3      Flags                                          00206000
TCWFLAG1 DS    0B        Flag one                                       00207000
TCWRSVD1 EQU   X'80'     Reserved                                       00208000
TCWRSVD2 EQU   X'40'     Reserved                                       00209000
TCWRSVD3 EQU   X'20'     Reserved                                       00210000
TCWRSVD4 EQU   X'10'     Reserved                                       00211000
TCWRSVD5 EQU   X'08'     Reserved                                       00212000
TCWINPUT@TIDAL EQU X'04' The input address in TCWInputAddr points to a *00213000
                         TIDAL. Otherwise, it points to data.           00214000
TCWTCCB@TIDAL EQU X'02'  The TCCB address in TCWTCCBAddr points to a   *00215000
                         TIDAL. Otherwise, it points to a TCCB.         00216000
TCWOUTPUT@TIDAL EQU X'01' The output address in TCWOutputAddr points   *00217000
                         to a TIDAL. Otherwise, it points to data.      00218000
         ORG   TCWFLAG1+1                                               00219000
TCWFLAG2 DS    0B        Flag two                                       00220000
TCWTIDAWFORMAT EQU X'C0' The format of the TIDAW                        00221000
TCWTSRQB EQU   X'20'     TSRQB is designated                            00222000
TCWRSVD6 EQU   X'1F'     Reserved                                       00223000
         ORG   TCWFLAG2+1                                               00224000
TCWFLAG3 DS    0B        Flag three                                     00225000
TCWRSVD7 DS    B         Reserved                                       00226000
TCWWORD1 DS    0CL4      Word 1                                         00227000
TCWRSVD8 DS    CL1       Reserved                                       00228000
TCWTCCBLRW DS  0B        TCCB length and read and write bits            00229000
TCWTCCBL EQU   X'FC'     TCCB length - The length of the TCCB in words *00230000
                         minus 5. That is, this length includes the    *00231000
                         entire TCCB except for the TCA header and the *00232000
                         last word of the TCA trailer (5 words total).  00233000
TCWREAD  EQU   X'02'     Data is transferred from the device to        *00234000
                         storage                                        00235000
TCWWRITE EQU   X'01'     Data is transferred from storage to the       *00236000
                         device                                         00237000
         ORG   TCWTCCBLRW+1                                             00238000
TCWRSVD9 DS    CL2       Reserved                                       00239000
TCWOUTPUTADDR DS AD      Words 2 & 3 - output data address or TIDAL     00240000
TCWINPUTADDR DS AD       Words 4 & 5 - input data data or TIDAL         00241000
TCWTSBADDR DS  AD        Words 6 & 7 - Transport Status Block address. *00242000
                         This field is reserved for IOS use and must   *00243000
                         be set to zero by the builder of the channel  *00244000
                         program.                                       00245000
TCWTCCBADDR DS AD        Words 8 & 9 - Transport Command Control Block *00246000
                         (TCCB) address or TIDAL. See macro IOSDTCCB.   00247000
TCWOUTPUTBYTECOUNT DS F  Word 10 - Output data byte count               00248000
TCWINPUTBYTECOUNT DS F   Word 11 - Input data byte count                00249000
TCWWORD12 DS   CL4       Word 12 - Reserved                             00250000
TCWWORD13 DS   CL4       Word 13 - Reserved                             00251000
TCWWORD14 DS   CL4       Word 14 - Reserved                             00252000
TCWINTERROGATEADDR DS A  Word 15 - Interrogate TCW address. Reserved   *00253000
                         for IOS use only. Must be set to zero by the  *00254000
                         builder of the channel program.                00255000
*                                                                       00256000
* ********************************************************************  00257000
* *                                                                  *  00258000
* * Constants for TCWFormat                                          *  00259000
* *                                                                  *  00260000
* ********************************************************************  00261000
*                                                                       00262000
*                                                                       00263000
TCWFORMAT_0 EQU B'00000000' Format 0 TCW                                00264000
TCWFORMAT_1 EQU B'01000000' Reserved for future use                     00265000
TCWFORMAT_2 EQU B'10000000' Reserved for future use                     00266000
TCWFORMAT_3 EQU B'11000000' Reserved for future use                     00267000
*                                                                       00268000
* ********************************************************************  00269000
* *                                                                  *  00270000
* * Constants for TCWTIDAWFormat                                     *  00271000
* *                                                                  *  00272000
* ********************************************************************  00273000
*                                                                       00274000
*                                                                       00275000
TCWTIDAWFORMAT_0 EQU B'00000000' Format 0 TIDAW                         00276000
TCWTIDAWFORMAT_1 EQU B'01000000' Reserved for future use                00277000
TCWTIDAWFORMAT_2 EQU B'10000000' Reserved for future use                00278000
TCWTIDAWFORMAT_3 EQU B'11000000' Reserved for future use                00279000
TCW_LEN  EQU   *-TCW                                                    00280000
.L0002   ANOP                                                           00281000
         AIF   ('&TIDAW0' EQ 'NO').L0006                                00282000
         AIF   ('&DSECT' EQ 'YES').L0007                                00283000
         AIF   ('&TIDAW0' NE 'YES').L0006                               00284000
.L0007   ANOP                                                           00285000
*                                                                       00286000
* ********************************************************************  00287000
* *                                                                  *  00288000
* * Format 0 Transport Indirect Address Word (TIDAW)                 *  00289000
* *                                                                  *  00290000
* ********************************************************************  00291000
*                                                                       00292000
*                                                                       00293000
         AIF   ('&DSECT' EQ 'YES').L0008                                00294000
TIDAW0   DS    0D        Format 0 TIDAW                                 00295000
         AGO   .L0009                                                   00296000
.L0008   ANOP                                                           00297000
TIDAW0   DSECT           Format 0 TIDAW                                 00298000
.L0009   ANOP                                                           00299000
TIDAW0_FLAGS DS 0B       Flags                                          00300000
TIDAW0_LAST EQU X'80'    This is the last TIDAW for a TCW               00301000
TIDAW0_SKIP EQU X'40'    Skip the transfer of information to main      *00302000
                         storage during a read, sense-id, or sense     *00303000
                         operation                                      00304000
TIDAW0_DTINT EQU X'20'   Data transfer interruption control             00305000
TIDAW0_TTIC EQU X'10'    TIDAW transfer in channel - the 8-byte        *00306000
                         address is the starting address of the next   *00307000
                         TIDAL                                          00308000
TIDAW0_GENCBC EQU X'08'  For output requests, insert a Checking Block  *00309000
                         Code (CBC) word after transferring the data   *00310000
                         represented by this TIDAW. The setting of     *00311000
                         this bit is device and command dependent.      00312000
         ORG   TIDAW0_FLAGS+1                                           00313000
TIDAW0_RSVD1 DS CL3      Reserved                                       00314000
TIDAW0_COUNT DS F        The number of bytes to be transferred          00315000
TIDAW0_ADDR DS 0AD       Data address                                   00316000
TIDAW0_ADDR_HIGH DS A    High order word of address                     00317000
TIDAW0_ADDR_LOW DS A     Low order word of address                      00318000
TIDAW0_LEN EQU *-TIDAW0                                                 00319000
.L0006   ANOP                                                           00320000
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 00321000
         AIF   ('&LIST' EQ 'YES').P4                                    00322000
.P3      ANOP                                                           00323000
         POP   PRINT                                                    00324000
.P4      ANOP                                                           00325000
.P_EXIT  ANOP                                                           00326000
         MEND                                                           00327000
**/ IOSDTCW_2:;                                                         00328000
* %IOSDTCW_INCLUDED = 'YES';                                            00329000
* %DCL ZCBPRINT CHAR EXT;                                               00330000
* %DEACTIVATE ZCBPRINT;                                                 00331000
* %DCL IOSDTCW_LIST CHAR EXT;                                           00332000
* %DEACTIVATE IOSDTCW_LIST;                                             00333000
* %IF IOSDTCW_LIST ^= 'NO' &                                            00334000
*    ZCBPRINT ^= 'NO' %THEN                                             00335000
*   %GOTO IOSDTCW_3;                                                    00336000
*   @LIST PUSH NOECHO;                                                  00337000
*   @LIST NOASSEMBLE NOECHO;                                            00338000
*   @LIST OFF C NOECHO;                                                 00339000
* %IOSDTCW_3:;                                                          00340000
*/* Start of PL/X Source                                             */ 00341000
*%DCL TCWBASE CHAR;                                                     00342000
*                                                                       00343000
*%IF TCWBASE ^='' %THEN                                                 00344000
*  %GOTO TCWDCL;                                                        00345000
*%TCWBASE = 'BASED';                                                    00346000
*%TCWDCL:;                                                              00347000
*/********************************************************************/ 00348000
*/*                                                                  */ 00349000
*/* Transport Control Word (TCW)                                     */ 00350000
*/*                                                                  */ 00351000
*/********************************************************************/ 00352000
*DECLARE                                                                00353000
*  1 TCW TCWBASE BDY(DWORD),        /* Transport Control Word        */ 00354000
*    3 TCWWord0            CHAR(4), /* Word 0                        */ 00355000
*      5 TCWWord0Byte0     BIT(8),  /* Word 0, byte 0                */ 00356000
*        7 TCWFormat       BIT(2),  /* TCW format                    */ 00357000
*        7 TCWFormatRsvd1  BIT(6),  /* Reserved, zeroes              */ 00358000
*      5 TCWFlags          CHAR(3), /* Flags                         */ 00359000
*        7 TCWFlag1        BIT(8),  /* Flag one                      */ 00360000
*          9 TCWRsvd1       BIT(1), /* Reserved                      */ 00361000
*          9 TCWRsvd2       BIT(1), /* Reserved                      */ 00362000
*          9 TCWRsvd3       BIT(1), /* Reserved                      */ 00363000
*          9 TCWRsvd4       BIT(1), /* Reserved                      */ 00364000
*          9 TCWRsvd5       BIT(1), /* Reserved                      */ 00365000
*          9 TCWInput@TIDAL BIT(1), /* The input address in             00366000
*                                      TCWInputAddr points to a         00367000
*                                      TIDAL.  Otherwise, it points     00368000
*                                      to data.                      */ 00369000
*          9 TCWTCCB@TIDAL  BIT(1), /* The TCCB address in              00370000
*                                      TCWTCCBAddr points to a          00371000
*                                      TIDAL.  Otherwise,               00372000
*                                      it points to a TCCB.          */ 00373000
*          9 TCWOutput@TIDAL BIT(1),/* The output address in            00374000
*                                      TCWOutputAddr points to a        00375000
*                                      TIDAL.  Otherwise, it points     00376000
*                                      to data.                      */ 00377000
*        7 TCWFlag2         BIT(8), /* Flag two                      */ 00378000
*          9 TCWTIDAWFormat BIT(2), /* The format of the TIDAW       */ 00379000
*          9 TCWTSRQB       BIT(1), /* TSRQB is designated       @L1A*/ 00380000
*          9 TCWRsvd6       BIT(5), /* Reserved                  @L1C*/ 00381000
*        7 TCWFlag3         BIT(8), /* Flag three                    */ 00382000
*          9 TCWRsvd7       BIT(8), /* Reserved                      */ 00383000
*                                                                       00384000
*    3 TCWWord1            CHAR(4), /* Word 1                        */ 00385000
*      5 TCWRsvd8          CHAR(1), /* Reserved                      */ 00386000
*      5 TCWTCCBLRW        BIT(8),  /* TCCB length and read and         00387000
*                                      write bits                    */ 00388000
*        7 TCWTCCBL        BIT(6),  /* TCCB length - The length of      00389000
*                                      the TCCB in words minus 5.       00390000
*                                      That is, this length             00391000
*                                      includes the entire TCCB         00392000
*                                      except for the TCA header        00393000
*                                      and the last word of the TCA     00394000
*                                      trailer (5 words total).      */ 00395000
*        7 TCWRead         BIT(1),  /* Data is transferred from the     00396000
*                                      device to storage             */ 00397000
*        7 TCWWrite        BIT(1),  /* Data is transferred from         00398000
*                                      storage to the device         */ 00399000
*      5 TCWRsvd9          CHAR(2), /* Reserved                      */ 00400000
*                                                                       00401000
*    3 TCWOutputAddr       PTR(64), /* Words 2 & 3 - output data        00402000
*                                      address or TIDAL              */ 00403000
*    3 TCWInputAddr        PTR(64), /* Words 4 & 5 - input data         00404000
*                                      data or TIDAL                 */ 00405000
*    3 TCWTSBAddr          PTR(64), /* Words 6 & 7 - Transport          00406000
*                                      Status Block address.  This      00407000
*                                      field is reserved for IOS use    00408000
*                                      and must be set to zero by the   00409000
*                                      builder of the channel           00410000
*                                      program.                      */ 00411000
*    3 TCWTCCBAddr         PTR(64), /* Words 8 & 9 - Transport          00412000
*                                      Command Control Block (TCCB)     00413000
*                                      address or TIDAL.  See macro     00414000
*                                      IOSDTCCB.                     */ 00415000
*                                                                       00416000
*    3 TCWOutputByteCount FIXED(32), /* Word 10 - Output data byte      00417000
*                                       count                        */ 00418000
*    3 TCWInputByteCount  FIXED(32), /* Word 11 - Input data byte       00419000
*                                       count                        */ 00420000
*                                                                       00421000
*    3 TCWWord12          CHAR(4),   /* Word 12 - Reserved           */ 00422000
*    3 TCWWord13          CHAR(4),   /* Word 13 - Reserved           */ 00423000
*    3 TCWWord14          CHAR(4),   /* Word 14 - Reserved           */ 00424000
*                                                                       00425000
*    3 TCWInterrogateAddr PTR(31);   /* Word 15 - Interrogate TCW       00426000
*                                       address.  Reserved for IOS      00427000
*                                       use only.  Must be set to       00428000
*                                       zero by the builder of the      00429000
*                                       channel program.             */ 00430000
*                                                                       00431000
*/********************************************************************/ 00432000
*/*                                                                  */ 00433000
*/* Constants for TCWFormat                                          */ 00434000
*/*                                                                  */ 00435000
*/********************************************************************/ 00436000
*DECLARE                                                                00437000
*  TCWFormat_0 BIT(2) CONSTANT('00'b), /* Format 0 TCW               */ 00438000
*  TCWFormat_1 BIT(2) CONSTANT('01'b), /* Reserved for future use    */ 00439000
*  TCWFormat_2 BIT(2) CONSTANT('10'b), /* Reserved for future use    */ 00440000
*  TCWFormat_3 BIT(2) CONSTANT('11'b); /* Reserved for future use    */ 00441000
*                                                                       00442000
*/********************************************************************/ 00443000
*/*                                                                  */ 00444000
*/* Constants for TCWTIDAWFormat                                     */ 00445000
*/*                                                                  */ 00446000
*/********************************************************************/ 00447000
*DECLARE                                                                00448000
*  TCWTIDAWFormat_0 BIT(2) CONSTANT('00'b),                             00449000
*                                   /* Format 0 TIDAW                */ 00450000
*  TCWTIDAWFormat_1 BIT(2) CONSTANT('01'b),                             00451000
*                                   /* Reserved for future use       */ 00452000
*  TCWTIDAWFormat_2 BIT(2) CONSTANT('10'b),                             00453000
*                                   /* Reserved for future use       */ 00454000
*  TCWTIDAWFormat_3 BIT(2) CONSTANT('11'b);                             00455000
*                                   /* Reserved for future use       */ 00456000
*                                                                       00457000
*%DCL TIDAW0BASE CHAR;                                                  00458000
*                                                                       00459000
*%IF TIDAW0BASE ^='' %THEN                                              00460000
*  %GOTO TIDAW0DCL;                                                     00461000
*%TIDAW0BASE = 'BASED';                                                 00462000
*%TIDAW0DCL:;                                                           00463000
*/********************************************************************/ 00464000
*/*                                                                  */ 00465000
*/* Format 0 Transport Indirect Address Word (TIDAW)                 */ 00466000
*/*                                                                  */ 00467000
*/********************************************************************/ 00468000
*DECLARE                                                                00469000
*  1 TIDAW0 CHAR(16) TIDAW0BASE BDY(DWORD), /* Format 0 TIDAW        */ 00470000
*    3 TIDAW0_Flags BIT(8),         /* Flags                         */ 00471000
*      5 TIDAW0_Last   BIT(1),      /* This is the last TIDAW for a     00472000
*                                      TCW                           */ 00473000
*      5 TIDAW0_Skip   BIT(1),      /* Skip the transfer of             00474000
*                                      information to main storage      00475000
*                                      during a read, sense-id, or      00476000
*                                      sense operation               */ 00477000
*      5 TIDAW0_DTInt  BIT(1),      /* Data transfer interruption       00478000
*                                      control                       */ 00479000
*      5 TIDAW0_TTIC   BIT(1),      /* TIDAW transfer in channel -      00480000
*                                      the 8-byte address is the        00481000
*                                      starting address of the next     00482000
*                                      TIDAL                         */ 00483000
*      5 TIDAW0_GenCBC BIT(1),      /* For output requests, insert a    00484000
*                                      Checking Block Code (CBC)        00485000
*                                      word after transferring the      00486000
*                                      data represented by this         00487000
*                                      TIDAW.  The setting of this      00488000
*                                      bit is device and command        00489000
*                                      dependent.                    */ 00490000
*      5 *             BIT(3),      /* Reserved                      */ 00491000
*    3 TIDAW0_Rsvd1 CHAR(3),        /* Reserved                      */ 00492000
*    3 TIDAW0_Count FIXED(32),      /* The number of bytes to be        00493000
*                                      transferred                   */ 00494000
*    3 TIDAW0_Addr  PTR(64),        /* Data address                  */ 00495000
*      5 TIDAW0_Addr_High PTR(31),  /* High order word of address    */ 00496000
*      5 TIDAW0_Addr_Low  PTR(31);  /* Low order word of address     */ 00497000
*/* End of PL/X Source                                               */ 00498000
* %IF IOSDTCW_LIST ^= 'NO' &                                            00499000
*    ZCBPRINT ^= 'NO' %THEN                                             00500000
*   %GOTO IOSDTCW_4;                                                    00501000
*   @LIST POP NOECHO;                                                   00502000
* %IOSDTCW_4:;                                                          00503000
* %END;                                                                 00504000
