*%GOTO   DCMIPrlg;               /* IOSDDCMI - Bilingual Mapping        00050000
         MACRO                                                          00100000
         IOSDDCMI                                                       00150000
**/%DCMIPRLG: ;                                                         00200000
*/**** Start of Specifications ***************************************/ 00250000
*/*                                                                  */ 00300000
*/*01* Macro Name:  IOSDDCMI                                         */ 00350000
*/*                                                                  */ 00400000
*/*01* Descriptive Name:  Dynamic Channel Path Management            */ 00433300
*/*                       Information Area                           */ 00466600
*/*                                                                  */ 00500000
*/*02*  Acronym:  DCMI                                               */ 00550000
*/*                                                                  */ 00600000
*/*02*  Dsect Name:  IOSDDCMI                                        */ 00650000
*/*                                                                  */ 00700000
*/*01* Proprietary Statement:                                        */ 00750000
*/*                                                                  */ 00800000
*/*    Licensed materials - Property of IBM                          */ 00850000
*/*    This macro is "RESTRICTED MATERIALS OF IBM"                   */ 00900000
*/*    5694-A01 (C) Copyright IBM Corporation 2001,2002          @L2C*/ 00950000
*/*                                                                  */ 01000000
*/*01* Status: HBB7707                                           @L2C*/ 01050000
*/*                                                                  */ 01100000
*/*01* Component:  I/O Supervisor (SC1C3)                            */ 01150000
*/*                                                                  */ 01200000
*/*01* Function:                                                     */ 01250000
*/*     IOSDDCMI maps the Dynamic Channel Path Management (DCM)      */ 01300000
*/*     information returned by the IOCINFO DCMINFO service.         */ 01350000
*/*                                                                  */ 01650000
*/*01* Eye-Catcher:  DCMI                                            */ 01700000
*/*02*  Offset:      0                                               */ 01750000
*/*02*  Length:      4                                               */ 01800000
*/*                                                                  */ 01850000
*/*01* Created by:  Issuer of IOCINFO DCMINFO service                */ 01900000
*/*                                                                  */ 01950000
*/*01* Deleted by:  Issuer of IOCINFO DCMINFO service                */ 02000000
*/*                                                                  */ 02050000
*/*01* Pointed to by: N/A                                            */ 02100000
*/*                                                                  */ 02150000
*/*01* Size:  32-bytes                                               */ 02200000
*/*                                                                  */ 02250000
*/*01* Module Type:  Mapping Macro                                   */ 02300000
*/*                                                                  */ 02350000
*/*01* Method of Access:                                             */ 02400000
*/*                                                                  */ 02450000
*/*     ASM:  IOSDDCMI                                               */ 02500000
*/*                                                                  */ 02550000
*/*     PL/X:                                                        */ 02600000
*/*         %Dcl DCMIBase CHAR                                       */ 02650000
*/*         %DCMIBase=value                                          */ 02700000
*/*           value = Basing expression.                             */ 02750000
*/*                   DEFAULT='BDY(WORD)'                            */ 02800000
*/*         %INCLUDE SYSLIB(IOSDDCMI)                                */ 02850000
*/*                                                                  */ 02900000
*/*01* Dependencies:  See IOCINFO macro                              */ 02950000
*/*                                                                  */ 03000000
*/*01* Restrictions:  See IOCINFO macro                              */ 03050000
*/*                                                                  */ 03100000
*/*01* Serialization: None                                           */ 03150000
*/*                                                                  */ 03200000
*/*01* Storage Attributes:                                           */ 03250000
*/*                                                                  */ 03300000
*/*02*  Subpool:     User                                            */ 03350000
*/*02*  Key:         User                                            */ 03400000
*/*02*  Data Space:  No                                              */ 03450000
*/*02*  Residency:   31 Bit                                          */ 03500000
*/*02*  Frequency:   One per invocation of IOCINFO DCMInfo           */ 03550000
*/*                                                                  */ 03600000
*/*01* Distribution Library (DLIB):  AMACLIB                         */ 03650000
*/*                                                                  */ 03700000
*/*01* External Classification: PI                                   */ 03750000
*/*01* End of External Classification:                               */ 03800000
*/*                                                                  */ 03850000
*/*01* Change Activity:                                              */ 03900000
*/*                                                                  */ 03950000
*/*  $MAC(IOSDDCMI),COMP(SC1C3):                                     */ 04000000
*/*                                                                  */ 04050000
*/*  Flg Reason  Release Date   Who   Comments                       */ 04100000
*/*  === ======= ======= ====== ====  ============================== */ 04150000
*/*  $L0=DYCHM   JBB7713 000515 PDNO  IOCINFO DCMInfo Support    @L0A*/ 04200000
*/*  $L1=MSWCAS  HBB7706 010427 PDGG  Multi-Switch Cascade       @L1A*/ 04225000
*/*  $L2=SSYNC   HBB7707 011101 PDMM  Switch Synchronization support */ 04231200
*/*                                   Add DCMISwitchTableSynchronized*/ 04237400
*/*                                   Flagged as OA01937         @L2A*/ 04243600
*/*                                                                  */ 04250000
*/*  $P1=PYD0448 JBB7713 001020 PDGG  Add DCMINoDynamicIO bit    @P1A*/ 04275000
*/*  $P2=PYD0512 JBB7713 001117 PDED  Add DCMIDCMInGroup         @P2A*/ 04287500
*/*                                                                  */ 04290600
*/*  $02=OA01937 HBB7707 040227 PDMM  Switch Synchronization support */ 04292900
*/*                                                              @02A*/ 04295200
*/*                                                                  */ 04297500
*/**** End of Specifications *****************************************/ 04300000
*%GOTO DCMIPLX;                     /*                                  04350000
         SPACE 1                                                        04400000
DCMI     DSECT                      DCM information area                04450000
         SPACE 1                                                        04500000
DCMIId           DS    CL4          Eye catcher                         04550000
DCMIVersion      DS    XL1          DCMI version number                 04600000
                 DS    XL3          Available                           04650000
DCMIStatusFlags  DS BL1             DCM status flags                    04700000
DCMIActive          EQU X'80'       When set to 1, indicates that DCM   04750000
*                                   is operational.  When set to 0,     04800000
*                                   indicates that DCM is not           04850000
*                                   operational for one or more of      04900000
*                                   the reasons listed below.           05150000
DCMILocalMono       EQU X'40'       When set to 1, indicates the        05200000
*                                   system is either XCF-local or       05250000
*                                   monoplex.                           05300000
DCMIMultiSystem     EQU X'20'       When set to 1, indicates the        05412500
*                                   system is a member of a             05450000
*                                   multisystem cluster.                05500000
DCMIGoalMode        EQU X'10'       When set to 1, indicates DCM is     05550000
*                                   running in WLM goal mode.  When     05593700
*                                   set to 0, DCM is running in WLM     05637400
*                                   balance mode.                       05681100
*                   EQU X'08'       Available                           05725000
*                   EQU X'04'       Available                           05750000
*                   EQU X'02'       Available                           05800000
*                   EQU X'01'       Available                           05850000
DCMIGlobalReason DS BL1             DCM flags which indicate the        05900000
*                                   reasons why DCM is not              05937500
*                                   operational on any system in        05975000
*                                   the cluster.                        06012500
DCMINoCFConnect     EQU X'80'       When set to 1, indicates DCM is     06050000
*                                   not operational because of a        06100000
*                                   coupling facility connectivity      06150000
*                                   error.                              06200000
DCMINoHSAToken      EQU X'40'       When set to 1, indicates DCM is     06250000
*                                   not operational because there is    06300000
*                                   no HW token or there is an          06350000
*                                   incompatible token in the           06400000
*                                   Hardware System Area (HSA).         06450000
DCMINoMgdCHPIDs     EQU X'20'       When set to 1, indicates DCM is     06500000
*                                   not operational because there       06550000
*                                   are no managed channel paths        06600000
*                                   defined.                            06650000
DCMINoHWFacilities  EQU X'10'       When set to 1, indicates DCM is     06700000
*                                   not operational because DCM         06750000
*                                   facilities are not supported by     06800000
*                                   the hardware.                       06850000
DCMISetOff          EQU X'08'       When set to 1, indicates DCM is     06900000
*                                   not operational because DCM was     06950000
*                                   turned off by a command.            07000000
*                   EQU X'04'       Available                           07050000
*                   EQU X'02'       Available                           07100000
*                   EQU X'01'       Available                           07150000
DCMILocalReason  DS BL1             DCM flags which indicate the        07200000
*                                   reasons why DCM is not fully        07237500
*                                   operational on this system image    07275000
*                                   within a multisystem cluster.       07312500
DCMICHPTError       EQU X'80'       When set to 1, indicates the DCM    07350000
*                                   Channel Path Table (CHPT) could     07400000
*                                   not be built on this system         07450000
*                                   image.                              07500000
DCMISWTBError       EQU X'40'       When set to 1, indicates the DCM    07550000
*                                   Switch Table (SWTB) could not be    07600000
*                                   built on this system image.         07650000
DCMINoMgdSubSystems EQU X'20'       When set to 1, indicates no         07700000
*                                   DCM managed subsystems are defined  07750000
*                                   or visible on this system image.    07800000
DCMINoLPARSecurity  EQU X'10'       When set to 1, indicates LPAR       07850000
*                                   authorization failed for this       07900000
*                                   system image.                       07935000
DCMINoAlgorithms    EQU X'08'       When set to 1, indicates that DCM   07970000
*                                   algorithms cannot run on this       07990000
*                                   system image for one or more of     08010000
DCMINoDynamicIO     EQU X'04'       When set to 1, indicates that       08028000
*                                   dynamic I/O changes to the channel  08046000
*                                   subsystem are not allowed on this   08064000
*                                   image                         @P1C  08082000
DCMIDCMInGroup      EQU X'02'       When set to 1, indicates that the   08104600
*                                   DCM Group has been joined     @P2C  08127200
DCMINNDEError       EQU X'01'       When set to 1, neighbor node        08145400
*                                   descriptor topology has not been    08163600
*                                   built                         @L1C  08181800
DCMILocalReason2 DS BL1             DCM flags which indicate the        08186000
*                                   reasons why DCM is not fully        08190200
*                                   operational on this system image    08194400
*                                   within a multisystem cluster. @02A  08198600
DCMISwitchTableSynchronized EQU X'80' When set to 1, indicates the      08202800
*                                   Switch Table Synchronization        08207000
*                                   completed.                    @02A  08211300
*                   EQU X'40'       Available                     @02A  08215600
*                   EQU X'20'       Available                     @02A  08219900
*                   EQU X'10'       Available                     @02A  08224200
*                   EQU X'08'       Available                     @02A  08228500
*                   EQU X'04'       Available                     @02A  08232800
*                   EQU X'02'       Available                     @02A  08237100
*                   EQU X'01'       Available                     @02A  08241400
         DS    CL20                 Available                     @02C  08245700
         MEND ,                                                     */  08250000
*%DCMIPLX: ;                                                            08300000
*%IF DCMIBase = '' %THEN                                                08350000
*    % DCMIBase = 'Bdy(Word)';                                          08400000
*Declare                                                                08450000
* 1 DCMI DCMIBase,               /* DCM information area             */ 08500000
*   3 DCMIId   Char(4),          /* Eye catcher                      */ 08550000
*   3 DCMIVersion Fixed(8),      /* DCMI version number              */ 08600000
*   3 *        Char(3),          /* Available                        */ 08650000
*   3 DCMIStatusFlags Char(1),   /* DCM status flags                 */ 08700000
*     5 DCMIActive Bit(1),       /* When set to 1, indicates that DCM   08750000
*                                   is operational.  When set to 0,     08800000
*                                   indicates that DCM is not           08850000
*                                   operational for one or more of      08900000
*                                   the reasons listed below.        */ 09150000
*     5 DCMILocalMono Bit(1),    /* When set to 1, indicates the        09200000
*                                   system is either XCF-local or       09250000
*                                   monoplex.                        */ 09300000
*     5 DCMIMultiSystem Bit(1),  /* When set to 1, indicates the        09400000
*                                   system is a member of a             09450000
*                                   multisystem cluster.             */ 09500000
*     5 DCMIGoalMode Bit(1),     /* When set to 1, indicates DCM is     09550000
*                                   running in WLM goal mode.  When     09600000
*                                   set to 0, DCM is running in WLM     09650000
*                                   balance mode.                    */ 09700000
*     5 * Bit(1),                /* Available                        */ 09750000
*     5 * Bit(1),                /* Available                        */ 09800000
*     5 * Bit(1),                /* Available                        */ 09850000
*     5 * Bit(1),                /* Available                        */ 09875000
*   3 DCMIGlobalReason Char(1),  /* DCM flags which indicate the        09900000
*                                   reasons why DCM is not              09937500
*                                   operational on any system in        09975000
*                                   the cluster.                     */ 10012500
*     5 DCMINoCFConnect Bit(1),  /* When set to 1, indicates DCM is     10050000
*                                   not operational because of a        10100000
*                                   coupling facility connectivity      10150000
*                                   error.                           */ 10200000
*     5 DCMINoHSAToken Bit(1),   /* When set to 1, indicates DCM is     10250000
*                                   not operational because there is    10300000
*                                   no HW token or there is an          10350000
*                                   incompatible token in the           10400000
*                                   Hardware System Area (HSA).      */ 10450000
*     5 DCMINoMgdCHPIDs Bit(1),  /* When set to 1, indicates DCM is     10500000
*                                   not operational because there       10550000
*                                   are no managed channel paths        10600000
*                                   defined.                         */ 10650000
*     5 DCMINoHWFacilities Bit(1), /* When set to 1, indicates DCM is   10700000
*                                   not operational because DCM         10750000
*                                   facilities are not supported by     10800000
*                                   the hardware.                    */ 10850000
*     5 DCMISetOff Bit(1),       /* When set to 1, indicates DCM is     10900000
*                                   not operational because DCM was     10950000
*                                   turned off by a command.         */ 11000000
*     5 * Bit(1),                /* Available                        */ 11050000
*     5 * Bit(1),                /* Available                        */ 11100000
*     5 * Bit(1),                /* Available                        */ 11150000
*   3 DCMILocalReason Char(1),   /* DCM flags which indicate the        11200000
*                                   reasons why DCM is not fully        11237500
*                                   operational on this system image    11275000
*                                   within a multisystem cluster.    */ 11312500
*     5 DCMICHPTError Bit(1),    /* When set to 1, indicates the DCM    11350000
*                                   Channel Path Table (CHPT) could     11400000
*                                   not be built on this system         11450000
*                                   image.                           */ 11500000
*     5 DCMISWTBError Bit(1),    /* When set to 1, indicates the DCM    11550000
*                                   Switch Table (SWTB) could not be    11600000
*                                   built on this system image.      */ 11650000
*     5 DCMINoMgdSubSystems Bit(1), /* When set to 1, indicates no      11700000
*                                   DCM managed subsystems are defined  11750000
*                                   or visible on this system image. */ 11800000
*     5 DCMINoLPARSecurity BIT(1), /* When set to 1, indicates LPAR     11850000
*                                   authorization failed for this       11900000
*                                   system image.                    */ 11935000
*     5 DCMINoAlgorithms Bit(1), /* When set to 1, indicates that DCM   11970000
*                                   algorithms cannot run on this       11990000
*                                   system image for one or more of     12010000
*                                   the reasons listed.              */ 12030000
*     5 DCMINoDynamicIO BIT(1),  /* When set to 1, indicates that       12044000
*                                   dynamic I/O changes to the channel  12058000
*                                   subsystem are not allowed on this   12072000
*                                   image                        @P1C*/ 12086000
*     5 DCMIDCMInGroup bit(1),   /* When set to 1, indicates that the   12107300
*                                   DCM Group has been joined    @P2C*/ 12128600
*     5 DCMINNDEError  Bit(1),   /* When set to 1, the neighbor node    12146400
*                                   descriptor topology has not been    12152100
*                                   built                        @L1C*/ 12157800
*   3 DCMILocalReason2 Char(1),  /* DCM flags which indicate the        12163500
*                                   reasons why DCM is not fully        12169200
*                                   operational on this system image    12174900
*                                   within a multisystem cluster.@02A*/ 12180600
*     5 DCMISwitchTableSynchronized bit(1), /* When set to 1,           12186300
*                                   indicates that the Switch Table     12192000
*                                   Synchronization completed.   @02A*/ 12197800
*     5 * Bit(1),                /* Available                    @02A*/ 12203600
*     5 * Bit(1),                /* Available                    @02A*/ 12209400
*     5 * Bit(1),                /* Available                    @02A*/ 12215200
*     5 * Bit(1),                /* Available                    @02A*/ 12221000
*     5 * Bit(1),                /* Available                    @02A*/ 12226800
*     5 * Bit(1),                /* Available                    @02A*/ 12232600
*     5 * Bit(1),                /* Available                    @02A*/ 12238400
*   3 * Char(20);                /* Available                    @02C*/ 12244200
*/********************************************************************/ 12250000
*/* DCMI Eye-Catcher                                                 */ 12300000
*/********************************************************************/ 12350000
*Declare                                                                12400000
* DCMIDcmi Char(4) Constant('DCMI'); /* DCMI Eye-Catcher             */ 12450000
*/********************************************************************/ 12500000
*/* DCMI Version                                                     */ 12550000
*/********************************************************************/ 12600000
*Declare                                                                12650000
* DCMIVersionNumber Fixed(8) Constant(1); /* DCMI Version Number     */ 12700000
