*%GOTO   IOBEPRLG;               /* BILINGUAL MAPPING                   00050000
         MACRO                                                          00100000
         IOSDIOBE                                                       00150000
**/%IOBEPRLG: ;                                                         00200000
*/**** Start of Specifications ***************************************/ 00250000
*/*                                                                  */ 00300000
*/*01* Macro Name:  IOSDIOBE                                         */ 00350000
*/*                                                                  */ 00450000
*/*01* Descriptive Name:  Input/Output Block (IOB) Extension         */ 00500000
*/*                                                                  */ 00600000
*/*02*  Acronym:  IOBE                                               */ 00616600
*/*                                                                  */ 00633200
*/*02*  Dsect Name:  IOSDIOBE                                        */ 00649800
*/*                                                                  */ 00666400
*/*01* Proprietary Statement:                                        */ 00683000
*/*                                                                  */ 00700000
*/*         Licensed materials - Property of IBM                     */ 00750000
*/*         5650-ZOS Copyright IBM Corporation 1984, 2015            */ 00850000
*/*                                                                  */ 00950000
*/*01* Status: HBB77A0                                               */ 01000000
*/*                                                                  */ 01050000
*/*01* Component:  I/O Supervisor (SC1C3)                            */ 01075000
*/*                                                                  */ 01100000
*/*01* Function:                                                     */ 01125000
*/*         An optional control block used by users of EXCP or of    */ 01150000
*/*         the I/O driver interface.  It is used as a communication */ 01200000
*/*         area between the user, IOS and device dependent code     */ 01250000
*/*         such as Error Recovery Procedures (ERPs).                */ 01300000
*/*                                                                  */ 01350000
*/*         For I/O drivers, the IOBE is an extension of the IOSB    */ 01400000
*/*         extension (IOSBE) and is pointed to from the IOSBE via   */ 01450000
*/*         field IOSXIOBE.                                          */ 01500000
*/*                                                                  */ 01550000
*/*         When the IOBE is used by EXCP users, the IOBE is pointed */ 01600000
*/*         to by register 0 at entry to EXCP.  EXCP then saves the  */ 01650000
*/*         address of the IOBE in the Request Queue Element (RQE).  */ 01700000
*/*                                                                  */ 01750000
*/*01* Eye-Catcher:  IOBE                                            */ 01787500
*/*02*  Offset:      0                                               */ 01825000
*/*02*  Length:      4                                               */ 01862500
*/*                                                                  */ 01900000
*/*01* Created by:  Issuer of EXCP or STARTIO                        */ 01950000
*/*                                                                  */ 02000000
*/*01* Deleted by:  Issuer of EXCP or STARTIO                        */ 02050000
*/*                                                                  */ 02150000
*/*01* Pointed to by:  Register 0 at the time of the EXCP            */ 02200000
*/*                    IOSXIOBE for I/O drivers                      */ 02250000
*/*                                                                  */ 02300000
*/*01* Size:  48-bytes                                               */ 02350000
*/*                                                                  */ 02450000
*/*01* Module Type:  N/A                                             */ 02500000
*/*                                                                  */ 02600000
*/*01* Method of Access:                                             */ 02650000
*/*                                                                  */ 02750000
*/*     ASM:  IOSDIOBE                                               */ 02800000
*/*                                                                  */ 02850000
*/*     PL/X:                                                        */ 02900000
*/*         %INCLUDE SYSLIB(IOSDIOBE)                                */ 03800000
*/*                                                                  */ 03850000
*/*         The default storage attribute is BASED.  The             */ 03900000
*/*         storage expression may be overridden using the           */ 03950000
*/*         macro variable %IOBEBASE.                                */ 04000000
*/*                                                                  */ 04050000
*/*         For example,                                             */ 04100000
*/*           %IOBEBASE = 'BASED(IOBEPTR)'                           */ 04150000
*/*                                                                  */ 04200000
*/*           This creates a copy of the IOBE based on IOBEPTR.      */ 04250000
*/*                                                                  */ 04300000
*/*01* Dependencies:  None                                           */ 04350000
*/*                                                                  */ 04400000
*/*01* Restrictions:  None                                           */ 04450000
*/*                                                                  */ 04500000
*/*01* Serialization: None                                           */ 04550000
*/*                                                                  */ 04650000
*/*01* Storage Attributes:                                           */ 04656600
*/*                                                                  */ 04663200
*/*02*  Subpool:     User                                            */ 04669800
*/*02*  Key:         User                                            */ 04676400
*/*02*  Data Space:  No                                              */ 04683000
*/*02*  Residency:   31 Bit                                          */ 04689600
*/*02*  Frequency:   One per EXCP request                            */ 04696200
*/*                                                                  */ 04702800
*/*01* Distribution Library (DLIB):  AMACLIB                         */ 04709400
*/*                                                                  */ 04716000
*/*01* External Classification: GUPI                                 */ 04722600
*/*01* End of External Classification:                               */ 04729200
*/*                                                                  */ 04735800
*/*01* Change Activity:                                              */ 04742400
*/*                                                                  */ 04750000
*/*  $MAC(IOSDIOBE),COMP(SC1C3):                                     */ 04800000
*/*                                                                  */ 04850000
*/*   PN REASON  RELEASE  DATE   ORG   COMMENTS                      */ 04900000
*/*  $L0=OY39007 JBB2220 910331 PDLL: Expanded EXCP interface        */ 04950000
*/*  $L1=HERMS   JBB6607 980302 PDLE: FICON Support              @L1A*/ 04954600
*/*  $L2=64BIT   HBB7703 000901 PDRH: 64-Bit IDAWs                   */ 04959300
*/*  $L3=V64BIT  HBB7705 001025 B7VBGD:64-bit virtual IDAWs      @L3A*/ 04960900
*/*  $L4=IOSHPF  HBB7740 070331 PDDR: High Performance FICON,        */ 04961000
*/*                                   flagged as OA18766             */ 04962000
*/*  $L5=EXVRHPF HBB7780 100331 PDDR: EXCPVR support for zHPF.       */ 04962100
*/*                                   Changes flagged as APAR        */ 04962200
*/*                                   OA33642.                       */ 04962300
*/*                                                                  */ 04962901
*/*                                                                  */ 04963001
*/*  $A4=OA18766 HBB7720 080930 PDHC: High Performance FICON support */ 04963101
*/*                                   - IOBEDCWOffset                */ 04964000
*/*                                   - IOBEResCount                 */ 04965000
*/*                                   - IOBEDCWOffsetValid           */ 04966000
*/*                                   - IOBEResCountValid            */ 04967000
*/*                                   - IOBEDDPCData                 */ 04968000
*/*  $AB=OA50653 HBB7790 170915 PDDR: Synchronous I/O support        */ 04968500
*/*                                                                  */ 04969000
*/*  $01=OY43653 JBB2220 910611 PDLP: Redefine IOBE length           */ 05010600
*/*  $02=OW12682 HBB4420 950715 PDMC: Add flag for posting back on   */ 05010700
*/*                                   E00 abends.                @02A*/ 05010800
*/*  $03=OW38541 HBB6603 990430 PDLE: FICON Support              @03A*/ 05010900
*/*  $04=OW37980 HBB6603 990531 PDLZ: Dynamic PAV Support        @04A*/ 05011000
*/*  $05=OW43557 HBB6606 000503 PDMM: Add IOBEDSMC               @05A*/ 05011100
*/*  $06=OW46454 HBB7703 020409 B7VBGD: Add IOBESIOC for format 1    */ 05011200
*/*                                   EXCP or EXCPVR requests    @06A*/ 05011300
*/*  $07=OA10984 HBB7709 050830 PDMS: MIDAW Support, add             */ 05011400
*/*                                   IOBEMIDA                   @07A*/ 05011500
*/*  $08=OA33642 HBB7760 111101 PDDR: EXCPVR support for zHPF.       */ 05011600
*/*                                   Add IOBEBPER, IOBEZHPF,        */ 05011700
*/*                                   IOBENOIL, IOBERCOD             */ 05011800
*/*  $09=OA34132 HBB7750 100825 PDDR: Add IOBEKeyFlds0               */ 05011900
*/*  $0A=OA37420 HBB7750 111215 PDMF: Add IOBECTKN                   */ 05012000
*/*  $0B=OA38185 HBB7770 121001 PDDR: Comment changes                */ 05012100
*/*  $0D=OA45662 HBB7790 141130 PDSC: Hybrid Data Replication and    */ 05012200
*/*                                   IOBERejDevGrp                  */ 05012300
*/*  $0E=OA46474 HBB7790 151030 PDDR: Add IOBECacheMiss for zHPF     */ 05012400
*/*  $0F=OA50189 HBB7790 161230 PDLX: Add IOBERSUS for Read-Only     */ 05012500
*/*  $0G=OA61131 HBB77B0 210831 PDSK: Consistent Read From Secondary */ 05012604
*/*                                   support                        */ 05012702
*/*                                   - Add IOBECRS                  */ 05012802
*/*                                                                  */ 05012900
*/*  $P1=ME10087 HBB7750 070915 PDSK: Corrected proprietary statement*/ 05013000
*/*                                                              @P1A*/ 05013100
*/*                                                                  */ 05014000
*/**** End of Specifications *****************************************/ 05050000
*%GOTO IOBEPLAS;                    /*                                  05350000
         SPACE 1                                                        05400000
IOBE     DSECT                         Input/Output Block Extension     05450000
         SPACE 1                                                        05500000
IOBEID   DS    CL4                     Eye catcher.                     05550000
IOBEVERS DS    XL1                     Version number.                  05600000
IOBEFLG1 DS    BL1                     Flags field.  The bits in this   05609000
*                                      flag are reserved and are not    05618000
*                                      part of the programming          05627000
*                                      interface.                 @02C  05636000
IOBESPAB EQU   X'80'                   Suppress EXCP abends.  The user  05645000
*                                      requests to be posted back       05654000
*                                      instead of getting abended       05663000
*                                      with a completion code.  (Only   05672000
*                                      valid for E00 abends.)     @02A  05681000
IOBERejDevGrp EQU X'40'                Reject the I/O request if        05690200
*                                      the device is grouped to a       05690500
*                                      remote system              @0DA  05690800
*        EQU   X'3F'                   Reserved                   @0DA  05691100
IOBEFLG2 DS    XL1                     Flag field 2.  The bits in       05691800
*                                      this flag byte are intended      05693600
*                                      for use by the issuer of EXCP    05695400
*                                      to control the execution of the  05697200
*                                      channel program            @03C  05699000
IOBEMIDA EQU   X'80'                   This channel program uses        05701300
*                                      MIDAWs.                    @07A  05701900
IOBEP    EQU   X'40'                   Prefetching of CCWs and data     05702600
*                                      is allowed                 @03A  05703600
IOBECPNM EQU   X'20'                   When set, channel program        05704600
*                                      cannot be modified during        05704800
*                                      execution, other than to add     05705000
*                                      CCWs at the end            @03A  05705200
IOBEEIDA EQU   X'10'                   4K 8-Byte IDAWs            @L2C  05705400
IOBEPCIS EQU   X'08'                   PCI Synchronization:             05705600
*                                      Set on by I/O driver to          05705800
*                                      indicate that the channel must   05706000
*                                      synchronize after the next CCW   05706200
*                                      following the the PCI (CCW+8)    05706400
*                                      when prefetching (IOSP) is       05706600
*                                      also set.                  @03A  05706800
IOBNORWS EQU   X'04'                   No Read/Write Synchronization:   05708000
*                                      Set on by I/O driver to indicate 05709800
*                                      that the channel should not      05711600
*                                      synchronize on read/write        05713400
*                                      transitions when prefetching     05715200
*                                      (IOSP) is also set.  The driver  05717000
*                                      insures that the read and        05718800
*                                      writes are from different I/O    05720600
*                                      buffers                    @03A  05722400
IOB2CSWS EQU   X'02'                   Two Channel Status Words:        05724200
*                                      Set on by the I/O driver to      05726000
*                                      indicate that when CCW prefetch  05727800
*                                      is requested (IOSP), if an error 05729600
*                                      occurs where the control unit    05731400
*                                      executes ahead of the channel,   05733200
*                                      two ending CCW addresses         05735000
*                                      should be presented to the       05736800
*                                      driver.  The second ending       05738600
*                                      CCW address is contained in the  05740400
*                                      IEDB.  If this bit is off,       05742200
*                                      an invalid ending CCW address    05744000
*                                      is simulated by IOS        @03A  05746000
IOBEFMT1 EQU   X'01'                   Format-1 CCWs              @L2C  05748000
IOBEERPM DS    BL1                     Mask indicating the functions    05750000
*                                      the ERP is allowed to perform.   05800000
IOBEPMSG EQU   X'80'                   The user allows basic ERP        05850000
*                                      recovery plus the issuance of    05900000
*                                      permanent error messages that    05950000
*                                      do not require interaction with  06000000
*                                      the system or an operator.       06050000
IOBEBPER EQU   X'40'                   Bypass permanent error           06798800
*                                      recovery.  Indicates that if an  06798900
*                                      error is permanent, the ERP      06799000
*                                      will not issue an IOS000I        06799100
*                                      message, log the error, or       06799200
*                                      perform other actions that the   06799300
*                                      ERP might normally do for a      06799400
*                                      permanent error.  The I/O        06799500
*                                      driver may provide an alternate  06799600
*                                      means of recovery.         @08A  06799700
IOBERSUS EQU   X'20'                   Allow reads to a suspended PPRC  06799900
*                                      secondary device.                06800000
*                                      0=Permit reads while the         06800100
*                                        secondary is Full Duplex.      06800200
*                                      1=Permit reads while the         06800300
*                                        secondary is Full Duplex or    06800400
*                                        Suspended.               @0FA  06800500
*        EQU   X'10'                   Reserved                         06800600
*        EQU   X'08'                   Reserved                         06800700
*        EQU   X'04'                   Reserved                         06800800
*        EQU   X'02'                   Reserved                         06800900
*        EQU   X'01'                   Reserved                         06801000
IOBEUPTR DS    0AL4                    Pointer definition of the user   06801100
*                                      reserved field.                  06801200
IOBEUSER DS    CL4                     Character field reserved for the 06801300
*                                      user's needs.                    06801400
IOBEIEDB DS    0A                      Address of an I/O Error Data     06801500
*                                      Block (IOSDIEDB).           @ABC 06801600
IOBESIEB DS    A                       For synchronous I/O, the address 06801700
*                                      of the synchronous I/O error     06801800
*                                      block (IOSDSIEB)            @ABA 06801900
IOBEFLG3 DS    XL1                     Flag byte 3                 @04A 06802000
IOBENSER EQU   X'80'                   Indicates that the device may    06802100
*                                      bypass the channel program       06802200
*                                      extent collision checking.       06802300
*                                      Extent range enforcement will    06802400
*                                      remain active. (DASD only)  @04A 06802500
IOBENVAL EQU   X'40'                   Indicates that the device is to  06802600
*                                      bypass the validation checking   06802700
*                                      of the paramaters on Define      06802800
*                                      Extent and Locate Record         06802900
*                                      commands.  Extent enforcement    06803000
*                                      remains active. (DASD only) @04A 06803100
IOBEDSMC EQU   X'20'                   Set ON by user to disable        06803200
*                                      Streaming Mode Control for the   06803300
*                                      current I/O operation.      @05A 06803400
IOBEIOT  EQU   X'10'                   When 0, IOBETIME only applies to 06803500
*                                      active requests.  When 1,        06803600
*                                      IOBETIME applies to queued and   06803700
*                                      active requests.            @L3A 06803800
IOBEDCWOffsetValid  EQU  X'08'         The value in IOBEDCWOffset       06803900
*                                      is valid.  Must be set to zero   06804000
*                                      by the driver.              @A4A 06804100
IOBEResCountValid   EQU  X'04'         The value in IOBEResCount        06804200
*                                      is valid.  Must be set to zero   06804300
*                                      by the driver.              @A4A 06804400
IOBEKeyFlds0 EQU X'02'                 Key fields contain zero     @09A 06804500
IOBENOIL EQU   X'01'                   For system use              @08A 06804600
IOBESIOC DS    C                       SIO condition code for format    06804700
*                                      1 EXCP/EXCPVR requests      @06A 06804800
IOBETIME DS    XL1                     Only honored when the DEB        06804900
*                                      indicates the dataset was opened 06805000
*                                      for input.                       06805100
*                                      When non-0, this is the          06805200
*                                      maximum time value, in seconds,  06805300
*                                      that the EXCP allows before an   06805400
*                                      MIH condition is declared,       06805500
*                                      regardless of the MIH setting    06805600
*                                      for the device or whether MIH is 06805700
*                                      is being bypassed.  No message   06805800
*                                      or logrec entry will be created  06805900
*                                      when the condition occurs.  @L3C 06806000
IOBEFLG4 DS    XL1                 Flag byte 4                     @08C 06806100
IOBEZHPF EQU   X'80'               zHPF channel program - used for      06806200
*                                  EXCPVR and EXCP virtual requests     06806300
*                                                                  @0BC 06806400
IOBECacheMiss EQU X'40'            One or more I/O device cache misses  06806500
*                                  occurred during this I/O operation.  06806600
*                                  This bit is valid only for zHPF I/O  06806700
*                                  requests.  It must be set to zero    06806800
*                                  by the driver.                  @0EA 06806900
*                                                                       06807000
IOBESynIO_Elig EQU X'20'           Set by the I/O driver to indicate    06807100
*                                  the I/O request is eligible for      06807200
*                                  (would benefit from) synchronous     06807300
*                                  I/O (zHyperlink).  This flag is      06807400
*                                  set if the caller of the I/O         06807500
*                                  driver indicated it will support     06807600
*                                  synchronous I/O in the future for    06807700
*                                  this I/O request, or if the caller   06807800
*                                  currently supports synchronous I/O   06807900
*                                  but the function is disabled for     06808000
*                                  the device.                     @ABA 06808100
IOBECRS        EQU X'10'           Set by the I/O driver to indicate    06808201
*                                  that consistent read from secondary  06808301
*                                  is requested                    @0GA 06808402
*                                                                       06808501
IOBEResCount   DS    XL4           Residual count for FCX.  Must be     06808601
*                                  set to zero by the driver       @A4A 06808701
IOBESynIO_RC   EQU   IOBEResCount+0,2                                   06808801
*                                  Synchronous I/O response code.       06808901
*                                  See macro IHASIRC               @ABA 06809001
IOBESynIO_RCQ  EQU   IOBEResCount+2,2                              @ABA 06809101
*                                  Synchronous I/O response code   @ABA 06809201
*                                  qualifier.  See macro IHASIRC.  @ABA 06809301
IOBEDCWOffset  DS    XL2           Offset of the last executed DCW      06809401
*                                  within the DCW list.  Valid only     06809501
*                                  when IOBEDCWOffsetValid is on.  Must 06809601
*                                  be set to zero by the driver.   @A4A 06809701
IOBESynIO_Token EQU  IOBEDCWOffset,2                                    06809801
*                                  Synchronous I/O token           @ABA 06809901
IOBEDDPC_Data  DS    0XL2          Device dependent program check       06810001
*                                  data                            @A4A 06810101
IOBEDDPC_RC    DS    XL1           Reason code                     @A4A 06810201
IOBEDDPC_RCQ   DS    XL1           First byte of reason code qualifier  06810301
*                                  information                     @A4A 06810401
*                                                                       06810501
IOBERCOD DS    XL1                 I/O completion reason code for       06810601
*                                  EXCPVR and EXCP requests        @0BC 06810701
IOBESMMK DS    XL1                 Software mirroring mask bits    @0DA 06810801
         DS    CL14                Reserved                        @0DC 06810901
IOBECTKN DS    A                   Pointer to I/O configuration         06811001
*                                  token                           @0AA 06811101
IOBEEND  EQU   *                   End of IOBE.                         06812001
IOBELNTH EQU   IOBEEND-IOBE        Length of IOBE.                 @01C 06850000
IOBEVRSC EQU   1                   Version number.                      06900000
         MEND ,                                                     */  06950000
*%IOBEPLAS: ;                                                           07000000
*                                                                       07010000
*%DCL ASAXMAC_ISITPLX CHAR EXT;     /* Will be set to YES if PLX        07020000
*                                      compiler                  @A4A*/ 07020100
*?ASAXMAC IsItPLX;                  /* Determine if PLX compile  @A4A*/ 07020200
*                                                                       07040000
*%IF IOBEBASE = '' %THEN                                                07050000
*    % IOBEBASE = 'BASED';                                              07100000
*DCL 1 IOBE IOBEBASE,               /* Input/Output Block Extension. */ 07150000
*      3 IOBEID   CHAR(4),          /* Eye catcher.                  */ 07200000
*      3 IOBEVERS FIXED(8),         /* Version number.               */ 07250000
*      3 IOBEFLG1 BIT(8),           /* Flags field.  The bits in        07263600
*                                      this flag are reserved and       07277200
*                                      are not part of the              07290800
*                                      programming interface.    @02C*/ 07304400
*        5 IOBESPAB BIT(1),         /* Suppress EXCP abends.  The       07318000
*                                      user request to be posted back   07331600
*                                      instead of getting abended       07345200
*                                      with a completion code.  (Only   07358800
*                                      valid for E00 abends.)    @02A*/ 07372400
*        5 IOBERejDevGrp BIT(1),    /* Reject the I/O request if        07386200
*                                      the device is grouped to a       07386500
*                                      remote system             @0DA*/ 07386800
*        5 *        BIT(6),         /* Reserved                  @0DC*/ 07387100
*      3 IOBEFLG2 CHAR(1),          /* Flag field 2.  The bits in       07387900
*                                      this flag byte are intended      07389800
*                                      for use by the issuer of EXCP    07391700
*                                      to control the execution of the  07393600
*                                      channel program           @03C*/ 07395500
*        5 IOBEMIDA BIT(1),         /* This channel program uses        07397900
*                                      MIDAWs.                   @07A*/ 07398500
*        5 IOBEP    BIT(1),         /* Prefetching of CCWs and data     07399300
*                                      is allowed                @03A*/ 07400300
*        5 IOBECPNM BIT(1),         /* When set, channel program        07401400
*                                      cannot be modified during        07401600
*                                      execution, other than to add     07401800
*                                      CCWs at the end           @03A*/ 07402000
*        5 IOBEEIDA BIT(1),         /* 4K 8-byte IDAWs           @L2C*/ 07402200
*        5 IOBEPCIS BIT(1),         /* PCI Synchronization:             07402400
*                                      Set on by I/O driver to          07402600
*                                      indicate that the channel must   07402800
*                                      synchronize after the next CCW   07403000
*                                      following the the PCI (CCW+8)    07403200
*                                      when prefetching (IOSP) is       07403400
*                                      also set.                 @03A*/ 07403600
*        5 IOBNORWS BIT(1),         /* No Read/Write Synchronization:   07405000
*                                      Set on by I/O driver to indicate 07406900
*                                      that the channel should not      07408800
*                                      synchronize on read/write        07410700
*                                      transitions when prefetching     07412600
*                                      (IOSP) is also set.  The driver  07414500
*                                      insures that the read and        07416400
*                                      writes are from different I/O    07418300
*                                      buffers                   @03A*/ 07420200
*        5 IOB2CSWS BIT(1),         /* Two Channel Status Words:        07422100
*                                      Set on by the I/O driver to      07424000
*                                      indicate that when CCW prefetch  07425900
*                                      is requested (IOSP), if an error 07427800
*                                      occurs where the control unit    07429700
*                                      executes ahead of the channel,   07431600
*                                      two ending CCW addresses         07433500
*                                      should be presented to the       07435400
*                                      driver.  The second ending       07437300
*                                      CCW address is contained in the  07439200
*                                      IEDB.  If this bit is off,       07441100
*                                      an invalid ending CCW address    07443000
*                                      is simulated by IOS       @03A*/ 07445300
*        5 IOBEFMT1 BIT(1),         /* Format-1 Channel Program  @L2C*/ 07447600
*      3 IOBEERPM BIT(8),           /* Mask indicating the functions    07450000
*                                      the ERP is allowed to perform */ 07500000
*        5 IOBEPMSG BIT(1),         /* The user allows basic ERP        07550000
*                                      recovery plus the issuance of    07600000
*                                      permanent error messages that    07650000
*                                      do not require interaction with  07700000
*                                      the system or an operator.    */ 07750000
*        5 IOBEBPER BIT(1),         /* Bypass permanent error recovery. 07760000
*                                      Indicates that if an error is    07770000
*                                      permanent, the ERP will not      07780000
*                                      issue an IOS000I message, log    07790000
*                                      the error, or perform other      07791000
*                                      actions that the ERP might       07792000
*                                      normally do for a permanent      07793000
*                                      error.  The I/O driver may       07794000
*                                      provide an alternate means of    07795000
*                                      recovery.                 @08A*/ 07796000
*        5 IOBERSUS BIT(1),         /* Allow reads to a suspended PPRC  07804900
*                                      secondary device.                07809900
*                                      0=Permit reads while the         07814900
*                                        secondary is Full Duplex.      07819900
*                                      1=Permit reads while the         07824900
*                                        secondary is Full Duplex or    07829900
*                                        Suspended.              @0FA*/ 07834900
*        5 *      BIT(5),           /* Reserved.                 @0FC*/ 07839900
*      3 IOBEUPTR PTR(31),          /* Pointer definition of the user's 07850000
*                                      reserved field.               */ 07900000
*        5 IOBEUSER CHAR(4),        /* Character field reserved for the 07950000
*                                      user's needs.                 */ 08000000
*      3 IOBEIEDB PTR(31),          /* Address of an I/O Error Data     08050000
*                                      Block (IOSDIEDB)              */ 08100900
*        5 IOBESIEB PTR(31),        /* For synchronous I/O, the address 08101900
*                                      of the synchronous I/O error     08102900
*                                      block (IOSDSIEB)          @ABA*/ 08103900
*      3 IOBEFLG3 BIT(8),           /* Flag byte 3               @04A*/ 08105800
*        5 IOBENSER BIT(1),         /* Indicates that the device may    08111600
*                                      bypass the channel program       08117400
*                                      extent collision checking.       08123200
*                                      Extent range enforcement will    08129000
*                                      remain active. (DASD only)       08134800
*                                                                @04A*/ 08140600
*        5 IOBENVAL BIT(1),         /* Indicates that the device is to  08146400
*                                      bypass the validation checking   08152200
*                                      of the paramaters on Define      08158000
*                                      Extent and Locate Record         08163800
*                                      commands.  Extent enforcement    08169600
*                                      remains active. (DASD only)      08175400
*                                                                @04A*/ 08181200
*        5 IOBEDSMC BIT(1),         /* Set ON by user to disable        08183500
*                                      Streaming Mode Control for the   08185800
*                                      current I/O operation.    @05A*/ 08188100
*        5 IOBEIOT  BIT(1),         /* When 0, IOBETIME only applies to 08188600
*                                      active requests.  When 1,        08189100
*                                      IOBETIME applies to queued and   08189600
*                                      active requests.          @L3A*/ 08190100
*%IF ASAXMAC_ISITPLX ^= 'YES' %THEN %GOTO NONPLX1;                      08190300
*        5 IOBEDCWOffsetValid BIT(1), /* The value in IOBEDCWOffset     08190400
*                                      is valid.  Must be set to zero   08190500
*                                      by the driver.            @A4A*/ 08190600
*        5 IOBEResCountValid BIT(1),  /* The value in IOBEResCount      08190700
*                                      is valid.  Must be set to zero   08190800
*                                      by the driver.            @A4A*/ 08190900
*        5 IOBEKeyFlds0 BIT(1),     /* Key fields contain zero   @09A*/ 08191000
*        5 IOBENOIL BIT(1),         /* For system use            @08A*/ 08191200
*%GOTO COMM1;                                                           08191600
*%NONPLX1:;                                                             08191700
*        5 *        BIT(4),         /* Reserved                  @L3C*/ 08191800
*%COMM1:;                                                               08191900
*      3 IOBESIOC CHAR(1),          /* SIO condition code for format    08192000
*                                      1 EXCP/EXCPVR requests    @06A*/ 08192100
*      3 IOBETIME FIXED(8),         /* Only honored when the DEB        08192200
*                                      indicates the dataset was opened 08192600
*                                      for input.                       08193100
*                                      When non-0, this is the          08193600
*                                      maximum time value, in seconds,  08194100
*                                      that the EXCP allows before an   08194600
*                                      MIH condition is declared,       08195100
*                                      regardless of the MIH setting    08195600
*                                      for the device or whether MIH is 08196100
*                                      is being bypassed.  No message   08196600
*                                      or logrec entry will be created  08197100
*                                      when the condition occurs.       08197600
*                                                                @L3C*/ 08198100
*      3 IOBEFLG4 BIT(8),           /* Flag byte 4               @08C*/ 08198200
*        5 IOBEZHPF BIT(1),         /* zHPF channel program - used      08198300
*                                      for EXCPVR and EXCP virtual      08198400
*                                      requests                  @0BC*/ 08198500
*%IF ASAXMAC_ISITPLX ^= 'YES' %THEN %GOTO NONPLX2;                      08199700
*        5 IOBECacheMiss BIT(1),    /* One or more I/O device cache     08199800
*                                      misses occurred during this I/O  08199900
*                                      operation.  This bit is valid    08200000
*                                      only for zHPF I/O requests.  It  08200100
*                                      must be set to zero by the       08200200
*                                      driver.                   @0EA*/ 08200300
*        5 IOBESynIO_Elig BIT(1),   /* Set by the I/O driver to         08200400
*                                      indicate the I/O request is      08200500
*                                      eligible for (would benefit      08200600
*                                      from) synchronous I/O            08200700
*                                      (zHyperlink).  This flag is      08200800
*                                      set if the caller of the I/O     08200900
*                                      driver indicated it will         08201000
*                                      support synchronous I/O in the   08201100
*                                      future for this I/O request,     08201200
*                                      or if the caller currently       08201300
*                                      supports synchronous I/O but     08201400
*                                      the function is disabled for     08201500
*                                      the device.               @ABA*/ 08201600
*        5 IOBECRS BIT(1),          /* Set by the I/O driver to         08201702
*                                      indicate that consistent read    08201801
*                                      from secondary is requested      08201901
*                                                                @0GA*/ 08202002
*        5 * BIT(4),                /* Reserved                  @0GC*/ 08202103
*                                                                       08202201
*      3 IOBEResCount  FIXED(32),   /* Residual count for FCX.          08202301
*                                      Must be set to zero by the       08202401
*                                      driver.                   @A4A*/ 08202501
*        5 IOBESynIO_RC FIXED(16),  /* Synchronous I/O response code.   08202601
*                                      See macro IHASIRC.        @ABA*/ 08202701
*        5 IOBESynIO_RCQ FIXED(16), /* Synchronous I/O response code    08202801
*                                      qualifier.  See macro IHASIRC.   08202901
*                                                                @ABA*/ 08203001
*      3 IOBEDCWOffset FIXED(16),   /* Offset of the last executed      08203101
*                                      DCW within the DCW list.  Valid  08203201
*                                      only when IOBEDCWOffsetValid     08203301
*                                      is on.  Must be set to zero      08203401
*                                      by the driver.            @A4A*/ 08203501
*        5 IOBESynIO_Token FIXED(16), /* Synchronous I/O token   @ABA*/ 08203601
*      3 IOBEDDPC_Data,             /* Device dependent program         08203701
*                                      check data                @A4A*/ 08203801
*        5 IOBEDDPC_RC FIXED(8),    /* Reason code               @A4A*/ 08203901
*        5 IOBEDDPC_RCQ FIXED(8),   /* First byte of reason code        08204001
*                                      qualifier information     @A4A*/ 08204101
*                                                                       08204201
*      3 IOBERCOD FIXED(8),         /* I/O completion reason code for   08204301
*                                      EXCPVR and EXCP requests  @0BC*/ 08204401
*      3 IOBESMMK BIT(8),           /* Software mirroring mask bits     08204501
*                                                                @0DA*/ 08204601
*      3 *        CHAR(14),         /* Reserved.                 @0DC*/ 08204701
*%GOTO COMM2;                                                           08204801
*%NONPLX2:;                                                             08204901
*      3 *        CHAR(24),         /* Reserved.                 @0AC*/ 08205001
*%COMM2:;                                                               08205101
*      3 IOBECTKN PTR(31);          /* Pointer to IO configuration      08206001
*                                      token                     @0AA*/ 08207000
*                                                                       08210000
*/********************************************************************/ 08220000
*/*                                                                  */ 08230000
*/* Eye catcher, version, and length constants.                      */ 08240000
*/*                                                              @A4A*/ 08241000
*/********************************************************************/ 08242000
*DCL IOBEIDC   CHAR(4) CONSTANT('IOBE'); /* Eye catcher constant.    */ 08250000
*DCL IOBEVRSC  FIXED(8) CONSTANT(1); /* Version number.              */ 08300000
*DCL IOBELNTH  FIXED(31) CONSTANT(LENGTH(IOBE)); /* Length of the IOBE  08350000
*                                                                    */ 08400000
