*%GOTO   IEDBPRLG;               /* BILINGUAL MAPPING                   00010000
         MACRO                                                          00020000
         IOSDIEDB                                                       00030000
**/%IEDBPRLG: ;                                                         00040000
*/*** Start of Specifications ****************************************/ 00050000
*/*                                                                  */ 00060000
*/*01* Macro Name: IOSDIEDB                                          */ 00070000
*/*                                                                  */ 00080000
*/*01* Descriptive Name: I/O Error Data Block                        */ 00090000
*/*                                                                  */ 00100000
*/*02*   Acronym:  IEDB                                              */ 00110000
*/*                                                                  */ 00120000
*/*02*   Dsect Name: IOSDIEDB                                        */ 00130000
*/*                                                                  */ 00140000
*/*01* Proprietary Statement:                                        */ 00150000
*/*                                                                  */ 00160000
*/*         Licensed materials - Property of IBM                     */ 00170000
*/*         5694-A01 Copyright IBM Corporation 1991, 2011            */ 00180000
*/*                                                                  */ 00190000
*/*01* Status = HBB7780                                              */ 00200000
*/*                                                                  */ 00210000
*/*01* Component: I/O Supervisor (SC1C3)                             */ 00220000
*/*                                                                  */ 00230000
*/*01* Function:                                                     */ 00240000
*/*                                                                  */ 00250000
*/*      The IEDB is an optional control block used by users of      */ 00260000
*/*      EXCP or of the I/O driver interface.  EXCP uses this block  */ 00270000
*/*      to save error data related to an EXCP request.  This data   */ 00280000
*/*      is obtained from the ERP Work Area (EWA).                   */ 00290000
*/*                                                                  */ 00300000
*/*      I/O drivers may use this for the same reason, i.e., to      */ 00310000
*/*      save data from one exit to another even after the EWA has   */ 00320000
*/*      been freed.  However, like EXCP, the I/O driver's normal    */ 00330000
*/*      or abnormal exit is expected to set the data in this field  */ 00340000
*/*      from the EWA.  IOS does not provide this data for the       */ 00350000
*/*      user.                                                       */ 00360000
*/*                                                                  */ 00370000
*/*      The IEDB can be either 48 or 96 bytes in length.  If a 48   */ 00380000
*/*      byte IEDB is provided, the version number must be set to    */ 00390000
*/*      one (IEDBVRSC).  If a 96 byte IEDB is provided, the         */ 00400000
*/*      version number must be set to two (IEDBVRS2).           @L3C*/ 00410000
*/*                                                                  */ 00420000
*/*                                                                  */ 00430000
*/*01* Eye-Catcher: IEDB                                             */ 00440000
*/*02*   Offset:    0                                                */ 00450000
*/*02*   Length:    4                                                */ 00460000
*/*                                                                  */ 00470000
*/*01* Created by:  Issuer of EXCP or STARTIO                        */ 00480000
*/*                                                                  */ 00490000
*/*01* Deleted by:  Issuer of EXCP or STARTIO                        */ 00500000
*/*                                                                  */ 00510000
*/*01* Pointed to by:  IOBEIEDB for EXCP or STARTIO                  */ 00520000
*/*                                                                  */ 00530000
*/*01* Size:  48 or 96 bytes                                     @L3C*/ 00540000
*/*                                                                  */ 00550000
*/*01* Module Type:  Mapping Macro                                   */ 00560000
*/*                                                                  */ 00570000
*/*01* Method of access                                              */ 00580000
*/*                                                                  */ 00590000
*/*         ASM:  IOSDIEDB                                           */ 00600000
*/*                                                                  */ 00610000
*/*         PL/X:                                                    */ 00620000
*/*                                                                  */ 00630000
*/*         %INCLUDE SYSLIB(IOSDIEDB)                                */ 00640000
*/*                                                                  */ 00650000
*/*         The default storage attribute is BASED.  The             */ 00660000
*/*         storage expression may be overridden using the           */ 00670000
*/*         macro variable %IEDBBASE.                                */ 00680000
*/*                                                                  */ 00690000
*/*         For example,                                             */ 00700000
*/*           %IEDBBASE = 'BASED(IEDBPTR)'                           */ 00710000
*/*                                                                  */ 00720000
*/*           This creates a mapping of the IEDB based on IEDBPTR.   */ 00730000
*/*                                                                  */ 00740000
*/*01* Dependencies:  None                                           */ 00750000
*/*                                                                  */ 00760000
*/*01* Restrictions:  None                                           */ 00770000
*/*                                                                  */ 00780000
*/*01* Serialization: None                                           */ 00790000
*/*                                                                  */ 00800000
*/*01* Storage Attributes:                                           */ 00810000
*/*02*  Subpool:     User                                            */ 00820000
*/*02*  Key:         User                                            */ 00830000
*/*02*  Data Space:  No                                              */ 00840000
*/*02*  Residency:   Any                                             */ 00850000
*/*02*  Frequency:   One per EXCP                                    */ 00860000
*/*                                                                  */ 00870000
*/*01* Distribution Library (DLIB):  AMACLIB                         */ 00880000
*/*                                                                  */ 00890000
*/*01* External Classification: GUPI                                 */ 00900000
*/*01* End of External Classification:                               */ 00910000
*/*                                                                  */ 00920000
*/*01* Change Activity:                                              */ 00930000
*/*                                                                  */ 00940000
*/*  $MAC(IOSDIEDB),COMP(SC1C3):                                     */ 00950000
*/*                                                                  */ 00960000
*/*   PN REASON  RELEASE  DATE  ORG   COMMENTS                       */ 00974990
*/*  $L0=OY39007 JBB2220 910331 PDLL: Expanded EXCP interface        */ 00980000
*/*  $L1=HERMS   JBB6607 980302 PDLE  FICON Support              @L1A*/ 00990000
*/*  $L2=EXVRHPF HBB7780 100331 PDDR  EXCPVR support for zHPF.       */ 01000000
*/*                                   Changes flagged as APAR        */ 01010000
*/*                                   OA33642.                       */ 01020000
*/*                                                                  */ 01030000
*/*  $01=OW38541 HBB6603 990430 PDLE: FICON support              @01A*/ 01040000
*/*  $02=OA33642 HBB7760 111101 PDDR  EXCPVR support for zHPF.       */ 01054990
*/*                                   Add IEDBFSAV and version 2     */ 01060000
*/*                                   section of the IEDB.           */ 01070000
*/*                                                                  */ 01080000
*/*** End of Specifications ******************************************/ 01090000
*%GOTO IEDBPLAS;                    /*                                  01100000
         SPACE 1                                                        01110000
IEDB     DSECT                         I/O Error Data Block             01120000
         SPACE 1                                                        01130000
IEDBID   DS    CL4                     Eye catcher.  Must be IEDB.      01140000
IEDBVERS DS    XL1                     Version number.                  01150000
IEDBFLG1 DS    BL1                     Flags field.                     01160000
IEDBBDSN EQU   X'80'                   The sense data was determined to 01170000
*                                      be invalid and contains '10FE'x. 01180000
IEDBFSAV EQU   X'40'                   The failing storage address      01190000
*                                      in IEDBFSA is valid         @02C 01200000
*        EQU   X'20'                   Reserved                         01210000
*        EQU   X'10'                   Reserved                         01220000
*        EQU   X'08'                   Reserved                         01230000
*        EQU   X'04'                   Reserved                         01240000
*        EQU   X'02'                   Reserved                         01250000
*        EQU   X'01'                   Reserved                         01260000
IEDBCOD  DS    CL1                     I/O completion code field.  This 01270000
*                                      is the original completion code  01280000
*                                      prior to EXCP changing it.       01290000
         DS    CL1                     Reserved.                        01300000
IEDBSNS  DS    0CL32                   Sense data.                      01310000
IEDBSN00 DS    CL1                     Sense byte 0.                    01320000
IEDBSN01 DS    CL1                     Sense byte 1.                    01330000
IEDBSN02 DS    CL1                     Sense byte 2.                    01340000
IEDBSN03 DS    CL1                     Sense byte 3.                    01350000
IEDBSN04 DS    CL1                     Sense byte 4.                    01360000
IEDBSN05 DS    CL1                     Sense byte 5.                    01370000
IEDBSN06 DS    CL1                     Sense byte 6.                    01380000
IEDBSN07 DS    CL1                     Sense byte 7.                    01390000
IEDBSN08 DS    CL1                     Sense byte 8.                    01400000
IEDBSN09 DS    CL1                     Sense byte 9.                    01410000
IEDBSN10 DS    CL1                     Sense byte 10.                   01420000
IEDBSN11 DS    CL1                     Sense byte 11.                   01430000
IEDBSN12 DS    CL1                     Sense byte 12.                   01440000
IEDBSN13 DS    CL1                     Sense byte 13.                   01450000
IEDBSN14 DS    CL1                     Sense byte 14.                   01460000
IEDBSN15 DS    CL1                     Sense byte 15.                   01470000
IEDBSN16 DS    CL1                     Sense byte 16.                   01480000
IEDBSN17 DS    CL1                     Sense byte 17.                   01490000
IEDBSN18 DS    CL1                     Sense byte 18.                   01500000
IEDBSN19 DS    CL1                     Sense byte 19.                   01510000
IEDBSN20 DS    CL1                     Sense byte 20.                   01520000
IEDBSN21 DS    CL1                     Sense byte 21.                   01530000
IEDBSN22 DS    CL1                     Sense byte 22.                   01540000
IEDBSN23 DS    CL1                     Sense byte 23.                   01550000
IEDBSN24 DS    CL1                     Sense byte 24.                   01560000
IEDBSN25 DS    CL1                     Sense byte 25.                   01570000
IEDBSN26 DS    CL1                     Sense byte 26.                   01580000
IEDBSN27 DS    CL1                     Sense byte 27.                   01590000
IEDBSN28 DS    CL1                     Sense byte 28.                   01600000
IEDBSN29 DS    CL1                     Sense byte 29.                   01610000
IEDBSN30 DS    CL1                     Sense byte 30.                   01620000
IEDBSN31 DS    CL1                     Sense byte 31.                   01630000
         DS    CL4                     Reserved for future CSW          01640000
*                                      expansion                  @01C  01650000
IEDB2CSW DS    F                       If the I/O requestor allowed     01660000
*                                      prefetching of CCWs and data     01670000
*                                      (IOBEP/IOSP) and specified       01680000
*                                      that it wants to see both the    01690000
*                                      channel and CU ending CCW        01700000
*                                      address for errors that occur    01710000
*                                      when the CU executes ahead of    01720000
*                                      the channel and the 2nd CCW      01730000
*                                      address is valid, this field     01740000
*                                      contains the virtual CCW         01750000
*                                      address of the last CCW          01760000
*                                      executed by the control          01770000
*                                      unit                       @01C  01780000
IEDBEND  EQU   *                       End of version 1 IEDB      @02C  01790000
IEDBLNTH EQU   IEDBEND-IEDB            Length of version 1 IEDB   @02C  01800000
*                                                                       01810000
IEDB2    DS    0F                      Start of version 2 IEDB    @02A  01820000
IEDBFSA  DS    0XL8                    Failing storage address (FSA)    01830000
*                                                                 @02A  01840000
IEDBFSAH DS    F                       High order word of FSA     @02A  01850000
IEDBFSAL DS    F                       Low order word of FSA      @02A  01860000
IEDB2RSV DS    XL40                    Reserved                   @02A  01870000
IEDB2END EQU   *                       End of version 2 IEDB      @02C  01880000
IEDB2LEN EQU   IEDB2END-IEDB           Length of version 2 IEDB   @02C  01890000
*                                                                       01900000
IEDBVRSC EQU   1                       Version number 1           @02C  01910000
IEDBVRS2 EQU   2                       Version number 2           @02A  01920000
         MEND ,                                                      */ 01930000
*%IEDBPLAS: ;                                                           01940000
*%IF IEDBBASE = '' %THEN                                                01950000
*    % IEDBBASE = 'BASED';                                              01960000
*DCL 1 IEDB IEDBBASE,               /* I/O Error Data Block.         */ 01970000
*      3 IEDBID   CHAR(4),          /* Eye catcher.                  */ 01980000
*      3 IEDBVERS FIXED(8),         /* Version number.               */ 01990000
*      3 IEDBFLG1 BIT(8),           /* Flags field.                  */ 02000000
*        5 IEDBBDSN BIT(1),         /* The sense data was determined to 02010000
*                                      be invalid and contains '10FE'x. 02020000
*                                                                    */ 02030000
*        5 IEDBFSAV BIT(1),         /* The failing storage address in   02040000
*                                      IEDBFSA is valid          @02A*/ 02050000
*        5 *        BIT(6),         /* Reserved.                 @02C*/ 02060000
*      3 IEDBCOD  CHAR(1),          /* I/O completion code field.  This 02070000
*                                      is the original completion code  02080000
*                                      prior to EXCP changing it.    */ 02090000
*      3 *        CHAR(1),          /* Reserved.                     */ 02100000
*      3 IEDBSNS  CHAR(32),         /* Sense data.                   */ 02110000
*        5 IEDBSN00 CHAR(1),        /* Sense byte 0.                 */ 02120000
*        5 IEDBSN01 CHAR(1),        /* Sense byte 1.                 */ 02130000
*        5 IEDBSN02 CHAR(1),        /* Sense byte 2.                 */ 02140000
*        5 IEDBSN03 CHAR(1),        /* Sense byte 3.                 */ 02150000
*        5 IEDBSN04 CHAR(1),        /* Sense byte 4.                 */ 02160000
*        5 IEDBSN05 CHAR(1),        /* Sense byte 5.                 */ 02170000
*        5 IEDBSN06 CHAR(1),        /* Sense byte 6.                 */ 02180000
*        5 IEDBSN07 CHAR(1),        /* Sense byte 7.                 */ 02190000
*        5 IEDBSN08 CHAR(1),        /* Sense byte 8.                 */ 02200000
*        5 IEDBSN09 CHAR(1),        /* Sense byte 9.                 */ 02210000
*        5 IEDBSN10 CHAR(1),        /* Sense byte 10.                */ 02220000
*        5 IEDBSN11 CHAR(1),        /* Sense byte 11.                */ 02230000
*        5 IEDBSN12 CHAR(1),        /* Sense byte 12.                */ 02240000
*        5 IEDBSN13 CHAR(1),        /* Sense byte 13.                */ 02250000
*        5 IEDBSN14 CHAR(1),        /* Sense byte 14.                */ 02260000
*        5 IEDBSN15 CHAR(1),        /* Sense byte 15.                */ 02270000
*        5 IEDBSN16 CHAR(1),        /* Sense byte 16.                */ 02280000
*        5 IEDBSN17 CHAR(1),        /* Sense byte 17.                */ 02290000
*        5 IEDBSN18 CHAR(1),        /* Sense byte 18.                */ 02300000
*        5 IEDBSN19 CHAR(1),        /* Sense byte 19.                */ 02310000
*        5 IEDBSN20 CHAR(1),        /* Sense byte 20.                */ 02320000
*        5 IEDBSN21 CHAR(1),        /* Sense byte 21.                */ 02330000
*        5 IEDBSN22 CHAR(1),        /* Sense byte 22.                */ 02340000
*        5 IEDBSN23 CHAR(1),        /* Sense byte 23.                */ 02350000
*        5 IEDBSN24 CHAR(1),        /* Sense byte 24.                */ 02360000
*        5 IEDBSN25 CHAR(1),        /* Sense byte 25.                */ 02370000
*        5 IEDBSN26 CHAR(1),        /* Sense byte 26.                */ 02380000
*        5 IEDBSN27 CHAR(1),        /* Sense byte 27.                */ 02390000
*        5 IEDBSN28 CHAR(1),        /* Sense byte 28.                */ 02400000
*        5 IEDBSN29 CHAR(1),        /* Sense byte 29.                */ 02410000
*        5 IEDBSN30 CHAR(1),        /* Sense byte 30.                */ 02420000
*        5 IEDBSN31 CHAR(1),        /* Sense byte 31.                */ 02430000
*      3 *        CHAR(4),          /* Reserved for future CSW          02440000
*                                      expansion                 @01C*/ 02450000
*      3 IEDB2CSW PTR(31),          /* If the I/O requestor allowed     02460000
*                                      prefetching of CCWs and data     02470000
*                                      (IOBEP/IOSP) and specified       02480000
*                                      that it wants to see both the    02490000
*                                      channel and CU ending CCW        02500000
*                                      address for errors that occur    02510000
*                                      when the CU executes ahead of    02520000
*                                      the channel and the 2nd CCW      02530000
*                                      address is valid, this field     02540000
*                                      contains the virtual CCW         02550000
*                                      address of the last CCW          02560000
*                                      executed by the control          02570000
*                                      unit                      @01C*/ 02580000
*      3 IEDBEND CHAR(0);           /* End of version 1 IEDB     @02A*/ 02590000
*                                                                       02600000
*/********************************************************************/ 02610000
*/*                                                                  */ 02620000
*/* Version 2 section of the IEDB.                                   */ 02630000
*/*                                                              @02A*/ 02640000
*/********************************************************************/ 02650000
*DCL 1 IEDB2 DEFINED(IEDBEND) BDY(WORD),                                02660000
*                                   /* Start of version 2 section       02670000
*                                      of the IEDB               @02A*/ 02680000
*      3 IEDBFSA CHAR(8) BDY(WORD), /* Failing storage address (FSA)    02690000
*                                                                @02A*/ 02700000
*        5 IEDBFSAH PTR(31),        /* High order word of FSA    @02A*/ 02710000
*        5 IEDBFSAL PTR(31),        /* Low order word of FSA     @02A*/ 02720000
*                                                                       02730000
*      3 IEDB2RSV CHAR(40),         /* Reserved                  @02A*/ 02740000
*      3 IEDB2END CHAR(0);          /* End of version 2 IEDB     @02A*/ 02750000
*                                                                       02760000
*/********************************************************************/ 02770000
*/*                                                                  */ 02780000
*/* Constants.                                                       */ 02790000
*/*                                                              @02A*/ 02800000
*/********************************************************************/ 02810000
*DCL IEDBIDC  CHAR(4) CONSTANT('IEDB'); /* Eye catcher constant      */ 02820000
*DCL IEDBVRSC FIXED(8) CONSTANT(1); /* Version number 1          @02C*/ 02830000
*DCL IEDBVRS2 FIXED(8) CONSTANT(2); /* Version number 2          @02A*/ 02840000
*DCL IEDBLNTH FIXED(31) CONSTANT(LENGTH(IEDB));                         02850000
*                                   /* Length of the version 1          02860000
*                                      IEDB                      @02A*/ 02870000
*DCL IEDB2LEN FIXED(31) CONSTANT(LENGTH(IEDB)+LENGTH(IEDB2));           02884990
*                                   /* Length of the version 2          02890000
*                                      IEDB                      @02A*/ 02900000
