*                                                                       00001000
* %DCL IOSDTCCB_INCLUDED CHAR EXT;                                      00002000
* %DEACTIVATE IOSDTCCB_INCLUDED;                                        00003000
* %IF IOSDTCCB_INCLUDED = '' %THEN                                      00004000
* %DO;                                                                  00005000
*/* Macro made bi-lingual on 11070. CBGEN compile date 11015         */ 00006000
*% /*                                                                   00007000
         MACRO                                                          00008000
         IOSDTCCB &DSECT=YES,&LIST=YES,&TITLE=YES,&TCAH=YES,&DCW=COND, *00009000
               &TCAT=COND,&TCATB=COND                                   00010000
         GBLC  &IOSDTCCB_INCLUDED                                       00011000
         GBLC  &ZCBPRINT                                                00012000
&IOSDTCCB_INCLUDED SETC 'YES'                                           00013000
         AIF   ('&LIST' EQ 'NONE').P0                                   00014000
         AIF   ('&TITLE' EQ 'NO').P5                                    00015000
 TITLE   'IOSDTCCB  - Transport Command Control Block            '      00016000
.P5      ANOP                                                           00017000
**/ IOSDTCCB_1:;                                                        00018000
*/* Start of Specifications ******************************************/ 00019000
*/*                                                                  */ 00020000
*/*01* Macro Name: IOSDTCCB                                          */ 00021000
*/*                                                                  */ 00022000
*/*01* Descriptive Name = Transport Command Control Block            */ 00023000
*/*                                                                  */ 00024000
*/*02*   Acronym:  TCCB                                              */ 00025000
*/*                                                                  */ 00026000
*/*02*   DSECT Name: TCAH, DCW, TCAT                                 */ 00027000
*/*                                                                  */ 00028000
*/*01* Proprietary Statement =                                       */ 00029000
*/*                                                                  */ 00030000
*/*    LICENSED MATERIALS - PROPERTY OF IBM                          */ 00031000
*/*    5694-A01 COPYRIGHT IBM CORP. 2010, 2011                       */ 00032000
*/*                                                                  */ 00033000
*/*01* Status= HBB7780                                               */ 00034000
*/*                                                                  */ 00035000
*/*01* Component: I/O Supervisor (SC1C3)                             */ 00036000
*/*                                                                  */ 00037000
*/*01* Function =                                                    */ 00038000
*/*                                                                  */ 00039000
*/*    IOSDTCCB maps the Transport Command Control which contain the */ 00040000
*/*    commands to be transported to the device for execution.  The  */ 00041000
*/*    TCCB contains the following sections:                         */ 00042000
*/*                                                                  */ 00043000
*/*    -- Transport Command Area Header (TCAH) - Contains            */ 00044000
*/*       information about the TCA and the operations described     */ 00045000
*/*       within.                                                    */ 00046000
*/*                                                                  */ 00047000
*/*    -- Transport Command Area (TCA) - Contains one to 30 Device   */ 00048000
*/*       Command Words (DCWs) that specify the commands to be       */ 00049000
*/*       executed.  Each DCW contains the following information     */ 00050000
*/*                                                                  */ 00051000
*/*       -- Command code                                            */ 00052000
*/*       -- Flags to indicate command chaining etc.                 */ 00053000
*/*       -- The length of the control data for the command, if any  */ 00054000
*/*       -- The length of the data to be read or written            */ 00055000
*/*                                                                  */ 00056000
*/*       If the command requires control data (e.g., define extent  */ 00057000
*/*       or locate record parameter data), the control data         */ 00058000
*/*       immediately follows the DCW.  If the control data is not   */ 00059000
*/*       a multiple of 4, pad bytes must be added to properly       */ 00060000
*/*       align the next DCW or the TCA trailer on a word boundary.  */ 00061000
*/*                                                                  */ 00062000
*/*       The total size of the DCWs plus control data cannot exceed */ 00063000
*/*       240 bytes.  The need for control data reduces the number   */ 00064000
*/*       of DCWs that may be contained in the TCA.                  */ 00065000
*/*                                                                  */ 00066000
*/*    -- Transport Command Area Trailer (TCAT) - Contains the       */ 00067000
*/*       transport count which specifies the count of data bytes    */ 00068000
*/*       to be transferred.                                         */ 00069000
*/*                                                                  */ 00070000
*/*                                                                  */ 00071000
*/*01* Notes = None                                                  */ 00072000
*/*                                                                  */ 00073000
*/*01* Eye-Catcher: None                                             */ 00074000
*/*                                                                  */ 00075000
*/*01* Created By: User                                              */ 00076000
*/*                                                                  */ 00077000
*/*01* Deleted By: User                                              */ 00078000
*/*                                                                  */ 00079000
*/*01* Pointed to By:                                                */ 00080000
*/*                                                                  */ 00081000
*/*      TCWTCCBAddr in IOSDTCW (real address)                       */ 00082000
*/*      TIDAW0_Addr in IOSDTCW (real address)                       */ 00083000
*/*                                                                  */ 00084000
*/*                                                                  */ 00085000
*/*01* Size: 16 Bytes for TCAH                                       */ 00086000
*/*           8 bytes for DCW                                        */ 00087000
*/*           8 bytes for TCAT                                       */ 00088000
*/*                                                                  */ 00089000
*/*01* Module Type: Mapping macro                                    */ 00090000
*/*                                                                  */ 00091000
*/*01* Method of Access:                                             */ 00092000
*/*                                                                  */ 00093000
*/*02*   ASM:                                                        */ 00094000
*/*       IOSDTCCB DSECT=YES!NO -- Request DSECT definition on       */ 00095000
*/*                                TCAH, DCW, and TCAT               */ 00096000
*/*                                                                  */ 00097000
*/*      Default: DSECT=YES                                          */ 00098000
*/*                                                                  */ 00099000
*/*02*   PL/X:                                                       */ 00100000
*/*       %INCLUDE SYSLIB(IOSDTCCB)                                  */ 00101000
*/*                                                                  */ 00102000
*/*       To define structure TCAH  as BASED on a specific address,  */ 00103000
*/*       specify the following:                                     */ 00104000
*/*                                                                  */ 00105000
*/*         %TCAHBase = 'BASED(basing expression)'                   */ 00106000
*/*                                                                  */ 00107000
*/*       If %TCAHBase is not specified, TCAH will be declared as    */ 00108000
*/*       BASED.                                                     */ 00109000
*/*                                                                  */ 00110000
*/*       DCWBase and TCATBase may also be used in this way to       */ 00111000
*/*       set the basing for the DCW and TCAT respectively.          */ 00112000
*/*                                                                  */ 00113000
*/*                                                                  */ 00114000
*/*01* Dependencies: None                                            */ 00115000
*/*                                                                  */ 00116000
*/*01* Restrictions: None                                            */ 00117000
*/*                                                                  */ 00118000
*/*01* Serialization: None                                           */ 00119000
*/*                                                                  */ 00120000
*/*01* Storage Attributes:                                           */ 00121000
*/*02*   Subpool: Any                                                */ 00122000
*/*02*   Key: Any                                                    */ 00123000
*/*02*   Dataspace: N/A                                              */ 00124000
*/*02*   Residency: Below 2G in virtual, above 2G in real            */ 00125000
*/*02*   Main Storage: Yes                                           */ 00126000
*/*02*   Auxiliary Storage: N/A                                      */ 00127000
*/*02*   Virtual Storage: Yes                                        */ 00128000
*/*02*   Frequency: One per FCX I/O or interrogate request           */ 00129000
*/*                                                                  */ 00130000
*/*01* Distribution Library: AMACLIB                                 */ 00131000
*/*                                                                  */ 00132000
*/*01* External Classification: PI                                   */ 00133000
*/*01* End of External Classification:                               */ 00134000
*/*                                                                  */ 00135000
*/*01* Change Activity:                                              */ 00136000
*/*                                                                  */ 00137000
*/* $MAC(IOSDTCCB),COMP(SC1C3): Transport Command Control Block      */ 00138000
*/*                                                                  */ 00139000
*/*  PN REASON  RELEASE  DATE   ORG   COMMENTS                       */ 00140000
*/* $L0=IOSHPF  HBB7740  070331 PDHC: High Performance FICON support,*/ 00141000
*/*                                   flagged as APAR OA18766        */ 00142000
*/* $L1=IOSBIDI HBB7780  100905 PDSK: Bidirectional high performance */ 00143000
*/*                                   FICON support.                 */ 00144000
*/*                                   Changes flagged by APAR        */ 00145000
*/*                                   OA33089.                       */ 00146000
*/* $L2=EXVRHPF HBB7780  110308 PDDR: EXCPVR support for zHPF.       */ 00147000
*/*                                   Changes flagged as APAR        */ 00148000
*/*                                   OA33642.                       */ 00149000
*/*                                                                  */ 00150000
*/* $A4=OA18766 HBB7720  080930 PDHC: High Performance FICON support */ 00151000
*/*                                                                  */ 00152000
*/* $01=OA33089 HBB7760  100905 PDSK: Bidirectional high performance */ 00153000
*/*                                   FICON support.                 */ 00154000
*/* $02=OA34785 HBB7750  101130 PDCC: Update DISTLIB                 */ 00155000
*/* $03=OA33642 HBB7760  111101 PDDR: Add suppress incorrect length  */ 00156000
*/*                                   flag to DCW                    */ 00157000
*/*                                                                  */ 00158000
*/* $P1=ME18102 HBB7770  100205 PDMD: Update DISTLIB                 */ 00159000
*/* $P2=ME21254 HBB7780  110311 PDCC: Remove OA34785 Metadata Editor */ 00160000
*/*                                   changes.                       */ 00161000
*/*                                                                  */ 00162000
*/* End of Specifications ********************************************/ 00163000
*% /*                                                                   00164000
.P0      ANOP                                                           00165000
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 00166000
         AIF   ('&LIST' EQ 'YES').P2                                    00167000
.P1      ANOP                                                           00168000
         PUSH  PRINT                                                    00169000
         PRINT OFF                                                      00170000
.P2      ANOP                                                           00171000
         AIF   ('&TCAH' EQ 'NO').L0002                                  00172000
         AIF   ('&DSECT' EQ 'YES').L0003                                00173000
         AIF   ('&TCAH' NE 'YES').L0002                                 00174000
.L0003   ANOP                                                           00175000
*                                                                       00176000
* ********************************************************************  00177000
* *                                                                  *  00178000
* * Transport Command Area Header (TCAH)                             *  00179000
* *                                                                  *  00180000
* ********************************************************************  00181000
*                                                                       00182000
*                                                                       00183000
         AIF   ('&DSECT' EQ 'YES').L0004                                00184000
TCAH     DS    0F        Transport Command Area Header                  00185000
         AGO   .L0005                                                   00186000
.L0004   ANOP                                                           00187000
TCAH     DSECT           Transport Command Area Header                  00188000
.L0005   ANOP                                                           00189000
TCAH_WORD0 DS  0CL4      Word 0                                         00190000
TCAH_FORMAT DS X         Format control                                 00191000
TCAH_W0RSVD DS CL3       Reserved                                       00192000
TCAH_WORD1 DS  0CL4      Word 1                                         00193000
TCAH_W1RSVD DS CL3       Reserved                                       00194000
TCAH_TCAL DS   X         This value is the length of the TCA in bytes  *00195000
                         (TCA = DCWs + control data + pad bytes) plus  *00196000
                         12                                             00197000
TCAH_WORD2 DS  0CL4      Word 2                                         00198000
TCAH_SERVACT DS BL2      Device dependent service action code           00199000
TCAH_W2RSVD DS CL1       Reserved                                       00200000
TCAH_PRIORITY DS X       Priority - must be set to zero by the builder *00201000
                         of the channel program                         00202000
TCAH_WORD3 DS  0CL4      Word 3                                         00203000
TCAH_W3RSVD DS CL4       Reserved                                       00204000
TCAH_END DS    0C        End of TCA header                              00205000
*                                                                       00206000
* ********************************************************************  00207000
* *                                                                  *  00208000
* * Constants for TCAH_Format                                        *  00209000
* *                                                                  *  00210000
* ********************************************************************  00211000
*                                                                       00212000
*                                                                       00213000
TCAH_FORMAT_7F EQU X'7F' Only format allowed                            00214000
*                                                                       00215000
* ********************************************************************  00216000
* *                                                                  *  00217000
* * Constants for TCAH_ServAct                                       *  00218000
* *                                                                  *  00219000
* ********************************************************************  00220000
*                                                                       00221000
*                                                                       00222000
TCAH_SERVACT_1FFE EQU X'1FFE' Device dependent service action code      00223000
TCAH_SERVACT_1FFF EQU X'1FFF' Device dependent service action code      00224000
TCAH_SERVACT_INTG EQU X'1FFF' Service action code used for interrogate  00225000
TCAH_LEN EQU   *-TCAH                                                   00226000
.L0002   ANOP                                                           00227000
         AIF   ('&DCW' EQ 'NO').L0006                                   00228000
         AIF   ('&DSECT' EQ 'YES').L0007                                00229000
         AIF   ('&DCW' NE 'YES').L0006                                  00230000
.L0007   ANOP                                                           00231000
*                                                                       00232000
* ********************************************************************  00233000
* *                                                                  *  00234000
* * Device Command Word (DCW)                                        *  00235000
* *                                                                  *  00236000
* ********************************************************************  00237000
*                                                                       00238000
*                                                                       00239000
         AIF   ('&DSECT' EQ 'YES').L0008                                00240000
DCW      DS    0F        Device Command Word                            00241000
         AGO   .L0009                                                   00242000
.L0008   ANOP                                                           00243000
DCW      DSECT           Device Command Word                            00244000
.L0009   ANOP                                                           00245000
DCW_WORD0 DS   0CL4      DCW word zero                                  00246000
DCW_CMD  DS    B         Command code                                   00247000
DCW_FLAGS DS   0B        Flags                                          00248000
DCW_FBIT0_RSVD EQU X'80' Reserved                                       00249000
DCW_CMDCHAIN EQU X'40'   Command chain to the next DCW                  00250000
DCW_SLI  EQU   X'20'     Suppress length indication                     00251000
DCW_FBIT37_RSVD EQU X'1F' Reserved                                      00252000
         ORG   DCW_FLAGS+1                                              00253000
DCW_W0B2RSVD DS CL1      Reserved                                       00254000
DCW_CDCOUNT DS X         Control data count                             00255000
DCW_COUNT DS   F         Count of read or write bytes                   00256000
DCW_END  DS    0C        End of DCW                                     00257000
DCW_CONTROL_DATA DS 0C   Start of control data (if any)                 00258000
DCW_CMD_TCAX EQU X'50'   Transfer-TCA-extension (TCAX) command code     00259000
DCW_CMD_TCOB EQU X'60'   Transfer-CBC-offset-block (TCOB) command code  00260000
DCW_LEN  EQU   *-DCW                                                    00261000
.L0006   ANOP                                                           00262000
         AIF   ('&TCAT' EQ 'NO').L000A                                  00263000
         AIF   ('&DSECT' EQ 'YES').L000B                                00264000
         AIF   ('&TCAT' NE 'YES').L000A                                 00265000
.L000B   ANOP                                                           00266000
*                                                                       00267000
* ********************************************************************  00268000
* *                                                                  *  00269000
* * Transport Command Area Trailer (TCAT) for uni-directional data   *  00270000
* * transfer                                                         *  00271000
* *                                                                     00272000
* ********************************************************************  00273000
*                                                                       00274000
*                                                                       00275000
         AIF   ('&DSECT' EQ 'YES').L000C                                00276000
TCAT     DS    0F        Transport Command Area Trailer                 00277000
         AGO   .L000D                                                   00278000
.L000C   ANOP                                                           00279000
TCAT     DSECT           Transport Command Area Trailer                 00280000
.L000D   ANOP                                                           00281000
TCAT_CHANUSE DS CL4      Reserved for use by channel                    00282000
TCAT_TRANSPORT_COUNT DS F Count of data bytes transferred               00283000
TCAT_END DS    0C        End of TCA trailer                             00284000
TCAT_LEN EQU   *-TCAT                                                   00285000
.L000A   ANOP                                                           00286000
         AIF   ('&TCATB' EQ 'NO').L000E                                 00287000
         AIF   ('&DSECT' EQ 'YES').L000F                                00288000
         AIF   ('&TCATB' NE 'YES').L000E                                00289000
.L000F   ANOP                                                           00290000
*                                                                       00291000
* ********************************************************************  00292000
* *                                                                  *  00293000
* * Transport Command Area Trailer (TCAT) for bidirectional data     *  00294000
* * transfer                                                         *  00295000
* *                                                                     00296000
* ********************************************************************  00297000
*                                                                       00298000
*                                                                       00299000
         AIF   ('&DSECT' EQ 'YES').L0010                                00300000
TCATB    DS    0F        Transport Command Area Trailer                 00301000
         AGO   .L0011                                                   00302000
.L0010   ANOP                                                           00303000
TCATB    DSECT           Transport Command Area Trailer                 00304000
.L0011   ANOP                                                           00305000
TCATB_CHANUSE DS CL4     Reserved for use by channel                    00306000
TCATB_WRITE_COUNT DS F   Count of write data bytes transferred          00307000
TCATB_READ_COUNT DS F    Count of read data bytes transferred           00308000
TCATB_END DS   0C        End of TCATB                                   00309000
TCATB_LEN EQU  *-TCATB                                                  00310000
.L000E   ANOP                                                           00311000
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 00312000
         AIF   ('&LIST' EQ 'YES').P4                                    00313000
.P3      ANOP                                                           00314000
         POP   PRINT                                                    00315000
.P4      ANOP                                                           00316000
.P_EXIT  ANOP                                                           00317000
         MEND                                                           00318000
**/ IOSDTCCB_2:;                                                        00319000
* %IOSDTCCB_INCLUDED = 'YES';                                           00320000
* %DCL ZCBPRINT CHAR EXT;                                               00321000
* %DEACTIVATE ZCBPRINT;                                                 00322000
* %DCL IOSDTCCB_LIST CHAR EXT;                                          00323000
* %DEACTIVATE IOSDTCCB_LIST;                                            00324000
* %IF IOSDTCCB_LIST ^= 'NO' &                                           00325000
*    ZCBPRINT ^= 'NO' %THEN                                             00326000
*   %GOTO IOSDTCCB_3;                                                   00327000
*   @LIST PUSH NOECHO;                                                  00328000
*   @LIST NOASSEMBLE NOECHO;                                            00329000
*   @LIST OFF C NOECHO;                                                 00330000
* %IOSDTCCB_3:;                                                         00331000
*/* Start of PL/X Source                                             */ 00332000
*%DCL TCAHBase CHAR;                                                    00333000
*%DCL DCWBase  CHAR;                                                    00334000
*%DCL TCATBase CHAR;                                                    00335000
*                                                                       00336000
*%IF TCAHBase ^='' %THEN                                                00337000
*  %GOTO TCAHDCL;                                                       00338000
*%TCAHBase = 'BASED';                                                   00339000
*%TCAHDCL:;                                                             00340000
*                                                                       00341000
*/********************************************************************/ 00342000
*/*                                                                  */ 00343000
*/* Transport Command Area Header (TCAH)                             */ 00344000
*/*                                                                  */ 00345000
*/********************************************************************/ 00346000
*DECLARE                                                                00347000
*  1 TCAH CHAR(16) TCAHBase BDY(WORD),                                  00348000
*                                   /* Transport Command Area Header */ 00349000
*    3 TCAH_Word0       CHAR(4),    /* Word 0                        */ 00350000
*      5 TCAH_Format    FIXED(8),   /* Format control                */ 00351000
*      5 TCAH_W0Rsvd    CHAR(3),    /* Reserved                      */ 00352000
*                                                                       00353000
*    3 TCAH_Word1       CHAR(4),    /* Word 1                        */ 00354000
*      5 TCAH_W1Rsvd    CHAR(3),    /* Reserved                      */ 00355000
*      5 TCAH_TCAL      FIXED(8),   /* This value is the length of      00356000
*                                      the TCA in bytes (TCA = DCWs     00357000
*                                      + control data + pad bytes)      00358000
*                                      plus 12                       */ 00359000
*                                                                       00360000
*    3 TCAH_Word2       CHAR(4),    /* Word 2                        */ 00361000
*      5 TCAH_ServAct   BIT(16),    /* Device dependent service         00362000
*                                      action code                   */ 00363000
*      5 TCAH_W2Rsvd    CHAR(1),    /* Reserved                      */ 00364000
*      5 TCAH_Priority  FIXED(8),   /* Priority - must be set to        00365000
*                                      zero by the builder of the       00366000
*                                      channel program               */ 00367000
*                                                                       00368000
*    3 TCAH_Word3       CHAR(4),    /* Word 3                        */ 00369000
*      5 TCAH_W3Rsvd    CHAR(4),    /* Reserved                      */ 00370000
*                                                                       00371000
*    3 TCAH_End         CHAR(0);    /* End of TCA header             */ 00372000
*                                                                       00373000
*                                                                       00374000
*/********************************************************************/ 00375000
*/*                                                                  */ 00376000
*/* Constants for TCAH_Format                                        */ 00377000
*/*                                                                  */ 00378000
*/********************************************************************/ 00379000
*DECLARE                                                                00380000
*  TCAH_Format_7F  BIT(8) CONSTANT('7F'x);                              00381000
*                                   /* Only format allowed           */ 00382000
*                                                                       00383000
*                                                                       00384000
*/********************************************************************/ 00385000
*/*                                                                  */ 00386000
*/* Constants for TCAH_ServAct                                       */ 00387000
*/*                                                                  */ 00388000
*/********************************************************************/ 00389000
*DECLARE                                                                00390000
*  TCAH_ServAct_1FFE BIT(16) CONSTANT('1FFE'x),                         00391000
*                                   /* Device dependent service         00392000
*                                      action code                   */ 00393000
*  TCAH_ServAct_1FFF BIT(16) CONSTANT('1FFF'x),                         00394000
*                                   /* Device dependent service         00395000
*                                      action code                   */ 00396000
*  TCAH_ServAct_Intg BIT(16) CONSTANT('1FFF'x);                         00397000
*                                   /* Service action code used         00398000
*                                      for interrogate               */ 00399000
*                                                                       00400000
*%IF DCWBase ^='' %THEN                                                 00401000
*  %GOTO DCWDCL;                                                        00402000
*%DCWBase = 'BASED';                                                    00403000
*%DCWDCL:;                                                              00404000
*                                                                       00405000
*/********************************************************************/ 00406000
*/*                                                                  */ 00407000
*/* Device Command Word (DCW)                                        */ 00408000
*/*                                                                  */ 00409000
*/********************************************************************/ 00410000
*DECLARE                                                                00411000
*  1 DCW DCWBase BDY(WORD),         /* Device Command Word           */ 00412000
*                                                                       00413000
*    3 DCW_Word0           CHAR(4), /* DCW word zero                 */ 00414000
*      5 DCW_Cmd           BIT(8),  /* Command code                  */ 00415000
*                                                                       00416000
*      5 DCW_Flags         BIT(8),  /* Flags                         */ 00417000
*        7 DCW_FBit0_Rsvd  BIT(1),  /* Reserved                      */ 00418000
*        7 DCW_CmdChain    BIT(1),  /* Command chain to the next DCW */ 00419000
*        7 DCW_SLI         BIT(1),  /* Suppress length indication       00420000
*                                                                @03A*/ 00421000
*        7 DCW_FBit37_Rsvd BIT(5),  /* Reserved                  @03C*/ 00422000
*                                                                       00423000
*      5 DCW_W0B2Rsvd CHAR(1),      /* Reserved                      */ 00424000
*      5 DCW_CDCount  FIXED(8),     /* Control data count            */ 00425000
*                                                                       00426000
*    3 DCW_Count      FIXED(32),    /* Count of read or write bytes  */ 00427000
*                                                                       00428000
*    3 DCW_End        CHAR(0),      /* End of DCW                    */ 00429000
*      5 DCW_Control_Data CHAR(0);  /* Start of control data (if        00430000
*                                      any)                          */ 00431000
*                                                                       00432000
*DECLARE                                                                00433000
*  DCW_Cmd_TCAX BIT(8) CONSTANT('50'x),                                 00434000
*                                   /* Transfer-TCA-extension (TCAX)    00435000
*                                      command code              @01A*/ 00436000
*  DCW_Cmd_TCOB BIT(8) CONSTANT('60'x);                                 00437000
*                                   /* Transfer-CBC-offset-block (TCOB) 00438000
*                                      command code              @01A*/ 00439000
*%IF TCATBase ^='' %THEN                                                00440000
*  %GOTO TCATDCL;                                                       00441000
*%TCATBase = 'BASED';                                                   00442000
*%TCATDCL:;                                                             00443000
*                                                                       00444000
*/********************************************************************/ 00445000
*/*                                                                  */ 00446000
*/* Transport Command Area Trailer (TCAT) for uni-directional data   */ 00447000
*/* transfer                                                         */ 00448000
*/*                                                              @01C*/ 00449000
*/********************************************************************/ 00450000
*DECLARE                                                                00451000
*  1 TCAT TCATBase CHAR(8) BDY(WORD), /* Transport Command Area         00452000
*                                        Trailer                     */ 00453000
*    3 TCAT_ChanUse CHAR(4),        /* Reserved for use by channel   */ 00454000
*    3 TCAT_Transport_Count FIXED(32),                                  00455000
*                                   /* Count of data bytes              00456000
*                                      transferred                   */ 00457000
*    3 TCAT_End CHAR(0);            /* End of TCA trailer            */ 00458000
*/********************************************************************/ 00459000
*/*                                                                  */ 00460000
*/* Transport Command Area Trailer (TCAT) for bidirectional data     */ 00461000
*/* transfer                                                         */ 00462000
*/*                                                              @01A*/ 00463000
*/********************************************************************/ 00464000
*DECLARE                                                                00465000
*  1 TCATB TCATBase CHAR(12) BDY(WORD), /* Transport Command Area       00466000
*                                      Trailer                   @01A*/ 00467000
*    3 TCATB_ChanUse CHAR(4),       /* Reserved for use by channel      00468000
*                                                                @01A*/ 00469000
*    3 TCATB_Write_Count FIXED(32), /* Count of write data bytes        00470000
*                                      transferred               @01A*/ 00471000
*    3 TCATB_Read_Count FIXED(32),  /* Count of read data bytes         00472000
*                                      transferred               @01A*/ 00473000
*    3 TCATB_End CHAR(0);           /* End of TCATB              @01A*/ 00474000
*/* End of PL/X Source                                               */ 00475000
* %IF IOSDTCCB_LIST ^= 'NO' &                                           00476000
*    ZCBPRINT ^= 'NO' %THEN                                             00477000
*   %GOTO IOSDTCCB_4;                                                   00478000
*   @LIST POP NOECHO;                                                   00479000
* %IOSDTCCB_4:;                                                         00480000
* %END;                                                                 00481000
