*                                                                       00001000
* %DCL IRABQS_INCLUDED CHAR EXT;                                        00002000
* %DEACTIVATE IRABQS_INCLUDED;                                          00003000
* %IF IRABQS_INCLUDED = '' %THEN                                        00004000
* %DO;                                                                  00005000
*%/* Start of PL/X PreProlog Code */;                                   00006000
*                                                                       00007000
*%/* End of PL/X PreProlog Code */;                                     00008000
*/* Macro made bi-lingual on 15268. CBGEN compile date 12258         */ 00009000
*% /*                                                                   00010000
         MACRO                                                          00011000
         IRABQS &DSECT=YES,&LIST=YES,&TITLE=YES,&BQS_MAP=YES,          *00012000
               &BQSINT=COND,&BQSSC_MATRIX_MAP=COND,                    *00013000
               &BQSSC_ELEMENT_MAP=COND,&BQSRC_MATRIX_MAP=COND,         *00014000
               &BQSRC_ELEMENT_MAP=COND                                  00015000
         GBLC  &IRABQS_INCLUDED                                         00016000
         GBLC  &ZCBPRINT                                                00017000
&IRABQS_INCLUDED SETC 'YES'                                             00018000
         AIF   ('&LIST' EQ 'NONE').P0                                   00019000
         AIF   ('&TITLE' EQ 'NO').P5                                    00020000
 TITLE   'IRABQS  - Batch Queue Samples                           '     00021000
.P5      ANOP                                                           00022000
**/ IRABQS_1:;                                                          00023000
*/* Start of Specifications ******************************************  00024000
**                                                                      00025000
**01* EXTERNAL CLASSIFICATION: None                                     00026000
**01* END OF EXTERNAL CLASSIFICATION:                                   00027000
**                                                                      00028000
***** PROPRIETARY_STATEMENT ******************************************* 00029000
**01* PROPRIETARY STATEMENT=                                            00030000
**   LICENSED MATERIALS - PROPERTY OF IBM                               00031000
**   5694-A01 COPYRIGHT IBM CORP. 1993, 2008                            00032000
**                                                                      00033000
**   STATUS= HBB7750                                                    00034000
**                                                                      00035000
***** END_OF_PROPRIETARY_STATEMENT ************************************ 00036000
**                                                                      00037000
**01* Descriptive Name:  Batch Queue Samples                            00038000
**                                                                      00039000
**02* Acronym:      BQS                                                 00040000
**                                                                      00041000
**01* Macro Name:   IRABQS                                              00042000
**                                                                      00043000
**01* DSECT Name:   BQS_MAP                                             00044000
**                                                                      00045000
**01* Component:  SYSTEMS RESOURCE MANAGER (SC1CX)                      00046000
**                                                                      00047000
**01* Eye-Catcher:  BQS                                                 00048000
**02*  Offset:      0                                                   00049000
**02*  Length:      3                                                   00050000
**                                                                      00051000
**01* Storage Attributes:                                               00052000
**02*  Subpool:              245 for accumulator BQS                    00053000
**                           205 for cycle BQS                          00054000
**                           245 for cycle BQS when recreated           00055000
**                            during recovery. This is done because     00056000
**                            subpool 205 cannot be obtained while      00057000
**                            under the WLM queue lock.                 00058000
**02*  Key:                  2                                          00059000
**02*  Residency:            Above 16M line                             00060000
**02*  Main Storage:         ESQA for Accumulator BQS                   00061000
**                           PRIVATE for Cycle BQS except when          00062000
**                            recovery has occurred then ESQA           00063000
**02*  Auxiliary Storage:                                               00064000
**02*  Virtual Storage:                                                 00065000
**                                                                      00066000
**01* Size:                                                             00067000
**           BQS_MAP            x'0178' bytes                           00068000
**           BQSINT             x'014C' bytes                 @LEWLTM   00069000
**           BQSSC_MATRIX_MAP   x'2888' bytes                 @LEWLTM   00070000
**           BQSRC_MATRIX_MAP   x'14034' bytes                @ME11904  00071000
**                                                                      00072000
**           For one subsystem JES2 requires                            00073000
**             BQSINT           x'014C' bytes                 @LEWLTM   00074000
**             BQSSC_MATRIX_MAP x'2888' bytes                 @LEWLTM   00075000
**             BQSRC_MATRIX_MAP x'14034' bytes                @ME11904  00076000
**                                                                      00077000
**           For one subsystem WLM requires 2 of the following          00078000
**             BQS_MAP          x'0178' bytes                 @LEWLTM   00079000
**             BQSSC_MATRIX_MAP x'2888' bytes                 @LEWLTM   00080000
**             BQSRC_MATRIX_MAP x'14034' bytes                @ME11904  00081000
**                                                                      00082000
**                                                                      00083000
**01* Created by: IWMD2BQC (IWMBREG -> IWME2REG -> IWMD2BQC)  @ME11904  00084000
**                                                                      00085000
**01* Pointed to by:                                                    00086000
**                   - SMC_FIRST_BQS_PTR when on the cycle list         00087000
**                   - SMC_FIRST_ABQS_PTR when on the accumulator list  00088000
**                                                                      00089000
**01* Serialization: WLM Queue spin lock on creation of the SRM blocks. 00090000
**                                                                      00091000
**01* Function:  The IRABQS contains information that                   00092000
**               counts the delays for each batch service class.        00093000
**               This is a table where each entry represents a          00094000
**               service class representing batch work. The JES         00095000
**               creates this block on each checkpoint cycle.           00096000
**               The delays for each service class are tallied by       00097000
**               JES and then passed to SRM where the table is          00098000
**               copied to SRM storage. There is a list of the          00099000
**               BQS control block set to allow for multiple job        00100000
**               entry subsystems.                                      00101000
**                                                                      00102000
**                                                                      00103000
**01* Method of Access:                                                 00104000
**              THE ADDRESS OF IRABQS CB IS CONTAINED IN                00105000
**              THE - SMC_FIRST_BQS_PTR or THE                          00106000
**              SMC_FIRST_ABQS_PTR - which are                          00107000
**              fields of the Sample Monitoring Control block.          00108000
**                                                                      00109000
**02*  PL/X:                                                            00110000
**            IRABQS must be included to use this mapping.              00111000
**                                                                      00112000
**02*  ASM:                                                             00113000
**            The IRABQS macro can be called in assembler with          00114000
**            different keywords.  Not all keywords combinations        00115000
**            can be used to generate the DSECTs.                       00116000
**            The following keyword combinations are valid:             00117000
**                                                                      00118000
**            IRABQS                                                    00119000
**             BQS_MAP=NO,BQSSC_ELEMENT_MAP=NO,                         00120000
**             BQSRC_ELEMENT_MAP=NO                                     00121000
**                                                                      00122000
**            IRABQS                                                    00123000
**             BQSINT=NO,BQSSC_ELEMENT_MAP=NO,                          00124000
**             BQSRC_ELEMENT_MAP=NO                                     00125000
**                                                                      00126000
**            IRABQS                                                    00127000
**             BQSINT=NO,BQSSC_MATRIX_MAP=NO,                           00128000
**             BQSRC_MATRIX_MAP=NO                            @MW08515  00129000
**                                                                      00130000
**02*  PADI:                                                            00131000
** @LOGIC                                                               00132000
** #PRAGMA TOOL=PADI.                                                   00133000
** #PADIDELETE.BQSSC_SYS_QUEUE                                          00134000
** #PADIDELETE.BQSSC_SYS_INELIGIBLE                                     00135000
** #PADIDELETE.BQSSC_SYS_LIMITED                                        00136000
** #PADIDELETE.BQSSC_LOCAL_QUEUE                                        00137000
** #PADIDELETE.BQSSC_LOCAL_INELIGIBLE                                   00138000
** #PADIDELETE.BQSSC_CONSTRAINT_AFFINITY                                00139000
** #PADIDELETE.BQSRC_SYS_QUEUE                                          00140000
** #PADIDELETE.BQSRC_SYS_INELIGIBLE                                     00141000
** #PADIDELETE.BQSRC_SYS_LIMITED                                        00142000
** #EPRAGMA                                                             00143000
** @ENDLOGIC                                                  @ME08515  00144000
**                                                                      00145000
**01* Change Activity:                                                  00146000
**    $L0=WLMCBAT,   JBB6604 961115 PD00PC: Bill Michiels               00147000
**                                          Workload Manager Sysplex    00148000
**                                          batch                       00149000
**    $L0=WLMCBAT1,  JBB6604 961206 PD00PC: Bill Michiels               00150000
**                                          Workload Manager Sysplex    00151000
**                                          batch                       00152000
**    $WLMCINB       HBB7707 000823 3241PB: Peter Baeuerle              00153000
**                                          Initiator Balancing:        00154000
**                                          BQSSC_CONSTRAINT_AFFINITY   00155000
**                                          Interface version           00156000
**    $ME08515       HBB7740 061128 3241DW: Dieter Wellerdiek           00157000
**                                          PADI control logic added    00158000
**                                          and comment updated         00159000
**    $LEWLTM        HBB7750 070328 3241HB: Helmut Belzner              00160000
**                                          EWLM E2E transaction        00161000
**                                          management support          00162000
**    $ME11904       HBB7750 071120 3241GV: Guenter Vater               00163000
**                                          prepare for 4095 report     00164000
**                                          classes                     00165000
**                                                                      00166000
**** End of Specifications *******************************************/ 00167000
*% /*                                                                   00168000
.P0      ANOP                                                           00169000
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 00170000
         AIF   ('&LIST' EQ 'YES').P2                                    00171000
.P1      ANOP                                                           00172000
         PUSH  PRINT                                                    00173000
         PRINT OFF                                                      00174000
.P2      ANOP                                                           00175000
*                                                                       00176000
*    *****************************************************************  00177000
*    *                                                               *  00178000
*    * IRABQS.671: Respecifies for based definitions.                *  00179000
*    *                                                               *  00180000
*    *****************************************************************  00181000
*                                                                       00182000
*                                                                       00183000
BQS_MAX_SERVICE_CLASSES EQU 368                                         00184000
*                                                                       00185000
*    *****************************************************************  00186000
*    *                                                               *  00187000
*    * IRABQS.1057: maximum number of report classes.                   00188000
*    *                                                               *  00189000
*    *****************************************************************  00190000
*                                                                       00191000
*                                                                       00192000
BQS_MAX_REPORT_CLASSES EQU 4095                                         00193000
*                                                                       00194000
*    *****************************************************************  00195000
*    *                                                               *  00196000
*    * IRABQS.202: Version 1 of BQS_MAP                                 00197000
*    *                                                               *  00198000
*    *****************************************************************  00199000
*                                                                       00200000
*                                                                       00201000
BQSMAP_VERSION1 EQU C'1'                                                00202000
*                                                                       00203000
*    *****************************************************************  00204000
*    *                                                               *  00205000
*    * IRABQS.863: Current version of BQS_MAP                           00206000
*    *                                                               *  00207000
*    *****************************************************************  00208000
*                                                                       00209000
*                                                                       00210000
BQSMAP_CVERSION EQU C'1'                                                00211000
*                                                                       00212000
*    *****************************************************************  00213000
*    *                                                               *  00214000
*    * IRABQS.712: Interface version Number 1                           00215000
*    *                                                               *  00216000
*    *****************************************************************  00217000
*                                                                       00218000
*                                                                       00219000
BQS_BQSINT_VERSION1 EQU C'1'                                            00220000
*                                                                       00221000
*    *****************************************************************  00222000
*    *                                                               *  00223000
*    * IRABQS.699: Interface version Number 2                           00224000
*    *                                                               *  00225000
*    *****************************************************************  00226000
*                                                                       00227000
*                                                                       00228000
BQS_BQSINT_VERSION2 EQU C'2'                                            00229000
*                                                                       00230000
*    *****************************************************************  00231000
*    *                                                               *  00232000
*    * IRABQS.668: Current interface version. Note: this version has *  00233000
*    * not been changed for the increased number of service classes  *  00234000
*    * for EWLM.                                                        00235000
*    *                                                               *  00236000
*    *****************************************************************  00237000
*                                                                       00238000
*                                                                       00239000
BQS_BQSINT_CVERSION EQU C'2'                                            00240000
*                                                                       00241000
*    *****************************************************************  00242000
*    *                                                               *  00243000
*    * IRABQS.548: Service class matrix version 1: Indicates the max.*  00244000
*    * dimension of 256.                                             *  00245000
*    *                                                               *  00246000
*    *****************************************************************  00247000
*                                                                       00248000
*                                                                       00249000
BQSSC_MAT_VERSION1 EQU C'1'                                             00250000
*                                                                       00251000
*    *****************************************************************  00252000
*    *                                                               *  00253000
*    * IRABQS.540: Service class matrix version 2: Indicates the max.*  00254000
*    * dimension of 368.                                                00255000
*    *                                                               *  00256000
*    *****************************************************************  00257000
*                                                                       00258000
*                                                                       00259000
BQSSC_MAT_VERSION2 EQU C'2'                                             00260000
*                                                                       00261000
*    *****************************************************************  00262000
*    *                                                               *  00263000
*    * IRABQS.72: Service class matrix current version.                 00264000
*    *                                                               *  00265000
*    *****************************************************************  00266000
*                                                                       00267000
*                                                                       00268000
BQSSC_MAT_CVERSION EQU C'2'                                             00269000
*                                                                       00270000
*    *****************************************************************  00271000
*    *                                                               *  00272000
*    * IRABQS.311: Report class matrix version 1                        00273000
*    *                                                               *  00274000
*    *****************************************************************  00275000
*                                                                       00276000
*                                                                       00277000
BQSRC_MAT_VERSION1 EQU C'1'                                             00278000
*                                                                       00279000
*    *****************************************************************  00280000
*    *                                                               *  00281000
*    * IRABQS.166: Report class matrix version 2                        00282000
*    *                                                               *  00283000
*    *****************************************************************  00284000
*                                                                       00285000
*                                                                       00286000
BQSRC_MAT_VERSION2 EQU C'2'                                             00287000
*                                                                       00288000
*    *****************************************************************  00289000
*    *                                                               *  00290000
*    * IRABQS.235: Report class matrix current version.                 00291000
*    *                                                               *  00292000
*    *****************************************************************  00293000
*                                                                       00294000
*                                                                       00295000
BQSRC_MAT_CVERSION EQU C'2'                                             00296000
         AIF   ('&BQS_MAP' EQ 'NO').L0002                               00297000
         AIF   ('&DSECT' EQ 'YES').L0003                                00298000
         AIF   ('&BQS_MAP' NE 'YES').L0002                              00299000
.L0003   ANOP                                                           00300000
*                                                                       00301000
*    *****************************************************************  00302000
*    *                                                               *  00303000
*    * IRABQS.598: This map contains the header information for the  *  00304000
*    * batch queues service and report class matricies.              *  00305000
*    *                                                               *  00306000
*    *****************************************************************  00307000
*                                                                       00308000
*                                                                       00309000
         AIF   ('&DSECT' EQ 'YES').L0004                                00310000
BQS_MAP  DS    0D                                                       00311000
         AGO   .L0005                                                   00312000
.L0004   ANOP                                                           00313000
BQS_MAP  DSECT                                                          00314000
.L0005   ANOP                                                           00315000
BQS_ID   DS    0CL20     IRABQS.32: identification data                 00316000
BQS_HDR  DS    CL8       IRABQS.38: BQS identifier                      00317000
BQS_VER  DS    CL1       IRABQS.44: Version                             00318000
BQS_COMPONENT DS CL5     IRABQS.50: Component id                        00319000
BQS_SUBPOOL DS X         IRABQS.56: BQS subpool                         00320000
BQS_BQSINT_VER DS CL1    IRABQS.798: Interface Version                  00321000
BQS_LENGTH DS  F         IRABQS.62: control block length                00322000
BQS_BATCH_SAMPLES DS 0CL264 IRABQS.872: sample data from the subsystem  00323000
BQS_SUBSYSNM DS CL8      IRABQS.316: Subsystem name specified on       *00324000
                         Connect service.                               00325000
BQS_SUBSYS_TYPE DS CL4   IRABQS.555: Subsystem type specified on       *00326000
                         Connect service.                               00327000
         DS    CL68      IRABQS.519: reserved                           00328000
BQS_SC   DS    0CL68     IRABQS.790: Service class delay samples       *00329000
                         matrix information                             00330000
BQSSC_HIGH_INDEX DS F    IRABQS.1090: index of the highest service     *00331000
                         class index for which there was a sample.      00332000
BQSSC_MATRIX_CB_PTR DS A IRABQS.1097: Pointer to the bqssc_MATRIX_MAP. *00333000
                         Points to start of header in control block    *00334000
                         that contains the header and the table.        00335000
BQSSC_MATRIX_CB_SIZE DS F IRABQS.988: size of the storage required for *00336000
                         the service class queue delay matrix and its  *00337000
                         header.                                        00338000
BQSSC_MATRIX_PTR DS A    IRABQS.742: Pointer to the bqssc_MATRIX. The  *00339000
                         field exists for use in pointer notation.      00340000
BQSSC_SERVICE_TOTAL DS F IRABQS.458: total number of server class      *00341000
                         queue delay elements. Total is currently 100  *00342000
                         but is being set to 256 to match the maximum  *00343000
                         size that the index will allow. Enhanced to   *00344000
                         368.                                           00345000
         DS    CL48      IRABQS.681: reserved                           00346000
BQS_RC   DS    0CL68     IRABQS.426: Report class delay samples matrix *00347000
                         information                                    00348000
BQSRC_HIGH_INDEX DS F    IRABQS.768: index of the highest report class *00349000
                         for which there was a sample.                  00350000
BQSRC_MATRIX_CB_PTR DS A IRABQS.1104: Pointer to the bqsrc_MATRIX_MAP. *00351000
                         This points to the header that precedes the   *00352000
                         bqsrc_matrix.                                  00353000
BQSRC_MATRIX_CB_SIZE DS F IRABQS.1110: size of the storage required    *00354000
                         for the report class queue delay matrix and   *00355000
                         its header.                                    00356000
BQSRC_MATRIX_PTR DS A    IRABQS.1116: Pointer to the bqsrc_matrix. The *00357000
                         field exists for use in pointer notation.     *00358000
                         This field points to the table itself.         00359000
BQSRC_REPORT_TOTAL DS F  IRABQS.1122: total number of report class     *00360000
                         queue delay elements.                          00361000
         DS    CL48      IRABQS.1128: reserved                          00362000
         DS    CL48      IRABQS.518: reserved                           00363000
BQS_NEXT DS    A         IRABQS.149: address of next bqs in cycle list  00364000
BQS_PREV DS    A         IRABQS.155: address of prev bqs in cycle list  00365000
BQS_FLAGS DS   0BL4      IRABQS.1012: flags related to state of the    *00366000
                         subsystem samples on wlm or srm side.          00367000
BQS_FLAGS_INUSE EQU X'80' IRABQS.1009: if flag is set the entry is     *00368000
                         currently in use. If the flag is off the      *00369000
                         entry does not currently represent subsystem  *00370000
                         data. This flag is not set until the cb has   *00371000
                         been initialized by iwmbreg. This is set off  *00372000
                         when the subsystem that occupies the entry    *00373000
                         has terminated.                                00374000
         ORG   BQS_FLAGS+4                                              00375000
BQS_ACCUM_NEXT DS A      IRABQS.168: address of next bqs in            *00376000
                         accumulator list                               00377000
BQS_ACCUM_PREV DS A      IRABQS.433: address of prev bqs in            *00378000
                         accumulator list                               00379000
BQS_CYCLE_PTR DS A       IRABQS.1073: Cycle ptr in the accumulator bqs  00380000
BQS_SVDEF DS   0CL32     IRABQS.1008: The service definition id        *00381000
                         provided in the IWMBSMP macro invocation.      00382000
SVDIDNAM DS    CL8       IWMSVDID.44: Name of the service definition   *00383000
                         from which the service policy was extracted    00384000
SVDIDTDI DS    BL8       IWMSVDID.50: Time/date (STCK format) that the *00385000
                         service definition was installed               00386000
SVDIDUSE DS    CL8       IWMSVDID.56: Userid of the service            *00387000
                         administrator that installed the service      *00388000
                         definition                                     00389000
SVDIDSYS DS    CL8       IWMSVDID.62: Name of the system on which the  *00390000
                         service definition was installed               00391000
BQS_ACCUM_PTR DS A       IRABQS.844: Accumulator ptr in the cycle bqs. *00392000
                         Update is not serialized at creation of the   *00393000
                         cycle bqs. It is updated at the creation of   *00394000
                         the accumulator bqs under the WLMQ lock. This *00395000
                         field is only used in recovery. The value is  *00396000
                         not filled in until the accumulator BQS is    *00397000
                         built                                          00398000
         DS    CL32      IRABQS.810: reserved                           00399000
BQS_MAP_LEN EQU *-BQS_MAP                                               00400000
.L0002   ANOP                                                           00401000
         AIF   ('&BQSINT' EQ 'NO').L0006                                00402000
         AIF   ('&DSECT' EQ 'YES').L0007                                00403000
         AIF   ('&BQSINT' NE 'YES').L0006                               00404000
.L0007   ANOP                                                           00405000
*                                                                       00406000
*    *****************************************************************  00407000
*    *                                                               *  00408000
*    * IRABQS.207: This map contains the interface information for   *  00409000
*    * the batch queues service and report class matricies. The      *  00410000
*    * bloick is used by the jes to pass the matrices to srm via a   *  00411000
*    * sysevent.                                                     *  00412000
*    *                                                               *  00413000
*    *****************************************************************  00414000
*                                                                       00415000
*                                                                       00416000
         AIF   ('&DSECT' EQ 'YES').L0008                                00417000
BQSINT   DS    0D                                                       00418000
         AGO   .L0009                                                   00419000
.L0008   ANOP                                                           00420000
BQSINT   DSECT                                                          00421000
.L0009   ANOP                                                           00422000
BQSINT_ID DS   0CL20     IRABQS.653: identification data                00423000
BQSINT_HDR DS  CL8       IRABQS.659: BQS identifier                     00424000
BQSINT_VER DS  CL1       IRABQS.641: Version                            00425000
BQSINT_COMPONENT DS CL5  IRABQS.227: Component id                       00426000
         DS    CL2       IRABQS.565: Reserved                           00427000
BQSINT_LENGTH DS F       IRABQS.568: control block length               00428000
BQSINT_BATCH_SAMPLES DS 0CL264 IRABQS.436: sample data sent to srm/wlm  00429000
BQS_SUBSYSNM DS CL8      IRABQS.316: Subsystem name specified on       *00430000
                         Connect service.                               00431000
BQS_SUBSYS_TYPE DS CL4   IRABQS.555: Subsystem type specified on       *00432000
                         Connect service.                               00433000
         DS    CL68      IRABQS.519: reserved                           00434000
BQS_SC   DS    0CL68     IRABQS.790: Service class delay samples       *00435000
                         matrix information                             00436000
BQSSC_HIGH_INDEX DS F    IRABQS.1090: index of the highest service     *00437000
                         class index for which there was a sample.      00438000
BQSSC_MATRIX_CB_PTR DS A IRABQS.1097: Pointer to the bqssc_MATRIX_MAP. *00439000
                         Points to start of header in control block    *00440000
                         that contains the header and the table.        00441000
BQSSC_MATRIX_CB_SIZE DS F IRABQS.988: size of the storage required for *00442000
                         the service class queue delay matrix and its  *00443000
                         header.                                        00444000
BQSSC_MATRIX_PTR DS A    IRABQS.742: Pointer to the bqssc_MATRIX. The  *00445000
                         field exists for use in pointer notation.      00446000
BQSSC_SERVICE_TOTAL DS F IRABQS.458: total number of server class      *00447000
                         queue delay elements. Total is currently 100  *00448000
                         but is being set to 256 to match the maximum  *00449000
                         size that the index will allow. Enhanced to   *00450000
                         368.                                           00451000
         DS    CL48      IRABQS.681: reserved                           00452000
BQS_RC   DS    0CL68     IRABQS.426: Report class delay samples matrix *00453000
                         information                                    00454000
BQSRC_HIGH_INDEX DS F    IRABQS.768: index of the highest report class *00455000
                         for which there was a sample.                  00456000
BQSRC_MATRIX_CB_PTR DS A IRABQS.1104: Pointer to the bqsrc_MATRIX_MAP. *00457000
                         This points to the header that precedes the   *00458000
                         bqsrc_matrix.                                  00459000
BQSRC_MATRIX_CB_SIZE DS F IRABQS.1110: size of the storage required    *00460000
                         for the report class queue delay matrix and   *00461000
                         its header.                                    00462000
BQSRC_MATRIX_PTR DS A    IRABQS.1116: Pointer to the bqsrc_matrix. The *00463000
                         field exists for use in pointer notation.     *00464000
                         This field points to the table itself.         00465000
BQSRC_REPORT_TOTAL DS F  IRABQS.1122: total number of report class     *00466000
                         queue delay elements.                          00467000
         DS    CL48      IRABQS.1128: reserved                          00468000
         DS    CL48      IRABQS.518: reserved                           00469000
         DS    CL48      IRABQS.694: reserved                           00470000
BQSINT_LEN EQU *-BQSINT                                                 00471000
.L0006   ANOP                                                           00472000
         AIF   ('&BQSSC_MATRIX_MAP' EQ 'NO').L000A                      00473000
         AIF   ('&DSECT' EQ 'YES').L000B                                00474000
         AIF   ('&BQSSC_MATRIX_MAP' NE 'YES').L000A                     00475000
.L000B   ANOP                                                           00476000
*                                                                       00477000
*    *****************************************************************  00478000
*    *                                                               *  00479000
*    * IRABQS.604: service class queue delay matrix                  *  00480000
*    *                                                               *  00481000
*    *****************************************************************  00482000
*                                                                       00483000
*                                                                       00484000
         AIF   ('&DSECT' EQ 'YES').L000C                                00485000
BQSSC_MATRIX_MAP DS 0D                                                  00486000
         AGO   .L000D                                                   00487000
.L000C   ANOP                                                           00488000
BQSSC_MATRIX_MAP DSECT                                                  00489000
.L000D   ANOP                                                           00490000
BQSSC_MAT_ID DS 0CL24    IRABQS.345: identification data                00491000
BQSSC_MAT_HDR DS CL8     IRABQS.351: bqssc_MAT identifier               00492000
BQSSC_MAT_VER DS CL1     IRABQS.357: Version                            00493000
BQSSC_MAT_COMPONENT DS CL5 IRABQS.363: Component id                     00494000
         DS    CL2       IRABQS.369: Reserved Table contents            00495000
BQSSC_MAT_LENGTH DS F    IRABQS.375: control block length               00496000
         DS    A         IRABQS.381: reserved                           00497000
         DS    CL48      IRABQS.669: reserved                           00498000
BQSSC_MATRIX DS 0CL28    IRABQS.387: Matrix of service classes with    *00499000
                         their related delays. From Rel. 1.10 these    *00500000
                         are 100 external defined + 8 internal WLM     *00501000
                         service classes + 256 EWLM service classes on *00502000
                         byte boundary (=368).                          00503000
BQSSC_SYS_QUEUE DS F     IRABQS.408: Sysplex queue delay. Jobs         *00504000
                         eligible to be initiated somewhere in the     *00505000
                         sysplex.                                       00506000
BQSSC_SYS_INELIGIBLE DS F IRABQS.849: Sysplex ineligible. Jobs not     *00507000
                         eligible to be initiated on any system in the *00508000
                         sysplex. This includes operator held jobs,    *00509000
                         jobs held because of duplicate name, jobs     *00510000
                         busy on a jes transmitter (offload and keep).  00511000
BQSSC_SYS_LIMITED DS F   IRABQS.852: Sysplex limited. Jobs are not     *00512000
                         eligible because the jes job queue or queues  *00513000
                         that are related to these jobs have reached   *00514000
                         their limit of executing jobs. See limit on   *00515000
                         the JES class initialization statement.        00516000
BQSSC_LOCAL_QUEUE DS F   IRABQS.255: Local queue delay. Jobs eligible  *00517000
                         to be initiated on this system.                00518000
BQSSC_LOCAL_INELIGIBLE DS F IRABQS.261: Local ineligible. Jobs not     *00519000
                         eligible to be initiated on this system. This *00520000
                         includes operator held jobs, jobs held        *00521000
                         because of duplicate name, jobs busy on a jes *00522000
                         transmitter (offload and keep).                00523000
BQSSC_CONSTRAINT_AFFINITY DS F IRABQS.850: Constraint affinity. Jobs   *00524000
                         eligible to be initiated on constraint        *00525000
                         systems only.                                  00526000
         DS    CL4       IRABQS.670: reserved                           00527000
         ORG   BQSSC_MATRIX_MAP+X'00002888'                             00528000
BQSSC_MATRIX_MAP_LEN EQU *-BQSSC_MATRIX_MAP                             00529000
.L000A   ANOP                                                           00530000
         AIF   ('&BQSSC_ELEMENT_MAP' EQ 'NO').L000E                     00531000
         AIF   ('&DSECT' EQ 'YES').L000F                                00532000
         AIF   ('&BQSSC_ELEMENT_MAP' NE 'YES').L000E                    00533000
.L000F   ANOP                                                           00534000
*                                                                       00535000
*    *****************************************************************  00536000
*    *                                                               *  00537000
*    * IRABQS.616: block comment - bqssc_ELEMENT_MAP                 *  00538000
*    *                                                               *  00539000
*    *****************************************************************  00540000
*                                                                       00541000
* ********************************************************************  00542000
* *                                                                  *  00543000
* *    The bqssc_ELEMENT_MAP maps an element of the service          *  00544000
* *    class queue delays table. An element represents the           *  00545000
* *    delays encountered by jobs in wlm service class in a job      *  00546000
* *    entry subsystem.                                              *  00547000
* *                                                                  *  00548000
* ********************************************************************  00549000
*                                                                       00550000
*    *****************************************************************  00551000
*    *                                                               *  00552000
*    * IRABQS.633: This entry maps a service class queue delays in   *  00553000
*    * the bqssc_matrix_map.                                         *  00554000
*    *                                                               *  00555000
*    *****************************************************************  00556000
*                                                                       00557000
*                                                                       00558000
         AIF   ('&DSECT' EQ 'YES').L0010                                00559000
BQSSC_ELEMENT_MAP DS 0F                                                 00560000
         AGO   .L0011                                                   00561000
.L0010   ANOP                                                           00562000
BQSSC_ELEMENT_MAP DSECT                                                 00563000
.L0011   ANOP                                                           00564000
BQSSC_SYS_QUEUE DS F     IRABQS.408: Sysplex queue delay. Jobs         *00565000
                         eligible to be initiated somewhere in the     *00566000
                         sysplex.                                       00567000
BQSSC_SYS_INELIGIBLE DS F IRABQS.849: Sysplex ineligible. Jobs not     *00568000
                         eligible to be initiated on any system in the *00569000
                         sysplex. This includes operator held jobs,    *00570000
                         jobs held because of duplicate name, jobs     *00571000
                         busy on a jes transmitter (offload and keep).  00572000
BQSSC_SYS_LIMITED DS F   IRABQS.852: Sysplex limited. Jobs are not     *00573000
                         eligible because the jes job queue or queues  *00574000
                         that are related to these jobs have reached   *00575000
                         their limit of executing jobs. See limit on   *00576000
                         the JES class initialization statement.        00577000
BQSSC_LOCAL_QUEUE DS F   IRABQS.255: Local queue delay. Jobs eligible  *00578000
                         to be initiated on this system.                00579000
BQSSC_LOCAL_INELIGIBLE DS F IRABQS.261: Local ineligible. Jobs not     *00580000
                         eligible to be initiated on this system. This *00581000
                         includes operator held jobs, jobs held        *00582000
                         because of duplicate name, jobs busy on a jes *00583000
                         transmitter (offload and keep).                00584000
BQSSC_CONSTRAINT_AFFINITY DS F IRABQS.850: Constraint affinity. Jobs   *00585000
                         eligible to be initiated on constraint        *00586000
                         systems only.                                  00587000
         DS    CL4       IRABQS.670: reserved                           00588000
BQSSC_ELEMENT_MAP_LEN EQU *-BQSSC_ELEMENT_MAP                           00589000
.L000E   ANOP                                                           00590000
         AIF   ('&BQSRC_MATRIX_MAP' EQ 'NO').L0012                      00591000
         AIF   ('&DSECT' EQ 'YES').L0013                                00592000
         AIF   ('&BQSRC_MATRIX_MAP' NE 'YES').L0012                     00593000
.L0013   ANOP                                                           00594000
*                                                                       00595000
*    *****************************************************************  00596000
*    *                                                               *  00597000
*    * IRABQS.903: report class queue delay matrix                   *  00598000
*    *                                                               *  00599000
*    *****************************************************************  00600000
*                                                                       00601000
*                                                                       00602000
         AIF   ('&DSECT' EQ 'YES').L0014                                00603000
BQSRC_MATRIX_MAP DS 0D                                                  00604000
         AGO   .L0015                                                   00605000
.L0014   ANOP                                                           00606000
BQSRC_MATRIX_MAP DSECT                                                  00607000
.L0015   ANOP                                                           00608000
BQSRC_MAT_ID DS 0CL24    IRABQS.88: identification data                 00609000
BQSRC_MAT_HDR DS CL8     IRABQS.94: bqsrc_MAT identifier                00610000
BQSRC_MAT_VER DS CL1     IRABQS.100: Version                            00611000
BQSRC_MAT_COMPONENT DS CL5 IRABQS.106: Component id                     00612000
         DS    CL2       IRABQS.112: Reserved Table contents            00613000
BQSRC_MAT_LENGTH DS F    IRABQS.118: control block length               00614000
         DS    A         IRABQS.131: reserved                           00615000
         DS    CL48      IRABQS.969: reserved                           00616000
BQSRC_MATRIX DS 0CL20    IRABQS.137: Matrix of report classes with     *00617000
                         their related delays                           00618000
BQSRC_SYS_QUEUE DS F     IRABQS.279: Sysplex queue delay. Jobs         *00619000
                         eligible to be initiated somewhere in the     *00620000
                         sysplex.                                       00621000
BQSRC_SYS_INELIGIBLE DS F IRABQS.285: Sysplex ineligible. Jobs not     *00622000
                         eligible to be initiated on any system in the *00623000
                         sysplex. This includes operator held jobs,    *00624000
                         jobs held because of duplicate name, jobs     *00625000
                         busy on a jes transmitter (offload and keep).  00626000
BQSRC_SYS_LIMITED DS F   IRABQS.291: Sysplex limited. Jobs are not     *00627000
                         eligible because the jes job queue or queues  *00628000
                         that are related to these jobs have reached   *00629000
                         their limit of executing jobs. See limit on   *00630000
                         the JES class initialization statement.        00631000
         DS    CL8       IRABQS.820: reserved                           00632000
         ORG   BQSRC_MATRIX_MAP+X'00014034'                             00633000
BQSRC_MATRIX_MAP_LEN EQU *-BQSRC_MATRIX_MAP                             00634000
.L0012   ANOP                                                           00635000
         AIF   ('&BQSRC_ELEMENT_MAP' EQ 'NO').L0016                     00636000
         AIF   ('&DSECT' EQ 'YES').L0017                                00637000
         AIF   ('&BQSRC_ELEMENT_MAP' NE 'YES').L0016                    00638000
.L0017   ANOP                                                           00639000
*                                                                       00640000
*    *****************************************************************  00641000
*    *                                                               *  00642000
*    * IRABQS.917: block comment - bqsrc_ELEMENT_MAP                 *  00643000
*    *                                                               *  00644000
*    *****************************************************************  00645000
*                                                                       00646000
* ********************************************************************  00647000
* *                                                                  *  00648000
* *    The bqsrc_ELEMENT_MAP maps an element of the report           *  00649000
* *    class queue delays table. An element represents the           *  00650000
* *    delays encountered by jobs in wlm report class in a job       *  00651000
* *    entry subsystem.                                              *  00652000
* *                                                                  *  00653000
* ********************************************************************  00654000
*                                                                       00655000
*    *****************************************************************  00656000
*    *                                                               *  00657000
*    * IRABQS.906: This entry maps a report class queue delays in the*  00658000
*    * bqsrc_matrix_map.                                             *  00659000
*    *                                                               *  00660000
*    *****************************************************************  00661000
*                                                                       00662000
*                                                                       00663000
         AIF   ('&DSECT' EQ 'YES').L0018                                00664000
BQSRC_ELEMENT_MAP DS 0F                                                 00665000
         AGO   .L0019                                                   00666000
.L0018   ANOP                                                           00667000
BQSRC_ELEMENT_MAP DSECT                                                 00668000
.L0019   ANOP                                                           00669000
BQSRC_SYS_QUEUE DS F     IRABQS.279: Sysplex queue delay. Jobs         *00670000
                         eligible to be initiated somewhere in the     *00671000
                         sysplex.                                       00672000
BQSRC_SYS_INELIGIBLE DS F IRABQS.285: Sysplex ineligible. Jobs not     *00673000
                         eligible to be initiated on any system in the *00674000
                         sysplex. This includes operator held jobs,    *00675000
                         jobs held because of duplicate name, jobs     *00676000
                         busy on a jes transmitter (offload and keep).  00677000
BQSRC_SYS_LIMITED DS F   IRABQS.291: Sysplex limited. Jobs are not     *00678000
                         eligible because the jes job queue or queues  *00679000
                         that are related to these jobs have reached   *00680000
                         their limit of executing jobs. See limit on   *00681000
                         the JES class initialization statement.        00682000
         DS    CL8       IRABQS.820: reserved                           00683000
BQSRC_ELEMENT_MAP_LEN EQU *-BQSRC_ELEMENT_MAP                           00684000
.L0016   ANOP                                                           00685000
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 00686000
         AIF   ('&LIST' EQ 'YES').P4                                    00687000
.P3      ANOP                                                           00688000
         POP   PRINT                                                    00689000
.P4      ANOP                                                           00690000
.P_EXIT  ANOP                                                           00691000
         MEND                                                           00692000
**/ IRABQS_2:;                                                          00693000
* %IRABQS_INCLUDED = 'YES';                                             00694000
* %DCL ZCBPRINT CHAR EXT;                                               00695000
* %DEACTIVATE ZCBPRINT;                                                 00696000
* %DCL IRABQS_LIST CHAR EXT;                                            00697000
* %DEACTIVATE IRABQS_LIST;                                              00698000
* %IF IRABQS_LIST ^= 'NO' &                                             00699000
*    ZCBPRINT ^= 'NO' %THEN                                             00700000
*   %GOTO IRABQS_3;                                                     00701000
*   @LIST PUSH NOECHO;                                                  00702000
*   @LIST NOASSEMBLE NOECHO;                                            00703000
*   @LIST OFF C NOECHO;                                                 00704000
* %IRABQS_3:;                                                           00705000
*/* Start of PL/X Source                                             */ 00706000
*                                                                       00707000
*   /*****************************************************************/ 00708000
*   /*                                                               */ 00709000
*   /* IRABQS.671: Respecifies for based definitions.                */ 00710000
*   /*                                                               */ 00711000
*   /*****************************************************************/ 00712000
*                                                                       00713000
*   RESPECIFY                                                           00714000
*     BQS_MAP BASED(SMC_FIRST_BQS_PTR); /* Base the BQS_MAP          */ 00715000
*   RESPECIFY                                                           00716000
*     bqssc_MATRIX_MAP BASED(bqssc_MATRIX_CB_PTR);                      00717000
*   RESPECIFY                                                           00718000
*     bqsrc_MATRIX_MAP BASED(bqsrc_MATRIX_CB_PTR);                      00719000
*                                                                       00720000
*   /*****************************************************************/ 00721000
*   /*                                                               */ 00722000
*   /* IRABQS.1045: maximum number of service classes ever. There is */ 00723000
*   /* currently a limit of 100. 256 is being specified to allow     */ 00724000
*   /* future expansion. A high water mark in the BQS will prevent   */ 00725000
*   /* looking at the unused portion. From Rel. 1.10 these are 100   */ 00726000
*   /* external defined+ 8 internal WLM service classes + 256 EWLM   */ 00727000
*   /* service classes on byte boundary (=368).               @LEWLTM*/ 00728000
*   /*                                                               */ 00729000
*   /*****************************************************************/ 00730000
*                                                                       00731000
*   DECLARE                                                             00732000
*     BQS_MAX_SERVICE_CLASSES FIXED(31) CONSTANT(368);                  00733000
*                                                                       00734000
*   /*****************************************************************/ 00735000
*   /*                                                               */ 00736000
*   /* IRABQS.1057: maximum number of report classes.        @ME11904*/ 00737000
*   /*                                                               */ 00738000
*   /*****************************************************************/ 00739000
*                                                                       00740000
*   DECLARE                                                             00741000
*     BQS_MAX_REPORT_CLASSES FIXED(31) CONSTANT(4095);                  00742000
*                                                                       00743000
*   /*****************************************************************/ 00744000
*   /*                                                               */ 00745000
*   /* IRABQS.202: Version 1 of BQS_MAP                       @LEWLTM*/ 00746000
*   /*                                                               */ 00747000
*   /*****************************************************************/ 00748000
*                                                                       00749000
*   DECLARE                                                             00750000
*     BQSMAP_VERSION1 CHAR(1) CONSTANT('1');                            00751000
*                                                                       00752000
*   /*****************************************************************/ 00753000
*   /*                                                               */ 00754000
*   /* IRABQS.863: Current version of BQS_MAP                 @LEWLTM*/ 00755000
*   /*                                                               */ 00756000
*   /*****************************************************************/ 00757000
*                                                                       00758000
*   DECLARE                                                             00759000
*     BQSMAP_CVERSION CHAR(1) CONSTANT('1');                            00760000
*                                                                       00761000
*   /*****************************************************************/ 00762000
*   /*                                                               */ 00763000
*   /* IRABQS.712: Interface version Number 1                @WLMCINB*/ 00764000
*   /*                                                               */ 00765000
*   /*****************************************************************/ 00766000
*                                                                       00767000
*   DECLARE                                                             00768000
*     BQS_BQSINT_VERSION1 CHAR(1) CONSTANT('1');                        00769000
*                                                                       00770000
*   /*****************************************************************/ 00771000
*   /*                                                               */ 00772000
*   /* IRABQS.699: Interface version Number 2                @WLMCINB*/ 00773000
*   /*                                                               */ 00774000
*   /*****************************************************************/ 00775000
*                                                                       00776000
*   DECLARE                                                             00777000
*     BQS_BQSINT_VERSION2 CHAR(1) CONSTANT('2');                        00778000
*                                                                       00779000
*   /*****************************************************************/ 00780000
*   /*                                                               */ 00781000
*   /* IRABQS.668: Current interface version. Note: this version has */ 00782000
*   /* not been changed for the increased number of service classes  */ 00783000
*   /* for EWLM.                                              @LEWLTM*/ 00784000
*   /*                                                               */ 00785000
*   /*****************************************************************/ 00786000
*                                                                       00787000
*   DECLARE                                                             00788000
*     BQS_BQSINT_CVERSION CHAR(1) CONSTANT('2');                        00789000
*                                                                       00790000
*   /*****************************************************************/ 00791000
*   /*                                                               */ 00792000
*   /* IRABQS.548: Service class matrix version 1: Indicates the max.*/ 00793000
*   /* dimension of 256.                                             */ 00794000
*   /*                                                               */ 00795000
*   /*****************************************************************/ 00796000
*                                                                       00797000
*   DECLARE                                                             00798000
*     BQSSC_MAT_VERSION1 CHAR(1) CONSTANT('1');                         00799000
*                                                                       00800000
*   /*****************************************************************/ 00801000
*   /*                                                               */ 00802000
*   /* IRABQS.540: Service class matrix version 2: Indicates the max.*/ 00803000
*   /* dimension of 368.                                      @LEWLTM*/ 00804000
*   /*                                                               */ 00805000
*   /*****************************************************************/ 00806000
*                                                                       00807000
*   DECLARE                                                             00808000
*     BQSSC_MAT_VERSION2 CHAR(1) CONSTANT('2');                         00809000
*                                                                       00810000
*   /*****************************************************************/ 00811000
*   /*                                                               */ 00812000
*   /* IRABQS.72: Service class matrix current version.       @LEWLTM*/ 00813000
*   /*                                                               */ 00814000
*   /*****************************************************************/ 00815000
*                                                                       00816000
*   DECLARE                                                             00817000
*     BQSSC_MAT_CVERSION CHAR(1) CONSTANT('2');                         00818000
*                                                                       00819000
*   /*****************************************************************/ 00820000
*   /*                                                               */ 00821000
*   /* IRABQS.311: Report class matrix version 1              @LEWLTM*/ 00822000
*   /*                                                               */ 00823000
*   /*****************************************************************/ 00824000
*                                                                       00825000
*   DECLARE                                                             00826000
*     BQSRC_MAT_VERSION1 CHAR(1) CONSTANT('1');                         00827000
*                                                                       00828000
*   /*****************************************************************/ 00829000
*   /*                                                               */ 00830000
*   /* IRABQS.166: Report class matrix version 2             @ME11904*/ 00831000
*   /*                                                               */ 00832000
*   /*****************************************************************/ 00833000
*                                                                       00834000
*   DECLARE                                                             00835000
*     BQSRC_MAT_VERSION2 CHAR(1) CONSTANT('2');                         00836000
*                                                                       00837000
*   /*****************************************************************/ 00838000
*   /*                                                               */ 00839000
*   /* IRABQS.235: Report class matrix current version.      @ME11904*/ 00840000
*   /*                                                               */ 00841000
*   /*****************************************************************/ 00842000
*                                                                       00843000
*   DECLARE                                                             00844000
*     BQSRC_MAT_CVERSION CHAR(1) CONSTANT('2');                         00845000
*                                                                       00846000
*   /*****************************************************************/ 00847000
*   /*                                                               */ 00848000
*   /* IRABQS.598: This map contains the header information for the  */ 00849000
*   /* batch queues service and report class matricies.              */ 00850000
*   /*                                                               */ 00851000
*   /*****************************************************************/ 00852000
*                                                                       00853000
*   DECLARE                                                             00854000
*     1    BQS_MAP  BASED(*) BDY(DWORD),                                00855000
*      2    BQS_ID   BDY(WORD),     /* IRABQS.32: identification data*/ 00856000
*       3    BQS_HDR  CHAR(8),      /* IRABQS.38: BQS identifier     */ 00857000
*       3    BQS_VER  CHAR(1),      /* IRABQS.44: Version            */ 00858000
*       3    BQS_COMPONENT CHAR(5), /* IRABQS.50: Component id       */ 00859000
*       3    BQS_SUBPOOL FIXED(8),  /* IRABQS.56: BQS subpool        */ 00860000
*       3    BQS_BQSINT_VER CHAR(1), /* IRABQS.798: Interface Version   00861000
*                                                            @WLMCINB*/ 00862000
*       3    BQS_LENGTH FIXED(31),  /* IRABQS.62: control block         00863000
*                                      length                        */ 00864000
*      2    BQS_BATCH_SAMPLES BDY(WORD), /* IRABQS.872: sample data     00865000
*                                      from the subsystem            */ 00866000
*       3    BQS_SUBSYSNM CHAR(8),  /* IRABQS.316: Subsystem name       00867000
*                                      specified on Connect service. */ 00868000
*       3    BQS_SUBSYS_TYPE CHAR(4), /* IRABQS.555: Subsystem type     00869000
*                                      specified on Connect service. */ 00870000
*       3    *        CHAR(68),     /* IRABQS.519: reserved          */ 00871000
*       3    BQS_SC   BDY(WORD),    /* IRABQS.790: Service class        00872000
*                                      delay samples matrix             00873000
*                                      information                   */ 00874000
*        4    BQSSC_HIGH_INDEX FIXED(31), /* IRABQS.1090: index of      00875000
*                                      the highest service class        00876000
*                                      index for which there was a      00877000
*                                      sample.                       */ 00878000
*        4    BQSSC_MATRIX_CB_PTR POINTER(31), /* IRABQS.1097:          00879000
*                                      Pointer to the                   00880000
*                                      bqssc_MATRIX_MAP. Points to      00881000
*                                      start of header in control       00882000
*                                      block that contains the header   00883000
*                                      and the table.                */ 00884000
*        4    BQSSC_MATRIX_CB_SIZE FIXED(32), /* IRABQS.988: size of    00885000
*                                      the storage required for the     00886000
*                                      service class queue delay        00887000
*                                      matrix and its header.        */ 00888000
*        4    BQSSC_MATRIX_PTR POINTER(31), /* IRABQS.742: Pointer to   00889000
*                                      the bqssc_MATRIX. The field      00890000
*                                      exists for use in pointer        00891000
*                                      notation.                     */ 00892000
*        4    BQSSC_SERVICE_TOTAL FIXED(32), /* IRABQS.458: total       00893000
*                                      number of server class queue     00894000
*                                      delay elements. Total is         00895000
*                                      currently 100 but is being set   00896000
*                                      to 256 to match the maximum      00897000
*                                      size that the index will         00898000
*                                      allow. Enhanced to 368.          00899000
*                                                             @LEWLTM*/ 00900000
*        4    *        CHAR(48),    /* IRABQS.681: reserved          */ 00901000
*       3    BQS_RC   BDY(WORD),    /* IRABQS.426: Report class delay   00902000
*                                      samples matrix information    */ 00903000
*        4    BQSRC_HIGH_INDEX FIXED(31), /* IRABQS.768: index of the   00904000
*                                      highest report class for which   00905000
*                                      there was a sample.           */ 00906000
*        4    BQSRC_MATRIX_CB_PTR POINTER(31), /* IRABQS.1104:          00907000
*                                      Pointer to the                   00908000
*                                      bqsrc_MATRIX_MAP. This points    00909000
*                                      to the header that precedes      00910000
*                                      the bqsrc_matrix.             */ 00911000
*        4    BQSRC_MATRIX_CB_SIZE FIXED(32), /* IRABQS.1110: size of   00912000
*                                      the storage required for the     00913000
*                                      report class queue delay         00914000
*                                      matrix and its header.        */ 00915000
*        4    BQSRC_MATRIX_PTR POINTER(31), /* IRABQS.1116: Pointer     00916000
*                                      to the bqsrc_matrix. The field   00917000
*                                      exists for use in pointer        00918000
*                                      notation. This field points to   00919000
*                                      the table itself.             */ 00920000
*        4    BQSRC_REPORT_TOTAL FIXED(32), /* IRABQS.1122: total       00921000
*                                      number of report class queue     00922000
*                                      delay elements.               */ 00923000
*        4    *        CHAR(48),    /* IRABQS.1128: reserved         */ 00924000
*       3    *        CHAR(48),     /* IRABQS.518: reserved          */ 00925000
*      2    BQS_NEXT POINTER(31),   /* IRABQS.149: address of next      00926000
*                                      bqs in cycle list             */ 00927000
*      2    BQS_PREV POINTER(31),   /* IRABQS.155: address of prev      00928000
*                                      bqs in cycle list             */ 00929000
*      2    BQS_FLAGS BIT(32) ABNORMAL, /* IRABQS.1012: flags related   00930000
*                                      to state of the subsystem        00931000
*                                      samples on wlm or srm side.   */ 00932000
*       3    BQS_FLAGS_INUSE BIT(1), /* IRABQS.1009: if flag is set     00933000
*                                      the entry is currently in use.   00934000
*                                      If the flag is off the entry     00935000
*                                      does not currently represent     00936000
*                                      subsystem data. This flag is     00937000
*                                      not set until the cb has been    00938000
*                                      initialized by iwmbreg. This     00939000
*                                      is set off when the subsystem    00940000
*                                      that occupies the entry has      00941000
*                                      terminated.                   */ 00942000
*      2    BQS_ACCUM_NEXT POINTER(31), /* IRABQS.168: address of       00943000
*                                      next bqs in accumulator list  */ 00944000
*      2    BQS_ACCUM_PREV POINTER(31), /* IRABQS.433: address of       00945000
*                                      prev bqs in accumulator list  */ 00946000
*      2    BQS_CYCLE_PTR POINTER(31), /* IRABQS.1073: Cycle ptr in     00947000
*                                      the accumulator bqs           */ 00948000
*      2    BQS_SVDEF,              /* IRABQS.1008: The service         00949000
*                                      definition id provided in the    00950000
*                                      IWMBSMP macro invocation.     */ 00951000
*       3    SVDIDNAM CHAR(8),      /* IWMSVDID.44: Name of the         00952000
*                                      service definition from which    00953000
*                                      the service policy was           00954000
*                                      extracted                     */ 00955000
*       3    SVDIDTDI BIT(64),      /* IWMSVDID.50: Time/date (STCK     00956000
*                                      format) that the service         00957000
*                                      definition was installed      */ 00958000
*       3    SVDIDUSE CHAR(8),      /* IWMSVDID.56: Userid of the       00959000
*                                      service administrator that       00960000
*                                      installed the service            00961000
*                                      definition                    */ 00962000
*       3    SVDIDSYS CHAR(8),      /* IWMSVDID.62: Name of the         00963000
*                                      system on which the service      00964000
*                                      definition was installed      */ 00965000
*      2    BQS_ACCUM_PTR POINTER(31), /* IRABQS.844: Accumulator ptr   00966000
*                                      in the cycle bqs. Update is      00967000
*                                      not serialized at creation of    00968000
*                                      the cycle bqs. It is updated     00969000
*                                      at the creation of the           00970000
*                                      accumulator bqs under the WLMQ   00971000
*                                      lock. This field is only used    00972000
*                                      in recovery. The value is not    00973000
*                                      filled in until the              00974000
*                                      accumulator BQS is built      */ 00975000
*      2    *        CHAR(32);      /* IRABQS.810: reserved          */ 00976000
*                                                                       00977000
*   /*****************************************************************/ 00978000
*   /*                                                               */ 00979000
*   /* IRABQS.207: This map contains the interface information for   */ 00980000
*   /* the batch queues service and report class matricies. The      */ 00981000
*   /* bloick is used by the jes to pass the matrices to srm via a   */ 00982000
*   /* sysevent.                                                     */ 00983000
*   /*                                                               */ 00984000
*   /*****************************************************************/ 00985000
*                                                                       00986000
*   DECLARE                                                             00987000
*     1    BQSINT   BASED(*) BDY(DWORD),                                00988000
*      2    BQSINT_ID BDY(WORD),    /* IRABQS.653: identification       00989000
*                                      data                          */ 00990000
*       3    BQSINT_HDR CHAR(8),    /* IRABQS.659: BQS identifier    */ 00991000
*       3    BQSINT_VER CHAR(1),    /* IRABQS.641: Version           */ 00992000
*       3    BQSINT_COMPONENT CHAR(5), /* IRABQS.227: Component id   */ 00993000
*       3    *        CHAR(2),      /* IRABQS.565: Reserved          */ 00994000
*       3    BQSINT_LENGTH FIXED(31), /* IRABQS.568: control block      00995000
*                                      length                        */ 00996000
*      2    BQSINT_BATCH_SAMPLES BDY(WORD), /* IRABQS.436: sample       00997000
*                                      data sent to srm/wlm          */ 00998000
*       3    BQS_SUBSYSNM CHAR(8),  /* IRABQS.316: Subsystem name       00999000
*                                      specified on Connect service. */ 01000000
*       3    BQS_SUBSYS_TYPE CHAR(4), /* IRABQS.555: Subsystem type     01001000
*                                      specified on Connect service. */ 01002000
*       3    *        CHAR(68),     /* IRABQS.519: reserved          */ 01003000
*       3    BQS_SC   BDY(WORD),    /* IRABQS.790: Service class        01004000
*                                      delay samples matrix             01005000
*                                      information                   */ 01006000
*        4    BQSSC_HIGH_INDEX FIXED(31), /* IRABQS.1090: index of      01007000
*                                      the highest service class        01008000
*                                      index for which there was a      01009000
*                                      sample.                       */ 01010000
*        4    BQSSC_MATRIX_CB_PTR POINTER(31), /* IRABQS.1097:          01011000
*                                      Pointer to the                   01012000
*                                      bqssc_MATRIX_MAP. Points to      01013000
*                                      start of header in control       01014000
*                                      block that contains the header   01015000
*                                      and the table.                */ 01016000
*        4    BQSSC_MATRIX_CB_SIZE FIXED(32), /* IRABQS.988: size of    01017000
*                                      the storage required for the     01018000
*                                      service class queue delay        01019000
*                                      matrix and its header.        */ 01020000
*        4    BQSSC_MATRIX_PTR POINTER(31), /* IRABQS.742: Pointer to   01021000
*                                      the bqssc_MATRIX. The field      01022000
*                                      exists for use in pointer        01023000
*                                      notation.                     */ 01024000
*        4    BQSSC_SERVICE_TOTAL FIXED(32), /* IRABQS.458: total       01025000
*                                      number of server class queue     01026000
*                                      delay elements. Total is         01027000
*                                      currently 100 but is being set   01028000
*                                      to 256 to match the maximum      01029000
*                                      size that the index will         01030000
*                                      allow. Enhanced to 368.          01031000
*                                                             @LEWLTM*/ 01032000
*        4    *        CHAR(48),    /* IRABQS.681: reserved          */ 01033000
*       3    BQS_RC   BDY(WORD),    /* IRABQS.426: Report class delay   01034000
*                                      samples matrix information    */ 01035000
*        4    BQSRC_HIGH_INDEX FIXED(31), /* IRABQS.768: index of the   01036000
*                                      highest report class for which   01037000
*                                      there was a sample.           */ 01038000
*        4    BQSRC_MATRIX_CB_PTR POINTER(31), /* IRABQS.1104:          01039000
*                                      Pointer to the                   01040000
*                                      bqsrc_MATRIX_MAP. This points    01041000
*                                      to the header that precedes      01042000
*                                      the bqsrc_matrix.             */ 01043000
*        4    BQSRC_MATRIX_CB_SIZE FIXED(32), /* IRABQS.1110: size of   01044000
*                                      the storage required for the     01045000
*                                      report class queue delay         01046000
*                                      matrix and its header.        */ 01047000
*        4    BQSRC_MATRIX_PTR POINTER(31), /* IRABQS.1116: Pointer     01048000
*                                      to the bqsrc_matrix. The field   01049000
*                                      exists for use in pointer        01050000
*                                      notation. This field points to   01051000
*                                      the table itself.             */ 01052000
*        4    BQSRC_REPORT_TOTAL FIXED(32), /* IRABQS.1122: total       01053000
*                                      number of report class queue     01054000
*                                      delay elements.               */ 01055000
*        4    *        CHAR(48),    /* IRABQS.1128: reserved         */ 01056000
*       3    *        CHAR(48),     /* IRABQS.518: reserved          */ 01057000
*      2    *        CHAR(48);      /* IRABQS.694: reserved          */ 01058000
*                                                                       01059000
*   /*****************************************************************/ 01060000
*   /*                                                               */ 01061000
*   /* IRABQS.604: service class queue delay matrix                  */ 01062000
*   /*                                                               */ 01063000
*   /*****************************************************************/ 01064000
*                                                                       01065000
*   DECLARE                                                             01066000
*     1    BQSSC_MATRIX_MAP BASED(*) BDY(DWORD),                        01067000
*      2    BQSSC_MAT_ID BDY(WORD), /* IRABQS.345: identification       01068000
*                                      data                          */ 01069000
*       3    BQSSC_MAT_HDR CHAR(8), /* IRABQS.351: bqssc_MAT            01070000
*                                      identifier                    */ 01071000
*       3    BQSSC_MAT_VER CHAR(1), /* IRABQS.357: Version           */ 01072000
*       3    BQSSC_MAT_COMPONENT CHAR(5), /* IRABQS.363: Component id*/ 01073000
*       3    *        CHAR(2),      /* IRABQS.369: Reserved Table       01074000
*                                      contents                      */ 01075000
*       3    BQSSC_MAT_LENGTH FIXED(31), /* IRABQS.375: control block   01076000
*                                      length                        */ 01077000
*       3    *        POINTER(31),  /* IRABQS.381: reserved          */ 01078000
*      2    *        CHAR(48),      /* IRABQS.669: reserved          */ 01079000
*      2    BQSSC_MATRIX(368) BDY(WORD), /* IRABQS.387: Matrix of       01080000
*                                      service classes with their       01081000
*                                      related delays. From Rel. 1.10   01082000
*                                      these are 100 external defined   01083000
*                                      + 8 internal WLM service         01084000
*                                      classes + 256 EWLM service       01085000
*                                      classes on byte boundary         01086000
*                                      (=368).                @LEWLTM*/ 01087000
*       3    BQSSC_SYS_QUEUE FIXED(32), /* IRABQS.408: Sysplex queue    01088000
*                                      delay. Jobs eligible to be       01089000
*                                      initiated somewhere in the       01090000
*                                      sysplex.                      */ 01091000
*       3    BQSSC_SYS_INELIGIBLE FIXED(32), /* IRABQS.849: Sysplex     01092000
*                                      ineligible. Jobs not eligible    01093000
*                                      to be initiated on any system    01094000
*                                      in the sysplex. This includes    01095000
*                                      operator held jobs, jobs held    01096000
*                                      because of duplicate name,       01097000
*                                      jobs busy on a jes transmitter   01098000
*                                      (offload and keep).           */ 01099000
*       3    BQSSC_SYS_LIMITED FIXED(32), /* IRABQS.852: Sysplex        01100000
*                                      limited. Jobs are not eligible   01101000
*                                      because the jes job queue or     01102000
*                                      queues that are related to       01103000
*                                      these jobs have reached their    01104000
*                                      limit of executing jobs. See     01105000
*                                      limit on the JES class           01106000
*                                      initialization statement.     */ 01107000
*       3    BQSSC_LOCAL_QUEUE FIXED(32), /* IRABQS.255: Local queue    01108000
*                                      delay. Jobs eligible to be       01109000
*                                      initiated on this system.     */ 01110000
*       3    BQSSC_LOCAL_INELIGIBLE FIXED(32), /* IRABQS.261: Local     01111000
*                                      ineligible. Jobs not eligible    01112000
*                                      to be initiated on this          01113000
*                                      system. This includes operator   01114000
*                                      held jobs, jobs held because     01115000
*                                      of duplicate name, jobs busy     01116000
*                                      on a jes transmitter (offload    01117000
*                                      and keep).                    */ 01118000
*       3    BQSSC_CONSTRAINT_AFFINITY FIXED(32), /* IRABQS.850:        01119000
*                                      Constraint affinity. Jobs        01120000
*                                      eligible to be initiated on      01121000
*                                      constraint systems only.         01122000
*                                                            @WLMCINB*/ 01123000
*       3    *        CHAR(4);      /* IRABQS.670: reserved  @WLMCINB*/ 01124000
*                                                                       01125000
*   /*****************************************************************/ 01126000
*   /*                                                               */ 01127000
*   /* IRABQS.616: block comment - bqssc_ELEMENT_MAP                 */ 01128000
*   /*                                                               */ 01129000
*   /*****************************************************************/ 01130000
*                                                                       01131000
*/********************************************************************/ 01132000
*/*                                                                  */ 01133000
*/*    The bqssc_ELEMENT_MAP maps an element of the service          */ 01134000
*/*    class queue delays table. An element represents the           */ 01135000
*/*    delays encountered by jobs in wlm service class in a job      */ 01136000
*/*    entry subsystem.                                              */ 01137000
*/*                                                                  */ 01138000
*/********************************************************************/ 01139000
*                                                                       01140000
*   /*****************************************************************/ 01141000
*   /*                                                               */ 01142000
*   /* IRABQS.633: This entry maps a service class queue delays in   */ 01143000
*   /* the bqssc_matrix_map.                                         */ 01144000
*   /*                                                               */ 01145000
*   /*****************************************************************/ 01146000
*                                                                       01147000
*   DECLARE                                                             01148000
*     1    BQSSC_ELEMENT_MAP BASED(*) BDY(WORD),                        01149000
*      2    BQSSC_SYS_QUEUE FIXED(32), /* IRABQS.408: Sysplex queue     01150000
*                                      delay. Jobs eligible to be       01151000
*                                      initiated somewhere in the       01152000
*                                      sysplex.                      */ 01153000
*      2    BQSSC_SYS_INELIGIBLE FIXED(32), /* IRABQS.849: Sysplex      01154000
*                                      ineligible. Jobs not eligible    01155000
*                                      to be initiated on any system    01156000
*                                      in the sysplex. This includes    01157000
*                                      operator held jobs, jobs held    01158000
*                                      because of duplicate name,       01159000
*                                      jobs busy on a jes transmitter   01160000
*                                      (offload and keep).           */ 01161000
*      2    BQSSC_SYS_LIMITED FIXED(32), /* IRABQS.852: Sysplex         01162000
*                                      limited. Jobs are not eligible   01163000
*                                      because the jes job queue or     01164000
*                                      queues that are related to       01165000
*                                      these jobs have reached their    01166000
*                                      limit of executing jobs. See     01167000
*                                      limit on the JES class           01168000
*                                      initialization statement.     */ 01169000
*      2    BQSSC_LOCAL_QUEUE FIXED(32), /* IRABQS.255: Local queue     01170000
*                                      delay. Jobs eligible to be       01171000
*                                      initiated on this system.     */ 01172000
*      2    BQSSC_LOCAL_INELIGIBLE FIXED(32), /* IRABQS.261: Local      01173000
*                                      ineligible. Jobs not eligible    01174000
*                                      to be initiated on this          01175000
*                                      system. This includes operator   01176000
*                                      held jobs, jobs held because     01177000
*                                      of duplicate name, jobs busy     01178000
*                                      on a jes transmitter (offload    01179000
*                                      and keep).                    */ 01180000
*      2    BQSSC_CONSTRAINT_AFFINITY FIXED(32), /* IRABQS.850:         01181000
*                                      Constraint affinity. Jobs        01182000
*                                      eligible to be initiated on      01183000
*                                      constraint systems only.         01184000
*                                                            @WLMCINB*/ 01185000
*      2    *        CHAR(4);       /* IRABQS.670: reserved  @WLMCINB*/ 01186000
*                                                                       01187000
*   /*****************************************************************/ 01188000
*   /*                                                               */ 01189000
*   /* IRABQS.903: report class queue delay matrix                   */ 01190000
*   /*                                                               */ 01191000
*   /*****************************************************************/ 01192000
*                                                                       01193000
*   DECLARE                                                             01194000
*     1    BQSRC_MATRIX_MAP BASED(*) BDY(DWORD),                        01195000
*      2    BQSRC_MAT_ID BDY(WORD), /* IRABQS.88: identification data*/ 01196000
*       3    BQSRC_MAT_HDR CHAR(8), /* IRABQS.94: bqsrc_MAT             01197000
*                                      identifier                    */ 01198000
*       3    BQSRC_MAT_VER CHAR(1), /* IRABQS.100: Version           */ 01199000
*       3    BQSRC_MAT_COMPONENT CHAR(5), /* IRABQS.106: Component id*/ 01200000
*       3    *        CHAR(2),      /* IRABQS.112: Reserved Table       01201000
*                                      contents                      */ 01202000
*       3    BQSRC_MAT_LENGTH FIXED(31), /* IRABQS.118: control block   01203000
*                                      length                        */ 01204000
*       3    *        POINTER(31),  /* IRABQS.131: reserved          */ 01205000
*      2    *        CHAR(48),      /* IRABQS.969: reserved          */ 01206000
*      2    BQSRC_MATRIX(4095) BDY(WORD), /* IRABQS.137: Matrix of      01207000
*                                      report classes with their        01208000
*                                      related delays        @ME11904*/ 01209000
*       3    BQSRC_SYS_QUEUE FIXED(32), /* IRABQS.279: Sysplex queue    01210000
*                                      delay. Jobs eligible to be       01211000
*                                      initiated somewhere in the       01212000
*                                      sysplex.                      */ 01213000
*       3    BQSRC_SYS_INELIGIBLE FIXED(32), /* IRABQS.285: Sysplex     01214000
*                                      ineligible. Jobs not eligible    01215000
*                                      to be initiated on any system    01216000
*                                      in the sysplex. This includes    01217000
*                                      operator held jobs, jobs held    01218000
*                                      because of duplicate name,       01219000
*                                      jobs busy on a jes transmitter   01220000
*                                      (offload and keep).           */ 01221000
*       3    BQSRC_SYS_LIMITED FIXED(32), /* IRABQS.291: Sysplex        01222000
*                                      limited. Jobs are not eligible   01223000
*                                      because the jes job queue or     01224000
*                                      queues that are related to       01225000
*                                      these jobs have reached their    01226000
*                                      limit of executing jobs. See     01227000
*                                      limit on the JES class           01228000
*                                      initialization statement.     */ 01229000
*       3    *        CHAR(8);      /* IRABQS.820: reserved          */ 01230000
*                                                                       01231000
*   /*****************************************************************/ 01232000
*   /*                                                               */ 01233000
*   /* IRABQS.917: block comment - bqsrc_ELEMENT_MAP                 */ 01234000
*   /*                                                               */ 01235000
*   /*****************************************************************/ 01236000
*                                                                       01237000
*/********************************************************************/ 01238000
*/*                                                                  */ 01239000
*/*    The bqsrc_ELEMENT_MAP maps an element of the report           */ 01240000
*/*    class queue delays table. An element represents the           */ 01241000
*/*    delays encountered by jobs in wlm report class in a job       */ 01242000
*/*    entry subsystem.                                              */ 01243000
*/*                                                                  */ 01244000
*/********************************************************************/ 01245000
*                                                                       01246000
*   /*****************************************************************/ 01247000
*   /*                                                               */ 01248000
*   /* IRABQS.906: This entry maps a report class queue delays in the*/ 01249000
*   /* bqsrc_matrix_map.                                             */ 01250000
*   /*                                                               */ 01251000
*   /*****************************************************************/ 01252000
*                                                                       01253000
*   DECLARE                                                             01254000
*     1    BQSRC_ELEMENT_MAP BASED(*) BDY(WORD),                        01255000
*      2    BQSRC_SYS_QUEUE FIXED(32), /* IRABQS.279: Sysplex queue     01256000
*                                      delay. Jobs eligible to be       01257000
*                                      initiated somewhere in the       01258000
*                                      sysplex.                      */ 01259000
*      2    BQSRC_SYS_INELIGIBLE FIXED(32), /* IRABQS.285: Sysplex      01260000
*                                      ineligible. Jobs not eligible    01261000
*                                      to be initiated on any system    01262000
*                                      in the sysplex. This includes    01263000
*                                      operator held jobs, jobs held    01264000
*                                      because of duplicate name,       01265000
*                                      jobs busy on a jes transmitter   01266000
*                                      (offload and keep).           */ 01267000
*      2    BQSRC_SYS_LIMITED FIXED(32), /* IRABQS.291: Sysplex         01268000
*                                      limited. Jobs are not eligible   01269000
*                                      because the jes job queue or     01270000
*                                      queues that are related to       01271000
*                                      these jobs have reached their    01272000
*                                      limit of executing jobs. See     01273000
*                                      limit on the JES class           01274000
*                                      initialization statement.     */ 01275000
*      2    *        CHAR(8);       /* IRABQS.820: reserved          */ 01276000
*/* End of PL/X Source                                               */ 01277000
* %IF IRABQS_LIST ^= 'NO' &                                             01278000
*    ZCBPRINT ^= 'NO' %THEN                                             01279000
*   %GOTO IRABQS_4;                                                     01280000
*   @LIST POP NOECHO;                                                   01281000
* %IRABQS_4:;                                                           01282000
* %END;                                                                 01283000
