*        %GOTO CMCTPLS1; /*                                             00010014
         MACRO                                                          00020014
         IRACMCT &DSECT=YES                                             00030014
         IEZBITS                                                     */ 00040014
*%CMCTPLS1:  ;                                                          00050014
*/* START OF SPECIFICATIONS ******************************************/ 00060014
*/*  EXTERNAL CLASSIFICATION:                                        */ 00070014
*/*  DMTI: BASE                                                      */ 00080014
*/*  GUPI: FIELDS                                                    */ 00090014
*/*                CMCTCPMB                                          */ 00100014
*/*                CMCTCPOK                                          */ 00110014
*/*                CMCTECMF                                  @OA22918*/ 00111014
*/*                CMCTCRCT                                          */ 00112014
*/*                CMCTCMC2                                  @WA38548*/ 00113014
*/*                CMCTCPM2                                  @WA38548*/ 00114014
*/*                CMCTCPMX                                  @OA22918*/ 00115014
*/*                CMCTCpmfStateInfo                         @WA38548*/ 00116014
*/*                CMCTECMBPTR                                   @L7A*/ 00117014
*/*                CMCTECMBALET                                  @L7A*/ 00118014
*/*                CMCTECMBMODE                                  @L7A*/ 00119014
*/*                                                                  */ 00120014
*/*  END OF EXTERNAL CLASSIFICATION:                                 */ 00130014
*/*                                                                  */ 00140014
*/**** PROPRIETARY-STATEMENT******************************************/ 00150014
*/*01* PROPRIETARY STATEMENT=                                        */ 00160014
*/*                                                                  */ 00170014
*/*  COPYRIGHT =                                                     */ 00180014
*/*      LICENSED MATERIALS - PROPERTY OF IBM                        */ 00190014
*/*      5694-A01  COPYRIGHT IBM CORP. 1982, 2009                    */ 00200014
*/*                                                                  */ 00210014
*/**** END-OF-PROPRIETARY-STATEMENT***********************************/ 00220014
*/*                                                                  */ 00230014
*/*01* DESCRIPTIVE-NAME:  Channel Measurement Control Table          */ 00240014
*/*02*  ACRONYM:   CMCT                                              */ 00250014
*/*                                                                  */ 00260014
*/*01* MACRO-NAME: IRACMCT                                           */ 00270014
*/*                                                                  */ 00280014
*/*01* DSECT-NAME: CMCT                                              */ 00290014
*/*                                                                  */ 00300014
*/*01* COMPONENT:  SRM (SC1CX)                                       */ 00310014
*/*                                                                  */ 00320014
*/*01* EYE-CATCHER: 'CMCT'                                           */ 00330014
*/*02*  OFFSET: 00                                                   */ 00340014
*/*02*  LENGTH: 4 bytes                                              */ 00350014
*/*                                                                  */ 00360014
*/*01* STORAGE-ATTRIBUTES:                                           */ 00370014
*/*02*  SUBPOOL: Extended Nucleus (Module IRARMCNS)                  */ 00380014
*/*02*  KEY:     Key 0                                               */ 00390014
*/*02*  RESIDENCY: Above 16MB                                        */ 00400014
*/*                                                                  */ 00410014
*/*01* SIZE: See Assembler Listing                                   */ 00420014
*/*                                                                  */ 00430014
*/*01* CREATED BY:                                                   */ 00440014
*/*     IEAVNP10                                                     */ 00450014
*/*     IEAVNP1F                                                     */ 00460014
*/*                                                                  */ 00470014
*/*01* POINTED TO BY:                                                */ 00480014
*/*     RMCTCMCT field of Resource Manager Control Table (RMCT)      */ 00490014
*/*                                                                  */ 00500014
*/*01* SERIALIZATION:                                                */ 00510014
*/*     Updates are serialized by the SRM Lock.                      */ 00520014
*/*                                                                  */ 00530014
*/*01* FUNCTION:                                                     */ 00540014
*/*02*    The CMCT contains the information needed to locate the     */ 00550014
*/*       control blocks which are used by the system resource       */ 00560014
*/*       manager for the collection of i/o measurement data.  It    */ 00570014
*/*       also contains summary status information related to this   */ 00580014
*/*       function.                                                  */ 00590014
*/*                                                                  */ 00600014
*/*01* METHOD OF ACCESS:                                             */ 00610014
*/*02*  ASM:                                                         */ 00620014
*/*          DSECT=YES If DSECT is to be produced.           @YA66862*/ 00630014
*/*                                                                  */ 00640014
*/*          DSECT=NO  If DSECT is not to be produced.               */ 00650014
*/*                                                                  */ 00660014
*/*          NOTE: The ASM form of the macro is coded with           */ 00670014
*/*          'DC' instructions, so that the macro may be used        */ 00680014
*/*          to assemble the initial field values for the            */ 00690014
*/*          IRARMCNS module, which contains the CMCT.               */ 00700014
*/*                                                                  */ 00710014
*/*          USING on CMCT gives addressability to all symbols.      */ 00720014
*/*                                                                  */ 00730014
*/*02*  PL/AS:                                                       */ 00740014
*/*        - %CMCTLEVL='userlevl' if the CMCT mapping is to be       */ 00750014
*/*          concatenated with a previous declaration, with the      */ 00760014
*/*          CMCT being assigned the indicated structure level.      */ 00770014
*/*                                                                  */ 00780014
*/*        - %CMCT9999=','  if the structure should not be closed.   */ 00790014
*/*                                                                  */ 00800014
*/*01* STATUS: HBB7760                                               */ 00810016
*/*                                                                  */ 00820014
*/*01* DELETED BY:  N/A                                              */ 00830014
*/*                                                                  */ 00840014
*/*01* FREQUENCY:   One per system image                             */ 00850014
*/*                                                                  */ 00860014
*/*01* DEPENDENCIES: The CMCT is part of nucleus module IRARMCNS.    */ 00870014
*/*                  If the CMCT expands, a recompile of IRARMCNS    */ 00880014
*/*                  is necessary.                                   */ 00890014
*/*                                                                  */ 00900014
*/*01* DISTRIBUTION LIBRARY: APVTMACS                                */ 00910014
*/*                                                                  */ 00920014
*/*01* CHANGE ACTIVITY:                                              */ 00930014
*/*  A000000-999999                                          @G860P26*/ 00940014
*/*                                                                  */ 00950014
*/*   OY66862 - 07/25/94 - macro logic added in order to avoid       */ 00960014
*/*                        acon undefined externs for DSECT=YES      */ 00970014
*/*                                                         @YA66862 */ 00980014
*/*                                                                  */ 00990014
*/* $H5=SADMEAS  JBB2133  830928 PDJK  :SAD CHANNEL MEASUREMENTS @H5A*/ 01000014
*/* $L1=WSMGT    HBB4420  900716 PD88AK: WORKING SET MANAGEMENT      */ 01010014
*/*                                      SUPPORT                 @L1A*/ 01020014
*/* $L3=DYNAM    HBB4420  900122 PD88DO:DYNAMIC I/O SUPPORT      @L3A*/ 01030014
*/* $P1=PH30871  HBB4420  900917 PD88AI:ADD BIT FLAG FOR             */ 01040014
*/*                                     ASYNCHRONOUS SPI CALL TO     */ 01050014
*/*                                     WRITE SADB DATA          @P1A*/ 01060014
*/*                                                                  */ 01070014
*/* $T1=OY28795 HBB4420 910314 PD88BH: UPDATE RMCTRSEQ TO HANDLE A   */ 01080014
*/*                                    FULLWORD INTEGRITY INDEX  @T1A*/ 01090014
*/* $H1=PRSMM    HBB4430  920323 PD88MF: PR/SM MIF Support       @H1A*/ 01100014
*/* $D1=DKB0024  HBB4430  920429 PD88MF: CPMF Installed bit support  */ 01110014
*/*                                                              @D1A*/ 01120014
*/* $P2=PKB3247  HBB4430  920617 PD88MF: Ensure that reset of time   */ 01130014
*/*                                      interval (when TIMEREXP is  */ 01140014
*/*                                      re-issued) will not cause   */ 01150014
*/*                                      85F RC4 abend.          @P2A*/ 01160014
*/* $P4=PKB3835  HBB4430  920901 PD88MF: Add indicator to allow      */ 01170014
*/*                                      IRARMCHS to determine when  */ 01180014
*/*                                      a delayed CPMF restart was  */ 01190014
*/*                                      issued, to avoid infinite   */ 01200014
*/*                                      CPMF restart loop.      @P4A*/ 01210014
*/*                                                                  */ 01220014
*/* $L4=WLMI     HBB5510  921231 PD44BB: WORKLOAD MANAGER 1      @L4A*/ 01230014
*/*                                                                  */ 01240014
*/* $L6=4DGIT    HBB5510  930304 PD88IX: 4-DIGIT DEVICE NUMBER       */ 01250014
*/*                                      SUPPORT                 @L6A*/ 01260014
*/*                                                                  */ 01270014
*/* $P6=PIG0871  HBB5510  930617 PD44XL: Prevent shutdown of CPMF    */ 01280014
*/*                                      when stop/start         @P6A*/ 01290014
*/*                                                                  */ 01300014
*/* $P7=PNT1294  HBB5510  940202 PD88IK: OW01261 - CDPI change   @P7A*/ 01310014
*/*                                                                  */ 01320014
*/* $OW38548     HBB6608  980406 PDKN  : FICON Support               */ 01330014
*/*                                                                  */ 01340014
*/* $L7=MCSEX    HBB7709  020215 PDON  : Multichannel Subsystem -    */ 01350014
*/*                                      add ECMB data           @L7A*/ 01360014
*/*                                                                  */ 01370014
*/* $WLMPMCS     HBB7709  020408 3241MB: Manfred Baudisch - MCSS     */ 01380014
*/*                                      dropped CMCTSAMP (2 byte)   */ 01390014
*/*                                      and CMCTSSCH (2 bytes)      */ 01400014
*/*                                      and replaced it by CMCTSAM4 */ 01410014
*/*                                      (4 bytes)                   */ 01420014
*/*                                                                  */ 01430014
*/* $PJK0638     HBB7709  030707 3241GV: Guenter Vater               */ 01440014
*/*                                      Add return code from        */ 01450014
*/*                                      ?IOSCSCM call.              */ 01451014
*/*                                                                  */ 01452014
*/* $PJK1060     HBB7709  031014 3241MB: Manfred Baudisch            */ 01452114
*/*                                      changed CMCTVERS to '2'     */ 01452214
*/*                                      for ECMB extensions         */ 01452314
*/*                                                                  */ 01452414
*/* $ME02901     HBB7730  050210 3241GV: Guenter Vater               */ 01452514
*/*                                      Add CM stop rsn code for IOS*/ 01452614
*/*                                                                  */ 01452714
*/* $OA22918     HBB7760  080318 3241AK: Anette Kempfert             */ 01452814
*/*                                      Enhanced Channel Measurement*/ 01452914
*/*                                      Facility Support            */ 01453014
*/*                                                                  */ 01453117
*/* $LSSID6      HBB77C0  180723 3241AK: Anette Kempfert             */ 01453217
*/*                                      Infrastructure Changes      */ 01453332
*/*                                                                  */ 01453517
*/* END OF SPECIFICATIONS ********************************************/ 01453617
*      %GOTO CMCTPLS2; /*                                               01453717
       AGO   .CMCTAL1                                                */ 01453817
*/*                                                                     01453917
.CMCTAL1 ANOP                                                           01454017
         SPACE 1                                                        01454117
         AIF   ('&DSECT' EQ 'NO').CMCTAL2                               01454217
CMCT     DSECT                                                          01454317
         AGO   .CMCTAL3                                                 01454417
.CMCTAL2 ANOP                                                           01454517
         DS    0D                                                       01454617
CMCT     EQU   *                                                        01454717
.CMCTAL3 ANOP                                                           01454817
         SPACE 1                                                        01454917
CMCTNAME DC   C'CMCT' -   ACRONYM 'CMCT'                                01455017
CMCTVERS DC   XL1'02'     CMCT Version number                  @PJK1060 01455117
CMCTVER0 EQU  00          Base CMCT                            @WA38548 01455217
CMCTVER1 EQU  01          CMCT includes extended measurement mode       01455317
*                          support                             @WA38548 01455417
CMCTRSV1 DC   XL3'00'     Reserved                             @WA38548 01455517
CMCTDBVT DC   A(0) -      ADDR OF DBVT                                  01455617
CMCTCPMT DC   A(0) -      ADDR OF CHANNEL PATH MEASUREMENT TABLE        01455717
CMCTCMBR DC   F'0' -      REAL ADDR OF CMB                              01455817
CMCTCMBV DC   A(0) -      VIRTUAL ADDR OF CMB                           01455917
CMCTCPWK DC   A(0) -      ADDR OF 32 BYTE WORKAREA FOR STCPS            01456017
*                         INSTRUCTION                                   01456117
CMCTHICP DC   A(0) -      ADDR OF HIGHEST VALID ENTRY IN CPMT           01456217
CMCTPERM DC   D'0' -      ALLOCATION BLOCK FOR PERM DMB STORAGE         01456317
CMCTPDMB EQU  CMCTPERM+0  ADDR OF 1ST IN USE PERM DMB                   01456417
CMCTPCID EQU  CMCTPERM+4  CPOOL ID FOR PERM DMBS                        01457014
CMCTRSV2 DC   F'0'                                                 @L1C 01458014
CMCTRSEQ DC   F'0'        SEQ. NO. OF LAST DROPOFF READ            @T1C 01459014
CMCTHMBI DC   H'0' -      THE HIGHEST MBI ASSIGNED BY IOS          @L3C 01460014
CMCTCMBT DC   H'0' -      THE TOTAL NUMBER OF CMB ENTRIES          @L3C 01470014
CMCTUPDT DC   F'0' -      TIME OF LAST DMB/CPMT UPDATE                  01480014
CMCTSAMI DC   F'200' -    TIME INTERVAL BETWEEN CHAN MEAS SAMPLES IN    01490014
*                         MILLISECONDS                                  01500014
CMCTCTUN DC   H'0' -      TUNTS BETWEEN CHAN MEAS SAMPLES               01510014
CMCTCTU  DC   H'0' -      TUNTS REMAINING TO NEXT CHAN MEAS SAMPL       01520014
CMCTSTRT DC   F'0' -      TIME MEASUREMENTS SET TO START PENDING        01530014
CMCTELST DC   F'0' -      ELAPSED TIME SINCE DMB/CPMT UPDATE            01540014
*                         IN 128 MICRO SECONDS                          01550014
CMCTSYNI DC   F'16000' -  TIME TO SYNCH CHAN TIMERS IN MILLISECONDS     01560014
CMCTSPIP DC   F'0' -      ?SPI CALL PARAMETERS ADDRESS             @P1C 01570014
CMCTDSIZ DC   H'2048' -   NO. OF BYTES TO ALLOC IN NEW DMB CPOOL        01580014
CMCTRSV5 DC   H'0'                                                 @L1C 01590014
CMCTSAMC DC   H'0' -      NO. OF SAMPLES OF UCB QUEUE LENGTHS           01600014
CMCTMORE DC   H'0' -      TOTAL NO. OF ENTRIES REQUIRED IN UPPER        01610014
*                         PORTION OF CMB                                01620014
CMCTCMBN DC   H'0' -      NO. OF ADDITIONAL CMB SLOTS SPECIFIED AS      01630014
*                         N IN CMB KEYWORD                              01640014
CMCTDVCL DC   1B'00000000'  DEVICE CLASS REQUEST FLAGS                  01650014
CMCTUNTR EQU  BIT0 -      UNIT RECORD DEVICES                           01660014
CMCTCOMM EQU  BIT1 -      COMMUNICATIONS EQUIPMENT                      01670014
CMCTGRPH EQU  BIT2 -      GRAPHICS DEVICES                              01680014
CMCTCHRD EQU  BIT3 -      CHARACTER READER DEVICES                      01690014
CMCTFLG1 DC   1B'00000000'  I/O MEASUREMENT CONTROL FLAGS 1             01700014
CMCTDCA  EQU  BIT0 -      DCTI MEASUREMENTS ACTIVE                      01710014
CMCTMFA  EQU  BIT1 -      CMB DATA COLLECTION ACTIVE                    01720014
CMCTPAA  EQU  BIT2 -      CHANNEL PATH STATUS MEASUREMENT ACTIVE        01730014
CMCTMFSP EQU  BIT3 -      CMB DATA COLLECTION START PENDING             01740014
CMCTCPMF EQU  BIT4 -      CPMF INSTALLED INDICATOR                @P7C  01750014
CMCTCPDR EQU  BIT5 -      CPMF delayed restart issued             @P4A  01760014
CMCTECPM EQU  BIT6 -      CPMF extensions installed           @WA38548  01770014
CMCTCPOK EQU  BIT7 -      CPMF OPERATIONAL INDICATOR (ON - CPMF   @H1A  01780014
*                         IS AVAILABLE FOR USE)                   @H1A  01790014
CMCTFLG2 DC   1B'00000000'  I/O MEASUREMENT CONTROL FLAGS 2             01800014
CMCTDCOK EQU  BIT0 -      DCTI MEASUREMENTS CONTROL STRUCTURE OK        01810014
CMCTMFOK EQU  BIT1 -      CMB MEASUREMENT CONTROL STRUCTURE OK          01820014
CMCTCMOK EQU  BIT2 -      CHANNEL MONITOR FACILITY OK                   01830014
CMCTTCOK EQU  BIT3 -      TOD CLOCK FACILITY OK                         01840014
CMCTPAOK EQU  BIT4 -      CHANNEL PATH STATUS CONTROL STRUCTURE OK      01850014
CMCTSDOK EQU  BIT5 -      SAD IS INSTALLED AND OPERATIONAL        @H5A  01860014
CMCTSCIP EQU  BIT6 -      ASYCHRONOUS SPI CALL IN PROGRESS        @P1A  01870014
CMCTECMF EQU  BIT7 -      Enhanced CPMF available             @OA22918  01880014
CMCTKEY  DC   X'50' -     STORAGE KEY OF CMB                            01890014
CMCTRSV6 DC   XL1'00' -   RESERVED                             @P6C     01900014
CMCTRWCT DC   XL1'00' -   CPMF restart wait count              @P6A     01910014
CMCTWORK DC   4F'0' -     WORKAREA FOR ACCUMULATING CMB VALUES          01920014
CMCTSAM4 EQU  CMCTWORK+0  CMB SAMPLE COUNT @WLMPMCS                     01930014
* CMCTSSCH EQU  CMCTWORK+0  CMB SAMPLE COUNT ------- DROPPED  @WLMPMCS  01940014
* CMCTSAMP EQU  CMCTWORK+2  CMB SSCH COUNT   ------- DROPPED  @WLMPMCS  01950014
CMCTCONN EQU  CMCTWORK+4  CMB CONNECT TIME                              01960014
CMCTPEND EQU  CMCTWORK+8  CMB PENDING TIME                              01970014
CMCTACTV EQU  CMCTWORK+12 CMB ACTIVE TIME                               01980014
         AIF   ('&DSECT' EQ 'YES').CMCTAL4                     @YA66862 01990014
CMCTCPFL DC   A(IRARMCPF+X'80000000') ADDR STCPS OR CHAN MON FAILURE    02000014
         EXTRN IRARMCPF   ROUTINE                              @ZMC1111 02010014
CMCTVDEV DC   A(IRARMEVD+X'80000000') ADDR OF ENF VARY DEVICE RTN IN    02020014
         EXTRN IRARMEVD   IRARMCHM                             @ZMC1111 02030014
CMCTUCBC DC   A(IRARMEVU+X'80000000') ADDR OF ENF VARY PATH RTN IN      02040014
         EXTRN IRARMEVU   IRARMCHM                             @ZMC1111 02050014
CMCTDDR  DC   A(IRARMEDD+X'80000000') ADD OF ENF DDR ENTRY IN IRARMCHM  02060014
         EXTRN IRARMEDD                                        @ZMC1111 02070014
CMCTMDON DC   A(IRARMCHF+X'80000000') ADDR OF ROUTINE SCHEDULED WHEN    02080014
         EXTRN IRARMCHF   ASYNCH MSCH COMPLETES                         02090014
CMCTMDXN DC   A(IRARMXHF+X'80000000') ADDR OF ROUTINE SCHEDULED BY      02100014
         EXTRN IRARMXHF   PURGEDEQ                                      02110014
         AGO   .CMCTAL5                                        @YA66862 02120014
.CMCTAL4 ANOP                                                  @YA66862 02130014
CMCTCPFL DC   A(0)                    ADDR STCPS OR CHAN MON FAILURE    02140014
CMCTVDEV DC   A(0)                    ADDR OF ENF VARY DEVICE RTN IN    02150014
CMCTUCBC DC   A(0)                    ADDR OF ENF VARY PATH RTN IN      02160014
CMCTDDR  DC   A(0)                    ADD OF ENF DDR ENTRY IN IRARMCHM  02170014
CMCTMDON DC   A(0)                    ADDR OF ROUTINE SCHEDULED WHEN    02180014
CMCTMDXN DC   A(0)                    ADDR OF ROUTINE SCHEDULED BY      02190014
.CMCTAL5 ANOP                                                  @YA66862 02200014
CMCTLTA  DC   H'9'        LONG TERM AVERAGING FACTOR                    02210014
CMCTLTA1 DC   H'10'       LONG TERM AVERAGING FACTOR PLUS ONE           02220014
CMCTSTME DC   H'0'        TIME BETWEEN STCPS SAMPLES               @H5A 02230014
CMCTRSV3 DC   H'0'                                                 @T1C 02240014
CMCTSWTH DC   F'0'        THRESHOLD TO SWITCH FROM SAD TO STCPS    @H5A 02250014
CMCTSWC  DC   A(3000*16)  REAL SECONDS (SCALED) FOR SWITCH THRES   @H5A 02260014
CMCTDTME DC   F'32767'    TIME OF LAST SAD DATA DROPOFF - INITIALIZED   02270014
*                         TO LARGE VALUE TO CAUSE INITIAL START UP @H5A 02280014
CMCTRSRT DC   X'0008F000'  THRESHOLD TO TRY SAD DATA RESTART (IN SRM    02290014
*                         TIMER UNITS)                             @H5A 02300014
CMCTSADB DC   A(0)        ADDR OF SADB BLOCK                       @H5A 02310014
CMCTSPCS DC   A(0)        ADDR OF SPCSP BLOCK                      @H5A 02320014
CMCTCPMB DC   A(0)        ADDR OF CHANNEL PATH MEASUREMENT BLOCK (VALID 02330014
*                         ONLY WHEN CMCTCPOK IN CMCTFLG1 IS ON)    @P7C 02340014
CMCTCRCT DC   F'0'        CPMF RESTART COUNT                       @H1A 02350014
CMCTCPCT DC   F'0'        LAST RECORDED CPMB SAMPLE COUNT          @H1A 02360014
CMCTTODS DC   F'0'        TIME STAMP OF LAST CPMF CHECK            @P2C 02370014
CMCTCMC2 DC   F'0'        ADDRESS OF CHANNEL MEASUREMENT                02380014
*                          CHARACTERISITICS BLOCK              @WA38548 02390014
CMCTCPM2 DC   F'0'        ADDRESS OF CHANNEL PATH MEASUREMENT           02400014
*                          EXTENDED BLOCK                      @WA38548 02410014
CMCTCPMFSTATEINFO DS   0D  CPMF STATE INFORMATION              @WA38548 02420014
CMCTCPMFMODE      DC X'0'  CURRENT MEASUREMENT MODE                     02430014
*                            0 - CPMF NOT ACTIVE                        02440014
*                            1 - COMPATABILITY MODE                     02450014
*                            2 - EXTENDED MODE                 @WA38548 02460014
CMCT_CPMF_NA     EQU 00     CPMF NOT ACTIVE                    @WA38548 02470014
CMCT_CPMF_COMPAT EQU 01     CPMF IN COMPAT MODE                @WA38548 02480014
CMCT_CPMF_EXTEND EQU 02     CPMF IN EXTENDED MODE              @WA38548 02490014
CMCTOPTXXMODE     DC X'0'  MEASUREMENT MODE SPECIFIED                   02500014
*                          IN IEAOPTXX MEMBER OF                        02510014
*                          SYS1.PARMLIB:                                02520014
*                           0 - CPMF KEYWORD NOT SET                    02530014
*                           1 - CPMF COMPATABILITY MODE                 02540014
*                           2 - CPMF EXTENDED                  @WA38548 02550014
CMCT_OPT_NA      EQU 00     CPMF KEYWORD NOT SET               @WA38548 02560014
CMCT_OPT_COMPAT  EQU 01     CPMF COMPATABILITY MODE SET        @WA38548 02570014
CMCT_OPT_EXTEND  EQU 02     CPMF EXTENDED MODE SET             @WA38548 02580014
CMCTCPMFFLAGS     DC X'0'  PROCESSING FLAGS                    @WA38548 02590014
CMCTEXTENDEDMODECHPID EQU BIT0  CHPID REQUIRING EXTENDED                02600014
*                               MEASUREMENT MODE WAS FOUND              02610014
*                               IN THE SYSTEM. SET BY IOS.     @WA38548 02620014
CMCTCPMFFLAGS2    DC X'0'  PROCESSING FLAGS 2                  @WA38548 02630014
CMCTCPMFRESTART       EQU BIT0  SET ON IF CPMF WAS DETERMINED TO BE     02640014
*                               STOPPED AND A RESTART IS NEEDED. IF     02650014
*                               NEW BITS ARE ADDED, THEN CS IS NEEDED   02660014
*                               WHEN UPDATING CMCTCPMFFLAGS2.  @WA38548 02670014
                  DC XL1'00'    Reserved                       @ME02901 02680014
CMCTCMSTOPRSN     DC CL2'  '                                   @ME02901 02690014
CMCTCPFN          DC X'0'  FUNCTION CODE FOR STARTING CPMF ROUTINE      02700014
*                          I14.                                         02710014
*                           0 - NIP CPMF STARTUP                        02720014
*                           1 - REGULAR CPMF RESTART           @WA38548 02730014
CMCT_NIP     EQU  00        Nip CPMF startup value             @WA38548 02740014
CMCT_RESTART EQU  01        Nip CPMF restart value             @WA38548 02750014
CMCTATTEMPTMODESWITCH  DC H'0'  COUNT OF ATTEMPTS BEGUN TO SWITCH       02760014
*                             MEASUREMENT MODES                @WA38548 02770014
CMCTCOMPLETEMODESWITCH DC H'0'  COUNT OF COMPLETED ATTEMPTS TO SWITCH   02780014
*                             MEASUREMENT MODES                @WA38548 02790014
CMCTIOSCSCMRC     DC F'0'     RC of IOSCSCM                    @PJK0638 02800014
CMCTECMBINFO      DS 0CL25    ECMB information                     @L7A 02810014
CMCTECMBPTR       DC A(0)     ECMB address                         @L7A 02820014
CMCTECMBSTOKEN    DC XL8'0'   ECMB dataspace STOKEN                @L7A 02830014
CMCTECMBALET      DC F'0'     ECMB dataspace alet                  @L7A 02840014
                  DC 4FL2'0'  reserved (fields moved)          @LSSID6C 02850027
CMCTECMBFLAGS     DC X'0'     ECMB flags                           @L7A 02900014
CMCTECMBMODE      EQU X'80'   On = ECMB mode                       @L7A 02910014
                  DC XL3'0'   Reserved                         @OA22918 02920014
CMCTCPMX DC   F'0'            Address of Extended Channel      @OA22918 02930014
*                             Utilization Block (valid only    @OA22918 02940014
*                             if CMCTECMF in CMCTFLG2 is ON)   @OA22918 02950014
CMCTMBIINFO       DS 0CL40    MBI information                  @LSSID6A 02951022
CMCTECMBHIGHMBI0  DC 1FL2'0'  - Subchannel set 0               @LSSID6M 02952022
CMCTECMBHIGHMBI1  DC 1FL2'0'  - Subchannel set 1               @LSSID6M 02953022
CMCTECMBHIGHMBI2  DC 1FL2'0'  - Subchannel set 2               @LSSID6M 02954022
CMCTECMBHIGHMBI3  DC 1FL2'0'  - Subchannel set 3               @LSSID6M 02955022
CMCTECMBHIGHMBI4  DC 1FL2'0'  - Subchannel set 4               @LSSID6A 02956022
CMCTECMBHIGHMBI5  DC 1FL2'0'  - Subchannel set 5               @LSSID6A 02957022
CMCTECMBHIGHMBI6  DC 1FL2'0'  - Subchannel set 6               @LSSID6A 02959032
CMCTECMBHIGHMBI7  DC 1FL2'0'  - Subchannel set 7               @LSSID6A 02959132
CMCTECMBHIGHMBI8  DC 1FL2'0'  - Subchannel set 8               @LSSID6A 02959232
CMCTECMBHIGHMBI9  DC 1FL2'0'  - Subchannel set 9               @LSSID6A 02959332
CMCTECMBHIGHMBI10 DC 1FL2'0'  - Subchannel set 10              @LSSID6A 02959432
CMCTECMBHIGHMBI11 DC 1FL2'0'  - Subchannel set 11              @LSSID6A 02959532
CMCTECMBHIGHMBI12 DC 1FL2'0'  - Subchannel set 12              @LSSID6A 02959632
CMCTECMBHIGHMBI13 DC 1FL2'0'  - Subchannel set 13              @LSSID6A 02959732
CMCTECMBHIGHMBI14 DC 1FL2'0'  - Subchannel set 14              @LSSID6A 02959832
CMCTECMBHIGHMBI15 DC 1FL2'0'  - Subchannel set 15              @LSSID6A 02959932
CMCTECMBHIGHMBI16 DC 1FL2'0'  - Subchannel set 16              @LSSID6A 02960032
CMCTECMBHIGHMBI17 DC 1FL2'0'  - Subchannel set 17              @LSSID6A 02960132
CMCTECMBHIGHMBI18 DC 1FL2'0'  - Subchannel set 18              @LSSID6A 02960232
CMCTECMBHIGHMBI19 DC 1FL2'0'  - Subchannel set 19              @LSSID6A 02960332
CMCTEND  DS   0D -        END OF CMCT                                   02961022
CMCTLEN  EQU  CMCTEND-CMCT - LENGTH OF CMCT                             02970014
         MEND                                                           02980014
*                                                            */         02990014
*%CMCTPLS2:  ;                                                          03000014
*                                                             /*2@L4D*/ 03010014
*      %IF CMCTLEVL^= ''                /* IS STRUCTURE CONCATENATED */ 03020014
*          %THEN %GOTO CMCTPLS3;        /* YES, OMIT DECLARE         */ 03030014
* DCL                                                                   03040014
*   1 CMCT BASED(RMCTCMCT) BDY(DWORD),                                  03050014
*      %GOTO CMCTPLS4;                  /* SKIP USER GIVEN LEVEL     */ 03060014
*%CMCTPLS3: CMCTDUM = CMCTLEVL!!' CMCT'; /* PICK UP GIVEN LEVEL      */ 03070014
*   CMCTDUM BDY(DWORD),                                                 03080014
*%CMCTPLS4:  ;                                                          03090014
*     10 CMCTNAME CHAR(4),              /* ACRONYM 'CMCT             */ 03100014
*     10 CMCTVERS FIXED(8),             /* CMCT version number          03110014
*                                                            @WA38548*/ 03120014
*     10 CMCTRSV1 CHAR(3),              /* Reserved          @WA38548*/ 03130014
*     10 CMCTDBVT PTR(31),              /* ADDR OF DBVT              */ 03140014
*     10 CMCTCPMT PTR(31),              /* ADDR OF CHANNEL PATH         03150014
*                                          MEASUREMENT TABLE         */ 03160014
*     10 CMCTCMBR FIXED(31),            /* REAL ADDR OF CMB          */ 03170014
*     10 CMCTCMBV PTR(31),              /* VIRT ADDR OF CMB          */ 03180014
*     10 CMCTCPWK PTR(31),              /* ADDR OF 32 BYTE WORK AREA    03190014
*                                          FOR STCPS INSTRUCTION     */ 03200014
*     10 CMCTHICP PTR(31),              /* ADDR OF HIGHEST VALID        03210014
*                                          ENTRY IN CPMT             */ 03220014
*     10 CMCTPERM,                      /* ALLOCATION BLOCK FOR PERM    03230014
*                                          DMB STORAGE               */ 03240014
*       12 CMCTPDMB PTR(31),            /* ADDR OF 1ST IN USE PERM      03250014
*                                          DMB                       */ 03260014
*       12 CMCTPCID FIXED(31),          /* CPOOL ID FOR PERM DMB'S   */ 03270014
*     10 CMCTRSV2 FIXED(31),            /*                       @L1C*/ 03280014
*     10 CMCTRSEQ FIXED(32),            /* SEQ. NO. OF LAST DROPOFF     03290014
*                                          READ                  @T1C*/ 03300014
*     10 CMCTHMBI FIXED(16),            /* THE HIGHEST MBI ASSIGNED     03310014
*                                          BY IOS                @L3C*/ 03320014
*     10 CMCTCMBT FIXED(16),            /* THE TOTAL NUMBER OF CMB      03330014
*                                          ENTRIES               @L3C*/ 03340014
*     10 CMCTUPDT FIXED(32),            /* TIME OF LAST DMB/CPMT        03350014
*                                          UPDATE                    */ 03360014
*     10 CMCTSAMI FIXED(32),            /* TIME INTERVAL BETWEEN CHAN   03370014
*                                          MEAS SAMPLES IN MILLISECS */ 03380014
*     10 CMCTCTUN FIXED(15),            /* TUNTS BETWEEN CHAN MEAS      03390014
*                                          SAMPLES                   */ 03400014
*     10 CMCTCTU  FIXED(15),            /* TUNTS REMAINING TO NEXT      03410014
*                                          CHAN MEAS SAMPLE          */ 03420014
*     10 CMCTSTRT FIXED(32),            /* TIME MEASUREMENTS SET TO     03430014
*                                          START PENDING             */ 03440014
*     10 CMCTELST FIXED(32),            /* ELAPSED TIME SINCE DMB/CPMT  03450014
*                                          UPDATE IN 128 MICRO SECOND   03460014
*                                          UNITS                     */ 03470014
*     10 CMCTSYNI FIXED(32),            /* TIME TO SYNCH CHAN TIMERS    03480014
*                                          IN MILLISECONDS           */ 03490014
*     10 CMCTSPIP PTR(31),              /* ?SPI CALL PARAMTERS ADDRESS  03500014
*                                                                @P1C*/ 03510014
*     10 CMCTDSIZ FIXED(15),            /* NO. OF BYTES TO ALLOC IN     03520014
*                                          NEW DMB CPOOL             */ 03530014
*     10 CMCTRSV5 FIXED(15),            /*                       @L1C*/ 03540014
*     10 CMCTSAMC FIXED(15),            /* NO. OF UCB QUEUE LENGTHS  */ 03550014
*     10 CMCTMORE FIXED(16),            /* TOTAL NO. OF ENTRIES REQ'D   03560014
*                                          IN UPPER PORTION OF CMB      03570014
*                                                                @L6C*/ 03580014
*     10 CMCTCMBN FIXED(16),            /* NO. OF ADDITIONAL CMB SLOTS  03590014
*                                          SPECIFIED AS N IN CMB        03600014
*                                          KEYWORD               @L6C*/ 03610014
*     10 CMCTDVCL BIT(8),               /* DEVICE CLASS REQUEST FLAGS*/ 03620015
*       12 CMCTUNTR BIT(1),             /* UNIT RECORD DEVICES       */ 03630014
*       12 CMCTCOMM BIT(1),             /* COMMUNICATIONS EQUIPMENT  */ 03640014
*       12 CMCTGRPH BIT(1),             /* GRAPHICS DEVICES          */ 03650014
*       12 CMCTCHRD BIT(1),             /* CHARACTER READER DEVICES  */ 03660014
*       12 * BIT(4),                    /* RESERVED                  */ 03670014
*     10 CMCTFLG1 BIT(8),               /* I/O MEASUREMENT CONTROL      03680014
*                                          FLAGS 1                   */ 03690014
*       12 CMCTDCA BIT(1),              /* DCTI MEASUREMENTS ACTIVE  */ 03700014
*       12 CMCTMFA BIT(1),              /* CMB DATA COLLECTION ACTIVE*/ 03710014
*       12 CMCTPAA BIT(1),              /* CHANNEL PATH STATUS          03720014
*                                          MEASUREMENTS ACTIVE       */ 03730014
*       12 CMCTMFSP BIT(1),             /* CMB DATA COLLECTION START    03740014
*                                          PENDING                   */ 03750014
*       12 CMCTCPMF BIT(1),             /* CPMF installed indicator     03760014
*                                                                @P7C*/ 03770014
*       12 CMCTCPDR BIT(1),             /* CPMF delayed restart issued  03780014
*                                                                @P4A*/ 03790014
*       12 CMCTECPM BIT(1),             /* CPMF extensions are          03800014
*                                          supported         @WA38548*/ 03810014
*       12 CMCTCPOK BIT(1),             /* CPMF operational indicator   03820014
*                                          (on - CPMF is available for  03830014
*                                          use.)                 @H1A*/ 03840014
*     10 CMCTFLG2 BIT(8),               /* I/O MEASUREMENT CONTROL      03850014
*                                          FLAGS 2                   */ 03860014
*       12 CMCTDCOK BIT(1),             /* DCTI MEASUREMENTS CONTROL    03870014
*                                          STRUCTURE OK              */ 03880014
*       12 CMCTMFOK BIT(1),             /* CMB MEASUREMENT CONTROL      03890014
*                                          STRUCTURE OK              */ 03900014
*       12 CMCTCMOK BIT(1),             /* CHANNEL MONITOR FACILITY     03910014
*                                          OK                        */ 03920014
*       12 CMCTTCOK BIT(1),             /* TOD CLOCK FACILITY OK     */ 03930014
*       12 CMCTPAOK BIT(1),             /* CHANNEL PATH STATUS CONTROL  03940014
*                                          STRUCTURE OK              */ 03950014
*       12 CMCTSDOK BIT(1),             /* SAD IS INSTALLED AND         03960014
*                                          OPERATIONAL           @H5A*/ 03970014
*       12 CMCTSCIP BIT(1),             /* ASYNCHRONOUS SPI CALL IN     03980014
*                                          PROGRESS              @P1A*/ 03990014
*       12 CMCTECMF BIT(1),             /* Enhanced Channel Measurement 04000014
*                                          Facility available           04010014
*                                                            @OA22918*/ 04020014
*     10 CMCTKEY FIXED(8),              /* STORAGE KEY OF CMB        */ 04030014
*     10 CMCTRSV6 FIXED(8),             /* RESERVED              @P6C*/ 04040014
*     10 CMCTRWCT FIXED(8),             /* CPMF RESTART WAIT            04050014
*                                          COUNT                 @P6C*/ 04060035
*     10 CMCTWORK,                      /* WORKAREA FOR ACCUMULATING    04070014
*                                          CMB VALUES                */ 04080014
*       12 CMCTSAM4 FIXED(32),          /* CMB Sample count  @WLMPMCS*/ 04090014
*                              /* CMCTSAM4 was CMCTSSCH      @WLMPMCS*/ 04091014
*                              /* and CMCTSAMP with 2 bytes  @WLMPMCS*/ 04092014
*                              /* each. Both fields were     @WLMPMCS*/ 04093014
*                              /* dropped and replaced by    @WLMPMCS*/ 04094014
*                              /* CMCTSAM4 with 4 bytes.     @WLMPMCS*/ 04095014
*       12 CMCTCONN FIXED(32),          /* CMB CONNECT TIME          */ 04096014
*       12 CMCTPEND FIXED(32),          /* CMB PENDING TIME          */ 04097014
*       12 CMCTACTV FIXED(32),          /* CMB ACTIVE TIME           */ 04098014
*     10 CMCTCPFL PTR(31),              /* ADDR OF STCPS OR CHAN MON    04099014
*                                          FAILURE ROUTINE           */ 04100014
*     10 CMCTVDEV PTR(31),              /* ADDR OF ENF VARY DEVICE      04110014
*                                          RTN IN IRARMCHM           */ 04120014
*     10 CMCTUCBC PTR(31),              /* ADDR OF ENF VARY PATH RTN    04130014
*                                          IN IRARMCHM               */ 04140014
*     10 CMCTDDR  PTR(31),              /* ADDR OF ENF DDR              04150014
*                                          ENTRY IN IRARMCHM         */ 04160014
*     10 CMCTMDON PTR(31),              /* ADDR OF ROUTINE SCHEDULED    04170014
*                                          WHEN ASYNCH MSCH COMPLETE */ 04180014
*     10 CMCTMDXN PTR(31),              /* ADDR OF ROUTINE SCHEDULED    04190014
*                                          WHEN BY PURGEDEQ          */ 04200014
*     10 CMCTLTA  FIXED(15),            /* LONG TERM AVERAGING FACTOR*/ 04210014
*     10 CMCTLTA1 FIXED(15),            /* LONG TERM AVERAGING FACTOR   04220014
*                                          PLUS ONE                  */ 04230014
*     10 CMCTSTME FIXED(16),            /* TIME BETWEEN STCPS SAMPLES   04240014
*                                                                @H5A*/ 04250014
*     10 CMCTRSV3 FIXED(15),            /*                       @T1C*/ 04260014
*     10 CMCTSWTH FIXED(31),            /* THRESHOLD TO SWTICH FROM     04270014
*                                          SAD TO STCPS          @H5A*/ 04280014
*     10 CMCTSWC  FIXED(31),            /* REAL SECONDS (SCALED) FOR    04290014
*                                          SWITCH THRESHOLD      @H5A*/ 04300014
*     10 CMCTDTME FIXED(32),            /* TIME OF LAST SAD DATA        04310014
*                                          DROPOFF               @H5A*/ 04320014
*     10 CMCTRSRT FIXED(32),            /* THRESHOLD TO TRY SAD DATA    04330014
*                                          RESTART               @H5A*/ 04340014
*     10 CMCTSADB PTR(31),              /* ADDR OF SADB BLOCK    @H5A*/ 04350014
*     10 CMCTSPCS PTR(31),              /* ADDR OF SPCSP BLOCK   @H5A*/ 04360014
*     10 CMCTCPMB PTR(31),              /* Address of Channel Path      04370014
*                                          Measurement Block (Valid     04380014
*                                          only when CMCTCPOK in        04390014
*                                          CMCTFLG1 is ON)       @P7C*/ 04400014
*     10 CMCTCRCT FIXED(32),            /* Channel Path Measurement     04410014
*                                          Facility (CPMF) Restart      04420014
*                                          count                 @H1A*/ 04430014
*     10 CMCTCPCT FIXED(32),            /* Last recorded CPMB sample    04440014
*                                          count                 @H1A*/ 04450014
*     10 CMCTTODS FIXED(32),            /* Time stamp of last CPMF      04460014
*                                          check                 @P2C*/ 04470014
*     10 CMCTCMC2 PTR(31),              /* Address of Channel           04480014
*                                          Measurement Characterisitcs  04490014
*                                          Block             @WA38548*/ 04500014
*     10 CMCTCPM2 PTR(31),              /* Address of Channel Path      04510014
*                                          Measurement Extended         04520014
*                                          Block             @WA38548*/ 04530014
*     10 CMCTCpmfStateInfo  Char(16) Bdy(DWord),  /* CPMF state         04540014
*                                          information       @WA38548*/ 04550014
*        12 CMCTCpmfMode  Fixed(8),     /* Current measurement mode     04560014
*                                           0 - CPMF not active         04570014
*                                           1 - Compatability Mode      04580014
*                                           2 - Extended Mode           04590014
*                                                            @WA38548*/ 04600014
*        12 CMCTOPTxxMode Fixed(8),     /* Measurement mode specified   04610014
*                                          in IEAOPTxx member of        04620014
*                                          SYS1.PARMLIB:                04630014
*                                           0 - CPMF keyword not set    04640014
*                                           1 - CPMF Compatability Mode 04650014
*                                           2 - CPMF Extended           04660014
*                                               Measurement mode        04670014
*                                                            @WA38548*/ 04680014
*        12 CMCTCpmfFlags Bit(8),       /* Processing flags  @WA38548*/ 04690014
*           14 CMCTExtendedModeCHPID BIT(1),/* CHPID requiring Extended 04700014
*                                          Measurement Mode was found   04710014
*                                          in the system     @WA38548*/ 04720014
*        12 CMCTCpmfFlags2 BIT(8),     /* Processing flags 2 @WA38548*/ 04730014
*           14 CMCTCPMFRestart       BIT(1),/* Set on if CPMF is        04740014
*                                          determined to be stopped     04750014
*                                          and a restart is needed. If  04760014
*                                          a new bit is added, then CS  04770014
*                                          is needed to updated this    04780014
*                                          field             @WA38548*/ 04790014
*        12 *               Char(1),    /* Reserved          @ME02901*/ 04800014
*        12 CMCTCmStopRsn   Char(2),    /* CMF has been stopped for     04810014
*                                          this reason       @ME02901*/ 04820014
*        12 CMCTCPFN      Bit(8),       /* Function code for starting   04830014
*                                          CPMF routine I14.            04840014
*                                           0 - NIP CPMF Startup        04850014
*                                           1 - Regular CPMF restart    04860014
*                                                            @WA38548*/ 04870014
*        12 CMCTattemptModeSwitch Fixed(15), /* Count of attempts       04880014
*                                          begun to switch measurement  04890014
*                                          modes             @WA38548*/ 04900014
*        12 CMCTcompleteModeSwitch Fixed(15),/* Count of completed      04910014
*                                          attempts to switch           04920014
*                                          measurement modes @WA38548*/ 04930014
*        12 CMCTIoscscmRc FIXED(31),      /* RC of IOSCSCM   @PJK0638*/ 04940014
*           14 CMCTCrsbrc FIXED(16),      /* Response Code   @PJK0638*/ 04950014
*           14 CMCTCrsbscm_Status BIT(8), /* Status Code     @PJK0638*/ 04960014
*           14 CMCTCrqboc BIT(2),         /* Operation code  @PJK0638*/ 04970014
*     10 CMCTECMBinfo,                  /* ECMB information      @L7A*/ 04980014
*        12 CMCTECMBptr   Ptr(31),      /* ECMB address          @L7A*/ 04990014
*        12 CMCTECMBstoken Char(8),     /* ECMB dataspace STOKEN @L7A*/ 05000014
*        12 CMCTECMBalet  Fixed(32),    /* ECMB dataspace alet   @L7A*/ 05010014
*        12 *             Char(8),      /* reserved (moved)  @LSSID6C*/ 05020030
*        12 CMCTECMBflags Bit(8),       /* ECMB flags            @L7A*/ 05050014
*           14 CMCTECMBmode Bit(1),     /* On = ECMB mode        @L7A*/ 05060014
*     10 *                Char(3),      /* Reserved          @OA22918*/ 05070014
*     10 CMCTCPMX PTR(31),              /* Address of Extended          05080014
*                                          Channel Utilization          05090014
*                                          Block (Valid only if         05100014
*                                          CMCTECMF in CMCTFLG2         05110014
*                                          is ON)            @OA22918*/ 05120014
*     10 CMCTMBIinfo Char(40) Bdy(2),   /* MBI information   @LSSID6A*/ 05121020
*        12 CMCTECMBhighMBIs,           /* Highest MBI assigned per     05122017
*                                          Subchannel        @LSSID6M*/ 05123017
*           14 CMCTECMBhighMBI(0:19) Fixed(16),                         05124033
*                                       /*                   @LSSID6C*/ 05125017
*     10 CMCTEND CHAR(0) BDY(DWORD)     /* END OF CMCT               */ 05130014
*                                                              /*@L4A*/ 05140014
* %IF CMCT9999 =',' %THEN %GOTO CMCT999C; /* CONTINUE STRUCTURE  @L4A*/ 05150014
*                ;                  /* END OF THIS BLOCK         @L4A*/ 05160014
*     %GOTO CMCT999E ;                                         /*@L4A*/ 05170014
* %CMCT999C:;                                                 /* @L4A*/ 05180014
*                ,                  /* CONTINUE STRUCTURE        @L4A*/ 05190014
* %CMCT999E:;                       /* ENDIF                     @L4A*/ 05200014
*                                                              /*@L4A*/ 05210014
*                                                             /*1@L4D*/ 05220014
* %CMCTLEN = 'LENGTH(CMCT)';            /* SYMBOLIC LENGTH OF CMCT   */ 05230014
*                                                                       05240014
* DCL CMCTVER0 FIXED(8) CONSTANT(0),/* Base CMCT             @WA38548*/ 05250014
*     CMCTVER1 FIXED(8) CONSTANT(1),/* CMCT includes extended           05260014
*                                      measurement mode support         05270014
*                                                            @WA38548*/ 05280014
*     CMCTVER2 FIXED(8) CONSTANT(2),/* CMCT extended for ECMB usage     05290014
*                                                            @PJK1060*/ 05300014
*     CMCT_NIP FIXED(8) CONSTANT(0),/* Indicates NIP function           05310014
*                                      for CMCTCPFN          @WA38548*/ 05320014
*     CMCT_RESTART FIXED(8) CONSTANT(1),/* Indicates Restart function   05330014
*                                          for CMCTCPFN      @WA38548*/ 05340014
*     CMCT_CPMF_NA FIXED(8) CONSTANT(0),/* Indicates CPMF not active    05350014
*                                          for CMCTCpmfModeInfo         05360014
*                                                            @WA38548*/ 05370014
*     CMCT_CPMF_COMPAT FIXED(8) CONSTANT(1),/* Indicates CPMF Compat    05380014
*                                            mode for CMCTCpmfModeInfo  05390014
*                                                            @WA38548*/ 05400014
*     CMCT_CPMF_EXTEND FIXED(8) CONSTANT(2),/* Indicates CPMF Extended  05401014
*                                            mode for CMCTCpmfModeInfo  05402014
*                                                            @WA38548*/ 05403014
*     CMCT_OPT_NA      FIXED(8) CONSTANT(0),/* CPMF keyword not         05404014
*                                              specified value for      05405014
*                                              CMCTOptxxMode @WA38548*/ 05406014
*     CMCT_OPT_COMPAT  FIXED(8) CONSTANT(1),/* CPMF COMPAT keyword      05407014
*                                              specified value for      05408014
*                                              CMCTOptxxMode @WA38548*/ 05409014
*     CMCT_OPT_EXTEND  FIXED(8) CONSTANT(2);/* CPMF EXTEND keyword      05410014
*                                              specified value for      05420014
*                                              CMCTOptxxMode @WA38548*/ 05430014
