*                                                                       00001000
* %DCL IRACMB_INCLUDED CHAR EXT;                                        00002000
* %DEACTIVATE IRACMB_INCLUDED;                                          00003000
* %IF IRACMB_INCLUDED = '' %THEN                                        00004000
* %DO;                                                                  00005000
*/* Macro made bi-lingual on 19302. CBGEN compile date 19044         */ 00006000
*% /*                                                                   00007000
         MACRO                                                          00008000
         IRACMB &DSECT=YES,&LIST=YES,&TITLE=YES,&IRACMB=YES             00009000
         GBLC  &IRACMB_INCLUDED                                         00010000
         GBLC  &ZCBPRINT                                                00011000
&IRACMB_INCLUDED SETC 'YES'                                             00012000
         AIF   ('&LIST' EQ 'NONE').P0                                   00013000
         AIF   ('&TITLE' EQ 'NO').P5                                    00014000
 TITLE   'IRACMB  - CHANNEL MEASUREMENT BLOCK                    '      00015000
.P5      ANOP                                                           00016000
**/ IRACMB_1:;                                                          00017000
*/** START OF SPECIFICATIONS******************************************/ 00018000
*/*01* PROPRIETARY STATEMENT=                                        */ 00019000
*/***PROPRIETARY_STATEMENT********************************************/ 00020000
*/*                                                                  */ 00021000
*/*                                                                  */ 00022000
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00023000
*/* 5650-ZOS     COPYRIGHT IBM CORP. 1981, 2021              @CBGMETA*/ 00024000
*/*                                                                  */ 00025000
*/* STATUS= HBB77D0                                          @CBGMETA*/ 00026000
*/*                                                                  */ 00027000
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 00028000
*/*                                                                  */ 00029000
*/*  MACRO NAME:  IRACMB                                             */ 00030000
*/*                                                                  */ 00031000
*/*  DSECT NAME:  IRACMB                                             */ 00032000
*/*                                                                  */ 00033000
*/*  DESCRIPTIVE NAME:  CHANNEL MEASUREMENT BLOCK                    */ 00034000
*/*                                                                  */ 00035000
*/*  EXTERNAL CLASSIFICATION: PI                                     */ 00036000
*/*  END OF EXTERNAL CLASSIFICATION:                                 */ 00037000
*/*                                                                  */ 00038000
*/*  FUNCTION:  THE CMB CONSISTS OF CONTIGUOUS REAL                  */ 00039000
*/*        STORAGE CONTAINING INFORMATION STORED DIRECTLY BY THE     */ 00040000
*/*        CHANNEL.  IT INCLUDES ENTRIES FOR TAPE, DASD, AND         */ 00041000
*/*        OPTIONALLY, INSTALLATION SPECIFIED DEVICES.               */ 00042000
*/*                                                                  */ 00043000
*/*  COMPONENT: SYSTEMS RESOURCE MANAGER (SC1CX)                     */ 00044000
*/*                                                                  */ 00045000
*/*  STORAGE ATTRIBUTES:                                             */ 00046000
*/*   RESIDENCY:  ABOVE 16M LINE                                     */ 00047000
*/*   MAIN STORAGE:  ECSA                                            */ 00048000
*/*                                                                  */ 00049000
*/*  EYE-CATCHER: CMB                                                */ 00050000
*/*   OFFSET: 0                                                      */ 00051000
*/*   LENGTH: 4                                                      */ 00052000
*/*                                                                  */ 00053000
*/*  SIZE:                                                           */ 00054000
*/*              IRACMB -- X'0040' bytes                             */ 00055000
*/*                                                                  */ 00056000
*/*  METHOD OF ACCESS:                                         @MCSEX*/ 00057000
*/*                                                                  */ 00058000
*/*   ASM:    ,DSECT=YES!NO to specify if the macro should be        */ 00059000
*/*                         defined as a DSECT.                @MCSEX*/ 00060000
*/*           ,LIST=YES!NO to control whether or not the macro will  */ 00061000
*/*                        appear in the assembler listing.    @MCSEX*/ 00062000
*/*           ,TITLE=YES!NO to control whether or not the title will */ 00063000
*/*                        appear in the assembler listing.    @MCSEX*/ 00064000
*/*                                                                  */ 00065000
*/*   PLX: %INCLUDE SYSLIB(IRACMB)                             @MCSEX*/ 00066000
*/*                                                                  */ 00067000
*/*        To prevent CMBHDR from appearing in the generated   @MCSEX*/ 00068000
*/*        mapping and to make CMBNTRY appear as follows:      @MCSEX*/ 00069000
*/*          1 CMBNTRY BASED BDY(DWORD),                       @MCSEX*/ 00070000
*/*        specify %CMBENTRY = 'BASED'.                        @MCSEX*/ 00071000
*/*                                                                  */ 00072000
*/*  SERIALIZATION: NONE                                             */ 00073000
*/*                                                                  */ 00074000
*/*  POINTED TO BY: THE ADDRESS OF THE CMB IS CONTAINED              */ 00075000
*/*        IN THE -CMCTCMBV- FIELD OF THE CHANNEL MEASUREMENT        */ 00076000
*/*        CONTROL TABLE.  THE INDEX OF A PARTICULAR ENTRY IS        */ 00077000
*/*        IS FOUND IN THE -UCBMBI- FIELD OF THAT DEVICE'S UCB.      */ 00078000
*/*                                                                  */ 00079000
*/*  CREATED-BY: IEAVNP1F                                     @MCSEX2*/ 00080000
*/*                                                          @PZJ0030*/ 00081000
*/*                                                                  */ 00082000
*/*  DELETED-BY: N/A                                          @MCSEX2*/ 00083000
*/*                                                          @PZJ0030*/ 00084000
*/*                                                                  */ 00085000
*/*  NOTE - THE STCPS WORKAREA AND EACH ELEMENT IN THE CONTROL       */ 00086000
*/*        BLOCK MUST BEGIN ON A 32 BYTE BOUNDARY.  CAUTION IS       */ 00087000
*/*        URGED IF A CHANGE IN LENGTH IS CONTEMPLATED.              */ 00088000
*/*                                                                  */ 00089000
*/*01* CHANGE ACTIVITY - @ZCC0488,@ZA63610                           */ 00090000
*/*    A000000-999999                                        @G860P26*/ 00091000
*/*    OY30786 - CHANGE IRARMCMB TO CONTAIN CONTROL UNIT QUEUEING    */ 00092000
*/*              TIME FOR SERIAL DEVICES                     @YA30786*/ 00093000
*/*    PQC0372  HBB6603  950907 PD88KN: KIN NG - FIX FOR SHOWHDR     */ 00094000
*/*    $WLMPIOP HBB6603  951206 PD00BZ: ADD CMBMBID                  */ 00095000
*/*    PQC0681  HBB6603  960501 PD88KN: KIN NG - FIX FOR SHOWHDR     */ 00096000
*/*    OW38548  HBB6608  980811 PD88KN: KIN NG - FICON Support       */ 00097000
*/*    MCSEX    HBB7709  020215 PD00ON: Multiple Channel Subsystem   */ 00098000
*/*    MCSEX2   HBB7709  020315 PD00ON: Multiple Channel Subsystem   */ 00099000
*/*    WLMPMCS  JBB7717  020805 3241MB: Manfred Baudisch             */ 00100000
*/*                                     roll back to JBB7717         */ 00101000
*/*    PZJ0030  JBB7717  020920 3241BH: Bill Heisser - remove extra  */ 00102000
*/*                                     opening comment chars        */ 00103000
*/*    CBGMETA  HBB77D0  190813 3241BH: Bill Heisser                 */ 00104000
*/*                                     convert to CBGEN Metadata    */ 00105000
*/*                                                                  */ 00106000
*/*** END OF SPECIFICATIONS ******************************************/ 00107000
*% /*                                                                   00108000
.P0      ANOP                                                           00109000
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 00110000
         AIF   ('&LIST' EQ 'YES').P2                                    00111000
.P1      ANOP                                                           00112000
         PUSH  PRINT                                                    00113000
         PRINT OFF                                                      00114000
.P2      ANOP                                                           00115000
         AIF   ('&IRACMB' EQ 'NO').L0002                                00116000
         AIF   ('&DSECT' EQ 'YES').L0003                                00117000
         AIF   ('&IRACMB' NE 'YES').L0002                               00118000
IRACMB   DS    0D                                                       00119000
         AGO   .L0004                                                   00120000
.L0003   ANOP                                                           00121000
IRACMB   DSECT                                                          00122000
.L0004   ANOP                                                           00123000
CMBHDR   DS    CL32      HEADER MUST SAME LENGTH AS CMB ELEMENTS. SEE  *00124000
                         NOTE                                           00125000
         ORG   CMBHDR                                                   00126000
CMBNAME  DS    CL4       ACRONYM 'CMB'                                  00127000
CMBSIZE  DS    F         NO. OF BYTES IN CMB                            00128000
CMBMBID  DS    F         NUMBER OF CMB ENTRIES RESERVED FOR            *00129000
                         DYNAMICALLY ADDED DASD                         00130000
         DS    CL20      RESERVED                                       00131000
CMBNTRY  DS    CL32      ARRAY OF CMB ENTRIES                           00132000
         ORG   CMBNTRY                                                  00133000
CMBSSCHC DS    H         NO. OF SSCH INSTRUCTIONS                       00134000
CMBSAMPC DS    H         NO. OF SSCH INSTRUCTIONS FOR WHICH DATA WAS   *00135000
                         COLLECTED                                      00136000
CMBCONNT DS    F         SUMMATION OF DEVICE CONNECT TIMES              00137000
CMBPENDT DS    F         SUMMATION OF SSCH REQUEST PENDING TIMES        00138000
CMBDISCT DS    F         SUMMATION OF SUBCHANNEL DISCONNECT TIMES       00139000
CMBCUQTA DS    F         SUMMATION OF CONTROL UNIT QUEUEING TIMES       00140000
CMBDAO   DS    F         Summation of Device-active- only times         00141000
CMBDBT   DS    F         Device busy time                               00142000
CMBICMR  DS    F         Initial command response time                  00143000
IRACMB_LEN EQU *-IRACMB                                                 00144000
.L0002   ANOP                                                           00145000
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 00146000
         AIF   ('&LIST' EQ 'YES').P4                                    00147000
.P3      ANOP                                                           00148000
         POP   PRINT                                                    00149000
.P4      ANOP                                                           00150000
.P_EXIT  ANOP                                                           00151000
         MEND                                                           00152000
**/ IRACMB_2:;                                                          00153000
* %IRACMB_INCLUDED = 'YES';                                             00154000
* %DCL ZCBPRINT CHAR EXT;                                               00155000
* %DEACTIVATE ZCBPRINT;                                                 00156000
* %DCL IRACMB_LIST CHAR EXT;                                            00157000
* %DEACTIVATE IRACMB_LIST;                                              00158000
* %IF IRACMB_LIST = 'NO' !                                              00159000
*    ZCBPRINT = 'NO' %THEN                                              00160000
* %DO;                                                                  00161000
*   @LIST PUSH NOECHO;                                                  00162000
*   @LIST NOASSEMBLE NOECHO;                                            00163000
*   @LIST OFF C NOECHO;                                                 00164000
* %END;                                                                 00165000
*/* Start of PL/X Source                                             */ 00166000
* DCL                                                         /*MCSEX*/ 00167000
* %IF CMBENTRY = 'BASED' %THEN                               /*@MCSEX*/ 00168000
*   %GOTO IRACMB_6;                                         /*@MCSEX2*/ 00169000
*   1 IRACMB BASED(CMBPTR) BDY(DWORD),  /*                   @ZCC0501*/ 00170000
*     3 CMBHDR,                         /* HEADER MUST SAME LENGTH      00171000
*                                          AS CMB ELEMENTS. SEE NOTE */ 00172000
*       5 CMBNAME CHAR(4),              /* ACRONYM 'CMB'             */ 00173000
*       5 CMBSIZE FIXED(31),            /* NO. OF BYTES IN CMB       */ 00174000
*       5 CMBMBID FIXED(31),            /* NUMBER OF CMB ENTRIES        00175000
*                                          RESERVED FOR DYNAMICALLY     00176000
*                                          ADDED DASD        @WLMPIOP*/ 00177000
*       5 * CHAR(20),                   /* RESERVED                  */ 00178000
*     3 CMBNTRY(*),                     /* ARRAY OF CMB ENTRIES      */ 00179000
* %GOTO IRACMB_5;                                            /*@MCSEX*/ 00180000
* %IRACMB_6:;                                               /*@MCSEX2*/ 00181000
*   1 CMBNTRY  BASED BDY(DWORD),        /* CMB ENTRY           @MCSEX*/ 00182000
* %IRACMB_5:;                                                /*@MCSEX*/ 00183000
*       5 CMBSSCHC FIXED(16),           /* NO. OF SSCH INSTRUCTIONS  */ 00184000
*       5 CMBSAMPC FIXED(16),           /* NO. OF SSCH INSTRUCTIONS     00185000
*                                            FOR WHICH DATA WAS         00186000
*                                            COLLECTED               */ 00187000
*       5 CMBCONNT FIXED(32),           /* SUMMATION OF DEVICE          00188000
*                                            CONNECT TIMES           */ 00189000
*       5 CMBPENDT FIXED(32),           /* SUMMATION OF SSCH REQUEST    00190000
*                                            PENDING TIMES           */ 00191000
*       5 CMBDISCT FIXED(32),           /* SUMMATION OF SUBCHANNEL      00192000
*                                          DISCONNECT TIMES  @ZA63610*/ 00193000
*       5 CMBCUQTA FIXED(32),           /* SUMMATION OF CONTROL UNIT    00194000
*                                          QUEUEING TIMES    @YA30786*/ 00195000
*       5 CMBDAO   FIXED(32),           /* Summation of Device-active-  00196000
*                                          only times        @WA38548*/ 00197000
*       5 CMBDBT   FIXED(32),           /* Device busy time    @MCSEX*/ 00198000
*       5 CMBICMR  FIXED(32);           /* Initial command response     00199000
*                                          time                @MCSEX*/ 00200000
*/* End of PL/X Source                                               */ 00201000
* %IF IRACMB_LIST = 'NO' !                                              00202000
*    ZCBPRINT = 'NO' %THEN                                              00203000
* %DO;                                                                  00204000
*   @LIST POP NOECHO;                                                   00205000
* %END;                                                                 00206000
* %END;                                                                 00207000
