*                                                                       00001000
* %DCL IRDDCE_INCLUDED CHAR EXT;                                        00002000
* %DEACTIVATE IRDDCE_INCLUDED;                                          00003000
* %IF IRDDCE_INCLUDED = '' %THEN                                        00004000
* %DO;                                                                  00005000
*/* Macro made bi-lingual on 13122. CBGEN compile date 12258         */ 00006000
*% /*                                                                   00007000
         MACRO                                                          00008000
         IRDDCE &DSECT=YES,&LIST=YES,&TITLE=YES,&FSDDCE=YES             00009000
         GBLC  &IRDDCE_INCLUDED                                         00010000
         GBLC  &ZCBPRINT                                                00011000
&IRDDCE_INCLUDED SETC 'YES'                                             00012000
         AIF   ('&LIST' EQ 'NONE').P0                                   00013000
         AIF   ('&TITLE' EQ 'NO').P5                                    00014000
 TITLE   'IRDDCE  - FICON Switch UCB Device Class Extension     '       00015000
.P5      ANOP                                                           00016000
**/ IRDDCE_1:;                                                          00017000
*/****START OF SPECIFICATIONS*****************************************/ 00018000
*/*                                                                  */ 00019000
*/*01* MACRO-NAME: IRDDCE                                            */ 00020000
*/*                                                                  */ 00021000
*/*01* DESCRIPTIVE-NAME: FICON Switch UCB Device Class Extension     */ 00022000
*/*                                                                  */ 00023000
*/*01* PROPRIETARY STATEMENT=                                        */ 00024000
*/*                                                                  */ 00025000
*/*      LICENSED MATERIALS - PROPERTY OF IBM                        */ 00026000
*/*      THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                 */ 00027000
*/*      5694-A01 COPYRIGHT IBM CORP. 2000, 2002                 @03C*/ 00028000
*/*                                                                  */ 00029000
*/*01* STATUS= HSWF100                                               */ 00030000
*/*                                                                  */ 00031000
*/*01* EXTERNAL CLASSIFICATION: PI                                   */ 00032000
*/*01* END OF EXTERNAL CLASSIFICATION:                               */ 00033000
*/*                                                                  */ 00034000
*/*01* FUNCTION =                                                    */ 00035000
*/*      Maps the Switch device class extension.                     */ 00036000
*/*                                                                  */ 00037000
*/*01* DSECT-NAME: FsdDce                                            */ 00038000
*/*                                                                  */ 00039000
*/*01* COMPONENT: ESCON Director Device Support (00101)              */ 00040000
*/*                                                                  */ 00041000
*/*01* EYE-CATCHER: none                                             */ 00042000
*/*02* OFFSET: N/A                                                   */ 00043000
*/*02* LENGTH: N/A                                                   */ 00044000
*/*                                                                  */ 00045000
*/*01* STORAGE ATTRIBUTES:                                           */ 00046000
*/*02* SUBPOOL:  245                                                 */ 00047000
*/*02* KEY:  0                                                       */ 00048000
*/*02* RESIDENCY: ESQA                                               */ 00049000
*/*                                                                  */ 00050000
*/*01* SIZE:                                                     @01C*/ 00051000
*/*            FSDDCE -- X'001C' bytes                               */ 00052000
*/*                                                                  */ 00053000
*/*01* CREATED BY: IOSIUCB, IOSVCMUB                                 */ 00054000
*/*                                                                  */ 00055000
*/*01* DELETED BY: IOSVCMUD                                          */ 00056000
*/*                                                                  */ 00057000
*/*01* POINTED TO BY: UCBCLEXT                                       */ 00058000
*/*                                                                  */ 00059000
*/*01* FREQUENCY: One per switch                                     */ 00060000
*/*                                                                  */ 00061000
*/*01* SERIALIZATION: None                                           */ 00062000
*/*                                                                  */ 00063000
*/*01* NOTES: None                                                   */ 00064000
*/*                                                                  */ 00065000
*/*01* METHOD OF ACCESS:                                             */ 00066000
*/*                                                                  */ 00067000
*/*02*   ASM: IRDDCE                                                 */ 00068000
*/*                                                                  */ 00069000
*/*02*   PL/X: %INCLUDE SYSLIB(IRDDCE)                               */ 00070000
*/*                                                                  */ 00071000
*/*01* CHANGE ACTIVITY =                                             */ 00072000
*/*  $H0=WPII     HSWF100 000501 PDHT: Winterpark II Support         */ 00073000
*/*  $01=OW47875  HSWF100 030228 PDHC: Alternate FICON Switch.       */ 00074000
*/*  $02=OA10523  HSWF100 050223 PDHC: Add FsdDceFsdAreaPtr and      */ 00075000
*/*                                    FsdDceFsdAreaLen              */ 00076000
*/*  $03=OA40037  HSWF100 130615 PDGG: Switch (CUP) Diagnostics      */ 00077000
*/*                                    support                       */ 00078000
*/*  $04=OA43309  HSWF100 150930 PDB7: Dynamic Routing Health Check  */ 00078106
*/*                                    support                       */ 00078200
*/*                                                                  */ 00079000
*/***END OF SPECIFICATIONS********************************************/ 00080000
*% /*                                                                   00081000
.P0      ANOP                                                           00082000
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 00083000
         AIF   ('&LIST' EQ 'YES').P2                                    00084000
.P1      ANOP                                                           00085000
         PUSH  PRINT                                                    00086000
         PRINT OFF                                                      00087000
.P2      ANOP                                                           00088000
FSDDCEVER2 EQU 2                                                        00089000
FSDDCEVER3 EQU 3                                                        00090000
         AIF   ('&FSDDCE' EQ 'NO').L0002                                00091000
         AIF   ('&DSECT' EQ 'YES').L0003                                00092000
         AIF   ('&FSDDCE' NE 'YES').L0002                               00093000
FSDDCE   DS    0F        UCB FICON Switch Device Class Extension        00094000
         AGO   .L0004                                                   00095000
.L0003   ANOP                                                           00096000
FSDDCE   DSECT           UCB FICON Switch Device Class Extension        00097000
.L0004   ANOP                                                           00098000
FSDDCEVER DS   X         DCE Version                                    00099000
         DS    CL2       Reserved                                       00100000
FSDDCELEN DS   X         DCE Length                                     00101000
FSDDCEFSD DS   A         Address of FICON Switch Data, mapped by       *00102000
                         IRDDFSD macro, may be zero before FICON       *00103000
                         switch is brought online                       00104000
FSDDCEFCT DS   A         FRU code table address                         00105000
FSDDCEMISC1 DS 0CL4      Miscellaneous information                      00106000
FSDDCENUMSTATCTRS DS X   Number of statistical counters implemented     00107000
FSDDCENUMPORTS DS X      Number of external ports implemented/card      00108000
FSDDCEFIRSTPORT DS X     First port num implem.                         00109000
FSDDCELASTPORT DS X      Last port number implem.                       00110000
FSDDCEMISC2 DS 0CL4      Miscellaneous information                      00111000
FSDDCEFLAGS DS 0B                                                       00112000
FSDDCEPFINDICATOR EQU X'80' Device recommendation for CCW prefetching   00113000
         ORG   FSDDCEFLAGS+1                                            00114000
FSDDCEFLAGS2 DS 0B                                                      00115000
FSDDCEDFSDSTATSEXIST EQU X'80' Some were obtained                       00116000
FSDDCEBADPORTABEND EQU X'40' ABEND already issued                       00117000
FSDDCESUPPORTDIAGCMD EQU X'20' Switch supports diagnostics command      00118000
FSDDCERCF EQU  X'10'     Refresh configuration information              00119000
FSDDCEDYNROUT EQU X'08'  Switch is enabled for dynamic routing @04A     00119100
         ORG   FSDDCEFLAGS2+1                                           00120000
FSDDCEPRIORFIRSTPORT DS X To check for a change                         00121000
FSDDCEPRIORLASTPORT DS X To check for a change                          00122000
FSDDCEFSDAREAPTR DS A    Address of MIR data mapped by IHAFSD           00123000
FSDDCEFSDAREALEN DS F    Size of MIR data area                          00124000
FSDDCE_LEN EQU *-FSDDCE                                                 00125000
.L0002   ANOP                                                           00126000
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 00127000
         AIF   ('&LIST' EQ 'YES').P4                                    00128000
.P3      ANOP                                                           00129000
         POP   PRINT                                                    00130000
.P4      ANOP                                                           00131000
.P_EXIT  ANOP                                                           00132000
         MEND                                                           00133000
**/ IRDDCE_2:;                                                          00134000
* %IRDDCE_INCLUDED = 'YES';                                             00135000
* %DCL ZCBPRINT CHAR EXT;                                               00136000
* %DEACTIVATE ZCBPRINT;                                                 00137000
* %DCL IRDDCE_LIST CHAR EXT;                                            00138000
* %DEACTIVATE IRDDCE_LIST;                                              00139000
* %IF IRDDCE_LIST ^= 'NO' &                                             00140000
*    ZCBPRINT ^= 'NO' %THEN                                             00141000
*   %GOTO IRDDCE_3;                                                     00142000
*   @LIST PUSH NOECHO;                                                  00143000
*   @LIST NOASSEMBLE NOECHO;                                            00144000
*   @LIST OFF C NOECHO;                                                 00145000
* %IRDDCE_3:;                                                           00146000
*/* Start of PL/X Source                                             */ 00147000
* Dcl FsdDceVer2 Fixed(8) Constant(2); /*                        @01A*/ 00148000
* Dcl FsdDceVer3 Fixed(8) Constant(3); /*                        @02A*/ 00149005
*                                                                       00150000
* Dcl                                                                   00151000
*  1 FSDDCE BASED(UCBCLEXT) BDY(WORD), /* UCB FICON Switch Device       00152000
*                                      Class Extension               */ 00153000
*    3 FsdDceVer Fixed(8),          /* DCE Version                   */ 00154000
*    3 *         Char(2),           /* Reserved                      */ 00155000
*    3 FsdDceLen Fixed(8),          /* DCE Length                    */ 00156000
*    3 FsdDceFsd PTR(31),           /* Address of FICON Switch Data,    00157000
*                                      mapped by IRDDFSD macro, may be  00158000
*                                      zero before FICON switch is      00159000
*                                      brought online                */ 00160000
*    3 FsdDceFCT PTR(31),           /* FRU code table address    @01A*/ 00161000
*    3 FsdDceMisc1 CHAR(4),         /* Miscellaneous information @01A*/ 00162000
*     5 FsdDceNumStatCtrs Fixed(8), /* Number of statistical            00163000
*                                      counters implemented      @01A*/ 00164000
*     5 FsdDceNumPorts    Fixed(8), /* Number of external ports         00165000
*                                      implemented/card          @01A*/ 00166000
*     5 FsdDceFirstPort   Fixed(8), /* First port num implem.    @01A*/ 00167000
*     5 FsdDceLastPort    Fixed(8), /* Last port number implem.  @01A*/ 00168000
*    3 FsdDceMisc2 CHAR(4),         /* Miscellaneous information @01A*/ 00169000
*     5 FsdDceFlags Bit(8),         /*                           @01A*/ 00170000
*      7 FsdDcePFIndicator Bit(1),  /* Device recommendation for        00171000
*                                      CCW prefetching           @01A*/ 00172000
*      7 *          Bit(7),         /* Reserved                  @01A*/ 00173000
*     5 FsdDceFlags2 Bit(8),        /*                           @01A*/ 00174000
*      7 FsdDceDFSDSTATsExist Bit(1), /* Some were obtained      @01A*/ 00175000
*      7 FsdDceBadPortABEND   Bit(1), /* ABEND already issued    @01A*/ 00176000
*      7 FsdDceSupportDiagCmd Bit(1), /* Switch supports diagnostics    00177000
*                                        command                 @03A*/ 00178000
*      7 FsdDceRCF            Bit(1), /* Refresh configuration          00179000
*                                        information             @03A*/ 00180000
*      7 FsdDceDynRout        Bit(1), /* Switch is enabled for          00181002
*                                        dynamic routing         @04A*/ 00181101
*      7 *                    Bit(3), /* Reserved                @04C*/ 00181201
*     5 FsdDcePriorFirstPort Fixed(8), /* To check for a change  @01A*/ 00182000
*     5 FsdDcePriorLastPort  Fixed(8), /* To check for a change  @01A*/ 00183000
*    3 FsdDceFsdAreaPtr  Ptr(31),   /* Address of MIR data              00184000
*                                      mapped by IHAFSD          @02A*/ 00185000
*    3 FsdDceFsdAreaLen  Fixed(31); /* Size of MIR data area     @02A*/ 00186000
*/* End of PL/X Source                                               */ 00187000
* %IF IRDDCE_LIST ^= 'NO' &                                             00188000
*    ZCBPRINT ^= 'NO' %THEN                                             00189000
*   %GOTO IRDDCE_4;                                                     00190000
*   @LIST POP NOECHO;                                                   00191000
* %IRDDCE_4:;                                                           00192000
* %END;                                                                 00193000
