*                                                                       00001000
* %DCL IRDDFSD_INCLUDED CHAR EXT;                                       00002000
* %DEACTIVATE IRDDFSD_INCLUDED;                                         00003000
* %IF IRDDFSD_INCLUDED = '' %THEN                                       00004000
* %DO;                                                                  00005000
*/* Macro made bi-lingual on 19120. CBGEN compile date 19044         */ 00006000
*% /*                                                                   00007000
         MACRO                                                          00008000
         IRDDFSD &DSECT=YES,&LIST=YES,&TITLE=YES,&DFSD=YES,            *00009000
               &DFSDSTAT=COND                                           00010000
         GBLC  &IRDDFSD_INCLUDED                                        00011000
         GBLC  &ZCBPRINT                                                00012000
&IRDDFSD_INCLUDED SETC 'YES'                                            00013000
         AIF   ('&LIST' EQ 'NONE').P0                                   00014000
         AIF   ('&TITLE' EQ 'NO').P5                                    00015000
 TITLE   'IRDDFSD  - FICON Switch Device Statistical Data Area   '      00016000
.P5      ANOP                                                           00017000
**/ IRDDFSD_1:;                                                         00018000
*/****START OF SPECIFICATIONS*****************************************/ 00019000
*/*                                                                  */ 00020000
*/*01* MACRO-NAME: IRDDFSD                                           */ 00021000
*/*                                                                  */ 00022000
*/*01* DESCRIPTIVE-NAME: FICON Switch Device Statistical Data Area   */ 00023000
*/*                                                                  */ 00024000
*/*01* PROPRIETARY STATEMENT:                                        */ 00025000
*/*                                                                  */ 00026000
*/*      LICENSED MATERIALS - PROPERTY OF IBM                        */ 00027000
*/*      THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                 */ 00028000
*/*      5694-A01 (C) COPYRIGHT IBM CORP. 2001, 2002                 */ 00029000
*/*                                                                  */ 00030000
*/*01* STATUS: HSWF100                                               */ 00031000
*/*                                                                  */ 00032000
*/*01* EXTERNAL CLASSIFICATION: PI                                   */ 00033000
*/*01* END OF EXTERNAL CLASSIFICATION:                               */ 00034000
*/*                                                                  */ 00035000
*/*01* FUNCTION =                                                    */ 00036000
*/*      Maps the FICON Switch Device Statistical Data Area          */ 00037000
*/*                                                                  */ 00038000
*/*01* DSECT-NAME: Dfsd, DfsdStat                                    */ 00039000
*/*                                                                  */ 00040000
*/*01* COMPONENT: ESCON Director Device Support (00101)              */ 00041000
*/*                                                                  */ 00042000
*/*01* EYE-CATCHER: 'DFS'                                        @01C*/ 00043000
*/*02* OFFSET: 0                                                     */ 00044000
*/*02* LENGTH: 3                                                     */ 00045000
*/*                                                                  */ 00046000
*/*01* STORAGE ATTRIBUTES:                                           */ 00047000
*/*02* SUBPOOL:  245                                                 */ 00048000
*/*02* KEY:  0                                                       */ 00049000
*/*02* RESIDENCY: ESQA                                               */ 00050000
*/*                                                                  */ 00051000
*/*01* SIZE:                                                         */ 00052000
*/*          DFSD     -- X'0448' bytes                               */ 00053000
*/*          DFSDSEXT -- X'0020' bytes                           @03A*/ 00054000
*/*          DFSDSTAT -- X'0040' bytes                               */ 00055000
*/*                                                                  */ 00056000
*/*01* CREATED BY: IOSIUCB, IOSVCMUB, IOSVFSD                        */ 00057000
*/*                                                                  */ 00058000
*/*01* DELETED BY: IOSVCMUD                                          */ 00059000
*/*                                                                  */ 00060000
*/*01* POINTED TO BY: FsdDceFsd in IRDDCE UCB Class Extension        */ 00061000
*/*                                                                  */ 00062000
*/*01* FREQUENCY: One per FICON switch                               */ 00063000
*/*                                                                  */ 00064000
*/*01* SERIALIZATION: None                                           */ 00065000
*/*                                                                  */ 00066000
*/*01* NOTES: None                                                   */ 00067000
*/*                                                                  */ 00068000
*/*01* DEPENDENCIES: The size of the DfsdStat DSECT must be a        */ 00069000
*/*                  multiple of 8 bytes.                            */ 00070000
*/*                                                                  */ 00071000
*/*01* METHOD OF ACCESS:                                             */ 00072000
*/*                                                                  */ 00073000
*/*02* ASM: IRDDFSD                                                  */ 00074000
*/*                                                                  */ 00075000
*/*02* PL/AS: %INCLUDE SYSLIB(IRDDFSD)                               */ 00076000
*/*                                                                  */ 00077000
*/*01* CHANGE ACTIVITY =                                             */ 00078000
*/*  $L0=OW44428  HSWF100 010228 PDHT: Winterpark II Support         */ 00079000
*/*  $01=OW49638  HSWF100 020409 PDHC: Fix default counters      @01A*/ 00080000
*/*                                    Change eye catcher to         */ 00081000
*/*                                    'DFS'                     @01A*/ 00082000
*/*  $02=OW47875  HSWF100 030228 PDHC: Alternate FICON Switch.   @02A*/ 00083000
*/*                                    Add DfsdFlg1 field        @02A*/ 00084000
*/*  $03=OA56971  HSWF100 190415 PDMD: Support FICON statistics scale*/ 00085000
*/*                                    changes                       */ 00086000
*/*                                                                  */ 00087000
*/***END OF SPECIFICATIONS********************************************/ 00088000
*% /*                                                                   00089000
.P0      ANOP                                                           00090000
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 00091000
         AIF   ('&LIST' EQ 'YES').P2                                    00092000
.P1      ANOP                                                           00093000
         PUSH  PRINT                                                    00094000
         PRINT OFF                                                      00095000
.P2      ANOP                                                           00096000
DFSDDFS  EQU   C'DFS'    Dfsd eye catcher                               00097000
DFSDVER1 EQU   1         DFSD version 1                                 00098000
DFSDVER2 EQU   2         DFSD version 2                                 00099000
         AIF   ('&DFSD' EQ 'NO').L0002                                  00100000
         AIF   ('&DSECT' EQ 'YES').L0003                                00101000
         AIF   ('&DFSD' NE 'YES').L0002                                 00102000
DFSD     DS    0F        UCB FICON Switch Data Area                     00103000
         AGO   .L0004                                                   00104000
.L0003   ANOP                                                           00105000
DFSD     DSECT           UCB FICON Switch Data Area                     00106000
.L0004   ANOP                                                           00107000
DFSDHDR  DS    CL60      Header of Control Block                        00108000
         ORG   DFSDHDR                                                  00109000
DFSDEYE  DS    CL3       Eye Catcher - 'DFS'                            00110000
DFSDVER  DS    X         Version Code                                   00111000
DFSDSIZE DS    H         Length of DfsdHdr + length of DfsdStvP array   00112000
DFSDPCNT DS    H         Ct of ports supported by switch (i.e., number *00113000
                         of currently implemented ports)                00114000
DFSDNED  DS    CL32      Device Node Identifier                         00115000
DFSDTODU DS    CL8       Time of day at last update                     00116000
DFSDERRU DS    H         Failure ct updating statistics                 00117000
DFSDPSTS DS    H         Number of ports for which Statistics are      *00118000
                         being kept (i.e., number of currently         *00119000
                         installed ports)                               00120000
DFSDTALS DS    CL8       These tallies are updated in consecutive      *00121000
                         disabled code                                  00122000
         ORG   DFSDTALS                                                 00123000
DFSDNUBT DS    F         Stat Updates Begun Tally                       00124000
DFSDNUET DS    F         Stat Updates Ended Tally                       00125000
DFSDSTVP DS    A         Array of 256 pointers to ports' statistics    *00126000
                         (mapped by DFSDSTAT). DfsdStvP(n) may be 0 if *00127000
                         port number n is not implemented               00128000
         ORG   DFSD+1096                                                00129000
DFSD_LEN EQU   *-DFSD                                                   00130000
.L0002   ANOP                                                           00131000
         AIF   ('&DFSDSTAT' EQ 'NO').L0005                              00132000
         AIF   ('&DSECT' EQ 'YES').L0006                                00133000
         AIF   ('&DFSDSTAT' NE 'YES').L0005                             00134000
DFSDSTAT DS    0F        Statistics, based on DfsdStvP(n)               00135000
         AGO   .L0007                                                   00136000
.L0006   ANOP                                                           00137000
DFSDSTAT DSECT           Statistics, based on DfsdStvP(n)               00138000
.L0007   ANOP                                                           00139000
DFSDSPTN DS    H         Port number                                    00140000
DFSDFLG1 DS    CL1       Flags                                          00141000
*  Bit definitions:                                                     00142000
DFSDMPIR EQU   X'80'     Port information was returned at least once   *00143000
                         for this port                                  00144000
DFSDNOTI EQU   X'40'     Port info. showed the port not installed       00145000
DFSDLF   EQU   X'20'     Port info. showed link failure condition       00146000
DFSDOFFL EQU   X'10'     Port info. showed the port offline             00147000
DFSDSCR  EQU   X'08'     Statistics were returned at least once for    *00148000
                         this port                                      00149000
DFSDRSV1 EQU   X'07'     Reserved for future use                        00150000
         DS    CL1       Reserved for future use                        00151000
DFSDSWTC DS    FL8       Ct of Words Transmitted                        00152000
DFSDSWRC DS    FL8       Ct of Words Received                           00153000
DFSDSFTC DS    FL8       Ct of Frames Transmitted                       00154000
DFSDSFRC DS    FL8       Ct of Frames Received                          00155000
DFSDSF2C DS    F         Ct of Class 2 Frames received                  00156000
DFSDSF3C DS    F         Ct of Class 3 Frames received                  00157000
DFSDSFLC DS    F         Ct of Link Ctl Frames Recvd                    00158000
DFSDSMFC DS    F         Ct of Multicast Frames Recvd                   00159000
DFSDSFPT DS    F         Frame Pacing Time                              00160000
DFSDSFEC DS    F         not used                                       00161000
DFSDSLEC DS    F         Error Summary Count                            00162000
DFSDSTAT_LEN EQU *-DFSDSTAT                                             00163000
.L0005   ANOP                                                           00164000
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 00165000
         AIF   ('&LIST' EQ 'YES').P4                                    00166000
.P3      ANOP                                                           00167000
         POP   PRINT                                                    00168000
.P4      ANOP                                                           00169000
.P_EXIT  ANOP                                                           00170000
         MEND                                                           00171000
**/ IRDDFSD_2:;                                                         00172000
* %IRDDFSD_INCLUDED = 'YES';                                            00173000
* %DCL ZCBPRINT CHAR EXT;                                               00174000
* %DEACTIVATE ZCBPRINT;                                                 00175000
* %DCL IRDDFSD_LIST CHAR EXT;                                           00176000
* %DEACTIVATE IRDDFSD_LIST;                                             00177000
* %IF IRDDFSD_LIST = 'NO' !                                             00178000
*    ZCBPRINT = 'NO' %THEN                                              00179000
* %DO;                                                                  00180000
*   @LIST PUSH NOECHO;                                                  00181000
*   @LIST NOASSEMBLE NOECHO;                                            00182000
*   @LIST OFF C NOECHO;                                                 00183000
* %END;                                                                 00184000
*/* Start of PL/X Source                                             */ 00185000
* Dcl DfsdDFS Char(3) Constant('DFS'), /* Dfsd eye catcher       @01C*/ 00186000
*     DfsdVer1 Constant(1),         /* DFSD version 1                */ 00187000
*     DfsdVer2 Constant(2);         /* DFSD version 2            @02A*/ 00188000
*                                                                       00189000
* Dcl 1 DFSD Based(FsdDceFsd) Bdy(WORD), /* UCB FICON Switch            00190000
*                                      Data Area                     */ 00191000
*       3 DfsdHdr,                  /* Header of Control Block       */ 00192000
*         5 DfsdEye  CHAR(3),       /* Eye Catcher - 'DFS'           */ 00193000
*         5 DfsdVer  FIXED(8),      /* Version Code                  */ 00194000
*         5 DfsdSize FIXED(15),     /* Length of DfsdHdr + length of    00195000
*                                      DfsdStvP array            @03C*/ 00196000
*         5 DfsdPCnt FIXED(15),     /* Ct of ports supported by         00197000
*                                      switch (i.e., number of          00198000
*                                      currently implemented ports)  */ 00199000
*         5 DfsdNed  CHAR(32),      /* Device Node Identifier        */ 00200000
*         5 DfsdTodU CHAR(8),       /* Time of day at last update    */ 00201000
*         5 DfsdErrU FIXED(16),     /* Failure ct updating statistics*/ 00202000
*         5 DfsdPsts FIXED(16),     /* Number of ports for which        00203000
*                                      Statistics are being kept        00204000
*                                      (i.e., number of currently       00205000
*                                      installed ports)              */ 00206000
*         5 DfsdTals,               /* These tallies are updated in     00207000
*                                      consecutive disabled code @02A*/ 00208000
*           7 DfsdNUBT FIXED(32),   /* Stat Updates Begun Tally      */ 00209000
*           7 DfsdNUET FIXED(32),   /* Stat Updates Ended Tally      */ 00210000
*       3 DfsdStvP(0:255) PTR(31),  /* Array of 256 pointers to         00211000
*                                      ports' statistics (mapped by     00212000
*                                      DFSDSTAT).  DfsdStvP(n) may      00213000
*                                      be 0 if port number n is not     00214000
*                                      implemented               @03C*/ 00215000
*       3 DfsdSExtPtr Ptr(31),      /* Address of Ficon statistics      00216000
*                                      data extension            @03A*/ 00217000
*       3 DfsdSExtLen Fixed(32),    /* Length of Ficon statistics data  00218000
*                                      extension area            @03A*/ 00219000
*       3 DfsdStrucLen Fixed(32);   /* Total length of DFSD structure   00220000
*                                                                @03A*/ 00221000
*                                                                       00222000
* Dcl 1 DFSDSTAT Based,             /* Statistics, based on             00223000
*                                      DfsdStvP(n)                   */ 00224000
*       3    DfsdSPTN FIXED(15),    /* Port number                   */ 00225000
*       3    DfsdFlg1 CHAR(1),      /* Flags                     @02A*/ 00226000
*         5  DfsdMPIR   BIT(1),     /* Port information was returned    00227000
*                                      at least once for this           00228000
*                                      port                      @02A*/ 00229000
*         5  DfsdNotI   BIT(1),     /* Port info. showed the port       00230000
*                                      not installed             @02A*/ 00231000
*         5  DfsdLF     BIT(1),     /* Port info. showed link failure   00232000
*                                      condition                 @02A*/ 00233000
*         5  DfsdOffl   BIT(1),     /* Port info. showed the port       00234000
*                                      offline                   @02A*/ 00235000
*         5  DfsdSCR    BIT(1),     /* Statistics were returned at      00236000
*                                      least once for this port  @02A*/ 00237000
*         5  DfsdRsv1   BIT(3),     /* Reserved for future use   @02A*/ 00238000
*       3    *        CHAR(1),      /* Reserved for future use   @02C*/ 00239000
*       3    DfsdSWTC FIXED(64) BDY(WORD), /* Ct of Words Transmitted*/ 00240000
*       3    DfsdSWRC FIXED(64) BDY(WORD), /* Ct of Words Received   */ 00241000
*       3    DfsdSFTC FIXED(64) BDY(WORD), /* Ct of Frames              00242000
*                                      Transmitted                   */ 00243000
*       3    DfsdSFRC FIXED(64) BDY(WORD), /* Ct of Frames Received  */ 00244000
*       3    DfsdSF2C FIXED(32),    /* Ct of Class 2 Frames received */ 00245000
*       3    DfsdSF3C FIXED(32),    /* Ct of Class 3 Frames received */ 00246000
*       3    DfsdSFLC FIXED(32),    /* Ct of Link Ctl Frames Recvd   */ 00247000
*       3    DfsdSMFC FIXED(32),    /* Ct of Multicast Frames Recvd  */ 00248000
*       3    DfsdSFPT FIXED(32),    /* Frame Pacing Time             */ 00249000
*       3    DfsdSFEC FIXED(32),    /* not used                  @01C*/ 00250000
*       3    DfsdSLEC FIXED(32),    /* Error Summary Count       @01C*/ 00251000
*       3    *        CHAR(0);      /* End of Structure              */ 00252000
*                                                                       00253000
*/********************************************************************/ 00254000
*/*                                                                  */ 00255000
*/* DFSDDSEXT - Extension the FICON Statistics                       */ 00256000
*/* Contains additional information for each of the 64-bit counters  */ 00257000
*/* that is used by IOS to compute values stored in DFSDSTAT.        */ 00258000
*/*                                                              @03A*/ 00259000
*/********************************************************************/ 00260000
* Dcl 1 DFSDSExt(0:255) Based(DfsdSExtPtr)                              00261000
*                     Bdy(DWord),   /* Statistical counter extension    00262000
*                                                                @03A*/ 00263000
*       3 DFSDSX_WTCOverFlowCntr Fixed(64),           /*                00264000
*                                      Overflow counter for DfsdSWTC    00265000
*                                                                @03A*/ 00266000
*       3 DFSDSX_WRCOverFlowCntr Fixed(64),           /*                00267000
*                                      Overflow counter for DfsdSWRC    00268000
*                                                                @03A*/ 00269000
*       3 DFSDSX_FTCOverFlowCntr Fixed(64),           /*                00270000
*                                      Overflow counter for DfsdSFTC    00271000
*                                                                @03A*/ 00272000
*       3 DFSDSX_FRCOverFlowCntr Fixed(64),           /*                00273000
*                                      Overflow counter for DfsdSFRC    00274000
*                                                                @03A*/ 00275000
*       3 *        CHAR(0);         /* End of Structure          @03A*/ 00276000
*                                                                       00277000
*/********************************************************************/ 00278000
*/*                                                                  */ 00279000
*/* Constants for DFSDSExt                                           */ 00280000
*/*                                                              @03A*/ 00281000
*/********************************************************************/ 00282000
*                                                                       00283000
* Dcl DFSDSExtSubpool Constant(0);   /* Subpool 0 - Private, pageable,  00284000
*                                       Task                     @03A*/ 00285000
*@logic;                                                                00286000
*#PRAGMA TOOL=CBGEN.                                                    00287000
*#DELETE.DFSDSEXT                                                       00288000
*#DELETE.DfsdSExtPtr                                                    00289000
*#DELETE.DfsdSExtLen                                                    00290000
*#DELETE.DfsdStrucLen                                                   00291000
*#DELETE.DFSDSEXTSubpool                                                00292000
*#EPRAGMA.                                                              00293000
*@endlogic;                                                             00294000
*/* End of PL/X Source                                               */ 00295000
* %IF IRDDFSD_LIST = 'NO' !                                             00296000
*    ZCBPRINT = 'NO' %THEN                                              00297000
* %DO;                                                                  00298000
*   @LIST POP NOECHO;                                                   00299000
* %END;                                                                 00300000
* %END;                                                                 00301000
