*%;    /*                                                               00020800
         MACRO                                                          00041600
         IRRPZPL &DSECT=YES                                          */ 00062400
*/****START OF SPECIFICATIONS****************************************** 00083200
*                                                                       00104000
*  $MAC (IRRPZPL) COMP(SC1BN) PROD(SAF):                                00124800
*                                                                       00145600
*01* MACRO NAME: IRRPZPL                                                00166400
*                                                                       00187200
*01* DSECT NAME: ZPL                                                    00208000
*                                                                       00228800
*01* DESCRIPTIVE NAME: SAF3 Parameter List                              00249600
*                                                                       00270400
*02*   ACRONYM: ZPL                                                     00291200
**/                                                                     00312000
*/*01* PROPRIETARY STATEMENT=                                        */ 00332800
*/***PROPRIETARY_STATEMENT********************************************/ 00353600
*/*                                                                  */ 00374400
*/*                                                                  */ 00395200
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00416000
*/* THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                      */ 00436800
*/* 5694-A01 (C) COPYRIGHT IBM CORP. 2001                            */ 00457600
*/*                                                                  */ 00478400
*/* STATUS= HBB7706                                                  */ 00499200
*/*                                                                  */ 00520000
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 00540800
*/*                                                                  */ 00561600
*/*01* EXTERNAL CLASSIFICATION: PSPI                             @L2C*/ 00582400
*/*01* END OF EXTERNAL CLASSIFICATION:                               */ 00603200
*/*                                                                     00624000
*01* FUNCTION:                                                          00644800
*                                                                       00665600
*    This file contains the PL/X and BAL mapping of the common input    00686400
*    parameter list for SAF3 and PD routers. It also has                00707200
*    the input parameter lists for each of the service                  00728000
*    routines. The input parameter lists in this file are:              00748800
*                                                                       00769600
*    DSECT NAME   STUB NAME      SECURITY FUNCTION                      00790400
*                                                                       00811200
*      ZPL        all         Common Security                           00861200
*                                                                       02537600
*      ZACC       IRRSZA00    aznAccess for Policy Director             02558400
*                                                                       02562500
*      ZCRE       IRRSZC00    aznCreds  for Policy Director             02566600
*                                                                       02570700
*                                                                       02579200
*01* METHOD OF ACCESS:                                                  02600000
*                                                                       02620800
*02*   PL/X:  %INCLUDE(IRRPZPL)                                         02641600
*                                                                       02662400
*             Base the ZPL plist on a pointer you declare.              02704000
*                                                                       02745600
*                                                                       02766400
*02*   ASM:   IRRPZPL                                                   02787200
*             A DSECT is produced unless DSECT=NO is specified.         02808000
*                                                                       02828800
*             LA     REG,ZPL                                            02849600
*             USING  ZPL,REG                                            02870400
*                                                                       02891200
*             Where REG is any general register except 0.               02912000
*                                                                       02932800
*                                                                       02953600
*01* SIZE: Release dependent. Refer to the mapping.                     02974400
*                                                                       02995200
*01* POINTED TO BY: Address of ZPL is passed in register 1              03016000
*                   when invoking SAF3 functions.                       03036800
*                                                                       03057600
*01* CREATED BY: Invoker of PD functions.                               03078400
*                                                                       03099200
*01* DELETED BY: Invoker of PD functions.                               03120000
*                                                                       03140800
*01* STORAGE ATTRIBUTES:                                                03161600
*02*   SUBPOOL:  N/A                                                    03182400
*02*   KEY:      Any                                                    03203200
*02*   RESIDENCY: Invoker's primary address space                       03224000
*                                                                       03244800
*01* FREQUENCY: N/A                                                     03265600
*                                                                       03286400
*01* SERIALIZATION: N/A                                                 03307200
*                                                                       03328000
*01* DEPENDENCIES: None                                                 03348800
*                                                                       03369600
*01* NOTES: None                                                        03390400
*                                                                       03411200
*                                                                       03432000
*01* COMPONENT:   SAF (SC1BN)                                           03452800
*                                                                       03473600
*01* DISTRIBUTION LIBRARY:  AMACLIB                                     03494400
*                                                                       03515200
*01* EYE-CATCHER: None - this is not a control block definition.        03536000
*02*   OFFSET:  N/A                                                     03556800
*02*   LENGTH:  N/A                                                     03577600
*                                                                       03598400
*01* CHANGE-ACTIVITY:                                                   03619200
*                                                                       03640000
*   $L0=PD       HBB7705  001020  PDSGW1: Initial Release               03660800
*   $P1=PX00818  HBB7705  010125  PDPFW:  PTM PX00818             @P1A  03671200
*   $01=OW49960  HBB7705  010623  PDALF1: APAR OW49960            @01A  03672900
*   $L1=PolDir   HBB7706  010530  PDKC1:  Policy Director Support @L1A  03674600
*   $L2=PolDir   HBB7706  010608  PDSGW1: Policy Director Support @L2A  03678000
*   $L3=PolDir   HBB7706  010723  PDKC1:  Feature 128             @L3A  03690200
*   $L4=PolDir   HBB7706  010808  PDSGW1: Feature 179             @L4A  03694200
*   $L5=PolDir   HBB7706, 010828, PDKC1:  Feature 189             @L5A  03698200
*                                                                       03702400
*01* CHANGE-DESCRIPTIONS:                                               03723200
*                                                                       03744000
*    A 000000-999999                                                    03764800
*    A CORRECTED COPY RIGHT STATEMENT TO MATCH EXTERNAL           @P1A  03771700
*      CLASSIFICATION AND IDS INFO                                @P1A  03778600
*    Take out the ALET ZACC_PARM_ALET@ and ZCRE_PARM_ALET@ due to @L1D  03780000
*    design change and redefine data type for ZACC and ZCRE       @L1C  03781400
*    function code variables to 2 bytes instead of 1 byte.        @L1C  03782800
*    A - Ship externally (PSPI), update comments                  @L2A  03784200
*    A - Add input, Option_word and output, Resource_attributes   @L3A  03784600
*        for DCR support.                                         @L3A  03785000
*    A - Add ZCRE_BUILD_UNAUTH_CREDS                              @L4A  03785100
*    A - Add code to return POP attributes(Audit level and QOP)   @L5A  03785200
*        that saved in the protected resource.                    @L5A  03785300
*                                                                       03785600
****END OF SPECIFICATIONS*********************************************/ 03806400
*%;/*                                                                   03827200
*********************************************************************** 03848000
*********************************************************************** 03868800
***                                                                  ** 03889600
***                   COMP ASSEMBLER DECLARATIONS                    ** 03910400
***------------------------------------------------------------------** 03931200
***                                                                  ** 03952000
***   DECLARATION NAME = ZPL                                         ** 03972800
***                                                                  ** 03993600
***   DESCRIPTIVE NAME = Common SAF3/PDF parameter list              ** 04014400
***                                                                  ** 04035200
***   FUNCTION = Provides BAL mapping of the common input parameter  ** 04056000
***              list for the SAF3/PD routers.                       ** 04076800
***                                                                  ** 04097600
**********************************************************************/ 04118400
*%;   /*                                                                04139200
         AIF   ('&DSECT' EQ 'NO').ZPLN                                  04160000
*                                                                       04180800
ZPL      DSECT ,                 SAF3/PD common plist                   04201600
         AGO   .ZPLY                                                    04222400
.ZPLN   ANOP                                                            04243200
ZPL      DS    0F                SAF3/PD common plist                   04264000
.ZPLY   ANOP                                                            04284800
*                                                                       04305600
ZPL_PARM_COUNT@   DS  A          Address of number of parameters        04321200
*                                                                       04326400
ZPL_WORK_AREA@    DS  A          Address of 1024 byte work area         04357600
*                                                                       04368000
ZPL_SAFRC_ALET@   DS  A          Address of ALET for SAF return code    04399200
*                                                                       04409600
ZPL_SAFRC@        DS  A          Address of SAF return code             04480400
*                                                                       04534400
ZPL_MAJOR_ALET@   DS  A          Address of ALET for major code         04565600
*                                                                       04576000
ZPL_MAJOR@        DS  A          Address of major code                  04598800
*                                                                       04600800
ZPL_MINOR_ALET@   DS  A          Address of ALET for minor code         04606800
*                                                                       04608800
ZPL_MINOR@        DS  A          Address of minor code                  04615200
*                                                                       04617600
ZPL_SERVER_PARMS  DS  0C         Parameters for the service routines    04638400
*                                 start here                            04659200
*                                                                       04680000
ZPL_LENGTH        EQU *-ZPL      Constant - Fixed length of the ZPL     04700800
*                                                                       04721600
*********************************************************************** 04742400
*                                                                     * 04763200
*                aznAccess ASSEMBLER DECLARATIONS                     * 04813200
*---------------------------------------------------------------------* 41912000
*                                                                     * 41932800
*  DECLARATION NAME = ZACC                                            * 41953600
*                                                                     * 41974400
*  DESCRIPTIVE NAME = Policy Director - aznAccess interface           * 41995200
*                                                                     * 42016000
*  FUNCTION = Provides the ASSEMBLER mapping of the input parameter   * 42036800
*             list for the aznAccess callable service                 * 42057600
*********************************************************************** 42078400
                     ORG ZPL_SERVER_PARMS   Follows common plist        42099200
*                                                                       42120000
ZACC                 DS  0C     Mapping for ZACC                        42140800
*                                                                       42161600
*                                                                 2@L1D 42172000
*                                                                       42182400
ZACC_FUNCTION@       DS  A      Address of 2-byte input function        42232200
*                               code                                    42248800
*                                                                       42265600
ZACC_ACEE_PTR@       DS  A      Address of an ACEE address              42328000
*                                                                       42348800
ZACC_USERID@         DS  A      Address of a 9-byte area containing a   42394500
*                               1-byte length followed by a host user   42407000
*                               identity of up to 8 characters          42419500
*                                                                       42432000
ZACC_CREDS_PTR@      DS  A      Address of a credential address    @L2A 42463200
*                                                                       42494400
ZACC_RESOURCE@       DS  A      Address of an area containing a 4-byte  42520900
*                               length followed by an EBCDIC string     42522600
*                               name of a protected resource            42524300
*                                                                       42526000
ZACC_OPERATION@      DS  A      Address of an area containing a 1-byte  42531100
*                               length followed by an EBCDIC string     42532800
*                               representing an operation               42534500
*                                                                       42536200
ZACC_PERMISSION@     DS  A      Address of a 2-byte value indicating    42541300
*                               whether access is permitted             42544000
*                                                                       42545400
ZACC_OPTION@         DS  A      Address of a 4-byte value          @L3A 42546800
*                               containing an option flag          @L3A 42548200
*                                                                       42549600
ZACC_RSCATTR@        DS  A      Address of a 4-byte value          @L3A 42551400
*                               containing the address of a        @L5C 42552100
*                               resource attribute structure       @L5C 42552800
*                                                                       42553500
ZACC_POPATTR@        DS  A      Address of a 4-byte value          @L5A 42554200
*                               containing the address of a        @L5A 42554900
*                               POP attribute structure            @L5A 42555600
*                                                                       42556800
ZACC_LENGTH          EQU *-ZACC Fixed length of ZACC                    42558100
*                                                                       42559400
*   Function code values                                                42560700
*                                                                       42562000
ZACC_DECIDE_ACCESS   EQU X'01'  Make access control decision            42563300
*                                                                  @L3A 42563400
*   Option flag values                                             @L3A 42563500
*                                                                  @L3A 42563600
ZACC_ACCESS_OPTION   EQU X'00' Access control decision Option      @L5C 42564100
*                                                                       42564600
ZACC_ATTRIB_OPTION   EQU X'01' Access control decision returned    @L5C 42564700
*                              Resource Attributes structure       @L5C 42564800
*                              Option                              @L5C 42564900
ZACC_POP_OPTION      EQU X'02' Access control decision returned    @L5A 42565000
*                              POP Attributes structure Option     @L5A 42565100
ZACC_BOTH_OPTION     EQU X'03' Access control decision returned    @L5A 42565200
*                              Resource and POP atrribute          @L5A 42565300
*                              structures Option                   @L5A 42565400
*   Operation code values                                               42565900
*                                                                       42567200
ZACC_AUDIT           EQU C'A'                                           42568500
ZACC_ATTACH          EQU C'a'                                           42569800
ZACC_BROWSE          EQU C'b'                                           42571100
ZACC_CONNECT         EQU C'C'                                           42572400
ZACC_CONTROL         EQU C'c'                                           42573700
ZACC_DELETE          EQU C'd'                                           42575000
ZACC_FORWARD         EQU C'f'                                           42576300
ZACC_DELEGATE        EQU C'g'                                           42577600
ZACC_INTEGRITY       EQU C'I'                                           42578900
ZACC_LIST_DIRECTORY  EQU C'l'                                           42580200
ZACC_MODIFY          EQU C'm'                                           42581500
ZACC_PRIVACY         EQU C'P'                                           42582800
ZACC_READ            EQU C'r'                                           42584100
ZACC_SERVER_ADMIN    EQU C's'                                           42585400
ZACC_TRAVERSE        EQU C'T'                                           42586700
ZACC_VIEW            EQU C'v'                                           42588000
ZACC_EXECUTE         EQU C'x'                                           42589300
*                                                                       42590600
*                                                                       42591900
*********************************************************************** 42593200
*                                                                     * 42594500
*                aznCreds ASSEMBLER DECLARATIONS                      * 42595800
*---------------------------------------------------------------------* 42598400
*                                                                     * 42600400
*  DECLARATION NAME = ZCRE                                            * 42602400
*                                                                     * 42604400
*  DESCRIPTIVE NAME = Policy Director - aznCreds interface            * 42606400
*                                                                     * 42608400
*  FUNCTION = Provides the ASSEMBLER mapping of the input parameter   * 42610400
*             list for the aznCreds callable service                  * 42612400
*********************************************************************** 42614400
                     ORG ZPL_SERVER_PARMS   Follows common plist        42616400
*                                                                       42619200
ZCRE                 DS  0C     Mapping for ZCRE                        42640000
*                                                                       42660800
*                                                                 2@L1D 42710800
*                                                                       42785600
ZCRE_FUNCTION@       DS  A      Address of 2-byte input function        42786200
*                               code                                    42786400
*                                                                       42786600
ZCRE_ACEE_PTR@       DS  A      Address of an ACEE address              42787200
*                                                                       42787400
ZCRE_USERID@         DS  A      Address of a 9-byte area containing a   42788000
*                               1-byte length followed by a host user   42788200
*                               identity of up to 8 characters          42788400
*                                                                       42788600
ZCRE_CREDS_PTR@      DS  A      Address of a credential address    @L2A 42789000
*                                                                       42789400
ZCRE_IDENTITY@       DS  A      Address of a identity information       42790000
*                               from an authentication service          42790200
*                                                                       42790400
ZCRE_NEW_CREDS_PTR@  DS  A      Address of a new credential        @L2A 42790800
*                               address                                 42791200
*                                                                       42791400
ZCRE_LENGTH          EQU *-ZCRE Fixed length of ZCRE                    42791600
*                                                                       42791800
*   Function code values                                                42792000
*                                                                       42792200
ZCRE_BUILD_CREDS         EQU X'01'  Build credentials                   42795000
ZCRE_DELETE_CREDS        EQU X'02'  Delete credentials                  42797800
ZCRE_BUILD_UNAUTH_CREDS  EQU X'03'  Build unauthenticated credentials   42800600
*                                                                 @L4A  42803400
*                                                                       42806400
*---------------------------------------------------------------------* 49816000
                   MEND                                              */ 49836800
*                                                                       49920000
*                                                                       49940800
*                                                                       49961600
*                                                                       49982400
*/********************************************************************/ 50003200
*/********************************************************************/ 50024000
*/********************************************************************/ 50044800
*/*                                                                  */ 50065600
*/*                      ZPL PL/X DECLARATIONS                       */ 50086400
*/*------------------------------------------------------------------*/ 50107200
*/*                                                                  */ 50128000
*/*   DECLARATION NAME = ZPL                                         */ 50148800
*/*                                                                  */ 50169600
*/*   DESCRIPTIVE NAME = Common SAF3/PD parameter list               */ 50190400
*/*                                                                  */ 50211200
*/*   FUNCTION = Provides PL/X mapping of the common input parameter */ 50232000
*/*              list for the SAF3/PD routers                        */ 50252800
*/*                                                                  */ 50273600
*/********************************************************************/ 50294400
*                                                                       50315200
* DECLARE                                                               50336000
*  1 ZPL  BASED BDY(WORD),       /* Common SAF3/PD plist             */ 50356800
*                                                                       50377600
*    3 ZPL_PARM_COUNT@  PTR(31), /* Addr of number or parameters     */ 50398400
*                                                                       50419200
*    3 ZPL_WORK_AREA@   PTR(31), /* Addr of 1024 byte work area      */ 50440000
*                                                                       50460800
*    3 ZPL_SAFRC_ALET@  PTR(31), /* Addr of ALET for SAF return code */ 50481600
*                                                                       50502400
*    3 ZPL_SAFRC@       PTR(31), /* Addr of SAF return code          */ 50531200
*                                                                       50560000
*    3 ZPL_MAJOR_ALET@  PTR(31), /* Addr of ALET for major code      */ 50564000
*                                                                       50568000
*    3 ZPL_MAJOR@       PTR(31), /* Addr of major code               */ 50572000
*                                                                       50576000
*    3 ZPL_MINOR_ALET@  PTR(31), /* Addr of ALET for minor code      */ 50580800
*                                                                       50585600
*    3 ZPL_MINOR@       PTR(31), /* Addr of minor code               */ 50635600
*                                                                       50704400
*    3 ZPL_SERVER_PARMS CHAR(0); /* Service routine parameter lists     50713300
*                                    begin here                      */ 50722200
*                                                                       50731200
* DECLARE                                                               50772800
*  ZPL_LENGTH FIXED(31) CONSTANT(LENGTH(ZPL)); /* Constant ZPL length*/ 50793600
*                                                                       50814400
*                                                                       97760000
*/********************************************************************/ 97780800
*/*                                                                  */ 97801600
*/*         aznAccess PL/X DECLARATIONS                              */ 97822400
*/*------------------------------------------------------------------*/ 97843200
*/*                                                                  */ 97864000
*/*  DECLARATION NAME = ZACC                                         */ 97884800
*/*                                                                  */ 97905600
*/*  DESCRIPTIVE NAME = Policy Director - aznAccess interface        */ 97926400
*/*                                                                  */ 97947200
*/*  FUNCTION = Provides the PL/X mapping of the input parameter     */ 97968000
*/*             list for the aznAccess service                       */ 97995700
*/*                                                                  */ 98023400
*/********************************************************************/ 98051200
*                                                                       98061600
* DECLARE                                                               98072000
*  1 ZACC  BASED(ADDR(ZPL_SERVER_PARMS)),  /* Mapping for ZACC       */ 98092800
*                                                                       98113600
*                                 /*                            3@L1D*/ 98136700
*                                                                       98159900
*    3 ZACC_FUNCTION@   PTR(31),  /* Address of 2-byte function code */ 98179500
*                                                                       98199200
*    3 ZACC_ACEE_PTR@   PTR(31),  /* Address of an ACEE address      */ 98220600
*                                                                       98242000
*    3 ZACC_USERID@     PTR(31),  /* Address of a 9-byte area           98259800
*                                    containing a 1-byte length         98277600
*                                    followed by a host user identity   98284700
*                                    of up to 8 characters           */ 98291800
*                                                                       98298900
*    3 ZACC_CREDS_PTR@  PTR(31),  /* Address of a credential       @L2A 98318600
*                                    address                         */ 98338300
*                                                                       98349000
*    3 ZACC_RESOURCE@   PTR(31),  /* Address of an area containing a    98361600
*                                    4-byte length followed by an       98374200
*                                    EBCDIC string name of a            98376100
*                                    protected resource              */ 98378000
*                                                                       98379900
*    3 ZACC_OPERATION@  PTR(31),  /* Address of an area containing a    98383700
*                                    1-byte length followed by an       98387500
*                                    EBCDIC string representing an      98389400
*                                    operation                       */ 98391300
*                                                                       98393200
*    3 ZACC_PERMISSION@ PTR(31),  /* Address of a 2-byte value          98397000
*                                    indicating whether access is       98400800
*                                    permitted                  @L3C */ 98401200
*                                                                       98401600
*    3 ZACC_OPTION@     PTR(31),  /* Address of a 4-byte value          98402000
*                                    containing an option flag  @L3A */ 98402400
*                                                                       98402800
*    3 ZACC_RSCATTR@    PTR(31),  /* Address of a 4-byte value          98403000
*                                    containing the address of resource 98403200
*                                    attribute structure        @L5C */ 98403400
*                                                                       98403600
*    3 ZACC_POPATTR@    PTR(31);  /* Address of a 4-byte value          98403800
*                                    containing the address of a POP    98404000
*                                    attribute structure        @L5A */ 98404200
*                                                                       98404800
* DECLARE                                                               98425600
*  ZACC_LENGTH FIXED(31) CONSTANT(LENGTH(ZACC)), /* Const ZACC length*/ 98475600
*                                                                       98633600
*/*                 Function code values                             */ 98683600
*                                                                       98690400
*  ZACC_DECIDE_ACCESS  FIXED(16) CONSTANT(1), /* Make access decision*/ 98697200
*                                             /*                @L1C */ 98704000
*/*                 Option flag values                          @L3A */ 98704300
*                                                                       98704600
*  ZACC_ACCESS_OPTION  FIXED(32) CONSTANT(0), /* Make only access    */ 98704900
*                                             /* decision       @L5C */ 98705800
*  ZACC_ATTRIB_OPTION  FIXED(32) CONSTANT(1), /* Make access decision*/ 98706700
*                                             /* and returned a RSC  */ 98707600
*                                             /* attributes structure*/ 98708500
*                                             /*                @L5C */ 98708700
*  ZACC_POP_OPTION     FIXED(32) CONSTANT(2), /* Make access decision*/ 98708900
*                                             /* and returned a POP  */ 98709100
*                                             /* attributes structure*/ 98709300
*                                             /*                @L5A */ 98709500
*  ZACC_BOTH_OPTION    FIXED(32) CONSTANT(3), /* Make access decision*/ 98709700
*                                             /* and returned RSC and*/ 98709900
*                                             /* POP attributes      */ 98710100
*                                             /* structures     @L5A */ 98710300
*/*                 Operation code values                            */ 98710800
*                                                                       98717600
*  ZACC_AUDIT          CHAR(1) CONSTANT('A'),                           98724400
*  ZACC_ATTACH         CHAR(1) CONSTANT('a'),                           98731200
*  ZACC_BROWSE         CHAR(1) CONSTANT('b'),                           98738000
*  ZACC_CONNECT        CHAR(1) CONSTANT('C'),                           98744800
*  ZACC_CONTROL        CHAR(1) CONSTANT('c'),                           98751600
*  ZACC_DELETE         CHAR(1) CONSTANT('d'),                           98758400
*  ZACC_FORWARD        CHAR(1) CONSTANT('f'),                           98765200
*  ZACC_DELEGATE       CHAR(1) CONSTANT('g'),                           98772000
*  ZACC_INTEGRITY      CHAR(1) CONSTANT('I'),                           98778800
*  ZACC_LIST_DIRECTORY CHAR(1) CONSTANT('l'),                           98785600
*  ZACC_MODIFY         CHAR(1) CONSTANT('m'),                           98792400
*  ZACC_PRIVACY        CHAR(1) CONSTANT('P'),                           98799200
*  ZACC_READ           CHAR(1) CONSTANT('r'),                           98806000
*  ZACC_SERVER_ADMIN   CHAR(1) CONSTANT('s'),                           98812800
*  ZACC_TRAVERSE       CHAR(1) CONSTANT('T'),                           98819600
*  ZACC_VIEW           CHAR(1) CONSTANT('v'),                           98826400
*  ZACC_EXECUTE        CHAR(1) CONSTANT('x');                           98833200
*                                                                       98841600
*                                                                       98966400
*/********************************************************************/ 98976300
*/*                                                                  */ 98986200
*/*         aznCreds PL/X DECLARATIONS                               */ 98996100
*/*------------------------------------------------------------------*/ 99006000
*/*                                                                  */ 99015900
*/*  DECLARATION NAME = ZCRE                                         */ 99025800
*/*                                                                  */ 99035700
*/*  DESCRIPTIVE NAME = Policy Director - aznCreds interface         */ 99045600
*/*                                                                  */ 99055500
*/*  FUNCTION = Provides the PL/X mapping of the input parameter     */ 99065400
*/*             list for the aznCreds service                        */ 99075300
*/*                                                                  */ 99085200
*/********************************************************************/ 99095100
*                                                                       99105000
* DECLARE                                                               99114900
*  1 ZCRE  BASED(ADDR(ZPL_SERVER_PARMS)),  /*                        */ 99124800
*                                                                       99134700
*                                 /*                            3@L1D*/ 99159400
*                                                                       99184200
*    3 ZCRE_FUNCTION@   PTR(31),  /* Address of 2-byte function code */ 99204000
*                                                                       99223800
*    3 ZCRE_ACEE_PTR@   PTR(31),  /* Address of an ACEE address      */ 99243600
*                                                                       99263400
*    3 ZCRE_USERID@     PTR(31),  /* Address of a host user identity */ 99283200
*                                                                       99303000
*    3 ZCRE_CREDS_PTR@  PTR(31),  /* Address of a credentials           99322800
*                                    address                     @L2A*/ 99337600
*                                                                       99352500
*    3 ZCRE_IDENTITY@   PTR(31),  /* Address of identity information    99369000
*                                    from an authentication service  */ 99385500
*                                                                       99402000
*    3 ZCRE_NEW_CREDS_PTR@  PTR(31);  /* Address of a new               99421800
*                                        credential address      @L2A*/ 99436600
*                                                                       99451500
* DECLARE                                                               99461400
*  ZCRE_LENGTH FIXED(31) CONSTANT(LENGTH(ZCRE)), /* Const ZCRE length*/ 99471300
*                                                                       99481200
*/*                 Function code values                             */ 99491100
*                                                                       99501000
*  ZCRE_BUILD_CREDS    FIXED(16) CONSTANT(1), /* Build credentials   */ 99506900
*                                             /*                @L1C */ 99512800
*  ZCRE_DELETE_CREDS   FIXED(16) CONSTANT(2), /* Delete credentials  */ 99518700
*                                             /*                @L1C */ 99524600
*  ZCRE_BUILD_UNAUTH_CREDS FIXED(16) CONSTANT(3); /* Build           */ 99526100
*                                             /* unauthenticated     */ 99527600
*                                             /* credentials    @L4A */ 99529100
*                                                                       99530700
