*        %GOTO FACLPRO  ;         /* Bilingual header                   00050000
         MACRO                                                          00100000
         IRRPFACL                                                       00150000
*                                 */                                    00200000
*%FACLPRO: ;                                                            00250000
*/*** START OF SPECIFICATIONS ****************************************/ 00300000
*/*                                                                  */ 00350000
*/*   $MAC(IRRPFACL) COMP(SC1BN) PROD(SAF):                          */ 00400000
*/*                                                                  */ 00450000
*/*01* MACRO NAME: IRRPFACL                                          */ 00500000
*/*                                                                  */ 00550000
*/*                                                                  */ 00600000
*/*01* DESCRIPTIVE NAME: HFS Access Control List                     */ 00650000
*/*                                                                  */ 00700000
*/*                                                                  */ 00750000
*/*01* PROPRIETARY STATEMENT:                                        */ 00800000
*/***PROPRIETARY_STATEMENT********************************************/ 00850000
*/*                                                                  */ 00900000
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00950000
*/* THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                      */ 01000000
*/* 5694-A01 (C) COPYRIGHT IBM CORP. 2006                            */ 01050006
*/*                                                                  */ 01100000
*/* STATUS = HBB7730                                                 */ 01150006
*/*                                                                  */ 01200000
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 01250000
*/*                                                                  */ 01260000
*/*                                                                  */ 01270000
*/*01* EXTERNAL CLASSIFICATION: PI                                   */ 01280000
*/*01* END OF EXTERNAL CLASSIFICATION:                               */ 01290000
*/*                                                                  */ 01300000
*/*                                                                  */ 01350000
*/*01* FUNCTION:                                                     */ 01400000
*/*      Contains OS/390 UNIX-related access control                 */ 01450000
*/*      information for an OS/390 UNIX file.                        */ 01500000
*/*                                                                  */ 01550000
*/*                                                                  */ 01600000
*/*01* METHOD OF ACCESS:                                             */ 01650000
*/*      - %INCLUDE SYSLIB(IRRPFACL) for PL/X                        */ 01700000
*/*                                                                  */ 01750000
*/*      - If %FACLBASE is not set, OR, %FACLBASE = 'YES'            */ 01800000
*/*        FACL_PTR will be declared as PTR(31) and the              */ 01850000
*/*        FACL will be based on it.                                 */ 01900000
*/*      - If you want a different pointer used, you can             */ 01950000
*/*        EITHER:                                                   */ 02000000
*/*        - Set %FACLBASE = 'NO'                                    */ 02050000
*/*          then FACL_PTR will not be declared,                     */ 02100000
*/*          the FACL will be declared as FACL BASED,                */ 02150000
*/*          and then you can Respecify the FACL base:               */ 02200000
*/*          - RFY FACL BASED 'someptr'                              */ 02250000
*/*        OR:                                                       */ 02300000
*/*        - Declare 'yourptr' and specify                           */ 02350000
*/*          %FACLBASE = 'BASED(yourptr)'                            */ 02400000
*/*          then FACL_PTR will not be declared,                     */ 02450000
*/*          the FACL will be declared as:                           */ 02500000
*/*           - FACL BASED 'yourptr'                                 */ 02550000
*/*                                                                  */ 02600000
*/*      - For VIA support, specify %FACLVIA = 'YES'                 */ 02650000
*/*        The ALET FACL_ALET will be declared as FIXED(32)          */ 02700000
*/*                                                                  */ 02750000
*/*      - If either %FACLVIA or %FACLBASE are specified, they       */ 02800000
*/*        must be specified prior to the %INCLUDE for IRRPFACL.     */ 02850000
*/*                                                                  */ 02900000
*/*      - Issue the IRRPFACL macro for BAL                          */ 02950000
*/*                                                                  */ 03000000
*/*                                                                  */ 03050000
*/*01* NOTES:                                                        */ 03100000
*/*    - Created By:                                                 */ 03150000
*/*      - R_SetFacl and Make_FSP Callable Services                  */ 03200000
*/*                                                                  */ 03250000
*/*                                                                  */ 03300000
*/*01* CHANGE ACTIVITY:                                              */ 03350000
*/*      $L0=HFSACL   HBB7706 001214 PDGTM1: HFS ACLs Support        */ 03400000
*/*      $L1=HFSACL   HBB7706 010115 PDGTM1: HFS ACLs Support    @L1A*/ 03425000
*/*      $L2=HFSACL   HBB7706 010228 PDGTM1: HFS ACLs Support    @L2A*/ 03437500
*/*      $P1=PYM0280  HBB7706 010628 PDGTM1: HFS ACLs Support    @P1A*/ 03441600
*/*      $01=OW53379  HBB7706 020222 PDR_B1: APAR OW53379        @01A*/ 03443600
*/*      $P2=MG05219  HBB7730 051108 PDAWS1: Defect MG05219      @P2A*/ 03443707
*/*                                                                  */ 03445700
*/*                                                                  */ 03450000
*/*                                                                  */ 03500000
*/*01* CHANGE DESCRIPTIONS:                                          */ 03550000
*/*      A 000000-999999                                             */ 03600000
*/*      A - Support for HFS ACLs                                    */ 03650000
*/*          (Hierarchical File System Access Control Lists)         */ 03680000
*/*      A - Support for HFS ACLs                                    */ 03710000
*/*          (Hierarchical File System Access Control Lists)         */ 03717300
*/*          - Added a structure definition for the FACL_Edit    @L1A*/ 03724600
*/*      A - Support for HFS ACLs                                    */ 03732000
*/*          (Hierarchical File System Access Control Lists)         */ 03734000
*/*          - Added the RACF Return and Reason Code fields          */ 03736000
*/*            to the Update ACL Header                          @L2A*/ 03738000
*/*      A - Support for UNIX File System ACLs                       */ 03738200
*/*          - Support for PTM # PYM0280                             */ 03738400
*/*            Remove all references to the File Id                  */ 03738600
*/*            (make the fields with the name File Id                */ 03738800
*/*             "reserved").                                     @P1A*/ 03739000
*/*      C - Fix assembler syntax errors                         @01A*/ 03739500
*/*      C - Add assembler mapping for FACL_EDIT structure       @P2A*/ 03739600
*/*                                                                  */ 03740000
*/*                                                                  */ 03750000
*/*** END OF SPECIFICATIONS ******************************************/ 03800000
*/*                                                                  */ 03850000
*                                                               @EJECT; 03900000
*        %GOTO FACLPLS  ;         /* Bilingual header                   03950000
FACL     DSECT ,                  IRRPFACL                              04000000
         DS    0F                                                       04050000
*                                                                       04100000
FACL_Min_Header      DS 0C        Minimum header required by            04112500
*                                 the LFS/PFS for an                    04125000
*                                 ACL read request               @L2A   04137500
FACL_Id              DS CL4       Literal ID 'FACL'                     04150000
FACL_Len             DS AL4       Total length of structure             04200000
FACL_Num_Entry       DS AL2       Number of ACL entries                 04250000
FACL_Len_Entry       DS AL2       Length of an ACL entry                04300000
                     DS CL16      Reserved                       @P1C   04350000
FACL_Vers            DS XL1       Version Number for ACL                04400000
FACL_Flag            DS B         ACL flags                             04450000
FACL_Num_Users       DS AL2       Number of user entries                04500000
FACL_ErrOff          DS AL2       Offset(from start of structure) to    04550000
*                                 ACL entry in error                    04600000
                     DS CL2       Reserved                       @L2A   04614200
FACL_RACF_Return_Code DS AL4      RACF Return Code               @01C   04637800
FACL_RACF_Reason_Code DS AL4      RACF Reason Code               @01C   04661400
                     DS CL20      Reserved                       @L2C   04685200
FACL_Header_Extension DS 0C       Reserved                       @01C   04692600
FACL_Entries          DS 0C       Start of entries               @P2A   04692704
*                                                                       04700000
FACL_Length          EQU *-FACL                                         04750000
*                                                                       04800000
*  Equates for FACL_Id                                                  04850000
FACL_IDC             EQU C'FACL'  Control Block Acronym                 04900000
*  Equates for FACL_Vers                                                04950000
FACL_CV01            EQU 1        Version 1 of ACL                      05000000
FACL_CVER            EQU 1        Current Version of ACL                05050000
*  Equates for FACL_Flag                                                05100000
FACL_Access          EQU X'80'    ACL is an access ACL                  05150000
FACL_File_Model      EQU X'40'    ACL is a file model ACL               05200000
FACL_Dir_Model       EQU X'20'    ACL is a directory model ACL          05250000
*                                                                       05300000
FACL_Edit            DSECT        Mapping for an ACL Entry       @P2A   05301000
FACL_Edit_Min_Header DS 0C        Minimum header required by            05302000
*                                 the LFS/PFS for an                    05303000
*                                 ACL read request               @P2A   05304000
FACL_Edit_Hdr_Id     DS CL4       Literal Id 'FACL'              @P2A   05342000
FACL_Edit_Len        DS AL4       Total length of structure             05343000
*                                   (header plus all entries)    @P2A   05344000
FACL_Edit_Num_Entry  DS AL2       Number of ACL entries          @P2A   05346000
FACL_Edit_Len_Entry  DS AL2       Length of an ACL entry         @P2A   05348000
                     DS CL16      Reserved                       @P2A   05349100
FACL_Edit_Vers       DS XL1       Version Number for ACL         @P2A   05349200
FACL_Edit_Flag       DS B         ACL flags                      @P2A   05349400
FACL_Edit_Num_Users  DS AL2       Number of user entries         @P2A   05349500
FACL_Edit_ErrOff     DS AL2       Offset (from start of structure)      05349702
*                                 to ACL entry in error          @P2A   05349800
                     DS CL2       Reserved                       @P2A   05350000
FACL_Edit_RACF_Return_Code  DS AL4   RACF Return Code            @P2A   05350100
FACL_Edit_RACF_Reason_Code  DS AL4   RACF Reason Code            @P2A   05350300
                     DS CL20      Reserved                       @P2A   05350500
FACL_Edit_Header_Extension  DS 0C Reserved                       @P2A   05350600
FACL_Edit_Entries    DS 0C        Start of entries               @P2A   05350801
*  Equates for FACL_Edit_Flag                                           05350900
FACL_Edit_Access     EQU X'80'    ACL is an access ACL           @P2A   05351000
FACL_Edit_File_Model EQU X'40'    ACL is a file model ACL        @P2A   05351100
FACL_Edit_Dir_Model  EQU X'20'    ACL is a directory model ACL   @P2A   05351200
*                                                                       05359500
FACL_Entry           DSECT        Mapping for an ACL entry       @01C   05360000
                     DS  CL2      Reserved                              05400000
FACL_Entry_Perms     DS  0XL1     Permissions granted byte              05450000
FACL_Perm_Bits       DS  XL1      Permission bits                       05500000
FACL_Sort_Key        DS  0CL5     Key for Sorting ACL                   05550000
FACL_Entry_Type      DS  XL1      Type of ACL entry (user or group)     05600000
FACL_Entry_Id        DS  AL4      UID/GID value                         05650000
FACL_Entry_End       DS  0C                                      @P2A   05660005
*                                                                       05700000
FACL_Entry_Length    EQU *-FACL_Entry                                   05750000
*                                                                       05800000
FACL_Edit_Entry      DSECT        Mapping for an ACL entry       @01C   05850000
FACL_Edit_Options    DS  XL1      ACL entry options                     05900000
FACL_Perms_Mask      DS  0XL1     Relevant Permissions                  05950000
FACL_Perm_Bits_Mask  DS  XL1      Permission bits mask                  06000000
FACL_Edit_Perms      DS  0XL1     Relative Permissions                  06050000
FACL_Edit_Perm_Bits  DS  XL1      Permission bits                       06100000
FACL_Edit_Type       DS  XL1      Type of ACL entry (user or group)     06150000
FACL_Edit_Id         DS  AL4      UID/GID value                         06200000
FACL_Edit_End        DS  0C                                      @P2A   06210005
*                                                                       06250000
*  Equates for FACL_Entry_Type                                          06300000
FACL_Entry_UID       EQU X'01'    User entry                            06350000
FACL_Entry_GID       EQU X'02'    Group entry                           06400000
FACL_Entry_Del       EQU X'80'    For modify: delete this ACL entry     06450000
*  Equates for FACL_Perm_Bits                                           06500000
FACL_Read            EQU X'04'    Read access                           06550000
FACL_Write           EQU X'02'    Write access                          06600000
FACL_Execute         EQU X'01'    Execute access                        06650000
*  Equates for FACL_Edit_Perm_Bits                                      06700000
FACL_Edit_Read       EQU X'04'    Read access                           06750000
FACL_Edit_Write      EQU X'02'    Write access                          06800000
FACL_Edit_Execute    EQU X'01'    Execute access                        06850000
*  Equates for FACL_Perm_Bits_Mask                                      06900000
FACL_Read_Mask       EQU X'04'    Read access                           06950000
FACL_Write_Mask      EQU X'02'    Write access                          07000000
FACL_Execute_Mask    EQU X'01'    Execute access                        07050000
*  Equates for FACL_Edit_Options                                        07100000
FACL_Del_Entry       EQU X'80'    For modify: delete entry              07150000
*  Various constants                                                    07200000
FACL_Max_Entries     EQU 1024                                           07250000
FACL_Max_ACL_Size    DC                                                +07300000
                 AL4(FACL_Length+(FACL_Entry_Length*FACL_Max_Entries))  07350000
         MEND                                                           07400000
  Terminating PL/X comment                                          */  07450000
 %FACLPLS: ;                                                            07500000
                                                                        07550000
 %IF (FACLBASE = 'YES') !                                               07600000
     (FACLBASE = '') %THEN                                              07650000
   %DO;                                                                 07700000
     %FACLBASE = 'BASED(FACL_PTR)';                                     07750000
     %FACLEDITBASE = 'BASED(FACL_EDIT_PTR)';                 /*  @L1C*/ 07787500
     %FACLENTRYBASE = 'BASED(FACL_ENTRY_PTR)';               /*  @L1C*/ 07825000
     %FACLEDITENTRYBASE = 'BASED(FACL_EDIT_ENTRY_PTR)';      /*  @L1A*/ 07862500
      DCL FACL_PTR             PTR(31); /* Pointer to the ACL        */ 07900000
      DCL FACL_EDIT_PTR        PTR(31); /* Pointer to the Edit ACL      07916600
                                                                 @L1A*/ 07933200
      DCL FACL_ENTRY_PTR       PTR(31); /* Pointer to the ACL Entry  */ 07950000
      DCL FACL_EDIT_ENTRY_PTR  PTR(31); /* Pointer to the Edit          08000000
                                                      ACL Entry      */ 08050000
   %END;                                                                08100000
 %ELSE                                                                  08150000
   %DO;                                                                 08200000
     %FACLBASE = 'BASED';                                               08250000
     %FACLEDITBASE = 'BASED';                                /*  @L1C*/ 08287500
     %FACLENTRYBASE = 'BASED';                               /*  @L1C*/ 08325000
     %FACLEDITENTRYBASE = 'BASED';                           /*  @L1A*/ 08362500
   %END;                                                                08400000
                                                                        08450000
 %IF (FACLVIA = 'YES') %THEN                                            08500000
    %DO;                                                                08550000
      %FACLALET = 'VIA(FACL_ALET)';                                     08600000
      %FACLEDITALET = 'VIA(FACL_EDIT_ALET)';                            08650000
       DCL FACL_ALET      FIXED(32); /* ALET to the  ACL             */ 08700000
       DCL FACL_EDIT_ALET FIXED(32)                                     08750000
             BASED(RACL_EDIT_ALET@); /* ALET to the Edit ACL         */ 08800000
    %END;                                                               08850000
 %ELSE                                                                  08900000
    %DO;                                                                08950000
      %FACLALET = '';                                                   09000000
      %FACLEDITALET = '';                                               09050000
    %END;                                                               09100000
                                                                        09150000
 /********************************************************************/ 09200000
 /* Mapping for the ACL header                                       */ 09250000
 /********************************************************************/ 09300000
                                                                        09350000
 DCL 1 FACL  FACLBASE  FACLALET  BDY(WORD),                             09400000
      2 FACL_Min_Header,                  /* Minimum header required    09404800
                                             by the LFS/PFS for an      09409600
                                             ACL read request    @L2A*/ 09414400
       3 FACL_Id               CHAR(4),   /* Literal Id 'FACL'       */ 09419300
       3 FACL_Len              FIXED(32), /* Total length of structure  09438600
                                             (header plus all entries)  09457900
                                                                     */ 09477200
       3 FACL_Num_Entry        FIXED(16), /* Number of ACL entries   */ 09496500
       3 FACL_Len_Entry        FIXED(16), /* Length of an ACL entry  */ 09515800
       3 *                     CHAR(16),  /* Reserved            @P1C*/ 09544700
       3 FACL_Vers             FIXED(8),  /* Version Number for ACL  */ 09573700
       3 FACL_Flag             BIT(8),    /* ACL flags               */ 09593000
         5 FACL_Access           BIT(1),  /* Access ACL              */ 09612300
         5 FACL_File_Model       BIT(1),  /* File model ACL          */ 09631600
         5 FACL_Dir_Model        BIT(1),  /* Directory Model ACL     */ 09650900
         5 *                     BIT(5),  /* Reserved                */ 09670200
       3 FACL_Num_Users        FIXED(16), /* Number of user entries  */ 09689500
       3 FACL_ErrOff           FIXED(16), /* Offset (from start of      09708800
                                             structure) to ACL entry    09728100
                                             in error                */ 09747400
       3 *                     CHAR(2),   /* Reserved            @L2A*/ 09752900
       3 FACL_RACF_Return_Code                                          09758400
                               FIXED(32), /* RACF Return Code    @L2A*/ 09763900
       3 FACL_RACF_Reason_Code                                          09769400
                               FIXED(32), /* RACF Reason Code    @L2A*/ 09774900
       3 *                     CHAR(20),  /* Reserved            @L2C*/ 09780400
      2 FACL_Header_Extension  CHAR(0),   /* Reserved            @L2A*/ 09788700
      2 FACL_Entries           CHAR(0);   /* Start of entries    @L2C*/ 09797000
                                                                        09805300
 DCL 1 FACL_Edit  FACLEDITBASE  FACLEDITALET  BDY(WORD)                 09824600
                             CHAR(FACL_Length),              /*  @L1A*/ 09843900
      2 FACL_Edit_Min_Header,             /* Minimum header required    09848700
                                             by the LFS/PFS for an      09853500
                                             ACL read request    @L2A*/ 09858300
       3 FACL_Edit_Hdr_Id      CHAR(4),   /* Literal Id 'FACL'   @L1A*/ 09863200
       3 FACL_Edit_Len         FIXED(32), /* Total length of structure  09882500
                                             (header plus all entries)  09901800
                                                                 @L1A*/ 09921100
       3 FACL_Edit_Num_Entry   FIXED(16), /* Number of ACL entries      09940400
                                                                 @L1A*/ 09959700
       3 FACL_Edit_Len_Entry   FIXED(16), /* Length of an ACL entry     09979000
                                                                 @L1A*/ 09998300
       3 *                     CHAR(16),  /* Reserved            @P1C*/ 10027200
       3 FACL_Edit_Vers        FIXED(8),  /* Version Number for ACL     10056200
                                                                 @L1A*/ 10075500
       3 FACL_Edit_Flag        BIT(8),    /* ACL flags           @L1A*/ 10094800
         5 FACL_Edit_Access      BIT(1),  /* Access ACL          @L1A*/ 10114100
         5 FACL_Edit_File_Model  BIT(1),  /* File model ACL      @L1A*/ 10133400
         5 FACL_Edit_Dir_Model   BIT(1),  /* Directory Model ACL        10152700
                                                                 @L1A*/ 10172000
         5 *                     BIT(5),  /* Reserved            @L1A*/ 10191300
       3 FACL_Edit_Num_Users   FIXED(16), /* Number of user entries     10210600
                                                                 @L1A*/ 10229900
       3 FACL_Edit_ErrOff      FIXED(16), /* Offset (from start of      10249200
                                             structure) to ACL entry    10268500
                                             in error            @L1A*/ 10287800
       3 *                     CHAR(2),   /* Reserved            @L2A*/ 10293300
       3 FACL_Edit_RACF_Return_Code                                     10298800
                               FIXED(32), /* RACF Return Code    @L2A*/ 10304300
       3 FACL_Edit_RACF_Reason_Code                                     10309800
                               FIXED(32), /* RACF Reason Code    @L2A*/ 10315300
       3 *                     CHAR(20),  /* Reserved            @L2C*/ 10320800
      2 FACL_Edit_Header_Extension                                      10328100
                               CHAR(0),   /* Reserved            @L2A*/ 10335400
      2 FACL_Edit_Entries      CHAR(0);   /* Start of entries    @L2C*/ 10342700
                                                                        10350000
 DCL FACL_Length           FIXED(32)  CONSTANT(LENGTH(FACL));           10400000
                                                                        10450000
 /********************************************************************/ 10500000
 /* Constants                                                        */ 10550000
 /********************************************************************/ 10600000
                                                                        10650000
 DCL                                                                    10700000
  FACL_IDC   CHAR(4)     CONSTANT('FACL'), /* ACL ID Constant        */ 10750000
  FACL_CV01  FIXED(8)    CONSTANT(01),     /* Version 1 of ACL       */ 10800000
  FACL_CVER  FIXED(8)    CONSTANT(01);     /* Current version of ACL */ 10850000
                                                                        10900000
 DCL FACL_Max_Entries    FIXED(32)  CONSTANT(1024);                     10950000
                                                                        11000000
 /********************************************************************/ 11050000
 /* Mapping for an individual ACL entry                              */ 11100000
 /********************************************************************/ 11150000
                                                                        11200000
 DCL 1 FACL_Entry  FACLENTRYBASE  FACLALET  BDY(WORD),                  11250000
       3 *                    CHAR(2),     /* Reserved               */ 11300000
       3 FACL_Entry_Perms     BIT(8),      /* Permissions granted byte  11350000
                                                                     */ 11400000
         5 *                    BIT(5),    /* Reserved               */ 11450000
         5 FACL_Perm_Bits       BIT(3),    /* Permission bits        */ 11500000
           7 FACL_Read            BIT(1),  /* Read access            */ 11550000
           7 FACL_Write           BIT(1),  /* Write access           */ 11600000
           7 FACL_Execute         BIT(1),  /* Execute access         */ 11650000
       3 FACL_Sort_Key       BDY(WORD,4),  /* Key for Sorting ACL    */ 11700000
         5 FACL_Entry_Type      FIXED(8)   BDY(WORD,4), /* Type of ACL  11750000
                                                           entry     */ 11800000
         5 FACL_Entry_Id        FIXED(31)  BDY(WORD,1), /* UID/GID      11850000
                                                           value     */ 11900000
       3 FACL_Entry_End       CHAR(0);                                  11950000
                                                                        12000000
 DCL FACL_Entry_Length     FIXED(32)  CONSTANT(LENGTH(FACL_Entry));     12050000
                                                                        12100000
 DCL 1 FACL_Edit_Entry  FACLEDITENTRYBASE  FACLEDITALET  BDY(WORD)      12150000
                            CHAR(FACL_Entry_Length),                    12200000
       3 FACL_Edit_Options    BIT(8),      /* ACL entry options      */ 12250000
         5 FACL_Del_Entry       BIT(1),    /* For modify: delete entry  12300000
                                                                     */ 12350000
         5 *                    BIT(7),    /* Reserved               */ 12400000
       3 FACL_Perms_Mask      BIT(8),      /* Relevant Permissions   */ 12450000
         5 *                    BIT(5),    /* Reserved               */ 12500000
         5 FACL_Perm_Bits_Mask  BIT(3),    /* Permission bits mask   */ 12550000
           7 FACL_Read_Mask       BIT(1),  /* Read access mask       */ 12600000
           7 FACL_Write_Mask      BIT(1),  /* Write access mask      */ 12650000
           7 FACL_Execute_Mask    BIT(1),  /* Execute access mask    */ 12700000
       3 FACL_Edit_Perms      BIT(8),      /* Relative Permissions   */ 12750000
         5 *                    BIT(5),    /* Reserved               */ 12800000
         5 FACL_Edit_Perm_Bits  BIT(3),    /* Permission bits        */ 12850000
           7 FACL_Edit_Read       BIT(1),  /* Read access            */ 12900000
           7 FACL_Edit_Write      BIT(1),  /* Write access           */ 12950000
           7 FACL_Edit_Execute    BIT(1),  /* Execute access         */ 13000000
       3 FACL_Edit_Type       FIXED(8)   BDY(WORD,4), /* Type of ACL    13050000
                                                         entry       */ 13100000
       3 FACL_Edit_Id         FIXED(31)  BDY(WORD,1), /* UID/GID        13150000
                                                         value       */ 13200000
       3 FACL_Edit_End        CHAR(0);                                  13250000
                                                                        13300000
 /********************************************************************/ 13350000
 /* Values for FACL_Entry_Type                                       */ 13400000
 /********************************************************************/ 13450000
                                                                        13500000
 DCL                                                                    13550000
  FACL_Entry_UID  FIXED(8) CONSTANT('01'X), /* User entry            */ 13600000
  FACL_Entry_GID  FIXED(8) CONSTANT('02'X), /* Group entry           */ 13650003
  FACL_Entry_Del  FIXED(8) CONSTANT('80'X); /* For modify: delete this  13660003
                                               ACL entry         @P2A*/ 13661003
                                                                        13700000
 /********************************************************************/ 13750000
 /* Constants                                                        */ 13800000
 /********************************************************************/ 13850000
                                                                        13900000
 DCL FACL_Max_ACL_Size   FIXED(32)                                      13950000
       CONSTANT(FACL_Length + (FACL_Max_Entries * FACL_Entry_Length));  14000000
                                                                        14050000
