*/*                                                                  */         
*/********************************************************************/         
*/*                                                                  */         
*/*   $MAC(IRRPRCVI) COMP(SC1BN) PROD(RACF):                         */         
*/*                                                                  */         
*/*01* PROPRIETARY STATEMENT=                                        */         
*/***PROPRIETARY_STATEMENT********************************************/         
*/*                                                                  */         
*/*                                                                  */         
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */         
*/* THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                      */         
*/* 5694-A01 (C) COPYRIGHT IBM CORP. 2006                            */         
*/*                                                                  */         
*/* STATUS= HBB7730                                                  */         
*/*                                                                  */         
*/***END_OF_PROPRIETARY_STATEMENT*************************************/         
*/*                                                                  */         
*/*01* EXTERNAL CLASSIFICATION: PI                                   */         
*/*01* END OF EXTERNAL CLASSIFICATION:                               */         
*/*                                                                  */         
*/*   DESCRIPTIVE NAME = RACF RCVI                                   */         
*/*                                                                  */         
*/*   FUNCTION = THIS PROVIDES AN IN STORAGE COMMUNICATION AREA FOR  */         
*/*              IDENTITY CACHE DYNAMIC CONFIGURATION INFORMATION    */         
*/*                                                                  */         
*/*   NOTES = It is recommended that readers of the RCVI will:       */         
*/*     1) check that RCVTRCVI ¢= 0                                  */         
*/*     2) read the active table pointer and build count with a CDS  */         
*/*     3) read the desired portion of, or the entire, active table  */         
*/*     4) check the build count, if it has changed, goto step 2.    */         
*/*                                                                  */         
*/*     It should be  noted that RCVILREG, RCVILDPH,  RCVIAPPL, and  */         
*/*     RCVIBDDN are  null terminated.   The  fields are  defined 1  */         
*/*     longer than the valid maximum  valid field length, allowing  */         
*/*     a returned  field to be  followed by  byte of X'00'  in all  */         
*/*     cases.                                                       */         
*/*                                                                  */         
*/*   CONTROL BLOCK STRUCTURE = THIS COMMUNICATION AREA IS BASED     */         
*/*                             ON 'RCVTRCVI' IN THE RCVT            */         
*/*                                                                  */         
*/*   CREATED BY = IRRRCH26, during RACF initialization              */         
*/*                                                                  */         
*/*   CHANGE ACTIVITY :                                              */         
*/*     $L0=SAFID   HBB7730  050705 PDISR1: Feature: ME04073     @L0A*/         
*/*     $L1=SAFID   HBB7730  050908 PDISR1: Defect:  ME04392     @L1A*/         
*/*                                                                  */         
*/*                                                                  */         
*/*   CHANGE DESCRIPTIONS:                                           */         
*/*     A - create table                                         @L0A*/         
*/*     A - Increase header size by 4, so that entire structure  @L1A*/         
*/*         will be divisible by 8.  Since storage is really     @L1A*/         
*/*         handed out in doublewords, we might as well lay      @L1A*/         
*/*         to all the storage we actually get.                  @L1A*/         
*/*                                                                  */         
*/********************************************************************/         
*/*                                                                  */         
*        %GOTO RCVIPLS  ;   /*  BILINGUAL HEADER                                
         MACRO                                                                  
         IRRPRCVI                                                               
RCVI     DSECT     ,RCVTRCVI                                                    
RCVIHDR  DS    0D                    double-word alignment                      
RCVIID   DS    CL8                   EBCDIC ID                                  
RCVIID1A EQU   C'RACF'               MAIN RCVI EYECATCHER 1ST 4 BYTES           
RCVIID1B EQU   C'RCVI'               MAIN RCVI EYECATCHER 2ND 4 BYTES           
RCVIACHK DS    0F                    RCVI ACTIVE CHK FLDS, FOR CDS              
RCVIBCNT DS    F                     RCVI BUILD COUNT                           
RCVIACTV DS    A                     PTR OF ACTIVE TABLE                        
RCVIPTR1 DS    A                     PTR TO TABLE 1                             
RCVIPTR2 DS    A                     PTR TO TABLE 2                             
RCVIVERN DS    F                     VERSION NUMBER VALUE:                      
RCVIV1   EQU   X'00000001'           RCVI VERSION NUMBER                        
         DS    9A                    RESERVED                      @L1C         
RCVISID1 DS    CL(RCVISL)            TABLE 1                                    
RCVISID2 DS    CL(RCVISL)            TABLE 2                                    
RCVIL    EQU   *-RCVI                RCVI length                                
RCVISAFI DSECT     ,RCVIACTV                                                    
         DS    0F                    SAFID INFO                                 
RCVISEYE DS    CL8                   SAFID EYECATCHER                           
RCVIIDC  EQU   C'RCVI'               RCVISID1/2 EYECATCHER 1st 4 bytes          
RCVIIDC1 EQU   C'SID1'               RCVISID1 EYECATCHER 2nd 4 bytes            
RCVIIDC2 EQU   C'SID2'               RCVISID2 EYECATCHER 2nd 4 bytes            
RCVISYSI DS    CL4                   sysid if from .sysid profile               
RCVIUMAP DS    AL1                   USEMAP                                     
RCVIDMAP DS    AL1                   DOMAP                                      
RCVIMRQD DS    AL1                   MAPREQUIRED                                
         DS    AL1                   alignment                                  
RCVIMTO  DS    AL2                   MAPPINGTIMEOUT                             
         DS    AL2                   alignment                                  
RCVILRLN DS    F                     LOCALREGISTRY LENGTH                       
RCVILREG DS    CL256                 LOCALREGISTRY                              
RCVILDLN DS    F                     LDAPHOST LENGTH                            
RCVILDPH DS    CL1025                LDAPHOST                                   
         DS    AL3                   alignment                                  
RCVIAPLN DS    F                     APPLDATA LENGTH                            
RCVIAPPL DS    CL1025                APPLDATA                                   
         DS    AL3                   alignment                                  
RCVIBDLN DS    F                     BINDDN LENGTH                              
RCVIBDDN DS    CL1025                BINDDN                                     
         DS    AL3                   alignment                                  
         DS    8A                    reserved words                             
RCVISL   EQU   *-RCVISAFI            SAFID INFO LENGTH                          
         MEND                                                                   
* TERMINATE PLS COMMENT                                              */         
*        %RCVIPLS : ;                                                           
 DCL                                                                            
  1 RCVI  BDY(DWORD)   BASED(RCVTRCVI),      /* LOCATED THROUGH RCVT */         
   2 RCVIHDR,                                                                   
     3 RCVIID    CHAR(8),         /* EBCDIC ID "RACFRCVI"            */         
     3 RCVIACHK,                  /* RCVI active check fields        */         
       4 RCVIBCNT  FIXED(32),     /* RCVI BUILD COUNT                */         
       4 RCVIACTV  PTR(31),       /* PTR OF ACTIVE TABLE             */         
     3 RCVIPTR1  PTR(31),         /* PTR TO TABLE 1                  */         
     3 RCVIPTR2  PTR(31),         /* PTR TO TABLE 2                  */         
     3 RCVIVERN  FIXED(32),       /* RCVI VERSION NUMBER             */         
     3 * (9)     PTR(31),         /* reserved words              @L1C*/         
   2 RCVISID1  CHAR(LENGTH(RCVISAFI)), /* TABLE 1                    */         
   2 RCVISID2  CHAR(LENGTH(RCVISAFI)); /* TABLE 2                    */         
                                                                                
 DCL                                                                            
 /********************************************************************/         
 /* The RCVI consists of 2 of the following blocks.  One of which    */         
 /* will be active (pointed to be RCVIACTV), the other fallow.       */         
 /********************************************************************/         
  1 RCVISAFI BASED(RCVIACTV),     /* LOCATED THROUGH RCVI            */         
   2 RCVISEYE CHAR(8),            /* Safid eyecatcher                */         
   2 RCVISYSI CHAR(4),            /* sysid if from .sysid profile    */         
   2 RCVIUMAP FIXED(8),           /* USEMAP                          */         
   2 RCVIDMAP FIXED(8),           /* DOMAP                           */         
   2 RCVIMRQD FIXED(8),           /* MAPREQUIRED                     */         
   2 *        FIXED(8),           /* alignment                       */         
   2 RCVIMTO  FIXED(16),          /* MAPPINGTIMEOUT                  */         
   2 *        FIXED(16),          /* alignment                       */         
   2 RCVILRLN FIXED(32),          /* LOCALREGISTRY length            */         
   2 RCVILREG CHAR(256),          /* LOCALREGISTRY                   */         
   2 RCVILDLN FIXED(32),          /* LDAPHOST length                 */         
   2 RCVILDPH CHAR(1025),         /* LDAPHOST                        */         
   2 *        FIXED(24),          /* alignment                       */         
   2 RCVIAPLN FIXED(32),          /* APPLDATA length                 */         
   2 RCVIAPPL CHAR(1025),         /* APPLDATA                        */         
   2 *        FIXED(24),          /* alignment                       */         
   2 RCVIBDLN FIXED(32),          /* BINDDN length                   */         
   2 RCVIBDDN CHAR(1025),         /* BINDDN                          */         
   2 *        FIXED(24),          /* alignment                       */         
   2 * (8)    PTR(31);            /* reserved words                  */         
                                                                                
 DCL                                                                            
   RCVIV1   CONSTANT(1) FIXED(32),/* VERSION NUMBER                  */         
   RCVIIDC  CHAR(8)               /* EBCDIC RCVI ID, FOR THE         */         
            CONSTANT('RACFRCVI'), /* RCVI CONTROL BLOCK              */         
   RCVIIDC1 CHAR(8)               /* EBCDIC RCVI ID, FOR THE         */         
            CONSTANT('RCVISID1'), /* RCVISID1 CONTROL BLOCK          */         
   RCVIIDC2 CHAR(8)               /* EBCDIC RCVI ID, FOR THE         */         
            CONSTANT('RCVISID2'); /* RCVISID2 CONTROL BLOCK          */         
                                                                                
