*/*                                                                  */ 00010000
*/********************************************************************/ 00020000
*/*                                                                  */ 00030000
*/*   $MAC(IRRPIDID) COMP(SC1BN) PROD(RACF):                         */ 00040000
*/*                                                                  */ 00050000
*/*01* PROPRIETARY STATEMENT=                                        */ 00060000
*/***PROPRIETARY_STATEMENT********************************************/ 00070000
*/*                                                                  */ 00080000
*/*                                                                  */ 00090000
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00100000
*/* 5694-A01 COPYRIGHT IBM CORP. 2009, 2011                          */ 00110001
*/*                                                                  */ 00120000
*/* STATUS= HBB7780                                                  */ 00130001
*/*                                                                  */ 00140000
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 00150000
*/*                                                                  */ 00160000
*/*01* EXTERNAL CLASSIFICATION: PI                                   */ 00170000
*/*01* END OF EXTERNAL CLASSIFICATION:                               */ 00180000
*/*                                                                  */ 00190000
*/*   DESCRIPTIVE NAME = Distributed identity data (IDID)            */ 00200000
*/*                                                                  */ 00210000
*/*   FUNCTION = Contains distributed identity data about the user   */ 00220000
*/*                                                                  */ 00230000
*/*   CREATED BY = RACROUTE REQUEST=VERIFY or caller of              */ 00240000
*/*              RACROUTE REQUEST=VERIFY                             */ 00250000
*/*                                                                  */ 00260000
*/*   Eye-Catcher-ID: IDID                                           */ 00270000
*/*                                                                  */ 00280000
*/*   Storage Attributes: determined by caller, or same as ACEE      */ 00290000
*/*              when anchored in ACEE                               */ 00300000
*/*                                                                  */ 00310000
*/*   Pointed to by:  ACEEIDID                                       */ 00320000
*/*                                                                  */ 00330000
*/*   Serialization:  None                                           */ 00340000
*/*                                                                  */ 00350000
*/*   Method of ACCESS= %INCLUDE SYSLIB(IRRPIDID) for PLX            */ 00360000
*/*                     just IRRPIDID for BAL                        */ 00370000
*/*   Further, for PLX:                                              */ 00380000
*/*     If other than BASED(ACEEIDID) is wanted, put the desired     */ 00390000
*/*   expression in IDIDBASE, for example:                           */ 00400000
*/*   %IDIDBASE='BASED(MYPTR)'                                       */ 00410000
*/*                                                                  */ 00420000
*/*     For VIA support, specify %IHAVIA = 'YES' before the %INCLUDE */ 00430000
*/*   and the IDID will be declared VIA(ACEE_ALET). Since the IDID   */ 00440000
*/*   is pointed to by the ACEE when it is anchored, it will be      */ 00450000
*/*   addressed by the same alet as the ACEE.                        */ 00460000
*/*                                                                  */ 00470000
*/*   CHANGE ACTIVITY :                                              */ 00480000
*/*   $L0=IDPROP  HBB7760 080429 PDDFM1: IDPROP Support          @L0A*/ 00490001
*/*   $P1=ME15036 HBB7760 081118 PDGTM1: IDPROP Support          @P1A*/ 00500001
*/*   $P2=ME15365 HBB7760 090114 PDJCL1: IDPROP Support          @P2A*/ 00510001
*/*   $P3=ME15548 HBB7760 090317 PDJLW1: IPLAW fix.              @P3A*/ 00520001
*/*   $L1=IDPROP2 HBB7780 100618 PDGTM1: IDPROP, Part 2          @L1A*/ 00530001
*/*                                                                  */ 00540000
*/*                                                                  */ 00550000
*/*   CHANGE DESCRIPTIONS:                                           */ 00560000
*/*   A000000-999999 Original Code                               @L0A*/ 00570000
*/*   A - Support for z/OS Identity Propagation                      */ 00580001
*/*       - Modify the ASSEMBLER version of the Registry Name        */ 00590001
*/*         variables to match those in the PLX version and in       */ 00600001
*/*         the FSP                                              @P1A*/ 00610001
*/*   A   - Add new IDID1NMF (UserDN Name Format) field          @P2A*/ 00620001
*/*   C   - Fixing the prolog.                                   @P3A*/ 00630001
*/*   C   - Correct comments                                     @L1A*/ 00640001
*/*                                                                  */ 00650001
*/*                                                                  */ 00660001
*/********************************************************************/ 00670000
*/*                                                                  */ 00680000
*        %GOTO IDIDPLX  ;          /* BILINGUAL HEADER                  00690000
         MACRO                                                          00700000
         IRRPIDID                                                       00710000
IDID     DSECT                       Distributed Identity Data          00720000
IDIDID   DS    CL4                   Literal id 'IDID'                  00730000
IDIDVERS DS    XL1                   Version number                     00740001
IDIDVR01 EQU   X'01'                 Version 1 of IDID                  00750000
IDIDCURV EQU   X'01'                 Current Version                    00760000
IDIDOFFN DS    XL1                   Number of offsets -                00770002
*                                    5 for version 1             @L1A   00780003
IDIDHSHN DS    BL1                   Sections to include in the         00790000
*                                    hash for local cache comparison    00800000
IDIDCURH EQU   X'03'                 Sections 1 and 2 for -             00810003
*                                    version 1                   @L1A   00820003
IDIDSP   DS    XL1                   Subpool - required when passed as  00830000
*                                    IDID= parameter, else optional     00840000
IDIDLEN  DS    XL4                   Total length of IDID               00850000
IDIDOFF1 DS    XL4                   Offset to section 1 (IDIDSEC1) or  00860000
*                                    zero if omitted                    00870000
IDIDOFF2 DS    XL4                   Offset to section 2 (IDIDSEC2) or  00880000
*                                    zero if omitted                    00890000
IDIDOFF3 DS    XL4                   Offset to section 3 (IDIDSEC3) or  00900000
*                                    zero if omitted                    00910000
IDIDOFF4 DS    XL4                   Offset to section 4 (IDIDSEC4) or  00920000
*                                    zero if omitted                    00930000
IDIDOFF5 DS    XL4                   Offset to section 5 (IDIDSEC5) or  00940000
*                                    zero if omitted                    00950000
*                                                                       00960000
IDIDHLN EQU (*-IDID)                 Length of IDID Header              00970000
IDIDIDC EQU C'IDID'                                                     00980000
*                                                                       00990000
IDIDSEC1 DSECT ,                                                        01000000
         DS    0CL12                 Section 1 of IDID - z/OS section   01010000
IDID1FLG DS    BL2                   Flags                              01020000
         DS    XL1                   Reserved                    @P2C   01030001
IDID1NMF DS    XL1                   Name format                 @P2A   01040001
IDID1OF1 DS    XL4                   Offset to user DN (IDID1USR)       01050000
IDID1OF2 DS    XL4                   Offset to registry name (IDID1REG) 01060000
*                                                                       01070000
IDID1USR DSECT ,                     User's distinguished name          01080000
         DS    0CL3                                                     01090000
IDID1UDL DS    XL2                   Length of user's name up to        01100000
*                                    RCVTDNL maximum                    01110000
IDID1UDN DS    C                     X.500 distinguished name of        01120000
*                                    distributed client end user in     01130000
*                                    UTF8 format                        01140000
IDID1REG DSECT ,                     Registry's name                    01150000
         DS    0CL3                                                     01160000
IDID1RL  DS    XL2                   Length of registry's name up to    01170001
*                                    RCVTRL maximum              @P1A   01180001
IDID1RN  DS    C                     Name of original registry in UTF8  01190001
*                                    format                      @P1A   01200001
IDIDSEC2 DSECT                                                          01210000
IDID2    DS    0C                   Section 2 of IDID - Reserved for    01220000
*                                   additonal RACF security information 01230000
IDIDSEC3 DSECT                                                          01240000
IDID3    DS    0C                   Section 3 of IDID - Reserved for    01250000
*                                   alternative security information    01260000
IDIDSEC4 DSECT                                                          01270000
IDID4    DS    0C                   Section 4 of IDID - Reserved for    01280000
*                                   customer information                01290000
IDIDSEC5 DSECT                                                          01300000
IDID5    DS    0C                   Section 5 of IDID - Reserved for    01310000
*                                   Websphere Application Server        01320000
*                                                                    */ 01330000
         MEND                                                           01340000
                                                                        01350001
*        %IDIDPLX : ;               /* PLX Version                   */ 01360000
*%IF IHAVIA = 'YES' %THEN                                               01370000
*    %IHAALET = 'VIA(ACEE_ALET)';                                       01380000
*%ELSE                                                                  01390000
*    %IHAALET = ' ';                                                    01400000
*%IF IDIDBASE=' ' %THEN                                                 01410000
*%IDIDBASE='BASED(ACEEIDID)';                                           01420000
                                                                        01430001
 DCL 1                                                                  01440000
  IDID IDIDBASE IHAALET,            /* Distributed Identity Data     */ 01450000
      3 IDIDID   CHAR(4),           /* Literal id 'IDID'             */ 01460000
      3 IDIDVERS FIXED(8),          /* Version number                */ 01470001
      3 IDIDOFFN FIXED(8),          /* Number of offsets -              01480002
                                       5 for version 1           @L1C*/ 01490002
      3 IDIDHSHN BIT(8),            /* Sections to include in the       01500000
                                     hash for local cache comparison */ 01510000
      3 IDIDSP   FIXED(8),          /* Subpool - required when passed   01520000
                                     as IDID= parameter on RACROUTE     01530000
                                     VERIFY, otherwise optional      */ 01540000
      3 IDIDLEN  FIXED(32),         /* Total length of IDID          */ 01550000
      3 IDIDOFF1 FIXED(32),         /* Offset to section 1 (IDIDSEC1)   01560000
                                     or zero if omitted              */ 01570000
      3 IDIDOFF2 FIXED(32),         /* Offset to section 2 (IDIDSEC2)   01580000
                                     or zero if omitted              */ 01590000
      3 IDIDOFF3 FIXED(32),         /* Offset to section 3 (IDIDSEC3)   01600000
                                     or zero if omitted              */ 01610000
      3 IDIDOFF4 FIXED(32),         /* Offset to section 4 (IDIDSEC4)   01620000
                                     or zero if omitted              */ 01630000
      3 IDIDOFF5 FIXED(32);         /* Offset to section 5 (IDIDSEC5)   01640000
                                     or zero if omitted              */ 01650000
 DCL  1 IDIDSEC1 BASED(ADDR(IDID) + IDIDOFF1), /* Section 1 of IDID  */ 01660000
        3 IDID1FLG BIT(16),         /* Flags                         */ 01670000
        3 *        CHAR(1),         /* Reserved                  @P2C*/ 01680001
        3 IDID1NMF FIXED(8),        /* Name Format:                     01690001
                                       0=Undetermined                   01700001
                                       1=Straight string                01710001
                                       2=X.500 format            @P2A*/ 01720001
        3 IDID1OF1 FIXED(32),       /* Offset to user DN (IDID1USR)     01730000
                                    from start of section 1          */ 01740000
        3 IDID1OF2 FIXED(32);       /* Offset to registry name          01750000
                                  (IDID1REG) from start of section 1 */ 01760000
 DCL  1 IDID1USR BASED(ADDR(IDIDSEC1) + IDID1OF1),    /* User's         01770000
                                    distinguished name               */ 01780000
        3 IDID1UDL FIXED(16),       /* Length of user's name up to      01790000
                                    RCVTDNL maximum                  */ 01800000
        3 IDID1UDN CHAR(*);         /* X.500 Distinguished name of      01810000
                                    distributed client end user in      01820000
                                    UTF8 format                      */ 01830000
 DCL  1 IDID1REG BASED(ADDR(IDIDSEC1) + IDID1OF2),    /* Registry's     01840000
                                    name                             */ 01850000
        3 IDID1RL FIXED(16),        /* Length of registry's name up to  01860000
                                    RCVTRL maximum                   */ 01870000
        3 IDID1RN CHAR(*);          /* Name of original registry in     01880000
                                    UTF8 format                      */ 01890000
 DCL  1 IDIDSEC2 BASED(ADDR(IDID) + IDIDOFF2), /* Section 2 of IDID  */ 01900000
        3 IDID2 CHAR(*);            /* Reserved for additional RACF     01910000
                                    security information             */ 01920000
 DCL  1 IDIDSEC3 BASED(ADDR(IDID) + IDIDOFF3), /* Section 3 of IDID  */ 01930000
        3 IDID3 CHAR(*);            /* Reserved for alternative         01940000
                                    security information             */ 01950000
 DCL  1 IDIDSEC4 BASED(ADDR(IDID) + IDIDOFF4), /* Section 4 of IDID  */ 01960000
        3 IDID4 CHAR(*);            /* Reserved for customer            01970000
                                    information                      */ 01980000
 DCL  1 IDIDSEC5 BASED(ADDR(IDID) + IDIDOFF5), /* Section 5 of IDID  */ 01990000
        3 IDID5 CHAR(*);            /* Reserved for Websphere           02000000
                                    application server               */ 02010000
 DCL                                                                    02020000
    IDIDIDC    CHAR(4)  CONSTANT('IDID'), /* IDID ID CONSTANT        */ 02030000
    IDIDVR01   FIXED(8) CONSTANT(01), /* Version 1 OF IDID           */ 02040001
    IDIDCURV   FIXED(8) CONSTANT(01), /* Current version of IDID     */ 02050001
    IDIDCURH   FIXED(8) CONSTANT(03), /* Current hash - sections 1&2 */ 02060001
    IDIDHLN    FIXED(31) CONSTANT(LENGTH(IDID));                        02070000
                                                                        02080001
