*        %GOTO IISPPRO  ;         /* Bilingual header                   00000100
         MACRO                                                          00000200
         IRRPIISP                                                       00000300
*                                  */                                   00000400
*%IISPPRO : ;                                                           00000500
*/********************************************************************/ 00000600
*/*                                                                  */ 00000700
*/*   $MAC(IRRPIISP) COMP(SC1BN) PROD(SAF):                          */ 00000800
*/*                                                                  */ 00000900
*/*   DESCRIPTIVE NAME =  IPC Security Packet                        */ 00001000
*/*                                                                  */ 00001100
*/*01* PROPRIETARY STATEMENT=                                        */ 00001200
*/***PROPRIETARY_STATEMENT********************************************/ 00001300
*/*                                                                  */ 00001400
*/*                                                                  */ 00001500
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00001600
*/* THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                      */ 00001700
*/* 5694-A01 (C) COPYRIGHT IBM CORP. 1995, 2003                      */ 00001800
*/*                                                                  */ 00001900
*/* STATUS= HBB7708                                                  */ 00002000
*/*                                                                  */ 00002100
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 00002200
*/*                                                                  */ 00002300
*/*                                                                  */ 00002400
*/*01* EXTERNAL CLASSIFICATION: PI                               @L1A*/ 00002500
*/*01* END OF EXTERNAL CLASSIFICATION:                           @L1A*/ 00002600
*/*                                                                  */ 00002700
*/*                                                                  */ 00002800
*/*   FUNCTION = Holds Security information for an IPC entity.       */ 00002900
*/*                                                                  */ 00003000
*/*                                                                  */ 00003100
*/*   METHOD OF ACCESS =                                             */ 00003200
*/*                                                                  */ 00003300
*/*                    - %INCLUDE SYSLIB(IRRPIISP) for PL/X          */ 00003400
*/*                                                                  */ 00003500
*/*                      For VIA support, specify %IHAVIA = 'YES'    */ 00003600
*/*                      semicolon.                                  */ 00003700
*/*                      The ALET IISP_ALET will be declared as      */ 00003800
*/*                      FIXED(32).                                  */ 00003900
*/*                                                                  */ 00004000
*/*                      If %IISPBASE is not set, IISP_PTR will be   */ 00004100
*/*                      declared as PTR(31) and the IISP based on   */ 00004200
*/*                      it. If you want a different pointer used,   */ 00004300
*/*                      declare it yourself and specify %IISPBASE = */ 00004400
*/*                      'BASED(yourptr)'semicolon. Then IISP_PTR    */ 00004500
*/*                      will not be declared and the IISP will be   */ 00004600
*/*                      based on 'yourptr'.                         */ 00004700
*/*                                                                  */ 00004800
*/*                      If either %IHAVIA or %IISPBASE are          */ 00004900
*/*                      specified, they must be specified prior to  */ 00005000
*/*                      the %INCLUDE for IRRPIISP.                  */ 00005100
*/*                                                                  */ 00005200
*/*                    - Issue the IRRPIISP macro for BAL            */ 00005300
*/*                                                                  */ 00005400
*/*                                                                  */ 00005500
*/*   CREATED BY = Make_ISP Callable Service                         */ 00005600
*/*                                                                  */ 00005700
*/*01* CHANGE ACTIVITY:                                              */ 00005800
*/*                                                                  */ 00005900
*/* $L0= XPG4SAF  JBB5522 940421 PDBRW1: Original XPG4 support   @L0A*/ 00006000
*/* $L1= MLS2     HBB7708 011128 PDGTM1: z/OS UNIX MLS support   @L1A*/ 00006100
*/*                                                                  */ 00006200
*/*                                                                  */ 00006300
*/*01* CHANGE DESCRIPTIONS:                                          */ 00006400
*/*                                                                  */ 00006500
*/* A000000-999999                                               @L0A*/ 00006600
*/* A - Support for Multi Level Security for UNIX under z/OS     @L1A*/ 00006700
*/*                                                                  */ 00006800
*/********************************************************************/ 00006900
*                                                               @EJECT; 00007000
*        %GOTO IISPPLS  ;         /* Bilingual header                   00007100
IISP     DSECT ,                  IRRPIISP                              00007200
         DS    0F                                                       00007300
*                                                                       00007400
IISP_ID              DS CL4       LITERAL ID 'IISP'                     00007500
IISP_VERS            DS CL1       Version Number for ISP                00007600
                     DS CL1       Reserved                              00007700
IISP_LEN             DS H         Length of the ISP                     00007800
IISP_IPCP_ALET       DS F         ALET of IPCP                          00007900
IISP_IPCP_PTR        DS F         Address of IPCP mapped by BPXYIPCP    00008000
IISP_IPCKEY          DS F         IPC Key                               00008100
IISP_IPCID           DS F         IPC ID                                00008200
IISP_SECLABEL        DS CL8       SECLABEL                       @L1C   00008300
                     DS CL32      Reserved                              00008400
IISP#LEN             EQU *-IISP   Length of the IISP                    00008500
*  Equates for IISP_ID                                                  00008600
IISP_IDC             EQU C'IISP'  Control Block Acronym                 00008700
*  Equates for IISP_VERS                                                00008800
IISP_CV01            EQU 1        Version 1 of ISP                      00008900
IISP_CVER            EQU 1        Current Version of ISP                00009000
*                                                                       00009100
         MEND                                                           00009200
  Terminating PL/X comment                                          */  00009300
 %IISPPLS : ;                                                           00009400
                                                                        00009500
                                                                        00009600
 %IF IISPBASE='' %THEN                                                  00009700
   %DO;                                                                 00009800
     %IISPBASE='BASED(IISP_PTR)';                                       00009900
   %END;                                                                00010000
  %IF IISPBASE='BASED(IISP_PTR)' %THEN                                  00010100
    %DO;                                                                00010200
      DCL IISP_PTR PTR(31);          /* Pointer to the ISP          */  00010300
    %END;                                                               00010400
 %IF IHAVIA = 'YES' %THEN                                               00010500
     %IHAALET = 'VIA(IISP_ALET)';                                       00010600
 %ELSE                                                                  00010700
     %IHAALET = ' ';                                                    00010800
  %IF IHAALET='VIA(IISP_ALET)' %THEN                                    00010900
    %DO;                                                                00011000
      DCL IISP_ALET FIXED(32);       /* ALET to the  ISP             */ 00011100
    %END;                                                               00011200
                                                                        00011300
  DCL 1 IISP IISPBASE IHAALET BDY(WORD),                                00011400
        3 IISP_ID      CHAR(4),     /* LITERAL ID 'IISP'             */ 00011500
        3 IISP_VERS    FIXED(8),    /* Version Number for ISP        */ 00011600
        3 *            FIXED(8),    /* Reserved                      */ 00011700
        3 IISP_LEN     FIXED(16),   /* Length of the ISP             */ 00011800
        3 IISP_IPCP_ALET FIXED(32), /* ALET of IPCP                  */ 00011900
        3 IISP_IPCP_PTR  POINTER(31), /* Address of IPCP mapped by      00012000
                                          BPXYIPCP                   */ 00012100
        3 IISP_IPCKEY  FIXED(32),   /* IPC Key                       */ 00012200
        3 IISP_IPCID   FIXED(32),   /* IPC ID                        */ 00012300
        3 IISP_SECLABEL        CHAR(8), /* SECLABEL              @L1C*/ 00012400
        3 *                    CHAR(32); /* Reserved                 */ 00012500
 DCL                                                                    00012600
  IISP_IDC   CHAR(4)     CONSTANT('IISP'), /*  ISP ID Constant       */ 00012700
  IISP_CV01  FIXED(8)    CONSTANT(01), /* Version 1 of ISP           */ 00012800
  IISP_CVER  FIXED(8)    CONSTANT(01), /* Current version of ISP     */ 00012900
  IISP#LEN   FIXED(16)   CONSTANT(LENGTH(IISP)); /* Length           */ 00013000
