*        %GOTO ENFPPRO  ;         /* Bilingual header                   00010000
         MACRO                                                          00020000
         IRRPENF2                                                       00030000
*                                 */                                    00040000
*%ENFPPRO: ;                                                            00050000
*/*                                                                  */ 00060000
*/********************************************************************/ 00070000
*/*                                                                  */ 00080000
*/*01* PROPRIETARY STATEMENT:                                        */ 00090000
*/*                                                                  */ 00100000
*/***PROPRIETARY_STATEMENT********************************************/ 00110000
*/*                                                                  */ 00120000
*/*                                                                  */ 00130000
*/* Licensed Materials - Property of IBM                             */ 00140000
*/* 5650-ZOS Copyright IBM Corp. 2009, 2021                          */ 00150003
*/*                                                                  */ 00160000
*/* STATUS= HBB77D0                                                  */ 00170003
*/*                                                                  */ 00180000
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 00190000
*/*                                                                  */ 00200000
*/*                                                                  */ 00210000
*/* $MAC(IRRPENF2) COMP(SC1BN) PROD(SAF):                            */ 00220000
*/*                                                                  */ 00230000
*/*01* EXTERNAL CLASSIFICATION: PI                                   */ 00240000
*/*01* END OF EXTERNAL CLASSIFICATION                                */ 00250000
*/*                                                                  */ 00260000
*/*                                                                  */ 00270000
*/*01* MACRO NAME: IRRPENF2                                          */ 00280000
*/*                                                                  */ 00290000
*/*                                                                  */ 00300000
*/*01* DESCRIPTIVE NAME:                                             */ 00310000
*/*      RACF ENF Signaling Parameter List                           */ 00320000
*/*                                                                  */ 00330000
*/*                                                                  */ 00340000
*/*01* FUNCTION:                                                     */ 00350000
*/*      This data area maps the input parameter list for            */ 00360000
*/*      ENF event code 71 listen exits.                             */ 00370000
*/*                                                                  */ 00380000
*/*                                                                  */ 00390000
*/*01* NOTES:                                                        */ 00400000
*/*      Created by RACF                                             */ 00410000
*/*                                                                  */ 00420000
*/*                                                                  */ 00430000
*/*01* METHOD OF ACCESS:                                             */ 00440000
*/*      For BAL:                                                    */ 00450000
*/*               Issue the IRRPENF2 macro                           */ 00460000
*/*      For PL/X:                                                   */ 00470000
*/*               %INCLUDE SYSLIB(IRRPENF2)                          */ 00480000
*/*                                                                  */ 00490000
*/*                                                                  */ 00500000
*/*01* CHANGE ACTIVITY:                                              */ 00510000
*/*      $L0=IDPROP   HBB7760 080530 PDGTM1: z/OS ID Propagation     */ 00520000
*/*      $P1=ME13899  HBB7760 080624 PDGTM1: z/OS ID Propagation @P1A*/ 00530000
*/*      $L2=ME15036  HBB7760 081118 PDGTM1: z/OS ID Propagation @L2A*/ 00540000
*/*      $L3=IDPROP2  HBB7780 100408 PDGTM1: z/OS ID Prop 2      @L3A*/ 00550000
*/*      $L4=DB2ENF   HBB7790 120208 PDGTM1: ENF Signal for DB2  @L4A*/ 00560000
*/*      $L5=DB2ENF   HBB7790 120530 PDGTM1: ENF Signal for DB2  @L5A*/ 00570000
*/*      $L6=VERENF71 HBB77D0 190510 PDBRW1: RACROUTE VERIFY sup @L6A*/ 00580003
*/*                                                                  */ 00590000
*/*                                                                  */ 00600000
*/*                                                                  */ 00610000
*/*01* CHANGE DESCRIPTIONS:                                          */ 00620000
*/*      A000000 - 999999 Original code                              */ 00630000
*/*      A - Support for z/OS Identity Propagation                   */ 00640000
*/*      A - Defect ME13899                                          */ 00650000
*/*          A - Support for z/OS Identity Propagation               */ 00660000
*/*              - Implement comments/suggestions/corrections        */ 00670000
*/*                as a result of the code review                @P1A*/ 00680000
*/*      A - Defect ME15036                                          */ 00690000
*/*          A - Support for z/OS Identity Propagation               */ 00700000
*/*              - Implement Design Change to issue the ENF          */ 00710000
*/*                signal for ALTUSER REVOKE                     @L2A*/ 00720000
*/*      A - Support for z/OS Identity Propagation 2                 */ 00730000
*/*          - Correct the $MAC name in the prologue             @L3A*/ 00740000
*/*      A - Support for DB2 V11                                     */ 00750000
*/*          - Support for DB2 requirement to propagate              */ 00760000
*/*            ENF event code 71 for DELUSER, and DELGROUP       @L4A*/ 00770000
*/*          - Added the '*' character in column 1 in the            */ 00780000
*/*            PLX code to allow ASSEMBLER to assemble this          */ 00790000
*/*            macro without errors, when it is included in          */ 00800000
*/*            an ASSEMBLER module, with the COPY statement      @L4A*/ 00810000
*/*          - Removed the Eye Catcher constant to ensure            */ 00820000
*/*            that other DSECTS defined before this mapping         */ 00830000
*/*            macro, IRRPENF2, do not get affected by the           */ 00840000
*/*            definition of the Eye Catcher constant            @L4A*/ 00850000
*/*      A - Support for DB2 V11                                     */ 00860000
*/*          - Support for DB2 requirement to provide                */ 00870000
*/*            granularity for the CONNECT REVOKE                @L5A*/ 00880000
*/*      A - Support for RACROUTE REQUEST=VERIFY                     */ 00890004
*/*          - Add constant for RACROUTE REQUEST=VERIFY caller   @L6A*/ 00900003
*/*          - Add flag for invalid password reason              @L6A*/ 00910007
*/*                                                                  */ 00920000
*/*                                                                  */ 00930000
*/*                                                                  */ 00940000
*/********************************************************************/ 00950000
*/*                                                                  */ 00960000
*                                                               @EJECT; 00970000
*        %GOTO ENFPPLS  ;         /* Bilingual header                   00980000
*                                                                       00990000
*********************************************************************** 01000000
*                                                                       01010000
ENF2     DSECT ,                  IRRPENF2                              01020000
         DS    0F                                                       01030000
*                                                                       01040000
IRR_ENF2ID           DS CL6       Literal 'IRREN2'                      01050000
IRR_ENF2VER          DS XL2       Parameter list version                01060000
IRR_ENF2LEN          DS XL2       Parameter list length                 01070000
IRR_ENF2Flags        DS XL2       Control Flags                  @L5C   01080000
IRR_ENF2_CONNECT_REVOKE EQU  X'8000' CONNECT REVOKE(...)         @L5A   01090000
IRR_ENF2_VER_INVPWD     EQU  X'4000' RACROUTE VERIFY revoke due to     *01100002
                                     invalid passwords             @L6A 01110003
IRR_ENF2Q            DS 0CL4      Qualifier code                        01120000
                     DS CL1       Qualifier Code Value                  01130000
                     DS CL3       Reserved                              01140000
IRR_ENF2USER         DS CL8       RACF UserID                           01150000
IRR_ENF2GROUP        DS CL8       RACF GroupID                   @L4A   01160000
                     DS CL16      Reserved                       @L5A   01170000
*                                                                       01180000
IRR_ENF2_Length      EQU *-ENF2                                  @P1C   01190000
*                                                                       01200000
*********************************************************************** 01210000
*  Equates for IRR_ENF2VER                                              01220000
*********************************************************************** 01230000
*                                                                       01240000
IRR_ENF2VER_CV01     EQU X'01'    Version 1 of ENF2                     01250000
IRR_ENF2VER_CV02     EQU X'02'    Version 2 of ENF2              @L4A   01260000
*                                                                       01270000
IRR_ENF2VER_CVER     EQU X'02'    Current version                @L4C   01280000
*                                                                       01290000
*********************************************************************** 01300000
*  Equates for IRR_ENF2Q                                                01310000
*********************************************************************** 01320000
*                                                                       01330000
IRR_ENF2Q_CON        EQU X'80000000'    X'80' CONNECT Command signal    01340000
IRR_ENF2Q_REM        EQU X'40000000'    X'40' REMOVE  Command signal    01350000
IRR_ENF2Q_ALU_REVOKE EQU X'20000000'    X'20' ALTUSER REVOKE            01360000
*                                             Command signal     @L2A   01370000
IRR_ENF2Q_DU         EQU X'10000000'    X'10' DELUSER                   01380000
*                                             Command signal     @L4A   01390000
IRR_ENF2Q_DGRP       EQU X'08000000'    X'08' DELGROUP                  01400000
*                                             Command signal     @L4A   01410000
IRR_ENF2Q_VERIFY     EQU X'04000000'    X'04' RACROUTE REQUEST=         01420002
*                                             VERIFY signal      @L6A   01430003
*                                                                       01440000
         MEND                                                           01450000
*                                                                       01460000
* Terminating PL/X comment                                          */  01470000
*                                                                       01480000
*%ENFPPLS: ;                                                            01490000
*                                                                       01500000
*%IF ENF2BASE = '' %THEN                                                01510000
*  %DO;                                                                 01520000
*    %ENF2BASE = 'BASED(IRR_ENF2_PTR)';                       ]  @P1C   01530000
*  %END;                                                                01540000
*                                                                       01550000
*%IF ENF2BASE = 'BASED(IRR_ENF2_PTR)' %THEN                   ]  @P1C   01560000
*  %DO;                                                                 01570000
*     DCL IRR_ENF2_PTR   PTR(31); ] Base Pointer for ENF2        @P1C   01580000
*  %END;                                                                01590000
*                                                                       01600000
*DCL 1 ENF2  ENF2BASE  BDY(WORD), ] RACF ENF2 parameter list            01610000
*      2 IRR_ENF2ID    CHAR(6),   ] Literal 'IRREN2'                    01620000
*      2 IRR_ENF2VER   FIXED(16), ] Parameter list version              01630000
*      2 IRR_ENF2LEN   FIXED(16), ] Parameter list length               01640000
*      2 IRR_ENF2Flags BIT(16),   ] Control Flags                @L5C   01650000
*        3 IRR_ENF2_CONNECT_REVOKE BIT(1), /* CONNECT REVOKE(...)       01660000
*                                                                @L5A*/ 01670000
*        3 IRR_ENF2_VER_INVPWD BIT(1), ] RACROUTE REQUEST=VERIFY revoke 01680002
*                                      ] due to invalid passwords  @L6A 01690003
*        3 *                       BIT(14), ] Reserved             @L6C 01700007
*      2 IRR_ENF2Q     CHAR(4),   ] Qualifier Code                      01710000
*        3 *             CHAR(1), ] Qualifier Code Value                01720000
*        3 *             CHAR(3), ] Reserved                            01730000
*      2 IRR_ENF2USER  CHAR(8),   ] RACF UserID                         01740000
*      2 IRR_ENF2GROUP CHAR(8),   ] RACF GroupID                 @L4A   01750000
*      2 *             CHAR(16);  ] Reserved                     @L5A   01760000
*                                                                       01770000
*DCL IRR_ENF2_Length    FIXED(32) CONSTANT(LENGTH(ENF2));     ]  @P1C   01780000
*                                                                       01790000
*DCL IRR_ENF2VER_CV01   FIXED(16) CONSTANT('0001'X); ] ENF2 Version 1   01800000
*DCL IRR_ENF2VER_CV02   FIXED(16) CONSTANT('0002'X); /* ENF2 Version 2  01810000
*                                                                @L4A*/ 01820000
*                                                                       01830000
*DCL IRR_ENF2VER_CVER   FIXED(16) CONSTANT('0002'X); /* Current version 01840000
*                                                                @L4C*/ 01850000
*                                                                       01860000
*DCL IRR_ENF2ID_EyeC    CHAR(6) CONSTANT('IRREN2'); ] ENF2 Eye Catcher  01870000
*                                                                       01880000
*DCL IRR_ENF2Q_CON      BIT(32) CONSTANT('80000000'X); /* CONNECT       01890000
*                                                     Command signal */ 01900000
*DCL IRR_ENF2Q_REM      BIT(32) CONSTANT('40000000'X); /* REMOVE        01910000
*                                                     Command signal */ 01920000
*DCL IRR_ENF2Q_ALU_REVOKE                                               01930000
*                       BIT(32) CONSTANT('20000000'X); /* ALTUSER       01940000
*                                                         REVOKE        01950000
*                                                     Command signal    01960000
*                                                                @L2A*/ 01970000
*DCL IRR_ENF2Q_DU       BIT(32) CONSTANT('10000000'X); /* DELUSER       01980000
*                                                     Command signal    01990000
*                                                                @L4A*/ 02000000
*DCL IRR_ENF2Q_DGRP     BIT(32) CONSTANT('08000000'X); /* DELGROUP      02010000
*                                                     Command signal    02020000
*                                                                @L4A*/ 02030000
*DCL IRR_ENF2Q_VERIFY   BIT(32) CONSTANT('04000000'X); /* RACROUTE      02040001
*                                                     VERIFY signal     02050000
*                                                                @L6A*/ 02060003
*                                                           @SPACE(2);  02070000
