*        %GOTO ENFPPRO  ;         /* Bilingual header                   00010000
         MACRO                                                          00020000
         IRRPENFP                                                       00030000
*                                 */                                    00040000
*%ENFPPRO: ;                                                            00050000
*/****START OF SPECIFICATIONS*****************************************/ 00060000
*/*                                                                  */ 00070000
*/*   $MAC(IRRPENFP) COMP(SC1BN) PROD(SAF):                          */ 00080000
*/*                                                                  */ 00090000
*/*01* MACRO NAME: IRRPENFP                                          */ 00100000
*/*                                                                  */ 00110000
*/*                                                                  */ 00120000
*/*01* DESCRIPTIVE NAME: RACF ENF Signalling Parameter List          */ 00130000
*/*                                                                  */ 00140000
*/*                                                                  */ 00150000
*/*01* PROPRIETARY STATEMENT=                                        */ 00160000
*/***PROPRIETARY_STATEMENT********************************************/ 00170000
*/*                                                                  */ 00180000
*/*                                                                  */ 00190000
*/* Licensed Materials - Property of IBM                             */ 00200001
*/* 5650-ZOS Copyright IBM Corp. 2003, 2013                          */ 00210001
*/*                                                                  */ 00220000
*/* STATUS= HBB7790                                                  */ 00230001
*/*                                                                  */ 00240000
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 00250000
*/*                                                                  */ 00260000
*/*                                                                  */ 00270000
*/*01* EXTERNAL CLASSIFICATION: PI                                   */ 00280000
*/*01* END OF EXTERNAL CLASSIFICATION:                               */ 00290000
*/*                                                                  */ 00300000
*/*                                                                  */ 00310000
*/*01* FUNCTION:                                                     */ 00320000
*/*       This data area maps the input parameter list for ENF       */ 00330000
*/*       event code xx listen exists.                               */ 00340000
*/*                                                                  */ 00350000
*/*01* METHOD OF ACCESS:                                             */ 00360000
*/*      %INCLUDE SYSLIB(IRRPENFP) for PL/X                          */ 00370000
*/*                                                                  */ 00380000
*/*                                                                  */ 00390000
*/*01* NOTES:                                                        */ 00400000
*/*      Created by RACF                                             */ 00410000
*/*                                                                  */ 00420000
*/*                                                                  */ 00430000
*/*01* CHANGE ACTIVITY:                                              */ 00440000
*/*    $L0=MLS2      HBB7708 020130 PDAWS1: MLS Support              */ 00450000
*/*    $P1=PYN0327   HBB7708 020610 PDAWS1: PTM PYN0327          @P1A*/ 00460000
*/*    $P2=PYN0582   HBB7708 020829 PDJJP1: PTM PYN0582          @P2A*/ 00470000
*/*    $L1=DB2ENF    HBB7790 120328 PDGTM1: ENF Signal for DB2   @L1A*/ 00480001
*/*    $P3=ME24110   HBB7790 120509 PDGTM1: Prop Checker Defect  @P3A*/ 00490001
*/*                                                                  */ 00500000
*/*                                                                  */ 00510000
*/*01* CHANGE DESCRIPTIONS:                                          */ 00520000
*/*    A 000000-999999                                               */ 00530000
*/*    C - Un-comment out reserved fields in assembler portion   @P1A*/ 00540000
*/*    C - Prolog Updates for HBB7708                            @P2A*/ 00550000
*/*    A - Added the '*' character in column 1 in the                */ 00560001
*/*        PLX code to allow ASSEMBLER to assemble this              */ 00570001
*/*        macro without errors, when it is included in              */ 00580001
*/*        an ASSEMBLER module, with the COPY statement          @L1A*/ 00590001
*/*    C - Change the COPYRIGHT STATEMENT to satisfy the             */ 00600001
*/*        PROP checker tool                                     @P3A*/ 00610001
*/*                                                                  */ 00620000
*/********************************************************************/ 00630000
*/*                                                                  */ 00640000
*                                                               @EJECT; 00650000
*        %GOTO ENFPPLS  ;         /* Bilingual header                   00660000
ENFP     DSECT ,                  IRRPENFP                              00670000
         DS    0F                                                       00680000
*                                                                       00690000
IRR_ENFID            DS CL6       Literal 'IRRENF'                      00700000
IRR_ENFVER           DS XL2       Parameter list version                00710000
IRR_ENFLEN           DS XL2       Parameter list length                 00720000
                     DS CL2       Reserved                         @P1C 00730000
IRR_ENFQ             DS 0CL4      Qualifier code                        00740000
IRR_ENFQ_LIST        DS CL1       SETR RACLIST signal                   00750000
IRR_ENFQ_REFR        DS CL1       SETR RACLIST REFRESH signal           00760000
IRR_ENFQ_NOLIST      DS CL1       SETR NORACLIST signal                 00770000
                     DS CL1       Reserved                         @P1C 00780000
IRR_ENFCLASS         DS CL8       Class name                            00790000
*                                                                       00800000
ENFP_LENGTH          EQU *-ENFP                                         00810000
*  Equates for IRR_ENFVER                                               00820000
IRR_ENFVER_CV01      EQU X'01'    Version 1 of ENFP                     00830000
IRR_ENFVER_CVER      EQU X'01'    Current version                       00840000
*  Equates for IRR_ENFQ                                                 00850000
IRR_ENFQ_LIST_VAL    EQU X'80000000'    Value for SETR RACLIST          00860000
*                                       signal                     @P1A 00870000
IRR_ENFQ_REFR_VAL    EQU X'00800000'    Value for SETR RACLIST REFRESH  00880000
*                                       signal                     @P1A 00890000
IRR_ENFQ_NOLIST_VAL  EQU X'00008000'    Value for SETR NORACLIST        00900000
*                                       signal                     @P1A 00910000
         MEND                                                           00920000
* Terminating PL/X comment                                          */  00930000
*%ENFPPLS: ;                                                            00940000
*                                                                       00950000
*                                                                       00960000
*%IF ENFPBASE='' %THEN                                                  00970000
*  %DO;                                                                 00980000
*    %ENFPBASE='BASED(ENFP_PTR)';                                       00990000
*  %END;                                                                01000000
* %IF ENFPBASE='BASED(ENFP_PTR)' %THEN                                  01010000
*   %DO;                                                                01020000
*     DCL ENFP_PTR PTR(31);          /* Pointer to the ENFP         */  01030000
*   %END;                                                               01040000
*                                                                       01050000
* DCL 1 ENFP ENFPBASE BDY(WORD),    /* RACF ENF parameter list       */ 01060000
*       3 IRR_ENFID    CHAR(6),     /* Literal 'IRRENF'              */ 01070000
*       3 IRR_ENFVER   FIXED(16),   /* Parameter list version        */ 01080000
*       3 IRR_ENFLEN   FIXED(16),   /* Parameter list length         */ 01090000
*       3 *            CHAR(2),     /* Reserved                      */ 01100000
*       3 IRR_ENFQ     CHAR(4),     /* Qualifier code                */ 01110000
*         5 IRR_ENFQ_LIST CHAR(1),  /* SETR RACLIST signal           */ 01120000
*         5 IRR_ENFQ_REFR CHAR(1),  /* SETR RACLIST REFRESH signal   */ 01130000
*         5 IRR_ENFQ_NOLIST CHAR(1),/* SETR NORACLIST signal         */ 01140000
*         5 *              CHAR(1), /* Reserved                      */ 01150000
*       3 IRR_ENFCLASS CHAR(8);     /* Class name                    */ 01160000
*DCL                                                                    01170000
* ENFP_LENGTH FIXED(32) CONSTANT(LENGTH(ENFP)),                         01180000
* IRR_ENFIDC CHAR(6) CONSTANT('IRRENF'), /* ENF ID Constant          */ 01190000
* IRR_ENFVER_CV01 FIXED(16) CONSTANT('01'x), /* Version 1 of ENFP    */ 01200000
* IRR_ENFVER_CVER FIXED(16) CONSTANT('01'x), /* Current Version      */ 01210000
* IRR_ENFQ_LIST_VAL BIT(32) CONSTANT('80000000'X), /* Value for SETR    01220000
*                                         RACLIST signal         @P1A*/ 01230000
* IRR_ENFQ_REFR_VAL BIT(32) CONSTANT('00800000'X), /* Value for SETR    01240000
*                                         RACLIST REFRESH signal @P1A*/ 01250000
* IRR_ENFQ_NOLIST_VAL BIT(32) CONSTANT('00008000'X); /* Value for SETR  01260000
*                                         NORACLIST signal       @P1A*/ 01270000
*                                                           @SPACE(2);  01280000
