*/* START OF SPECIFICATIONS ******************************************/ 00020006
*/*                                                                  */ 00030006
*/*01* PROPRIETARY STATEMENT:                                        */ 00040006
*/*                                                                  */ 00050006
*/***PROPRIETARY_STATEMENT********************************************/ 00060006
*/*                                                                  */ 00070006
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00080006
*/*                                                                  */ 00090006
*/* 5650-ZOS Copyright IBM Corp. 2019                                */ 00100012
*/*                                                                  */ 00110006
*/* STATUS: HBB77C0                                                  */ 00120006
*/*                                                                  */ 00130006
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 00140006
*/*                                                                  */ 00150006
*/* $MAC(IRRPIDTA) COMP(SC1BN) PROD(RACF):                           */ 00160006
*/*                                                                  */ 00170006
*/*01* EXTERNAL CLASSIFICATION: PI                                   */ 00180006
*/*01* END OF EXTERNAL CLASSIFICATION                                */ 00190006
*/*                                                                  */ 00200006
*/*                                                                  */ 00210006
*/*01* MACRO NAME: IRRPIDTA                                          */ 00220006
*/*                                                                  */ 00230006
*/*                                                                  */ 00240006
*/*01* DESCRIPTIVE NAME:                                             */ 00250006
*/*      IDentity Token Area (IDTA)                                  */ 00260006
*/*                                                                  */ 00270006
*/*                                                                  */ 00280006
*/*01* FUNCTION:                                                     */ 00290006
*/*      Maps the data structure that describes an Identity Token    */ 00300022
*/*      (IDT) to be generated or validated by RACROUTE.             */ 00310022
*/*                                                                  */ 00311022
*/*01* DSECT NAME: IDTA                                              */ 00320025
*/*                                                                  */ 00320312
*/*01* COMPONENT:  Resource Access Control Facility (SC1BN)          */ 00320412
*/*                                                                  */ 00320512
*/*01* EYE-CATCHER: IDTA                                             */ 00320612
*/*02*   OFFSET:    0                                                */ 00320712
*/*02*   LENGTH:    4                                                */ 00320812
*/*                                                                  */ 00320912
*/*01* STORAGE ATTRIBUTES:                                           */ 00321121
*/*02*   SUBPOOL:  N/A                                               */ 00321221
*/*02*   KEY:      0                                                 */ 00321321
*/*02*   RESIDENCY:N/A                                               */ 00321421
*/*                                                                  */ 00321612
*/*01* SIZE: 36                                                      */ 00321712
*/*                                                                  */ 00321912
*/*01* CREATED BY: RACROUTE REQUEST=VERIFY                           */ 00322012
*/*                                                                  */ 00322312
*/*01* POINTED TO BY: A field supplied by the issuer of RACROUTE     */ 00322412
*/*                   REQUEST=VERIFY.                                */ 00322512
*/*                                                                  */ 00322912
*/*01* SERIALIZATION: NONE                                           */ 00323012
*/*                                                                  */ 00323112
*/*                                                                  */ 00323212
*/*01* METHOD OF ACCESS:                                             */ 00440006
*/*                                                                  */ 00450006
*/*      %INCLUDE SYSLIB(IRRPIDTA) for PL/X                          */ 00460006
*/*                 just IRRPIDTA  for BAL                           */ 00470006
*/*                                                                  */ 00480006
*/*                                                                  */ 00490006
*/*01* CHANGE ACTIVITY:                                              */ 00500006
*/*      $L0=JWTAUTH  HBB77C0 180510 PDGTM1: JWT Authentication      */ 00510006
*/*      $P0=OA57657  HBB77C0 190510 PDRDC1: JWT Authentication      */ 00520027
*/*                                                                  */ 00520127
*/*                                                                  */ 00530006
*/*                                                                  */ 00540006
*/*                                                                  */ 00550006
*/*01* CHANGE DESCRIPTIONS:                                          */ 00560006
*/*      A000000 - 999999 Original code                              */ 00570006
*/*      A - Support for Authentication using JWT (JSON Web Tokens)  */ 00580006
*/*      A - Uncomment the DS CL8 Reserved field                     */ 00590027
*/*                                                                  */ 00590127
*/*                                                                  */ 00600006
*/*                                                                  */ 00610006
*/*                                                                  */ 00620006
*/*                                                                  */ 00630006
*/* END OF SPECIFICATIONS ********************************************/ 00640006
*/*                                                                  */ 00650006
*                                                                       00660006
*        %GOTO IDTAPLX  ;         /* Bilingual Header                   00670006
*                                                                       00680006
         MACRO                                                          00690006
         IRRPIDTA                                                       00700006
IDTA   DSECT                                                            00710006
IDTA_PList_Start          DS  0D       Start of Parameter List          00720006
IDTA_ID                   DS  CL4      Literal ID 'IDTA'                00730006
IDTA_Version              DS  FL2      Version number                   00740006
IDTA_Version_0001         EQU X'0001'  Version 1 of IDTA                00750006
IDTA_Current_Version      EQU X'0001'  Current Version of IDTA          00760006
IDTA_Length               DS  FL2      Length of IDTA                   00770006
IDTA_IDT_Buffer_Ptr       DS  A        Token Buffer Pointer:            00780006
*                                        Points to a caller allocated   00790006
*                                        buffer for the token.          00800006
IDTA_IDT_Buffer_Len       DS  FL4      Token Buffer Length:             00810006
*                                        Length of the token buffer.    00820006
*                                        Minimum size is 1024.          00830006
*                                        In the future, the minimum     00840006
*                                        size may be increased.         00850006
*                                        If buffer length is too small  00860006
*                                        RACINIT will return the        00870006
*                                        appropriate Return and Reason  00880006
*                                        Code combination to indicate   00890006
*                                        this, and the required size    00900006
*                                        will be set in the Token       00910006
*                                        Length field.                  00920006
IDTA_IDT_Buffer_Len_Min    EQU X'0000400'  Token Buffer Length          00930006
*                                          Minimum Size (1024).         00940006
IDTA_IDT_Len              DS  FL4      Token Length:                    00950006
*                                        Set to zero if no input token. 00960006
*                                        RACF/SAF will set the Token    00970006
*                                        Length on output.              00980006
IDTA_IDT_Type             DS  FL2      Token Type:                      00990006
*                                        Indicates the requested token  01000006
*                                        type.  A value of X'0001'      01010006
*                                        indicates the token is a JWT.  01020006
*                                        All other values are reserved. 01030006
IDTA_JWT_IDT_Type         EQU X'0001'  Indicates the token is a JWT.    01040006
IDTA_IDT_Gen_RC           DS  FL2      IDT Generate Return Code         01050009
IDTA_IDT_Prop_Out         DS  BL2      Token Output Properties bits:    01060006
IDTA_SAF_IDT_Return       EQU X'8000'  Token was returned by SAF        01070006
IDTA_IDT_Auth_Done        EQU X'4000'  Token Authentication Complete    01080006
IDTA_IDT_Signed           EQU X'2000'  Token has a signature            01090006
IDTA_IDT_Prop_In          DS  BL2      Token Properties bits (input):   01100006
IDTA_End_User_IDT         EQU X'8000'  Token is input from an end user. 01110006
*                                        Note: Unsigned tokens will not 01120006
*                                              be accepted by RACROUTE. 01130006
                          DS  CL8      Reserved                         01140026
*                                                                       01160006
IDTA_Ver_0001_PList_End   DS  0C       End of Version 0001 PList        01170006
*                                                                       01180006
IDTA_Data_Area_Len        EQU (*-IDTA) Length of IDTA data area         01190006
*                                                                       01200006
IDTA_ID_Literal           EQU C'IDTA'                                   01210006
*                                                                       01220006
IDTA_Ver_0001_PList_Len  EQU                                           +01230006
                   (IDTA_Ver_0001_PList_End-IDTA_PList_Start)  Length   01240006
*                                                     of Version 0001   01250006
*                                                     Parameter List    01260006
*                                                                       01270006
         MEND                                                           01280006
*                                                                       01290006
* Terminate PL/X Comment                                             */ 01300006
*                                                                       01310006
*        %IDTAPLX : ;             /* PLX Version                     */ 01320006
*                                                                       01330006
*  DCL 1 IDTA   BASED,                                                  01340006
*        2 IDTA_PList_Start,                  /* Start of               01350006
*                                                Parameter List      */ 01360006
*          3 IDTA_ID               CHAR(4),   /* Literal ID 'IDTA'   */ 01370006
*          3 IDTA_Version          FIXED(16), /* Version number      */ 01380006
*          3 IDTA_Length           FIXED(16), /* Length of IDTA      */ 01390006
*          3 IDTA_IDT_Buffer_Ptr   PTR(31),   /* Token Buffer Pointer:  01400006
*                                                  Points to a caller   01410006
*                                                  allocated buffer     01420006
*                                                  for the token.    */ 01430006
*          3 IDTA_IDT_Buffer_Len   FIXED(32), /* Token Buffer Length:   01440006
*                                                  Length of the token  01450006
*                                                  buffer.  Minimum     01460006
*                                                  size is 1024.        01470006
*                                                  In the future,       01480006
*                                                  the minimum size     01490006
*                                                  may be increased.    01500006
*                                                  If buffer length is  01510006
*                                                  too small RACINIT    01520006
*                                                  will return the      01530006
*                                                  appropriate Return   01540006
*                                                  and Reason Code      01550006
*                                                  combination to       01560006
*                                                  indicate this, and   01570006
*                                                  the required size    01580006
*                                                  will be set in the   01590006
*                                                  Token Length field.  01600006
*                                                                    */ 01610006
*          3 IDTA_IDT_Len          FIXED(32), /* Token Length:          01620006
*                                                  Set to zero if no    01630006
*                                                  input token.         01640006
*                                                  RACF/SAF will set    01650006
*                                                  the Token Length     01660006
*                                                  on output.        */ 01670006
*          3 IDTA_IDT_Type         FIXED(16), /* Token Type:            01680006
*                                                  Indicates the        01690006
*                                                  requested token      01700006
*                                                  type.  A value of    01710006
*                                                  X'0001' indicates    01720006
*                                                  the token is a JWT.  01730006
*                                                  All other values     01740006
*                                                  are reserved.     */ 01750006
*          3 IDTA_IDT_GEN_RC       FIXED(16), /* Generate RC         */ 01760009
*          3 IDTA_IDT_Prop_Out     BIT(16),   /* Token Output           01770006
*                                                Properties bits     */ 01780006
*            4 IDTA_SAF_IDT_Return BIT(1),    /* Token was returned     01790006
*                                                by SAF              */ 01800006
*            4 IDTA_IDT_Auth_Done    BIT(1),  /* Token Authentication   01810006
*                                                Complete            */ 01820006
*            4 IDTA_IDT_Signed       BIT(1),  /* Token has a signature  01830006
*                                                                    */ 01840006
*            4 *                     BIT(13), /* RESERVED            */ 01850006
*          3 IDTA_IDT_Prop_In      BIT(16),   /* Token Properties       01860006
*                                                bits (input)        */ 01870006
*            4 IDTA_End_User_IDT     BIT(1),  /* Token is input from    01880006
*                                                an end user.  Note,    01890006
*                                                unsigned tokens will   01900006
*                                                not be accepted by     01910006
*                                                RACROUTE.           */ 01920006
*            4 *                     BIT(15), /* RESERVED            */ 01930007
*          3 *                     CHAR(8),   /* RESERVED            */ 01950012
*        2 IDTA_Ver_0001_PList_End CHAR(0),   /* End of Version 0001    01990006
*                                                Parameter List      */ 02000006
*        2 IDTA_PList_End          CHAR(0);                             02010006
*                                                                       02020006
*  DCL IDTA_ID_Literal        CHAR(4)   CONSTANT('IDTA');               02030006
*                                                                       02040006
*  DCL IDTA_Version_0001      FIXED(16) CONSTANT(0001); /* Version 1    02050006
*                                                          of IDTA   */ 02060006
*  DCL IDTA_Current_Version   FIXED(16) CONSTANT(0001); /* Current      02070006
*                                                       Version of IDTA 02080006
*                                                                    */ 02090006
*                                                                       02100006
*  DCL IDTA_Data_Area_Len     FIXED(32) CONSTANT(LENGTH(IDTA));         02110006
*                                                                       02120006
*  DCL IDTA_Ver_0001_PList_Len   FIXED(32) CONSTANT(                    02130006
*                                    OFFSET(IDTA_Ver_0001_PList_End) -  02140006
*                                    OFFSET(IDTA_PList_Start)           02150006
*                                                  ); /* Length of      02160006
*                                                        Version 0001   02170006
*                                                        Parameter List 02180006
*                                                                    */ 02190006
*                                                                       02200006
*  DCL IDTA_JWT_IDT_Type      FIXED(16) CONSTANT(0001); /*Indicates     02210006
*                                                         the token     02220006
*                                                         is a JWT   */ 02230006
*                                                                       02240006
*  DCL IDTA_IDT_Buffer_Len_Min                                          02250006
*                             FIXED(32) CONSTANT(1024); /* Token Buffer 02260006
*                                                          Length       02270006
*                                                          Minimum Size 02280006
*                                                                    */ 02290006
*  DCL IDTA_IDT_GEN_RC_SUCC   FIXED(16) CONSTANT(0000); /* Gen RC       02300006
*                                                          Success   */ 02310006
*  DCL IDTA_IDT_GEN_RC_UNSIGN FIXED(16) CONSTANT(0003); /* Gen RC       02320023
*                                            Unsigned not valid      */ 02320123
*  DCL IDTA_IDT_GEN_RC_ICSF_UNAVAIL FIXED(16) CONSTANT(00004); /*       02340007
*                                            GEN RC ICSF Unavailable */ 02350006
*  DCL IDTA_IDT_GEN_RC_ICSF_ERR FIXED(16) CONSTANT(0005); /*            02360007
*                                            GEN RC ICSF Error       */ 02370006
*                                                            @SPACE(2); 02380006
