*%;    /*                                                               00050000
         MACRO                                                          00100000
         IRRPWORK &DSECT=YES                                         */ 00150000
*/****START OF SPECIFICATIONS****************************************** 00200000
*                                                                       00250000
*  $MAC (IRRPWORK) COMP(SC1BN) PROD(SAF):                               00300000
*                                                                       00350000
*01* MACRO NAME: IRRPWORK                                               00400000
*                                                                       00450000
*01* DSECT NAME: WORK                                                   00500000
*                                                                       00550000
*01* DESCRIPTIVE NAME: OpenMVS SAF and RACF Work Area                   00600000
*                                                                       00650000
*02*   ACRONYM: WORK                                                    00700000
**/                                                                     00750000
*/*01* PROPRIETARY STATEMENT=                                        */ 00800000
*/***PROPRIETARY_STATEMENT********************************************/ 00850000
*/*                                                                  */ 00900000
*/*                                                                  */ 00950000
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 01000000
*/* THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                      */ 01050000
*/* 5694-A01 (C) COPYRIGHT IBM CORP. 1992, 2006                      */ 01100000
*/*                                                                  */ 01200000
*/* STATUS= HBB7730                                                  */ 01250000
*/*                                                                  */ 01300000
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 01350000
*/*01* EXTERNAL CLASSIFICATION: PI                               @P1C*/ 01366600
*/*01* END OF EXTERNAL CLASSIFICATION:                               */ 01383200
*/*                                                                     01400000
*                                                                       01450000
*01* FUNCTION:                                                          01500000
*                                                                       01550000
*    Maps a 1024 byte work area for use by the OpenMVS SAF/RACF         01600000
*    routers and User Exit.                                             01650000
*                                                                       01700000
*                                                                       01750000
*                                                                       01800000
*01* METHOD OF ACCESS:                                                  01850000
*                                                                       01900000
*02*   PL/X:                                                            01950000
*                                                                       02000000
*        %INCLUDE SYSLIB(IRRPWORK)                                      02050000
*                                                                       02100000
*02*   ASM:   IRRPWORK MACRO                                            02150000
*             A DSECT is produced unless DSECT=NO is specified.         02200000
*                                                                       02250000
*             LA     REG,WORK                                           02300000
*             USING  WORK,REG                                           02350000
*                                                                       02400000
*             Where REG is any general register except 0.               02450000
*                                                                       02500000
*                                                                       02550000
*01* SIZE: Release dependent. Refer to the mapping.                     02600000
*                                                                       02650000
*01* POINTED TO BY: The Common Security Function Parameter List, COMP   02700000
*                                                                       02750000
*01* CREATED BY: The invoker of a OpenMVS security function.            02800000
*                                                                       02850000
*01* DELETED BY: The invoker of a OpenMVS security function.            02900000
*                                                                       02950000
*01* STORAGE ATTRIBUTES:                                                03000000
*02*   SUBPOOL:  N/A                                                    03050000
*02*   KEY:      0                                                      03100000
*02*   RESIDENCY:N/A                                                    03150000
*                                                                       03200000
*01* FREQUENCY: N/A                                                     03250000
*                                                                       03300000
*01* SERIALIZATION: N/A                                                 03350000
*                                                                       03400000
*01* DEPENDENCIES: None                                                 03450000
*                                                                       03500000
*01* NOTES: None                                                        03550000
*                                                                       03600000
*                                                                       03650000
*01* COMPONENT: OpenMVS (SC1BN)                                         03700000
*                                                                       03750000
*01* DISTRIBUTION LIBRARY:  AMACLIB                                     03800000
*                                                                       03850000
*01* EYE-CATCHER: None - this is not a control block definition.        03900000
*02*   OFFSET:  N/A                                                     03950000
*02*   LENGTH:  N/A                                                     04000000
*                                                                       04050000
*01* CHANGE-ACTIVITY:                                                   04100000
*                                                                       04150000
*      $L0=OMVSSAF, HBB4430, 921201, PDNU: OpenMVS Initial Release      04200000
*      $L1=64BIT  , HBB7709, 020101, PDER1: 64 bit support       @L1A   04225000
*      $P1=PJK1148, HBB7709, 031106, PDER1: PTM PJK1148          @P1A   04237500
*      $L2=PKIS7  , HBB7730, 050127, PDTCG: PKI Services VII     @L2A   04240000
*                                                                       04250000
*01* CHANGE-DESCRIPTIONS:                                               04300000
*                                                                       04350000
*    A 000000-999999                                                    04400000
*    A Add new fields for 64 bit support                         @L1A   04425000
*    C Correct external classification                           @P1A   04437500
*    C Changed boundry from WORD to DWORD.                       @L2A   04440000
*                                                                       04450000
*                                                                       04500000
****END OF SPECIFICATIONS*********************************************/ 04550000
*%;   /*                                                                04600000
         AIF   ('&DSECT' EQ 'NO').WORKN                                 04650000
*                                                                       04700000
WORK     DSECT ,                 OpenMVS SAF/RACF common plist.         04750000
         AGO   .WORKY                                                   04800000
.WORKN  ANOP                                                            04850000
WORK     DS    0D                OpenMVS SAF/RACF common plist.  @L2C   04900000
.WORKY  ANOP                                                            04950000
*                                                                       05000000
******************************************************************      05050000
*                                                                *      05100000
* The following 16 bytes are reserved for use by the User Exit   *      05150000
* and can only be stored into once by system code. That store is *      05200000
* SAF storing zero in the WORK_USER_SIGNAL field to tell the     *      05250000
* User Exit that it is being invoked before the security product *      05300000
* (RACF). After the first call, the User Exit should make that   *      05350000
* field non-zero (SAF does not) so that it knows it is being     *      05400000
* invoked after RACF.                                            *      05450000
*                                                                *      05500000
******************************************************************      05550000
*                                                                       05600000
WORK_USER_SIGNAL DS XL4             0-first time User Exit called.      05650000
                 DS CL12            Reserved for User Exit.             05700000
*                                                                       05750000
******************************************************************      05800000
*                                                                *      05850000
* The following 944 bytes are used by both RACF and the User Exit*      05900000
*                                                                *      05950000
* RACF can use the entire 944 bytes, the user the first 136.     *      06000000
*                                                                *      06050000
******************************************************************      06100000
*                                                                       06150000
WORK_USER_WORKA  DS CL136          Racf work area - User Work Area      06200000
                 DS CL808          Racf work area                       06250000
*                                                                       06300000
WORK_SAFRC@      DS D                                             @L1A  06309000
WORK_RACFRC@     DS D                                             @L1A  06318000
WORK_RACFSC@     DS D                                             @L1A  06327000
WORK_SAFRC_ALET@ DS D                                             @L1A  06336000
WORK_RACFRC_ALET@ DS D                                            @L1A  06345000
WORK_RACFSC_ALET@ DS D                                            @L1A  06354000
WORK_FLAGS       DS BL4                                           @L1A  06363000
WORK_AMODE64 EQU X'80'                                            @L1A  06372000
*                                                                       06381000
                 DS CL12           Reserved for future use by SAF.@L1C  06390000
*                                                                       06400000
WORK_LEN          EQU *-WORK     Constant - Fixed length of the WORK.   06450000
                  MEND                                              */  06500000
*                                                                       06550000
*/*******************************************************************/  06600000
*/*                                                                 */  06650000
*/*                  PLAS DECLARATION                               */  06700000
*/*                                                                 */  06750000
*/*******************************************************************/  06800000
*                                                                       06850000
*                                                                       06900000
*                                                                       06950000
* DECLARE                                                               07000000
*  1 WORK CHAR(1024) BASED BDY(DWORD), /* OpenMVS SAF/RACF work area.   07050000
*                                                                @L2C*/ 07060000
*                                                                       07100000
*  /******************************************************************/ 07150000
*  /*                                                                */ 07200000
*  /* The following 16 bytes are reserved for use by the User Exit   */ 07250000
*  /* and can only be stored into once by system code. That store is */ 07300000
*  /* SAF storing zero in the WORK_USER_SIGNAL field to tell the     */ 07350000
*  /* User Exit that it is being invoked before the security product */ 07400000
*  /* (RACF). After the first call, the User Exit should make that   */ 07450000
*  /* field non-zero (SAF does not) so that it knows it is being     */ 07500000
*  /* invoked after RACF.                                            */ 07550000
*  /*                                                                */ 07600000
*  /******************************************************************/ 07650000
*                                                                       07700000
*                                                                       07750000
*   3 WORK_USER_PERM,                /* For User Exit's use only.    */ 07800000
*    5 WORK_USER_SIGNAL FIXED(32),   /* 0-first time User Exit called*/ 07850000
*    5 *                CHAR(12),    /* Reserved for User Exit.      */ 07900000
*                                                                       07950000
*  /******************************************************************/ 08000000
*  /*                                                                */ 08050000
*  /* The following 944 bytes are used by both RACF and the User Exit*/ 08100000
*  /*                                                                */ 08150000
*  /******************************************************************/ 08200000
*                                                                       08250000
*   3 WORK_RACF_WORKA   CHAR(944),   /* RACF work area.              */ 08300000
*    4 WORK_USER_WORKA   CHAR(136),  /* User work area.              */ 08350000
*    4 *                 CHAR(808),                                     08400000
*                                                                       08450000
*  /******************************************************************/ 08500000
*  /*                                                                */ 08550000
*  /* The following areas are used by the SAF router to maintain     */ 08552700
*  /* execution environment information                              */ 08555400
*  /*                                                            @L1A*/ 08558100
*  /******************************************************************/ 08560800
*                                                                       08563500
*   3 WORK_SAFRC@ PTR(64),           /* Basing for SAF RC        @L1A*/ 08566200
*   3 WORK_RACFRC@ PTR(64),          /* Basing for RACF RC       @L1A*/ 08568900
*   3 WORK_RACFSC@ PTR(64),          /* Basing for RACF Reason   @L1A*/ 08571600
*   3 WORK_SAFRC_ALET@ PTR(64),      /* Basing for SAF RC ALET   @L1A*/ 08574300
*   3 WORK_RACFRC_ALET@ PTR(64),     /* Basing for RACF RC ALET  @L1A*/ 08577000
*   3 WORK_RACFSC_ALET@ PTR(64),     /* Basing for RACF Reason ALET     08579700
*                                                                @L1A*/ 08582400
*   3 WORK_FLAGS Bit(32),            /*                          @L1A*/ 08585100
*     5 WORK_AMODE64 Bit(1),         /* AMODE 64 caller          @L1A*/ 08587800
*     5 *            Bit(31),        /* Reserved                 @L1A*/ 08590500
*  /******************************************************************/ 08593200
*  /*                                                                */ 08595900
*  /* The following 64 bytes are reserved for the SAF Router for     */ 08600000
*  /* future use.                                                    */ 08650000
*  /*                                                                */ 08700000
*  /******************************************************************/ 08750000
*                                                                       08800000
*   3 *                 CHAR(12);    /* Reserved for future use. @L1C*/ 08850000
*                                                                       08900000
*  /******************************************************************/ 08950000
*  /*                                                                */ 09000000
*  /*                     Length Constant                            */ 09050000
*  /*                                                                */ 09100000
*  /******************************************************************/ 09150000
*                                                                       09200000
*  DECLARE                                                              09250000
*   WORK_LEN FIXED(31) CONSTANT(LENGTH(WORK));/* Constant WORK length*/ 09300000
*                                                                       09350000
*                                                                       09400000
