*% /*                                                                   00020006
         MACRO                                                          00100000
         IRXCMPTB                                                       00150005
.*/ IRXCMPTBL1: ;                                                       00160006
*/***START OF SPECIFICATIONS******************************************/ 00300000
*/*                                                                  */ 00350000
*/*01* PROPRIETARY STATEMENT=                                        */ 00650000
*/***PROPRIETARY_STATEMENT********************************************/ 00700000
*/*                                                                  */ 00750000
*/*                                                                  */ 00800000
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00850000
*/* 5650-ZOS COPYRIGHT IBM CORP. 1991, 2015                          */ 00950000
*/*                                                                  */ 01050000
*/* STATUS= HTE77A0                                                  */ 01100000
*/*                                                                  */ 01150000
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 01200000
*/*                                                                  */ 01250000
*/*01* EXTERNAL CLASSIFICATION: PI                                   */ 01251000
*/*01* END OF EXTERNAL CLASSIFICATION:                               */ 01252000
*/*                                                                  */ 01253000
*/*01* Macro Name: IRXCMPTB                                          */ 01254000
*/*                                                                  */ 01255000
*/*01* Descriptive Name: REXX Compiler Programming Table             */ 01256000
*/*                                                                  */ 01257000
*/*01* DSECT Name: COMPGMTB_HEADER, COMPGMTB_ENTRY                   */ 01258000
*/*                                                                  */ 01259000
*/*01* Component:  TSO/E REXX (28508)                                */ 01259100
*/*                                                                  */ 01259200
*/*01* Eye-Catcher: None                                             */ 01259300
*/*02*  Offset: N/A                                                  */ 01259400
*/*02*  Length: N/A                                                  */ 01259500
*/*                                                                  */ 01259600
*/*01* Storage Attributes:                                           */ 01259700
*/*02*  Subpool: 78                                                  */ 01259800
*/*02*  Key: 8                                                       */ 01259900
*/*02*  Residency:                                                   */ 01260000
*/*02*  Main Storage:                                                */ 01260100
*/*02*  Auxiliary Storage:                                           */ 01260200
*/*02*  Virtual Storage:                                             */ 01260300
*/*                                                                  */ 01260400
*/*01* Size: 32 bytes for the COMPGMTB_HEADER plus                   */ 01260500
*/*          56 bytes for each COMPGMTB_ENTRY                        */ 01260600
*/*                                                                  */ 01260700
*/*01* Created by: IRXCENV                                           */ 01260800
*/*                                                                  */ 01260900
*/*01* Pointed to by: ENVBLOCK_COMPGMTB                              */ 01261000
*/*                                                                  */ 01261100
*/*01* Serialization: None                                           */ 01261200
*/*                                                                  */ 01261300
*/*01* FUNCTION: The REXX Compiler Programming Table contains        */ 01300000
*/*              information about the compilers that are available  */ 01350000
*/*              in a REXX environment.  It consists of a COMPGMTB   */ 01400000
*/*              header and COMPGMTB entries.  The header contains   */ 01450000
*/*              information such as the address of the first        */ 01500000
*/*              COMPGMTB entry, the total number of entries, and    */ 01550000
*/*              the number of entries used.  For each compiler,     */ 01600000
*/*              there is a COMPGMTB entry containing information    */ 01650000
*/*              such as the name of the compiler's language         */ 01700000
*/*              processor and its associated exits.  The COMPGMTB   */ 01750000
*/*              header is pointed to by the ENVBLOCK_COMPGMTB       */ 01800000
*/*              field in the ENVBLOCK.  For more information, see   */ 01850000
*/*              z/OS TSO/E Customization.                           */ 01900000
*/*                                                                  */ 01901000
*/*01* Method of Access:                                             */ 01910000
*/*02*  ASM: USING on DSECT IRXCMPTB                                 */ 01920000
*/*                                                                  */ 01930000
*/*02*  PL/X: %INCLUDE SYSLIB(IRXCMPTB)                              */ 01940000
*/*                                                                  */ 01941000
*/*  MACRO-TYPE = Mapping macro                                      */ 01950000
*/*                                                                  */ 02000000
*/*  NOTES = None                                                    */ 02050000
*/*                                                                  */ 02100000
*/*  PROCESSOR = BAL                                                 */ 02150000
*/*                                                                  */ 02200000
*/*  MACRO-SIZE = See listing                                        */ 02250000
*/*                                                                  */ 02300000
*/*  INVOCATION = IRXCMPTB                                           */ 02350000
*/*                                                                  */ 02400000
*/*               Addressability to the COMPGMTB_HEADER can be       */ 02450000
*/*               obtained via a USING on COMPGMTB_HEADER.           */ 02500000
*/*                                                                  */ 02550000
*/*               Addressability to a COMPGMTB_ENTRY can be obtained */ 02600000
*/*               via a USING on COMPGMTB_ENTRY.                     */ 02650000
*/*                                                                  */ 02700000
*/*01* CHANGE-ACTIVITY =                                             */ 02750000
*/*                                                                  */ 02800000
*/*  Created for TSO/E Version 2.3.1                         @E23X2BJ*/ 02850000
*/*                                                                  */ 02900000
*/***END OF SPECIFICATIONS********************************************/ 02950000
*%GOTO PLAS_IRXCMPTB;                                                   02960001
*/* A000000-999999                                           @E23X2BJ*/ 03000000
         EJECT                                                          03050000
*/********************************************************************/ 03100000
*/*                                                                  */ 03150000
*/*  COMPGMTB_HEADER - REXX Compiler Programming Table Header        */ 03200000
*/*                                                                  */ 03250000
*/********************************************************************/ 03300000
         SPACE                                                          03350000
COMPGMTB_HEADER DSECT                  REXX Compiler Programming Table  03400000
*                                      Header                           03450000
         DS  0D                        Align on doubleword boundary     03500000
COMPGMTB_FIRST   DS  A                 Address of the first COMPGMTB    03550000
*                                      entry                            03600000
COMPGMTB_TOTAL   DS  F                 Total number of COMPGMTB entries 03650000
COMPGMTB_USED    DS  F                 Number of used COMPGMTB entries  03700000
COMPGMTB_LENGTH  DS  F                 Length of each COMPGMTB entry    03750000
                 DS  CL8               Reserved                         03800000
COMPGMTB_FFFF    DS  CL8               End marker - hex                 03850000
*                                      'FFFFFFFFFFFFFFFF'               03900000
         DS  0D                        Align on doubleword boundary     03950000
         SPACE                                                          04000000
*/********************************************************************/ 04050000
*/*                                                                  */ 04100000
*/*  COMPGMTB_ENTRY - REXX Compiler Programming Table Entry          */ 04150000
*/*                                                                  */ 04200000
*/********************************************************************/ 04250000
         SPACE                                                          04300000
COMPGMTB_ENTRY  DSECT                  REXX Compiler Programming Table  04350000
*                                      Entry                            04400000
         DS  0D                        Align on doubleword boundary     04450000
COMPGMTB_RTPROC    DS  CL8             Name of the Run Time Processor   04500000
COMPGMTB_COMPINIT  DS  CL8             Name of the Initialization       04550000
*                                      Routine                          04600000
COMPGMTB_COMPTERM  DS  CL8             Name of the Termination Routine  04650000
COMPGMTB_COMPLOAD  DS  CL8             Name of the Load Routine         04700000
COMPGMTB_COMPVAR   DS  CL8             Name of the Variable Handling    04750000
*                                      Routine                          04800000
COMPGMTB_STORAGE   DS  4F              Storage for the Compiler         04850000
COMPGMTB_NEXT      DS  0D              Next COMPGMTB entry              04900000
         DS  0D                        Align on doubleword boundary     04950000
         MEND                                                           05000000
 %PLAS_IRXCMPTB: ;                                                      05050000
 /********************************************************************/ 05060001
 /*                                                                  */ 06500000
 /*  INVOCATION =                                                    */ 06550000
 /*                                                                  */ 06600000
 /*      %CMPTBBASE = '... attributes ...'                           */ 06650000
 /*      %CMPTB_ENTRY_BASE = '... attributes ...'                    */ 06700000
 /*      %INCLUDE SYSLIB(IRXCMPTB)                                   */ 06750000
 /*                                                                  */ 06800000
 /*      Note:                                                       */ 06850000
 /*          %CMPTBBASE is a Macro variable which may be used to     */ 06900000
 /*          establish the attributes for the declaration.  If       */ 06950000
 /*          not specified, 'BASED(ENVBLOCK_COMPGMTB)' will be used  */ 07000000
 /*          as the default attribute.                               */ 07050000
 /*                                                                  */ 07100000
 /********************************************************************/ 07450001
  %IF CMPTBBASE='' %THEN            /* Any Attributes specified?     */ 07500000
    %PLASBASE = 'BASED(ENVBLOCK_COMPGMTB)';                             07550000
                                    /* No, set default Attributes    */ 07600000
  %ELSE                                                                 07650000
    %PLASBASE = CMPTBBASE;          /* Else use what was specified   */ 07700000
 @EJECT;                                                                07750000
 /********************************************************************/ 07800000
 /*                                                                  */ 07850000
 /*  COMPGMTB_HEADER - REXX Compiler Programming Table Header        */ 07900000
 /*                                                                  */ 07950000
 /********************************************************************/ 08000000
 @SPACE;                                                                08050000
 DCL 1 COMPGMTB_HEADER PLASBASE BDY(DWORD), /* REXX Compiler            08100000
                                       Programming Table Header      */ 08150000
       2 COMPGMTB_FIRST   PTR(31),   /*  Address of the first           08200000
                                         COMPGMTB entry              */ 08250000
       2 COMPGMTB_TOTAL   FIXED(31), /*  Total number of COMPGMTB       08300000
                                         entries                     */ 08350000
       2 COMPGMTB_USED    FIXED(31), /*  Number of used COMPGMTB        08400000
                                         entries                     */ 08450000
       2 COMPGMTB_LENGTH  FIXED(31), /*  Length of each COMPGMTB        08500000
                                         entry                       */ 08550000
       2 *                CHAR(8),   /*  Reserved                    */ 08600000
       2 COMPGMTB_FFFF    CHAR(8);   /*  End marker - hex               08650000
                                         'FFFFFFFFFFFFFFFF'          */ 08700000
 @SPACE;                                                                08750000
 /********************************************************************/ 08800000
 /*                                                                  */ 08850000
 /*  COMPGMTB_ENTRY - REXX Compiler Programming Table Entry          */ 08900000
 /*                                                                  */ 08950000
 /********************************************************************/ 09000000
 @SPACE;                                                                09050000
  %IF CMPTB_ENTRY_BASE='' %THEN     /* Any Attributes specified?     */ 09100000
    %PLAS1BASE = 'BASED';                                               09150000
                                    /* No, set default Attributes    */ 09200000
  %ELSE                                                                 09250000
    %PLAS1BASE = CMPTB_ENTRY_BASE;  /* Else use what was specified   */ 09300000
 @EJECT;                                                                09350000
 DCL 1 COMPGMTB_ENTRY PLAS1BASE BDY(DWORD),                             09400000
       2 COMPGMTB_ENTRY_NAMES,                                          09450000
         3 COMPGMTB_RTPROC   CHAR(8), /* Name of the Run Time           09500000
                                      Processor                      */ 09550000
         3 COMPGMTB_COMPINIT CHAR(8), /* Name of the Initialization     09600000
                                       Routine                       */ 09650000
         3 COMPGMTB_COMPTERM CHAR(8), /* Name of the Termination        09700000
                                       Routine                       */ 09750000
         3 COMPGMTB_COMPLOAD CHAR(8), /* Name of the Load Routine    */ 09800000
         3 COMPGMTB_COMPVAR  CHAR(8), /* Name of the Variable Handling  09850000
                                       Routine                       */ 09900000
      2 COMPGMTB_STORAGE(4) FIXED(31),/* Storage for use by the Run     09950000
                                       Time Processor                */ 10000000
      2 COMPGMTB_NEXT    CHAR(0);     /*  Next COMPGMTB entry        */ 10050000
