*% /*                                                                   00010002
         MACRO                                                          00100000
         IRXENVB                                                        00150001
.*/  ENVBPRO: ;                                                         00250002
*/* Start of Specifications ******************************************* 00300000
* *01* PROPRIETARY STATEMENT=                                         * 00350000
*                                                                     * 00400000
*01* Descriptive Name: REXX Environment Block                         * 00450000
*02*  Acronym: ENVBLOCK                                               * 00500000
*                                                                     * 00550000
*01* PROPRIETARY STATEMENT=                                           * 01148000
*****PROPRIETARY_STATEMENT********************************************* 01149000
*                                                                     * 01149200
*   LICENSED MATERIALS - PROPERTY OF IBM                              * 01149300
*   5650-ZOS COPYRIGHT IBM CORP. 1988, 2015                           * 01149500
*                                                                     * 01149600
*   STATUS= HTE77A0                                                   * 01149700
*                                                                     * 01149800
*****END_OF_PROPRIETARY_STATEMENT************************************** 01149900
*                                                                     * 01150000
*01* Macro Name: IRXENVB                                              * 01200000
*                                                                     * 01250000
*01* DSECT Name: ENVBLOCK                                             * 01300000
*                                                                     * 01350000
*01* Component:  TSO/E REXX (28508)                                   * 01400000
*                                                                     * 01450000
*01* Eye-Catcher: ENVBLOCK                                            * 01500000
*02*  Offset: 0                                                       * 01550000
*02*  Length: 8                                                       * 01600000
*                                                                     * 01650000
*01* Storage Attributes:                                              * 01700000
*02*  Subpool: 78                                                     * 01750000
*02*  Key: 8                                                          * 01800000
*02*  Residency: Above 16M                                            * 01850000
*02*  Main Storage:                                                   * 01900000
*02*  Auxiliary Storage:                                              * 01950000
*02*  Virtual Storage:                                                * 02000000
*                                                                     * 02050000
*01* Size: 320 bytes                                                  * 02100000
*                                                                     * 02150000
*01* Created by: IRXITPA                                              * 02200000
*                                                                     * 02250000
*01* Pointed to by: Register 0, or by the ENVBLOCK parameter during   * 02300000
*                   calls to various REXX programming service routines* 02350000
*                   and REXX replaceable routines.                    * 02400000
*                                                                     * 02450000
*01* Serialization: None                                              * 02500000
*                                                                     * 02550000
*01* Function:                                                        * 02600000
*02* The REXX Environment block (ENVBLOCK) contains information       * 02650000
*    describing a REXX environment, and REXX execs in that            * 02700000
*    environment.  Included in the ENVBLOCK are pointers to the       * 02750000
*    PARMBLOCK, WORKBLOK_EXT and IRXEXTE, as well as error            * 02800000
*    information.                                                     * 02850000
*                                                                     * 02900000
*01* Method of Access:                                                * 02950000
*02*  ASM: USING on ENVBLOCK DSECT                                    * 03000000
*                                                                     * 03050000
*02*  PL/AS: %ENVBBASE='... base ...'                                 * 03100000
*            %INCLUDE SYSLIB(IRXENVB)                                 * 03150000
*                                                                     * 03200000
*01* External Classification:                                         * 03250000
*02* GUPI: BASE                                                       * 03300000
*02* DMTI: FIELDS                                                     * 03350000
*          ENVBLOCK_ERROR                                             * 03400000
*02* PSPI: FIELDS                                                     * 03450000
*          ENVBLOCK_COMPGMTB                                          * 03500000
*01* End of External Classification:                                  * 03550000
*                                                                     * 03600000
*01* Change Activity:                                                 * 03650000
*                                                                     * 03700000
*    Created for TSO/E Version 2.1.0                         @E21D2C2 * 03750000
*                                                                     * 03800000
*    Added ENVBLOCK_VERSION and ENVBLOCK_LENGTH fields.      @DEI0040 * 03850000
*                                                                     * 03900000
*    @OY30448 - Add ENVBLOCK_ATTNROUT_PARMPTR, in the external        * 03950000
*               portion of the ENVBLOCK. This field is used to        * 04000000
*               pass the address of an attention exit parameter       * 04050000
*               to an ATTENTION_ROUTINE.                     @YA30448 * 04100000
*                                                                     * 04150000
*    Added the ENVBLOCK_COMPGMTB field                       @E23X2BJ * 04200000
*                                                                     * 04250000
*    @OY43618 - Add ENVBLOCK_ECTPTR in the external portion of        * 04300000
*               the ENVBLOCK. This field is used to indicate the      * 04350000
*               ECT under which an environment that is integrated     * 04400000
*               with TSO/E is anchored.                      @YA43618 * 04450000
*                                                                     * 04500000
*    PMH0160  - Updated prolog for SHOWHDR                   @PMH0160 * 04550000
*                                                                     * 04600000
*    PMH0173  - Changed PL/AS label from PROLOG to ENVBPRO   @PMH0173 * 04650000
*               to prevent name clashes.                     @PMH0173 * 04700000
*                                                                     * 04750000
*    @OY57272 - Add ENVBLOCK_TERMA_CLEANUP flag to indicate  @YA57272 * 04800000
*               when this ENVBLOCK is undergoing abnormal    @YA57272 * 04850000
*               termination.                                 @YA57272 * 04900000
*                                                                     * 04901000
* FLAG REASON   RELEASE DATE     ORIGIN                           @P1A* 04910000
* ---- ------   ------- -------- ------                           @P1A* 04920000
* $P1  MG06358  HTE7730 051003   WSY1:  Added word for use by     @P1A* 04930000
*               USS REXX.                                         @P1A* 04940000
*                                                                     * 04950000
*** End of Specifications ********************************************/ 05000000
*   %GOTO PLAS_IRXENVB; /*                                              05050000
         EJECT                                                          05100000
*********************************************************************** 05150000
***                                                                  ** 05200000
***  ENVBLOCK - REXX Environment Block                               ** 05250000
***                                                                  ** 05300000
*********************************************************************** 05350000
         SPACE                                                          05400000
ENVBLOCK DSECT                         REXX Environment Block           05450000
         DS  0D                        Align on doubleword boundary     05500000
ENVBLOCK_ID           DS  CL8          ENVBLOCK identifier 'ENVBLOCK'   05550000
ENVBLOCK_VERSION      DS  CL4          Version number        @DEI0040   05600000
ENVBLOCK_LENGTH       DS  F            Length of ENVBLOCK    @DEI0040   05650000
ENVBLOCK_PARMBLOCK    DS  A            Address of the PARMBLOCK         05700000
ENVBLOCK_USERFIELD    DS  A            Address of the user field        05750000
ENVBLOCK_WORKBLOK_EXT DS  A            Address of the current           05800000
*                                      WORKBLOK_EXT                     05850000
ENVBLOCK_IRXEXTE      DS  A            Address of IRXEXTE               05900000
ENVBLOCK_ERROR        DS  0CL256       Error information                05950000
ERROR_CALL@           DS  A            Address of the routine in error  06000000
                      DS  F            Reserved                         06050000
ERROR_MSGID           DS  CL8          Message identifier of first call 06100000
PRIMARY_ERROR_MESSAGE DS  CL80         Error message                    06150000
ALTERNATE_ERROR_MSG   DS  CL160        Extended error message           06200000
ENVBLOCK_COMPGMTB     DS  A            Address of the Compiler          06250000
*                                      Programming Table     @E23X2BJ   06300000
ENVBLOCK_ATTNROUT_PARMPTR DS A         Address of a parameter           06350000
*                                      passed to the user's ATTNROUT    06400000
*                                      routine from the REXX attention  06450000
*                                      routine. Used for communication  06500000
*                                      between the user's ATTNROUT      06550000
*                                      routine and the REXX attention   06600000
*                                      routine.              @YA30448   06650000
ENVBLOCK_ECTPTR       DS  A            Address of the ECT under which   06700000
*                                      an environment that is           06750000
*                                      integrated with TSO/E is         06800000
*                                      anchored.             @YA43618   06850000
ENVBLOCK_INFO_FLAGS   DS  0BL4         Information flags       @YA57272 06900000
ENVBLOCK_INFO_FLAG1   DS  BL1          Information byte 1      @YA57272 06950000
ENVBLOCK_TERMA_CLEANUP EQU X'80'       Flag to indicate that            07000000
*                                      IRXTERMA is in control to        07050000
*                                      FREE active execs and possibly   07100000
*                                      to cleanup the ENVBLOCK          07150000
*                                      itself                  @YA57272 07200000
                      DS  BL3          Reserved                @YA57272 07250000
ENVBLOCK_USS_REXX     DS  F            Word reserved for USS REXX  @P1C 07260000
                      DS  3F           Reserved                    @P1C 07300000
         DS  0D                        Align on doubleword boundary     07350000
         MEND                                                           07400000
**/                                                                     07450000
 %PLAS_IRXENVB : ;                                                      07500000
 @EJECT;                                                                07550000
 /********************************************************************/ 07600000
 /*                                                                  */ 07650000
 /*  ENVBLOCK - REXX Environment Block                               */ 07700000
 /*                                                                  */ 07750000
 /********************************************************************/ 07800000
 @SPACE;                                                                07850000
 %IF ENVBBASE='' %THEN              /* If no base was specified      */ 07900000
   %PLASBASE = 'BASED';             /* Set base to 'BASED'           */ 07950000
 %ELSE                              /* A base was specified          */ 08000000
   %PLASBASE = ENVBBASE;            /* Set base to specified base    */ 08050000
 DCL 1 ENVBLOCK PLASBASE BDY(DWORD), /* REXX Environment Block       */ 08100000
       2 ENVBLOCK_ID CHAR(8),       /* ENVBLOCK identifier 'ENVBLOCK'*/ 08150000
       2 ENVBLOCK_VERSION CHAR(4),  /* Version number        @DEI0040*/ 08200000
       2 ENVBLOCK_LENGTH FIXED(31), /* Length of ENVBLOCK    @DEI0040*/ 08250000
       2 ENVBLOCK_PARMBLOCK PTR(31), /* Address of the PARMBLOCK     */ 08300000
       2 ENVBLOCK_USERFIELD PTR(31), /* Address of the user field    */ 08350000
       2 ENVBLOCK_WORKBLOK_EXT PTR(31), /* Address of the current       08400000
                                       WORKBLOK_EXT                  */ 08450000
       2 ENVBLOCK_IRXEXTE PTR(31),  /* Address of IRXEXTE            */ 08500000
       2 ENVBLOCK_ERROR,            /* Error information             */ 08550000
         3 ERROR_CALL@ PTR(31),     /* Address of the first caller   */ 08600000
         3 * FIXED(31),             /* Reserved                      */ 08650000
         3 ERROR_MSGID CHAR(8),     /* Message id used by the first     08700000
                                       caller                        */ 08750000
         3 PRIMARY_ERROR_MESSAGE CHAR(80), /* Primary error message  */ 08800000
         3 ALTERNATE_ERROR_MSG CHAR(160), /* Alternate error message */ 08850000
       2 ENVBLOCK_COMPGMTB PTR(31), /* Address of the Compiler          08900000
                                     Programming Table       @E23X2BJ*/ 08950000
       2 ENVBLOCK_ATTNROUT_PARMPTR PTR(31), /* Address of a parameter   09000000
                                       passed to the user's ATTNROUT    09050000
                                       routine from the REXX attention  09100000
                                       routine. Used for communication  09150000
                                       between the user's ATTNROUT      09200000
                                       routine and the REXX attention   09250000
                                       routine.              @YA30448*/ 09300000
       2 ENVBLOCK_ECTPTR PTR(31),   /* Address of the ECT under which   09350000
                                       an environment that is           09400000
                                       integrated with TSO/E is         09450000
                                       anchored.             @YA43618*/ 09500000
       2 ENVBLOCK_INFO_FLAGS BIT(32), /* Information flags   @YA57272*/ 09550000
         3 ENVBLOCK_INFO_FLAG1 BIT(8),/* Information byte 1  @YA57272*/ 09600000
           5 ENVBLOCK_TERMA_CLEANUP BIT(1), /* Flag to indicate that    09650000
                                     that IRXTERMA is in control to     09700000
                                     FREE active execs and possibly     09750000
                                     to cleanup the ENVBLOCK            09800000
                                     itself                  @YA57272*/ 09850000
           5 * BIT(7),              /* Reserved              @YA57272*/ 09900000
         3 *              BIT(24),  /* Reserved              @YA57272*/ 09950000
       2 ENVBLOCK_USS_REXX FIXED(31), /* Word reserved for USS REXX     09960000
                                                                 @P1C*/ 09970000
       2 *(3) FIXED(31);            /* Reserved                  @P1C*/ 10000000
