*% /*                                                                   00002003
         MACRO                                                          00020000
         IRXPARMB &DECLARE=YES Declare PARMBLOCK (YES or NO)            00030000
         GBLB  &PARMB                                                   00040000
         AIF   ('&PARMB' EQ '1').SKIPARMB If &PARMB is on, then skip    00050000
.*                             PARMBLOCK declaration                    00060000
&PARMB   SETB  (1)             Set &PARMB to on                         00070000
         AIF   ('&DECLARE' EQ 'NO').SKIPARMB If DECLARE=NO was          00080000
.*                             specified, then skip PARMBLOCK           00090000
.*                             declaration                              00100002
.*/ IRXPARMBL1: ;                                                       00101003
*/***START OF SPECIFICATIONS******************************************/ 00110000
*/*                                                                  */ 00120000
*/*01* PROPRIETARY STATEMENT=                                        */ 00299800
*/***PROPRIETARY_STATEMENT********************************************/ 00299900
*/*                                                                  */ 00300000
*/*                                                                  */ 00300100
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00300200
*/* 5650-ZOS COPYRIGHT IBM CORP. 1988, 2015                          */ 00300400
*/*                                                                  */ 00300600
*/* STATUS= HTE77A0                                                  */ 00300700
*/*                                                                  */ 00300800
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 00300900
*/*                                                                  */ 00301000
*/*01* EXTERNAL CLASSIFICATION: PI                               @P1A*/ 00301100
*/*01* END OF EXTERNAL CLASSIFICATION:                           @P1A*/ 00301200
*/*                                                                  */ 00302000
*/*01* Macro Name: IRXPARMB                                          */ 00303000
*/*                                                                  */ 00304000
*/*01* Descriptive Name: REXX Parameter Block                        */ 00305000
*/*                                                                  */ 00306000
*/*01* DSECT Name: PARMBLOCK                                         */ 00307000
*/*                                                                  */ 00308000
*/*01* Component:  TSO/E REXX (28508)                                */ 00309000
*/*                                                                  */ 00309100
*/*01* Eye-Catcher: IRXPARMS                                         */ 00309200
*/*02*  Offset: 0                                                    */ 00309300
*/*02*  Length: 8                                                    */ 00309400
*/*                                                                  */ 00309500
*/*01* Storage Attributes:                                           */ 00309600
*/*02*  Subpool: 78                                                  */ 00309700
*/*02*  Key: 8                                                       */ 00309800
*/*02*  Residency:                                                   */ 00309900
*/*02*  Main Storage:                                                */ 00310000
*/*02*  Auxiliary Storage:                                           */ 00310100
*/*02*  Virtual Storage:                                             */ 00310200
*/*                                                                  */ 00310300
*/*01* Size: 64 bytes                                                */ 00310400
*/*                                                                  */ 00310500
*/*01* Created by: REXX Language Processor Initialization            */ 00310600
*/*                                                                  */ 00310700
*/*01* Pointed to by: ENVBLOCK_PARMBLOCK field of the ENVBLOCK       */ 00310800
*/*                                                                  */ 00310900
*/*01* Serialization: None                                           */ 00311000
*/*                                                                  */ 00311100
*/*01* Function: The REXX Parameter Block (PARMBLOCK) contains       */ 00313000
*/*             information describing a REXX environment.           */ 00320000
*/*             Information included in the PARMBLOCK are whether    */ 00330000
*/*             the REXX environment is reentrant or non-reentrant,  */ 00340000
*/*             and whether or not the data stack can be used.  The  */ 00350000
*/*             PARMBLOCK also includes pointers to the MODNAMET,    */ 00360000
*/*             SUBCOMTB, and PACKTB.                                */ 00370000
*/*                                                                  */ 00390000
*/*01* Method of Access:                                             */ 00391000
*/*02*  ASM: USING on DSECT PARMBLOCK                                */ 00392000
*/*                                                                  */ 00393000
*/*02*  PL/X: %INCLUDE SYSLIB(IRXPARMB)                              */ 00394000
*/*                                                                  */ 00395000
*/*  MACRO-TYPE = Mapping macro                                      */ 00400000
*/*                                                                  */ 00410000
*/*  NOTES = Each of the flags in the REXX Parameter Block   @E23X2BJ*/ 00420000
*/*          can be address with hardcoded assembler offsets @E23X2BJ*/ 00430000
*/*          and should not be moved.                        @E23X2BJ*/ 00440000
*/*                                                                  */ 00450000
*/*  PROCESSOR = BAL                                                 */ 00460000
*/*                                                                  */ 00470000
*/*  MACRO-SIZE = See listing                                        */ 00480000
*/*                                                                  */ 00490000
*/*  INVOCATION = IRXPARMB                                           */ 00500000
*/*                                                                  */ 00510000
*/*               IRXPARMB DECLARE=NO will simply set an assembler   */ 00520000
*/*               macro variable and will not declare the PARMBLOCK. */ 00530000
*/*                                                                  */ 00540000
*/*               Addressability to the PARMBLOCK can be obtained    */ 00550000
*/*               via a USING on PARMBLOCK.                          */ 00560000
*/*                                                                  */ 00570000
*/*               The use of the keyword DECLARE will        @E23X2BJ*/ 00580000
*/*               control the position of the assembler      @E23X2BJ*/ 00590000
*/*               constants provided in the macro.  To have  @E23X2BJ*/ 00600000
*/*               the assembler constants appear in the      @E23X2BJ*/ 00610000
*/*               programs storage, two things are required: @E23X2BJ*/ 00620000
*/*                  1) The CSECT statement must be active   @E23X2BJ*/ 00630000
*/*               prior to the invocation of the macro.      @E23X2BJ*/ 00640000
*/*                  2) DECLARE=YES needs to be specified on @E23X2BJ*/ 00650000
*/*               the macro invocation.                      @E23X2BJ*/ 00660000
*/*                                                                  */ 00670000
*/*01* CHANGE-ACTIVITY =                                             */ 00680000
*/*                                                                  */ 00690000
*/*  Created for TSO/E Version 2.1.0                         @E21D2C2*/ 00700000
*/*                                                                  */ 00710000
*/*  Added STORFL and STORFL_MASK                            @PEI0188*/ 00720000
*/*                                                                  */ 00730000
*/*  Added NOLOADDD and NOLOADDD_MASK                        @DEI0043*/ 00740000
*/*                                                                  */ 00750000
*/*  Added NOMSGWTO and NOMSGWTO_MASK                @PEI0691/PFZ0302*/ 00760000
*/*  Added NOMSGIO  and NOMSGIO_MASK                 @PEI0691/PFZ0302*/ 00770000
*/*                                                                  */ 00780000
*/* PG10120 Removed code for E22D2E9 change flag.            @PG10120*/ 00790000
*/*                                                                  */ 00800000
*/*  E22D2D1 - Added TSOXMSG flag for NLS support            @E22D2D1*/ 00810000
*/*                                                                  */ 00820000
*/* DG10017 - Change the language field and add a constant for the   */ 00830000
*/*           version.                                       @DG10017*/ 00840000
*/*                                                                  */ 00850000
*/*  E23X2BJ - For DECLARE=YES, move constants before the    @E23X2BJ*/ 00860000
*/*            DSECT statement.                              @E23X2BJ*/ 00870000
*/*                                                                  */ 00880000
*/* FLAG REASON   RELEASE DATE     ORIGIN                        @L1A*/ 00890000
*/* ---- ------   ------- -------- ------                        @L1A*/ 00900000
*/* $L1= MG10733  HTE7760 071023   WSY1:  Added ROSTORFL and     @L1A*/ 00910000
*/*            ROSTORFL_MASK to support the read-only version    @L1A*/ 00920000
*/*            of the REXX STORAGE function.                     @L1A*/ 00930000
*/* $P1= MG12348  HTE7760 090312   MPK: External classification  @P1A*/ 00950000
*/*                                                                  */ 00951000
*/***END OF SPECIFICATIONS********************************************/ 00960000
*%GOTO PLAS_IRXPARMB;                                                   00961000
         EJECT                                                          00970000
         AIF   ('&DECLARE' EQ 'YES').NODSECT If DECLARE=YES  @E23X2BJ   00980000
.*                             is specified, then include    @E23X2BJ   00990000
.*                             constants before the DSECT    @E23X2BJ   01000000
          AGO   .DSECTNM       Otherwise do a DSECT          @E23X2BJ   01010000
.NODSECT  ANOP                 Provide early constants       @E23X2BJ   01020000
*                              Provide Parameter Block       @E23X2BJ   01030000
*                              Constants                     @E23X2BJ   01040000
         SPACE   1                                           @E23X2BJ   01050000
*/********************************************************************/ 01060000
*/*                                                          @E23X2BJ*/ 01070000
*/*  VALID_PARMBLOCK_ID - REXX Parameter Block Identifier    @E23X2BJ*/ 01080000
*/*                                                          @E23X2BJ*/ 01090000
*/********************************************************************/ 01100000
         SPACE   1                                           @E23X2BJ   01110000
VALID_PARMBLOCK_ID DC  CL8'IRXPARMS'  Valid  PARMBLOCK       @E23X2BJ   01120000
*                                     character id           @E23X2BJ   01130000
         SPACE   1                                           @E23X2BJ   01140000
*/********************************************************************/ 01150000
*/*                                                          @E23X2BJ*/ 01160000
*/*  VALID_PARMBLOCK_VERSION - REXX Parameter Block Version  @E23X2BJ*/ 01170000
*/*                                                          @E23X2BJ*/ 01180000
*/********************************************************************/ 01190000
         SPACE   1                                           @E23X2BJ   01200000
VALID_PARMBLOCK_VERSION DC CL4'0200'   Current PARMBLOCK     @E23X2BJ   01210000
*                                      version               @E23X2BJ   01220000
.DSECTNM  ANOP                 Provide DSECT statement       @E23X2BJ   01230000
*/********************************************************************/ 01240000
*/*                                                                  */ 01250000
*/*  PARMBLOCK - REXX Parameter Block                                */ 01260000
*/*                                                                  */ 01270000
*/********************************************************************/ 01280000
         SPACE                                                          01290000
PARMBLOCK DSECT                        REXX Parameter Block             01300000
         DS  0D                        Align on doubleword boundary     01310000
PARMBLOCK_ID       DS  CL8             PARMBLOCK character id           01320000
*                                      'IRXPARMS'                       01330000
PARMBLOCK_VERSION  DS  CL4             Version number in EBCDIC         01340000
PARMBLOCK_LANGUAGE DS  CL3             Language identifier    @DG10017  01350000
*                  DS  CL1             Reserved               @DG10017  01360000
PARMBLOCK_MODNAMET DS  A               Address of the MODNAMET          01370000
PARMBLOCK_SUBCOMTB DS  A               Address of the SUBCOMTB header   01380000
PARMBLOCK_PACKTB   DS  A               Address of the PACKTB header     01390000
PARMBLOCK_PARSETOK DS  CL8             Parse source token               01400000
PARMBLOCK_FLAGS    DS  0BL4            Flags                            01410000
PARMBLOCK_FLAGS1   DS  B               First byte of flags              01420000
TSOFL              EQU X'80'           Integrate with TSO flag          01430000
*                  EQU X'40'           Reserved Flag                    01440000
CMDSOFL            EQU X'20'           Command search order flag        01450000
FUNCSOFL           EQU X'10'           Function/subroutine search order 01460000
*                                      flag                             01470000
NOSTKFL            EQU X'08'           No data stack flag               01480000
NOREADFL           EQU X'04'           No read flag                     01490000
NOWRTFL            EQU X'02'           No write flag                    01500000
NEWSTKFL           EQU X'01'           New data stack flag              01510000
PARMBLOCK_FLAGS2   DS  B               Second byte of flags             01520000
USERPKFL           EQU X'80'           User external function package   01530000
*                                      flag                             01540000
LOCPKFL            EQU X'40'           Local external function package  01550000
*                                      flag                             01560000
SYSPKFL            EQU X'20'           System external function package 01570000
*                                      flag                             01580000
NEWSCFL            EQU X'10'           New subcommand table flag        01590000
CLOSEXFL           EQU X'08'           Close exec data set flag         01600000
NOESTAE            EQU X'04'           No recovery ESTAE flag           01610000
RENTRANT           EQU X'02'           Reentrant REXX environment flag  01620000
NOPMSGS            EQU X'01'           No primary messages flag         01630000
PARMBLOCK_FLAGS3   DS  B               Third byte of flags              01640000
ALTMSGS            EQU X'80'           Issue alternate messages flag    01650000
SPSHARE            EQU X'40'           Subpool storage is shared flag   01660000
STORFL             EQU X'20'           STORAGE function flag   @PEI0279 01670000
NOLOADDD           EQU X'10'           Do not load from        @DEI0043 01680000
*                                      the system-level        @DEI0043 01690000
*                                      EXEC DDNAME.            @DEI0043 01700000
NOMSGWTO           EQU X'08'           MVS, do not issue error messages 01710000
*                                      with the WTO service    @PEI0691 01720000
NOMSGIO            EQU X'04'           MVS, do not issue error messages 01730000
*                                      with I/O to the OUTDD   @PEI0691 01740000
ROSTORFL           EQU X'02'           Read only STORAGE function. The  01750000
*                                      STORAGE function can read but    01760000
*                                      not change storage. (This flag   01770000
*                                      is meaningful only if STORFL is  01780000
*                                      OFF so that the STORAGE function 01790000
*                                      itself is allowed.)         @L1A 01800000
                   DS  B               Reserved                         01810000
PARMBLOCK_MASKS    DS  0BL4            Masks for flags                  01820000
PARMBLOCK_MASKS1   DS  B               First byte of masks              01830000
TSOFL_MASK         EQU X'80'           Integrate with TSO flag mask     01840000
*                  EQU X'40'           Reserved flag mask               01850000
CMDSOFL_MASK       EQU X'20'           Command search order flag mask   01860000
FUNCSOFL_MASK      EQU X'10'           Function/subroutine search order 01870000
*                                      flag mask                        01880000
NOSTKFL_MASK       EQU X'08'           No data stack flag mask          01890000
NOREADFL_MASK      EQU X'04'           No read flag mask                01900000
NOWRTFL_MASK       EQU X'02'           No write flag mask               01910000
NEWSTKFL_MASK      EQU X'01'           New data stack flag mask         01920000
PARMBLOCK_MASKS2   DS  B               Second byte of masks             01930000
USERPKFL_MASK      EQU X'80'           User external function package   01940000
*                                      flag mask                        01950000
LOCPKFL_MASK       EQU X'40'           Local external function package  01960000
*                                      flag mask                        01970000
SYSPKFL_MASK       EQU X'20'           System external function package 01980000
*                                      flag mask                        01990000
NEWSCFL_MASK       EQU X'10'           New subcommand table flag mask   02000000
CLOSEXFL_MASK      EQU X'08'           Close exec data set flag mask    02010000
NOESTAE_MASK       EQU X'04'           No recovery ESTAE flag mask      02020000
RENTRANT_MASK      EQU X'02'           Reentrant REXX environment flag  02030000
*                                      mask                             02040000
NOPMSGS_MASK       EQU X'01'           No primary messages flag mask    02050000
PARMBLOCK_MASKS3   DS  B               Third byte of masks              02060000
ALTMSGS_MASK       EQU X'80'           Issue alternate messages flag    02070000
*                                      mask                             02080000
SPSHARE_MASK       EQU X'40'           Subpool storage is shared flag   02090000
*                                      mask                             02100000
STORFL_MASK        EQU X'20'           STORAGE function flag   @PEI0279 02110000
*                                      mask                    @PEI0279 02120000
NOLOADDD_MASK      EQU X'10'           Mask for                @DEI0043 02130000
*                                      do not load from        @DEI0043 02140000
*                                      the system-level        @DEI0043 02150000
*                                      EXEC DDNAME.            @DEI0043 02160000
NOMSGWTO_MASK      EQU X'08'           MVS, do not issue error messages 02170000
*                                      with the WTO service mask.       02180000
*                                                              @PEI0691 02190000
NOMSGIO_MASK       EQU X'04'           MVS, do not issue error messages 02200000
*                                      with I/O to the OUTDD mask       02210000
*                                                              @PEI0691 02220000
ROSTORFL_MASK      EQU X'02'           Read only STORAGE mask      @L1A 02230000
                   DS  B               Reserved                         02240000
PARMBLOCK_SUBPOOL  DS  F               Subpool number                   02250000
PARMBLOCK_ADDRSPN  DS  CL8             Name of the address space        02260000
PARMBLOCK_FFFF     DS  CL8             End marker - hex                 02270000
*                                      'FFFFFFFFFFFFFFFF'               02280000
         DS  0D                        Align on doubleword boundary     02290000
         AIF   ('&DECLARE' EQ 'YES').SKIPARMB If DECLARE=YES @E23X2BJ   02300000
.*                             is specified, then these are  @E23X2BJ   02310000
.*                             already included above.       @E23X2BJ   02320000
         SPACE                                                          02330000
*/********************************************************************/ 02340000
*/*                                                                  */ 02350000
*/*  VALID_PARMBLOCK_ID - REXX Parameter Block Identifier            */ 02360000
*/*                                                                  */ 02370000
*/********************************************************************/ 02380000
         SPACE                                                          02390000
VALID_PARMBLOCK_ID DC  CL8'IRXPARMS'   Valid PARMBLOCK character id     02400000
         SPACE                                                          02410000
*/********************************************************************/ 02420000
*/*                                                                  */ 02430000
*/*  VALID_PARMBLOCK_VERSION - REXX Parameter Block Version          */ 02440000
*/*                                                          @DG10017*/ 02450000
*/********************************************************************/ 02460000
         SPACE                                                          02470000
VALID_PARMBLOCK_VERSION DC CL4'0200'   Current PARMBLOCK version        02480000
*                                                            @DG10017   02490000
.SKIPARMB ANOP                                                          02500000
         MEND                                                           02510000
         AGO  .NOPRMGEN                Skip PLAS generated code         02520000
*%PLAS_IRXPARMB: ;                                                      02530000
*GEN;                                                                   02540000
         IRXPARMB DECLARE=NO           Do not declare the PARMBLOCK     02550000
*@ENDGEN;                                                               02560000
*/********************************************************************/ 02561000
*/*                                                                  */ 02820000
*/*  INVOCATION = %INCLUDE SYSLIB(IRXPARMB)                          */ 02830000
*/*                                                                  */ 02840000
*/*           %PARMBSTOR = 'BASED(PARMBPTR)' To base the     @E23X2BJ*/ 02850000
*/*                             PARMBLOCK on PARMBPTR.       @E23X2BJ*/ 02860000
*/*   Note: If %PARMBSTOR is not specified the default is    @E23X2BJ*/ 02870000
*/*         'BASED(ENVBLOCK_PARMBLOCK)'                      @E23X2BJ*/ 02880000
*/*                                                                  */ 02890000
*/********************************************************************/ 02891000
*/********************************************************************/ 03140000
*/*                                                                  */ 03150000
*/*  PARMBLOCK - REXX Parameter Block                                */ 03160000
*/*                                                                  */ 03170000
*/********************************************************************/ 03180000
*@SPACE;                                                                03190000
*%IF PARMBSTOR = '' %THEN           /* If nothing specified  @E23X2BJ*/ 03200000
*   %PLASBASE = 'BASED(ENVBLOCK_PARMBLOCK)'; /*Set Default   @E23X2BJ*/ 03210000
*%ELSE                              /* ELSE something        @E23X2BJ*/ 03220000
*   %PLASBASE = PARMBSTOR;          /* Use it                @E23X2BJ*/ 03230000
*                                                                       03240000
*DECLARE                                                                03250000
*  1 PARMBLOCK PLASBASE BDY(DWORD), /* REXX Parameter  Block @E23X2BJ*/ 03260000
*      2 PARMBLOCK_ID       CHAR(8),   /* PARMBLOCK character id        03270000
*                                         'IRXPARMS'                 */ 03280000
*      2 PARMBLOCK_VERSION  CHAR(4),   /* Version number in EBCDIC   */ 03290000
*      2 PARMBLOCK_LANGUAGE CHAR(3),   /* Language identifier           03300000
*                                                            @DG10017*/ 03310000
*      2 *                  CHAR(1),   /* Reserved           @DG10017*/ 03320000
*      2 PARMBLOCK_MODNAMET PTR(31),   /* Address of the MODNAMET    */ 03330000
*      2 PARMBLOCK_SUBCOMTB PTR(31),   /* Address of the SUBCOMTB       03340000
*                                         header                     */ 03350000
*      2 PARMBLOCK_PACKTB   PTR(31),   /* Address of the PACKTB         03360000
*                                         header                     */ 03370000
*      2 PARMBLOCK_PARSETOK CHAR(8),   /* Parse source token         */ 03380000
*      2 PARMBLOCK_FLAGS    BIT(32),   /* Flags                      */ 03390000
*        3 TSOFL            BIT(1),    /*   Integrate with TSO flag  */ 03400000
*        3 *                BIT(1),    /*   Reserved                 */ 03410000
*        3 CMDSOFL          BIT(1),    /*   Command search order flag*/ 03420000
*        3 FUNCSOFL         BIT(1),    /*   Function/subroutine         03430000
*                                           search order flag        */ 03440000
*        3 NOSTKFL          BIT(1),    /*   No data stack flag       */ 03450000
*        3 NOREADFL         BIT(1),    /*   No read flag             */ 03460000
*        3 NOWRTFL          BIT(1),    /*   No write flag            */ 03470000
*        3 NEWSTKFL         BIT(1),    /*   New data stack flag      */ 03480000
*        3 USERPKFL         BIT(1),    /*   User external function      03490000
*                                           package flag             */ 03500000
*        3 LOCPKFL          BIT(1),    /*   Local external function     03510000
*                                           package flag             */ 03520000
*        3 SYSPKFL          BIT(1),    /*   System external function    03530000
*                                           package flag             */ 03540000
*        3 NEWSCFL          BIT(1),    /*   New subcommand table flag*/ 03550000
*        3 CLOSEXFL         BIT(1),    /*   Close exec data set flag */ 03560000
*        3 NOESTAE          BIT(1),    /*   No recovery ESTAE flag   */ 03570000
*        3 RENTRANT         BIT(1),    /*   Reentrant REXX              03580000
*                                           environment flag         */ 03590000
*        3 NOPMSGS          BIT(1),    /*   No primary messages      */ 03600000
*        3 ALTMSGS          BIT(1),    /*   Issue alternate messages */ 03610000
*        3 SPSHARE          BIT(1),    /*   Subpool storage is shared   03620000
*                                           flag                     */ 03630000
*        3 STORFL           BIT(1),    /*   STORAGE function flag       03640000
*                                                            @PEI0279*/ 03650000
*        3 NOLOADDD         BIT(1),    /*   Do not load from            03660000
*                                           the system-level            03670000
*                                           EXEC DDNAME.     @DEI0043*/ 03680000
*        3 NOMSGWTO         BIT(1),    /*   MVS, do not issue error     03690000
*                                           messages with the WTO       03700000
*                                           service.         @PEI0691*/ 03710000
*        3 NOMSGIO          BIT(1),    /*   MVS, do not issue error     03720000
*                                           messages with I/O to the    03730000
*                                           OUTDD.           @PEI0691*/ 03740000
*        3 ROSTORFL         BIT(1),    /*   Read only STORAGE function. 03750000
*                                           The STORAGE function can    03760000
*                                           read but not change         03770000
*                                           storage.  (This flag is     03780000
*                                           meaningful only if STORFL   03790000
*                                           is OFF so that the STORAGE  03800000
*                                           function itself is          03810000
*                                           allowed.)            @L1A*/ 03820000
*        3 *                BIT(9),    /*   Reserved             @L1C*/ 03830000
*      2 PARMBLOCK_MASKS    BIT(32),   /* Masks for flags            */ 03840000
*        3 TSOFL_MASK       BIT(1),    /*   Integrate with TSO flag     03850000
*                                           mask                     */ 03860000
*        3 *                BIT(1),    /*   Reserved Mask            */ 03870000
*        3 CMDSOFL_MASK     BIT(1),    /*   Command search order flag   03880000
*                                           mask                     */ 03890000
*        3 FUNCSOFL_MASK    BIT(1),    /*   Function/subroutine         03900000
*                                           search order flag mask   */ 03910000
*        3 NOSTKFL_MASK     BIT(1),    /*   No data stack flag mask  */ 03920000
*        3 NOREADFL_MASK    BIT(1),    /*   No read flag mask        */ 03930000
*        3 NOWRTFL_MASK     BIT(1),    /*   No write flag mask       */ 03940000
*        3 NEWSTKFL_MASK    BIT(1),    /*   New data stack flag mask */ 03950000
*        3 USERPKFL_MASK    BIT(1),    /*   User external function      03960000
*                                           package flag mask        */ 03970000
*        3 LOCPKFL_MASK     BIT(1),    /*   Local external function     03980000
*                                           package flag mask        */ 03990000
*        3 SYSPKFL_MASK     BIT(1),    /*   System external function    04000000
*                                           package flag mask        */ 04010000
*        3 NEWSCFL_MASK     BIT(1),    /*   New subcommand table flag   04020000
*                                           mask                     */ 04030000
*        3 CLOSEXFL_MASK    BIT(1),    /*   Close exec data set flag    04040000
*                                           mask                     */ 04050000
*        3 NOESTAE_MASK     BIT(1),    /*   No recovery ESTAE flag      04060000
*                                           mask                     */ 04070000
*        3 RENTRANT_MASK    BIT(1),    /*   Reentrant REXX              04080000
*                                           environment flag mask    */ 04090000
*        3 NOPMSGS_MASK     BIT(1),    /*   No primary messages flag    04100000
*                                           mask                     */ 04110000
*        3 ALTMSGS_MASK     BIT(1),    /*   Issue alternate messages    04120000
*                                           flag mask                */ 04130000
*        3 SPSHARE_MASK     BIT(1),    /*   Subpool storage is shared   04140000
*                                           flag mask                */ 04150000
*        3 STORFL_MASK      BIT(1),    /*   STORAGE function flag       04160000
*                                           mask             @PEI0279*/ 04170000
*        3 NOLOADDD_MASK    BIT(1),    /*   Mask for                    04180000
*                                           do not load from            04190000
*                                           the system-level            04200000
*                                           EXEC DDNAME.     @DEI0043*/ 04210000
*        3 NOMSGWTO_MASK    BIT(1),    /*   MVS, do not issue error     04220000
*                                           messages with the WTO       04230000
*                                           service mask.    @PEI0691*/ 04240000
*        3 NOMSGIO_MASK     BIT(1),    /*   MVS, do not issue error     04250000
*                                           messages with I/O to the    04260000
*                                           OUTDD mask.      @PEI0691*/ 04270000
*        3 ROSTORFL_MASK    BIT(1),    /*   Read only STORAGE mask      04280000
*                                                                @L1A*/ 04290000
*        3 *                BIT(9),    /*   Reserved             @L1C*/ 04300000
*      2 PARMBLOCK_SUBPOOL  FIXED(32), /* Subpool number             */ 04310000
*      2 PARMBLOCK_ADDRSPN  CHAR(8),   /* Name of the address space  */ 04320000
*      2 PARMBLOCK_FFFF     CHAR(8);   /* End marker - hex              04330000
*                                         'FFFFFFFFFFFFFFFF' @E23X2BJ*/ 04340000
*@SPACE;                                                                04350000
*/********************************************************************/ 04360000
*/*                                                                  */ 04370000
*/*  VALID_PARMBLOCK_ID - REXX Parameter Block Identifier            */ 04380000
*/*                                                                  */ 04390000
*/********************************************************************/ 04400000
*@SPACE;                                                                04410000
*DCL VALID_PARMBLOCK_ID CHAR(8) CONSTANT('IRXPARMS'); /* Valid          04420000
*                                      PARMBLOCK character id        */ 04430000
*@SPACE;                                                                04440000
*/********************************************************************/ 04450000
*/*                                                                  */ 04460000
*/*  VALID_PARMBLOCK_VERSION - REXX Parameter Block Version          */ 04470000
*/*                                                          @DG10017*/ 04480000
*/********************************************************************/ 04490000
*@SPACE;                                                                04500000
*DCL VALID_PARMBLOCK_VERSION CHAR(4) CONSTANT('0200'); /* Current       04510000
*                                      PARMBLOCK version     @DG10017*/ 04520000
*   %GOTO IRXPARMB_CONT;            /* Skip assembler code   @E23X2BJ*/ 04530000
.NOPRMGEN ANOP ,                Skip PLAS generated code     @E23X2BJ   04540000
*%IRXPARMB_CONT:;                   /* Skip assembler code   @E23X2BJ*/ 04550000
