*% /*                                                                   00020002
         MACRO                                                          00100000
         IRXWORKB                                                       00150001
.*/ IRXWORKBL1 : ;                                                      00160002
*/***START OF SPECIFICATIONS******************************************/ 00200000
*/*                                                                  */ 00250000
*/*01* PROPRIETARY STATEMENT=                                        */ 00550000
*/***PROPRIETARY_STATEMENT********************************************/ 00600000
*/*                                                                  */ 00650000
*/*                                                                  */ 00700000
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00750000
*/* 5650-ZOS COPYRIGHT IBM CORP. 1988, 2015                          */ 00850000
*/*                                                                  */ 00950000
*/* STATUS= HTE77A0                                                  */ 01000000
*/*                                                                  */ 01050000
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 01100000
*/*                                                                  */ 01150000
*/*01* EXTERNAL CLASSIFICATION: PI                                   */ 01160000
*/*01* END OF EXTERNAL CLASSIFICATION:                               */ 01170000
*/*                                                                  */ 01180000
*/*01* Macro Name: IRXWORKB                                          */ 01190000
*/*                                                                  */ 01191000
*/*01* Descriptive Name: REXX Work Block Extension                   */ 01192000
*/*                                                                  */ 01193000
*/*01* DSECT Name: WORKBLOK_EXT                                      */ 01194000
*/*                                                                  */ 01195000
*/*01* Component:  TSO/E REXX (28508)                                */ 01196000
*/*                                                                  */ 01197000
*/*01* Eye-Catcher: None                                             */ 01198000
*/*02*  Offset: N/A                                                  */ 01199000
*/*02*  Length: N/A                                                  */ 01199100
*/*                                                                  */ 01199200
*/*01* Storage Attributes:                                           */ 01199300
*/*02*  Subpool: 78                                                  */ 01199400
*/*02*  Key: 8                                                       */ 01199500
*/*02*  Residency:                                                   */ 01199600
*/*02*  Main Storage:                                                */ 01199700
*/*02*  Auxiliary Storage:                                           */ 01199800
*/*02*  Virtual Storage:                                             */ 01199900
*/*                                                                  */ 01200000
*/*01* Size: 32 bytes                                                */ 01201000
*/*                                                                  */ 01202000
*/*01* Created by: IRXEXEC                                           */ 01203000
*/*                                                                  */ 01204000
*/*01* Pointed to by: ENVBLOCK_WORKBLOK_EXT field of the ENVBLOCK    */ 01205000
*/*                                                                  */ 01206000
*/*01* Serialization: None                                           */ 01207000
*/*                                                                  */ 01208000
*/*01* Function: The REXX Work Block Extension (WORKBLOK_EXT)        */ 01210000
*/*              contains the parameters passed to IRXEXEC, the      */ 01250000
*/*              address of the PARSE SOURCE string, a fullword that */ 01300000
*/*              may be used by a compiler's runtime processor, etc. */ 01350000
*/*                                                                  */ 01400000
*/*01* Method of Access:                                             */ 01410000
*/*02*  ASM: USING on DSECT WORKBLOK_EXT                             */ 01420000
*/*                                                                  */ 01430000
*/*02*  PL/X: %INCLUDE SYSLIB(IRXWORKB)                              */ 01440000
*/*                                                                  */ 01441000
*/*01* CHANGE-ACTIVITY =                                             */ 02100000
*/*                                                                  */ 02150000
*/*  Created for TSO/E Version 2.1.0                         @E21D2C2*/ 02200000
*/*                                                                  */ 02250000
*/*  Added WORKEXT_CPPLPTR field to the WORKBLOK_EXT.  Moved @PEI0853*/ 02300000
*/*  WORKEXT_USERFIELD after WORKEXT_WORKAREA.               @PEI0853*/ 02350000
*/*                                                                  */ 02400000
*/*  TSO/E 2.3.1 support of REXX Compiler                    @E23X2BJ*/ 02450000
*/*                                                                  */ 02500000
*/***END OF SPECIFICATIONS********************************************/ 02550000
*%GOTO PLAS_IRXWORKB;                                                   02560000
         EJECT                                                          02600000
*/********************************************************************/ 02650000
*/*                                                                  */ 02700000
*/*  WORKBLOK_EXT - REXX Work Block Extension                        */ 02750000
*/*                                                                  */ 02800000
*/********************************************************************/ 02850000
         SPACE                                                          02900000
WORKBLOK_EXT DSECT                     REXX Work Block Extension        02950000
         DS  0D                        Align on doubleword boundary     03000000
WORKEXT_EXECBLK   DS  A                Address of the EXECBLK           03050000
WORKEXT_ARGTABLE  DS  A                Address of the first ARGTABLE    03100000
*                                      entry                            03150000
WORKEXT_FLAGS     DS  0BL4             Flags describing the REXX exec   03200000
WORKEXT_FLAGS1    DS  B                First byte of flags              03250000
WORKEXT_COMMAND   EQU X'80'            Exec is a command                03300000
WORKEXT_FUNCTION  EQU X'40'            Exec is a function               03350000
WORKEXT_SUBROUTINE EQU X'20'           Exec is a subroutine             03400000
                  DS  BL3              Reserved                         03450000
WORKEXT_INSTBLK   DS  A                Address of the INSTBLK header    03500000
WORKEXT_CPPLPTR   DS  A                Address of the CPPL     @PEI0853 03550000
WORKEXT_EVALBLOCK DS  A                Address of the REXX user         03600000
*                                      EVALBLOCK                        03650000
WORKEXT_WORKAREA  DS  A                Address of the workarea header   03700000
*                                      containing the address and       03750000
*                                      length of a workarea containing  03800000
*                                      the storage to be used for the   03850000
*                                      new WORKBLOK and WORKBLOK_EXT    03900000
WORKEXT_USERFIELD DS  A                Address of a user field @PEI0853 03950000
WORKEXT_RTPROC        DS  F            A fullword for use by  @E23X2BJ  04000000
*                                      a Compilers Runtime    @E23X2BJ  04050000
*                                      Processor              @E23X2BJ  04100000
WORKEXT_SOURCE_ADDRESS DS  A           The address of the     @E23X2BJ  04150000
*                                      PARSE SOURCE string    @E23X2BJ  04200000
WORKEXT_SOURCE_LENGTH DS  F            The length of the      @E23X2BJ  04250000
*                                      PARSE SOURCE string    @E23X2BJ  04300000
                      DS  F            Reserved               @E23X2BJ  04350000
         DS  0D                        Align on doubleword boundary     04400000
         MEND                                                           04450000
 %PLAS_IRXWORKB: ;                                                      04500000
 /********************************************************************/ 06350000
 /*                                                                  */ 06400000
 /*  WORKBLOK_EXT - REXX Work Block Extension                        */ 06450000
 /*                                                                  */ 06500000
 /********************************************************************/ 06550000
 @SPACE;                                                                06600000
 DCL 1 WORKBLOK_EXT BASED(ENVBLOCK_WORKBLOK_EXT) BDY(DWORD), /* The     06650000
                                       REXX WORKBLOK extension       */ 06700000
       2 WORKEXT_EXECBLK      PTR(31), /* Address of the EXECBLK     */ 06750000
       2 WORKEXT_ARGTABLE     PTR(31), /* Address of the first          06800000
                                       ARGTABLE entry                */ 06850000
       2 WORKEXT_FLAGS        BIT(32), /* Flags describing the REXX     06900000
                                       exec                          */ 06950000
         3 WORKEXT_COMMAND    BIT(1),  /* Exec is a command          */ 07000000
         3 WORKEXT_FUNCTION   BIT(1),  /* Exec is a function         */ 07050000
         3 WORKEXT_SUBROUTINE BIT(1),  /* Exec is a subroutine       */ 07100000
         3 *                  BIT(29), /* Reserved                   */ 07150000
       2 WORKEXT_INSTBLK      PTR(31), /* Address of the INSTBLK        07200000
                                       header                        */ 07250000
       2 WORKEXT_CPPLPTR      PTR(31), /* Address of the CPPL           07300000
                                                             @PEI0853*/ 07350000
       2 WORKEXT_EVALBLOCK    PTR(31), /* Address of the REXX user      07400000
                                       EVALBLOCK                     */ 07450000
       2 WORKEXT_WORKAREA     PTR(31), /* Address of the workarea       07500000
                                       header containing the address    07550000
                                       and length of a workarea         07600000
                                       containing the storage to be     07650000
                                       used for the new WORKBLOK and    07700000
                                       WORKBLOK_EXT                  */ 07750000
       2 WORKEXT_USERFIELD    PTR(31), /* Address of a user field       07800000
                                                             @PEI0853*/ 07850000
       2 WORKEXT_RTPROC       PTR(31), /* A fullword for use by         07900000
                                     a Compiler's Runtime Processor     07950000
                                     Processor             @E23X2BJ*/   08000000
       2 WORKEXT_SOURCE_ADDRESS PTR(31), /* The address of the PARSE    08050000
                                     SOURCE string         @E23X2BJ*/   08100000
       2 WORKEXT_SOURCE_LENGTH FIXED(31),/* The length of the PARSE     08150000
                                     SOURCE string         @E23X2BJ*/   08200000
       2 *                     FIXED(31); /* Maintain doubleword        08250000
                                     boundary              @E23X2BJ*/   08300000
