*                                                                       00001000
* %DCL ISGE51CN_INCLUDED CHAR EXT;                                      00002000
* %DEACTIVATE ISGE51CN_INCLUDED;                                        00003000
* %IF ISGE51CN_INCLUDED = '' %THEN                                      00004000
* %DO;                                                                  00005000
*/* Macro made bi-lingual on 13023. CBGEN compile date 12258         */ 00006000
*% /*                                                                   00007000
         MACRO                                                          00008000
         ISGE51CN &DSECT=YES,&LIST=YES,&TITLE=YES,&ENF51C=YES           00009000
         GBLC  &ISGE51CN_INCLUDED                                       00010000
         GBLC  &ZCBPRINT                                                00011000
&ISGE51CN_INCLUDED SETC 'YES'                                           00012000
         AIF   ('&LIST' EQ 'NONE').P0                                   00013000
         AIF   ('&TITLE' EQ 'NO').P5                                    00014000
 TITLE   'ISGE51CN  - Global and Local Contention Data               '  00015000
.P5      ANOP                                                           00016000
**/ ISGE51CN_1:;                                                        00017000
*/* START OF SPECIFICATIONS ******************************************* 00018000
*                                                                       00019000
*01* MACRO NAME: ISGE51CN                                               00020000
*                                                                       00021000
*01* DESCRIPTIVE NAME:  Global and Local Contention Data                00022000
*                       (ENF Event Code 51)                             00023000
*                                                                       00024000
*02*  ACRONYM:  ENF51C                                                  00025000
*                                                                       00026000
*01* PROPRIETARY STATEMENT=                                             00027000
***PROPRIETARY_STATEMENT*********************************************** 00028000
*                                                                       00029000
* LICENSED MATERIALS - PROPERTY OF IBM                                  00030000
* 5650-ZOS COPYRIGHT IBM CORP. 1996,2013                                00031000
*                                                                       00032000
* STATUS= HBB7790                                                       00033000
*                                                                       00034000
***END_OF_PROPRIETARY_STATEMENT**************************************** 00035000
*                                                                       00036000
*01* FUNCTION:  Maps global and local contention data provided          00037000
*               by ENF event code 51                                    00038000
*                                                                       00039000
*01* EXTERNAL CLASSIFICATION: PI                                        00040000
*01* END OF EXTERNAL CLASSIFICATION:                                    00041000
*                                                                       00042000
*01* DSECT NAME:    ENF51C - Global and local contention data           00043000
*                                                                       00044000
*01* COMPONENT:    Global Resource Serialization (SCSDS)                00045000
*                                                                       00046000
*01* EYE-CATCHER:    ENF51C                                             00047000
*02*    OFFSET:  0                                                      00048000
*02*    LENGTH:  6 bytes                                                00049000
*                                                                       00050000
*01* STORAGE ATTRIBUTES:                                                00051000
*02*    SUBPOOL:  241                                                   00052000
*02*    KEY:  0                                                         00053000
*02*    RESIDENCY:  ANY                                                 00054000
*02*    MAIN STORAGE:  No                                               00055000
*02*    AUXILIARY STORAGE:  Yes                                         00056000
*02*    VIRTUAL STORAGE:  Yes                                           00057000
*02*    DATA SPACE:  No                                                 00058000
*                                                                       00059000
*01* SIZE: Variable                                                     00060000
*            ENF51C -- X'0030' bytes                                    00061000
*                      + length of contention data                      00062000
*                                                                       00063000
*01* CREATED BY:    GRS or ENF                                          00064000
*                                                                       00065000
*01* POINTED TO BY:                                                     00066000
*      First word of the address list pointed to by register 1 on       00067000
*        entry to an ENF listen exit                                    00068000
*                                                                       00069000
*01* SERIALIZATION:    None                                             00070000
*                                                                       00071000
**INVOCATION*********************************************************** 00072000
*                                                                       00073000
*01* METHOD OF ACCESS:                                                  00074000
*                                                                       00075000
*02*  ASM:                                                              00076000
*      ISGE51CN                                                         00077000
*           DSECT=YES!NO  -- Request DSECT definition                   00078000
*           ENF51C=YES!NO!COND -- Request record mapping                00079000
*                            USING on ENF51C                            00080000
*     Default: DSECT=YES,ENF51C=YES                                     00081000
*     Notes: name=YES  => expand                                        00082000
*            name=NO   => do not expand                                 00083000
*            name=COND => expand only if DSECT=YES                      00084000
*                                                                       00085000
*02*     PL/X:                                                          00086000
*          %DCL E51CNATTR CHAR EXT                                      00087000
*          %E51CNATTR='BASED' or 'BDY(WORD)' (defaults to 'BASED')      00088000
*          %INCLUDE SYSLIB(ISGE51CN)                                    00089000
*                                                                       00090000
*          Alternatively (internal only), use ISGZINCL requesting       00091000
*          ENF51C.                                                      00092000
*                                                                       00093000
*********************************************************************** 00094000
*01* DELETED BY:    ENF                                                 00095000
*                                                                       00096000
*01* NOTES:                                                             00097000
*      - The ENF51C parameter list consists of a fixed section          00098000
*        followed by variable length contention data.  The              00099000
*        contention data is in the same form as the output of           00100000
*        the GQSCAN macro, i.e., a RIB and set of RIBEs (mapped         00101000
*        by ISGRIB).  However this contention data is not included @P3C 00102000
*        for recovery events (where the fourth byte of the         @P3C 00103000
*        qualifier is 03x).                                        @P3C 00104000
*                                                                       00105000
*        The QMASK used in ENFREQ ACTION=LISTEN is an important    @P3A 00106000
*        consideration with regard to the QUAL constants.  Three   @P3A 00107000
*        of the four qualifier bytes denote separate attributes    @P3A 00108000
*        and so the QMASK should denote the specific bytes the     @P3A 00109000
*        listener is interested in filtering upon.  The following  @P3A 00110000
*        lists the qualifier attributes:                           @P3A 00111000
*                                                                       00112000
*        BYTE1: 01x Contention event                               @P3A 00113000
*               02x RNL event (see ISGE51RN)                       @P3A 00114000
*        BYTE2: currently unused                                   @P3A 00115000
*        BYTE3: 00x "normal contention" (not "waitless")           @P3A 00116000
*               01x "waitless contention"                          @02C 00117000
*        BYTE4: 01x Local contention                               @P3A 00118000
*               02x Global contention                              @P3A 00119000
*               03x Recovery event                                 @P3A 00120000
*                                                                       00121000
*        For example if a listener interested in contention events @P3A 00122000
*        regardless of scope, BYTE4 should not be specified on     @P3A 00123000
*        QMASK.  As another example, a listener interested in      @P3A 00124000
*        only "normal" contention events (not RET=USE or           @02C 00125000
*        RET=CHNG type ENQs) should specify BYTE3 on QMASK and     @02C 00126000
*        use a QUAL constant that has a value of 00x for the       @02C 00127000
*        third byte.  Note that if any qualifier-based filtering   @02C 00128000
*        is done, BYTE1 should be specified on QMASK with a QUAL   @02C 00129000
*        constant that has a value of 01x to avoid confusion with  @02C 00130000
*        RNL events (see ISGE51RN).                                @02C 00131000
*                                                                       00132000
*      - The flags in the RIBSCOPE byte of the RIB portion of the       00133000
*        contention data indicate whether the contention described      00134000
*        by this data area is global or local.                          00135000
*                                                                       00136000
*      - To establish a database of contention information, the         00137000
*        contention monitor should use the following protocol:          00138000
*                                                                       00139000
*        1. Establish an ENF listen exit.                               00140000
*        2. Record a time stamp on return from ENF.                     00141000
*        3. Issue a GQSCAN for all resources of interest with           00142000
*           WAITCNT=1 to receive information about all resources        00143000
*           in contention.  Prime the database with the GQSCAN          00144000
*           output.                                                     00145000
*        4. Apply to the database any contention notifications          00146000
*           received by the listen exit with timestamps more            00147000
*           recent than the time recorded in step 2.                    00148000
*                                                                       00149000
*      - If the ENF51C_SYSTEM_FAILURE flag is set, the system      @01A 00150000
*        identified by the ENF51C_FAILED_SYSTEM field has failed.  @01A 00151000
*        If the ENF listener is maintaining a database of          @01A 00152000
*        contention information, it must be reinitialized as       @01A 00153000
*        described above.  Note that GRS may not issue this signal @01A 00154000
*        for all system failures.  The signal is issued only when  @01A 00155000
*        GRS cannot determine the effect of the system failure on  @01A 00156000
*        pre-existing contention.                                  @01A 00157000
*                                                                       00158000
*      - If the ENF51C_SYSTEM_ERROR flag is set, contention        @01A 00159000
*        information has been lost due to a system error:          @01A 00160000
*        - In ring mode, contention monitors on the system where   @01A 00161000
*          the failure occurred will receive no further            @01A 00162000
*          contention signals.  Contention information relating to @01A 00163000
*          that system will still be available via ENF signals     @01A 00164000
*          on the other systems in the ring.  The signal is sent   @01A 00165000
*          to listeners on the affected system only.               @01A 00166000
*        - In star mode, no further contention information for the @01A 00167000
*          system where the error occurred will be available via   @01A 00168000
*          ENF signals on any system in the GRS complex.  Global   @01A 00169000
*          resource contention data is not valid on any system.    @01A 00170000
*          Local resource contention data remains valid on the     @01A 00171000
*          unaffected systems.  The signal is sent to listeners on @01A 00172000
*          all systems in the sysplex.                             @01A 00173000
*                                                                       00174000
*        The CVTGRSST field contains these flags that describe the @01A 00175000
*        availability of ENF contention data on each system        @01A 00176000
*        following this error:                                     @01A 00177000
*        - CVTE51GN:  When set, global resource contention data is @01A 00178000
*          not available.  ENF 51 listeners will receive signals   @01A 00179000
*          for global resource contention, but the data will be    @01A 00180000
*          incomplete.                                             @01A 00181000
*        - CVTE51LN:  When set, local resource contention data is  @01A 00182000
*          not available.  ENF 51 listeners will not receive       @01A 00183000
*          signals for local resource contention.                  @01A 00184000
*                                                                       00185000
*      - If the ENF51C_SYSTEM_ERROR_CLEARED flag is set, Global    @P2C 00186000
*        resource contention data is once again valid on all       @P2C 00187000
*        systems.  This signal is sent to listeners on all systems @P2C 00188000
*        in star mode only.  (In ring mode, the other systems were @P2C 00189000
*        not affected by the original error.)                      @P2C 00190000
*                                                                       00191000
*02*     RESTRICTIONS:  None                                            00192000
*                                                                       00193000
*02*     DEPENDENCIES:  None                                            00194000
*                                                                       00195000
*01* DISTRIBUTION LIBRARY:    AMACLIB                                   00196000
*                                                                       00197000
*01* CHANGE ACTIVITY:                                                   00198000
*                                                                       00199000
*    $L0=GRS32CBG JBB6602 951026 PDBN:  GRS star CBGEN                  00200000
*    $L1=GRS32    JBB6602 951026 PDBN:  GRS star                        00201000
*    $L2=GRS32    JBB6602 951130 PDBN:  GRS star                        00202000
*    $01=OW21192  JBB6602 960531 PDBN:  Server/system failure           00203000
*    $P1=ME03930  HBB7730 050808 PDCJ:  Fix cpyright                    00204000
*    $P2=ME04401  HBB7730 050921 PDBC:  doc update                      00205000
*    $L3=GRSELF51 HBB7760 080501 PDBC:  ENF Listener Filter             00206000
*       =ME14054  HBB7760 080718 PDBC:  Fix prop statement              00207000
*    $P3=ME14222  HBB7760 080828 PDBC:  Comment updates                 00208000
*    $02=OA31127  HBB7760 091105 PDBC:  RET=CHNG contention             00209000
*    $P4=ME21844  HBB7790 110602 PDFY:  Count of contention events      00210000
*                                                                       00211000
*** Change Summary **************************************************** 00212000
* Created for GRS star mode support.                               @L1A 00213000
* Changed contention indicators to indicate only                        00214000
*   contention/no contention vs. contention start/change/end       @L2A 00215000
* Add fields to report system failure and system errors.  TRSQ for      00216000
*   PSD0933.                                                       @01A 00217000
*                                                                       00218000
*** END OF SPECIFICATIONS ********************************************/ 00219000
*% /*                                                                   00220000
.P0      ANOP                                                           00221000
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 00222000
         AIF   ('&LIST' EQ 'YES').P2                                    00223000
.P1      ANOP                                                           00224000
         PUSH  PRINT                                                    00225000
         PRINT OFF                                                      00226000
.P2      ANOP                                                           00227000
         AIF   ('&ENF51C' EQ 'NO').L0002                                00228000
         AIF   ('&DSECT' EQ 'YES').L0003                                00229000
         AIF   ('&ENF51C' NE 'YES').L0002                               00230000
ENF51C   DS    0D        Contention data                                00231000
         AGO   .L0004                                                   00232000
.L0003   ANOP                                                           00233000
ENF51C   DSECT           Contention data                                00234000
.L0004   ANOP                                                           00235000
ENF51C_HEADER DS CL16    Header information                             00236000
         ORG   ENF51C_HEADER                                            00237000
ENF51CID DS    CL6       Control block identifier 'ENF51C'              00238000
ENF51CVERS DS  H         Version number. Current version is            *00239000
                         ENF51CCVER.                                    00240000
ENF51CLEN DS   F         Length of ENF51C control block, including the *00241000
                         appended contention data beginning at         *00242000
                         ENF51C_RIB                                     00243000
         DS    CL4       Reserved                                       00244000
ENF51C_CONTENTION_DATA DS CL32 Contention data                          00245000
         ORG   ENF51C_CONTENTION_DATA                                   00246000
ENF51C_FLAGS DS B        Event description                              00247000
*  Bit definitions:                                                     00248000
ENF51C_CONTENTION_EXISTS EQU X'80' Contention exists for this resource  00249000
ENF51C_SYSTEM_FAILURE EQU X'40' The system named in                    *00250000
                         ENF51C_FAILED_SYSTEM has failed and has no    *00251000
                         further interest in any resource               00252000
ENF51C_SYSTEM_ERROR EQU X'20' Contention notifications may have been   *00253000
                         lost. This may be due to system errors or     *00254000
                         migration of the CNS. ENF51C_FAILED_SYSTEM    *00255000
                         will contain the name of the system in error  *00256000
                         or in the case of CNS migration, the old CNS.  00257000
ENF51C_DATA_INCOMPLETE EQU X'10' The amount of data exceeded the       *00258000
                         maximum amount that can be transmitted with a *00259000
                         cross-system-capable ENF signal                00260000
ENF51C_SYSTEM_ERROR_CLEARED EQU X'08' Global resource contention data  *00261000
                         is once again valid.                           00262000
         DS    CL1       Reserved                                       00263000
ENF51C_EVENTS_COMBINED DS H Count of events that were combined into    *00264000
                         this notification. This field is valid when   *00265000
                         ENF51CVERS is at least ENF51CVER3              00266000
ENF51C_TIMESTAMP DS CL8  Time for which contention data is valid        00267000
ENF51C_RIB_OFFSET DS H   Offset from the beginning of the parameter    *00268000
                         list to the beginning of the RIB               00269000
ENF51C_RIB_SIZE DS H     Length of the fixed portion of the RIB        *00270000
                         (analogous to the first halfword returned by  *00271000
                         GQSCAN in register 0)                          00272000
ENF51C_RIBE_SIZE DS H    Length of each RIBE (analogous to the second  *00273000
                         halfword returned by GQSCAN in register 0)     00274000
         DS    CL6       Reserved                                       00275000
ENF51C_FAILED_SYSTEM DS CL8 Name of failing system. Valid only for     *00276000
                         ENF51C_RECOVERY qualifier.                     00277000
ENF51C_RIB DS  0C        Beginning of RIB/RIBE data                     00278000
*                                                                       00279000
* ********************************************************************  00280000
* * Constant values                                                     00281000
* ********************************************************************  00282000
*                                                                       00283000
*                                                                       00284000
ENF51CVER1 EQU 1         First version of ENF51C                        00285000
ENF51CVER2 EQU 2         Second version of ENF51C                       00286000
ENF51CVER3 EQU 3         Third version of ENF51C                        00287000
ENF51CCVER EQU 3         Current version of ENF51C                      00288000
ENF51C_ALL_CONT EQU X'01000000' ENFREQ qualifier value requesting all  *00289000
                         contention data, excluding                    *00290000
                         "waitless contention" resulting from RET=USE  *00291000
                         and RET=CHNG type ENQs                         00292000
ENF51C_LCONT EQU X'01000001' ENFREQ qualifier value requesting local   *00293000
                         contention data, excluding                    *00294000
                         "waitless contention" resulting from RET=USE  *00295000
                         and RET=CHNG type ENQs                         00296000
ENF51C_GCONT EQU X'01000002' ENFREQ qualifier value requesting global  *00297000
                         contention data, excluding                    *00298000
                         "waitless contention" resulting from RET=USE  *00299000
                         and RET=CHNG type ENQs                         00300000
ENF51C_ALL_CONTX EQU X'01000100' ENFREQ qualifier value requesting all *00301000
                         contention data, specifically from            *00302000
                         "waitless contention" resulting from RET=USE  *00303000
                         and RET=CHNG type ENQs                         00304000
ENF51C_LCONTX EQU X'01000101' ENFREQ qualifier value requesting local  *00305000
                         contention data, specifically from "waitless  *00306000
                         contention" resulting from RET=USE and        *00307000
                         RET=CHNG type ENQs                             00308000
ENF51C_GCONTX EQU X'01000102' ENFREQ qualifier value requesting global *00309000
                         contention data, specifically from "waitless  *00310000
                         contention" resulting from RET=USE and        *00311000
                         RET=CHNG type ENQs                             00312000
ENF51C_RECOVERY EQU X'01000003' ENFREQ qualifier value requesting      *00313000
                         contention recovery data                       00314000
ENF51C_LEN EQU *-ENF51C                                                 00315000
.L0002   ANOP                                                           00316000
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 00317000
         AIF   ('&LIST' EQ 'YES').P4                                    00318000
.P3      ANOP                                                           00319000
         POP   PRINT                                                    00320000
.P4      ANOP                                                           00321000
.P_EXIT  ANOP                                                           00322000
         MEND                                                           00323000
**/ ISGE51CN_2:;                                                        00324000
* %ISGE51CN_INCLUDED = 'YES';                                           00325000
* %DCL ZCBPRINT CHAR EXT;                                               00326000
* %DEACTIVATE ZCBPRINT;                                                 00327000
* %DCL ISGE51CN_LIST CHAR EXT;                                          00328000
* %DEACTIVATE ISGE51CN_LIST;                                            00329000
* %IF ISGE51CN_LIST ^= 'NO' &                                           00330000
*    ZCBPRINT ^= 'NO' %THEN                                             00331000
*   %GOTO ISGE51CN_3;                                                   00332000
*   @LIST PUSH NOECHO;                                                  00333000
*   @LIST NOASSEMBLE NOECHO;                                            00334000
*   @LIST OFF C NOECHO;                                                 00335000
* %ISGE51CN_3:;                                                         00336000
*/* Start of PL/X Source                                             */ 00337000
*/* Start of PL/X Source                                             */ 00338000
*%IF E51CNATTR='' %THEN                                                 00339000
*  %E51CNATTR='BASED';                                                  00340000
*                                                                       00341000
*DCL 1 ENF51C E51CNATTR,            /* Contention data           @L1A*/ 00342000
*      3 ENF51C_HEADER,             /* Header information        @L1A*/ 00343000
*        5 ENF51CID CHAR(6),        /* Control block identifier         00344000
*                                      'ENF51C'                  @L1A*/ 00345000
*        5 ENF51CVERS FIXED(16),    /* Version number.  Current         00346000
*                                      version is ENF51CCVER.    @L1A*/ 00347000
*        5 ENF51CLEN FIXED(32),     /* Length of ENF51C control         00348000
*                                      block, including the             00349000
*                                      appended contention data         00350000
*                                      beginning at ENF51C_RIB   @L1A*/ 00351000
*        5 * CHAR(4),               /* Reserved                  @L1A*/ 00352000
*      3 ENF51C_CONTENTION_DATA,    /* Contention data           @L1A*/ 00353000
*        5 ENF51C_FLAGS BIT(8),     /* Event description         @L1A*/ 00354000
*          7 ENF51C_CONTENTION_EXISTS BIT(1),  /* Contention exists     00355000
*                                      for this resource         @L2C*/ 00356000
*          7 ENF51C_SYSTEM_FAILURE BIT(1), /* The system named in       00357000
*                                      ENF51C_FAILED_SYSTEM             00358000
*                                      has failed and has no            00359000
*                                      further interest in any          00360000
*                                      resource                  @01C*/ 00361000
*          7 ENF51C_SYSTEM_ERROR BIT(1),  /* Contention                 00362000
*                                      notifications may have been      00363000
*                                      lost.  This may be due to        00364000
*                                      system errors or migration of    00365000
*                                      the CNS.  ENF51C_FAILED_SYSTEM   00366000
*                                      will contain the name of the     00367000
*                                      system in error or in the case   00368000
*                                      of CNS migration, the old        00369000
*                                      CNS.                      @P2C*/ 00370000
*          7 ENF51C_DATA_INCOMPLETE BIT(1),  /* The amount of           00371000
*                                      data exceeded the maximum        00372000
*                                      amount that can be transmitted   00373000
*                                      with a cross-system-capable      00374000
*                                      ENF signal                @L1A*/ 00375000
*          7 ENF51C_SYSTEM_ERROR_CLEARED BIT(1),  /* Global resource    00376000
*                                      contention data is once again    00377000
*                                      valid.                    @P2C*/ 00378000
*          7 * BIT(3),              /* Reserved                  @01C*/ 00379000
*        5 * CHAR(1),               /* Reserved                  @P4C*/ 00380000
*        5 ENF51C_EVENTS_COMBINED FIXED(16), /* Count of events that    00381000
*                                      were combined into this          00382000
*                                      notification. This field is      00383000
*                                      valid when ENF51CVERS is at      00384000
*                                      least ENF51CVER3          @P4A*/ 00385000
*        5 ENF51C_TIMESTAMP CHAR(8),  /* Time for which contention      00386000
*                                      data is valid             @L1A*/ 00387000
*        5 ENF51C_RIB_OFFSET FIXED(16), /* Offset from the beginning    00388000
*                                      of the parameter list to the     00389000
*                                      beginning of the RIB      @L1A*/ 00390000
*        5 ENF51C_RIB_SIZE FIXED(16), /* Length of the fixed portion    00391000
*                                      of the RIB (analogous to the     00392000
*                                      first halfword returned by       00393000
*                                      GQSCAN in register 0)     @L1A*/ 00394000
*        5 ENF51C_RIBE_SIZE FIXED(16), /* Length of each RIBE           00395000
*                                      (analogous to the second         00396000
*                                      halfword returned by             00397000
*                                      GQSCAN in register 0)     @L1A*/ 00398000
*        5 * CHAR(6),               /* Reserved                  @L1A*/ 00399000
*        5 ENF51C_FAILED_SYSTEM CHAR(8),  /* Name of failing system.    00400000
*                                      Valid only for ENF51C_RECOVERY   00401000
*                                      qualifier.                @01A*/ 00402000
*      3 ENF51C_RIB CHAR(0) BDY(DWORD);  /* Beginning of RIB/RIBE       00403000
*                                      data                      @L1A*/ 00404000
*                                                                       00405000
*/********************************************************************/ 00406000
*/* Constant values                                              @L1A*/ 00407000
*/********************************************************************/ 00408000
*DCL ENF51CCID CHAR(6) CONSTANT('ENF51C'); /* Control block ID value    00409000
*                                                                @L1A*/ 00410000
*                                                                       00411000
*DCL ENF51CVER1 FIXED(16) CONSTANT(1); /* First version of ENF51C       00412000
*                                                                @L1A*/ 00413000
*DCL ENF51CVER2 FIXED(16) CONSTANT(2); /* Second version of ENF51C      00414000
*                                                                @01A*/ 00415000
*DCL ENF51CVER3 FIXED(16) CONSTANT(3); /* Third version of ENF51C       00416000
*                                                                @P4A*/ 00417000
*DCL ENF51CCVER FIXED(16) CONSTANT(ENF51CVER3); /* Current version      00418000
*                                      of ENF51C                 @P4C*/ 00419000
*                                                                       00420000
*DCL ENF51C_ALL_CONT BIT(32) CONSTANT('01000000'X); /* ENFREQ           00421000
*                                      qualifier value requesting       00422000
*                                      all contention data,             00423000
*                                      excluding "waitless contention"  00424000
*                                      resulting from RET=USE and       00425000
*                                      RET=CHNG type ENQs        @02C*/ 00426000
*                                                                       00427000
*DCL ENF51C_LCONT BIT(32) CONSTANT('01000001'X); /* ENFREQ              00428000
*                                      qualifier value requesting       00429000
*                                      local contention data,           00430000
*                                      excluding "waitless contention"  00431000
*                                      resulting from RET=USE and       00432000
*                                      RET=CHNG type ENQs        @02C*/ 00433000
*                                                                       00434000
*DCL ENF51C_GCONT BIT(32) CONSTANT('01000002'X); /* ENFREQ              00435000
*                                      qualifier value requesting       00436000
*                                      global contention data,          00437000
*                                      excluding "waitless contention"  00438000
*                                      resulting from RET=USE and       00439000
*                                      RET=CHNG type ENQs        @02C*/ 00440000
*                                                                       00441000
*DCL ENF51C_ALL_CONTX BIT(32) CONSTANT('01000100'X); /* ENFREQ          00442000
*                                      qualifier value requesting       00443000
*                                      all contention data,             00444000
*                                      specifically from "waitless      00445000
*                                      contention" resulting from       00446000
*                                      RET=USE and RET=CHNG type        00447000
*                                      ENQs                      @02C*/ 00448000
*DCL ENF51C_LCONTX BIT(32) CONSTANT('01000101'X); /* ENFREQ             00449000
*                                      qualifier value requesting       00450000
*                                      local contention data,           00451000
*                                      specifically from "waitless      00452000
*                                      contention" resulting from       00453000
*                                      RET=USE and RET=CHNG type        00454000
*                                      ENQs                      @02C*/ 00455000
*DCL ENF51C_GCONTX BIT(32) CONSTANT('01000102'X); /* ENFREQ             00456000
*                                      qualifier value requesting       00457000
*                                      global contention data,          00458000
*                                      specifically from "waitless      00459000
*                                      contention" resulting from       00460000
*                                      RET=USE and RET=CHNG type        00461000
*                                      ENQs                      @02C*/ 00462000
*DCL ENF51C_RECOVERY BIT(32) CONSTANT('01000003'X); /* ENFREQ           00463000
*                                      qualifier value requesting       00464000
*                                      contention recovery data  @01A*/ 00465000
* @LOGIC;                                                               00466000
* #PRAGMA TOOL=CBGEN.                                                   00467000
* #USEORG.                                                              00468000
* #DELETE.ENF51CCID                                                     00469000
* #EPRAGMA.                                                             00470000
* @ENDLOGIC;                                                            00471000
*/* End of PL/X Source                                               */ 00472000
*/* End of PL/X Source                                               */ 00473000
* %IF ISGE51CN_LIST ^= 'NO' &                                           00474000
*    ZCBPRINT ^= 'NO' %THEN                                             00475000
*   %GOTO ISGE51CN_4;                                                   00476000
*   @LIST POP NOECHO;                                                   00477000
* %ISGE51CN_4:;                                                         00478000
* %END;                                                                 00479000
