*                                                                       00001000
* %DCL ISGPEL_INCLUDED CHAR EXT;                                        00002000
* %DEACTIVATE ISGPEL_INCLUDED;                                          00003000
* %IF ISGPEL_INCLUDED = '' %THEN                                        00004000
* %DO;                                                                  00005000
*/* Macro made bi-lingual on 09264. CBGEN compile date 09235         */ 00006000
*% /*                                                                   00007000
         MACRO                                                          00008000
         ISGPEL &DSECT=YES,&LIST=YES,&TITLE=YES,&PEL=YES                00009000
         GBLC  &ISGPEL_INCLUDED                                         00010000
         GBLC  &ZCBPRINT                                                00011000
&ISGPEL_INCLUDED SETC 'YES'                                             00012000
         AIF   ('&LIST' EQ 'NONE').P0                                   00013000
         AIF   ('&TITLE' EQ 'NO').P5                                    00014000
 TITLE   'ISGPEL  - GRS ENQ/DEQ/RESERVE Parameter Element List      '   00015000
.P5      ANOP                                                           00016000
**/ ISGPEL_1:;                                                          00017000
*/* Start of Specifications ******************************************* 00018000
*01* Proprietary Statement =                                            00019000
*                                                                       00020000
* Licensed Materials - Property of IBM                                  00021000
* 5694-A01 COPYRIGHT IBM CORP. 1980, 2010                               00022000
*                                                                       00023000
*01* Status = HBB7770                                                   00024000
*                                                                       00025000
*01* EXTERNAL CLASSIFICATION:  PI                                       00026000
*                                                                       00027000
*01* END OF EXTERNAL CLASSIFICATION:                                    00028000
*                                                                       00029000
*01* Descriptive Name: GRS ENQ/DEQ/RESERVE Parameter Element List       00030000
*02*  Acronym:  PEL                                                     00031000
*                                                                       00032000
*01* Macro Name:  ISGPEL                                                00033000
*                                                                       00034000
*01* DSECT Name: PEL                                                    00035000
*                                                                       00036000
*01* Component:  Global Resource Serialization (SCSDS)                  00037000
*                                                                       00038000
*01* Eye-Catcher:  None                                                 00039000
*02*  Offset:                                                           00040000
*02*  Length:                                                           00041000
*                                                                       00042000
*01* Storage Attributes:                                                00043000
*02*  Subpool:  Any valid subpool in the private or common area         00044000
*                                                                       00045000
*02*  Key:  User's key                                                  00046000
*                                                                       00047000
*                                                                       00048000
*01* Deleted by:  The requestor of ENQ/DEQ/RESERVE.                     00049000
*                                                                       00050000
*01* Size:  12 bytes (PelBasic)                                         00051000
*         + length(PelPrefx) if used                                    00052000
*         + length(PelUCAAA) if ENQ with RESERVE                        00053000
*                                                                       00054000
*01* Created by:  ENQ/DEQ/RESERVE macro expansion.                      00055000
*                                                                       00056000
*01* Pointed to by:  The pointer is maintained by the user of           00057000
*                    the macro.                                         00058000
*                                                                       00059000
*01* Serialization:   None                                              00060000
*                                                                       00061000
*01* Function:  Contains the necessary information to process           00062000
*    an ENQ, DEQ, or RESERVE macro request.                             00063000
*                                                                       00064000
*01* Notes:                                                             00065000
*02* The PEL consists of 3 sections defined as follows:                 00066000
*                                                                       00067000
*02* Section 1: PEL Prefix                                         @P8C 00068000
*    PELPREFX maps the input TCB and/or ECB                        @P8C 00069000
*    address(s), as defined by the ENQ/DEQ/RESERVE macro expansions.    00070000
*                                                                       00071000
*    The new-format PEL-prefix maps the input TCB, ECB,            @L1A 00072000
*    MASID, and MTCB.                                              @L1A 00073000
*                                                                       00074000
*    The prefix format is as follows:                              @P8A 00075000
*      If flag PELSAVE is off, the prefix has this format:         @P8A 00076000
*                                                                  @P8A 00077000
*           ************************************************       @P8A 00078000
*        -8 * TCB ptr if ECB also coded, or does not exist *       @P8A 00079000
*           ************************************************       @P8A 00080000
*        -4 * ECB pointer or TCB ptr, or does not exist    *       @P8A 00081000
*           ************************************************       @P8A 00082000
*                                                                  @P8A 00083000
*      If flag PELSAVE is on, the new-format prefix is:            @P8A 00084000
*                                                                  @P8A 00085000
*           ************************************************       @P8A 00086000
*       -20 * TCBPTR OR ZERO                               *       @P8A 00087000
*           ************************************************       @P8A 00088000
*       -16 * ECB POINTER OR ZERO                          *       @P8A 00089000
*           ************************************************       @P8A 00090000
*       -12 * MASID-OPERAND VALUE OR ZERO                  *       @P8A 00091000
*           ************************************************       @P8A 00092000
*        -8 * MTCB-OPERAND VALUE OR ZERO                   *       @P8A 00093000
*           ************************************************       @P8A 00094000
*        -4 * FORMAT-WORD = DECIMAL 20                     *       @P8A 00095000
*           ************************************************       @P8A 00096000
*                                                                  @P8A 00097000
*    NOTE: the PEL-prefix is present only before the               @P8A 00098000
*          first PEL of the list.                                  @P8A 00099000
*                                                                       00100000
*02* Section 2: PEL Basic                                          @P8C 00101000
*    PELBASIC maps the resource-dependant data,                    @P8C 00102000
*    as defined by the ENQ, DEQ, and RESERVE macro expansions.     @P8C 00103000
*                                                                       00104000
*02* Note that the new-format PEL-prefix is followed               @L1A 00105000
*    by a format word that gives the length of the                 @L1A 00106000
*    new-format PEL-prefix.                                        @L1A 00107000
*                                                                       00108000
*02* Data stored in the user PEL is stored in the user's key.           00109000
*                                                                       00110000
*01* Method of Access:                                                  00111000
*02*  BAL:  DSECT is produced, requiring a USING on the PEL.            00112000
*                                                                       00113000
*02*  PLX:   PEL is declared as a based structure.                      00114000
*            PELPTR must be declared.                                   00115000
*                                                                       00116000
*            If macro variable PELBASE='PELMAP', then separate based    00117000
*            mappings are generated for the PELPREFX and the rest       00118000
*            of the PEL (labeled PELMAP). This is a truer indication    00119000
*            of how the PEL is used by GRS routines, which typically    00120000
*            use pointers that point to PELBASIC.  The only             00121000
*            exceptions are some old GRS Ring modules, whose input      00122000
*            is a pointer to a 'phantom' PELPREFX.                 @P9C 00123000
*                                                                       00124000
*            If macro variable PELTYPE='YES' is used in conjunction     00125000
*            with PELBASE='PELMAP', then the PEL will be declared       00126000
*            as a type (starting with PELBASIC).                   @P9A 00127000
*                                                                       00128000
*01* Change Activity:                                                   00129000
*                                                                       00130000
*       Products:                                                       00131000
*                                                                       00132000
*        $D1=44      ,JBB2110,820827,PD14: GRS REQUEST LIMIT            00133000
*                     CHANGE PELX1R01 TO PELXREQF.                      00134000
*                     CREATE PELXFLAG BY USING ONE OF THE RESERVED      00135000
*                     BYTES IN PELXRSV1.                           @D1A 00136000
*        $L1=IPLDFRNL,JBB2125,830411,PD1L: IPL WITH DEFAULT RNL         00137000
*                     USE FLAG PELXERSV FOR EARLY-RESERVE.         @L1A 00138000
*        $L2=MASIDENQ,JBB2125,830411,PD1L: ENQ/RESERVE MASID=/MTCB=     00139000
*                     USE FLAG PELSAVE TO INDICATE NEW-FORMAT           00140000
*                     PEL-PREFIX PRECEDES FIRST PEL.               @L2A 00141000
*        $L3=GRSPF   ,JBB3311,880210,PD11: GRS PERFORMANCE              00142000
*                     ENHANCEMENTS FOR PFT COMPRESSION             @L3A 00143000
*        $L4=GRSW1   ,HBB4410,890403,PDDX: ADD SUPPORT FOR RNL          00144000
*                                          KEYWORD                 @L4A 00145000
*        $L5=DRNL    ,HBB4410,891016,PDHJ:                              00146000
*                                          SEPARATE THE PELXRNAME FROM  00147000
*                                          THE REST OF THE PEL.  THERE  00148000
*                                          IS NOW A PEL FIXED SECTION   00149000
*                                          (WHICH HAS EVERYTHING EXCEPT 00150000
*                                          THE RNAME) AND A SECTION FOR 00151000
*                                          THE RNAME.  THIS ALLOWS US   00152000
*                                          TO TAKE THE LENGTH OF PEL    00153000
*                                          WITHOUT THE RNAME.      @L5A 00154000
*        $L6=UCBVP   ,HBB5520,940210,PD00AW: Add support for DEV        00155000
*                                          keyword.                @L6A 00156000
*        $L7=GRS32   ,JBB6602,940505,PDDX: GRS Star                     00157000
*                                          Add option to obtain         00158000
*                                          separate PELMAP and PELPREFX 00159000
*                                          mappings. Move PELFIXED to   00160000
*                                          exclude the prefix, since    00161000
*                                          there is no prefix in a QWB  00162000
*                                          PEL.                    @L7A 00163000
*        $L8=GRSWC   ,HBB7705,000511,PDBD: GRS Wildcard                 00164000
*        $L9=PCENQ   ,HBB7705,010226,PDDV: GRS PC ENQ                   00165000
*        $LA=64GRS   ,HBB7709,030616,PDBC: ISGENQ                       00166000
*        $LB=ENQAPI  ,HBB7730,050426,PDBC: Remove PelxReqf              00167000
*        $LC=GRSTOR2 ,HBB7740,051108,PDBC: Removed PELX, shadows etc..  00168000
*                                                                       00169000
*       PTMs:                                                           00170000
*                                                                       00171000
*        $P1=PAB0062 ,JBB2110,821008,PD14: THE USE OF PELXFLAG IS       00172000
*                     UNNECESSARY FOR DCR 44 (ABOVE).  BY PASSING       00173000
*                     THE PEL WITH PELXRET=X'18', THE SAME FUNCTION     00174000
*                     IS ACCOMPLISHED.                             @P1A 00175000
*        $P2=PAB0126 ,JBB2110,821015,PD14: RETRANSMIT TO REMOVE CODE    00176000
*                     FOR PAB0062.  WHEN THERE ARE SYSTEMS IN THE GRS   00177000
*                     RING WITHOUT DCR44 SUPPORT, PELXFLAG IS           00178000
*                     REQUIRED.  THE CODE FOR PAB0062 DOES NOT ACCOUNT  00179000
*                     FOR PREVIOUS LEVELS OF GRS.                  @P2A 00180000
*        $P3=PSD0398 ,JBB6602,951013,PDAW: Restore prolog updates  @P3A 00181000
*        $P4=PJK0798 ,HBB7709,030825,PDCJ: Added PELETOD           @P4A 00182000
*        $P5=PJK0888 ,HBB7709,030915,PDBC: PELUnprotectedExitQname @P5A 00183000
*        $P6=PJK0929 ,HBB7709,030922,PDBC: RNL flags w/ISGNQXIT    @P6A 00184000
*        $P7=PJK0956 ,HBB7709,031010,PDBC: Remove pelxrsnc         @P7A 00185000
*        $P8=ME02034 ,HBB7720,041021,PDFX: Describe the PEL prefix @P8A 00186000
*           =ME03930 ,HBB7730,050808,PDCJ: Fix cpyright                 00187000
*        $P9=ME09333 ,HBB7740,070207,PDRY: Restore required constants   00188000
*        $PA=OA23634 ,HBB7750,080214,PDFX: Document what flags need to  00189000
*                                          be set in all PEL entries    00190000
*        $PB=ME12355 ,HBB7770,090505,PDGB: Update PelStpMC comment to   00191000
*                                          identify it as an overall    00192000
*                                          flag. Add bitmasks for       00193000
*                                          PELFLAG and PELLAST.         00194000
*                                                                       00195000
*       APARs:                                                          00196000
*                                                                       00197000
*  $01=OW11070  HBB4420 950505 PDHB: Add support for LOC keyword with   00198000
*                                    RESERVE and DEQ.  DCR 105.    @01A 00199000
*                                                                       00200000
*** End of Specifications ********************************************/ 00201000
*% /*                                                                   00202000
.P0      ANOP                                                           00203000
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 00204000
         AIF   ('&LIST' EQ 'YES').P2                                    00205000
.P1      ANOP                                                           00206000
         PUSH  PRINT                                                    00207000
         PRINT OFF                                                      00208000
.P2      ANOP                                                           00209000
         AIF   ('&PEL' EQ 'NO').L0002                                   00210000
         AIF   ('&DSECT' EQ 'YES').L0003                                00211000
         AIF   ('&PEL' NE 'YES').L0002                                  00212000
.L0003   ANOP                                                           00213000
*                                                                       00214000
*    The following PRAGMA statements provide control info to the CBGEN  00215000
* tool. They must be in the logic/endlogic pair.                        00216000
*                                                                       00217000
         AIF   ('&DSECT' EQ 'YES').L0004                                00218000
PEL      DS    0F        PARAMETER ELEMENT LIST, NOTE THAT THE PEL     *00219000
                         DIVIDED INTO TWO SECTIONS - A FIXED PEL AND   *00220000
                         THE RNAME WHICH IS VARIABLE IN LENGTH.         00221000
         AGO   .L0005                                                   00222000
.L0004   ANOP                                                           00223000
PEL      DSECT           PARAMETER ELEMENT LIST, NOTE THAT THE PEL     *00224000
                         DIVIDED INTO TWO SECTIONS - A FIXED PEL AND   *00225000
                         THE RNAME WHICH IS VARIABLE IN LENGTH.         00226000
.L0005   ANOP                                                           00227000
PELPREFX DS    0CL8      PARAMETER ELEMENT PREFIX                       00228000
PELTCB   DS    A         IF BOTH TCB AND ECB ARE CODED, CONTAINS THE   *00229000
                         TCB ADDRESS                                    00230000
PELDUAL  DS    A         PEL PREFIX WORK (TCB ADDRESS OR ECB ADDRESS)   00231000
PELBASIC DS    0CL12     PARAMETER ELEMENT BASIC SECTION                00232000
PELFASTPATHWORD DS 0CL4  Word to be checked to see if this Pel is a    *00233000
                         fast-path candidate                            00234000
PELLAST  DS    0B        FLAG BYTE 1                                    00235000
PELEOL   EQU   X'80'     LAST ELEMENT OF LIST                           00236000
PELIGNOR EQU   X'40'     IGNORE REMAINING BITS OF THIS BYTE             00237000
PELOCANY EQU   X'20'     If 1, LOC=ANY was specified on RESERVE or DEQ *00238000
                         request. LOC=ANY must be specified when the   *00239000
                         UCB address provided by the caller is an      *00240000
                         above-the-line address and is to be treated   *00241000
                         as such by ISGGQWBI, ISGGSETU, and ISGGNQDQ.   00242000
PELSHR   EQU   X'10'     SHARED RESOURCE REQUEST                        00243000
PELSAVE  EQU   X'08'     NEW-FORMAT PEL PREFIX PRECEDES FIRST PEL OF   *00244000
                         LIST. MUST BE ZERO FOR A DEQ. This flag must  *00245000
                         be set consistently in all PELs in a list to  *00246000
                         ensure desired results                         00247000
PELNORNL EQU   X'04'     IF 1, RNL=NO This flag must be set            *00248000
                         consistently in all PELs in a list to ensure  *00249000
                         desired results                                00250000
PELGEN2  EQU   X'02'     IF 1, GENERIC=YES This flag must be set       *00251000
                         consistently in all PELs in a list to ensure  *00252000
                         desired results                                00253000
PELTCBF  EQU   X'01'     TCB= WAS SPECIFIED. PELTCBF IS IGNORED IN THE *00254000
                         USER PEL IF PELSAVE IS ON. THE TCB= OPERAND   *00255000
                         IS CONSIDERED TO BE PRESENT IF THE TCB FIELD  *00256000
                         OF THE NEW-FORMAT PEL-PREFIX IS NON-ZERO.     *00257000
                         This flag must be set consistently in all     *00258000
                         PELs in a list to ensure desired results       00259000
         ORG   PELLAST+1                                                00260000
PELMILEN DS    X         RNAME LENGTH                                   00261000
PELFLAG  DS    0B        FLAG BYTE 2                                    00262000
PELSHARE EQU   X'80'     0=EXCLUSIVE, 1=SHARE                           00263000
PELSCPE1 EQU   X'40'     SEE COMMENTS BELOW                             00264000
PELSYSMC EQU   X'20'     OBSOLETE (SET/RESET SYSTEM MUST COMPLETE)      00265000
PELSTPMC EQU   X'10'     SET/RESET STEP MUST COMPLETE SPECIFIED. This  *00266000
                         flag must be set consistently in all PELs in  *00267000
                         a list to ensure desired results               00268000
PELSCPE2 EQU   X'08'     SEE COMMENTS BELOW                             00269000
PELRET1  EQU   X'04'     SEE COMMENTS BELOW                             00270000
PELRET2  EQU   X'02'     SEE COMMENTS BELOW                             00271000
PELRET3  EQU   X'01'     SEE COMMENTS BELOW                             00272000
*                                                                       00273000
*                                                                       00274000
*           PELRET1,PELRET2 AND PELRET3                                 00275000
*               These flags must be set consistently in all PELs        00276000
*               in a list to ensure desired results                     00277000
*                                                                       00278000
*             000- RET=NONE (NO RETURN CODE)                            00279000
*             001- RET=HAVE                                             00280000
*             010- RET=CHNG                                             00281000
*             011- RET=USE                                              00282000
*             100- ECB=                                                 00283000
*             101- RESERVED                                             00284000
*             110- RESERVED                                             00285000
*             111- RET=TEST                                             00286000
*                                                                       00287000
*           PELSCPE1 AND PELSCPE2                                       00288000
*                                                                       00289000
*             00- STEP                                                  00290000
*             01- SYSTEMS AND UCB                                       00291000
*             10- SYSTEM                                                00292000
*             11- SYSTEMS                                               00293000
*                                                                       00294000
*                                                                       00295000
*                                                                       00296000
         ORG   PELFLAG+1                                                00297000
PELRET   DS    X         RETURN CODE AREA IN USER-S PEL                 00298000
PELMAJAMINA DS 0CL8      Field containing the QName and RName          *00299000
                         addresses                                      00300000
PELMAJA  DS    A         ADDRESS OF QNAME                               00301000
PELMINA  DS    A         ADDRESS OF RNAME                               00302000
PELUCBAA DS    A         ADDRESS OF POINTER TO UCB. THIS FIELD ONLY    *00303000
                         EXISTS FOR RESERVE REQUESTS.                   00304000
*                                                                       00305000
*                                                                       00306000
*       THE FOLLOWING DECLARES DEFINE THE REQUIRED PEL CONSTANTS        00307000
*                                                                       00308000
*                                                                       00309000
*                                                                       00310000
PELMAJSZ EQU   8         LENGTH OF QNAME                                00311000
PELELEM  EQU   12        LENGTH OF A PEL ENTRY (BASIC)                  00312000
PEL_LEN  EQU   *-PEL                                                    00313000
.L0002   ANOP                                                           00314000
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 00315000
         AIF   ('&LIST' EQ 'YES').P4                                    00316000
.P3      ANOP                                                           00317000
         POP   PRINT                                                    00318000
.P4      ANOP                                                           00319000
.P_EXIT  ANOP                                                           00320000
         MEND                                                           00321000
**/ ISGPEL_2:;                                                          00322000
* %ISGPEL_INCLUDED = 'YES';                                             00323000
* %DCL ZCBPRINT CHAR EXT;                                               00324000
* %DEACTIVATE ZCBPRINT;                                                 00325000
* %DCL ISGPEL_LIST CHAR EXT;                                            00326000
* %DEACTIVATE ISGPEL_LIST;                                              00327000
* %IF ISGPEL_LIST ^= 'NO' &                                             00328000
*    ZCBPRINT ^= 'NO' %THEN                                             00329000
*   %GOTO ISGPEL_3;                                                     00330000
*   @LIST PUSH NOECHO;                                                  00331000
*   @LIST NOASSEMBLE NOECHO;                                            00332000
*   @LIST OFF C NOECHO;                                                 00333000
* %ISGPEL_3:;                                                           00334000
*/* Start of PL/X Source                                             */ 00335000
* @Logic;                                                               00336000
* /* The following PRAGMA statements provide control info to the CBGEN  00337000
* tool. They must be in the logic/endlogic pair.                 @P9A*/ 00338000
* #PRAGMA TOOL=CBGEN.                                                   00339000
* #DELETE.kPelIgnoreMask                                                00340000
* #DELETE.kPelRemoveRetMask                                             00341000
* #DELETE.kPelFlagRemoveIndMask                                         00342000
* #DELETE.kPelFlagRemoveOverallMask                                     00343000
* #DELETE.kPelLastRemoveIndMask                                         00344000
* #DELETE.kPelLastRemoveOverallMask                                     00345000
* #EPRAGMA.                                                             00346000
* @endlogic;                                                  /* @PBC*/ 00347000
*%DCL PELTYPE CHAR EXT;                                       /* @L9A*/ 00348000
* %IF PELBASE='PELMAP' %THEN                                            00349000
*   %DO;                                                                00350000
* DCL 1 PELPREFX BDY(WORD) BASED(ADDR(PELMAP)-LENGTH(PELPREFX)), /*     00351000
*                                      Prefix mapping            @L7A*/ 00352000
*           5 PELTCB  PTR(31),      /* IF BOTH TCB AND ECB ARE CODED,   00353000
*                                      CONTAINS THE TCB ADDRESS      */ 00354000
*           5 PELDUAL PTR(31);      /* PEL PREFIX WORK (TCB ADDRESS     00355000
*                                      OR ECB ADDRESS)           @L7C*/ 00356000
*%If Translate(PELTYPE) = 'YES'                               /* @L9A*/ 00357000
*%Then                                                                  00358000
*  %Do;                                                       /* @L9A*/ 00359000
* DCL  1 PELMAP Type,               /* Mapping of PEL            @L9A*/ 00360000
*  %End;                                                      /* @L9A*/ 00361000
*%Else                                                        /* @L9A*/ 00362000
*  %Do;                                                       /* @L9A*/ 00363000
* DCL  1 PELMAP BASED(PELPTR),      /* Mapping of PEL            @L7A*/ 00364000
*  %End;                                                      /* @L9A*/ 00365000
*   %END;                                                               00366000
*%ELSE                              /* Separate prefix mapping   @L7A*/ 00367000
*   %DO;                                                                00368000
* DCL 1 PEL BASED(PELPTR) BDY(WORD), /* PARAMETER ELEMENT LIST, NOTE    00369000
*                                       THAT THE PEL DIVIDED INTO TWO   00370000
*                                       SECTIONS - A FIXED PEL AND THE  00371000
*                                       RNAME WHICH IS VARIABLE IN      00372000
*                                       LENGTH.                  @L5C*/ 00373000
*         3 PELPREFX CHAR(8) BDY(WORD), /* PARAMETER ELEMENT PREFIX  */ 00374000
*           5 PELTCB  PTR(31),      /* IF BOTH TCB AND ECB ARE CODED,   00375000
*                                      CONTAINS THE TCB ADDRESS      */ 00376000
*           5 PELDUAL PTR(31),      /* PEL PREFIX WORK (TCB ADDRESS     00377000
*                                      OR ECB ADDRESS)           @L7C*/ 00378000
*   %END;                                                               00379000
*         3 PELBASIC CHAR(12) BDY(WORD), /* PARAMETER ELEMENT BASIC     00380000
*                                      SECTION                       */ 00381000
*          4 PELFASTPATHWORD CHAR(4), /* Word to be checked to see if   00382000
*                                      this Pel is a fast-path          00383000
*                                      candidate                 @LCA*/ 00384000
*           5 PELLAST    BIT(8),    /* FLAG BYTE 1                   */ 00385000
*             7 PELEOL   BIT(1),    /* LAST ELEMENT OF LIST          */ 00386000
*             7 PELIGNOR BIT(1),    /* IGNORE REMAINING BITS OF THIS    00387000
*                                      BYTE                          */ 00388000
*             7 PELOCANY BIT(1),    /* If 1, LOC=ANY was specified on   00389000
*                                      RESERVE or DEQ request.          00390000
*                                      LOC=ANY must be specified when   00391000
*                                      the UCB address provided by the  00392000
*                                      caller is an above-the-line      00393000
*                                      address and is to be treated as  00394000
*                                      such by ISGGQWBI, ISGGSETU, and  00395000
*                                      ISGGNQDQ.                 @01C*/ 00396000
*             7 PELSHR   BIT(1),    /* SHARED RESOURCE REQUEST       */ 00397000
*             7 PELSAVE  BIT(1),    /* NEW-FORMAT PEL PREFIX PRECEDES   00398000
*                                      FIRST PEL OF LIST.  MUST BE      00399000
*                                      ZERO FOR A DEQ.                  00400000
*                                      This flag must be set            00401000
*                                      consistently in all PELs in a    00402000
*                                      list to ensure desired results   00403000
*                                                                @PAC*/ 00404000
*             7 PELNORNL BIT(1),    /* IF 1, RNL=NO                     00405000
*                                      This flag must be set            00406000
*                                      consistently in all PELs in a    00407000
*                                      list to ensure desired results   00408000
*                                                                @PAC*/ 00409000
*             7 PELGEN2  BIT(1),    /* IF 1, GENERIC=YES                00410000
*                                      This flag must be set            00411000
*                                      consistently in all PELs in a    00412000
*                                      list to ensure desired results   00413000
*                                                                @PAC*/ 00414000
*             7 PELTCBF  BIT(1),    /* TCB= WAS SPECIFIED.  PELTCBF     00415000
*                                      IS IGNORED IN THE USER PEL       00416000
*                                      IF PELSAVE IS ON.  THE TCB=      00417000
*                                      OPERAND IS CONSIDERED TO BE      00418000
*                                      PRESENT IF THE TCB FIELD OF      00419000
*                                      THE NEW-FORMAT PEL-PREFIX IS     00420000
*                                      NON-ZERO.                        00421000
*                                      This flag must be set            00422000
*                                      consistently in all PELs in a    00423000
*                                      list to ensure desired results   00424000
*                                                                @PAC*/ 00425000
*           5 PELMILEN FIXED(8),    /* RNAME LENGTH                  */ 00426000
*           5 PELFLAG  BIT(8),      /* FLAG BYTE 2                   */ 00427000
*             7 PELSHARE BIT(1),    /* 0=EXCLUSIVE, 1=SHARE          */ 00428000
*             7 PELSCPE1 BIT(1),    /* SEE COMMENTS BELOW            */ 00429000
*             7 PELSYSMC BIT(1),    /* OBSOLETE (SET/RESET SYSTEM       00430000
*                                      MUST COMPLETE)                */ 00431000
*             7 PELSTPMC BIT(1),    /* SET/RESET STEP MUST COMPLETE     00432000
*                                      SPECIFIED. This flag must be set 00433000
*                                      consistently in all PELs in a    00434000
*                                      list to ensure desired results   00435000
*                                                                @PBC*/ 00436000
*             7 PELSCPE2 BIT(1),    /* SEE COMMENTS BELOW            */ 00437000
*             7 PELRET1  BIT(1),    /* SEE COMMENTS BELOW            */ 00438000
*             7 PELRET2  BIT(1),    /* SEE COMMENTS BELOW            */ 00439000
*             7 PELRET3  BIT(1),    /* SEE COMMENTS BELOW            */ 00440000
*/*                                                                  */ 00441000
*/*         PELRET1,PELRET2 AND PELRET3                              */ 00442000
*/*             These flags must be set consistently in all PELs     */ 00443000
*/*             in a list to ensure desired results              @PAA*/ 00444000
*/*                                                                  */ 00445000
*/*           000- RET=NONE (NO RETURN CODE)                         */ 00446000
*/*           001- RET=HAVE                                          */ 00447000
*/*           010- RET=CHNG                                          */ 00448000
*/*           011- RET=USE                                           */ 00449000
*/*           100- ECB=                                              */ 00450000
*/*           101- RESERVED                                          */ 00451000
*/*           110- RESERVED                                          */ 00452000
*/*           111- RET=TEST                                          */ 00453000
*/*                                                                  */ 00454000
*/*         PELSCPE1 AND PELSCPE2                                    */ 00455000
*/*                                                                  */ 00456000
*/*           00- STEP                                               */ 00457000
*/*           01- SYSTEMS AND UCB                                    */ 00458000
*/*           10- SYSTEM                                             */ 00459000
*/*           11- SYSTEMS                                            */ 00460000
*/*                                                                  */ 00461000
*           5 PELRET   FIXED(8),    /* RETURN CODE AREA IN USER-S PEL*/ 00462000
*          4 PELMAJAMINA CHAR(8) BDY(WORD), /* Field containing the     00463000
*                                      QName and RName addresses @LCA*/ 00464000
*           5 PELMAJA  PTR(31),     /* ADDRESS OF QNAME          @LCC*/ 00465000
*           5 PELMINA  PTR(31),     /* ADDRESS OF RNAME          @LCC*/ 00466000
*         3 PELUCBAA PTR(31)        /* ADDRESS OF POINTER TO UCB. THIS  00467000
*                                      FIELD ONLY EXISTS FOR RESERVE    00468000
*                                      REQUESTS.                 @LCC*/ 00469000
*         ;                                                             00470000
*%If Translate(PelType) ^= 'YES' %Then                                  00471000
*%do;                               /* Only declare constants for       00472000
*                                      BASED Pels                @P9A*/ 00473000
*/*                                                                  */ 00474000
*/*     THE FOLLOWING DECLARES DEFINE THE REQUIRED PEL CONSTANTS     */ 00475000
*/*                                                                  */ 00476000
* DCL PELMAJSZ CONSTANT(8) FIXED(8);              /* LENGTH OF QNAME    00477000
*                                                                @P9P*/ 00478000
* DCL PELELEM CONSTANT(LENGTH(PELBASIC)) FIXED(8); /* LENGTH OF A PEL   00479000
*                                                     ENTRY (BASIC)     00480000
*                                                                @P9P*/ 00481000
*%end;                                                        /* @P9A*/ 00482000
*                                                                       00483000
* dcl kPelIgnoreMask bit(8) constant('80'x); /* Mask used to reset all  00484000
*                                      flags ignored since the          00485000
*                                      PelIgnor flag is on       @LCA*/ 00486000
* dcl kPelRemoveRetMask bit(8) constant('F8'x); /* Mask used to remove  00487000
*                                      PelRet setting            @LCA*/ 00488000
* dcl kPelFlagRemoveIndMask bit(8) constant('17'x); /* Mask used to     00489000
*                                      remove individual flags from     00490000
*                                      PELFLAG                   @PBA*/ 00491000
* dcl kPelFlagRemoveOverallMask bit(8) constant('E8'x); /* Mask used to 00492000
*                                      remove PELRET1, PELRET2, PELRET3 00493000
*                                      (the overall flags) from PELFLAG 00494000
*                                                                @PBA*/ 00495000
* dcl kPelLastRemoveIndMask bit(8) constant('0B'x); /* Mask used to     00496000
*                                      remove individual flags in       00497000
*                                      PELLAST                   @PBA*/ 00498000
* dcl kPelLastRemoveOverallMask bit(8)  constant('F4'x); /* Mask used   00499000
*                                      to remove PELSAVE PELGEN2,       00500000
*                                      PELTCBF (the overall flags)      00501000
*                                      in PELLAST                @PBA*/ 00502000
*/* End of PL/X Source                                               */ 00503000
* %IF ISGPEL_LIST ^= 'NO' &                                             00504000
*    ZCBPRINT ^= 'NO' %THEN                                             00505000
*   %GOTO ISGPEL_4;                                                     00506000
*   @LIST POP NOECHO;                                                   00507000
* %ISGPEL_4:;                                                           00508000
* %END;                                                                 00509000
