*   %GOTO PLSRIB;                                                       00010000
*                                                                       00020000
*/*                                                                     00030000
         MACRO                                                          00040000
         ISGRIB                                                         00050000
*                                                                    */ 00060000
*                                                                       00070000
*%PLSRIB:                                                               00080000
*   ;                                                                   00090000
*                                                                       00100000
*/*  START OF SPECIFICATIONS ****************************************** 00110000
*                                                                       00120000
* $MAC(ISGRIB) COMP(SCSDS) PROD(HBB7709): Resource information block    00130000
*                                                                       00140000
*01*  DESCRIPTIVE-NAME:  RESOURCE INFORMATION BLOCK                     00150000
*                        RESOURCE INFORMATION BLOCK EXTENT              00160000
*                                                                       00170000
*02*  Acronym:           RIB                                            00180000
*                        RIBE                                           00190000
*                                                                       00200000
*01*  PROPRIETARY STATEMENT:                                            00210000
*                                                                       00220000
*    LICENSED MATERIALS - PROPERTY OF IBM                               00230000
*    5694-A01 (C) COPYRIGHT IBM CORP. 1980, 2007                        00250000
*                                                                       00260000
*01*  STATUS:  HBB7740                                                  00270000
*                                                                       00280000
*01*  EXTERNAL CLASSIFICATION: PI                                       00290000
*01*  END OF EXTERNAL CLASSIFICATION:                                   00300000
*                                                                       00310000
*01*  MACRO-NAME:  ISGRIB                                               00320000
*                                                                       00330000
*01* DSECT Name:  RIB                                                   00340000
*                 RIBE                                                  00350000
*                                                                       00360000
*01* Component:  Global Resource Serialization (SCSDS)                  00370000
*                                                                       00380000
*01* Eye-Catcher:  None                                                 00390000
*                                                                       00400000
*01* Storage Attributes:                                                00410000
*02*  SUBPOOL:   229 WHILE IN GRS PRIVATE AREA                          00420000
*02*  KEY    :   0   WHILE IN GRS PRIVATE AREA                          00430000
*02*  Residency: Above 16M while in GRS Private Area                    00440000
*                                                                       00450000
*01*  SIZE:   RIB  - 40 BYTES FOR THE FIXED SECTION AND                 00460000
*                    N BYTES FOR THE VARIABLE SECTION                   00470000
*                    (WHERE N IS A MULTIPLE OF FOUR                     00480000
*                     IN THE RANGE OF 4 TO 256)                         00490000
*             RIBE - 48 BYTES                                      @L2C 00500000
*                                                                       00510000
*01*  CREATED-BY:  THE GLOBAL RESOURCE SERIALIZATION (GRS) QUEUE        00520000
*                  SCANNING MODULE (ISGQSC) BUILDS THE RIBS AND         00530000
*                  RIBES IN THE GRS PRIVATE AREA BEFORE MOVING THEM     00540000
*                  INTO THE AREA PROVIDED BY THE CALLER OF THE GQSCAN   00550000
*                  MACRO.                                               00560000
*                                                                       00570000
*01*  DELETED-BY:  THE RIBS AND RIBES BUILT BY THE GRS QUEUE SCANNING   00580000
*                  MODULE IN THE GRS PRIVATE AREA ARE DELETED BY        00590000
*                  ISGQSCAN AFTER THEY ARE MOVED INTO THE AREA          00600000
*                  PROVIDED BY THE CALLER.                              00610000
*                                                                       00620000
*01*  POINTED-TO-BY:  POINTER IS MAINTAINED BY USER                     00630000
*                                                                       00640000
*01*  SERIALIZATION:  NO SERIALIZATION REQUIRED                         00650000
*                                                                       00660000
*01* FUNCTION:   CONTAINS INFORMATION DESCRIBING A RESOURCE AND         00670000
*                ANY REQUESTORS OF THAT RESOURCE. THE RESOURCE          00680000
*                INFORMATION BLOCK (RIB) DESCRIBES A GIVEN RESOURCE     00690000
*                AND THE RESOURCE INFORMATION BLOCK EXTENT (RIBE)       00700000
*                DESCRIBES EACH OWNER OR EACH WAITER FOR THAT           00710000
*                RESOURCE. THE VARIABLE SECTION OF THE RIB (RIBVAR)     00720000
*                IS LOCATED IMMEDIATELY AFTER THE RIB.                  00730000
*                                                                       00740000
*    For ISGECA requests only, the RIB can be used as follows:          00750000
*                                                                       00760000
*    1) Long Waiter List                                                00770000
*                                                                       00780000
*       There will be up to 'count' resources reflected in the list.    00790000
*       Each resource will have a single RIB (reflecting the resource   00800000
*       in contention), one RIBE for the top blocker of the resource,   00810000
*       and one RIBE for the long waiter of the resource.  RIBTOD will  00820000
*       be set to the time of day that the long waiter ENQueued on the  00830000
*       resource.  Other important fields:                              00840000
*                                                                       00850000
*       RIBNTO - total number of owners of the resource                 00860000
*       RIBNTWE - total number of exclusive waiters of the resource     00870000
*       RIBNTWS - total number of shared waiters of the resource        00880000
*       RIBTRIBE and RIBNRIBE - will be set to two                      00890000
*                                                                       00900000
*       Each of the RIBEs will be set to the appropriate information    00910000
*       obtained from the QEL/QXB representing the resource request     00920000
*                                                                       00930000
*    2) Long Blocker List                                               00940000
*                                                                       00950000
*       There will be up to 'count' resources reflected in the list.    00960000
*       Each resource will have a single RIB (reflecting the resource   00970000
*       in contention) and one RIBE for the top blocker of the          00980000
*       resource.  RIBTOD will be set to the time of day that the long  00990000
*       blocker began blocking the resource (not when it ENQueued on    01000000
*       the resource).                                                  01010000
*                                                                       01020000
*       RIBNTO - total number of owners of the resource                 01030000
*       RIBNTWE - total number of exclusive waiters of the resource     01040000
*       RIBNTWS - total number of shared waiters of the resource        01050000
*       RIBTRIBE and RIBNRIBE - will be set to one                      01060000
*                                                                       01070000
*       The RIBE will be set to the appropriate information obtained    01080000
*       from the QEL/QXB representing the resource request              01090000
*                                                                       01100000
*01* METHOD-OF-ACCESS:   BAL - DSECTS ARE PRODUCED, PERFORM USING       01110000
*                              ON RIB AND RIBE. TO ACCESS RIBVAR,       01120000
*                              USE: RIBPTR PLUS LENGTH OF THE RIB       01130000
*                              (I.E., THE LENGTH RETURNED BY THE        01140000
*                              GQSCAN MACRO)                            01150000
*                       PL/X - Default attributes for the mappings are: 01160000
*                              RIB BASED(RIBPTR) BDY(WORD)              01170000
*                              RIBVAR BASED BDY(WORD)                   01180000
*                              RIBE BASED(RIBEPTR) BDY(WORD)            01190000
*                              To access RIBVAR, use RIBPTR plus the    01200000
*                              length of the RIB (i.e. the length       01210000
*                              returned by GQSCAN).  The macro invoker  01220000
*                              must declare RIBPTR and RIBEPTR.         01230000
*                              To alter the default attributes, specify 01240000
*                              %RIBATTR = 'your attributes'             01250000
*                              %RIBVATTR = 'your attributes'            01260000
*                              %RIBEATTR = 'your attributes'       @L2C 01270000
*                                                                       01280000
*01*  CHANGE-ACTIVITY:                                                  01290000
*                                                                       01300000
*                       @ZMB0207 - SUPPORTS PTM PBB0207                 01310000
*                       @ZMB0421 - SUPPORTS PTM PBB0421                 01320000
* OY08322 - GRS ENHANCEMENTS FOR SERVICE ADDRESS SPACES:                01330000
*            A) GQSCAN OBTAINS REQUESTORS ASID FROM THE SERVICE         01340000
*               ADDRESS SPACE                                           01350000
*            B) DISPLAY GRS COMMAND DISPLAYS REQUESTORS JOBNAME         01360000
*               AND ASID                                       @YA08322 01370000
* $L1=4DGIT   ,HBB5510, 930304,PDDM: 4 Digit device support.  Add new   01380000
*                                    field RIBEDEVN                @L1A 01390000
* $P0=PIG2268 ,HBB5510, 930909,PDDM: SHOWHDR support               @P0A 01400000
* $L2=GRS32   ,JBB6602, 940621,PDBD: GRS Star Support.  New fields:     01410000
*                                      RIBEMATC, RIBEMATO, RIBEMASI,    01420000
*                                      RIBEMTCB                         01430000
*    =PSD0463 ,JBB6602, 951101,PDBD: SHOWHDR support                    01440000
*                                                                       01450000
* $D1=DQC0026 ,HBB6603, 960515,PDE1: Fix the PL/X support for RIBVATTR  01460000
*                                    and RIBEATTR.  Format PL/X         01470000
*                                    declaration using compiler         01480000
*                                    formatter.                         01490000
* $01=OW56587 ,HBB7707, 020927,PDK1: Enable ISGECA - remapped fields    01500000
*                                      moved here from ISGYRIB          01510000
* $P1=PJK1006 ,HBB7709, 031118,PDFY: Remove RIBETCBF               @P1A 01520000
* $P2=PJK1491 ,HBB7709, 040218,PDFY: Update RIBEPOST Comment       @P2A 01530000
* $L3=GRSTOR2 ,HBB7740, 060618,PDFY: Remove RIBQCB field           @L3A 01540000
*    =ME08489 ,HBB7740, 061201,PDRY: Correct copyright statement        01541001
*                                                                       01550000
*** END OF SPECIFICATIONS ********************************************/ 01560000
*/*A000000-999999                                           @G384P1M */ 01570000
*                                                                       01580000
*   %GO TO PLSRIB1;                                                     01590000
*                                                                       01600000
*/*                                                                     01610000
RIB      DSECT               RESOURCE INFORMATION BLOCK - FIXED SECTION 01620000
         DS    0F                                                       01630000
RibTOD   DS    2F            FOR ISGECA REQUESTS ONLY, THE TIME OF DAY  01640000
*                            A RESOURCE REQUEST BEGAN WAITING      @01A 01650000
         ORG   RibTOD                                              @01A 01660000
         DS    A             RESERVED                              @L3C 01670000
RIBCHAIN DS    A             POINTER TO NEXT RIB - USED BY ISGDSORT     01680000
*                            TO ALPHABETICALLY SORT RIBS BY RESOURCE    01690000
*                            NAME (QNAME AMD RNAME)                     01700000
RIBNTO   DS    F             NUMBER OF TASKS OWNING RESOURCE            01710000
RIBNTWE  DS    0F            NUMBER OF TASKS WAITING FOR EXCLUSIVE      01720000
*                            CONTROL OF RESOURCE                   @01C 01730000
RibQscanRC DS  F             FOR ISGECA REQUESTS ONLY, IF RIBNTO EQUALS 01740000
*                            -1 THEN THIS FIELD CONTAINS THE FAILING    01750000
*                            QSCAN RETURN CODE                     @01A 01760000
RIBNTWS  DS    0F            NUMBER OF TASKS WAITING FOR SHARED         01770000
*                            CONTROL OF RESOURCE                   @01C 01780000
RibQscanRsn DS F             FOR ISGECA REQUESTS ONLY, IF RIBNTO EQUALS 01790000
*                            -1 THEN THIS FIELD CONTAINS THE FAILING    01800000
*                            QSCAN REASON CODE                     @01A 01810000
RIBTRIBE DS    F             TOTAL NUMBER OF RESOURCE INFORMATION       01820000
*                            BLOCK EXTENTS ASSOCIATED WITH THIS RIB     01830000
RIBNRIBE DS    F             NUMBER OF RESOURCE INFORMATION BLOCK       01840000
*                            EXTENTS RETURNED WITH THIS RIB IN THE      01850000
*                            USER SPECIFIED AREA                        01860000
RIBVLEN  DS    H             LENGTH OF THE VARIABLE SECTION OF THE      01870000
*                            RIB (MULTIPLE OF FOUR)                     01880000
RIBSCOPE DS    BL1           SCOPE OF REQUEST FLAGS                     01890000
RIBSYS   EQU   X'80'         SYSTEM SCOPE (1 = SYSTEM, 0 = NONSYSTEM)   01900000
RIBSYSS  EQU   X'40'         SYSTEMS SCOPE (1 = SYSTEMS, 0 =            01910000
*                            NONSYSTEMS)                                01920000
RIBSTEP  EQU   X'20'         STEP SCOPE (1 = STEP, 0 = NONSTEP)         01930000
RIBGLBL  EQU   X'10'         GLOBAL RESOURCE INDICATOR                  01940000
*                            (1 = GLOBAL, 0 = LOCAL)                    01950000
RIBBIT1  EQU   X'08'         RESERVED                                   01960000
RIBBIT2  EQU   X'04'         RESERVED                                   01970000
RIBBIT3  EQU   X'02'         RESERVED                                   01980000
RIBBIT4  EQU   X'01'         RESERVED                                   01990000
RIBRNMLN DS    BL1           RNAME LENGTH                               02000000
RIBQNAME DS    CL8           QNAME - MAJOR NAME OF RESOURCE             02010000
RIBEND   DS    0F            END OF RIB FIXED SECTION                   02020000
RIBVAR   DSECT               RESOURCE INFORMATION BLOCK -               02030000
*                            VARIABLE SECTION                  @ZMB0421 02040000
         DS    0F                                              @ZMB0421 02050000
RIBRNAME DS    0X            RNAME - MINOR NAME OF RESOURCE    @ZMB0421 02060000
RIBE     DSECT               RESOURCE INFORMATION BLOCK EXTENT          02070000
         DS    0F                                                       02080000
RIBEJBNM DS    CL8           JOBNAME OF REQUESTOR                       02090000
RIBESYSN DS    CL8           SYSTEM NAME OF REQUESTOR                   02100000
RIBETCB  DS    A             TCB ADDRESS OF REQUESTOR                   02110000
RIBEECB  DS    A             ECB ADDRESS WHEN RIBEECBF IS ONE           02120000
         ORG   RIBEECB                                                  02130000
RIBESVRB DS    A             SVRB ADDRESS WHEN RIBEECBF IS ZERO         02140000
RIBEUCB  DS    A             If RIBE is for a RESERVE request from this 02150000
*                            system, against a 3-digit-device-number    02160000
*                            device, this field contains the UCB        02170000
*                            Address, otherwise, it is an arithmetic    02180000
*                            zero                                  @L1C 02190000
RIBEASID DS    H             ADDRESS SPACE ID OF REQUESTOR              02200000
RIBERFLG DS    BL1           FLAGS PERTAINING TO THE REQUEST            02210000
RIBETYPE EQU   X'80'         REQUEST TYPE (0 = EXCLUSIVE, 1 = SHARED)   02220000
RIBEMC   EQU   X'40'         MUST COMPLETE (MC) REQUEST                 02230000
*                            (1 = MC, 0 = NOT MC)                       02240000
RIBERESV EQU   X'20'         RESERVE REQUEST                            02250000
*                            (1 = RESERVE, 0 = NOT RESERVE)             02260000
RIBERESC EQU   X'10'         RESERVE REQUEST CONVERTED TO GLOBAL ENQ    02270000
*                            (1 = CONVERTED, 0 = NOT CONVERTED)         02280000
RIBEAUTH EQU   X'08'         AUTHORIZED CALLER                          02290000
*                            (1 = AUTHORIZED, 0 = UNAUTHORIZED)         02300000
RIBESIDV EQU   X'02'         RIBESAID VALIDITY FLAG            @YA08322 02310000
*                            (1 = RIBESAID VALID, 0 = RIBESAID          02320000
*                            NOT VALID).                           @L2C 02330000
RIBEMATC EQU   X'01'         This is a matching task (MASID/MTCB)      X02340000
                             request.  RIBEMASI and RIBEMTCB contain   X02350000
                             the ASID and TCB of the matching task.    X02360000
                                                                   @L2C 02370000
RIBELFLG DS    BL1           FLAGS PERTAINING TO A LIST REQUEST         02380000
RIBEPOST EQU   X'80'         The requester has been informed that the   02390000
*                            request has completed. The ECB has been    02400000
*                            posted or the requester's suspended TCB    02410000
*                            RB has been posted. Note that in Ring      02420000
*                            mode, when the request originated on       02430000
*                            another system and SYNCHRES was enabled    02440000
*                            on the requesting system at the time of    02450000
*                            the request, the requester may be waiting  02460000
*                            for synchronous reserve processing to      02470000
*                            complete.                             @P2C 02480000
RIBEECBF EQU   X'40'         ECB REQUEST                                02490000
*                            (1 = ECB, 0 = NOT ECB)                     02500000
RIBELRS1 EQU   X'20'         RESERVED                                   02510000
RIBELRS2 EQU   X'10'         RESERVED                                   02520000
RIBELRS3 EQU   X'08'         RESERVED                                   02530000
RIBELRS4 EQU   X'04'         RESERVED                                   02540000
RIBELRS5 EQU   X'02'         RESERVED                                   02550000
RIBELRS6 EQU   X'01'         RESERVED                                   02560000
RIBESFLG DS    BL1           STATUS FLAGS                               02570000
RIBESTAT EQU   X'80'         REQUEST STATUS                             02580000
*                            (0 = WAITING FOR RESOURCE,                 02590000
*                             1 = OWNS RESOURCE)                        02600000
RIBEMATO EQU   X'40'         Matching task use indicator               X02610000
                             (0 = Requestor is not using the resource  X02620000
                                  as the result of a MASID/MTCB        X02630000
                                  request                              X02640000
                              1 = Requestor is using the resource as   X02650000
                                  the result of a MASID/MTCB request)  X02660000
                                                                   @L2C 02670000
RIBESRS2 EQU   X'20'         RESERVED                                   02680000
RIBESRS3 EQU   X'10'         RESERVED                                   02690000
RIBESRS4 EQU   X'08'         RESERVED                                   02700000
RIBESRS5 EQU   X'04'         RESERVED                                   02710000
RIBESRS6 EQU   X'02'         RESERVED                                   02720000
RIBESRS7 EQU   X'01'         RESERVED                                   02730000
RIBERS01 DS    CL1           RESERVED                          @YA08322 02740000
RIBESAID DS    H             ASID of task for which a service PROVIDER  02750000
*                            performed this ENQ/RESERVE request.  If    02760000
*                            RIBESIDV is set, RIBEASID is the ASID of   02770000
*                            the service PROVIDER and RIBESAID is the   02780000
*                            ASID of the service REQUESTOR.  If         02790000
*                            RIBESAID is zero, the service REQUESTOR'S  02800000
*                            ASID is not available.                @L2C 02810000
RIBEDEVN DS    CL4           If RIBE is for a RESERVE request from this 02820000
*                            system, this field contains the EBCDIC     02830000
*                            device number of the device that was the   02840000
*                            target of the RESERVE, otherwise it is     02850000
*                            an arithmetic zero                    @L1A 02860000
RIBEMTCB DS    A             Matching task TCB value (MTCB) specified  X02870000
                             by the requestor.  Valid only when        X02880000
                             RIBEMATC is set.                      @L2A 02890000
RIBEMASI DS    H             Matching task TCB value (MASID) specified X02900000
                             by the requestor.  Valid only when        X02910000
                             RIBEMATC is set.                      @L2A 02920000
RIBERSVD DS    H             Reserved                              @L2A 02930000
RIBEEND  DS    0F            END OF RIBE                                02940000
         MEND                                                           02950000
*                                                                    */ 02960000
*                                                                       02970000
*%PLSRIB1:                                                              02980000
*   ;                                                                   02990000
*   %IF RIBATTR = '' %THEN                                              03000000
*     %RIBATTR = 'BASED(RIBPTR) BDY(WORD)'; /*                   @L2A*/ 03010000
*   %IF RIBVATTR = '' %THEN                                             03020000
*     %RIBVATTR = 'BASED BDY(WORD)'; /*                          @L2A*/ 03030000
*   %IF RIBEATTR = '' %THEN                                             03040000
*     %RIBEATTR = 'BASED(RIBEPTR) BDY(WORD)'; /*                 @L2A*/ 03050000
*   DECLARE                                                             03060000
*     1    RIB      RIBATTR,        /* RESOURCE INFORMATION BLOCK -     03070000
*                                      FIXED SECTION             @L2C*/ 03080000
*       3    RibTOD bit(64) bdy(word), /* For ISGECA requests only,     03090000
*                                      the time of day a resource       03100000
*                                      request began waiting     @01A*/ 03110000
*         5    *        PTR(31),    /* RESERVED                  @L3C*/ 03120000
*         5    RIBCHAIN PTR(31),    /* POINTER TO NEXT RIB - USED BY    03130000
*                                      ISGDSORT TO ALPHABETICALLY       03140000
*                                      SORT RIBS BY RESOURCE NAME       03150000
*                                      (QNAME AND RNAME)             */ 03160000
*       3    RIBNTO   FIXED(31),    /* NUMBER OF TASKS OWNING           03170000
*                                      RESOURCE                      */ 03180000
*       3    RIBNTWE  FIXED(31),    /* NUMBER OF TASKS WAITING FOR      03190000
*                                      EXCLUSIVE CONTROL OF RESOURCE */ 03200000
*         5  RibQscanRC fixed(31),  /* For ISGECA requests only, if     03210000
*                                      RibNTO equals -1, then this      03220000
*                                      field contains the failing       03230000
*                                      QSCAN return code         @01A*/ 03240000
*       3    RIBNTWS  FIXED(31),    /* NUMBER OF TASKS WAITING FOR      03250000
*                                      SHARED CONTROL OF RESOURCE    */ 03260000
*         5  RibQscanRsn fixed(31), /* For ISGECA requests only, if     03270000
*                                      RibNTO equals -1, then this      03280000
*                                      field contains the failing       03290000
*                                      QSCAN reason code         @01A*/ 03300000
*       3    RIBTRIBE FIXED(31),    /* TOTAL NUMBER OF RESOURCE         03310000
*                                      INFORATION BLOCK EXTENTS         03320000
*                                      ASSOCIATED WITH THIS RIB      */ 03330000
*       3    RIBNRIBE FIXED(31),    /* NUMBER OF RESOURCE INFORMATION   03340000
*                                      BLOCK EXTENTS RETURNED WITH      03350000
*                                      THIS RIB IN THE USER SPECIFIED   03360000
*                                      AREA                          */ 03370000
*       3    RIBVLEN  FIXED(15),    /* LENGTH OF THE VARIABLE SECTION   03380000
*                                      OF THE RIB (MULTIPLE OF FOUR) */ 03390000
*       3    RIBSCOPE BIT(8),       /* SCOPE OF REQUEST FLAGS        */ 03400000
*         5    RIBSYS   BIT(1),     /* SYSTEM SCOPE (1 = SYSTEM, 0 =    03410000
*                                      NONSYSTEM)                    */ 03420000
*         5    RIBSYSS  BIT(1),     /* SYSTEMS SCOPE (1 = SYSTEMS, 0    03430000
*                                      = NONSYSTEMS)                 */ 03440000
*         5    RIBSTEP  BIT(1),     /* STEP SCOPE (1 = STEP, 0 =        03450000
*                                      NONSTEP)                      */ 03460000
*         5    RIBGLBL  BIT(1),     /* GLOBAL RESOURCE INDICATOR (1 =   03470000
*                                      GLOBAL, 0 = LOCAL)            */ 03480000
*         5    RIBBIT1  BIT(1),     /* RESERVED                      */ 03490000
*         5    RIBBIT2  BIT(1),     /* RESERVED                      */ 03500000
*         5    RIBBIT3  BIT(1),     /* RESERVED                      */ 03510000
*         5    RIBBIT4  BIT(1),     /* RESERVED                      */ 03520000
*       3    RIBRNMLN FIXED(8),     /* RNAME LENGTH                  */ 03530000
*       3    RIBQNAME CHAR(8),      /* QNAME - MAJOR NAME OF RESOURCE*/ 03540000
*       3    RIBEND   CHAR(0) BDY(WORD); /* END OF RIB FIXED SECTION */ 03550000
*   DECLARE                                                             03560000
*     1    RIBVAR   RIBVATTR,       /* RESOURCE INFORMATION BLOCK -     03570000
*                                      VARIABLE SECTION          @D1C*/ 03580000
*       3    RIBRNAME CHAR(*);      /* RNAME - MINOR NAME OF RESOURCE   03590000
*                                                            @ZMB0421*/ 03600000
*   DECLARE                                                             03610000
*     1    RIBE     RIBEATTR,       /* RESOURCE INFORMATION BLOCK       03620000
*                                      EXTENT                    @D1C*/ 03630000
*       3    RIBEJBNM CHAR(8),      /* JOBNAME OF REQUESTOR          */ 03640000
*       3    RIBESYSN CHAR(8),      /* SYSTEM NAME OF REQUESTOR      */ 03650000
*       3    RIBETCB  PTR(31),      /* TCB ADDRESS OF REQUESTOR      */ 03660000
*       3    RIBEECB  PTR(31),      /* ECB ADDRESS WHEN RIBEECBF IS     03670000
*                                      ONE                           */ 03680000
*         5    RIBESVRB PTR(31),    /* SVRB ADDRESS WHEN RIBEECBF IS    03690000
*                                      ZERO                          */ 03700000
*       3    RIBEUCB  PTR(31),      /* If RIBE is for a RESERVE         03710000
*                                      request from this system,        03720000
*                                      against a                        03730000
*                                      3-digit-device-number device,    03740000
*                                      this field contains the UCB      03750000
*                                      Address, otherwise, it is an     03760000
*                                      arithmetic zero           @L1C*/ 03770000
*       3    RIBEASID FIXED(15),    /* ADDRESS SPACE ID OF REQUESTOR */ 03780000
*       3    RIBERFLG BIT(8),       /* FLAGS PERTAINING TO THE          03790000
*                                      REQUEST                       */ 03800000
*         5    RIBETYPE BIT(1),     /* REQUEST TYPE (0 = EXCLUSIVE, 1   03810000
*                                      = SHARED)                     */ 03820000
*         5    RIBEMC   BIT(1),     /* MUST COMPLETE (MC) REQUEST (1    03830000
*                                      = MC, 0 = NOT MC)             */ 03840000
*         5    RIBERESV BIT(1),     /* RESERVE REQUEST (1 = RESERVE,    03850000
*                                      0 = NOT RESERVE)              */ 03860000
*         5    RIBERESC BIT(1),     /* RESERVE REQUEST CONVERTED TO     03870000
*                                      GLOBAL ENQ (1 = CONVERTED, 0 =   03880000
*                                      NOT CONVERTED)                */ 03890000
*         5    RIBEAUTH BIT(1),     /* AUTHORIZED CALLER (1 =           03900000
*                                      AUTHORIZED, 0 = UNAUTHORIZED) */ 03910000
*         5    *        BIT(1),     /* Reserved forever.         @P1C*/ 03920000
*         5    RIBESIDV BIT(1),     /* RIBESAID VALIDITY FLAG (1 =      03930000
*                                      RIBESAID VALID, 0 = RIBESAID     03940000
*                                      NOT VALID).               @L2C*/ 03950000
*         5    RIBEMATC BIT(1),     /* This is a matching task          03960000
*                                      (MASID/MTCB) request. RIBEMASI   03970000
*                                      and RIBEMTCB contain the ASID    03980000
*                                      and TCB of the matching task.    03990000
*                                                                @L2C*/ 04000000
*       3    RIBELFLG BIT(8),       /* FLAGS PERTAINING TO A LIST       04010000
*                                      REQUEST                       */ 04020000
*         5    RIBEPOST BIT(1),     /* The requester has been informed  04030000
*                                      that the request has completed.  04040000
*                                      The ECB has been posted or       04050000
*                                      the requester's suspended TCB    04060000
*                                      RB has been posted. Note that    04070000
*                                      in Ring mode, when the request   04080000
*                                      originated on another system     04090000
*                                      and SYNCHRES was enabled on the  04100000
*                                      requesting system at the time of 04110000
*                                      the request, the requester may   04120000
*                                      be waiting for synchronous       04130000
*                                      reserve processing to complete.  04140000
*                                                                @P2C*/ 04150000
*         5    RIBEECBF BIT(1),     /* ECB REQUEST (1 = ECB, 0 = NOT    04160000
*                                      ECB)                          */ 04170000
*         5    RIBELRS1 BIT(1),     /* RESERVED                      */ 04180000
*         5    RIBELRS2 BIT(1),     /* RESERVED                      */ 04190000
*         5    RIBELRS3 BIT(1),     /* RESERVED                      */ 04200000
*         5    RIBELRS4 BIT(1),     /* RESERVED                      */ 04210000
*         5    RIBELRS5 BIT(1),     /* RESERVED                      */ 04220000
*         5    RIBELRS6 BIT(1),     /* RESERVED                      */ 04230000
*       3    RIBESFLG BIT(8),       /* STATUS FLAGS                  */ 04240000
*         5    RIBESTAT BIT(1),     /* REQUEST STATUS (0 = WAITING      04250000
*                                      FOR RESOURCE, 1 = OWNS           04260000
*                                      RESOURCE)                     */ 04270000
*         5    RIBEMATO BIT(1),     /* Matching task use indicator (0   04280000
*                                      = Requestor is not using the     04290000
*                                      resource as the result of a      04300000
*                                      MASID/MTCB request 1 =           04310000
*                                      Requestor is using the           04320000
*                                      resource as the result of a      04330000
*                                      MASID/MTCB request)       @L2C*/ 04340000
*         5    RIBESRS2 BIT(1),     /* RESERVED                      */ 04350000
*         5    RIBESRS3 BIT(1),     /* RESERVED                      */ 04360000
*         5    RIBESRS4 BIT(1),     /* RESERVED                      */ 04370000
*         5    RIBESRS5 BIT(1),     /* RESERVED                      */ 04380000
*         5    RIBESRS6 BIT(1),     /* RESERVED                      */ 04390000
*         5    RIBESRS7 BIT(1),     /* RESERVED                      */ 04400000
*       3    RIBERS01 CHAR(1),      /* RESERVED              @YA08322*/ 04410000
*       3    RIBESAID FIXED(15),    /* ASID of task for which a         04420000
*                                      service PROVIDER performed       04430000
*                                      this ENQ/RESERVE request. If     04440000
*                                      RIBESIDV is set, RIBEASID is     04450000
*                                      the ASID of the service          04460000
*                                      PROVIDER and RIBESAID is the     04470000
*                                      ASID of the service REQUESTOR.   04480000
*                                      If RIBESAID is zero, the         04490000
*                                      service REQUESTOR'S ASID is      04500000
*                                      not available.            @L2C*/ 04510000
*       3    RIBEDEVN CHAR(4),      /* If RIBE is for a RESERVE         04520000
*                                      request request from this        04530000
*                                      system, this field contains      04540000
*                                      the EBCDIC device number of      04550000
*                                      the device that was the target   04560000
*                                      of the RESERVE, otherwise it     04570000
*                                      is an artihmetic zero     @L1A*/ 04580000
*       3    RIBEMTCB PTR(31),      /* Matching task TCB value (MTCB)   04590000
*                                      specified by the requestor.      04600000
*                                      Valid only when RIBEMATC is      04610000
*                                      set.                      @L2A*/ 04620000
*       3    RIBEMASI FIXED(15),    /* Matching task TCB value          04630000
*                                      (MASID) specified by the         04640000
*                                      requestor. Valid only when       04650000
*                                      RIBEMATC is set.          @L2A*/ 04660000
*       3    RIBERSVD CHAR(2),      /* Reserved                  @L2A*/ 04670000
*       3    RIBEEND  CHAR(0) BDY(WORD); /* END OF RIBE              */ 04680000
