*                                                                       00001000
* %DCL ISGYNQXP_INCLUDED CHAR EXT;                                      00002000
* %DEACTIVATE ISGYNQXP_INCLUDED;                                        00003000
* %IF ISGYNQXP_INCLUDED = '' %THEN                                      00004000
* %DO;                                                                  00005000
*/* Macro made bi-lingual on 13023. CBGEN compile date 12258         */ 00006000
*% /*                                                                   00007000
         MACRO                                                          00008000
         ISGYNQXP &DSECT=YES,&LIST=YES,&TITLE=YES,&NQXP=YES             00009000
         GBLC  &ISGYNQXP_INCLUDED                                       00010000
         GBLC  &ZCBPRINT                                                00011000
&ISGYNQXP_INCLUDED SETC 'YES'                                           00012000
         AIF   ('&LIST' EQ 'NONE').P0                                   00013000
         AIF   ('&TITLE' EQ 'NO').P5                                    00014000
 TITLE   'ISGYNQXP  - ENQ Exit Parameter List                        '  00015000
.P5      ANOP                                                           00016000
**/ ISGYNQXP_1:;                                                        00017000
*/* START OF SPECIFICATIONS ******************************************* 00018000
*                                                                       00019000
*01* DESCRIPTIVE NAME:  ENQ Exit Parameter List                         00020000
*02*  ACRONYM:  NQXP                                                    00021000
*                                                                       00022000
*01*  PROPRIETARY STATEMENT =                                           00023000
*                                                                       00024000
*    LICENSED MATERIALS - PROPERTY OF IBM                               00025000
*    5650-ZOS COPYRIGHT IBM CORP. 2001,2013                             00026000
*                                                                       00027000
*01* STATUS = HBB7790                                                   00028000
*                                                                       00029000
*01* EXTERNAL CLASSIFICATION: PI                                        00030000
*01* END OF EXTERNAL CLASSIFICATION:                                    00031000
*                                                                       00032000
*01* MACRO NAME: ISGYNQXP                                               00033000
*                                                                       00034000
*01* DSECT NAME: NQXP                                                   00035000
*                                                                       00036000
*01* COMPONENT:  Global Resource Serialization (SCSDS)                  00037000
*                                                                       00038000
*01* EYE-CATCHER:  NQXP                                                 00039000
*02*  OFFSET:  0                                                        00040000
*02*  LENGTH:  4                                                        00041000
*                                                                       00042000
*01* STORAGE ATTRIBUTES:                                                00043000
*02*  SUBPOOL:  215                                                     00044000
*02*  KEY:  0                                                           00045000
*02*  RESIDENCY:  Above the 16M line                                    00046000
*                                                                       00047000
*01* SIZE:  LENGTH(NQXP)                                                00048000
*            NQXP -- X'0088' bytes                                      00049000
*                                                                       00050000
*01* FREQUENCY:  1 per active ENQ/DEQ request                           00051000
*                                                                       00052000
*01* CREATED BY: ISGGNX                                                 00053000
*                                                                       00054000
*01* POINTED TO BY: R1 points to the NQXP on entry to the exit routine  00055000
*                                                                       00056000
*01* SERIALIZATION: N/A                                                 00057000
*                                                                       00058000
*01* FUNCTION: The ENQ Exit Parameter List provides an installation     00059000
*              provided exit (installed at the ISGNQXIT or ISGNQXITFAST 00060000
*              exit point) the ability to modify attributes of an ENQ,  00061000
*              RESERVE or DEQ request.  However, on an ISGENQ           00062000
*              Request (Release) or (Change) the installation exit will 00063000
*              be presented with the request, but any changes to the    00064000
*              attributes will not be honored.                          00065000
*                                                                       00066000
*              The exit routine may change any of the following         00067000
*              values in the NQXP.  Appropriate changes will be made    00068000
*              to the request.                                          00069000
*                                                                       00070000
*                          Value                      Flag              00071000
*              ------------------------------- --------------------     00072000
*              Nqxp_CP_QName                   Nqxp_RF1_ChangeQName     00073000
*              Nqxp_CP_RName, Nqxp_CP_RNameLen Nqxp_RF1_ChangeRName (1) 00074000
*              Nqxp_CP_Scope                   Nqxp_RF1_ChangeScope     00075000
*              Nqxp_CP_UCB@                    Nqxp_RF1_ChangeUCB@      00076000
*              (to bypass RNL processing)      Nqxp_RF1_BypassRNLs      00077000
*                                                                       00078000
*              (1) When changing the RName, do not alter the virtual    00079000
*                  storage address value contained in Nqxp_CP_RName@.   00080000
*                  Instead, alter the RName at the virtual storage      00081000
*                  area designated by Nqxp_CP_RName@ virtual storage    00082000
*                  address value. The routine calling the exit provides 00083000
*                  enough storage to save a 255 byte RName at that      00084000
*                  address.                                             00085000
*                                                                       00086000
*              The Nqxp_RequestToken is used to correlate the different 00087000
*              exits called by ENQ/DEQ processing.  Each request is     00088000
*              assigned a unique 8 byte token that will be propagated   00089000
*              to each exit point called for the ENQ/DEQ request.       00090000
*                                                                       00091000
*              Nqxp_WorkArea@ points to a 4K work area that can be used 00092000
*              as working storage by exit routines.  However, this area 00093000
*              CANNOT be used to pass information between exit routines 00094000
*              or other ENQ/DEQ exit points.                            00095000
*                                                                       00096000
*01* METHOD OF ACCESS: DECLARE NQXPPTR PTR(31)                          00097000
*                      %INCLUDE SYSLIB(ISGYNQXP)                        00098000
*                                                                       00099000
*01* DELETED BY: ISGGNX                                                 00100000
*                                                                       00101000
*01* NOTES: None                                                        00102000
*                                                                       00103000
*02*  DEPENDENCIES:                                                     00104000
*                                                                       00105000
*01* DISTRIBUTION LIBRARY: AMACLIB                                      00106000
*                                                                       00107000
*01* CHANGE ACTIVITY:                                                   00108000
*                                                                       00109000
*    $L0=GRSWC   ,HBB7705,001103,PDBD: GRS Wildcard                     00110000
*    $L1=64GRS   ,HBB7709,030619,PD2V: GRS 64                           00111000
*    $01=OA01861 ,HBB7707,031111,PDBC: performance improvement          00112000
*    $P1=64GRS   ,HBB7709,031215,PD2V: add ISGENQ state flag bit        00113000
*       =ME03930 ,HBB7730,050808,PDCJ: Fix copyright                    00114000
*    $P2=ME05220 ,HBB7730,060109,PDRY: Update comments                  00115000
*    $02=OA13398 ,HBB7720,051209,PDFX: Update UCB@ and VOLSER comment   00116000
*    $L2=GRSRSNS ,HBB7750,070403,PDFX: Add more ISGENQ data             00117000
*    $P3=ME10689 ,HBB7750,070731,PDFY: Update comments                  00118000
*    $L3=GRSCHNG ,HBB7790,110217,PDFY: Change to share indication       00119000
*                                                                       00120000
**** END OF SPECIFICATIONS *******************************************/ 00121000
*% /*                                                                   00122000
.P0      ANOP                                                           00123000
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 00124000
         AIF   ('&LIST' EQ 'YES').P2                                    00125000
.P1      ANOP                                                           00126000
         PUSH  PRINT                                                    00127000
         PRINT OFF                                                      00128000
.P2      ANOP                                                           00129000
         AIF   ('&NQXP' EQ 'NO').L0002                                  00130000
         AIF   ('&DSECT' EQ 'YES').L0003                                00131000
         AIF   ('&NQXP' NE 'YES').L0002                                 00132000
.L0003   ANOP                                                           00133000
*                                                                       00134000
*   Change summary **************************************************** 00135000
* Create exit macro interface                                           00136000
**********************************************************************  00137000
*                                                                       00138000
*                                                                       00139000
         AIF   ('&DSECT' EQ 'YES').L0004                                00140000
NQXP     DS    0D                                                       00141000
         AGO   .L0005                                                   00142000
.L0004   ANOP                                                           00143000
NQXP     DSECT                                                          00144000
.L0005   ANOP                                                           00145000
NQXP_ID  DS    CL4       Eyecatcher                                     00146000
NQXP_VERSION DS X        Version                                        00147000
         DS    CL3       Reserved                                       00148000
NQXP_REQUESTDATA DS 0CL40 ENQ/DEQ request state information, these     *00149000
                         values cannot be changed                       00150000
NQXP_RD_ASCB@ DS A       Pointer to requester's ASCB                    00151000
NQXP_RD_TCB@ DS A        Pointer to requester's TCB or directed TCB if *00152000
                         TCB= was specified                             00153000
NQXP_RD_VOLSER DS CL6    VOLSER of requested UCB, see Nqxp_OP_Ucb@.    *00154000
                         Only valid when Nqxp_SF1_ENQ is set.           00155000
NQXP_RD_MASID DS H       Request MASID value                            00156000
NQXP_RD_MTCB DS A        Request MTCB value                             00157000
NQXP_RD_RET DS 0X        Request RET value, see Nqxp_kRET values        00158000
NQXP_RD_RET1 EQU X'04'   Maps to PELRET1                                00159000
NQXP_RD_RET2 EQU X'02'   Maps to PELRET2                                00160000
NQXP_RD_RET3 EQU X'01'   Maps to PELRET3                                00161000
         ORG   NQXP_RD_RET+1                                            00162000
         DS    CL3       Reserved                                       00163000
NQXP_RD_JOBNAME DS CL8   Requester's Jobname                            00164000
NQXP_RD_SYSNAME DS CL8   Requester's Sysname                            00165000
NQXP_STATEFLAGS DS 0CL8  ENQ/DEQ request state flags, these values     *00166000
                         cannot be changed                              00167000
NQXP_STATEFLAGS1 DS 0B   First byte of state flags                      00168000
NQXP_SF1_ENQ EQU X'80'   When 1, request is ENQ/RESERVE, when 0,       *00169000
                         request is DEQ. If Nqxp_SF1_ISGENQ is set     *00170000
                         then when 1, ISGENQ REQUEST=OBTAIN or CHANGE, *00171000
                         when 0, REQUEST=RELEASE. See Nqxp_SF2_Change  *00172000
                         to distinguish between ISGENQ REQUEST=OBTAIN  *00173000
                         and REQUEST=CHANGE.                            00174000
NQXP_SF1_RNLEQNO EQU X'40' RNL=NO was specified on the request: a      *00175000
                         change to the scope or UCB@ by the exit will  *00176000
                         not be honored                                 00177000
NQXP_SF1_AUTHORIZED EQU X'20' Caller is authorized                      00178000
NQXP_SF1_SHARE EQU X'10' For ENQ/RESERVE requests, when 1 request is   *00179000
                         for shared access, when 0, request is for     *00180000
                         exclusive access                               00181000
NQXP_SF1_MATCHTASK EQU X'08' When 1, request specified MASID/MTCB       00182000
NQXP_SF1_STEPMUSTCOMPLETE EQU X'04' When 1, ENQ request specified      *00183000
                         SMC=YES                                        00184000
NQXP_SF1_RESETMUSTCOMPLETE EQU X'04' When 1, DEQ request specified     *00185000
                         RMC=YES                                        00186000
NQXP_SF1_LINKAGE EQU X'02' When 1, request is PC entered, When 0,      *00187000
                         request is SVC entered. As ISGENQ requests    *00188000
                         are all PC entered, this bit will be 1 for    *00189000
                         all ISGENQ requests.                           00190000
NQXP_SF1_ISGENQ EQU X'01' When 1, request is ISGENQ request             00191000
         ORG   NQXP_STATEFLAGS1+1                                       00192000
NQXP_STATEFLAGS2 DS 0B   State flags byte two                           00193000
NQXP_SF2_ISGENQCONDYES EQU X'80' When 1, request is a conditional      *00194000
                         ISGENQ request (ISGENQ COND=YES)               00195000
NQXP_SF2_CHANGE EQU X'20' When 1, request is a change (i.e. ENQ        *00196000
                         RET=CHNG or ISGENQ REQUEST=CHANGE).            00197000
NQXP_SF2_TEST_YES EQU X'10' When 1, ISGENQ with TEST=YES. When 0, Not  *00198000
                         ISGENQ with TEST=YES (i.e. TEST=NO if         *00199000
                         Nqxp_SF1_ISGENQ is set).                       00200000
NQXP_SF2_CONTENTIONACT_FAIL EQU X'08' When 1, ISGENQ with              *00201000
                         CONTENTIONACT=FAIL. When 0, not               *00202000
                         CONTENTIONACT=FAIL (i.e. CONTENTIONACT=WAIT   *00203000
                         if Nqxp_SF1_ISGENQ is set and                 *00204000
                         Nqxp_SF2_TEST_YES is off).                     00205000
NQXP_SF2_ECB EQU X'04'   When 1, ECB keyword specified (i.e. ISGENQ    *00206000
                         WAITTYPE=ECB or or ENQ with ECB). When 0, No  *00207000
                         ECB specified (i.e. WAITTYPE=SUSPEND if       *00208000
                         Nqxp_SF1_ISGENQ is set and Nqxp_SF2_TEST_YES  *00209000
                         and Nqxp_SF2_CONTENTIONACT_FAIL are off).      00210000
NQXP_SF2_CHANGETOSHARED EQU X'02' When 1, ISGENQ REQUEST=CHANGE        *00211000
                         specified CONTROL=SHARED. If the request is   *00212000
                         successful, the requester will be converted   *00213000
                         from an exclusive owner to a shared owner.    *00214000
                         Only valid when Nqxp_SF2_Change is 1.          00215000
         ORG   NQXP_STATEFLAGS2+1                                       00216000
         DS    CL6       Reserved                                       00217000
NQXP_ORIGINALPARAMETERS DS 0CL20 Original parameters specified on the  *00218000
                         request                                        00219000
NQXP_OP_QNAME DS CL8     Original request QNAME                         00220000
NQXP_OP_RNAME@ DS A      Pointer to original request RNAME              00221000
NQXP_OP_RNAMELEN DS X    Length of original request RNAME. When 0,     *00222000
                         request is a generic DEQ                       00223000
NQXP_OP_SCOPE DS X       Original request scope, see Nqxp_kScope       *00224000
                         values                                         00225000
         DS    CL2       Reserved                                       00226000
NQXP_OP_UCB@ DS A        Pointer to original request UCB (set for      *00227000
                         RESERVE). Only valid when Nqxp_SF1_ENQ is set  00228000
NQXP_REQUESTFLAGS DS 0CL4 Request flags                                 00229000
NQXP_REQUESTFLAGS1 DS 0B First byte of request flags                    00230000
NQXP_RF1_BYPASSRNLS EQU X'80' When 1, request that RNL processing is   *00231000
                         to be bypassed                                 00232000
NQXP_RF1_CHANGEQNAME EQU X'40' When 1, request that the QNAME be       *00233000
                         changed                                        00234000
NQXP_RF1_CHANGERNAME EQU X'20' When 1, request that the RNAME be       *00235000
                         changed                                        00236000
NQXP_RF1_CHANGESCOPE EQU X'10' When 1, request that the Scope be       *00237000
                         changed                                        00238000
NQXP_RF1_CHANGEUCB@ EQU X'08' When 1, request that the UCB address be  *00239000
                         changed                                        00240000
         ORG   NQXP_REQUESTFLAGS1+1                                     00241000
         DS    CL3       Reserved                                       00242000
         DS    CL4       Reserved                                       00243000
NQXP_CURRENTPARAMETERS DS 0CL20 Parameters as changed by the exit      *00244000
                         routines                                       00245000
NQXP_CP_QNAME DS CL8     Current request QNAME                          00246000
NQXP_CP_RNAME@ DS A      Pointer to current request RNAME               00247000
NQXP_CP_RNAMELEN DS X    Length of current request RNAME                00248000
NQXP_CP_SCOPE DS X       Current request scope, see Nqxp_kScope values  00249000
         DS    CL2       Reserved                                       00250000
NQXP_CP_UCB@ DS A        Current request UCB address                    00251000
NQXP_REQUESTDATA2 DS 0CL8 More request data                             00252000
NQXP_RD_NSI@ DS 0A       Requester's next sequential instruction       *00253000
                         address, when ENQ/DEQ ends, this is address   *00254000
                         of the next instruction in the calling        *00255000
                         program that will be executed                  00256000
NQXP_RD_AMODE31 EQU X'80' When set, ENQ caller is AMODE 31              00257000
         ORG   NQXP_RD_NSI@+4                                           00258000
         DS    CL4       Reserved                                       00259000
NQXP_WORKAREA@ DS A      Pointer to a 4K work area, usable by exit     *00260000
                         routines                                       00261000
NQXP_REQUESTTOKEN DS CL16 Unique token for this request, all exits     *00262000
                         driven for this request can be identified by  *00263000
                         this token                                     00264000
         DS    CL4       Reserved                                       00265000
NQXP_END DS    0C        End of NQXP                                    00266000
*                                                                       00267000
*   ******************************************************************  00268000
*                                                                       00269000
*                          NQXP Constants                               00270000
*                                                                       00271000
*   ******************************************************************  00272000
*                                                                       00273000
*                                                                       00274000
NQXP_KID EQU   C'NQXP'   Used to identify control block                 00275000
NQXP_KVERSION#0 EQU 0    Version 0 - base                               00276000
NQXP_KVERSION#1 EQU 1    Version 1 - ISGNQXITFAST support available     00277000
NQXP_KVERSION#2 EQU 2    Version constant - HBB7709                     00278000
NQXP_KVERSION#3 EQU 3    Version constant- HBB7750                      00279000
NQXP_KCURRENTVERSION EQU 3 Current version                              00280000
NQXP_KSCOPESYSTEM EQU 1  Scope=System                                   00281000
NQXP_KSCOPESYSTEMS EQU 2 Scope=Systems                                  00282000
NQXP_KSCOPESYSPLEX EQU 2 Scope=Sysplex                                  00283000
NQXP_KRETNONE EQU 0      Ret=None                                       00284000
NQXP_KRETHAVE EQU 1      Ret=Have                                       00285000
NQXP_KRETCHNG EQU 2      Ret=Chng                                       00286000
NQXP_KRETUSE EQU 3       Ret=Use                                        00287000
NQXP_KRETTEST EQU 7      Ret=Test                                       00288000
NQXP_KRNAMELEN EQU 256   Maximum RName length                           00289000
NQXP_KLENGTH EQU 648     Maximum length Nqxp, parameter list and 2     *00290000
                         RNames                                         00291000
NQXP_LEN EQU   *-NQXP                                                   00292000
.L0002   ANOP                                                           00293000
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 00294000
         AIF   ('&LIST' EQ 'YES').P4                                    00295000
.P3      ANOP                                                           00296000
         POP   PRINT                                                    00297000
.P4      ANOP                                                           00298000
.P_EXIT  ANOP                                                           00299000
         MEND                                                           00300000
**/ ISGYNQXP_2:;                                                        00301000
* %ISGYNQXP_INCLUDED = 'YES';                                           00302000
* %DCL ZCBPRINT CHAR EXT;                                               00303000
* %DEACTIVATE ZCBPRINT;                                                 00304000
* %DCL ISGYNQXP_LIST CHAR EXT;                                          00305000
* %DEACTIVATE ISGYNQXP_LIST;                                            00306000
* %IF ISGYNQXP_LIST ^= 'NO' &                                           00307000
*    ZCBPRINT ^= 'NO' %THEN                                             00308000
*   %GOTO ISGYNQXP_3;                                                   00309000
*   @LIST PUSH NOECHO;                                                  00310000
*   @LIST NOASSEMBLE NOECHO;                                            00311000
*   @LIST OFF C NOECHO;                                                 00312000
* %ISGYNQXP_3:;                                                         00313000
*/* Start of PL/X Source                                             */ 00314000
*@list push noecho;                                                     00315000
*@list off noecho;                                                      00316000
*/* Change summary **************************************************** 00317000
* Create exit macro interface                                           00318000
**********************************************************************/ 00319000
*@list pop noecho;                                                      00320000
*%if NqxpAttr = '' %then                                                00321000
*  %NqxpAttr = 'based(NqxpPtr) bdy(dword)';                             00322000
*dcl                                                                    00323000
*   1 NQXP NqxpAttr                                                     00324000
*  ,  3 Nqxp_Id char(4)             /* Eyecatcher                    */ 00325000
*  ,  3 Nqxp_Version fixed(8)       /* Version                       */ 00326000
*  ,  3 * char(3)                   /* Reserved                      */ 00327000
*  ,  3 Nqxp_RequestData            /* ENQ/DEQ request state            00328000
*                                      information, these values        00329000
*                                      cannot be changed             */ 00330000
*  ,    5 Nqxp_RD_Ascb@ ptr(31)     /* Pointer to requester's ASCB   */ 00331000
*  ,    5 Nqxp_RD_Tcb@ ptr(31)      /* Pointer to requester's TCB or    00332000
*                                      directed TCB if TCB= was         00333000
*                                      specified                     */ 00334000
*  ,    5 Nqxp_RD_VolSer char(6)    /* VOLSER of requested UCB, see     00335000
*                                      Nqxp_OP_Ucb@. Only valid when    00336000
*                                      Nqxp_SF1_ENQ is set.      @02A*/ 00337000
*  ,    5 Nqxp_RD_MAsid fixed(15)   /* Request MASID value           */ 00338000
*  ,    5 Nqxp_RD_MTcb ptr(31)      /* Request MTCB value            */ 00339000
*  ,    5 Nqxp_RD_Ret fixed(8)      /* Request RET value, see           00340000
*                                      Nqxp_kRET values              */ 00341000
*  ,      7 * bit(5)                /* Unused                        */ 00342000
*  ,      7 Nqxp_RD_Ret1 bit(1)     /* Maps to PELRET1               */ 00343000
*  ,      7 Nqxp_RD_Ret2 bit(1)     /* Maps to PELRET2               */ 00344000
*  ,      7 Nqxp_RD_Ret3 bit(1)     /* Maps to PELRET3               */ 00345000
*  ,    5 * char(3)                 /* Reserved                      */ 00346000
*  ,    5 Nqxp_RD_Jobname char(8)   /* Requester's Jobname           */ 00347000
*  ,    5 Nqxp_RD_Sysname char(8)   /* Requester's Sysname           */ 00348000
*  ,  3 Nqxp_StateFlags             /* ENQ/DEQ request state flags,     00349000
*                                      these values cannot be changed   00350000
*                                                                    */ 00351000
*  ,    5 Nqxp_StateFlags1 bit(8)   /* First byte of state flags     */ 00352000
*  ,      7 Nqxp_SF1_ENQ bit(1)     /* When 1, request is ENQ/RESERVE,  00353000
*                                      when 0, request is DEQ.          00354000
*                                      If Nqxp_SF1_ISGENQ is set then   00355000
*                                      when 1, ISGENQ REQUEST=OBTAIN or 00356000
*                                      CHANGE, when 0, REQUEST=RELEASE. 00357000
*                                      See Nqxp_SF2_Change to           00358000
*                                      distinguish between ISGENQ       00359000
*                                      REQUEST=OBTAIN and               00360000
*                                      REQUEST=CHANGE.           @L2C*/ 00361000
*  ,      7 Nqxp_SF1_RnlEqNo bit(1) /* RNL=NO was specified on the      00362000
*                                      request:  a change to the scope  00363000
*                                      or UCB@ by the exit will not     00364000
*                                      be honored                @P2C*/ 00365000
*  ,      7 Nqxp_SF1_Authorized bit(1) /* Caller is authorized       */ 00366000
*  ,      7 Nqxp_SF1_Share bit(1)   /* For ENQ/RESERVE requests, when   00367000
*                                      1 request is for shared access,  00368000
*                                      when 0, request is for           00369000
*                                      exclusive access              */ 00370000
*  ,      7 Nqxp_SF1_MatchTask bit(1) /* When 1, request specified      00371000
*                                      MASID/MTCB                    */ 00372000
*  ,      7 Nqxp_SF1_StepMustComplete bit(1) /* When 1, ENQ request     00373000
*                                      specified SMC=YES             */ 00374000
*  ,        9 Nqxp_SF1_ResetMustComplete bit(1) /* When 1, DEQ request  00375000
*                                      specified RMC=YES             */ 00376000
*  ,      7 Nqxp_SF1_Linkage bit(1) /* When 1, request is PC entered,   00377000
*                                      When 0, request is SVC entered.  00378000
*                                      As ISGENQ requests are all PC    00379000
*                                      entered, this bit will be 1 for  00380000
*                                      all ISGENQ requests.      @P3C*/ 00381000
*  ,      7 Nqxp_SF1_ISGENQ bit(1)  /* When 1, request is ISGENQ        00382000
*                                      request                   @P1A*/ 00383000
*  ,    5 Nqxp_StateFlags2 bit(8)   /* State flags byte two      @L2A*/ 00384000
*  ,      7 Nqxp_SF2_IsgEnqCondYes bit(1) /* When 1, request is a       00385000
*                                      conditional ISGENQ request       00386000
*                                      (ISGENQ COND=YES)         @L2A*/ 00387000
*  ,      7 * bit(1)                /* Reserved                  @L2A*/ 00388000
*  ,      7 Nqxp_SF2_Change bit(1)  /* When 1, request is a change      00389000
*                                      (i.e. ENQ RET=CHNG or ISGENQ     00390000
*                                      REQUEST=CHANGE).          @L2A*/ 00391000
*  ,      7 Nqxp_SF2_TEST_YES bit(1) /* When 1, ISGENQ with TEST=YES.   00392000
*                                      When 0, Not ISGENQ with TEST=YES 00393000
*                                      (i.e. TEST=NO if                 00394000
*                                      Nqxp_SF1_ISGENQ is set).  @L2A*/ 00395000
*  ,      7 Nqxp_SF2_CONTENTIONACT_FAIL bit(1) /* When 1, ISGENQ with   00396000
*                                      CONTENTIONACT=FAIL.              00397000
*                                      When 0, not CONTENTIONACT=FAIL   00398000
*                                      (i.e. CONTENTIONACT=WAIT if      00399000
*                                      Nqxp_SF1_ISGENQ is set and       00400000
*                                      Nqxp_SF2_TEST_YES is off).       00401000
*                                                                @L2A*/ 00402000
*  ,      7 Nqxp_SF2_ECB bit(1)     /* When 1, ECB keyword specified    00403000
*                                      (i.e. ISGENQ WAITTYPE=ECB or     00404000
*                                      or ENQ with ECB).                00405000
*                                      When 0, No ECB specified         00406000
*                                      (i.e. WAITTYPE=SUSPEND if        00407000
*                                      Nqxp_SF1_ISGENQ is set and       00408000
*                                      Nqxp_SF2_TEST_YES and            00409000
*                                      Nqxp_SF2_CONTENTIONACT_FAIL      00410000
*                                      are off).                 @L2A*/ 00411000
*  ,      7 Nqxp_SF2_ChangeToShared bit(1) /* When 1, ISGENQ            00412000
*                                      REQUEST=CHANGE specified         00413000
*                                      CONTROL=SHARED. If the request   00414000
*                                      is successful, the requester     00415000
*                                      will be converted from an        00416000
*                                      exclusive owner to a shared      00417000
*                                      owner.  Only valid when          00418000
*                                      Nqxp_SF2_Change is 1.     @L3A*/ 00419000
*  ,      7 * bit(1)                /* Reserved                  @L3C*/ 00420000
*  ,    5 * char(6)                 /* Reserved                  @L2C*/ 00421000
*  ,  3 Nqxp_OriginalParameters     /* Original parameters specified    00422000
*                                      on the request                */ 00423000
*  ,    5 Nqxp_OP_QName char(8)     /* Original request QNAME        */ 00424000
*  ,    5 Nqxp_OP_RName@ ptr(31)    /* Pointer to original request      00425000
*                                      RNAME                         */ 00426000
*  ,    5 Nqxp_OP_RNameLen fixed(8) /* Length of original request       00427000
*                                      RNAME. When 0, request is a      00428000
*                                      generic DEQ               @P2C*/ 00429000
*  ,    5 Nqxp_OP_Scope fixed(8)    /* Original request scope, see      00430000
*                                      Nqxp_kScope values            */ 00431000
*  ,    5 * char(2)                 /* Reserved                      */ 00432000
*  ,    5 Nqxp_OP_Ucb@ ptr(31)      /* Pointer to original request UCB  00433000
*                                      (set for RESERVE). Only valid    00434000
*                                      when Nqxp_SF1_ENQ is set  @02A*/ 00435000
*  ,  3 Nqxp_RequestFlags           /* Request flags                 */ 00436000
*  ,    5 Nqxp_RequestFlags1 bit(8) /* First byte of request flags   */ 00437000
*  ,      7 Nqxp_RF1_BypassRNLs bit(1) /* When 1, request that RNL      00438000
*                                      processing is to be bypassed  */ 00439000
*  ,      7 Nqxp_RF1_ChangeQName bit(1) /* When 1, request that the     00440000
*                                      QNAME be changed              */ 00441000
*  ,      7 Nqxp_RF1_ChangeRName bit(1) /* When 1, request that the     00442000
*                                      RNAME be changed              */ 00443000
*  ,      7 Nqxp_RF1_ChangeScope bit(1) /* When 1, request that the     00444000
*                                      Scope be changed              */ 00445000
*  ,      7 Nqxp_RF1_ChangeUCB@ bit(1) /* When 1, request that the UCB  00446000
*                                      address be changed            */ 00447000
*  ,      7 * bit(3)                /* Reserved                      */ 00448000
*  ,    5 * char(3)                 /* Reserved                      */ 00449000
*  ,  3 * char(4)                   /* Reserved                      */ 00450000
*  ,  3 Nqxp_CurrentParameters      /* Parameters as changed by the     00451000
*                                      exit routines                 */ 00452000
*  ,    5 Nqxp_CP_QName char(8)     /* Current request QNAME         */ 00453000
*  ,    5 Nqxp_CP_RName@ ptr(31)    /* Pointer to current request       00454000
*                                      RNAME                         */ 00455000
*  ,    5 Nqxp_CP_RNameLen fixed(8) /* Length of current request        00456000
*                                      RNAME                         */ 00457000
*  ,    5 Nqxp_CP_Scope fixed(8)    /* Current request scope, see       00458000
*                                      Nqxp_kScope values            */ 00459000
*  ,    5 * char(2)                 /* Reserved                      */ 00460000
*  ,    5 Nqxp_CP_Ucb@ ptr(31)      /* Current request UCB address   */ 00461000
*  ,  3 Nqxp_RequestData2           /* More request data             */ 00462000
*  ,    5 Nqxp_RD_NSI@ ptr(31)      /* Requester's next sequential      00463000
*                                      instruction address, when        00464000
*                                      ENQ/DEQ ends, this is address    00465000
*                                      of the next instruction in the   00466000
*                                      calling program that will be     00467000
*                                      executed                      */ 00468000
*  ,      7 Nqxp_RD_AMode31 bit(1)  /* When set, ENQ caller is AMODE    00469000
*                                      31                            */ 00470000
*  ,    5 * char(4)                 /* Reserved                      */ 00471000
*  ,  3 Nqxp_WorkArea@ ptr(31)      /* Pointer to a 4K work area,       00472000
*                                      usable by exit routines       */ 00473000
*  ,  3 Nqxp_RequestToken char(16)  /* Unique token for this request,   00474000
*                                      all exits driven for this        00475000
*                                      request can be identified by     00476000
*                                      this token                    */ 00477000
*  ,  3 * char(4)                   /* Reserved                      */ 00478000
*  ,  3 Nqxp_End char(0) bdy(dword) /* End of NQXP                   */ 00479000
*  ;                                                                    00480000
*dcl                                                                    00481000
*   Nqxp_OP_Rname char(Nqxp_kRnameLen) based(Nqxp_OP_Rname@)            00482000
*                 varying(Nqxp_OP_RnameLen) /* Original request RNAME   00483000
*                                                                    */ 00484000
*  ,Nqxp_CP_Rname char(Nqxp_kRnameLen) based(Nqxp_CP_Rname@)            00485000
*                 varying(Nqxp_CP_RnameLen) /* Current request RNAME */ 00486000
*  ;                                                                    00487000
* /*******************************************************************/ 00488000
* /*                                                                 */ 00489000
* /*                       NQXP Constants                            */ 00490000
* /*                                                                 */ 00491000
* /*******************************************************************/ 00492000
* dcl                                                                   00493000
*    Nqxp_kId char(4) constant('NQXP') /* Used to identify control      00494000
*                                      block                         */ 00495000
*   ,Nqxp_kVersion#0 constant(0)    /* Version 0 - base          @01C*/ 00496000
*   ,Nqxp_kVersion#1 constant(1)    /* Version 1 - ISGNQXITFAST         00497000
*                                      support available         @01A*/ 00498000
*   ,Nqxp_kVersion#2 constant(2)    /* Version constant - HBB7709       00499000
*                                                                @L1A*/ 00500000
*   ,Nqxp_kVersion#3 constant(3)    /* Version constant- HBB7750 @L2A*/ 00501000
*   ,Nqxp_kCurrentVersion constant(Nqxp_kVersion#3) /* Current version  00502000
*                                                                @L2C*/ 00503000
*   ,Nqxp_kScopeSystem constant(1)  /* Scope=System                  */ 00504000
*   ,Nqxp_kScopeSystems constant(2) /* Scope=Systems                 */ 00505000
*   ,Nqxp_kScopeSysplex constant(Nqxp_kScopeSystems) /* Scope=Sysplex   00506000
*                                                                @L1A*/ 00507000
*   ,Nqxp_kRetNone constant('00000000'b) /* Ret=None                 */ 00508000
*   ,Nqxp_kRetHave constant('00000001'b) /* Ret=Have                 */ 00509000
*   ,Nqxp_kRetChng constant('00000010'b) /* Ret=Chng                 */ 00510000
*   ,Nqxp_kRetUse constant('00000011'b) /* Ret=Use                   */ 00511000
*   ,Nqxp_kRetTest constant('00000111'b) /* Ret=Test                 */ 00512000
*   ,Nqxp_kRnameLen constant(256)   /* Maximum RName length          */ 00513000
*   ,Nqxp_kLength constant(length(Nqxp)+2*Nqxp_kRNameLen) /* Maximum    00514000
*                                      length Nqxp, parameter list and  00515000
*                                      2 RNames                      */ 00516000
*   ;                                                                   00517000
*/* End of PL/X Source                                               */ 00518000
* %IF ISGYNQXP_LIST ^= 'NO' &                                           00519000
*    ZCBPRINT ^= 'NO' %THEN                                             00520000
*   %GOTO ISGYNQXP_4;                                                   00521000
*   @LIST POP NOECHO;                                                   00522000
* %ISGYNQXP_4:;                                                         00523000
* %END;                                                                 00524000
