*                                                                       00001000
* %DCL ISGYSMFR_INCLUDED CHAR EXT;                                      00002000
* %DEACTIVATE ISGYSMFR_INCLUDED;                                        00003000
* %IF ISGYSMFR_INCLUDED = '' %THEN                                      00004000
* %DO;                                                                  00005000
*/* Macro made bi-lingual on 19035. CBGEN compile date 15295         */ 00006000
*% /*                                                                   00007000
         MACRO                                                          00008000
         ISGYSMFR &DSECT=YES,&LIST=YES,&TITLE=YES,&SMFRCD87=YES,       *00009000
               &SMF87REQ=COND,&SMF87QSCAN=COND,&SMF87ENQ=COND           00010000
         GBLC  &ISGYSMFR_INCLUDED                                       00011000
         GBLC  &ZCBPRINT                                                00012000
&ISGYSMFR_INCLUDED SETC 'YES'                                           00013000
         AIF   ('&LIST' EQ 'NONE').P0                                   00014000
         AIF   ('&TITLE' EQ 'NO').P5                                    00015000
 TITLE   'ISGYSMFR  - GRS mapping for SMF Record Type 87          '     00016000
.P5      ANOP                                                           00017000
**/ ISGYSMFR_1:;                                                        00018000
*/* START OF SPECIFICATIONS ******************************************/ 00019000
*/*                                                                  */ 00020000
*/*                                                                  */ 00021000
*/*01* PROPRIETARY STATEMENT=                                        */ 00022000
*/***PROPRIETARY_STATEMENT********************************************/ 00023000
*/*                                                                  */ 00024000
*/*                                                                  */ 00025000
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00026000
*/* 5650-ZOS                                                         */ 00027000
*/* COPYRIGHT IBM CORP. 2013, 2015                                   */ 00028000
*/*                                                                  */ 00029000
*/* STATUS = HBB77A0                                                 */ 00030000
*/*                                                                  */ 00031000
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 00032000
*/*                                                                  */ 00033000
*/*02* ACRONYM:  ISGYSMFR                                            */ 00034000
*/*                                                                  */ 00035000
*/*01* DESCRIPTIVE NAME: GRS mapping for SMF Record Type 87          */ 00036000
*/*                                                                  */ 00037000
*/*01* MACRO NAME: ISGYSMFR                                          */ 00038000
*/*                                                                  */ 00039000
*/*01* DSECT NAME:  SMFRCD87                                         */ 00040000
*/*                                                                  */ 00041000
*/*01* COMPONENT:  GRS (SCSDS)                                       */ 00042000
*/*                                                                  */ 00043000
*/*01* EYE CATCHER: None                                             */ 00044000
*/*02*   OFFSET:    N/A                                              */ 00045000
*/*02*   LENGTH:    N/A                                              */ 00046000
*/*                                                                  */ 00047000
*/*01* STORAGE ATTRIBUTES:                                           */ 00048000
*/*02*  Subpool: Caller-determined                                   */ 00049000
*/*02*  Key: Caller-determined                                       */ 00050000
*/*02*  Residency: Caller-determined                                 */ 00051000
*/*                                                                  */ 00052000
*/*01* SIZE: Sum of component sections (see below)                   */ 00053000
*/*            SMFRCD87   -- X'002C' bytes                           */ 00054000
*/*            SMF87REQ   -- X'006C' bytes                           */ 00055000
*/*            SMF87QSCAN -- X'011C' bytes                           */ 00056000
*/*            SMF87ENQ   -- X'0124' bytes                           */ 00057000
*/*                                                                  */ 00058000
*/*01* CREATED BY: Caller                                            */ 00059000
*/*                                                                  */ 00060000
*/*01* POINTED TO BY:  Basing set up by module that calls IFASMFR    */ 00061000
*/*                                                                  */ 00062000
*/*01* SERIALIZATION:  None                                          */ 00063000
*/*                                                                  */ 00064000
*/*01* FUNCTION:  Mapping of GRS component SMF Record (Type 87)      */ 00065000
*/*                                                                  */ 00066000
*/*01* EXTERNAL CLASSIFICATION: PI                                   */ 00067000
*/*01* END OF EXTERNAL CLASSIFICATION:                               */ 00068000
*/*                                                                  */ 00069000
*/*01* METHOD OF ACCESS:                                             */ 00070000
*/*                                                                  */ 00071000
*/*   PLX: %ISGYSMFR_LIST = 'NO' suppresses printing of this macro,  */ 00072000
*/*                          any other value will list the macro.    */ 00073000
*/*        %ISGYSMFRBASE = '' results in the SMFRCD87 structure      */ 00074000
*/*                   being declared 'BASED'.  %ISGYSMFRBASE can be  */ 00075000
*/*                   set to override this to something else, for ex.*/ 00076000
*/*                   'BASED(SMF87PTR)' or ' '.                      */ 00077000
*/*                                                                  */ 00078000
*/*        %IFAR87 = 'YES' selects ISGYSMFR in IFASMFR               */ 00079000
*/*        %INCLUDE SYSLIB(IFASMFR)                                  */ 00080000
*/*                                                                  */ 00081000
*/*   ASM: IFASMFR 87                                                */ 00082000
*/*                                                                  */ 00083000
*/* DELETED-BY: Caller                                               */ 00084000
*/*                                                                  */ 00085000
*/* DEPENDENCIES: N/A                                                */ 00086000
*/*                                                                  */ 00087000
*/* NOTES:                                                           */ 00088000
*/*                                                                  */ 00089000
*/* 1)  SMF87ENQ_REQUESTTYPE MAPPING FOR ISGENQ REQUESTS         @L2C*/ 00090000
*/*                                                                  */ 00091000
*/* ---------------------------------------------------------------  */ 00092000
*/* ! CHANGE! ISGENQ REQUEST=CHANGE                               !  */ 00093000
*/* ---------------------------------------------------------------  */ 00094000
*/* ! USE   ! ISGENQ REQUEST=OBTAIN CONTENTIONACT=FAIL            !  */ 00095000
*/* ---------------------------------------------------------------  */ 00096000
*/* ! ECB   ! ISGENQ REQUEST=OBTAIN with WAITTYPE=ECB             !  */ 00097000
*/* ---------------------------------------------------------------  */ 00098000
*/* ! TEST  ! ISGENQ REQUEST=OBTAIN with TEST=YES                 !  */ 00099000
*/* ---------------------------------------------------------------  */ 00100000
*/* ! NONE  ! ISGENQ REQUEST=OBTAIN or RELEASE with COND=NO       !  */ 00101000
*/* !       ! (when others do not apply)                          !  */ 00102000
*/* ---------------------------------------------------------------  */ 00103000
*/* ! HAVE  ! ISGENQ REQUEST=OBTAIN or RELEASE with COND=YES      !  */ 00104000
*/* !       ! (when others do not apply)                          !  */ 00105000
*/* ---------------------------------------------------------------  */ 00106000
*/*                                                                  */ 00107000
*/* 2)  SMF Type 87 Subtype 2 (ENQ/DEQ) records may contain more than*/ 00108000
*/*     one request. Each request is comprised of a Requester section*/ 00109000
*/*     and a Data section. The SMF 87 record is organized such that */ 00110000
*/*     all of the Requester sections are contiguous and all of the  */ 00111000
*/*     Data sections are contiguous. Requester section X corresponds*/ 00112000
*/*     to Data section X. Both Requester section X and Data section */ 00113000
*/*     X comprise Request X.                                    @L2A*/ 00114000
*/*                                                                  */ 00115000
*/*                   Record Structure For Subtype 2             @L2A*/ 00116000
*/*                   ------------------------------                 */ 00117000
*/*                                                                  */ 00118000
*/*           ----------------------------------------------         */ 00119000
*/*           !         -----------------------------------!         */ 00120000
*/*           !         ! Header (SMF87RHS)               !!         */ 00121000
*/*           !SMF87RCD -----------------------------------!         */ 00122000
*/*           !         ! Self Defining Section (SMF87DEF)!!         */ 00123000
*/*           !         -----------------------------------!         */ 00124000
*/*           ----------------------------------------------         */ 00125000
*/*           !Requester Section 1 (SMF87REQ)              !         */ 00126000
*/*           ----------------------------------------------         */ 00127000
*/*           !Requester Section 2                         !         */ 00128000
*/*           ----------------------------------------------         */ 00129000
*/*           !...                                         !         */ 00130000
*/*           ----------------------------------------------         */ 00131000
*/*           !Requester Section SMF87DEF_REQ_NUM          !         */ 00132000
*/*           ----------------------------------------------         */ 00133000
*/*           !Data Section 1 (SMF87ENQ)                   !         */ 00134000
*/*           ----------------------------------------------         */ 00135000
*/*           !Data Section 2                              !         */ 00136000
*/*           ----------------------------------------------         */ 00137000
*/*           !...                                         !         */ 00138000
*/*           ----------------------------------------------         */ 00139000
*/*           !Data Section SMF87DEF_DATA_NUM              !         */ 00140000
*/*           ----------------------------------------------         */ 00141000
*/*                                                                  */ 00142000
*/*     Subtype 1 (QSCAN) records only contain one request.      @L2A*/ 00143000
*/*                                                                  */ 00144000
*/*                   Record Structure For Subtype 1             @L2A*/ 00145000
*/*                   ------------------------------                 */ 00146000
*/*                                                                  */ 00147000
*/*           ----------------------------------------------         */ 00148000
*/*           !         -----------------------------------!         */ 00149000
*/*           !         ! Header (SMF87RHS)               !!         */ 00150000
*/*           !SMF87RCD -----------------------------------!         */ 00151000
*/*           !         ! Self Defining Section (SMF87DEF)!!         */ 00152000
*/*           !         -----------------------------------!         */ 00153000
*/*           ----------------------------------------------         */ 00154000
*/*           !Requester Section (SMF87REQ)                !         */ 00155000
*/*           ----------------------------------------------         */ 00156000
*/*           !Qscan Section (SMF87QSCAN)                  !         */ 00157000
*/*           ----------------------------------------------         */ 00158000
*/*                                                                  */ 00159000
*/*01* CHANGE ACTIVITY:                                              */ 00160000
*/*                                                                  */ 00161000
*/*   Flag LineItem  FMID    Date   ID    Comment                    */ 00162000
*/*                                                                  */ 00163000
*/*    $01=OA42221 HBB7790 130625   PDGB:  Initial release           */ 00164000
*/*    $L1=GRSSMFMN HBB77A0 131031  PDFY:  Add ENQ/DEQ SMF support   */ 00165000
*/*    $L2=GRSSMFMN HBB77A0 141125  PDGB:  Batch Enq records         */ 00166000
*/*                                                                  */ 00167000
*/*END OF SPECIFICATIONS *********************************************/ 00168000
*% /*                                                                   00169000
.P0      ANOP                                                           00170000
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 00171000
         AIF   ('&LIST' EQ 'YES').P2                                    00172000
.P1      ANOP                                                           00173000
         PUSH  PRINT                                                    00174000
         PRINT OFF                                                      00175000
.P2      ANOP                                                           00176000
         AIF   ('&SMFRCD87' EQ 'NO').L0002                              00177000
         AIF   ('&DSECT' EQ 'YES').L0003                                00178000
         AIF   ('&SMFRCD87' NE 'YES').L0002                             00179000
SMFRCD87 DS    0F                                                       00180000
         AGO   .L0004                                                   00181000
.L0003   ANOP                                                           00182000
SMFRCD87 DSECT                                                          00183000
.L0004   ANOP                                                           00184000
*                                                                       00185000
* ********************************************************************  00186000
* *   HEADER SECTION                                                 *  00187000
* ********************************************************************  00188000
*                                                                       00189000
*                                                                       00190000
SMF87RHS DS    0CL24     Record Header Section                          00191000
SMF87LEN DS    H         Record Length                                  00192000
SMF87SEG DS    H         Segment Descriptor                             00193000
SMF87FLG DS    0CL1      Header Flag Byte                               00194000
SMF87FST EQU   X'40'     bit 1 - SUBTYPES utilized                      00195000
         ORG   SMF87FLG+1                                               00196000
SMF87RTY DS    CL1       Record Type - 87                               00197000
SMF87TME DS    FL4       Record Written Time                            00198000
SMF87DTE DS    CL4       Record Written Date                            00199000
SMF87SID DS    CL4       System Identification                          00200000
SMF87SSI DS    CL4       Subsystem ID                                   00201000
SMF87STP DS    H         Record Subtype                                 00202000
*                                                                       00203000
* ********************************************************************  00204000
* *   SELF DEFINING SECTION                                          *  00205000
* ********************************************************************  00206000
*                                                                       00207000
*                                                                       00208000
SMF87DEF DS    0CL20     Self Defining section                          00209000
SMF87DEF_LEN DS F        Length of this section                         00210000
SMF87DEF_REQ_OFF DS F    Requester section offset                       00211000
SMF87DEF_REQ_LEN DS H    Requester section length                       00212000
SMF87DEF_REQ_NUM DS H    Number of Requester sections                   00213000
SMF87DEF_QSCAN_OFF DS 0F Qscan section offset                           00214000
SMF87DEF_DATA_OFF DS F   Data section offset                            00215000
SMF87DEF_QSCAN_LEN DS 0H Qscan section length                           00216000
SMF87DEF_DATA_LEN DS H   Data section length                            00217000
SMF87DEF_QSCAN_NUM DS 0H Number of Qscan sections                       00218000
SMF87DEF_DATA_NUM DS H   # of Data sections                             00219000
SMFRCD87_LEN EQU *-SMFRCD87                                             00220000
.L0002   ANOP                                                           00221000
         AIF   ('&SMF87REQ' EQ 'NO').L0005                              00222000
         AIF   ('&DSECT' EQ 'YES').L0006                                00223000
         AIF   ('&SMF87REQ' NE 'YES').L0005                             00224000
.L0006   ANOP                                                           00225000
*                                                                       00226000
* ********************************************************************  00227000
* *   REQUESTER SECTION                                              *  00228000
* ********************************************************************  00229000
*                                                                       00230000
*                                                                       00231000
         AIF   ('&DSECT' EQ 'YES').L0007                                00232000
SMF87REQ DS    0F        Addressability derived from address of        *00233000
                         SMF87RCD + SMF87DEF_REQ_OFF +                 *00234000
                         (SMF87DEF_REQ_LEN * (index-1))                 00235000
         AGO   .L0008                                                   00236000
.L0007   ANOP                                                           00237000
SMF87REQ DSECT           Addressability derived from address of        *00238000
                         SMF87RCD + SMF87DEF_REQ_OFF +                 *00239000
                         (SMF87DEF_REQ_LEN * (index-1))                 00240000
.L0008   ANOP                                                           00241000
SMF87REQ_COMP DS CL8     Requester Component ID                         00242000
SMF87REQ_VERSION DS F    Requester section version                      00243000
SMF87REQ_SYS DS CL8      Requester System Name                          00244000
SMF87REQ_STOK DS CL8     Requester SToken                               00245000
SMF87REQ_ASID DS H       Requester Asid                                 00246000
         DS    CL2       reserved                                       00247000
SMF87REQ_TCB DS A        Requester TCB address                          00248000
SMF87REQ_JOB DS CL8      Requester Jobname                              00249000
SMF87REQ_STIME DS CL16   Requester start timestamp                      00250000
SMF87REQ_CTIME DS CL16   Requester completion timestamp                 00251000
SMF87REQ_RC DS F         Requester return code                          00252000
SMF87REQ_RSN DS F        Requester reason code                          00253000
SMF87REQ_PSW DS CL8      Requester PSW                                  00254000
SMF87REQ_FLAGS DS 0B     Flags                                          00255000
SMF87REQ_JOBINIT EQU X'80' Initiated Job. Only valid when SMF87STP is  *00256000
                         SMF87STP_ENQ                                   00257000
SMF87REQ_STCTSU EQU X'40' Started Task, TSO User, or other System      *00258000
                         process. Only valid when SMF87STP is          *00259000
                         SMF87STP_ENQ                                   00260000
         ORG   SMF87REQ_FLAGS+1                                         00261000
SMF87REQ_AUTH1 DS B      copy of CDATTR2. Only valid when SMF87STP is  *00262000
                         SMF87STP_ENQ. Mapped by macro IHACDE. May be  *00263000
                         zero if if unavailable.                        00264000
         DS    CL2                                                      00265000
SMF87REQ_SMFID DS CL4    System id. Only valid when SMF87STP is        *00266000
                         SMF87STP_ENQ                                   00267000
SMF87REQ_PROGRAMNAME DS CL8 Program Name. May be blank if unvailable.  *00268000
                         Only valid when SMF87STP is SMF87STP_ENQ       00269000
SMF87REQ_LEN EQU *-SMF87REQ                                             00270000
.L0005   ANOP                                                           00271000
         AIF   ('&SMF87QSCAN' EQ 'NO').L0009                            00272000
         AIF   ('&DSECT' EQ 'YES').L000A                                00273000
         AIF   ('&SMF87QSCAN' NE 'YES').L0009                           00274000
.L000A   ANOP                                                           00275000
*                                                                       00276000
* ********************************************************************  00277000
* *   QSCAN SECTION                                                  *  00278000
* ********************************************************************  00279000
*                                                                       00280000
*                                                                       00281000
         AIF   ('&DSECT' EQ 'YES').L000B                                00282000
SMF87QSCAN DS  0F        Addressability derived from address of        *00283000
                         SMF87RCD + SMF87DEF_QSCAN_OFF +               *00284000
                         (SMF87DEF_QSCAN_LEN * (index-1))               00285000
         AGO   .L000C                                                   00286000
.L000B   ANOP                                                           00287000
SMF87QSCAN DSECT         Addressability derived from address of        *00288000
                         SMF87RCD + SMF87DEF_QSCAN_OFF +               *00289000
                         (SMF87DEF_QSCAN_LEN * (index-1))               00290000
.L000C   ANOP                                                           00291000
SMF87QSCAN_EYE DS CL8    Service eye-catcher. Refer to constants       *00292000
                         beginning with SMF87QSCAN_EYE.                 00293000
SMF87QSCAN_VERSION DS F  Qscan section version                          00294000
SMF87QSCAN_SCANACTION DS X Requested scan action. Refer to constants   *00295000
                         beginning with SMF87QSCAN_SCANACTION           00296000
SMF87QSCAN_FLAGS DS 0X                                                  00297000
SMF87QSCAN_QNAME_SPECIFIC EQU X'80' Specific Qname?                     00298000
SMF87QSCAN_RNAME_SPECIFIC EQU X'40' Specific Rname?                     00299000
         ORG   SMF87QSCAN_FLAGS+1                                       00300000
SMF87QSCAN_QNAMELEN DS X Qname length                                   00301000
SMF87QSCAN_RNAMELEN DS X Rname length                                   00302000
SMF87QSCAN_MINWAITERS DS F Minimum waiters                              00303000
SMF87QSCAN_QNAME DS CL8  Requested Qname. If not specified on request, *00304000
                         then zeroes                                    00305000
SMF87QSCAN_RNAME DS CL256 Requested Rname. If not specified on         *00306000
                         request, then zeroes. For length, refer to    *00307000
                         SMF87QSCAN_RNAMELEN                            00308000
SMF87QSCAN_LEN EQU *-SMF87QSCAN                                         00309000
.L0009   ANOP                                                           00310000
         AIF   ('&SMF87ENQ' EQ 'NO').L000D                              00311000
         AIF   ('&DSECT' EQ 'YES').L000E                                00312000
         AIF   ('&SMF87ENQ' NE 'YES').L000D                             00313000
.L000E   ANOP                                                           00314000
*                                                                       00315000
* ********************************************************************  00316000
* *   ENQ/DEQ SECTION                                                *  00317000
* ***************************************************************       00318000
*                                                                       00319000
*                                                                       00320000
         AIF   ('&DSECT' EQ 'YES').L000F                                00321000
SMF87ENQ DS    0F        Addressability derived from address of        *00322000
                         SMF87RCD + SMF87DEF_DATA_OFF +                *00323000
                         (SMF87DEF_DATA_LEN * (index-1))                00324000
         AGO   .L0010                                                   00325000
.L000F   ANOP                                                           00326000
SMF87ENQ DSECT           Addressability derived from address of        *00327000
                         SMF87RCD + SMF87DEF_DATA_OFF +                *00328000
                         (SMF87DEF_DATA_LEN * (index-1))                00329000
.L0010   ANOP                                                           00330000
SMF87ENQ_EYE DS CL8      service eye-catcher. Refer to constants       *00331000
                         beginning with SMF87ENQ_EYE.                   00332000
SMF87ENQ_VERSION DS F    enq section version                            00333000
SMF87ENQ_REQUESTFIELDS DS 0CL8                                          00334000
SMF87ENQ_FLAGS1 DS 0CL1                                                 00335000
SMF87ENQ_REQWAITED EQU X'80' When on, this request was queued to wait  *00336000
                         for the resource                               00337000
SMF87ENQ_EXITCHANGED EQU X'40' When on, this request may have been     *00338000
                         changed by an exit. Note exits may not change *00339000
                         scope or UCB status when RNL=NO specified on  *00340000
                         the request                                    00341000
SMF87ENQ_INCLUDED EQU X'20' When on, this request was included by RNLs  00342000
SMF87ENQ_EXCLUDED EQU X'10' When on, this request was excluded by RNLs  00343000
SMF87ENQ_CONVERTED EQU X'08' When on, this request was converted from  *00344000
                         a RESERVE to a global ENQ by RNLs              00345000
SMF87ENQ_PCREQUEST EQU X'04' When on, this request was a result of a   *00346000
                         PC-ENQ, PC-DEQ, or ISGENQ                      00347000
SMF87ENQ_RNLNO EQU X'02' When on, this request was made requesting no  *00348000
                         changes be allowed by RNLs                     00349000
SMF87ENQ_LIST EQU X'01'  When on, this request was part of a list      *00350000
                         request                                        00351000
         ORG   SMF87ENQ_FLAGS1+1                                        00352000
SMF87ENQ_FLAGS2 DS 0CL1                                                 00353000
SMF87ENQ_DIRECTEDTCB EQU X'80' When on, this request was directed to   *00354000
                         another TCB                                    00355000
SMF87ENQ_STEPMUSTCOMPLETE EQU X'40' When on, this request asked for    *00356000
                         Step must complete                             00357000
SMF87ENQ_SHARE EQU X'20' When on, this request was for shared access    00358000
SMF87ENQ_RESERVE EQU X'10' When on, this request was for a RESERVE.    *00359000
                         Refer to SMF87ENQ_CONVERTED to see if the     *00360000
                         RESERVE was converted                          00361000
SMF87ENQ_OBTAIN EQU X'08' When on, this request was to obtain or       *00362000
                         change an ENQ. When off, this request was to  *00363000
                         release an ENQ                                 00364000
         ORG   SMF87ENQ_FLAGS2+1                                        00365000
SMF87ENQ_SCOPE DS X      Final scope of the request. Refer to          *00366000
                         constants starting with SMF87ENQ_SCOPE.        00367000
SMF87ENQ_RNAMELEN DS X   Rname length                                   00368000
SMF87ENQ_REQUESTTYPE DS X Type of request. Refer to constants          *00369000
                         beginning with SMF87ENQ_REQUESTTYPE. Also see *00370000
                         table in prolog to map constants to ISGENQ     00371000
         DS    CL3                                                      00372000
SMF87ENQ_DEVICEINFO DS 0CL8 DeviceInfo subfields are only valid for    *00373000
                         RESERVEs. They will be zeroes if unavailable   00374000
SMF87ENQ_DEVN DS BL2     Device number if avail                         00375000
SMF87ENQ_UCBVOLI DS CL6  VolSer if available                            00376000
SMF87ENQ_QNAME DS CL8    QNAME                                          00377000
SMF87ENQ_RNAME DS CL256  Rname. Refer to SMF87ENQ_RNAMELEN for the     *00378000
                         length of the request RNAME                    00379000
*                                                                       00380000
* ********************************************************************  00381000
* *   ISGYSMFR - CONSTANTS                                           *  00382000
* ********************************************************************  00383000
*                                                                       00384000
*                                                                       00385000
SMF87RTY_87 EQU 87       SMF87RTY constant for this record type of 87   00386000
SMF87STP_QSCAN EQU 1     SMF87STP constant for the QSCAN subtype        00387000
SMF87STP_ENQ EQU 2       SMF87STP constant for the ENQ subtype          00388000
SMF87REQ_COMP_GRS_0TO3 EQU C'SCSD' This is the first 4-byte segment of *00389000
                         an 8-byte constant. SMF87REQ_COMP constant    *00390000
                         for GRS                                        00391000
SMF87REQ_COMP_GRS_4TO7 EQU C'S   ' This is the second 4-byte segment   *00392000
                         of an 8-byte constant. SMF87REQ_COMP constant *00393000
                         for GRS                                        00394000
SMF87REQ_VERSION_1 EQU 1 SMF87REQ_VERSION section constant for version *00395000
                         1                                              00396000
SMF87REQ_VERSION_2 EQU 2 SMF87REQ_VERSION section constant for version *00397000
                         2                                              00398000
SMF87QSCAN_VERSION_1 EQU 1 SMF87QSCAN_VERSION section constant for     *00399000
                         version 1                                      00400000
SMF87ENQ_VERSION_1 EQU 1 SMF87ENQ_VERSION section constant for version *00401000
                         1                                              00402000
SMF87QSCAN_EYE_GQSCAN_0TO3 EQU C'GQSC' This is the first 4-byte        *00403000
                         segment of an 8-byte constant. Service        *00404000
                         constant for SMF87QSCAN_EYE                    00405000
SMF87QSCAN_EYE_GQSCAN_4TO7 EQU C'AN  ' This is the second 4-byte       *00406000
                         segment of an 8-byte constant. Service        *00407000
                         constant for SMF87QSCAN_EYE                    00408000
SMF87QSCAN_EYE_ISGQUERY_0TO3 EQU C'ISGQ' This is the first 4-byte      *00409000
                         segment of an 8-byte constant. Service        *00410000
                         constant for SMF87QSCAN_EYE                    00411000
SMF87QSCAN_EYE_ISGQUERY_4TO7 EQU C'UERY' This is the second 4-byte     *00412000
                         segment of an 8-byte constant. Service        *00413000
                         constant for SMF87QSCAN_EYE                    00414000
SMF87ENQ_EYE_ENQ_0TO3 EQU C'ENQ ' This is the first 4-byte segment of  *00415000
                         an 8-byte constant. Service constant for      *00416000
                         SMF87ENQ_EYE                                   00417000
SMF87ENQ_EYE_ENQ_4TO7 EQU C'    ' This is the second 4-byte segment of *00418000
                         an 8-byte constant. Service constant for      *00419000
                         SMF87ENQ_EYE                                   00420000
SMF87ENQ_EYE_DEQ_0TO3 EQU C'DEQ ' This is the first 4-byte segment of  *00421000
                         an 8-byte constant. Service constant for      *00422000
                         SMF87ENQ_EYE                                   00423000
SMF87ENQ_EYE_DEQ_4TO7 EQU C'    ' This is the second 4-byte segment of *00424000
                         an 8-byte constant. Service constant for      *00425000
                         SMF87ENQ_EYE                                   00426000
SMF87ENQ_EYE_ISGENQ_0TO3 EQU C'ISGE' This is the first 4-byte segment  *00427000
                         of an 8-byte constant. Service constant for   *00428000
                         SMF87ENQ_EYE                                   00429000
SMF87ENQ_EYE_ISGENQ_4TO7 EQU C'NQ  ' This is the second 4-byte segment *00430000
                         of an 8-byte constant. Service constant for   *00431000
                         SMF87ENQ_EYE                                   00432000
SMF87QSCAN_SCANACTION_START EQU 1 Start constant for SMF87QSCANACTION   00433000
SMF87QSCAN_SCANACTION_RESUME EQU 2 Resume constant for                 *00434000
                         SMF87QSCANACTION                               00435000
*                                                                       00436000
*    Scope constants                                                    00437000
*                                                                       00438000
*                                                                       00439000
SMF87ENQ_SCOPE_STEP EQU 1                                               00440000
SMF87ENQ_SCOPE_SYSTEM EQU 2                                             00441000
SMF87ENQ_SCOPE_SYSTEMS EQU 3                                            00442000
*                                                                       00443000
*    RequestType Constants                                              00444000
*                                                                       00445000
*                                                                       00446000
SMF87ENQ_REQUESTTYPE_NONE EQU 0                                         00447000
SMF87ENQ_REQUESTTYPE_HAVE EQU 1                                         00448000
SMF87ENQ_REQUESTTYPE_CHANGE EQU 2                                       00449000
SMF87ENQ_REQUESTTYPE_USE EQU 3                                          00450000
SMF87ENQ_REQUESTTYPE_ECB EQU 4                                          00451000
SMF87ENQ_REQUESTTYPE_TEST EQU 7                                         00452000
SMF87ENQ_LEN EQU *-SMF87ENQ                                             00453000
.L000D   ANOP                                                           00454000
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 00455000
         AIF   ('&LIST' EQ 'YES').P4                                    00456000
.P3      ANOP                                                           00457000
         POP   PRINT                                                    00458000
.P4      ANOP                                                           00459000
.P_EXIT  ANOP                                                           00460000
         MEND                                                           00461000
**/ ISGYSMFR_2:;                                                        00462000
* %ISGYSMFR_INCLUDED = 'YES';                                           00463000
* %DCL ZCBPRINT CHAR EXT;                                               00464000
* %DEACTIVATE ZCBPRINT;                                                 00465000
* %DCL ISGYSMFR_LIST CHAR EXT;                                          00466000
* %DEACTIVATE ISGYSMFR_LIST;                                            00467000
* %IF ISGYSMFR_LIST ^= 'NO' &                                           00468000
*    ZCBPRINT ^= 'NO' %THEN                                             00469000
*   %GOTO ISGYSMFR_3;                                                   00470000
*   @LIST PUSH NOECHO;                                                  00471000
*   @LIST NOASSEMBLE NOECHO;                                            00472000
*   @LIST OFF C NOECHO;                                                 00473000
* %ISGYSMFR_3:;                                                         00474000
*/* Start of PL/X Source                                             */ 00475000
* %IF ISGYSMFRBASE = '' %THEN                                           00476000
*   %GOTO ISGYSMFR_40;                                                  00477000
*DCL 1 SMFRCD87 ISGYSMFRBASE,                                           00478000
*   %GOTO ISGYSMFR_50;                                                  00479000
* %ISGYSMFR_40:;                                                        00480000
*DCL 1 SMFRCD87 BASED,                                                  00481000
* %ISGYSMFR_50:;                                                        00482000
*                                                                       00483000
*/********************************************************************/ 00484000
*/*   HEADER SECTION                                                 */ 00485000
*/********************************************************************/ 00486000
*      3 SMF87RHS,                  /* Record Header Section         */ 00487000
*        5 SMF87LEN FIXED(15),      /* Record Length                 */ 00488000
*        5 SMF87SEG FIXED(15),      /* Segment Descriptor            */ 00489000
*        5 SMF87FLG CHAR(1),        /* Header Flag Byte              */ 00490000
*          7 * BIT(1),              /* bit 0 - unused by type 87     */ 00491000
*          7 SMF87FST BIT(1),       /* bit 1 - SUBTYPES utilized     */ 00492000
*          7 * BIT(6),              /* bits 2-7 Reserved             */ 00493000
*        5 SMF87RTY CHAR(1),        /* Record Type - 87              */ 00494000
*        5 SMF87TME FIXED(31) BDY(HWORD), /* Record Written Time     */ 00495000
*        5 SMF87DTE CHAR(4),        /* Record Written Date           */ 00496000
*        5 SMF87SID CHAR(4),        /* System Identification         */ 00497000
*        5 SMF87SSI CHAR(4),        /* Subsystem ID                  */ 00498000
*        5 SMF87STP FIXED(15),      /* Record Subtype                */ 00499000
*                                                                       00500000
*/********************************************************************/ 00501000
*/*   SELF DEFINING SECTION                                          */ 00502000
*/********************************************************************/ 00503000
*      3 SMF87DEF,                  /* Self Defining section         */ 00504000
*        5 SMF87DEF_LEN fixed(31),  /* Length of this section        */ 00505000
*        5 SMF87DEF_REQ_OFF fixed(31),/* Requester section offset    */ 00506000
*        5 SMF87DEF_REQ_LEN fixed(15),/* Requester section length    */ 00507000
*        5 SMF87DEF_REQ_NUM fixed(15),/* Number of Requester sections*/ 00508000
*        5 SMF87DEF_QSCAN_OFF fixed(31),/* Qscan section offset      */ 00509000
*          7 SMF87DEF_DATA_OFF fixed(31),/* Data section offset  @L1A*/ 00510000
*        5 SMF87DEF_QSCAN_LEN fixed(15),/* Qscan section length      */ 00511000
*          7 SMF87DEF_DATA_LEN fixed(15),/* Data section length  @L1A*/ 00512000
*        5 SMF87DEF_QSCAN_NUM fixed(15),/* Number of Qscan sections  */ 00513000
*          7 SMF87DEF_DATA_NUM fixed(15),/* # of Data sections   @L1A*/ 00514000
*                                                                       00515000
*/********************************************************************/ 00516000
*/*   REQUESTER SECTION                                              */ 00517000
*/********************************************************************/ 00518000
*    1 SMF87REQ BASED,              /* Addressability derived from      00519000
*                                      address of SMF87RCD +            00520000
*                                      SMF87DEF_REQ_OFF +               00521000
*                                      (SMF87DEF_REQ_LEN * (index-1))   00522000
*                                                                @L2C*/ 00523000
*      3 SMF87REQ_COMP CHAR(8),     /* Requester Component ID        */ 00524000
*      3 SMF87REQ_VERSION FIXED(31),/* Requester section version     */ 00525000
*      3 SMF87REQ_SYS CHAR(8),      /* Requester System Name         */ 00526000
*      3 SMF87REQ_STOK CHAR(8),     /* Requester SToken              */ 00527000
*      3 SMF87REQ_ASID FIXED(16),   /* Requester Asid                */ 00528000
*      3 *        CHAR(2),          /* reserved                      */ 00529000
*      3 SMF87REQ_TCB PTR(31),      /* Requester TCB address         */ 00530000
*      3 SMF87REQ_JOB CHAR(8),      /* Requester Jobname             */ 00531000
*      3 SMF87REQ_STIME CHAR(16),   /* Requester start timestamp     */ 00532000
*      3 SMF87REQ_CTIME CHAR(16),   /* Requester completion timestamp*/ 00533000
*      3 SMF87REQ_RC FIXED(32),     /* Requester return code         */ 00534000
*      3 SMF87REQ_RSN FIXED(32),    /* Requester reason code         */ 00535000
*      3 SMF87REQ_PSW CHAR(8),      /* Requester PSW                 */ 00536000
*                                                                       00537000
*      3 SMF87REQ_FLAGS BIT(8),     /* Flags                     @L1A*/ 00538000
*        5 SMF87REQ_JOBINIT BIT(1), /* Initiated Job. Only valid when   00539000
*                                      SMF87STP is SMF87STP_ENQ  @L1A*/ 00540000
*        5 SMF87REQ_STCTSU BIT(1),  /* Started Task, TSO User, or other 00541000
*                                      System process. Only valid when  00542000
*                                      SMF87STP is SMF87STP_ENQ  @L1A*/ 00543000
*        5 *        BIT(6),                                  /*  @L1A*/ 00544000
*      3 SMF87REQ_AUTH1 BIT(8),     /* copy of CDATTR2. Only valid when 00545000
*                                      SMF87STP is SMF87STP_ENQ. Mapped 00546000
*                                      by macro IHACDE. May be zero if  00547000
*                                      if unavailable.           @L2C*/ 00548000
*      3 *          CHAR(2),                                 /*  @L1A*/ 00549000
*      3 SMF87REQ_SMFID CHAR(4),    /* System id.  Only valid when      00550000
*                                      SMF87STP is SMF87STP_ENQ  @L1A*/ 00551000
*      3 SMF87REQ_PROGRAMNAME CHAR(8), /* Program Name. May be blank if 00552000
*                                      unvailable. Only valid when      00553000
*                                      SMF87STP is SMF87STP_ENQ  @L1A*/ 00554000
*                                                                       00555000
*/********************************************************************/ 00556000
*/*   QSCAN SECTION                                                  */ 00557000
*/********************************************************************/ 00558000
*    1 SMF87QSCAN BASED,            /* Addressability derived from      00559000
*                                      address of SMF87RCD +            00560000
*                                      SMF87DEF_QSCAN_OFF +             00561000
*                                      (SMF87DEF_QSCAN_LEN * (index-1)) 00562000
*                                                                @L2C*/ 00563000
*      3 SMF87QSCAN_EYE CHAR(8),    /* Service eye-catcher. Refer to    00564000
*                                      constants beginning with         00565000
*                                      SMF87QSCAN_EYE.           @L1C*/ 00566000
*      3 SMF87QSCAN_VERSION FIXED(31),/* Qscan section version       */ 00567000
*      3 SMF87QSCAN_SCANACTION FIXED(8), /* Requested scan action.      00568000
*                                      Refer to constants beginning     00569000
*                                      with SMF87QSCAN_SCANACTION       00570000
*                                                                @L1C*/ 00571000
*      3 SMF87QSCAN_FLAGS FIXED(8),                                     00572000
*        5 SMF87QSCAN_QNAME_SPECIFIC BIT(1), /* Specific Qname?      */ 00573000
*        5 SMF87QSCAN_RNAME_SPECIFIC BIT(1),/* Specific Rname?       */ 00574000
*      3 SMF87QSCAN_QNAMELEN FIXED(8),/* Qname length                */ 00575000
*      3 SMF87QSCAN_RNAMELEN FIXED(8),/* Rname length                */ 00576000
*      3 SMF87QSCAN_MINWAITERS FIXED(32),/* Minimum waiters          */ 00577000
*      3 SMF87QSCAN_QNAME CHAR(8),  /* Requested Qname. If not          00578000
*                                      specified on request, then       00579000
*                                      zeroes                    @L1C*/ 00580000
*      3 SMF87QSCAN_RNAME CHAR(256),/* Requested Rname. If not          00581000
*                                      specified on request, then       00582000
*                                      zeroes. For length, refer to     00583000
*                                      SMF87QSCAN_RNAMELEN       @L1C*/ 00584000
*                                                                       00585000
*/********************************************************************/ 00586000
*/*   ENQ/DEQ SECTION                                                */ 00587000
*/***************************************************************@L1A*/ 00588000
*    1 SMF87ENQ BASED,              /* Addressability derived from      00589000
*                                      address of SMF87RCD +            00590000
*                                      SMF87DEF_DATA_OFF +              00591000
*                                      (SMF87DEF_DATA_LEN * (index-1))  00592000
*                                                                @L2C*/ 00593000
*      3 SMF87ENQ_EYE char(8),       /* service eye-catcher. Refer to   00594000
*                                       constants beginning with        00595000
*                                       SMF87ENQ_EYE.            @L1A*/ 00596000
*      3 SMF87ENQ_VERSION FIXED(31), /* enq section version      @L1A*/ 00597000
*      3 SMF87ENQ_REQUESTFIELDS CHAR(8),                      /* @L1A*/ 00598000
*        5 SMF87ENQ_FLAGS1 CHAR(1),                                     00599000
*          7 SMF87ENQ_REQWAITED  BIT(1), /* When on, this request was   00600000
*                                      queued to wait for the resource  00601000
*                                                                @L1A*/ 00602000
*          7 SMF87ENQ_EXITCHANGED BIT(1), /* When on, this request may  00603000
*                                      have been changed by an exit.    00604000
*                                      Note exits may not change scope  00605000
*                                      or UCB status when RNL=NO        00606000
*                                      specified on the request  @L1A*/ 00607000
*          7 SMF87ENQ_INCLUDED BIT(1), /* When on, this request was     00608000
*                                      included by RNLs          @L1A*/ 00609000
*          7 SMF87ENQ_EXCLUDED BIT(1), /* When on, this request was     00610000
*                                      excluded by RNLs          @L1A*/ 00611000
*          7 SMF87ENQ_CONVERTED BIT(1),  /* When on, this request was   00612000
*                                      converted from a RESERVE to a    00613000
*                                      global ENQ by RNLs        @L1A*/ 00614000
*          7 SMF87ENQ_PCREQUEST BIT(1), /* When on, this request was    00615000
*                                      a result of a PC-ENQ, PC-DEQ,    00616000
*                                      or ISGENQ                @L1A*/  00617000
*          7 SMF87ENQ_RNLNO BIT(1), /* When on, this request was        00618000
*                                      made requesting no changes       00619000
*                                      be allowed by RNLs        @L1A*/ 00620000
*          7 SMF87ENQ_LIST BIT(1),  /* When on, this request was        00621000
*                                      part of a list request    @L1A*/ 00622000
*        5 SMF87ENQ_FLAGS2 CHAR(1),                                     00623000
*          7 SMF87ENQ_DIRECTEDTCB BIT(1),  /* When on, this request was 00624000
*                                      directed to another TCB   @L1A*/ 00625000
*          7 SMF87ENQ_STEPMUSTCOMPLETE BIT(1),  /* When on, this        00626000
*                                      request asked for Step must      00627000
*                                      complete                  @L1A*/ 00628000
*          7 SMF87ENQ_SHARE BIT(1), /* When on, this request was        00629000
*                                      for shared access         @L1A*/ 00630000
*          7 SMF87ENQ_RESERVE BIT(1), /* When on, this request was      00631000
*                                      for a RESERVE. Refer to          00632000
*                                      SMF87ENQ_CONVERTED to see if     00633000
*                                      the RESERVE was converted @L1A*/ 00634000
*          7 SMF87ENQ_OBTAIN BIT(1), /* When on, this request was       00635000
*                                      to obtain or change an ENQ.      00636000
*                                      When off, this request was to    00637000
*                                      release an ENQ            @L1A*/ 00638000
*        5 SMF87ENQ_SCOPE FIXED(8), /* Final scope of the request.      00639000
*                                      Refer to constants starting with 00640000
*                                      SMF87ENQ_SCOPE.           @L1A*/ 00641000
*        5 SMF87ENQ_RNAMELEN FIXED(8), /* Rname length           @L1A*/ 00642000
*        5 SMF87ENQ_REQUESTTYPE FIXED(8), /* Type of request. Refer to  00643000
*                                      constants beginning with         00644000
*                                      SMF87ENQ_REQUESTTYPE. Also see   00645000
*                                      table in prolog to map constants 00646000
*                                      to ISGENQ                 @L1A*/ 00647000
*        5 * CHAR(3),                                                   00648000
*      3 SMF87ENQ_DeviceInfo,          /* DeviceInfo subfields are      00649000
*                                      only valid for RESERVEs. They    00650000
*                                      will be zeroes if unavailable    00651000
*                                                                @L1A*/ 00652000
*        5 SMF87ENQ_DEVN BIT(16),      /* Device number if avail @L1A*/ 00653000
*        5 SMF87ENQ_UCBVOLI CHAR(6),   /* VolSer if available    @L1A*/ 00654000
*      3 SMF87ENQ_QNAME CHAR(8),       /* QNAME                  @L1A*/ 00655000
*      3 SMF87ENQ_RNAME CHAR(256)      /* Rname. Refer to               00656000
*                                      SMF87ENQ_RNAMELEN for the length 00657000
*                                      of the request RNAME      @L1A*/ 00658000
*    ;                                                        /* @L1A*/ 00659000
*                                                                       00660000
*/********************************************************************/ 00661000
*/*   ISGYSMFR - CONSTANTS                                           */ 00662000
*/********************************************************************/ 00663000
*DCL SMF87RTY_87 FIXED(8) CONSTANT(87); /* SMF87RTY constant for this   00664000
*                                      record type of 87             */ 00665000
*                                                                       00666000
*DCL SMF87STP_QSCAN FIXED(8) CONSTANT(1); /* SMF87STP constant for      00667000
*                                      the QSCAN subtype             */ 00668000
*DCL SMF87STP_ENQ FIXED(8) CONSTANT(2); /* SMF87STP constant for        00669000
*                                      the ENQ subtype           @L1A*/ 00670000
*                                                                       00671000
*DCL SMF87REQ_COMP_GRS CHAR(8) CONSTANT('SCSDS   '); /* SMF87REQ_COMP   00672000
*                                      constant for GRS              */ 00673000
*                                                                       00674000
*DCL SMF87REQ_VERSION_1 FIXED(32) CONSTANT(1); /* SMF87REQ_VERSION      00675000
*                                      section constant for version 1*/ 00676000
*DCL SMF87REQ_VERSION_2 FIXED(32) CONSTANT(2);  /* SMF87REQ_VERSION     00677000
*                                      section constant for version 2   00678000
*                                                                @L1A*/ 00679000
*DCL SMF87QSCAN_VERSION_1 FIXED(32) CONSTANT(1);/* SMF87QSCAN_VERSION   00680000
*                                      section constant for version 1*/ 00681000
*DCL SMF87ENQ_VERSION_1 FIXED(32) CONSTANT(1);  /* SMF87ENQ_VERSION     00682000
*                                      section constant for version 1   00683000
*                                                                @L1A*/ 00684000
*                                                                       00685000
*DCL SMF87QSCAN_EYE_GQSCAN CHAR(8) CONSTANT('GQSCAN  '); /* Service     00686000
*                                      constant for SMF87QSCAN_EYE  */  00687000
*DCL SMF87QSCAN_EYE_ISGQUERY CHAR(8) CONSTANT('ISGQUERY');/* Service    00688000
*                                      constant for SMF87QSCAN_EYE  */  00689000
*DCL SMF87ENQ_EYE_ENQ CHAR(8) CONSTANT('ENQ     ');  /* Service         00690000
*                                      constant for SMF87ENQ_EYE @L1A*/ 00691000
*DCL SMF87ENQ_EYE_DEQ CHAR(8) CONSTANT('DEQ     ');  /* Service         00692000
*                                      constant for SMF87ENQ_EYE @L1A*/ 00693000
*DCL SMF87ENQ_EYE_ISGENQ CHAR(8) CONSTANT('ISGENQ  ');  /* Service      00694000
*                                      constant for SMF87ENQ_EYE @L1A*/ 00695000
*                                                                       00696000
*DCL SMF87QSCAN_SCANACTION_START FIXED(8) CONSTANT(1); /* Start         00697000
*                                      constant for SMF87QSCANACTION */ 00698000
*DCL SMF87QSCAN_SCANACTION_RESUME FIXED(8) CONSTANT(2);/* Resume        00699000
*                                      constant for SMF87QSCANACTION */ 00700000
*                                                                       00701000
* /* Scope constants */                                                 00702000
*DCL SMF87ENQ_SCOPE_STEP FIXED(8) CONSTANT(1);                  ]@L1A   00703000
*DCL SMF87ENQ_SCOPE_SYSTEM FIXED(8) CONSTANT(2);                ]@L1A   00704000
*DCL SMF87ENQ_SCOPE_SYSTEMS FIXED(8) CONSTANT(3);               ]@L1A   00705000
*                                                                       00706000
* /* RequestType Constants */                                           00707000
*DCL SMF87ENQ_REQUESTTYPE_NONE FIXED(8) CONSTANT(0);            ]@L1A   00708000
*DCL SMF87ENQ_REQUESTTYPE_HAVE FIXED(8) CONSTANT(1);            ]@L1A   00709000
*DCL SMF87ENQ_REQUESTTYPE_CHANGE FIXED(8) CONSTANT(2);          ]@L1A   00710000
*DCL SMF87ENQ_REQUESTTYPE_USE FIXED(8) CONSTANT(3);             ]@L1A   00711000
*DCL SMF87ENQ_REQUESTTYPE_ECB FIXED(8) CONSTANT(4);             ]@L1A   00712000
*DCL SMF87ENQ_REQUESTTYPE_TEST FIXED(8) CONSTANT(7);            ]@L1A   00713000
*/* End of PL/X Source                                               */ 00714000
* %IF ISGYSMFR_LIST ^= 'NO' &                                           00715000
*    ZCBPRINT ^= 'NO' %THEN                                             00716000
*   %GOTO ISGYSMFR_4;                                                   00717000
*   @LIST POP NOECHO;                                                   00718000
* %ISGYSMFR_4:;                                                         00719000
* %END;                                                                 00720000
