*                                                                       00001000
* %DCL ISGYQUAC_INCLUDED CHAR EXT;                                      00002000
* %DEACTIVATE ISGYQUAC_INCLUDED;                                        00003000
* %IF ISGYQUAC_INCLUDED = '' %THEN                                      00004000
* %DO;                                                                  00005000
*/* Macro made bi-lingual on 16287. CBGEN compile date 15295         */ 00006000
*% /*                                                                   00007000
         MACRO                                                          00008000
         ISGYQUAC &DSECT=YES,&LIST=YES,&TITLE=YES,&ISGYQUAAHDR=YES,    *00009000
               &ISGYQUAAHDRUS=COND,&ISGYQUAARS=COND,&ISGYQUAARSX=COND, *00010000
               &ISGYQUAARQ=COND,&ISGYQUAARQX=COND,&ISGYQUAASYS=COND,   *00011000
               &ISGYQUAASP=COND,&ISGYQUAALD=COND,&ISGYQUAALRD=COND,    *00012000
               &ISGYQUAAUS=COND                                         00013000
         GBLC  &ISGYQUAC_INCLUDED                                       00014000
         GBLC  &ZCBPRINT                                                00015000
&ISGYQUAC_INCLUDED SETC 'YES'                                           00016000
         AIF   ('&LIST' EQ 'NONE').P0                                   00017000
         AIF   ('&TITLE' EQ 'NO').P5                                    00018000
 TITLE   'ISGYQUAC  - ISGQUERY Answer area, Compatibility remap      '  00019000
.P5      ANOP                                                           00020000
**/ ISGYQUAC_1:;                                                        00021000
*/* START OF SPECIFICATIONS ******************************************* 00022000
*                                                                       00023000
*01* PROPRIETARY STATEMENT =                                            00024000
*                                                                       00025000
*    Licensed Materials - Property of IBM                               00026000
*    5650-ZOS COPYRIGHT IBM CORP.  2013,2017                            00027000
*                                                                       00028000
*01* STATUS = HBB77B0                                                   00029000
*                                                                       00030000
*01* END OF PROPRIETARY STATEMENT                                       00031000
*                                                                       00032000
*01* EXTERNAL CLASSIFICATION:                                           00033000
*02* PI: BASE                                                           00034000
*02* NOTPI: FIELDS                                                      00035000
*           IsgyQuaaHdrV2WaiterBlocker                                  00036000
*01* END OF EXTERNAL CLASSIFICATION:                                    00037000
*                                                                       00038000
*01* DESCRIPTIVE NAME:  ISGQUERY Answer area, Compatibility remap       00039000
*02*  ACRONYM:  ISGYQUAC                                                00040000
*                                                                       00041000
*01* MACRO NAME:  ISGYQUAC                                              00042000
*                                                                       00043000
*01* DSECT NAME:                                                        00044000
*     ISGYQUAAHdr                                                       00045000
*     ISGYQUAARs                                                        00046000
*     ISGYQUAARsx                                                       00047000
*     ISGYQUAARq                                                        00048000
*     ISGYQUAARqx                                                       00049000
*     ISGYQUAASys                                                       00050000
*     ISGYQUAASp                                                        00051000
*     IsgyQuaaLd                                                        00052000
*     IsgyQuaaLrd                                                       00053000
*     IsgyQuaaHdrUs                                                     00054000
*     IsgyQuaaUs                                                        00055000
*                                                                       00056000
*01* COMPONENT:  Global Resource Serialization (SCSDS)                  00057000
*                                                                       00058000
*01* EYE-CATCHER:  ISGYQUAA                                             00059000
*02*  OFFSET:  X'0000' bytes                                            00060000
*02*  LENGTH:  X'0008' bytes                                            00061000
*                                                                       00062000
*01* STORAGE ATTRIBUTES:                                                00063000
*02*  SUBPOOL:  User-supplied                                           00064000
*02*  KEY:  User-supplied                                               00065000
*02*  RESIDENCY:  User-supplied                                         00066000
*                                                                       00067000
*01* SIZE:  Variable (and can expand in higher versions)                00068000
*            ISGYQUAAHDR   -- X'0058' bytes                             00069000
*            ISGYQUAARS    -- X'0050' bytes                             00070000
*            ISGYQUAARSX   -- X'0030' bytes                             00071000
*            ISGYQUAARQ    -- X'0040' bytes                             00072000
*            ISGYQUAARQX   -- X'0088' bytes                             00073000
*            ISGYQUAASYS   -- X'0028' bytes                             00074000
*            ISGYQUAASP    -- X'0010' bytes                             00075000
*            ISGYQUAALD    -- X'0090' bytes                             00076000
*            ISGYQUAALRD   -- X'0048' bytes                             00077000
*            ISGYQUAAHDRUS -- X'0060' bytes                             00078000
*            ISGYQUAAUS    -- X'0148' bytes                             00079000
*                                                                       00080000
*01* CREATED BY:                                                        00081000
*     Created by user and passed as parameter on ANSAREA keyword        00082000
*     for ISGQUERY macro.                                               00083000
*                                                                       00084000
*01* POINTED TO BY:                                                     00085000
*     ANSAREA_ADDR3164 field in ISGQUERY parameter list                 00086000
*                                                                       00087000
*01* SERIALIZATION:                                                     00088000
*     None required                                                     00089000
*                                                                       00090000
*01* FUNCTION:                                                          00091000
*02* Maps the data returned by the ISGQUERY macro.                      00092000
*    This data represents an unserialized view of system resources.     00093000
*    The ISGQUERY returns the ISGYQUAAHdr plus the records for          00094000
*    each resource and requesters that match the query request.         00095000
*                                                                       00096000
*    The answer area was originally mapped by ISGYQUAA but has been     00097000
*    remapped here due to compatibility issues with reversioning.       00098000
*    The fields here still begin with ISGYQUAA to minimize rework.      00099000
*    The following structures may expand in size with reversioning:     00100000
*     ISGYQUAAHdr, ISGYQUAARs, ISGYQUAARsx, ISGYQUAARq, ISGYQUAARqx,    00101000
*     ISGYQUAASys, ISGYQUAASp, ISGYQUAALd, ISGYQUAALrd,                 00102000
*     ISGYQUAAHdrUs, ISGYQUAAUs.                                        00103000
*    Constants are available for the minimum answer area sizes and      00104000
*    for specific versions of blocks to avoid data expansions if        00105000
*    desired.                                                           00106000
*                                                                       00107000
*                                                                       00108000
*    Note: Use addresses to locate each record-- the offset to the      00109000
*    next record is not guaranteed because the length and order of      00110000
*    the records may change.                                            00111000
*                                                                       00112000
*    The answer area written for REQINFO=QSCAN queries is in the        00113000
*    following format. ISGYQUAARqx records are only included if         00114000
*    ANSDETAIL=FULL!FULL2!FULL3. ISGYQUAARsx records are only included  00115000
*    if ANSDETAIL=FULL2!FULL3. ISGYQUAARqxV2 fields are only included   00116000
*    if ANSDETAIL=FULL2!FULL3.                                     @GBC 00117000
*                                                                       00118000
*     _____________                                                     00119000
*    !             !                                                    00120000
*    ! ISGYQUAAHdr !                                                    00121000
*    !_____________!                                                    00122000
*          :                                                            00123000
*          :                                                            00124000
*         _V__________                                                  00125000
*        !            !    ____________     ____________                00126000
*        ! ISGYQUAARs !-->!            !-->!            !--> ...        00127000
*        !____________!   ! ISGYQUAARq !   ! ISGYQUAARq !               00128000
*         :  :  :         !____________!   !____________!               00129000
*         :  :  V                  :                :                   00130000
*         :  : RNAME        _______V_____    _______V_____              00131000
*         : _V___________  !             !  !             !             00132000
*         :!             ! ! ISGYQUAARqx !  ! ISGYQUAARqx !             00133000
*         :! ISGYQUAARsx ! !_____________!  !_____________!             00134000
*         :!_____________!     :                    :                   00135000
*         :                    V                    V                   00136000
*         :                  ORIG.                User                  00137000
*         :                  RNAME                 Data                 00138000
*         V___________                                                  00139000
*        !            !    ____________     ____________                00140000
*        ! ISGYQUAARs !-->!            !-->!            !--> ...        00141000
*        !____________!   ! ISGYQUAARq !   ! ISGYQUAARq !               00142000
*         :  :  :         !____________!   !____________!               00143000
*         :  :  V                  :                :                   00144000
*         :  : RNAME        _______V_____    _______V_____              00145000
*         : _V___________  !             !  !             !             00146000
*         :!             ! ! ISGYQUAARqx !  ! ISGYQUAARqx !             00147000
*         :! ISGYQUAARsx ! !_____________!  !_____________!             00148000
*         :!_____________!                      :      :                00149000
*         :                                     V      V                00150000
*         :                                   ORIG.  User               00151000
*         V                                   RNAME   Data              00152000
*         ...                                                           00153000
*                                                                       00154000
*    The answer area written for REQINFO=ENQSTATS queries is in         00155000
*    the following format.  Note: Use addresses to locate each          00156000
*    record-- the offset to the next record is not guaranteed           00157000
*    because the length and order of the records may change.            00158000
*                                                                       00159000
*     _____________                                                     00160000
*    !             !                                                    00161000
*    ! ISGYQUAAHdr !                                                    00162000
*    !_____________!                                                    00163000
*          :                                                            00164000
*          :                                                            00165000
*         _V___________     _____________                               00166000
*        !             !   !             !                              00167000
*        ! ISGYQUAASys !-->! ISGYQUAASys !                              00168000
*        !_____________!   !_____________!                              00169000
*               :                 :                                     00170000
*            ___V________      ___V________                             00171000
*           !            !    !            !                            00172000
*           ! ISGYQUAASp !    ! ISGYQUAASp !                            00173000
*           !____________!    !____________!                            00174000
*                                                                       00175000
*                                                                       00176000
*    The answer area written for REQINFO=LATCHECA queries is in         00177000
*    the following format.  Note: Use addresses to locate each          00178000
*    record-- the offset to the next record is not guaranteed           00179000
*    because the length and order of the records may change.            00180000
*                                                                       00181000
*     _____________                                                     00182000
*    !             !                                                    00183000
*    ! ISGYQUAAHdr !                                                    00184000
*    !_____________!                                _______________     00185000
*          :                                       !               !    00186000
*          :            +------------------------->! ISGYLID_Entry !    00187000
*         _V__________  :                          !_______________!    00188000
*        !            !-+                                               00189000
*        ! ISGYQUAALd !--------------------------+                      00190000
*        !____________!-+                        :                      00191000
*          :            :   _____________     ___V_________             00192000
*          :            :  !             !   !             !            00193000
*          :            +->! ISGYQUAALrd !   ! ISGYQUAALrd !            00194000
*          :               !_____________!   !_____________!            00195000
*          :                                                            00196000
*          :                                                            00197000
*         _V__________                                                  00198000
*        !            !                                                 00199000
*        ! ISGYQUAALd !--------------------------+                      00200000
*        !____________!-+                        :                      00201000
*          :            :   _____________     ___V_________             00202000
*          :            :  !             !   !             !            00203000
*          :            +->! ISGYQUAALrd !   ! ISGYQUAALrd !            00204000
*          :               !_____________!   !_____________!            00205000
*          ...                                                          00206000
*                                                                       00207000
*    The answer area written for REQINFO=USAGESTATS queries is in       00208000
*    the following format.  Note: Use addresses to locate each          00209000
*    record-- the offset to the next record is not guaranteed           00210000
*    because the length and order of the records may change.            00211000
*                                                                       00212000
*     _______________                                                   00213000
*    !               !                                                  00214000
*    ! ISGYQUAAHdrUs !                                                  00215000
*    !_______________!                                                  00216000
*        :  :                                                           00217000
*        :  :                                                           00218000
*        :  +--------------+                                            00219000
*        :                 :                                            00220000
*       _V__________      _V__________                                  00221000
*      !            !    !            !                                 00222000
*      ! ISGYQUAAUs !    ! ISGYQUAAUs !                                 00223000
*      !____________!    !____________!                                 00224000
*                          :                                            00225000
*                          :                                            00226000
*                         _V__________                                  00227000
*                        !            !                                 00228000
*                        ! ISGYQUAAUs !                                 00229000
*                        !____________!                                 00230000
*                          :                                            00231000
*                          :                                            00232000
*                          V                                            00233000
*                          ...                                          00234000
*01* METHOD OF ACCESS:                                                  00235000
*02*  ASM:                                                              00236000
*      ISGYQUAA                                                         00237000
*        DSECT=YES!NO            -- Request DSECT definition            00238000
*        LIST=YES!NONE           -- Include macro prolog                00239000
*        TITLE=YES!NO            -- Include macro title                 00240000
*        ISGYQUAAHDR=YES!NO!COND -- Request Header record mapping       00241000
*        ISGYQUAARS=YES!NO!COND  -- Request Resource record mapping     00242000
*        ISGYQUAARSX=YES!NO!COND -- Request Resource record             00243000
*                                   extension mapping                   00244000
*        ISGYQUAARQ=YES!NO!COND  -- Request Requester record mapping    00245000
*        ISGYQUAARQX=YES!NO!COND -- Request Requester record            00246000
*                                   extension mapping                   00247000
*        ISGYQUAASYS=YES!NO!COND -- Request System record mapping       00248000
*        ISGYQUAASP=YES!NO!COND  -- Request Space record mapping        00249000
*        ISGYQUAALD=YES!NO!COND  -- Request Latch Data record mapping   00250000
*        ISGYQUAALRD=YES!NO!COND -- Request Latch Requester Data record 00251000
*                                   mapping                             00252000
*        ISGYQUAAHDRUS=YES!NO!COND -- Request Header Us record mapping  00253000
*        ISGYQUAAUS=YES!NO!COND  -- Request Usage record mapping        00254000
*                                                                       00255000
*     COND indicates to include only if DSECT=YES                       00256000
*                                                                       00257000
*     Default: DSECT=YES,LIST=YES,TITLE=YES,ISGYQUAAHDR=YES,            00258000
*              ISGYQUAARS=COND,ISGYQUAARSX=COND,ISGYQUAARQ=COND,        00259000
*              ISGYQUAARQX=COND,ISGYQUAASYS=COND,ISGYQUAASP=COND,       00260000
*              ISGYQUAALD=COND,ISGYQUAALRD=COND, ISGYQUAAHDRUS=COND,    00261000
*              ISGYQUAAUS=COND                                          00262000
*                                                                       00263000
*02*  PL/X:                                                             00264000
*      %INCLUDE SYSLIB(ISGYQUAC)                                        00265000
*                                                                       00266000
*01* DELETED BY:  User                                                  00267000
*                                                                       00268000
*01* FREQUENCY:  Created for response to ISGQUERY REQINFO=QSCAN,        00269000
*                REQINFO=ENQSTATS, REQINFO=LATCHECA, or                 00270000
*                REQINFO=USAGESTATS                                     00271000
*                                                                       00272000
*01* DEPENDENCIES:  None                                                00273000
*                                                                       00274000
*01* DISTRIBUTION LIBRARY:  AMACLIB                                     00275000
*                                                                       00276000
*01* CHANGE ACTIVITY:                                                   00277000
*                                                                       00278000
*    $L0=GRSSTAT3,HBB7780,100421,PDBC: ISGYQUAA compatibility remap     00279000
*    $L1=GRSSTAT3,HBB7780,100512,PDFY: REQINFO=USAGESTATS               00280000
*    $L2=GRSSTAT3,HBB7780,100716,PDFY: Remove unused fields             00281000
*    $GB=MExxxxx ,HBB7790,130128,PDGB: Clarify ANSDETAIL/ISGYQUAARqxV2  00282000
*    $L3=T111409 ,HBB77B0,160225,KKA : Added waiterblocker bit          00283000
*    $L4=FP1005  ,HBB77B0,161010,PDGB: Add 4ChUcb field to RQX for RMF  00284000
* END OF SPECIFICATIONS *********************************************/  00285000
*% /*                                                                   00286000
.P0      ANOP                                                           00287000
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 00288000
         AIF   ('&LIST' EQ 'YES').P2                                    00289000
.P1      ANOP                                                           00290000
         PUSH  PRINT                                                    00291000
         PRINT OFF                                                      00292000
.P2      ANOP                                                           00293000
*                                                                       00294000
*    The following PRAGMA statements provide control info to the CBGEN  00295000
* tool. They must be in the logic/endlogic pair.  Various fields are    00296000
* DELETEd from ASM.                                                     00297000
*                                                                       00298000
ISGYQUAA_KSTEP EQU 1                                                    00299000
ISGYQUAA_KSYSTEM EQU 2                                                  00300000
ISGYQUAA_KSYSTEMS EQU 3                                                 00301000
ISGYQUAA_KSYSPLEX EQU 3                                                 00302000
ISGYQUAA_KQSCANMINSUMMARYANSLEN EQU 440                                 00303000
*                                                                       00304000
*                                      The minimum answer area size     00305000
*                                      required when REQINFO=QSCAN,     00306000
*                                      ANSDETAIL=SUMMARY                00307000
*                                                                       00308000
ISGYQUAA_KQSCANMINFULLANSLEN EQU 800 The minimum answer area size      *00309000
                         required when REQINFO=QSCAN, ANSDETAIL=FULL    00310000
ISGYQUAA_KQSCANMINFULL2ANSLEN EQU 880 The minimum answer area size     *00311000
                         required when REQINFO=QSCAN, ANSDETAIL=FULL2   00312000
ISGYQUAA_KQSCANMINFULL3ANSLEN EQU 912 The minimum answer area size     *00313000
                         required when REQINFO=QSCAN, ANSDETAIL=FULL3   00314000
ISGYQUAA_KLATCHECAMINANSLEN EQU 660                                     00315000
*                                                                       00316000
*                                      The minimum answer area size     00317000
*                                      required when REQINFO=LATCHECA   00318000
*                                                                       00319000
ISGYQUAA_KUSAGESTATSMINANSLEN EQU 752 The minimum answer area size     *00320000
                         required when REQINFO=USAGESTATS               00321000
ISGYQUAA_KLIDENTRYLENGTH EQU 28 The size of a LidEntry                  00322000
ISGYQUAA_KLIDPRINTABLESTRINGMAXLEN EQU 256 Maximum size returned for   *00323000
                         ISGYLID printable string                       00324000
         AIF   ('&ISGYQUAAHDR' EQ 'NO').L0002                           00325000
         AIF   ('&DSECT' EQ 'YES').L0003                                00326000
         AIF   ('&ISGYQUAAHDR' NE 'YES').L0002                          00327000
.L0003   ANOP                                                           00328000
*                                                                       00329000
*    ****************************************************************   00330000
*   *                                                                   00331000
*   * ISGYQUAA Header Section                                           00332000
*   *                                                                   00333000
*   ****************************************************************    00334000
*                                                                       00335000
*                                                                       00336000
         AIF   ('&DSECT' EQ 'YES').L0004                                00337000
ISGYQUAAHDR DS 0D        Header Section                                 00338000
         AGO   .L0005                                                   00339000
.L0004   ANOP                                                           00340000
ISGYQUAAHDR DSECT        Header Section                                 00341000
.L0005   ANOP                                                           00342000
ISGYQUAAHDRV1 DS 0CL40                                                  00343000
ISGYQUAAHDRID DS CL8     ISGYQUAA eyecatcher                            00344000
ISGYQUAAHDRVERSION DS H  Header version                                 00345000
ISGYQUAAHDRREQINFO DS H  The REQINFO of the request                     00346000
ISGYQUAAHDRNUMRECORDS DS F Number of ISGYQUAARs or ISGYQUAASys records *00347000
                         returned                                       00348000
ISGYQUAAHDRFIRSTRECORD DS 0AD Addr of first data record                 00349000
         DS    CL4       First word of 64-bit field                     00350000
ISGYQUAAHDRFIRSTRECORD31 DS A Value of ISGYQUAAHDRFirstRecord for      *00351000
                         AMODE 31 callers                               00352000
ISGYQUAAHDRTOTALLEN DS 0FL8 Total Answer Area length of the header and *00353000
                         all the data records returned                  00354000
         DS    CL4       First word of 64-bit field                     00355000
ISGYQUAAHDRTOTALLEN31 DS F Value of ISGYQUAAHDRTotalLen for AMODE 31   *00356000
                         callers                                        00357000
         DS    CL8       Reserved                                       00358000
ISGYQUAAHDRV2 DS 0CL48                                                  00359000
ISGYQUAAHDRV2LASTRECORD DS 0AD Addr of last data record                 00360000
         DS    CL4       First word of 64-bit field                     00361000
ISGYQUAAHDRV2LASTRECORD31 DS A Value of ISGYQUAAHDRV2LastRecord for    *00362000
                         AMODE 31 callers                               00363000
ISGYQUAAHDRV2STARTTIME DS CL16 STCKE taken when this data collection   *00364000
                         started                                        00365000
ISGYQUAAHDRV2ENDTIME DS CL16 STCKE taken when this data collection     *00366000
                         finished                                       00367000
ISGYQUAAHDRV2FLAGS1 DS 0B First Flags byte                              00368000
ISGYQUAAHDRV2WAITER EQU X'40' Indicates if this represents a waiter    *00369000
                         request                                        00370000
         ORG   ISGYQUAAHDRV2FLAGS1+1                                    00371000
         DS    CL7       Reserved                                       00372000
*                                                                       00373000
*     ISGYQUAAHDR Constants                                             00374000
*                                                                       00375000
*                                                                       00376000
ISGYQUAAHDR_KID_0TO3 EQU C'ISGY' This is the first 4-byte segment of   *00377000
                         an 8-byte constant.                            00378000
ISGYQUAAHDR_KID_4TO7 EQU C'QUAA' This is the second 4-byte segment of  *00379000
                         an 8-byte constant.                            00380000
ISGYQUAAHDR_KMAXVERSION EQU 2                                           00381000
ISGYQUAAHDR_KHBB7780 EQU 2                                              00382000
ISGYQUAAHDR_KHBB7709 EQU 1                                              00383000
ISGYQUAAHDR_KVERSION1 EQU 1                                             00384000
ISGYQUAAHDR_KVERSION2 EQU 2                                             00385000
ISGYQUAAHDR_KREQINFO_QSCAN EQU 1                                        00386000
ISGYQUAAHDR_KREQINFO_ENQSTATS EQU 2                                     00387000
ISGYQUAAHDR_KREQINFO_LATCHECA EQU 3                                     00388000
ISGYQUAAHDRV1_KLEN EQU 40                                               00389000
ISGYQUAAHDRV2_KPARTIALLEN EQU 48                                        00390000
ISGYQUAAHDRV2_KLEN EQU 88                                               00391000
ISGYQUAAHDRMAX_KLEN EQU 88                                              00392000
ISGYQUAAHDR_LEN EQU *-ISGYQUAAHDR                                       00393000
.L0002   ANOP                                                           00394000
         AIF   ('&ISGYQUAAHDRUS' EQ 'NO').L0006                         00395000
         AIF   ('&DSECT' EQ 'YES').L0007                                00396000
         AIF   ('&ISGYQUAAHDRUS' NE 'YES').L0006                        00397000
ISGYQUAAHDRUS DS 0D      Usage Statistics Header                        00398000
         AGO   .L0008                                                   00399000
.L0007   ANOP                                                           00400000
ISGYQUAAHDRUS DSECT      Usage Statistics Header                        00401000
.L0008   ANOP                                                           00402000
ISGYQUAAHDRUSV1 DS 0CL96                                                00403000
ISGYQUAAHDRUSID DS CL8   ISGYQUAA eyecatcher                            00404000
ISGYQUAAHDRUSVERSION DS H Header version                                00405000
ISGYQUAAHDRUSREQINFO DS H The REQINFO of the request                    00406000
ISGYQUAAHDRUSNUMASRECORDS DS F Number of ISGYQUAAUs records returned   *00407000
                         for active address spaces                      00408000
ISGYQUAAHDRUSFIRSTASRECORD DS 0AD Addr of first address space data     *00409000
                         record                                         00410000
         DS    CL4       First word of 64-bit field                     00411000
ISGYQUAAHDRUSFIRSTASRECORD31 DS A Value of ISGYQUAAHDRUsFirstAsRecord  *00412000
                         for AMODE 31 callers                           00413000
ISGYQUAAHDRUSTOTALLEN DS 0FL8 Total Answer Area length of the header   *00414000
                         and all the data records returned              00415000
         DS    CL4       First word of 64-bit field                     00416000
ISGYQUAAHDRUSTOTALLEN31 DS F Value of ISGYQUAAHDRTotalLen for AMODE 31 *00417000
                         callers                                        00418000
ISGYQUAAHDRUSTERMINATEDSPACESRECORD DS 0AD Addr of the Terminated      *00419000
                         Spaces Record                                  00420000
         DS    CL4       First word of 64-bit field                     00421000
ISGYQUAAHDRUSTERMINATEDSPACESRECORD31 DS A Value of                    *00422000
                         ISGYQUAAHDRUsTerminatedSpac esRecord for      *00423000
                         AMODE 31 callers                               00424000
         DS    CL24      Reserved for future use                        00425000
ISGYQUAAHDRUSSTARTTIME DS CL16 STCKE taken when this data collection   *00426000
                         started                                        00427000
ISGYQUAAHDRUSENDTIME DS CL16 STCKE taken when this data collection     *00428000
                         finished                                       00429000
*                                                                       00430000
*     ISGYQUAAHDRUS Constants                                           00431000
*                                                                       00432000
*                                                                       00433000
ISGYQUAAHDRUS_KID_0TO3 EQU C'ISGY' This is the first 4-byte segment of *00434000
                         an 8-byte constant.                            00435000
ISGYQUAAHDRUS_KID_4TO7 EQU C'QUAA' This is the second 4-byte segment   *00436000
                         of an 8-byte constant.                         00437000
ISGYQUAAHDRUS_KMAXVERSION EQU 1                                         00438000
ISGYQUAAHDRUS_KHBB7780 EQU 1                                            00439000
ISGYQUAAHDRUS_KVERSION1 EQU 1                                           00440000
ISGYQUAAHDRUS_KREQINFO_USAGESTATS EQU 4                                 00441000
ISGYQUAAHDRUSV1_KLEN EQU 96                                             00442000
ISGYQUAAHDRUSMAX_KLEN EQU 96                                            00443000
ISGYQUAAHDRUS_LEN EQU *-ISGYQUAAHDRUS                                   00444000
.L0006   ANOP                                                           00445000
         AIF   ('&ISGYQUAARS' EQ 'NO').L0009                            00446000
         AIF   ('&DSECT' EQ 'YES').L000A                                00447000
         AIF   ('&ISGYQUAARS' NE 'YES').L0009                           00448000
.L000A   ANOP                                                           00449000
*                                                                       00450000
*    ****************************************************************   00451000
*   *                                                                   00452000
*   * ISGYQUAA Resource Data Record                                     00453000
*   *                                                                   00454000
*   ****************************************************************    00455000
*                                                                       00456000
*                                                                       00457000
         AIF   ('&DSECT' EQ 'YES').L000B                                00458000
ISGYQUAARS DS  0D        Resource Data Record                           00459000
         AGO   .L000C                                                   00460000
.L000B   ANOP                                                           00461000
ISGYQUAARS DSECT         Resource Data Record                           00462000
.L000C   ANOP                                                           00463000
ISGYQUAARSV1 DS 0CL80                                                   00464000
ISGYQUAARSVERSION DS H   ISGYQUAARs version                             00465000
ISGYQUAARSFLAGS1 DS 0B   First Flags byte                               00466000
ISGYQUAARSRQSOMITTED EQU X'80' Indicates if RQs were left out because  *00467000
                         of insufficient Answer Area Space              00468000
ISGYQUAARSRSXVALID EQU X'40' Indicates that the ISGYQUAARsRsx field is *00469000
                         valid                                          00470000
         ORG   ISGYQUAARSFLAGS1+1                                       00471000
         DS    CL5       Reserved                                       00472000
ISGYQUAARSNEXT DS 0AD    Address of next RS record returned             00473000
         DS    CL4       First word of 64-bit field                     00474000
ISGYQUAARSNEXT31 DS A    Value of ISGYQUAARsNext for AMODE 31 callers   00475000
ISGYQUAARSFIRSTRQ DS 0AD Addr of first QReq address                     00476000
         DS    CL4       First word of 64-bit field                     00477000
ISGYQUAARSFIRSTRQ31 DS A Value of ISGYQUAARsFirstRq for AMODE 31       *00478000
                         callers                                        00479000
ISGYQUAARSRNAME DS 0AD   Address of final Rname for the resource        00480000
         DS    CL4       First word of 64-bit field                     00481000
ISGYQUAARSRNAME31 DS A   Value of ISGYQUAARsRName for AMODE 31 callers  00482000
ISGYQUAARSQNAME DS CL8   Final QName of the resource                    00483000
ISGYQUAARSNUMRQ DS F     Number of Requester records returned for this *00484000
                         Resource                                       00485000
ISGYQUAARSTOTALRQ DS F   Total number of matching requesters           *00486000
                         associated with this resource. Check          *00487000
                         ISGYQUAARsRQsOmitted to see if some RQs were  *00488000
                         not included because of insufficient answer   *00489000
                         area space. If this number differs from       *00490000
                         ISGYQUAARsNumRq and ISGYQUAARsRQsOmitted is   *00491000
                         off then not all matching requester           *00492000
                         information was returned for this resource    *00493000
                         because the number exceeded the Requester     *00494000
                         Limit. To obtain a count of all requesters     00495000
*                        for this resource (matching and not), add     *00496000
                         ISGYQUAARsNumOwners, ISGYQUAARsNumEWaiters,   *00497000
                         ISGYQUAARsNumSWaiters, ISGYQUAARsNumEUsers,   *00498000
                         and ISGYQUAARsNumSUsers. Note: If             *00499000
                         SERIALIZEBY=ENQ_ONLY or SERIALIZEBY_RESERVE   *00500000
                         was specified on the query, then the counts   *00501000
                         only reflect requests that match the          *00502000
                         SERIALIZEBY filter.                            00503000
ISGYQUAARSNUMOWNERS DS F Number of matching requesters that own this   *00504000
                         resource. This number does not include owners *00505000
                         that have control of the resource by a MASID  *00506000
                         request. Note: If SERIALIZEBY=ENQ_ONLY or     *00507000
                         SERIALIZEBY_RESERVE was specified on the      *00508000
                         query, then the counts only reflect requests  *00509000
                         that match the SERIALIZEBY filter.             00510000
ISGYQUAARSNUMEWAITERS DS F Number of requesters waiting for exclusive  *00511000
                         control of this resource Note: If             *00512000
                         SERIALIZEBY=ENQ_ONLY or SERIALIZEBY_RESERVE   *00513000
                         was specified on the query, then the counts   *00514000
                         only reflect requests that match the          *00515000
                         SERIALIZEBY filter.                            00516000
ISGYQUAARSNUMSWAITERS DS F Number of requesters waiting for shared     *00517000
                         control of this resource. Note: If            *00518000
                         SERIALIZEBY=ENQ_ONLY or SERIALIZEBY_RESERVE   *00519000
                         was specified on the query, then the counts   *00520000
                         only reflect requests that match the          *00521000
                         SERIALIZEBY filter.                            00522000
ISGYQUAARSNUMEUSERS DS F Number of MASID requests that have exclusive  *00523000
                         control of this resource. Note: If            *00524000
                         SERIALIZEBY=ENQ_ONLY or SERIALIZEBY_RESERVE   *00525000
                         was specified on the query, then the counts   *00526000
                         only reflect requests that match the          *00527000
                         SERIALIZEBY filter.                            00528000
ISGYQUAARSNUMSUSERS DS F Number of MASID requests that have shared     *00529000
                         control of this resource. Note: If            *00530000
                         SERIALIZEBY=ENQ_ONLY or SERIALIZEBY_RESERVE   *00531000
                         was specified on the query, then the counts   *00532000
                         only reflect requests that match the          *00533000
                         SERIALIZEBY filter.                            00534000
ISGYQUAARSRNAMELEN DS H  Length of resource RName                       00535000
ISGYQUAARSSCOPE DS X     Final scope of resource. One of either        *00536000
                         ISGYQUAA_kSTEP, ISGYQUAA_kSYSTEM, or          *00537000
                         ISGYQUAA_kSYSPLEX                              00538000
         DS    CL1       Reserved                                       00539000
ISGYQUAARSRSX DS 0AD     Address of resource record extension. Valid   *00540000
                         only if ISGYQUAARsRsxValid is set.             00541000
         DS    CL4       First word of 64-bit field                     00542000
ISGYQUAARSRSX31 DS A     Value of ISGYQUAARsRsx for AMODE 31 callers    00543000
*                                                                       00544000
*     ISGYQUAARS Constants                                              00545000
*                                                                       00546000
*                                                                       00547000
ISGYQUAARS_KMAXVERSION EQU 2                                            00548000
ISGYQUAARS_KHBB7709 EQU 1                                               00549000
ISGYQUAARS_KHBB7740 EQU 2                                               00550000
ISGYQUAARS_KVERSION1 EQU 1                                              00551000
ISGYQUAARS_KVERSION2 EQU 2                                              00552000
ISGYQUAARSV1_KLEN EQU 80                                                00553000
ISGYQUAARSMAX_KLEN EQU 80                                               00554000
ISGYQUAARS_LEN EQU *-ISGYQUAARS                                         00555000
.L0009   ANOP                                                           00556000
         AIF   ('&ISGYQUAARSX' EQ 'NO').L000D                           00557000
         AIF   ('&DSECT' EQ 'YES').L000E                                00558000
         AIF   ('&ISGYQUAARSX' NE 'YES').L000D                          00559000
.L000E   ANOP                                                           00560000
*                                                                       00561000
*    *****************************************************************  00562000
*   *                                                                   00563000
*   * ISGYQUAA Resource Data Record Extension                           00564000
*   *   (Only returned when ANSDETAIL=FULL2 or higher)                  00565000
*   *                                                                   00566000
*   ******************************************************************  00567000
*                                                                       00568000
*                                                                       00569000
         AIF   ('&DSECT' EQ 'YES').L000F                                00570000
ISGYQUAARSX DS 0D        Resource extension                             00571000
         AGO   .L0010                                                   00572000
.L000F   ANOP                                                           00573000
ISGYQUAARSX DSECT        Resource extension                             00574000
.L0010   ANOP                                                           00575000
ISGYQUAARSXV1 DS 0CL48                                                  00576000
ISGYQUAARSXVERSION DS H  ISGYQUAARsx version                            00577000
ISGYQUAARSXFLAGS1 DS 0B  Flags byte                                     00578000
ISGYQUAARSXRSCTOKENVALID EQU X'80' Indicates that the                  *00579000
                         ISGYQUAARsxRscToken is valid. Currently, for  *00580000
                         Star mode globals the token is only valid for *00581000
                         resources for which the local system has      *00582000
                         interest. Ring mode globals and all locals    *00583000
                         will always have a valid token                 00584000
         ORG   ISGYQUAARSXFLAGS1+1                                      00585000
         DS    CL1       Reserved                                       00586000
ISGYQUAARSXRSCTOKEN DS CL32 This token can be used to identify an      *00587000
                         instance of the resource identified by        *00588000
                         ISGYQUAARs. The token represents the local    *00589000
                         systems view of the resource and expires when *00590000
                         no requests for the resource remain.          *00591000
                         Additionally, in Star mode the token expires  *00592000
                         when the local system no longer has interest  *00593000
                         in (i.e. requests for) the resource. Only     *00594000
                         valid if ISGYQUAARsxRscTokenValid is on.       00595000
         DS    CL12      Reserved                                       00596000
*                                                                       00597000
*     ISGYQUAARsx Constants                                             00598000
*                                                                       00599000
*                                                                       00600000
ISGYQUAARSX_KMAXVERSION EQU 1                                           00601000
ISGYQUAARSX_KHBB7740 EQU 1                                              00602000
ISGYQUAARSX_KVERSION1 EQU 1                                             00603000
ISGYQUAARSXV1_KLEN EQU 48                                               00604000
ISGYQUAARSXMAX_KLEN EQU 48                                              00605000
ISGYQUAARSX_LEN EQU *-ISGYQUAARSX                                       00606000
.L000D   ANOP                                                           00607000
         AIF   ('&ISGYQUAARQ' EQ 'NO').L0011                            00608000
         AIF   ('&DSECT' EQ 'YES').L0012                                00609000
         AIF   ('&ISGYQUAARQ' NE 'YES').L0011                           00610000
.L0012   ANOP                                                           00611000
*                                                                       00612000
*    ****************************************************************   00613000
*   *                                                                   00614000
*   * ISGYQUAA Requester Data Record                                    00615000
*   *                                                                   00616000
*   ****************************************************************    00617000
*                                                                       00618000
*                                                                       00619000
         AIF   ('&DSECT' EQ 'YES').L0013                                00620000
ISGYQUAARQ DS  0D        Requester Data Record                          00621000
         AGO   .L0014                                                   00622000
.L0013   ANOP                                                           00623000
ISGYQUAARQ DSECT         Requester Data Record                          00624000
.L0014   ANOP                                                           00625000
ISGYQUAARQV1 DS 0CL64                                                   00626000
ISGYQUAARQVERSION DS H   ISGYQUAARQ version                             00627000
ISGYQUAARQFLAGS1 DS 0B   First flags byte                               00628000
ISGYQUAARQCONTROL EQU X'80' Type of serialization for request, where 0 *00629000
                         = exclusive control and 1 = shared control     00630000
ISGYQUAARQRESERVE EQU X'40' Request specified (or was changed by a     *00631000
                         dynamic exit) to obtain a device reserve. The *00632000
                         device is known to be reserved when           *00633000
                         ISGYQUAARqReserveConverted is off and         *00634000
                         ISGYQUAARqSynchRes and ISGYQUAARqPosted are   *00635000
                         on and one of the following two conditions    *00636000
                         are true. 1) The request originated from the  *00637000
                         local system 2) Global Resource Serialization *00638000
                         is operating in Star mode. The device will be *00639000
                         setup to be reserved on the first I/O (which   00640000
*                        may have completed) if                        *00641000
                         ISGYQUAARqReserveConverted is off,            *00642000
                         ISGYQUAARqSynchRes is off, and                *00643000
                         ISGYQUAARqPosted is on.                        00644000
ISGYQUAARQRESERVECONVERTED EQU X'20' Request specified to obtain a     *00645000
                         device reserve, but request was converted to  *00646000
                         a global (SYSTEMS) ENQ                         00647000
ISGYQUAARQSYNCHRES EQU X'10' Request specified to obtain a device      *00648000
                         reserve, the device was already reserved by   *00649000
                         the same system image or it was committed to  *00650000
                         being done synchronously (SYNCHRES). Only     *00651000
                         valid if ISGYQUAARqMisc64Valid is set.         00652000
ISGYQUAARQOWNER EQU X'08' Requester is an owner of the resource. If    *00653000
                         the requester is not an owner, and also not a *00654000
                         Matching task user (See ISGYQUAARqMATU) then  *00655000
                         the requester is a waiter. Note that if a     *00656000
                         non-converted reserve (ISGYQUAARqReserve is   *00657000
                         on and ISGYQUAARqReserveConverted is off)     *00658000
                         then see ISGYQUAARqSynchRes to determine the  *00659000
                         state of the reserve processing.               00660000
ISGYQUAARQMATU EQU X'04' Matching task use indicator. Requester is     *00661000
                         using the resource as the result of a         *00662000
                         MASID/MTCB request                             00663000
ISGYQUAARQPOSTED EQU X'02' The requester has been informed that the    *00664000
                         request has completed. The ECB has been       *00665000
                         posted or the requester's suspended TCB RB    *00666000
                         has been posted. Note that in Ring mode, when *00667000
                         the request originated on another system and  *00668000
                         ISGYQUAARqSynchRes is on, the requester may   *00669000
                         be waiting for synchronous reserve processing *00670000
                         to complete.                                   00671000
ISGYQUAARQMISC64VALID EQU X'01' In some cases not all the information  *00672000
                         is available from remote systems. This bit    *00673000
                         indicates that the following fields are       *00674000
                         valid: ISGYQUAARQEnqToken and                 *00675000
                         ISGYQUAARQSynchRes. Also, when this bit and   *00676000
                         the ISGYQUAARqRqxValid bit is on, the         *00677000
                         following fields are valid:                   *00678000
                         ISGYQUAARqxAltSerExtended,                    *00679000
                         ISGYQUAARqxNQXITChanged,                      *00680000
                         ISGYQUAARqxBatchChanged, ISGYQUAARqxEnqTime,   00681000
*                        ISGYQUAARqxRNLChanged,                        *00682000
                         ISGYQUAARqxOrigQNameValid,                    *00683000
                         ISGYQUAARqxOrigRNameValid,                    *00684000
                         ISGYQUAARqxOrigScopeValid, ISGYQUAARqxOrigUCB *00685000
                         ISGYQUAARqxSToken, ISGYQUAARqxTToken,         *00686000
                         ISGYQUAARqxUserDataValid, and                 *00687000
                         ISGYQUAARqxUserDataOmitted                     00688000
         ORG   ISGYQUAARQFLAGS1+1                                       00689000
ISGYQUAARQFLAGS2 DS 0B   Second flags byte                              00690000
ISGYQUAARQRQXVALID EQU X'80' Indicates that the ISGYQUAARqRQX field is *00691000
                         valid                                          00692000
         ORG   ISGYQUAARQFLAGS2+1                                       00693000
ISGYQUAARQTCB DS A       TCB address of requester                       00694000
ISGYQUAARQNEXT DS 0AD    Address of next requester record returned      00695000
         DS    CL4       First word of 64-bit field                     00696000
ISGYQUAARQNEXT31 DS A    Value of ISGYQUAARqNext for AMODE 31 callers   00697000
ISGYQUAARQRQX DS 0AD     Address of requester record extension. Valid  *00698000
                         only if ISGYQUAARqRQXValid is set.             00699000
         DS    CL4       First word of 64-bit field                     00700000
ISGYQUAARQRQX31 DS A     Value of ISGYQUAARqRQX for AMODE 31 callers    00701000
ISGYQUAARQENQTOKEN DS CL32 ENQToken that represents this request. Only *00702000
                         valid if ISGYQUAARqMisc64Valid is set.         00703000
         DS    CL8       Reserved                                       00704000
*                                                                       00705000
*     ISGYQUAARQ Constants                                              00706000
*                                                                       00707000
*                                                                       00708000
ISGYQUAARQ_KMAXVERSION EQU 1                                            00709000
ISGYQUAARQ_KHBB7709 EQU 1                                               00710000
ISGYQUAARQ_KVERSION1 EQU 1                                              00711000
ISGYQUAARQV1_KLEN EQU 64                                                00712000
ISGYQUAARQMAX_KLEN EQU 64                                               00713000
ISGYQUAARQ_LEN EQU *-ISGYQUAARQ                                         00714000
.L0011   ANOP                                                           00715000
         AIF   ('&ISGYQUAARQX' EQ 'NO').L0015                           00716000
         AIF   ('&DSECT' EQ 'YES').L0016                                00717000
         AIF   ('&ISGYQUAARQX' NE 'YES').L0015                          00718000
.L0016   ANOP                                                           00719000
*                                                                       00720000
*    *****************************************************************  00721000
*   *                                                                   00722000
*   * ISGYQUAA Requester Data Record Extension                          00723000
*   *   (Only returned when ANSDETAIL=FULL or higher)                   00724000
*   *                                                                   00725000
*   ******************************************************************  00726000
*                                                                       00727000
*                                                                       00728000
         AIF   ('&DSECT' EQ 'YES').L0017                                00729000
ISGYQUAARQX DS 0D        Rqx of ANSDETAIL=FULL                          00730000
         AGO   .L0018                                                   00731000
.L0017   ANOP                                                           00732000
ISGYQUAARQX DSECT        Rqx of ANSDETAIL=FULL                          00733000
.L0018   ANOP                                                           00734000
ISGYQUAARQXV1 DS 0CL104                                                 00735000
ISGYQUAARQXVERSION DS H  ISGYQUAARQX version                            00736000
ISGYQUAARQXFLAGS1 DS 0B  Flags byte                                     00737000
ISGYQUAARQXNQXITCHANGED EQU X'80' Indicates that the request was       *00738000
                         modified by an ENQ exit. ISGNQXIT or          *00739000
                         ISGNQXITFAST Only valid if                    *00740000
                         ISGYQUAARqMisc64Valid is set.                  00741000
ISGYQUAARQXBATCHCHANGED EQU X'40' Indicates that the request was       *00742000
                         modified by a batch exit. ISGNQXITBATCH,      *00743000
                         ISGNQXITPREBATCH, or ISGNQXITBATCHCND. Only   *00744000
                         valid if ISGYQUAARqMisc64Valid is set.         00745000
ISGYQUAARQXRNLCHANGED EQU X'20' Indicates that the scope was modified  *00746000
                         by the RNLs Only valid if                     *00747000
                         ISGYQUAARqMisc64Valid is set.                  00748000
ISGYQUAARQXORIGQNAMEVALID EQU X'10' Indicates that the                 *00749000
                         ISGYQUAARqxOrigQName field is valid. If off   *00750000
                         then the original QName is the same as the    *00751000
                         final. This bit is only valid if              *00752000
                         ISGYQUAARqMisc64Valid is set.                  00753000
ISGYQUAARQXORIGRNAMEVALID EQU X'08' Indicates that the                 *00754000
                         ISGYQUAARqxOrigRName field is valid. If off   *00755000
                         then the original RName is the same as the    *00756000
                         final. This bit is only valid if              *00757000
                         ISGYQUAARqMisc64Valid is set.                  00758000
ISGYQUAARQXORIGUCB@VALID EQU X'04' Indicates that the                  *00759000
                         ISGYQUAARqxOrigUCB field is valid. If off     *00760000
                         then the original UCB@ is the same as the     *00761000
                         final. This bit is only valid if              *00762000
                         ISGYQUAARqMisc64Valid is set.                  00763000
ISGYQUAARQXORIGSCOPEVALID EQU X'02' Indicates that the                 *00764000
                         ISGYQUAARqxOrigScope field is valid. If off   *00765000
                         then the original scope is the same as the    *00766000
                         final. This bit is only valid if              *00767000
                         ISGYQUAARqMisc64Valid is set.                  00768000
ISGYQUAARQXSERVICEASIDVALID EQU X'01' ISGYQUAARqxServiceAsid field is  *00769000
                         valid                                          00770000
         ORG   ISGYQUAARQXFLAGS1+1                                      00771000
ISGYQUAARQXFLAGS2 DS 0B  Second flags byte                              00772000
ISGYQUAARQXMUSTCOMPLETE EQU X'80' Request set must complete             00773000
ISGYQUAARQXAUTHORIZED EQU X'40' Requester was authorized                00774000
ISGYQUAARQXALTSEREXTENDED EQU X'20' This request is being managed by   *00775000
                         an alternate serialization product at the     *00776000
                         global level. This bit is only valid if       *00777000
                         ISGYQUAARqMisc64Valid is set.                  00778000
ISGYQUAARQXMATCHINGTASK EQU X'10' This is a matching task (MTCB/MASID) *00779000
                         request. ISGYQUAARqxMTcb and ISGYQUAARqxMAsid *00780000
                         contain the TCB and ASID of the matching task  00781000
ISGYQUAARQXECBREQUEST EQU X'08' ECB was specified on ENQ request        00782000
ISGYQUAARQXUSERDATAVALID EQU X'04' Userdata was specified on the       *00783000
                         ISGENQ request and ANSDETAIL=FULL3 was        *00784000
                         specified on this ISGQUERY request. This bit  *00785000
                         is only valid if ISGYQUAARqMisc64Valid is     *00786000
                         set. If Userdata was expected for this        *00787000
                         requester, and ISGYQUAARqMisc64Valid is set,  *00788000
                         but this bit is off, one of the following     *00789000
                         conditions is true: 1)GRS is operating in     *00790000
                         STAR mode, this resource is global, and the   *00791000
                         ISGQUERY request specified                     00792000
*                        GATHERFROM=SYSPLEX. If the resource request   *00793000
                         originated on the current system, issue       *00794000
                         another ISGQUERY specifying GATHERFROM=SYSTEM *00795000
                         to obtain the Userdata. 2) The                *00796000
                         ISGYQUAARqxUserdataOmitted bit is set. See    *00797000
                         the declaration for details.                   00798000
ISGYQUAARQXUSERDATAOMITTED EQU X'02' Userdata was specified on the     *00799000
                         ISGENQ request and ANSDETAIL=FULL3 was        *00800000
                         specified on this ISGQUERY request, however,  *00801000
                         there was not enough room in the answer area  *00802000
                         to return the userdata. Allocate a larger     *00803000
                         answer area space. Use the following formula  *00804000
                         to determine the amount of storage needed:    *00805000
                         (ISGYQUAA_kQScanMinFull3AnsLen +              *00806000
                         ISGYQUAARqxUserdataLen -                      *00807000
                         ISGYQUAAUserDataInitialLen)                    00808000
         ORG   ISGYQUAARQXFLAGS2+1                                      00809000
         DS    CL2       Reserved                                       00810000
ISGYQUAARQXREQUESTERDATA DS 0CL42                                       00811000
ISGYQUAARQXASID DS H     ASID of ENQ requester                          00812000
ISGYQUAARQXSTOKEN DS CL8 SToken of requester. Only valid if            *00813000
                         ISGYQUAARqMisc64Valid is set.                  00814000
ISGYQUAARQXTTOKEN DS CL16 TToken of requester. Only valid if           *00815000
                         ISGYQUAARqMisc64Valid is set.                  00816000
ISGYQUAARQXJOBNAME DS CL8 Job name of requester                         00817000
ISGYQUAARQXSYSNAME DS CL8 System name of requester                      00818000
ISGYQUAARQXMTCB DS A     Matching task TCB (MTCB) specified by         *00819000
                         requester. Valid only if                      *00820000
                         ISGYQUAARqxMatchingTask is set                 00821000
ISGYQUAARQXMASID DS H    Matching task ASID (MASID) specified by       *00822000
                         requester. Valid only if                      *00823000
                         ISGYQUAARqxMatchingTask is set                 00824000
ISGYQUAARQXSERVICEASID DS H ASID of the task for which a service       *00825000
                         PROVIDER performed this ENQ request. If       *00826000
                         ISGYQUAARqxServiceAsidValid is set then       *00827000
                         ISGYQUAARqxAsid is the ASID of the service    *00828000
                         PROVIDER and ISGYQUAARqServiceAsid is the     *00829000
                         ASID of the service REQUESTER. If             *00830000
                         ISGYQUAARqxServiceAsid is zero, the service   *00831000
                         REQUESTER's ASID is not available              00832000
ISGYQUAARQXECB DS 0A     ECB address if ISGYQUAARqxECBRequest is set    00833000
ISGYQUAARQXSVRB DS A     SVRB address if ISGYQUAARqxECBRequest is zero  00834000
ISGYQUAARQXUCB DS A      Final UCB address if request was for a device *00835000
                         reserve on this system for a three-digit      *00836000
                         device-number device. Otherwise, arithmetic   *00837000
                         zero. Note that if ISGYQUAARqReserveConverted *00838000
                         is set the device was not reserved             00839000
ISGYQUAARQXDEVICENUM DS CL4 If the request was for a device reserve    *00840000
                         from the current system then this field       *00841000
                         contains the EBCDIC device number of the the  *00842000
                         target of the reserve, Otherwise it is        *00843000
                         arithmetic zero                                00844000
ISGYQUAARQX4CHUCB DS A   Same as ISGYQUAARqxUcb excect it includes     *00845000
                         four character device number devices           00846000
ISGYQUAARQXORIGQNAME DS CL8 Original QName specified on request. Only  *00847000
                         valid if ISGYQUAARqxOrigQNameValid and        *00848000
                         ISGYQUAARqMisc64Valid are set.                 00849000
ISGYQUAARQXORIGRNAME DS 0AD Address of original RName specified on     *00850000
                         request. Only valid if                        *00851000
                         ISGYQUAARqxOrigRNameValid and                 *00852000
                         ISGYQUAARqMisc64Valid are set.                 00853000
         DS    CL4       First word of 64-bit field                     00854000
ISGYQUAARQXORIGRNAME31 DS A Value of ISGYQUAARqxOrigRName for AMODE 31 *00855000
                         callers                                        00856000
ISGYQUAARQXORIGUCB@ DS A Original UCB@ specified on request if the UCB *00857000
                         address was changed by a dynamic exit. Note   *00858000
                         that a reserve conversion does not change the *00859000
                         UCB@, but causes the device reserve request   *00860000
                         to be ignored. Only valid if if               *00861000
                         ISGYQUAARqxOrigUCB@Valid and                  *00862000
                         ISGYQUAARqMisc64Valid are set.                 00863000
ISGYQUAARQXORIGRNAMELEN DS X Length of original RName specified on     *00864000
                         request. Only valid if                        *00865000
                         ISGYQUAARqxOrigRNameValid and                 *00866000
                         ISGYQUAARqMisc64Valid are set.                 00867000
ISGYQUAARQXORIGSCOPE DS X Original scope specified on request. One of  *00868000
                         either ISGYQUAA_kSTEP, ISGYQUAA_kSYSTEM, or   *00869000
                         ISGYQUAA_kSYSPLEX. Only valid if if           *00870000
                         ISGYQUAARqxOrigScopeValid and                 *00871000
                         ISGYQUAARqMisc64Valid are set.                 00872000
ISGYQUAARQXUSERDATALEN DS H Length of Userdata specified on request.   *00873000
                         Only valid if ISGYQUAARqxUserdataValid and    *00874000
                         ISGYQUAARqMisc64Valid are set.                 00875000
ISGYQUAARQXUSERDATA DS 0AD Address of userdata specified on request.   *00876000
                         Only valid if ISGYQUAARqxUserdataValid and    *00877000
                         ISGYQUAARqMisc64Valid are set. Note: The      *00878000
                         length, ISGYQUAARqxUserdataLen, should always *00879000
                         be used when accessing the userdata, as its   *00880000
                         length may change in the future                00881000
         DS    CL4       First word of 64-bit field                     00882000
ISGYQUAARQXUSERDATA31 DS A Value of ISGYQUAARqxUserData for AMODE 31   *00883000
                         callers                                        00884000
ISGYQUAARQXV2 DS 0CL32                                                  00885000
ISGYQUAARQXV2ENQTIME DS CL16 This is the time, in extended TOD format, *00886000
                         of when the ENQ request was originally made.  *00887000
                         Only valid if ISGYQUAARqMisc64Valid is set.    00888000
         DS    CL16      Reserved                                       00889000
*                                                                       00890000
*     ISGYQUAARQX Constants                                             00891000
*                                                                       00892000
*                                                                       00893000
ISGYQUAARQX_KMAXVERSION EQU 2                                           00894000
ISGYQUAARQX_KHBB7709 EQU 1                                              00895000
ISGYQUAARQX_KHBB7740 EQU 2                                              00896000
ISGYQUAARQX_KVERSION1 EQU 1                                             00897000
ISGYQUAARQX_KVERSION2 EQU 2                                             00898000
ISGYQUAARQXV1_KLEN EQU 104                                              00899000
ISGYQUAARQXV2_KPARTIALLEN EQU 32                                        00900000
ISGYQUAARQXV2_KLEN EQU 136                                              00901000
ISGYQUAARQXMAX_KLEN EQU 136                                             00902000
ISGYQUAARQX_LEN EQU *-ISGYQUAARQX                                       00903000
.L0015   ANOP                                                           00904000
         AIF   ('&ISGYQUAASYS' EQ 'NO').L0019                           00905000
         AIF   ('&DSECT' EQ 'YES').L001A                                00906000
         AIF   ('&ISGYQUAASYS' NE 'YES').L0019                          00907000
.L001A   ANOP                                                           00908000
*                                                                       00909000
*    ****************************************************************   00910000
*   *                                                                   00911000
*   * ISGYQUAA System Data                                              00912000
*   *   (Only relevant for REQINFO=ENQSTATS)                            00913000
*   *                                                                   00914000
*   ****************************************************************    00915000
*                                                                       00916000
*                                                                       00917000
         AIF   ('&DSECT' EQ 'YES').L001B                                00918000
ISGYQUAASYS DS 0D        The REQINFO=ENQSTATS system data               00919000
         AGO   .L001C                                                   00920000
.L001B   ANOP                                                           00921000
ISGYQUAASYS DSECT        The REQINFO=ENQSTATS system data               00922000
.L001C   ANOP                                                           00923000
ISGYQUAASYSV1 DS 0CL40                                                  00924000
ISGYQUAASYSVERSION DS H  ISGYQUAASys version                            00925000
ISGYQUAASYSFLAGS1 DS 0B  First Flags byte                               00926000
ISGYQUAASYSAUTHORIZED EQU X'80' Indicates whether this block refers to *00927000
                         the authorized or unauthorized counts          00928000
         ORG   ISGYQUAASYSFLAGS1+1                                      00929000
         DS    CL5       Reserved                                       00930000
ISGYQUAASYSNEXT DS 0AD   Address of next system record returned         00931000
         DS    CL4       First word of 64-bit field                     00932000
ISGYQUAASYSNEXT31 DS A   Value of ISGYQUAASysNext for AMODE 31 callers  00933000
ISGYQUAASYSSP DS 0AD     Address of address-space specific data (the   *00934000
                         ISGYQUAASysAuthorized flag applies to it as   *00935000
                         well)                                          00936000
         DS    CL4       1st word of 64-bit field                       00937000
ISGYQUAASYSSP31 DS A     Value of ISGYQUAASysSp for AMODE 31 callers    00938000
ISGYQUAASYSPEAKENQDATA DS 0CL8                                          00939000
ISGYQUAASYSPEAKENQCOUNT DS F Peak ENQ count of requesters for any      *00940000
                         address space for the life of the system       00941000
ISGYQUAASYSPEAKENQASID DS H ASID associated with with the overall peak *00942000
                         for ENQ requests. Note that ASIDs are         *00943000
                         reusable and the address space may not still  *00944000
                         be active.                                     00945000
         DS    CL2       unused                                         00946000
ISGYQUAASYSENQMAX DS F   System-wide maximum limit of ENQs from any    *00947000
                         one address space                              00948000
         DS    CL4       unused                                         00949000
*                                                                       00950000
*     ISGYQUAASys Constants                                             00951000
*                                                                       00952000
*                                                                       00953000
ISGYQUAASYS_KMAXVERSION EQU 1                                           00954000
ISGYQUAASYS_KHBB7730 EQU 1                                              00955000
ISGYQUAASYS_KVERSION1 EQU 1                                             00956000
ISGYQUAASYSV1_KLEN EQU 40                                               00957000
ISGYQUAASYSMAX_KLEN EQU 40                                              00958000
ISGYQUAASYS_LEN EQU *-ISGYQUAASYS                                       00959000
.L0019   ANOP                                                           00960000
         AIF   ('&ISGYQUAASP' EQ 'NO').L001D                            00961000
         AIF   ('&DSECT' EQ 'YES').L001E                                00962000
         AIF   ('&ISGYQUAASP' NE 'YES').L001D                           00963000
.L001E   ANOP                                                           00964000
*                                                                       00965000
*    ****************************************************************   00966000
*   *                                                                   00967000
*   * ISGYQUAA Address Space Data                                       00968000
*   *   (Only relevant for REQINFO=ENQSTATS)                            00969000
*   *                                                                   00970000
*   ****************************************************************    00971000
*                                                                       00972000
*                                                                       00973000
         AIF   ('&DSECT' EQ 'YES').L001F                                00974000
ISGYQUAASP DS  0D        REQINFO=ENQSTATS address space specific data   00975000
         AGO   .L0020                                                   00976000
.L001F   ANOP                                                           00977000
ISGYQUAASP DSECT         REQINFO=ENQSTATS address space specific data   00978000
.L0020   ANOP                                                           00979000
ISGYQUAASPV1 DS 0CL16                                                   00980000
ISGYQUAASPVERSION DS H   ISGYQUAASp version                             00981000
         DS    CL2       Reserved                                       00982000
ISGYQUAASPCURRENQCOUNT DS F Current ENQ count for the specified        *00983000
                         address space                                  00984000
ISGYQUAASPPEAKENQCOUNT DS F Peak ENQ count of requesters for the life  *00985000
                         of the specified address space.                00986000
ISGYQUAASPENQMAX DS F    If non-zero, the address- space specific      *00987000
                         maximum number of ENQs, set via ISGADMIN. If  *00988000
                         zero, none exists and the system maximum is   *00989000
                         used.                                          00990000
*                                                                       00991000
*     ISGYQUAASp Constants                                              00992000
*                                                                       00993000
*                                                                       00994000
ISGYQUAASP_KMAXVERSION EQU 1                                            00995000
ISGYQUAASP_KHBB7730 EQU 1                                               00996000
ISGYQUAASP_KVERSION1 EQU 1                                              00997000
ISGYQUAASPV1_KLEN EQU 16                                                00998000
ISGYQUAASPMAX_KLEN EQU 16                                               00999000
ISGYQUAAUSERDATA_KINITIALLEN EQU 32 The initial length of              *01000000
                         ISGYQUAAUserdata                               01001000
ISGYQUAASP_LEN EQU *-ISGYQUAASP                                         01002000
.L001D   ANOP                                                           01003000
         AIF   ('&ISGYQUAALD' EQ 'NO').L0021                            01004000
         AIF   ('&DSECT' EQ 'YES').L0022                                01005000
         AIF   ('&ISGYQUAALD' NE 'YES').L0021                           01006000
.L0022   ANOP                                                           01007000
*                                                                       01008000
*    ****************************************************************   01009000
*  *                                                                    01010000
*  * IsgyQuaa Latch Data                                                01011000
*  *   (Only Relevent for REQINFO=LatchECA)                             01012000
*  *                                                                    01013000
*  *******************************************************************  01014000
*                                                                       01015000
*                                                                       01016000
         AIF   ('&DSECT' EQ 'YES').L0023                                01017000
ISGYQUAALD DS  0D        Latch Data                                     01018000
         AGO   .L0024                                                   01019000
.L0023   ANOP                                                           01020000
ISGYQUAALD DSECT         Latch Data                                     01021000
.L0024   ANOP                                                           01022000
ISGYQUAALDV1 DS 0CL144                                                  01023000
ISGYQUAALDVERSION DS H   IsgyQuaaLD version                             01024000
ISGYQUAALDFLAGS1 DS 0B   First Flags byte                               01025000
ISGYQUAALDLATCHIDVALID EQU X'80' Indicates if there is a LID for this  *01026000
                         latch                                          01027000
ISGYQUAALDDATANOTAVAIL EQU X'40' Indicates that there was a problem    *01028000
                         obtaining information on the requesters of    *01029000
                         this latch. When set no waiter or blocker     *01030000
                         LRDs are returned and IsgyQuaaLDDiag1 and     *01031000
                         IsgyQuaaLDDiag2 hold diagnostic information.  *01032000
                         If the data for this latch is vital, re-issue *01033000
                         the ISGQUERY Request                           01034000
         ORG   ISGYQUAALDFLAGS1+1                                       01035000
         DS    CL5       Reserved                                       01036000
ISGYQUAALDNEXT DS 0AD    Address of next latch record returned          01037000
         DS    CL4       First word of 64-bit field                     01038000
ISGYQUAALDNEXT31 DS A    Value of IsgyQuaaLdNext for AMODE 31 callers   01039000
ISGYQUAALDPREV DS 0AD    Address of Prev latch record returned          01040000
         DS    CL4       First word of 64-bit field                     01041000
ISGYQUAALDPREV31 DS A    Value of IsgyQuaaLdPrev for AMODE 31 callers   01042000
ISGYQUAALDWAITERLRD DS 0AD Address of first latch requester data for a *01043000
                         waiter                                         01044000
         DS    CL4       1st word of 64-bit field                       01045000
ISGYQUAALDWAITERLRD31 DS A Value of IsgyQuaaLdWaiterLrd for AMODE 31   *01046000
                         callers                                        01047000
ISGYQUAALDBLOCKERLRD DS 0AD Address of first latch requester data for  *01048000
                         a blocker                                      01049000
         DS    CL4       1st word of 64-bit field                       01050000
ISGYQUAALDBLOCKERLRD31 DS A Value of IsgyQuaaLdBlockerLrd for AMODE 31 *01051000
                         callers                                        01052000
ISGYQUAALDLATCHNUM DS F  The latch number                               01053000
ISGYQUAALDLATCHIDLEN DS H The length of the latch Identity entry for   *01054000
                         this latch. Only valid if                     *01055000
                         IsgyQuaaLdLatchIDValid is ON                   01056000
ISGYQUAALDLATCHIDVERSION DS X The version of the latch Identity entry  *01057000
                         for this latch. Only valid if                 *01058000
                         IsgyQuaaLdLatchIDValid is ON                   01059000
         DS    CL1       Reserved                                       01060000
ISGYQUAALDLATCHID DS 0AD The address of the latch Identity entry for   *01061000
                         this latch. Only valid if                     *01062000
                         IsgyQuaaLdLatchIdValid is ON. See             *01063000
                         ISGYLID_Entry defined in the language         *01064000
                         specific latch macro for more details on the  *01065000
                         control block pointed to by this field         01066000
         DS    CL4       1st word of 64-bit field                       01067000
ISGYQUAALDLATCHID31 DS A Value of IsgyQuaaLdLatchID for AMODE 31       *01068000
                         callers                                        01069000
ISGYQUAALDCASID DS H     ASID of the latch set creator                  01070000
ISGYQUAALDRETURNEDLIDPSLEN DS H Length of the Latch ID printable       *01071000
                         string that is returned. Normally this will   *01072000
                         be the same as LidPrintableStringLength,      *01073000
                         unless it has been truncated to               *01074000
                         IsgyQuaa_kLidPrintableStrin gMaxLen            01075000
         DS    CL4       Unused                                         01076000
ISGYQUAALDNUMBLOCKERS DS 0F Total number of owners of this latch        01077000
ISGYQUAALDDIAG1 DS F     Diag field when flag IsgyQuaaLdDataNotAvail   *01078000
                         is set                                         01079000
ISGYQUAALDDIAG2 DS 0F    Diag field when flag IsgyQuaaLdDataNotAvail   *01080000
                         is set                                         01081000
ISGYQUAALDNUMWAITERS DS F Total number of waiters for this latch       *01082000
                         (valid only for BLOCKER requests)              01083000
         DS    CL8       Unused                                         01084000
ISGYQUAALDCJOBNAME DS CL8 Jobname of the latch set creator              01085000
ISGYQUAALDLATCHSETTOKEN DS CL8 The latch set token                      01086000
ISGYQUAALDLATCHSETNAME DS CL48 The latch set name                       01087000
ISGYQUAALD_KMAXVERSION EQU 1                                            01088000
ISGYQUAALD_KVERSION1 EQU 1                                              01089000
ISGYQUAALDV1_KLEN EQU 144                                               01090000
ISGYQUAALDMAX_KLEN EQU 144                                              01091000
ISGYQUAALD_LEN EQU *-ISGYQUAALD                                         01092000
.L0021   ANOP                                                           01093000
         AIF   ('&ISGYQUAALRD' EQ 'NO').L0025                           01094000
         AIF   ('&DSECT' EQ 'YES').L0026                                01095000
         AIF   ('&ISGYQUAALRD' NE 'YES').L0025                          01096000
.L0026   ANOP                                                           01097000
*                                                                       01098000
*   ****************************************************************    01099000
*  *                                                                    01100000
*  * IsgyQuaa Latch Requester Data                                      01101000
*  *   (Only Relevent for REQINFO=LatchECA)                             01102000
*  *                                                                    01103000
*  *******************************************************************  01104000
*                                                                       01105000
*                                                                       01106000
         AIF   ('&DSECT' EQ 'YES').L0027                                01107000
ISGYQUAALRD DS 0D                                                       01108000
         AGO   .L0028                                                   01109000
.L0027   ANOP                                                           01110000
ISGYQUAALRD DSECT                                                       01111000
.L0028   ANOP                                                           01112000
ISGYQUAALRDV1 DS 0CL72                                                  01113000
ISGYQUAALRDVERSION DS H  IsgyQuaaLRD version                            01114000
ISGYQUAALRDFLAGS1 DS 0B  First Flags byte                               01115000
ISGYQUAALRDEXCLUSIVE EQU X'80' If ON, latch was requested exclusive.   *01116000
                         If OFF latch was requested shared.             01117000
ISGYQUAALRDTASKMODE EQU X'40' If ON, this latch requester was in Task  *01118000
                         mode at the time of the request. If OFF       *01119000
                         requestor was in SRB mode                      01120000
         ORG   ISGYQUAALRDFLAGS1+1                                      01121000
         DS    CL5       Reserved                                       01122000
ISGYQUAALRDNEXT DS 0AD   Address of next latch requester returned       01123000
         DS    CL4       First word of 64-bit field                     01124000
ISGYQUAALRDNEXT31 DS A   Value of IsgyQuaaLrdNext for AMODE 31 callers  01125000
ISGYQUAALRDPREV DS 0AD   Address of Prev latch requester returned       01126000
         DS    CL4       First word of 64-bit field                     01127000
ISGYQUAALRDPREV31 DS A   Value of IsgyQuaaLrdPrev for AMODE 31 callers  01128000
ISGYQUAALRDJOBNAME DS CL8 Jobname of this latch requester               01129000
ISGYQUAALRDASID DS H     ASID of this latch requester                   01130000
         DS    CL2       Reserved                                       01131000
ISGYQUAALRDWORKUNIT@ DS A If IsgyQuaaLrdTcbMode is ON, this is the     *01132000
                         address of the requesting TCB. Otherwise this *01133000
                         is the WEB address of the requesting SRB.      01134000
ISGYQUAALRDOWNTOD DS BL8 Timestamp of when this requester became an    *01135000
                         owner of this latch. This field will be       *01136000
                         binary zero if this requester is not an owner *01137000
                         of this latch. This value has not been        *01138000
                         adjusted for leap seconds                      01139000
ISGYQUAALRDWAITREQTOD DS BL8 This is the time that the request was     *01140000
                         made and is only set when there is            *01141000
                         contention. A value of zero indicates that    *01142000
                         there was no contention and thus              *01143000
                         IsgyQuaaLrdOwnTOD is also the request time.   *01144000
                         The value has not been adjusted for leap      *01145000
                         seconds.                                       01146000
ISGYQUAALRDRESUMEDTOD DS BL8 This is the time that the requester's     *01147000
                         unit of work was resumed. It is only set when *01148000
                         there is contention for an UNCOND request and *01149000
                         represents the time that the requester's unit *01150000
                         of work started executing with the latch      *01151000
                         held. The value has not been adjusted for     *01152000
                         leap seconds.                                  01153000
ISGYQUAALRDLATCHTOKEN DS CL8 The latch token                            01154000
ISGYQUAALRD_KMAXVERSION EQU 1                                           01155000
ISGYQUAALRD_KVERSION1 EQU 1                                             01156000
ISGYQUAALRDV1_KLEN EQU 72                                               01157000
ISGYQUAALRDMAX_KLEN EQU 72                                              01158000
ISGYQUAALRD_LEN EQU *-ISGYQUAALRD                                       01159000
.L0025   ANOP                                                           01160000
         AIF   ('&ISGYQUAAUS' EQ 'NO').L0029                            01161000
         AIF   ('&DSECT' EQ 'YES').L002A                                01162000
         AIF   ('&ISGYQUAAUS' NE 'YES').L0029                           01163000
.L002A   ANOP                                                           01164000
*                                                                       01165000
*   ****************************************************************    01166000
*  *                                                                    01167000
*  * IsgyQuaa Usage Statistics                                          01168000
*  *   (Only Relevent for REQINFO=UsageStats)                           01169000
*  *                                                                    01170000
*  *******************************************************************  01171000
*                                                                       01172000
*                                                                       01173000
         AIF   ('&DSECT' EQ 'YES').L002B                                01174000
ISGYQUAAUS DS  0D                                                       01175000
         AGO   .L002C                                                   01176000
.L002B   ANOP                                                           01177000
ISGYQUAAUS DSECT                                                        01178000
.L002C   ANOP                                                           01179000
ISGYQUAAUSV1 DS 0CL328                                                  01180000
ISGYQUAAUS_VERSION DS H  IsgyQuaaUs Version                             01181000
ISGYQUAAUS_ASID DS H     Valid if the IsgyQuaaUs is on the             *01182000
                         IsgyQuaaHdrUsFirstAsRecord Chain. This field  *01183000
                         indicates the Address space number for which  *01184000
                         the following data was collected. All of the  *01185000
                         statistics that follow represent requests     *01186000
                         that were made when this was the Home address *01187000
                         space                                          01188000
         DS    CL4                                                      01189000
ISGYQUAAUS_NEXT DS 0AD   Address of next US record returned             01190000
         DS    CL4       First word of 64-bit field                     01191000
ISGYQUAAUS_NEXT31 DS A   Value of ISGYQUAAUsNext for AMODE 31 callers   01192000
ISGYQUAAUS_STOKEN DS CL8 Valid if the is on the                        *01193000
                         IsgyQuaaHdrUsFirstAsRecord Chain. This field  *01194000
                         indicates the STOKEN for which the following  *01195000
                         data was collected.                            01196000
ISGYQUAAUS_LATCHCREATORCONTSTATS DS 0CL32 Statistics for Latch         *01197000
                         requests against Latch sets created by this   *01198000
                         address space                                  01199000
ISGYQUAAUS_LC_CONTCOUNT DS FL8 Number of contention generating         *01200000
                         requests                                       01201000
ISGYQUAAUS_LC_CONTTIME DS FL8 Total time of contention                  01202000
ISGYQUAAUS_LC_CONTTIMESQ DS CL16 Sum of the squares of the individual  *01203000
                         contention times                               01204000
ISGYQUAAUS_LATCHREQUESTERCONTSTATS DS 0CL32 Statistics for Latch       *01205000
                         requests that occurred in this address space   01206000
ISGYQUAAUS_LR_CONTCOUNT DS FL8 Number of contention generating         *01207000
                         requests                                       01208000
ISGYQUAAUS_LR_CONTTIME DS FL8 Total time of contention                  01209000
ISGYQUAAUS_LR_CONTTIMESQ DS CL16 Sum of the squares of the individual  *01210000
                         contention times                               01211000
ISGYQUAAUS_ENQSTEPSTATS DS 0CL48 Statistics for requests that          *01212000
                         generated STEP scope ENQs from this address   *01213000
                         space                                          01214000
ISGYQUAAUS_ESTEPTOTALCOUNT DS FL8 Total number of requests that        *01215000
                         resulted in GRS queuing an element            *01216000
                         (contention and non-contention cases)          01217000
ISGYQUAAUS_ESTEPCONTCOUNT DS FL8 Total number of contention generating *01218000
                         requests that resulted in GRS queuing a       *01219000
                         waiting element                                01220000
ISGYQUAAUS_ESTEPCONTTIME DS FL8 Total time of contention                01221000
         DS    CL8                                                      01222000
ISGYQUAAUS_ESTEPCONTTIMESQ DS CL16 Sum of the squares of the           *01223000
                         individual contention times                    01224000
ISGYQUAAUS_ENQSYSTEMSTATS DS 0CL48 Statistics for requests that        *01225000
                         generated SYSTEM scope ENQs from this address *01226000
                         space                                          01227000
ISGYQUAAUS_ESYSTEMTOTALCOUNT DS FL8 Total number of requests that      *01228000
                         resulted in GRS queuing an element            *01229000
                         (contention and non-contention cases)          01230000
ISGYQUAAUS_ESYSTEMCONTCOUNT DS FL8 Total number of contention          *01231000
                         generating requests that resulted in GRS      *01232000
                         queuing a waiting element                      01233000
ISGYQUAAUS_ESYSTEMCONTTIME DS FL8 Total time of contention              01234000
         DS    CL8                                                      01235000
ISGYQUAAUS_ESYSTEMCONTTIMESQ DS CL16 Sum of the squares of the         *01236000
                         individual contention times                    01237000
ISGYQUAAUS_ENQSYSTEMSSTATS DS 0CL48 Statistics for requests that       *01238000
                         generated SYSTEMS scope ENQs from this        *01239000
                         address space                                  01240000
ISGYQUAAUS_ESYSTEMSTOTALCOUNT DS FL8 Total number of requests that     *01241000
                         resulted in GRS queuing an element            *01242000
                         (contention and non-contention cases)          01243000
ISGYQUAAUS_ESYSTEMSCONTCOUNT DS FL8 Total number of contention         *01244000
                         generating requests that resulted in GRS      *01245000
                         queuing a waiting element                      01246000
ISGYQUAAUS_ESYSTEMSCONTTIME DS FL8 Total time of contention             01247000
         DS    CL8                                                      01248000
ISGYQUAAUS_ESYSTEMSCONTTIMESQ DS CL16 Sum of the squares of the        *01249000
                         individual contention times                    01250000
ISGYQUAAUS_QSCANSTATS DS 0CL64 Statistics for Qscan requests (GQSCAN   *01251000
                         and ISGQUERY REQINFO=QSCAN) issued from this  *01252000
                         address space                                  01253000
ISGYQUAAUS_QTOTALCOUNT DS FL8 Count of requests including (START and   *01254000
                         RESUME, but not QUITs                          01255000
ISGYQUAAUS_QSPECCOUNT DS FL8 Count of requests that are specific. This *01256000
                         includes requests with a specific QNAME and   *01257000
                         RNAME or ISGQUERY specifying a search by      *01258000
                         EnqToken                                       01259000
ISGYQUAAUS_QRESCOUNTSQ DS CL16 Sum of the squares of number of         *01260000
                         resources returned.                            01261000
ISGYQUAAUS_QRESCOUNT DS FL8 Sum of all resources returned by QScans.    01262000
ISGYQUAAUS_QTIME DS FL8  Sum of request times (in TOD- format) for     *01263000
                         QScan requests                                 01264000
ISGYQUAAUS_QTIMESQ DS CL16 Sum of the squares of request times for     *01265000
                         QScan requests                                 01266000
         DS    CL32      Reserved for future use                        01267000
ISGYQUAAUSV1_KLEN EQU 328                                               01268000
ISGYQUAAUS_KMAXVERSION EQU 1                                            01269000
ISGYQUAAUS_KVERSION1 EQU 1                                              01270000
ISGYQUAAUS_LEN EQU *-ISGYQUAAUS                                         01271000
.L0029   ANOP                                                           01272000
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 01273000
         AIF   ('&LIST' EQ 'YES').P4                                    01274000
.P3      ANOP                                                           01275000
         POP   PRINT                                                    01276000
.P4      ANOP                                                           01277000
.P_EXIT  ANOP                                                           01278000
         MEND                                                           01279000
**/ ISGYQUAC_2:;                                                        01280000
* %ISGYQUAC_INCLUDED = 'YES';                                           01281000
* %DCL ZCBPRINT CHAR EXT;                                               01282000
* %DEACTIVATE ZCBPRINT;                                                 01283000
* %DCL ISGYQUAC_LIST CHAR EXT;                                          01284000
* %DEACTIVATE ISGYQUAC_LIST;                                            01285000
* %IF ISGYQUAC_LIST ^= 'NO' &                                           01286000
*    ZCBPRINT ^= 'NO' %THEN                                             01287000
*   %GOTO ISGYQUAC_3;                                                   01288000
*   @LIST PUSH NOECHO;                                                  01289000
*   @LIST NOASSEMBLE NOECHO;                                            01290000
*   @LIST OFF C NOECHO;                                                 01291000
* %ISGYQUAC_3:;                                                         01292000
*/* Start of PL/X Source                                             */ 01293000
* @LOGIC;                                                               01294000
* /* The following PRAGMA statements provide control info to the CBGEN  01295000
* tool. They must be in the logic/endlogic pair.  Various fields are    01296000
* DELETEd from ASM.                                                  */ 01297000
* #PRAGMA TOOL=CBGEN.                                                   01298000
* #DELETE.IsgyQuaaHdrV2Dependency                                       01299000
* #DELETE.IsgyQuaaHdrV2Blocker                                          01300000
* #DELETE.IsgyQuaaHdrV2WaiterBlocker                                    01301000
* #EPRAGMA.                                                             01302000
* @ENDLOGIC;                                                            01303000
*                                                                       01304000
*  /*****************************************************************   01305000
*   *                                                                   01306000
*   * ISGYQUAA General Constants                                        01307000
*   *                                                                   01308000
*   *****************************************************************/  01309000
* DCL                                                                   01310000
*   ISGYQUAA_kSTEP        Fixed(8) Constant(1)                          01311000
*  ,ISGYQUAA_kSYSTEM      Fixed(8) Constant(2)                          01312000
*  ,ISGYQUAA_kSYSTEMS     Fixed(8) Constant(ISGYQUAA_kSYSPLEX)          01313000
*  ,ISGYQUAA_kSYSPLEX     Fixed(8) Constant(3)                          01314000
*  ;                                                                    01315000
*                                                                       01316000
* DCL                                                                   01317000
*   ISGYQUAA_kQScanMinSummaryAnsLen Fixed(32)                           01318000
*     Constant(ISGYQUAAHdrV1_kLen                                       01319000
*             +ISGYQUAARsV1_kLen                                        01320000
*             +ISGYQUAARqV1_kLen                                        01321000
*             +256);                /* The minimum answer area size     01322000
*                                      required when REQINFO=QSCAN,     01323000
*                                      ANSDETAIL=SUMMARY             */ 01324000
* DCL                                                                   01325000
*   ISGYQUAA_kQScanMinFullAnsLen Fixed(32)                              01326000
*     Constant(ISGYQUAAHdrV1_kLen                                       01327000
*             +ISGYQUAARsV1_kLen                                        01328000
*             +ISGYQUAARqV1_kLen+ISGYQUAARqxV1_kLen                     01329000
*             +(2*256));            /* The minimum answer area size     01330000
*                                      required when REQINFO=QSCAN,     01331000
*                                      ANSDETAIL=FULL                */ 01332000
* DCL                                                                   01333000
*   ISGYQUAA_kQScanMinFull2AnsLen Fixed(32)                             01334000
*     Constant(ISGYQUAAHdrV1_kLen                                       01335000
*             +ISGYQUAARsV1_kLen+ISGYQUAARsxV1_kLen                     01336000
*             +ISGYQUAARqV1_kLen+ISGYQUAARqxV2_kLen                     01337000
*             +(2*256));            /* The minimum answer area size     01338000
*                                      required when REQINFO=QSCAN,     01339000
*                                      ANSDETAIL=FULL2               */ 01340000
* DCL                                                                   01341000
*   ISGYQUAA_kQScanMinFull3AnsLen Fixed(32)                             01342000
*     Constant(ISGYQUAAHdrV1_kLen                                       01343000
*             +ISGYQUAARsV1_kLen+ISGYQUAARsxV1_kLen                     01344000
*             +ISGYQUAARqV1_kLen+ISGYQUAARqxV2_kLen                     01345000
*             +(2*256)                                                  01346000
*             +ISGYQUAAUserData_kInitialLen                             01347000
*             );                    /* The minimum answer area size     01348000
*                                      required when REQINFO=QSCAN,     01349000
*                                      ANSDETAIL=FULL3               */ 01350000
*                                                                       01351000
* DCL                                                                   01352000
*   ISGYQUAA_kLatchEcaMinAnsLen Fixed(32)                               01353000
*     Constant(IsgyQuaaHdrV2_kLen                                       01354000
*             +ISGYQUAALdV1_kLen                                        01355000
*             +2*ISGYQUAALrdV1_kLen                                     01356000
*             +IsgyQuaa_kLidEntryLength                                 01357000
*             +IsgyQuaa_kLidPrintableStringMaxLen                       01358000
*             );                    /* The minimum answer area size     01359000
*                                      required when REQINFO=LATCHECA*/ 01360000
*                                                                       01361000
* DCL                                                                   01362000
*   ISGYQUAA_kUsageStatsMinAnsLen Fixed(32)                             01363000
*     Constant(IsgyQuaaHdrUsV1_kLen+                                    01364000
*             +ISGYQuaaUsV1_kLen*2                                      01365000
*             );                    /* The minimum answer area size     01366000
*                                      required when REQINFO=USAGESTATS 01367000
*                                                                @L1A*/ 01368000
* DCL ISGYQUAA_kLidEntryLength constant(28) /* The size of a LidEntry*/ 01369000
*    ,ISGYQUAA_kLidPrintableStringMaxLen constant(256) /* Maximum size  01370000
*                                      returned for ISGYLID printable   01371000
*                                      string                        */ 01372000
*    ;                                                                  01373000
*  /*****************************************************************   01374000
*   *                                                                   01375000
*   * ISGYQUAA Header Section                                           01376000
*   *                                                                   01377000
*   *****************************************************************/  01378000
*                                                                       01379000
* DCL                                                                   01380000
*   1 ISGYQUAAHdr bdy(dword) type   /* Header Section                */ 01381000
*   ,2 ISGYQUAAHdrV1 char(IsgyQuaaHdrV1_kLen) bdy(dword)                01382000
*    ,3 ISGYQUAAHdrID       Char(8) /* ISGYQUAA eyecatcher           */ 01383000
*    ,3 ISGYQUAAHdrVersion Fixed(16) /* Header version               */ 01384000
*    ,3 ISGYQUAAHdrReqInfo Fixed(16) /* The REQINFO of the request   */ 01385000
*    ,3 ISGYQUAAHdrNumRecords Fixed(32) /* Number of ISGYQUAARs or      01386000
*                                      ISGYQUAASys records returned  */ 01387000
*    ,3 ISGYQUAAHdrFirstRecord  Ptr(64) /* Addr of first data record */ 01388000
*      ,5 *                 Char(4) /* First word of 64-bit field    */ 01389000
*      ,5 ISGYQUAAHdrFirstRecord31 Ptr(31) /* Value of                  01390000
*                                      ISGYQUAAHDRFirstRecord           01391000
*                                      for AMODE 31 callers          */ 01392000
*    ,3 ISGYQUAAHdrTotalLen Fixed(64) /* Total Answer Area length       01393000
*                                      of the header and all the data   01394000
*                                      records returned              */ 01395000
*      ,5 *                 Char(4) /* First word of 64-bit field    */ 01396000
*      ,5 ISGYQUAAHdrTotalLen31 Fixed(31) /* Value of                   01397000
*                                      ISGYQUAAHDRTotalLen              01398000
*                                      for AMODE 31 callers          */ 01399000
*    ,3 *                   Char(8) /* Reserved                      */ 01400000
*   ,2 ISGYQUAAHdrV2 char(IsgyQuaaHdrV2_kPartialLen) bdy(dword)         01401000
*    ,3 ISGYQUAAHdrV2LastRecord  Ptr(64) /* Addr of last data record */ 01402000
*      ,5 *                 Char(4) /* First word of 64-bit field    */ 01403000
*      ,5 ISGYQUAAHdrV2LastRecord31 Ptr(31) /* Value of                 01404000
*                                    ISGYQUAAHDRV2LastRecord            01405000
*                                    for AMODE 31 callers            */ 01406000
*    ,3 IsgyQuaaHdrV2StartTime char(16) /* STCKE taken when this data   01407000
*                                    collection started              */ 01408000
*    ,3 IsgyQuaaHdrV2EndTime char(16) /* STCKE taken when this data     01409000
*                                    collection finished             */ 01410000
*    ,3 IsgyQuaaHdrV2Flags1 bit(8) /* First Flags byte               */ 01411000
*      ,5 IsgyQuaaHdrV2Dependency bit(1) /* Indicates if this           01412000
*                                    represents a dependency request */ 01413000
*      ,5 IsgyQuaaHdrV2Waiter bit(1) /* Indicates if this represents a  01414000
*                                    waiter request                  */ 01415000
*      ,5 IsgyQuaaHdrV2Blocker bit(1) /* Indicates if this represents   01416000
*                                    a blocker request               */ 01417000
*      ,5 IsgyQuaaHdrV2WaiterBlocker bit(1) /* Indicates if this        01418000
*                                    represents a waiterblocker         01419000
*                                    request                     @L3A*/ 01420000
*    ,3 * char(7)                 /* Reserved                        */ 01421000
*   ;                                                                   01422000
*                                                                       01423000
*  /* ISGYQUAAHDR Constants                                          */ 01424000
* DCL                                                                   01425000
*   ISGYQUAAHdr_kID           Char(8)   Constant('ISGYQUAA')            01426000
*  ,ISGYQUAAHdr_kMaxVersion fixed(16) constant(ISGYQUAAHdr_kVersion2)   01427000
*  ,ISGYQUAAHdr_kHBB7780    fixed(16) constant(ISGYQUAAHdr_kVersion2)   01428000
*  ,ISGYQUAAHdr_kHBB7709    fixed(16) constant(ISGYQUAAHdr_kVersion1)   01429000
*  ,ISGYQUAAHdr_kVersion1     Fixed(16) Constant(1)                     01430000
*  ,ISGYQUAAHdr_kVersion2     Fixed(16) Constant(2)                     01431000
*  ,ISGYQUAAHdr_kREQINFO_QSCAN Fixed(16) Constant(1)                    01432000
*  ,ISGYQUAAHdr_kREQINFO_ENQSTATS Fixed(16) Constant(2)                 01433000
*  ,ISGYQUAAHdr_kREQINFO_LatchEca Fixed(16) Constant(3)                 01434000
*  ,IsgyQuaaHdrV1_kLen fixed(32) constant(40)                           01435000
*  ,IsgyQuaaHdrV2_kPartialLen fixed(32) constant(48)                    01436000
*  ,IsgyQuaaHdrV2_kLen fixed(32)                                        01437000
*     constant(IsgyQuaaHdrV1_kLen+IsgyQuaaHdrV2_kPartialLen)            01438000
*  ,IsgyQuaaHdrMax_kLen fixed(32) constant(length(IsgyQuaaHdr))         01439000
*  ;                                                                    01440000
*                                                                       01441000
* DCL                                                                   01442000
*   1 ISGYQUAAHdrUs type            /* Usage Statistics Header   @L1A*/ 01443000
*   ,2 ISGYQUAAHdrUsV1 char(IsgyQuaaHdrUsV1_kLen) bdy(dword)            01444000
*    ,3 ISGYQUAAHdrUsId     Char(8) /* ISGYQUAA eyecatcher       @L1A*/ 01445000
*    ,3 ISGYQUAAHdrUsVersion Fixed(16) /* Header version         @L1A*/ 01446000
*    ,3 ISGYQUAAHdrUsReqInfo Fixed(16) /* The REQINFO of the request    01447000
*                                                                @L1A*/ 01448000
*    ,3 ISGYQUAAHdrUsNumAsRecords Fixed(32) /* Number of ISGYQUAAUs     01449000
*                                      records returned for active      01450000
*                                      address spaces            @L1A*/ 01451000
*    ,3 ISGYQUAAHdrUsFirstAsRecord  Ptr(64) /* Addr of first address    01452000
*                                      space data record         @L1A*/ 01453000
*      ,5 *                 Char(4) /* First word of 64-bit field@L1A*/ 01454000
*      ,5 ISGYQUAAHdrUsFirstAsRecord31 Ptr(31) /* Value of              01455000
*                                      ISGYQUAAHDRUsFirstAsRecord       01456000
*                                      for AMODE 31 callers      @L1A*/ 01457000
*    ,3 ISGYQUAAHdrUsTotalLen Fixed(64) /* Total Answer Area length     01458000
*                                      of the header and all the data   01459000
*                                      records returned          @L1A*/ 01460000
*      ,5 *                 Char(4) /* First word of 64-bit field@L1A*/ 01461000
*      ,5 ISGYQUAAHdrUsTotalLen31 Fixed(31) /* Value of                 01462000
*                                      ISGYQUAAHDRTotalLen              01463000
*                                      for AMODE 31 callers      @L1A*/ 01464000
*    ,3 ISGYQUAAHdrUsTerminatedSpacesRecord Ptr(64) /* Addr of the      01465000
*                                      Terminated Spaces Record  @L1A*/ 01466000
*      ,5 *                 Char(4) /* First word of 64-bit field@L1A*/ 01467000
*      ,5 ISGYQUAAHdrUsTerminatedSpacesRecord31 Ptr(31) /* Value of     01468000
*                                  ISGYQUAAHDRUsTerminatedSpacesRecord  01469000
*                                      for AMODE 31 callers      @L1A*/ 01470000
*    ,3 * char(24)                /* Reserved for future use     @L2C*/ 01471000
*    ,3 IsgyQuaaHdrUsStartTime char(16) /* STCKE taken when this data   01472000
*                                    collection started          @L1A*/ 01473000
*    ,3 IsgyQuaaHdrUsEndTime char(16) /* STCKE taken when this data     01474000
*                                    collection finished         @L1A*/ 01475000
*    ,3 *        Char(0) Bdy(DWORD) /* Reserved                  @L1A*/ 01476000
*   ;                                                         /* @L1A*/ 01477000
*  /* ISGYQUAAHDRUS Constants                                    @L1A*/ 01478000
* DCL                                                                   01479000
*   ISGYQUAAHdrUs_kID char(8) constant('ISGYQUAA')            /* @L1A*/ 01480000
*  ,ISGYQUAAHdrUs_kMaxVersion                                           01481000
*       fixed(16) constant(ISGYQUAAHdrUs_kVersion1)           /* @L1A*/ 01482000
*  ,ISGYQUAAHdrUs_kHBB7780                                              01483000
*       fixed(16) constant(ISGYQUAAHdrUs_kVersion1)           /* @L1A*/ 01484000
*  ,ISGYQUAAHdrUs_kVersion1 fixed(16) constant(1)             /* @L1A*/ 01485000
*  ,ISGYQUAAHdrUs_kREQINFO_USAGESTATS fixed(16) constant(4)   /* @L1A*/ 01486000
*  ,IsgyQuaaHdrUsV1_kLen fixed(32) constant(96)               /* @L1A*/ 01487000
*  ,IsgyQuaaHdrUsMax_kLen                                               01488000
*       fixed(32) constant(length(IsgyQuaaHdrUs))             /* @L1A*/ 01489000
*  ;                                                                    01490000
*  /*****************************************************************   01491000
*   *                                                                   01492000
*   * ISGYQUAA Resource Data Record                                     01493000
*   *                                                                   01494000
*   *****************************************************************/  01495000
*                                                                       01496000
* DCL                                                                   01497000
*   1 ISGYQUAARs bdy(dword) type    /* Resource Data Record          */ 01498000
*   ,2 ISGYQUAARsV1 char(ISGYQUAARsV1_kLen) bdy(dword)                  01499000
*    ,3 ISGYQUAARsVersion Fixed(16) /* ISGYQUAARs version            */ 01500000
*    ,3 ISGYQUAARsFlags1 Bit(8)     /* First Flags byte              */ 01501000
*      ,5 ISGYQUAARsRQsOmitted Bit(1) /* Indicates if RQs were left     01502000
*                                      out because of insufficient      01503000
*                                      Answer Area Space             */ 01504000
*      ,5 ISGYQUAARsRsxValid Bit(1) /* Indicates that the               01505000
*                                      ISGYQUAARsRsx field is           01506000
*                                      valid                         */ 01507000
*    ,3 *                   Char(5) /* Reserved                      */ 01508000
*    ,3 ISGYQUAARsNext      Ptr(64) /* Address of next RS record        01509000
*                                      returned                      */ 01510000
*      ,5 *                 Char(4) /* First word of 64-bit field    */ 01511000
*      ,5 ISGYQUAARsNext31  Ptr(31) /* Value of ISGYQUAARsNext          01512000
*                                      for AMODE 31 callers          */ 01513000
*    ,3 ISGYQUAARsFirstRq   Ptr(64) /* Addr of first QReq address    */ 01514000
*      ,5 *                 Char(4) /* First word of 64-bit field    */ 01515000
*      ,5 ISGYQUAARsFirstRq31 Ptr(31) /* Value of                       01516000
*                                      ISGYQUAARsFirstRq                01517000
*                                      for AMODE 31 callers          */ 01518000
*    ,3 ISGYQUAARsRName     Ptr(64) /* Address of final Rname for       01519000
*                                      the resource                  */ 01520000
*      ,5 *                 Char(4) /* First word of 64-bit field    */ 01521000
*      ,5 ISGYQUAARsRName31 Ptr(31) /* Value of ISGYQUAARsRName         01522000
*                                      for AMODE 31 callers          */ 01523000
*    ,3 ISGYQUAARsQName     Char(8) /* Final QName of the resource      01524000
*                                                                    */ 01525000
*    ,3 ISGYQUAARsNumRq   Fixed(32) /* Number of Requester records      01526000
*                                      returned for this Resource    */ 01527000
*    ,3 ISGYQUAARsTotalRq Fixed(32) /* Total number of matching         01528000
*                                      requesters associated with this  01529000
*                                      resource. Check                  01530000
*                                      ISGYQUAARsRQsOmitted to see if   01531000
*                                      some RQs were not included       01532000
*                                      because of insufficient          01533000
*                                      answer area space. If this       01534000
*                                      number differs from              01535000
*                                      ISGYQUAARsNumRq and              01536000
*                                      ISGYQUAARsRQsOmitted is off      01537000
*                                      then not all matching requester  01538000
*                                      information was returned for     01539000
*                                      this resource because the        01540000
*                                      number exceeded the Requester    01541000
*                                      Limit.                           01542000
*                                      To obtain a count of all         01543000
*                                      requesters for this resource     01544000
*                                      (matching and not), add          01545000
*                                      ISGYQUAARsNumOwners,             01546000
*                                      ISGYQUAARsNumEWaiters,           01547000
*                                      ISGYQUAARsNumSWaiters,           01548000
*                                      ISGYQUAARsNumEUsers, and         01549000
*                                      ISGYQUAARsNumSUsers.             01550000
*                                      Note: If SERIALIZEBY=ENQ_ONLY    01551000
*                                      or SERIALIZEBY_RESERVE was       01552000
*                                      specified on the query,          01553000
*                                      then the counts only reflect     01554000
*                                      requests that match the          01555000
*                                      SERIALIZEBY filter.           */ 01556000
*    ,3 ISGYQUAARsNumOwners Fixed(32) /* Number of matching requesters  01557000
*                                      that own this resource.          01558000
*                                      This number does not include     01559000
*                                      owners that have control of the  01560000
*                                      resource by a MASID request.     01561000
*                                      Note: If SERIALIZEBY=ENQ_ONLY    01562000
*                                      or SERIALIZEBY_RESERVE was       01563000
*                                      specified on the query,          01564000
*                                      then the counts only reflect     01565000
*                                      requests that match the          01566000
*                                      SERIALIZEBY filter.           */ 01567000
*    ,3 ISGYQUAARsNumEWaiters Fixed(32) /* Number of requesters         01568000
*                                      waiting for exclusive control    01569000
*                                      of this resource                 01570000
*                                      Note: If SERIALIZEBY=ENQ_ONLY    01571000
*                                      or SERIALIZEBY_RESERVE was       01572000
*                                      specified on the query,          01573000
*                                      then the counts only reflect     01574000
*                                      requests that match the          01575000
*                                      SERIALIZEBY filter.           */ 01576000
*    ,3 ISGYQUAARsNumSWaiters Fixed(32) /* Number of requesters         01577000
*                                      waiting for shared control       01578000
*                                      of this resource.                01579000
*                                      Note: If SERIALIZEBY=ENQ_ONLY    01580000
*                                      or SERIALIZEBY_RESERVE was       01581000
*                                      specified on the query,          01582000
*                                      then the counts only reflect     01583000
*                                      requests that match the          01584000
*                                      SERIALIZEBY filter.           */ 01585000
*    ,3 ISGYQUAARsNumEUsers Fixed(32) /* Number of MASID requests       01586000
*                                      that have exclusive control of   01587000
*                                      this resource.                   01588000
*                                      Note: If SERIALIZEBY=ENQ_ONLY    01589000
*                                      or SERIALIZEBY_RESERVE was       01590000
*                                      specified on the query,          01591000
*                                      then the counts only reflect     01592000
*                                      requests that match the          01593000
*                                      SERIALIZEBY filter.           */ 01594000
*    ,3 ISGYQUAARsNumSUsers Fixed(32) /* Number of MASID requests       01595000
*                                      that have shared control of      01596000
*                                      this resource.                   01597000
*                                      Note: If SERIALIZEBY=ENQ_ONLY    01598000
*                                      or SERIALIZEBY_RESERVE was       01599000
*                                      specified on the query,          01600000
*                                      then the counts only reflect     01601000
*                                      requests that match the          01602000
*                                      SERIALIZEBY filter.           */ 01603000
*    ,3 ISGYQUAARsRNameLen Fixed(16) /* Length of resource RName     */ 01604000
*    ,3 ISGYQUAARsScope    Fixed(8) /* Final scope of resource. One of  01605000
*                                      either ISGYQUAA_kSTEP,           01606000
*                                      ISGYQUAA_kSYSTEM, or             01607000
*                                      ISGYQUAA_kSYSPLEX             */ 01608000
*    ,3 *                   Char(1) /* Reserved                      */ 01609000
*    ,3 ISGYQUAARsRsx       Ptr(64) /* Address of resource record       01610000
*                                      extension. Valid only if         01611000
*                                      ISGYQUAARsRsxValid is set.    */ 01612000
*      ,5 *                 Char(4) /* First word of 64-bit field    */ 01613000
*      ,5 ISGYQUAARsRsx31   Ptr(31) /* Value of ISGYQUAARsRsx           01614000
*                                      for AMODE 31 callers          */ 01615000
*   ;                                                                   01616000
*                                                                       01617000
*  /* ISGYQUAARS Constants                                           */ 01618000
* DCL                                                                   01619000
*   ISGYQUAARs_kMaxVersion Fixed(16) Constant(ISGYQUAARs_kVersion2)     01620000
*  ,ISGYQUAARs_kHBB7709    Fixed(16) Constant(ISGYQUAARs_kVersion1)     01621000
*  ,ISGYQUAARs_kHBB7740    Fixed(16) Constant(ISGYQUAARs_kVersion2)     01622000
*  ,ISGYQUAARs_kVersion1   Fixed(16) Constant(1)                        01623000
*  ,ISGYQUAARs_kVersion2   Fixed(16) Constant(2)                        01624000
*  ,IsgyQuaaRsV1_kLen fixed(32) constant(80)                            01625000
*  ,IsgyQuaaRsMax_kLen fixed(32) constant(length(ISGYQUAARs))           01626000
*  ;                                                                    01627000
*                                                                       01628000
*  /******************************************************************  01629000
*   *                                                                   01630000
*   * ISGYQUAA Resource Data Record Extension                           01631000
*   *   (Only returned when ANSDETAIL=FULL2 or higher)                  01632000
*   *                                                                   01633000
*   ******************************************************************/ 01634000
*                                                                       01635000
* DCL                                                                   01636000
*   1 ISGYQUAARsx bdy(dword) type   /* Resource extension            */ 01637000
*   ,2 ISGYQUAARsxV1 char(ISGYQUAARsxV1_kLen) bdy(dword)                01638000
*    ,3 ISGYQUAARsxVersion Fixed(16) /* ISGYQUAARsx version          */ 01639000
*    ,3 ISGYQUAARsxFlags1    Bit(8) /* Flags byte                    */ 01640000
*      ,5 ISGYQUAARsxRscTokenValid Bit(1) /* Indicates that the         01641000
*                                      ISGYQUAARsxRscToken is valid.    01642000
*                                      Currently, for Star mode globals 01643000
*                                      the token is only valid for      01644000
*                                      resources for which the local    01645000
*                                      system has interest. Ring mode   01646000
*                                      globals and all locals will      01647000
*                                      always have a valid token     */ 01648000
*    ,3                   * Char(1) /* Reserved                      */ 01649000
*    ,3 ISGYQUAARsxRscToken Char(32) /* This token can be used to       01650000
*                                      identify an instance of the      01651000
*                                      resource identified by           01652000
*                                      ISGYQUAARs. The token represents 01653000
*                                      the local systems view of the    01654000
*                                      resource and expires when no     01655000
*                                      requests for the resource        01656000
*                                      remain. Additionally, in Star    01657000
*                                      mode the token expires when      01658000
*                                      the local system no longer has   01659000
*                                      interest in (i.e. requests for)  01660000
*                                      the resource.                    01661000
*                                      Only valid if                    01662000
*                                      ISGYQUAARsxRscTokenValid is on.  01663000
*                                                                    */ 01664000
*    ,3                  * Char(12) /* Reserved                      */ 01665000
*   ;                                                                   01666000
*                                                                       01667000
*  /* ISGYQUAARsx Constants                                          */ 01668000
* DCL                                                                   01669000
*   ISGYQUAARsx_kMaxVersion Fixed(16) Constant(ISGYQUAARs_kVersion1)    01670000
*  ,ISGYQUAARsx_kHBB7740    Fixed(16) Constant(ISGYQUAARs_kVersion1)    01671000
*  ,ISGYQUAARsx_kVersion1   Fixed(16) Constant(1)                       01672000
*  ,ISGYQUAARsxV1_kLen fixed(32) constant(48)                           01673000
*  ,ISGYQUAARsxMax_kLen fixed(32) constant(length(ISGYQUAARsx))         01674000
*  ;                                                                    01675000
*                                                                       01676000
*  /*****************************************************************   01677000
*   *                                                                   01678000
*   * ISGYQUAA Requester Data Record                                    01679000
*   *                                                                   01680000
*   *****************************************************************/  01681000
*                                                                       01682000
* DCL                                                                   01683000
*   1 ISGYQUAARq bdy(dword) type    /* Requester Data Record         */ 01684000
*   ,2 ISGYQUAARqV1 char(ISGYQUAARqV1_kLen) bdy(dword)                  01685000
*    ,3 ISGYQUAARqVersion Fixed(16) /* ISGYQUAARQ version            */ 01686000
*    ,3 ISGYQUAARqFlags1     Bit(8) /* First flags byte              */ 01687000
*      ,5 ISGYQUAARqControl     Bit(1) /* Type of serialization for     01688000
*                                      request, where 0 = exclusive     01689000
*                                      control and 1 = shared control   01690000
*                                                                    */ 01691000
*      ,5 ISGYQUAARqReserve  Bit(1) /* Request specified (or was        01692000
*                                      changed by a dynamic exit) to    01693000
*                                      obtain a device reserve.         01694000
*                                      The device is known to be        01695000
*                                      reserved when                    01696000
*                                      ISGYQUAARqReserveConverted is    01697000
*                                      off and ISGYQUAARqSynchRes and   01698000
*                                      ISGYQUAARqPosted are on and one  01699000
*                                      of the following two conditions  01700000
*                                      are true. 1) The request         01701000
*                                      originated from the local system 01702000
*                                      2) Global Resource Serialization 01703000
*                                      is operating in Star mode.       01704000
*                                      The device will be setup to      01705000
*                                      be reserved on the first I/O     01706000
*                                      (which may have completed)       01707000
*                                      if ISGYQUAARqReserveConverted    01708000
*                                      is off, ISGYQUAARqSynchRes is    01709000
*                                      off, and ISGYQUAARqPosted is on. 01710000
*                                                                    */ 01711000
*      ,5 ISGYQUAARqReserveConverted Bit(1) /* Request specified to     01712000
*                                      obtain a device reserve, but     01713000
*                                      request was converted to a       01714000
*                                      global (SYSTEMS) ENQ          */ 01715000
*      ,5 ISGYQUAARqSynchRes Bit(1) /* Request specified to obtain      01716000
*                                      a device reserve, the device     01717000
*                                      was already reserved by the      01718000
*                                      same system image or it was      01719000
*                                      committed to being done          01720000
*                                      synchronously (SYNCHRES).        01721000
*                                      Only valid if                    01722000
*                                      ISGYQUAARqMisc64Valid is set. */ 01723000
*      ,5 ISGYQUAARqOwner    Bit(1) /* Requester is an owner of the     01724000
*                                      resource. If the requester is    01725000
*                                      not an owner, and also not a     01726000
*                                      Matching task user (See          01727000
*                                      ISGYQUAARqMATU) then the         01728000
*                                      requester is a waiter. Note      01729000
*                                      that if a non-converted reserve  01730000
*                                      (ISGYQUAARqReserve is on         01731000
*                                      and ISGYQUAARqReserveConverted   01732000
*                                      is off) then see                 01733000
*                                      ISGYQUAARqSynchRes to determine  01734000
*                                      the state of the reserve         01735000
*                                      processing.                   */ 01736000
*      ,5 ISGYQUAARqMATU    Bit(1)  /* Matching task use indicator.     01737000
*                                      Requester is using the           01738000
*                                      resource as the result of a      01739000
*                                      MASID/MTCB request            */ 01740000
*      ,5 ISGYQUAARqPosted Bit(1)   /* The requester has been informed  01741000
*                                      that the request has completed.  01742000
*                                      The ECB has been posted or       01743000
*                                      the requester's suspended TCB    01744000
*                                      RB has been posted. Note that    01745000
*                                      in Ring mode, when the request   01746000
*                                      originated on another system     01747000
*                                      and ISGYQUAARqSynchRes is on,    01748000
*                                      the requester may be waiting for 01749000
*                                      synchronous reserve processing   01750000
*                                      to complete.                  */ 01751000
*      ,5 ISGYQUAARqMisc64Valid Bit(1) /* In some cases not all the     01752000
*                                      information is available from    01753000
*                                      remote systems. This bit         01754000
*                                      indicates that the following     01755000
*                                      fields are valid:                01756000
*                                      ISGYQUAARQEnqToken and           01757000
*                                      ISGYQUAARQSynchRes.              01758000
*                                      Also, when this bit and the      01759000
*                                      ISGYQUAARqRqxValid bit is on,    01760000
*                                      the following fields are valid:  01761000
*                                      ISGYQUAARqxAltSerExtended,       01762000
*                                      ISGYQUAARqxNQXITChanged,         01763000
*                                      ISGYQUAARqxBatchChanged,         01764000
*                                      ISGYQUAARqxEnqTime,              01765000
*                                      ISGYQUAARqxRNLChanged,           01766000
*                                      ISGYQUAARqxOrigQNameValid,       01767000
*                                      ISGYQUAARqxOrigRNameValid,       01768000
*                                      ISGYQUAARqxOrigScopeValid,       01769000
*                                      ISGYQUAARqxOrigUCB@Valid,        01770000
*                                      ISGYQUAARqxSToken,               01771000
*                                      ISGYQUAARqxTToken,               01772000
*                                      ISGYQUAARqxUserDataValid, and    01773000
*                                      ISGYQUAARqxUserDataOmitted    */ 01774000
*    ,3 ISGYQUAARqFlags2     Bit(8) /* Second flags byte             */ 01775000
*      ,5 ISGYQUAARqRQXValid Bit(1) /* Indicates that the               01776000
*                                      ISGYQUAARqRQX field is valid  */ 01777000
*    ,3 ISGYQUAARqTcb       Ptr(31) /* TCB address of requester      */ 01778000
*    ,3 ISGYQUAARqNext      Ptr(64) /* Address of next requester record 01779000
*                                      returned                      */ 01780000
*      ,5 *                 Char(4) /* First word of 64-bit field    */ 01781000
*      ,5 ISGYQUAARqNext31  Ptr(31) /* Value of ISGYQUAARqNext          01782000
*                                      for AMODE 31 callers          */ 01783000
*    ,3 ISGYQUAARqRQX       Ptr(64) /* Address of requester record      01784000
*                                      extension. Valid only if         01785000
*                                      ISGYQUAARqRQXValid is set.    */ 01786000
*      ,5 *                 Char(4) /* First word of 64-bit field    */ 01787000
*      ,5 ISGYQUAARqRQX31   Ptr(31) /* Value of ISGYQUAARqRQX           01788000
*                                      for AMODE 31 callers          */ 01789000
*    ,3 ISGYQUAARqENQToken Char(32) /* ENQToken that represents this    01790000
*                                      request. Only valid              01791000
*                                      if ISGYQUAARqMisc64Valid         01792000
*                                      is set.                       */ 01793000
*    ,3 *                   Char(8) /* Reserved                      */ 01794000
*                                                                       01795000
*                                                                       01796000
*   ;                                                                   01797000
*                                                                       01798000
*  /* ISGYQUAARQ Constants                                          */  01799000
* DCL                                                                   01800000
*   ISGYQUAARq_kMaxVersion Fixed(16) Constant(ISGYQUAARq_kVersion1)     01801000
*  ,ISGYQUAARq_kHBB7709    Fixed(16) Constant(ISGYQUAARq_kVersion1)     01802000
*  ,ISGYQUAARq_kVersion1   Fixed(16) Constant(1)                        01803000
*  ,ISGYQUAARqV1_kLen fixed(32) constant(64)                            01804000
*  ,ISGYQUAARqMax_kLen fixed(32) constant(length(ISGYQUAARq))           01805000
*   ;                                                                   01806000
*                                                                       01807000
*  /******************************************************************  01808000
*   *                                                                   01809000
*   * ISGYQUAA Requester Data Record Extension                          01810000
*   *   (Only returned when ANSDETAIL=FULL or higher)                   01811000
*   *                                                                   01812000
*   ******************************************************************/ 01813000
*                                                                       01814000
* DCL                                                                   01815000
*   1 ISGYQUAARqx bdy(dword) type   /* Rqx of ANSDETAIL=FULL         */ 01816000
*   ,2 ISGYQUAARqxV1 char(ISGYQUAARqxV1_kLen) bdy(dword)                01817000
*    ,3 ISGYQUAARqxVersion Fixed(16) /* ISGYQUAARQX version          */ 01818000
*    ,3 ISGYQUAARqxFlags1    Bit(8) /* Flags byte                    */ 01819000
*      ,5 ISGYQUAARqxNQXITChanged Bit(1) /* Indicates that the request  01820000
*                                      was modified by an ENQ exit.     01821000
*                                      ISGNQXIT or ISGNQXITFAST         01822000
*                                      Only valid if                    01823000
*                                      ISGYQUAARqMisc64Valid is set. */ 01824000
*      ,5 ISGYQUAARqxBatchChanged Bit(1) /* Indicates that the request  01825000
*                                      was modified by a batch exit.    01826000
*                                      ISGNQXITBATCH,                   01827000
*                                      ISGNQXITPREBATCH, or             01828000
*                                      ISGNQXITBATCHCND.                01829000
*                                      Only valid if                    01830000
*                                      ISGYQUAARqMisc64Valid is set. */ 01831000
*      ,5 ISGYQUAARqxRNLChanged Bit(1) /* Indicates that the scope was  01832000
*                                      modified by the RNLs             01833000
*                                      Only valid if                    01834000
*                                      ISGYQUAARqMisc64Valid is set. */ 01835000
*      ,5 ISGYQUAARqxOrigQNameValid Bit(1) /* Indicates that the        01836000
*                                      ISGYQUAARqxOrigQName field is    01837000
*                                      valid. If off then the original  01838000
*                                      QName is the same as the final.  01839000
*                                      This bit is only valid if        01840000
*                                      ISGYQUAARqMisc64Valid is set. */ 01841000
*      ,5 ISGYQUAARqxOrigRNameValid Bit(1) /* Indicates that the        01842000
*                                      ISGYQUAARqxOrigRName field is    01843000
*                                      valid. If off then the original  01844000
*                                      RName is the same as the final.  01845000
*                                      This bit is only valid if        01846000
*                                      ISGYQUAARqMisc64Valid is set. */ 01847000
*      ,5 ISGYQUAARqxOrigUCB@Valid Bit(1) /* Indicates that the         01848000
*                                      ISGYQUAARqxOrigUCB field is      01849000
*                                      valid. If off then the original  01850000
*                                      UCB@ is the same as the final.   01851000
*                                      This bit is only valid if        01852000
*                                      ISGYQUAARqMisc64Valid is set. */ 01853000
*      ,5 ISGYQUAARqxOrigScopeValid Bit(1) /* Indicates that the        01854000
*                                      ISGYQUAARqxOrigScope field is    01855000
*                                      valid. If off then the original  01856000
*                                      scope is the same as the final.  01857000
*                                      This bit is only valid if        01858000
*                                      ISGYQUAARqMisc64Valid is set. */ 01859000
*      ,5 ISGYQUAARqxServiceAsidValid Bit(1) /* ISGYQUAARqxServiceAsid  01860000
*                                      field is valid                */ 01861000
*    ,3 ISGYQUAARqxFlags2    Bit(8) /* Second flags byte             */ 01862000
*      ,5 ISGYQUAARqxMustComplete Bit(1) /* Request set must complete   01863000
*                                                                    */ 01864000
*      ,5 ISGYQUAARqxAuthorized Bit(1) /* Requester was authorized   */ 01865000
*      ,5 ISGYQUAARqxAltSerExtended Bit(1) /* This request is being     01866000
*                                      managed by an alternate          01867000
*                                      serialization product at the     01868000
*                                      global level. This bit is only   01869000
*                                      valid if ISGYQUAARqMisc64Valid   01870000
*                                      is set.                       */ 01871000
*      ,5 ISGYQUAARqxMatchingTask Bit(1) /* This is a matching task     01872000
*                                      (MTCB/MASID) request.            01873000
*                                      ISGYQUAARqxMTcb and              01874000
*                                      ISGYQUAARqxMAsid contain the     01875000
*                                      TCB and ASID of the matching     01876000
*                                      task                          */ 01877000
*      ,5 ISGYQUAARqxECBRequest Bit(1) /* ECB was specified on ENQ      01878000
*                                      request                       */ 01879000
*      ,5 ISGYQUAARqxUserdataValid Bit(1) /* Userdata was specified on  01880000
*                                      the ISGENQ request and           01881000
*                                      ANSDETAIL=FULL3 was specified on 01882000
*                                      this ISGQUERY request.           01883000
*                                      This bit is only valid if        01884000
*                                      ISGYQUAARqMisc64Valid is set.    01885000
*                                      If Userdata was expected for     01886000
*                                      this requester, and              01887000
*                                      ISGYQUAARqMisc64Valid is set,    01888000
*                                      but this bit is off, one of the  01889000
*                                      following conditions is true:    01890000
*                                      1)GRS is operating in STAR mode, 01891000
*                                      this resource is global, and the 01892000
*                                      ISGQUERY request specified       01893000
*                                      GATHERFROM=SYSPLEX. If the       01894000
*                                      resource request originated on   01895000
*                                      the current system, issue        01896000
*                                      another ISGQUERY specifying      01897000
*                                      GATHERFROM=SYSTEM to obtain the  01898000
*                                      Userdata.                        01899000
*                                      2) The                           01900000
*                                      ISGYQUAARqxUserdataOmitted bit   01901000
*                                      is set. See the declaration for  01902000
*                                      details.                      */ 01903000
*      ,5 ISGYQUAARqxUserdataOmitted Bit(1) /* Userdata was specified   01904000
*                                      on the ISGENQ request and        01905000
*                                      ANSDETAIL=FULL3 was specified on 01906000
*                                      this ISGQUERY request, however,  01907000
*                                      there was not enough room in the 01908000
*                                      answer area to return the        01909000
*                                      userdata. Allocate a larger      01910000
*                                      answer area space. Use the       01911000
*                                      following formula to determine   01912000
*                                      the amount of storage needed:    01913000
*                                      (ISGYQUAA_kQScanMinFull3AnsLen + 01914000
*                                      ISGYQUAARqxUserdataLen -         01915000
*                                      ISGYQUAAUserDataInitialLen)   */ 01916000
*    ,3 *                   Char(2) /* Reserved                      */ 01917000
*    ,3 ISGYQUAARqxRequesterData                                        01918000
*      ,5 ISGYQUAARqxAsid   Fixed(16) /* ASID of ENQ requester       */ 01919000
*      ,5 ISGYQUAARqxSToken   Char(8) /* SToken of requester. Only      01920000
*                                      valid if ISGYQUAARqMisc64Valid   01921000
*                                      is set.                       */ 01922000
*      ,5 ISGYQUAARqxTToken   Char(16) /* TToken of requester. Only     01923000
*                                      valid if ISGYQUAARqMisc64Valid   01924000
*                                      is set.                       */ 01925000
*      ,5 ISGYQUAARqxJobName  Char(8) /* Job name of requester       */ 01926000
*      ,5 ISGYQUAARqxSysName  Char(8) /* System name of requester    */ 01927000
*    ,3 ISGYQUAARqxMTcb     Ptr(31) /* Matching task TCB (MTCB)         01928000
*                                      specified by requester.          01929000
*                                      Valid only if                    01930000
*                                      ISGYQUAARqxMatchingTask is set*/ 01931000
*    ,3 ISGYQUAARqxMAsid  Fixed(16) /* Matching task ASID (MASID)       01932000
*                                      specified by requester.          01933000
*                                      Valid only if                    01934000
*                                      ISGYQUAARqxMatchingTask is set*/ 01935000
*    ,3 ISGYQUAARqxServiceAsid Fixed(16) /* ASID of the task for which  01936000
*                                      a service PROVIDER performed     01937000
*                                      this ENQ request.                01938000
*                                      If ISGYQUAARqxServiceAsidValid   01939000
*                                      is set then ISGYQUAARqxAsid      01940000
*                                      is the ASID of the               01941000
*                                      service PROVIDER and             01942000
*                                      ISGYQUAARqServiceAsid            01943000
*                                      is the ASID of the service       01944000
*                                      REQUESTER.                       01945000
*                                      If ISGYQUAARqxServiceAsid is     01946000
*                                      zero, the service REQUESTER's    01947000
*                                      ASID is not available         */ 01948000
*    ,3 ISGYQUAARqxEcb      Ptr(31) /* ECB address if                   01949000
*                                      ISGYQUAARqxECBRequest is set  */ 01950000
*      ,5 ISGYQUAARqxSvrb   Ptr(31) /* SVRB address if                  01951000
*                                      ISGYQUAARqxECBRequest is zero */ 01952000
*    ,3 ISGYQUAARqxUcb      Ptr(31) /* Final UCB address if request     01953000
*                                      was for a device reserve on      01954000
*                                      this system for a three-digit    01955000
*                                      device-number device.            01956000
*                                      Otherwise, arithmetic zero.      01957000
*                                      Note that if                     01958000
*                                      ISGYQUAARqReserveConverted is    01959000
*                                      set the device was not reserved  01960000
*                                                                    */ 01961000
*    ,3 ISGYQUAARqxDeviceNum Char(4) /* If the request was for a device 01962000
*                                      reserve from the current system  01963000
*                                      then this field contains the     01964000
*                                      EBCDIC device number of the      01965000
*                                      the target of the reserve,       01966000
*                                      Otherwise it is arithmetic zero  01967000
*                                                                    */ 01968000
*    ,3 ISGYQUAARqx4ChUcb   Ptr(31) /* Same as ISGYQUAARqxUcb excect    01969000
*                                      it includes four character       01970000
*                                      device number devices     @L4C*/ 01971000
*    ,3 ISGYQUAARqxOrigQName Char(8) /* Original QName specified on     01972000
*                                      request. Only valid              01973000
*                                      if ISGYQUAARqxOrigQNameValid     01974000
*                                      and ISGYQUAARqMisc64Valid        01975000
*                                      are set.                      */ 01976000
*    ,3 ISGYQUAARqxOrigRName Ptr(64) /* Address of original RName       01977000
*                                      specified on request. Only valid 01978000
*                                      if ISGYQUAARqxOrigRNameValid     01979000
*                                      and ISGYQUAARqMisc64Valid        01980000
*                                      are set.                      */ 01981000
*      ,5 *                 Char(4) /* First word of 64-bit field    */ 01982000
*      ,5 ISGYQUAARqxOrigRName31 Ptr(31) /* Value of                    01983000
*                                      ISGYQUAARqxOrigRName             01984000
*                                      for AMODE 31 callers          */ 01985000
*    ,3 ISGYQUAARqxOrigUCB@ Ptr(31) /* Original UCB@ specified on       01986000
*                                      request if the UCB address was   01987000
*                                      changed by a dynamic exit.       01988000
*                                      Note that a reserve conversion   01989000
*                                      does not change the UCB@, but    01990000
*                                      causes the device reserve        01991000
*                                      request to be ignored.           01992000
*                                      Only valid if                    01993000
*                                      if ISGYQUAARqxOrigUCB@Valid      01994000
*                                      and ISGYQUAARqMisc64Valid        01995000
*                                      are set.                      */ 01996000
*    ,3 ISGYQUAARqxOrigRNameLen Fixed(8) /* Length of original RName    01997000
*                                      specified on request. Only valid 01998000
*                                      if ISGYQUAARqxOrigRNameValid     01999000
*                                      and ISGYQUAARqMisc64Valid        02000000
*                                      are set.                      */ 02001000
*    ,3 ISGYQUAARqxOrigScope Fixed(8) /* Original scope specified on    02002000
*                                      request. One of either           02003000
*                                      ISGYQUAA_kSTEP,                  02004000
*                                      ISGYQUAA_kSYSTEM, or             02005000
*                                      ISGYQUAA_kSYSPLEX.               02006000
*                                      Only valid if                    02007000
*                                      if ISGYQUAARqxOrigScopeValid     02008000
*                                      and ISGYQUAARqMisc64Valid        02009000
*                                      are set.                      */ 02010000
*    ,3 ISGYQUAARqxUserdataLen fixed(16) /* Length of Userdata          02011000
*                                      specified on request. Only valid 02012000
*                                      if ISGYQUAARqxUserdataValid and  02013000
*                                      ISGYQUAARqMisc64Valid are set.   02014000
*                                                                    */ 02015000
*    ,3 ISGYQUAARqxUserData Ptr(64) /* Address of userdata specified    02016000
*                                      on request. Only valid           02017000
*                                      if ISGYQUAARqxUserdataValid      02018000
*                                      and ISGYQUAARqMisc64Valid        02019000
*                                      are set.                         02020000
*                                      Note: The length,                02021000
*                                      ISGYQUAARqxUserdataLen, should   02022000
*                                      always be used when accessing    02023000
*                                      the userdata, as its length may  02024000
*                                      change in the future          */ 02025000
*      ,5 *                 Char(4) /* First word of 64-bit field    */ 02026000
*      ,5 ISGYQUAARqxUserData31 Ptr(31) /* Value of                     02027000
*                                      ISGYQUAARqxUserData              02028000
*                                      for AMODE 31 callers          */ 02029000
*   ,2 ISGYQUAARqxV2 char(ISGYQUAARqxV2_kPartialLen) bdy(word)          02030000
*    ,3 ISGYQUAARqxV2ENQTime Char(16) /* This is the time, in extended  02031000
*                                      TOD format, of when the ENQ      02032000
*                                      request was originally made.     02033000
*                                      Only valid if                    02034000
*                                      ISGYQUAARqMisc64Valid is set.    02035000
*                                                                    */ 02036000
*    ,3 *                   Char(16) /* Reserved                     */ 02037000
*   ;                                                                   02038000
*                                                                       02039000
*  /* ISGYQUAARQX Constants                                         */  02040000
* DCL                                                                   02041000
*   ISGYQUAARqx_kMaxVersion Fixed(16) Constant(ISGYQUAARqx_kVersion2)   02042000
*  ,ISGYQUAARqx_kHBB7709    Fixed(16) Constant(ISGYQUAARqx_kVersion1)   02043000
*  ,ISGYQUAARqx_kHBB7740    Fixed(16) Constant(ISGYQUAARqx_kVersion2)   02044000
*  ,ISGYQUAARqx_kVersion1   Fixed(16) Constant(1)                       02045000
*  ,ISGYQUAARqx_kVersion2   Fixed(16) Constant(2)                       02046000
*  ,ISGYQUAARqxV1_kLen fixed(32) constant(104)                          02047000
*  ,ISGYQUAARqxV2_kPartialLen fixed(32) constant(32)                    02048000
*  ,ISGYQUAARqxV2_kLen fixed(32)                                        02049000
*    constant(ISGYQUAARqxV1_kLen+ISGYQUAARqxV2_kPartialLen)             02050000
*  ,ISGYQUAARqxMax_kLen fixed(32) constant(length(ISGYQUAARqx))         02051000
*   ;                                                                   02052000
*                                                                       02053000
*  /*****************************************************************   02054000
*   *                                                                   02055000
*   * ISGYQUAA System Data                                              02056000
*   *   (Only relevant for REQINFO=ENQSTATS)                            02057000
*   *                                                                   02058000
*   *****************************************************************/  02059000
*                                                                       02060000
* DCL                                                                   02061000
*   1 ISGYQUAASys bdy(dword) type   /* The REQINFO=ENQSTATS system      02062000
*                                      data                          */ 02063000
*   ,2 ISGYQUAASysV1 char(ISGYQUAASysV1_kLen) bdy(dword)                02064000
*    ,3 ISGYQUAASysVersion fixed(16)/* ISGYQUAASys version           */ 02065000
*    ,3 ISGYQUAASysFlags1 bit(8)    /* First Flags byte              */ 02066000
*      ,5 ISGYQUAASysAuthorized bit(1) /* Indicates whether this block  02067000
*                                      refers to the authorized or      02068000
*                                      unauthorized counts           */ 02069000
*    ,3 * char(5)                   /* Reserved                      */ 02070000
*    ,3 ISGYQUAASysNext ptr(64)     /* Address of next system record    02071000
*                                      returned                      */ 02072000
*      ,5 * char(4)                 /* First word of 64-bit field    */ 02073000
*      ,5 ISGYQUAASysNext31 ptr(31) /* Value of ISGYQUAASysNext         02074000
*                                      for AMODE 31 callers          */ 02075000
*    ,3 ISGYQUAASysSp ptr(64)       /* Address of address-space         02076000
*                                      specific data (the               02077000
*                                      ISGYQUAASysAuthorized flag       02078000
*                                      applies to it as well)        */ 02079000
*      ,5 * char(4)                 /* 1st word of 64-bit field      */ 02080000
*      ,5 ISGYQUAASysSp31 ptr(31)   /* Value of ISGYQUAASysSp           02081000
*                                      for AMODE 31 callers          */ 02082000
*    ,3 ISGYQUAASysPeakENQData char(8) bdy(dword)                       02083000
*      ,5 ISGYQUAASysPeakENQCount fixed(31) /* Peak ENQ count of        02084000
*                                      requesters for any address       02085000
*                                      space for the life of the        02086000
*                                      system                        */ 02087000
*      ,5 ISGYQUAASysPeakENQASID fixed(16) /* ASID associated with      02088000
*                                      with the overall peak for ENQ    02089000
*                                      requests.  Note that ASIDs are   02090000
*                                      reusable and the address space   02091000
*                                      may not still be active.      */ 02092000
*      ,5 * char(2)                 /* unused                        */ 02093000
*    ,3 ISGYQUAASysENQMax fixed(31) /* System-wide maximum limit of     02094000
*                                      ENQs from any one address space  02095000
*                                                                    */ 02096000
*    ,3 * char(4)                   /* unused                        */ 02097000
*   ;                                                                   02098000
*                                                                       02099000
*  /* ISGYQUAASys Constants                                          */ 02100000
* dcl                                                                   02101000
*   ISGYQUAASys_kMaxVersion fixed(16) constant(ISGYQUAASys_kVersion1)   02102000
*  ,ISGYQUAASys_kHBB7730 fixed(16) constant(ISGYQUAASys_kVersion1)      02103000
*  ,ISGYQUAASys_kVersion1 fixed(16) constant(1)                         02104000
*  ,ISGYQUAASysV1_kLen fixed(32) constant(40)                           02105000
*  ,ISGYQUAASysMax_kLen fixed(32) constant(length(ISGYQUAASys))         02106000
*  ;                                                                    02107000
*                                                                       02108000
*  /*****************************************************************   02109000
*   *                                                                   02110000
*   * ISGYQUAA Address Space Data                                       02111000
*   *   (Only relevant for REQINFO=ENQSTATS)                            02112000
*   *                                                                   02113000
*   *****************************************************************/  02114000
*                                                                       02115000
* DCL                                                                   02116000
*   1 ISGYQUAASp bdy(dword) type    /* REQINFO=ENQSTATS address         02117000
*                                      space specific data           */ 02118000
*   ,2 ISGYQUAASpV1 char(ISGYQUAASpV1_kLen) bdy(dword)                  02119000
*    ,3 ISGYQUAASpVersion Fixed(16) /* ISGYQUAASp version            */ 02120000
*    ,3 * char(2)                   /* Reserved                      */ 02121000
*    ,3 ISGYQUAASpCurrENQCount fixed(31) /* Current ENQ count for       02122000
*                                      the specified address space   */ 02123000
*    ,3 ISGYQUAASpPeakENQCount fixed(31) /* Peak ENQ count of           02124000
*                                      requesters for the life of the   02125000
*                                      specified address space.      */ 02126000
*    ,3 ISGYQUAASpENQMax fixed(31)  /* If non-zero, the address-        02127000
*                                      space specific maximum number    02128000
*                                      of ENQs, set via ISGADMIN.       02129000
*                                      If zero, none exists and the     02130000
*                                      system maximum is used.       */ 02131000
*   ;                                                                   02132000
*                                                                       02133000
*  /* ISGYQUAASp Constants                                           */ 02134000
* dcl                                                                   02135000
*   ISGYQUAASp_kMaxVersion fixed(16) constant(ISGYQUAASp_kVersion1)     02136000
*  ,ISGYQUAASp_kHBB7730    fixed(16) constant(ISGYQUAASp_kVersion1)     02137000
*  ,ISGYQUAASp_kVersion1   fixed(16) constant(1)                        02138000
*  ,ISGYQUAASpV1_kLen fixed(32) constant(16)                            02139000
*  ,ISGYQUAASpMax_kLen fixed(32) constant(length(ISGYQUAASp))           02140000
*   ;                                                                   02141000
*                                                                       02142000
* DCL                                                                   02143000
*   ISGYQUAAUserData char(*) type;  /* UserData returned with           02144000
*                                      ISGQUERY REQINFO=QSCAN and       02145000
*                                      ANSDETAIL=FULL3               */ 02146000
*                                                                       02147000
* DCL                                                                   02148000
*   ISGYQUAAUserData_kInitialLen fixed(16) constant(32); /* The initial 02149000
*                                      length of ISGYQUAAUserdata    */ 02150000
*  /*****************************************************************   02151000
*  *                                                                    02152000
*  * IsgyQuaa Latch Data                                                02153000
*  *   (Only Relevent for REQINFO=LatchECA)                             02154000
*  *                                                                    02155000
*  *******************************************************************/ 02156000
*                                                                       02157000
*DCL                                                                    02158000
*  1 IsgyQuaaLd bdy(dword) type    /* Latch Data                     */ 02159000
*  ,2 IsgyQuaaLdV1 char(IsgyQuaaLdV1_kLen) bdy(dword)                   02160000
*   ,3 IsgyQuaaLdVersion fixed(16) /* IsgyQuaaLD version             */ 02161000
*   ,3 IsgyQuaaLdFlags1 bit(8)     /* First Flags byte               */ 02162000
*     ,5 IsgyQuaaLdLatchIdValid bit(1) /* Indicates if there is a LID   02163000
*                                     for this latch                 */ 02164000
*     ,5 IsgyQuaaLdDataNotAvail bit(1) /* Indicates that there was a    02165000
*                                     problem obtaining information     02166000
*                                     on the requesters of this         02167000
*                                     latch. When set no waiter or      02168000
*                                     blocker LRDs are returned and     02169000
*                                     IsgyQuaaLDDiag1 and               02170000
*                                     IsgyQuaaLDDiag2                   02171000
*                                     hold diagnostic information. If   02172000
*                                     the data for this latch is vital, 02173000
*                                     re-issue the ISGQUERY Request  */ 02174000
*   ,3 * char(5)                   /* Reserved                       */ 02175000
*   ,3 IsgyQuaaLdNext ptr(64)      /* Address of next latch record      02176000
*                                     returned                       */ 02177000
*     ,5 * char(4)                 /* First word of 64-bit field     */ 02178000
*     ,5 IsgyQuaaLdNext31 ptr(31)  /* Value of IsgyQuaaLdNext           02179000
*                                     for AMODE 31 callers           */ 02180000
*   ,3 IsgyQuaaLdPrev ptr(64)      /* Address of Prev latch record      02181000
*                                     returned                       */ 02182000
*     ,5 * char(4)                 /* First word of 64-bit field     */ 02183000
*     ,5 IsgyQuaaLdPrev31 ptr(31)  /* Value of IsgyQuaaLdPrev           02184000
*                                     for AMODE 31 callers           */ 02185000
*   ,3 IsgyQuaaLdWaiterLrd ptr(64) /* Address of first latch requester  02186000
*                                     data for a waiter              */ 02187000
*     ,5 * char(4)                 /* 1st word of 64-bit field       */ 02188000
*     ,5 IsgyQuaaLdWaiterLrd31 ptr(31) /* Value of IsgyQuaaLdWaiterLrd  02189000
*                                     for AMODE 31 callers           */ 02190000
*   ,3 IsgyQuaaLdBlockerLrd ptr(64) /* Address of first latch requester 02191000
*                                     data for a blocker             */ 02192000
*     ,5 * char(4)                 /* 1st word of 64-bit field       */ 02193000
*     ,5 IsgyQuaaLdBlockerLrd31 ptr(31) /* Value of                     02194000
*                                     IsgyQuaaLdBlockerLrd              02195000
*                                     for AMODE 31 callers           */ 02196000
*   ,3 IsgyQuaaLdLatchNum fixed(32) /* The latch number              */ 02197000
*   ,3 IsgyQuaaLdLatchIDLen fixed(16) /* The length of the latch        02198000
*                                     Identity entry for this latch.    02199000
*                                     Only valid if                     02200000
*                                     IsgyQuaaLdLatchIDValid is ON      02201000
*                                                                    */ 02202000
*   ,3 IsgyQuaaLdLatchIDVersion fixed(8) /* The version of the latch    02203000
*                                     Identity entry for this latch.    02204000
*                                     Only valid if                     02205000
*                                     IsgyQuaaLdLatchIDValid is ON      02206000
*                                                                    */ 02207000
*   ,3 * char(1)                   /* Reserved                       */ 02208000
*   ,3 IsgyQuaaLdLatchID ptr(64)   /* The address of the latch Identity 02209000
*                                     entry for this latch. Only valid  02210000
*                                     if IsgyQuaaLdLatchIdValid is      02211000
*                                     ON. See ISGYLID_Entry defined     02212000
*                                     in the language specific latch    02213000
*                                     macro for more details on the     02214000
*                                     control block pointed to by this  02215000
*                                     field                          */ 02216000
*     ,5 * char(4)                 /* 1st word of 64-bit field       */ 02217000
*     ,5 IsgyQuaaLdLatchID31 ptr(31) /* Value of IsgyQuaaLdLatchID      02218000
*                                     for AMODE 31 callers           */ 02219000
*   ,3 IsgyQuaaLdCAsid fixed(16)   /* ASID of the latch set creator     02220000
*                                                                    */ 02221000
*   ,3 IsgyQuaaLdReturnedLidPsLen fixed(16) /* Length of the Latch ID   02222000
*                                     printable string that is          02223000
*                                     returned. Normally this will be   02224000
*                                     the same as                       02225000
*                                     LidPrintableStringLength, unless  02226000
*                                     it has been truncated to          02227000
*                                    IsgyQuaa_kLidPrintableStringMaxLen 02228000
*                                                                    */ 02229000
*   ,3 * char(4)                   /* Unused                     @L6C*/ 02230000
*   ,3 IsgyQuaaLdNumBlockers fixed(32) /* Total number of owners of     02231000
*                                     this latch                     */ 02232000
*     ,5 IsgyQuaaLdDiag1 fixed(32) /* Diag field when flag              02233000
*                                     IsgyQuaaLdDataNotAvail is set  */ 02234000
*   ,3 IsgyQuaaLdDiag2 fixed(32)   /* Diag field when flag              02235000
*                                     IsgyQuaaLdDataNotAvail is set  */ 02236000
*     ,5 IsgyQuaaLdNumWaiters fixed(32) /* Total number of waiters for  02237000
*                                     this latch (valid only for        02238000
*                                     BLOCKER requests)              */ 02239000
*   ,3 * char(8)                   /* Unused                         */ 02240000
*   ,3 IsgyQuaaLdCJobName char(8)  /* Jobname of the latch set creator  02241000
*                                                                    */ 02242000
*   ,3 IsgyQuaaLdLatchSetToken char(8) /* The latch set token        */ 02243000
*   ,3 IsgyQuaaLdLatchSetName char(48) /* The latch set name         */ 02244000
*   ;                                                                   02245000
*dcl IsgyQuaaLd_kMaxVersion fixed(16) constant(IsgyQuaaLd_kVersion1);   02246000
*dcl IsgyQuaaLd_kVersion1 fixed(16) constant(1);                        02247000
*dcl IsgyQuaaLdV1_kLen fixed(32) constant(144);                         02248000
*dcl IsgyQuaaLdMax_kLen fixed(32) constant(length(IsgyQuaaLd));         02249000
* /*****************************************************************    02250000
*  *                                                                    02251000
*  * IsgyQuaa Latch Requester Data                                      02252000
*  *   (Only Relevent for REQINFO=LatchECA)                             02253000
*  *                                                                    02254000
*  *******************************************************************/ 02255000
*                                                                       02256000
*DCL                                                                    02257000
*  1 IsgyQuaaLrd bdy(dword) type                                        02258000
*  ,2 IsgyQuaaLrdV1 char(IsgyQuaaLrdV1_kLen) bdy(dword)                 02259000
*   ,3 IsgyQuaaLrdVersion fixed(16) /* IsgyQuaaLRD version           */ 02260000
*   ,3 IsgyQuaaLrdFlags1 bit(8)    /* First Flags byte               */ 02261000
*     ,5 IsgyQuaaLrdExclusive bit(1) /* If ON, latch was requested      02262000
*                                     exclusive. If OFF latch was       02263000
*                                     requested shared.              */ 02264000
*     ,5 IsgyQuaaLrdTaskMode bit(1) /* If ON, this latch requester was  02265000
*                                     in Task mode at the time of the   02266000
*                                     request. If OFF requestor was in  02267000
*                                     SRB mode                       */ 02268000
*   ,3 * char(5)                   /* Reserved                       */ 02269000
*   ,3 IsgyQuaaLrdNext ptr(64)     /* Address of next latch requester   02270000
*                                     returned                       */ 02271000
*     ,5 * char(4)                 /* First word of 64-bit field     */ 02272000
*     ,5 IsgyQuaaLrdNext31 ptr(31) /* Value of IsgyQuaaLrdNext          02273000
*                                     for AMODE 31 callers           */ 02274000
*   ,3 IsgyQuaaLrdPrev ptr(64)     /* Address of Prev latch requester   02275000
*                                     returned                       */ 02276000
*     ,5 * char(4)                 /* First word of 64-bit field     */ 02277000
*     ,5 IsgyQuaaLrdPrev31 ptr(31) /* Value of IsgyQuaaLrdPrev          02278000
*                                     for AMODE 31 callers           */ 02279000
*                                                                       02280000
*                                                                       02281000
*   ,3 IsgyQuaaLrdJobname char(8)  /* Jobname of this latch requester   02282000
*                                                                    */ 02283000
*   ,3 IsgyQuaaLrdAsid fixed(16)   /* ASID of this latch requester      02284000
*                                                                    */ 02285000
*   ,3 * char(2)                   /* Reserved                       */ 02286000
*   ,3 IsgyQuaaLrdWorkUnit@ ptr(31) /* If IsgyQuaaLrdTcbMode is ON,     02287000
*                                     this is the address of the        02288000
*                                     requesting TCB. Otherwise this    02289000
*                                     is the WEB address of the         02290000
*                                     requesting SRB.                */ 02291000
*   ,3 IsgyQuaaLrdOwnTOD bit(64)   /* Timestamp of when this requester  02292000
*                                     became an owner of this latch.    02293000
*                                     This field will be binary zero    02294000
*                                     if this requester is not an owner 02295000
*                                     of this latch. This value has not 02296000
*                                     been adjusted for leap seconds */ 02297000
*   ,3 IsgyQuaaLrdWaitReqTOD bit(64) /* This is the time that the       02298000
*                                     request was made and is only      02299000
*                                     set when there is contention.     02300000
*                                     A value of zero indicates that    02301000
*                                     there was no contention and thus  02302000
*                                     IsgyQuaaLrdOwnTOD is also the     02303000
*                                     request time.                     02304000
*                                     The value has not been adjusted   02305000
*                                     for leap seconds.              */ 02306000
*   ,3 IsgyQuaaLrdResumedTOD bit(64) /* This is the time that the       02307000
*                                     requester's unit of work was      02308000
*                                     resumed. It is only set when      02309000
*                                     there is contention for an        02310000
*                                     UNCOND request and represents     02311000
*                                     the time that the requester's     02312000
*                                     unit of work started executing    02313000
*                                     with the latch held.              02314000
*                                     The value has not been adjusted   02315000
*                                     for leap seconds.              */ 02316000
*   ,3 IsgyQuaaLrdLatchToken char(8) bdy(word)/* The latch token     */ 02317000
*   ;                                                                   02318000
*dcl IsgyQuaaLrd_kMaxVersion fixed(16) constant(IsgyQuaaLrd_kVersion1); 02319000
*dcl IsgyQuaaLrd_kVersion1 fixed(16) constant(1);                       02320000
*dcl IsgyQuaaLrdV1_kLen fixed(32) constant(72);                         02321000
*dcl IsgyQuaaLrdMax_kLen fixed(32) constant(length(IsgyQuaaLrd));       02322000
*                                                                       02323000
* /*****************************************************************    02324000
*  *                                                                    02325000
*  * IsgyQuaa Usage Statistics                                          02326000
*  *   (Only Relevent for REQINFO=UsageStats)                           02327000
*  *                                                                    02328000
*  *******************************************************************/ 02329000
*                                                                       02330000
*DCL                                                                    02331000
*  1 IsgyQuaaUs bdy(dword) type                               /* @L1A*/ 02332000
*  ,2 IsgyQuaaUsV1 char(IsgyQuaaUsV1_kLen) bdy(dword)         /* @L1A*/ 02333000
*   ,3 IsgyQuaaUs_Version fixed(16)/* IsgyQuaaUs Version         @L1A*/ 02334000
*   ,3 IsgyQuaaUs_Asid fixed(16)   /* Valid if the                      02335000
*                                     IsgyQuaaUs is on the              02336000
*                                     IsgyQuaaHdrUsFirstAsRecord Chain. 02337000
*                                     This field indicates              02338000
*                                     the Address space number for      02339000
*                                     which the following data          02340000
*                                     was collected. All of the         02341000
*                                     statistics that follow represent  02342000
*                                     requests that were made when this 02343000
*                                     was the Home address space @L1A*/ 02344000
*   ,3 * char(4)                                                        02345000
*   ,3 ISGYQUAAUs_Next      Ptr(64) /* Address of next US record        02346000
*                                      returned                  @L1A*/ 02347000
*     ,5 *                  Char(4) /* First word of 64-bit field@L1A*/ 02348000
*     ,5 ISGYQUAAUs_Next31  Ptr(31) /* Value of ISGYQUAAUsNext          02349000
*                                      for AMODE 31 callers      @L1A*/ 02350000
*   ,3 IsgyQuaaUs_Stoken char(8)   /* Valid if the                      02351000
*                                     is on the                         02352000
*                                     IsgyQuaaHdrUsFirstAsRecord Chain. 02353000
*                                     This field indicates              02354000
*                                     the STOKEN for which the          02355000
*                                     following data was collected.     02356000
*                                                                @L1A*/ 02357000
*   ,3 IsgyQuaaUs_LatchCreatorContStats /* Statistics for Latch         02358000
*                                     requests against Latch sets       02359000
*                                     created by this address space     02360000
*                                                                @L1A*/ 02361000
*     ,5 IsgyQuaaUs_LC_ContCount fixed(64) /* Number of contention      02362000
*                                     generating requests        @L1A*/ 02363000
*     ,5 IsgyQuaaUs_LC_ContTime fixed(64) /* Total time of contention   02364000
*                                                                @L1A*/ 02365000
*     ,5 IsgyQuaaUs_LC_ContTimeSq char(16) /* Sum of the squares of     02366000
*                                     the individual contention times   02367000
*                                                                @L1A*/ 02368000
*   ,3 IsgyQuaaUs_LatchRequesterContStats /* Statistics for Latch       02369000
*                                     requests that occurred in this    02370000
*                                     address space              @L1A*/ 02371000
*     ,5 IsgyQuaaUs_LR_ContCount fixed(64) /* Number of contention      02372000
*                                     generating requests        @L1A*/ 02373000
*     ,5 IsgyQuaaUs_LR_ContTime fixed(64) /* Total time of contention   02374000
*                                                                @L1A*/ 02375000
*     ,5 IsgyQuaaUs_LR_ContTimeSq char(16) /* Sum of the squares of     02376000
*                                     the individual contention times   02377000
*                                                                @L1A*/ 02378000
*   ,3 IsgyQuaaUs_EnqStepStats   /* Statistics for requests that        02379000
*                                     generated STEP scope ENQs from    02380000
*                                     this address space         @L1A*/ 02381000
*     ,5 IsgyQuaaUs_EStepTotalCount fixed(64) /* Total number of        02382000
*                                     requests that resulted in GRS     02383000
*                                     queuing an element (contention    02384000
*                                     and non-contention cases)  @L1A*/ 02385000
*     ,5 IsgyQuaaUs_EStepContCount fixed(64) /* Total number of         02386000
*                                     contention generating requests    02387000
*                                     that resulted in GRS queuing a    02388000
*                                     waiting element            @L1A*/ 02389000
*     ,5 IsgyQuaaUs_EStepContTime fixed(64) /* Total time of            02390000
*                                     contention                 @L1A*/ 02391000
*     ,5 * char(8)                                                      02392000
*     ,5 IsgyQuaaUs_EStepContTimeSq char(16) /* Sum of the squares of   02393000
*                                     the individual contention times   02394000
*                                                                @L1A*/ 02395000
*   ,3 IsgyQuaaUs_EnqSystemStats /* Statistics for requests that        02396000
*                                     generated SYSTEM scope ENQs from  02397000
*                                     this address space         @L1A*/ 02398000
*     ,5 IsgyQuaaUs_ESystemTotalCount fixed(64) /* Total number of      02399000
*                                     requests that resulted in GRS     02400000
*                                     queuing an element (contention    02401000
*                                     and non-contention cases)  @L1A*/ 02402000
*     ,5 IsgyQuaaUs_ESystemContCount fixed(64)  /* Total number of      02403000
*                                     contention generating requests    02404000
*                                     that resulted in GRS queuing a    02405000
*                                     waiting element            @L1A*/ 02406000
*     ,5 IsgyQuaaUs_ESystemContTime fixed(64) /* Total time of          02407000
*                                     contention                 @L1A*/ 02408000
*     ,5 * char(8)                                                      02409000
*     ,5 IsgyQuaaUs_ESystemContTimeSq char(16) /* Sum of the squares    02410000
*                                     of the individual contention      02411000
*                                     times                      @L1A*/ 02412000
*   ,3 IsgyQuaaUs_EnqSystemsStats /* Statistics for requests that       02413000
*                                     generated SYSTEMS scope ENQs from 02414000
*                                     this address space         @L1A*/ 02415000
*     ,5 IsgyQuaaUs_ESystemsTotalCount fixed(64)  /* Total number of    02416000
*                                     requests that resulted in GRS     02417000
*                                     queuing an element (contention    02418000
*                                     and non-contention cases)  @L1A*/ 02419000
*     ,5 IsgyQuaaUs_ESystemsContCount fixed(64) /* Total number of      02420000
*                                     contention generating requests    02421000
*                                     that resulted in GRS queuing a    02422000
*                                     waiting element            @L1A*/ 02423000
*     ,5 IsgyQuaaUs_ESystemsContTime fixed(64) /* Total time of         02424000
*                                     contention                 @L1A*/ 02425000
*     ,5 * char(8)                                                      02426000
*     ,5 IsgyQuaaUs_ESystemsContTimeSq char(16) /* Sum of the squares   02427000
*                                     of the individual contention      02428000
*                                     times                      @L1A*/ 02429000
*   ,3 IsgyQuaaUs_QscanStats       /* Statistics for Qscan requests     02430000
*                                     (GQSCAN and                       02431000
*                                     ISGQUERY REQINFO=QSCAN) issued    02432000
*                                     from this address space    @L1A*/ 02433000
*     ,5 IsgyQuaaUs_QTotalCount fixed(64) /* Count of requests          02434000
*                                     including (START and RESUME, but  02435000
*                                     not QUITs                  @L1A*/ 02436000
*     ,5 IsgyQuaaUs_QSpecCount fixed(64) /* Count of requests that      02437000
*                                     are specific. This includes       02438000
*                                     requests with a specific QNAME    02439000
*                                     and RNAME or ISGQUERY specifying  02440000
*                                     a search by EnqToken       @L1A*/ 02441000
*                                                                       02442000
*     ,5 IsgyQuaaUs_QResCountSq char(16) /* Sum of the squares of       02443000
*                                     number of resources returned.     02444000
*                                                                @L1A*/ 02445000
*     ,5 IsgyQuaaUs_QResCount fixed(64) /* Sum of all resources         02446000
*                                     returned by QScans.        @L1A*/ 02447000
*     ,5 IsgyQuaaUs_QTime fixed(64) /* Sum of request times (in TOD-    02448000
*                                     format) for QScan requests @L1A*/ 02449000
*     ,5 IsgyQuaaUs_QTimeSq char(16) /* Sum of the squares of request   02450000
*                                     times for QScan requests   @L1A*/ 02451000
*   ,3 * char(32)                   /* Reserved for future use   @L2A*/ 02452000
*   ;                                                         /* @L1A*/ 02453000
*dcl IsgyQuaaUsV1_kLen fixed(32) constant(328);               /* @L1A*/ 02454000
*dcl IsgyQuaaUs_kMaxVersion constant(IsgyQuaaUs_kVersion1);   /* @L1A*/ 02455000
*dcl IsgyQuaaUs_kVersion1 constant(1);                        /* @L1A*/ 02456000
*                                                                       02457000
*/* End of PL/X Source                                               */ 02458000
* %IF ISGYQUAC_LIST ^= 'NO' &                                           02459000
*    ZCBPRINT ^= 'NO' %THEN                                             02460000
*   %GOTO ISGYQUAC_4;                                                   02461000
*   @LIST POP NOECHO;                                                   02462000
* %ISGYQUAC_4:;                                                         02463000
* %END;                                                                 02464000
