*                                                                       00001000
* %DCL ISGYQUAA_INCLUDED CHAR EXT;                                      00002000
* %DEACTIVATE ISGYQUAA_INCLUDED;                                        00003000
* %IF ISGYQUAA_INCLUDED = '' %THEN                                      00004000
* %DO;                                                                  00005000
*/* Macro made bi-lingual on 21056. CBGEN compile date 20027         */ 00006000
*% /*                                                                   00007000
         MACRO                                                          00008000
         ISGYQUAA &DSECT=YES,&LIST=YES,&TITLE=YES,&ISGYQUAAHDR=YES,    *00009000
               &ISGYQUAARS=COND,&ISGYQUAARSX=COND,&ISGYQUAARQ=COND,    *00010000
               &ISGYQUAARQX=COND,&ISGYQUAASYS=COND,&ISGYQUAASP=COND     00011000
         GBLC  &ISGYQUAA_INCLUDED                                       00012000
         GBLC  &ZCBPRINT                                                00013000
&ISGYQUAA_INCLUDED SETC 'YES'                                           00014000
         AIF   ('&LIST' EQ 'NONE').P0                                   00015000
         AIF   ('&TITLE' EQ 'NO').P5                                    00016000
 TITLE   'ISGYQUAA  - ISGQUERY Answer Area                           '  00017000
.P5      ANOP                                                           00018000
**/ ISGYQUAA_1:;                                                        00019000
*/* START OF SPECIFICATIONS ******************************************* 00020000
*                                                                       00021000
*01* PROPRIETARY STATEMENT =                                            00022000
*                                                                       00023000
*    Licensed Materials - Property of IBM                               00024000
*    5694-A01 COPYRIGHT IBM CORP.  2004, 2011                           00025000
*                                                                       00026000
*01* STATUS = HBB7780                                                   00027000
*                                                                       00028000
*01* END OF PROPRIETARY STATEMENT                                       00029000
*                                                                       00030000
*01* EXTERNAL CLASSIFICATION: PI                                        00031000
*01* END OF EXTERNAL CLASSIFICATION:                                    00032000
*                                                                       00033000
*01* DESCRIPTIVE NAME:  ISGQUERY Answer Area                            00034000
*02*  ACRONYM:  ISGYQUAA                                                00035000
*                                                                       00036000
*01* MACRO NAME:  ISGYQUAA                                              00037000
*                                                                       00038000
*01* DSECT NAME:                                                        00039000
*     ISGYQUAAHdr                                                       00040000
*     ISGYQUAARs                                                        00041000
*     ISGYQUAARsx                                                @L3A   00042000
*     ISGYQUAARq                                                        00043000
*     ISGYQUAARqx                                                       00044000
*     ISGYQUAASys                                                @L2A   00045000
*     ISGYQUAASp                                                 @L2A   00046000
*                                                                       00047000
*01* COMPONENT:  Global Resource Serialization (SCSDS)                  00048000
*                                                                       00049000
*01* EYE-CATCHER:  ISGYQUAA                                             00050000
*02*  OFFSET:  X'0000' bytes                                            00051000
*02*  LENGTH:  X'0008' bytes                                            00052000
*                                                                       00053000
*01* STORAGE ATTRIBUTES:                                                00054000
*02*  SUBPOOL:  User-supplied                                           00055000
*02*  KEY:  User-supplied                                               00056000
*02*  RESIDENCY:  User-supplied                                         00057000
*                                                                       00058000
*01* SIZE:  Variable                                                    00059000
*            ISGYQUAAHDRBASE  -- X'0028' bytes                          00060000
*            ISGYQUAARSBASE   -- X'0050' bytes                          00061000
*            ISGYQUAARSXBASE  -- X'0030' bytes                          00062000
*            ISGYQUAARQBASE   -- X'0040' bytes                          00063000
*            ISGYQUAARQXBASE  -- X'0068' bytes                          00064000
*            ISGYQUAASYSBASE  -- X'0028' bytes                          00065000
*            ISGYQUAASPBASE   -- X'0010' bytes                          00066000
*            ISGYQUAARSXFULL2 -- X'0030' bytes                          00067000
*            ISGYQUAARQXFULL2 -- X'0088' bytes                          00068000
*            ISGYQUAARQXFULL  -- X'0068' bytes                          00069000
*            ISGYQUAAHDR -- X'0028' bytes                               00070000
*            ISGYQUAARS  -- X'0050' bytes                               00071000
*            ISGYQUAARSX -- X'0030' bytes                               00072000
*            ISGYQUAARQ  -- X'0040' bytes                               00073000
*            ISGYQUAARQX -- X'0088' bytes                               00074000
*            ISGYQUAASYS -- X'0028' bytes                               00075000
*            ISGYQUAASP  -- X'0010' bytes                               00076000
*                                                                       00077000
*01* CREATED BY:                                                        00078000
*     Created by user and passed as parameter on ANSAREA keyword        00079000
*     for ISGQUERY macro.                                               00080000
*                                                                       00081000
*01* POINTED TO BY:                                                     00082000
*     ANSAREA_ADDR3164 field in ISGQUERY parameter list                 00083000
*                                                                       00084000
*01* SERIALIZATION:                                                     00085000
*     None required                                                     00086000
*                                                                       00087000
*01* FUNCTION:                                                          00088000
*02* Maps the data returned by the ISGQUERY macro.                      00089000
*                                                                       00090000
*    *************************************************************      00091000
*    NOTE: This mapping macro is now obsolete.  All ISGQUERY            00092000
*    enhancements at HBB7780 and higher are supported by ISGYQUAC.      00093000
*    *************************************************************      00094000
*                                                                       00095000
*    This data represents an unserialized view of system resources.     00096000
*    The ISGQUERY returns the ISGYQUAAHdr plus the records for          00097000
*    each resource and requesters that match the query request.         00098000
*                                                                       00099000
*    The answer area written for REQINFO=QSCAN queries is in the        00100000
*    following format. ISGYQUAARqx records are only included if         00101000
*    ANSDETAIL=FULL!FULL2!FULL3. ISGYQUAARsx records are only included  00102000
*    if ANSDETAIL=FULL2!FULL3.                                   @L4C   00103000
*                                                                       00104000
*    Note: Use addresses to locate each record-- the offset to the      00105000
*    next record is not guaranteed because the length and order of      00106000
*    the records may change.                                            00107000
*                                                                       00108000
*     _____________                                                     00109000
*    !             !                                                    00110000
*    ! ISGYQUAAHdr !                                                    00111000
*    !_____________!                                                    00112000
*          :                                                            00113000
*          :                                                            00114000
*         _V__________                                                  00115000
*        !            !    ____________     ____________                00116000
*        ! ISGYQUAARs !-->!            !-->!            !--> ...        00117000
*        !____________!   ! ISGYQUAARq !   ! ISGYQUAARq !               00118000
*         :  :  :         !____________!   !____________!               00119000
*         :  :  V                  :                :                   00120000
*         :  : RNAME        _______V_____    _______V_____              00121000
*         : _V___________  !             !  !             !             00122000
*         :!             ! ! ISGYQUAARqx !  ! ISGYQUAARqx !             00123000
*         :! ISGYQUAARsx ! !_____________!  !_____________!             00124000
*         :!_____________!     :                    :                   00125000
*         :                    V                    V                   00126000
*         :                  ORIG.                User                  00127000
*         :                  RNAME                 Data                 00128000
*         V___________                                                  00129000
*        !            !    ____________     ____________                00130000
*        ! ISGYQUAARs !-->!            !-->!            !--> ...        00131000
*        !____________!   ! ISGYQUAARq !   ! ISGYQUAARq !               00132000
*         :  :  :         !____________!   !____________!               00133000
*         :  :  V                  :                :                   00134000
*         :  : RNAME        _______V_____    _______V_____              00135000
*         : _V___________  !             !  !             !             00136000
*         :!             ! ! ISGYQUAARqx !  ! ISGYQUAARqx !             00137000
*         :! ISGYQUAARsx ! !_____________!  !_____________!             00138000
*         :!_____________!                      :      :                00139000
*         :                                     V      V                00140000
*         :                                   ORIG.  User               00141000
*         V                                   RNAME   Data              00142000
*         ...                                                    @L4C   00143000
*                                                                       00144000
*    The answer area written for REQINFO=ENQSTATS queries is in  @L2A   00145000
*    the following format.  Note: Use addresses to locate each   @L2A   00146000
*    record-- the offset to the next record is not guaranteed    @L2A   00147000
*    because the length and order of the records may change.     @L2A   00148000
*    length and order of the records may change.                 @L2A   00149000
*                                                                       00150000
*     _____________                                                     00151000
*    !             !                                                    00152000
*    ! ISGYQUAAHdr !                                                    00153000
*    !_____________!                                                    00154000
*          :                                                            00155000
*          :                                                            00156000
*         _V___________     _____________                               00157000
*        !             !   !             !                              00158000
*        ! ISGYQUAASys !-->! ISGYQUAASys !                              00159000
*        !_____________!   !_____________!                              00160000
*               :                 :                                     00161000
*            ___V________      ___V________                             00162000
*           !            !    !            !                            00163000
*           ! ISGYQUAASp !    ! ISGYQUAASp !                            00164000
*           !____________!    !____________!                     @L2A   00165000
*                                                                       00166000
*                                                                       00167000
*01* METHOD OF ACCESS:                                                  00168000
*02*  ASM:                                                              00169000
*      ISGYQUAA                                                         00170000
*        DSECT=YES!NO            -- Request DSECT definition            00171000
*        LIST=YES!NONE           -- Include macro prolog                00172000
*        TITLE=YES!NO            -- Include macro title                 00173000
*        ISGYQUAAHDR=YES!NO!COND -- Request Header record mapping       00174000
*        ISGYQUAARS=YES!NO!COND  -- Request Resource record mapping     00175000
*        ISGYQUAARSX=YES!NO!COND -- Request Resource record             00176000
*                                   extension mapping             @L3A  00177000
*        ISGYQUAARQ=YES!NO!COND  -- Request Requester record mapping    00178000
*        ISGYQUAARQX=YES!NO!COND -- Request Requester record            00179000
*                                   extension mapping                   00180000
*        ISGYQUAASYS=YES!NO!COND -- Request System record mapping @L2A  00181000
*        ISGYQUAASP=YES!NO!COND  -- Request Space record mapping  @L2A  00182000
*                                                                       00183000
*     COND indicates to include only if DSECT=YES                       00184000
*                                                                       00185000
*     Default: DSECT=YES,LIST=YES,TITLE=YES,ISGYQUAAHDR=YES,            00186000
*              ISGYQUAARS=COND,ISGYQUAARSX=COND,ISGYQUAARQ=COND         00187000
*              ISGYQUAARQX=COND,ISGYQUAASP=COND,ISGYQUAASYS=COND  @L3C  00188000
*                                                                       00189000
*02*  PL/X:                                                             00190000
*      %INCLUDE SYSLIB(ISGYQUAA)                                        00191000
*                                                                       00192000
*01* DELETED BY:  User                                                  00193000
*                                                                       00194000
*01* FREQUENCY:  Created for response to ISGQUERY REQINFO=QSCAN         00195000
*                or REQINFO=ENQSTATS                             @L2A   00196000
*                                                                       00197000
*01* DEPENDENCIES:  None                                                00198000
*                                                                       00199000
*01* DISTRIBUTION LIBRARY:  AMACLIB                                     00200000
*                                                                       00201000
*01* CHANGE ACTIVITY:                                                   00202000
*                                                                       00203000
*    $L0=64GRS   ,HBB7709,030417,PDFX: ISGQUERY interface               00204000
*    $P1=PJK0935 ,HBB7709,030918,PDCJ: Fix up comments for reserve      00205000
*                                      bits                             00206000
*    $L1=64GRS   ,HBB7709,030417,PDFY: ISGQUERY compatability           00207000
*    $P2=PJK1044 ,HBB7709,031007,PDCJ: Change comment for               00208000
*                                      ISGYQUAARQSYNCHRES               00209000
*    $P3=PJK0745 ,HBB7709,031106,PDFX: General doc changes              00210000
*    $P4=PJK1006 ,HBB7709,031118,PDFY: Remove TaskAbending              00211000
*    $P5=PJK1491 ,HBB7709,040218,PDFY: Update Comments about reserve    00212000
*    $P6=ME00672 ,HBB7720,040615,PDFY: Add RQX_AltSerExtended           00213000
*    $L2=ENQAPI  ,HBB7730,050127,PDBC: REQINFO=ENQSTATS support         00214000
*       =ME03930 ,HBB7730,050808,PDCJ: Fix copyright                    00215000
*    $P7=ME04352 ,HBB7730,050923,PDFY: Fix ISGYQUAARsFirstRq31          00216000
*    $L3=GRSTOR2 ,HBB7740,060224,PDBC: ANSDETAIL=FULL2 support          00217000
*       =ME07802 ,HBB7740,060807,PDBC: Updated pragma statements        00218000
*    $P8=ME07792 ,HBB7740,060915,PDBC: misc comments & constants        00219000
*    $L4=GRSUDATA,HBB7750,070104,PDFY: ANSDETAIL=FULL3 support          00220000
*    $P9=ME10828 ,HBB7750,070801,PDFY: Stronger indication of the       00221000
*                                      availability of Userdata.        00222000
*    $L5=GRSISVCP,HBB7760,071025,PDFX: Support RscTokens for globals    00223000
*    $L6=GRSSTAT3,HBB7780,100513,PDBC: Transitioning to ISGYQUAC        00224000
*    $PA=WI398827,HBB77D0,210218,PDCYO: Update ISGYQUAAHdrNumRecords    00225000
*                                      comment to include               00226000
*                                      ISGYQUAALDs                      00227000
*                                                                       00228000
* END OF SPECIFICATIONS *********************************************/  00229000
*% /*                                                                   00230000
.P0      ANOP                                                           00231000
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 00232000
         AIF   ('&LIST' EQ 'YES').P2                                    00233000
.P1      ANOP                                                           00234000
         PUSH  PRINT                                                    00235000
         PRINT OFF                                                      00236000
.P2      ANOP                                                           00237000
*                                                                       00238000
*    The following PRAGMA statements provide control info to the CBGEN  00239000
* tool. They must be in the logic/endlogic pair.  Various fields are    00240000
* DELETEd from ASM because we do not want duplicate ASM declares for    00241000
* them.                                                                 00242000
*                                                                       00243000
ISGYQUAA_KSTEP EQU 1                                                    00244000
ISGYQUAA_KSYSTEM EQU 2                                                  00245000
ISGYQUAA_KSYSTEMS EQU 3                                                 00246000
ISGYQUAA_KSYSPLEX EQU 3                                                 00247000
ISGYQUAA_KQSCANMINSUMMARYANSLEN EQU 440 The minimum answer area size   *00248000
                         required when REQUEST=QSCAN,                  *00249000
                         ANSDETAIL=SUMMARY                              00250000
ISGYQUAA_KQSCANMINFULLANSLEN EQU 800 The minimum answer area size      *00251000
                         required when REQUEST=QSCAN, ANSDETAIL=FULL    00252000
ISGYQUAA_KQSCANMINFULL2ANSLEN EQU 880 The minimum answer area size     *00253000
                         required when REQUEST=QSCAN, ANSDETAIL=FULL2   00254000
ISGYQUAA_KQSCANMINFULL3ANSLEN EQU 912 2 Rnames The minimum answer area *00255000
                         size required when REQUEST=QSCAN,             *00256000
                         ANSDETAIL=FULL3                                00257000
         AIF   ('&ISGYQUAAHDR' EQ 'NO').L0002                           00258000
         AIF   ('&DSECT' EQ 'YES').L0003                                00259000
         AIF   ('&ISGYQUAAHDR' NE 'YES').L0002                          00260000
.L0003   ANOP                                                           00261000
*                                                                       00262000
*    ****************************************************************   00263000
*   *                                                                   00264000
*   * ISGYQUAA Header Section                                           00265000
*   *                                                                   00266000
*   ****************************************************************    00267000
*                                                                       00268000
*                                                                       00269000
         AIF   ('&DSECT' EQ 'YES').L0004                                00270000
ISGYQUAAHDR DS 0D        Resource Data Record                           00271000
         AGO   .L0005                                                   00272000
.L0004   ANOP                                                           00273000
ISGYQUAAHDR DSECT        Resource Data Record                           00274000
.L0005   ANOP                                                           00275000
ISGYQUAAHDRMAX DS CL40   The max length map                             00276000
         ORG   ISGYQUAAHDRMAX                                           00277000
ISGYQUAAHDRID DS CL8                                                    00278000
ISGYQUAAHDRVERSION DS H                                                 00279000
ISGYQUAAHDRREQINFO DS H                                                 00280000
ISGYQUAAHDRNUMRECORDS DS F                                              00281000
ISGYQUAAHDRFIRSTRECORD DS AD                                            00282000
         ORG   ISGYQUAAHDRFIRSTRECORD                                   00283000
         DS    CL4                                                      00284000
ISGYQUAAHDRFIRSTRECORD31 DS A                                           00285000
ISGYQUAAHDRTOTALLEN DS FL8                                              00286000
         ORG   ISGYQUAAHDRTOTALLEN                                      00287000
         DS    CL4                                                      00288000
ISGYQUAAHDRTOTALLEN31 DS F                                              00289000
         DS    CL8                                                      00290000
*                                                                       00291000
*     ISGYQUAAHDR Constants                                             00292000
*                                                                       00293000
*                                                                       00294000
ISGYQUAAHDR_KID_0TO3 EQU C'ISGY' This is the first 4-byte segment of   *00295000
                         an 8-byte constant.                            00296000
ISGYQUAAHDR_KID_4TO7 EQU C'QUAA' This is the second 4-byte segment of  *00297000
                         an 8-byte constant.                            00298000
ISGYQUAAHDR_KMAXVERSION EQU 1                                           00299000
ISGYQUAAHDR_KHBB7709 EQU 1                                              00300000
ISGYQUAAHDR_KVERSION1 EQU 1                                             00301000
ISGYQUAAHDR_KREQINFO_QSCAN EQU 1                                        00302000
ISGYQUAAHDR_KREQINFO_ENQSTATS EQU 2                                     00303000
ISGYQUAAHDR_LEN EQU *-ISGYQUAAHDR                                       00304000
.L0002   ANOP                                                           00305000
         AIF   ('&ISGYQUAARS' EQ 'NO').L0006                            00306000
         AIF   ('&DSECT' EQ 'YES').L0007                                00307000
         AIF   ('&ISGYQUAARS' NE 'YES').L0006                           00308000
.L0007   ANOP                                                           00309000
*                                                                       00310000
*    ****************************************************************   00311000
*   *                                                                   00312000
*   * ISGYQUAA Resource Data Record                                     00313000
*   *                                                                   00314000
*   ****************************************************************    00315000
*                                                                       00316000
*                                                                       00317000
         AIF   ('&DSECT' EQ 'YES').L0008                                00318000
ISGYQUAARS DS  0D        Resource Data Record                           00319000
         AGO   .L0009                                                   00320000
.L0008   ANOP                                                           00321000
ISGYQUAARS DSECT         Resource Data Record                           00322000
.L0009   ANOP                                                           00323000
ISGYQUAARSMAX DS CL80    The max length map                             00324000
         ORG   ISGYQUAARSMAX                                            00325000
ISGYQUAARSVERSION DS H                                                  00326000
ISGYQUAARSFLAGS1 DS B                                                   00327000
*  Bit definitions:                                                     00328000
ISGYQUAARSRQSOMITTED EQU X'80'                                          00329000
ISGYQUAARSRSXVALID EQU X'40'                                            00330000
         DS    CL5                                                      00331000
ISGYQUAARSNEXT DS AD                                                    00332000
         ORG   ISGYQUAARSNEXT                                           00333000
         DS    CL4                                                      00334000
ISGYQUAARSNEXT31 DS A                                                   00335000
ISGYQUAARSFIRSTRQ DS AD                                                 00336000
         ORG   ISGYQUAARSFIRSTRQ                                        00337000
         DS    CL4                                                      00338000
ISGYQUAARSFIRSTRQ31 DS A                                                00339000
ISGYQUAARSRNAME DS AD                                                   00340000
         ORG   ISGYQUAARSRNAME                                          00341000
         DS    CL4                                                      00342000
ISGYQUAARSRNAME31 DS A                                                  00343000
ISGYQUAARSQNAME DS CL8                                                  00344000
ISGYQUAARSNUMRQ DS F                                                    00345000
ISGYQUAARSTOTALRQ DS F                                                  00346000
ISGYQUAARSNUMOWNERS DS F                                                00347000
ISGYQUAARSNUMEWAITERS DS F                                              00348000
ISGYQUAARSNUMSWAITERS DS F                                              00349000
ISGYQUAARSNUMEUSERS DS F                                                00350000
ISGYQUAARSNUMSUSERS DS F                                                00351000
ISGYQUAARSRNAMELEN DS H                                                 00352000
ISGYQUAARSSCOPE DS X                                                    00353000
         DS    CL1                                                      00354000
ISGYQUAARSRSX DS AD                                                     00355000
         ORG   ISGYQUAARSRSX                                            00356000
         DS    CL4                                                      00357000
ISGYQUAARSRSX31 DS A                                                    00358000
*                                                                       00359000
*     ISGYQUAARS Constants                                              00360000
*                                                                       00361000
*                                                                       00362000
ISGYQUAARS_KMAXVERSION EQU 2                                            00363000
ISGYQUAARS_KHBB7709 EQU 1                                               00364000
ISGYQUAARS_KHBB7740 EQU 2                                               00365000
ISGYQUAARS_KVERSION1 EQU 1                                              00366000
ISGYQUAARS_KVERSION2 EQU 2                                              00367000
ISGYQUAARS_LEN EQU *-ISGYQUAARS                                         00368000
.L0006   ANOP                                                           00369000
         AIF   ('&ISGYQUAARSX' EQ 'NO').L000A                           00370000
         AIF   ('&DSECT' EQ 'YES').L000B                                00371000
         AIF   ('&ISGYQUAARSX' NE 'YES').L000A                          00372000
.L000B   ANOP                                                           00373000
*                                                                       00374000
*    *****************************************************************  00375000
*   *                                                                   00376000
*   * ISGYQUAA Resource Data Record Extension                           00377000
*   *   (Only returned when ANSDETAIL=FULL2 or higher)                  00378000
*   *                                                                   00379000
*   ************************************************************        00380000
*                                                                       00381000
*                                                                       00382000
         AIF   ('&DSECT' EQ 'YES').L000C                                00383000
ISGYQUAARSX DS 0D        Resource Data Record Ext.                      00384000
         AGO   .L000D                                                   00385000
.L000C   ANOP                                                           00386000
ISGYQUAARSX DSECT        Resource Data Record Ext.                      00387000
.L000D   ANOP                                                           00388000
ISGYQUAARSXMAX DS CL48   The max length map                             00389000
         ORG   ISGYQUAARSXMAX                                           00390000
ISGYQUAARSXVERSION DS H                                                 00391000
ISGYQUAARSXFLAGS1 DS B                                                  00392000
*  Bit definitions:                                                     00393000
ISGYQUAARSXRSCTOKENVALID EQU X'80'                                      00394000
         DS    CL1                                                      00395000
ISGYQUAARSXRSCTOKEN DS CL32                                             00396000
         DS    CL12                                                     00397000
*                                                                       00398000
*     ISGYQUAARsx Constants                                             00399000
*                                                                       00400000
*                                                                       00401000
ISGYQUAARSX_KMAXVERSION EQU 1                                           00402000
ISGYQUAARSX_KHBB7740 EQU 1                                              00403000
ISGYQUAARSX_KVERSION1 EQU 1                                             00404000
ISGYQUAARSX_LEN EQU *-ISGYQUAARSX                                       00405000
.L000A   ANOP                                                           00406000
         AIF   ('&ISGYQUAARQ' EQ 'NO').L000E                            00407000
         AIF   ('&DSECT' EQ 'YES').L000F                                00408000
         AIF   ('&ISGYQUAARQ' NE 'YES').L000E                           00409000
.L000F   ANOP                                                           00410000
*                                                                       00411000
*    ****************************************************************   00412000
*   *                                                                   00413000
*   * ISGYQUAA Requester Data Record                                    00414000
*   *                                                                   00415000
*   ****************************************************************    00416000
*                                                                       00417000
*                                                                       00418000
         AIF   ('&DSECT' EQ 'YES').L0010                                00419000
ISGYQUAARQ DS  0D        Requester Data Record                          00420000
         AGO   .L0011                                                   00421000
.L0010   ANOP                                                           00422000
ISGYQUAARQ DSECT         Requester Data Record                          00423000
.L0011   ANOP                                                           00424000
ISGYQUAARQMAX DS CL64    The max length map                             00425000
         ORG   ISGYQUAARQMAX                                            00426000
ISGYQUAARQVERSION DS H                                                  00427000
ISGYQUAARQFLAGS1 DS B                                                   00428000
*  Bit definitions:                                                     00429000
ISGYQUAARQCONTROL EQU X'80'                                             00430000
ISGYQUAARQRESERVE EQU X'40'                                             00431000
ISGYQUAARQRESERVECONVERTED EQU X'20'                                    00432000
ISGYQUAARQSYNCHRES EQU X'10'                                            00433000
ISGYQUAARQOWNER EQU X'08'                                               00434000
ISGYQUAARQMATU EQU X'04'                                                00435000
ISGYQUAARQPOSTED EQU X'02'                                              00436000
ISGYQUAARQMISC64VALID EQU X'01'                                         00437000
ISGYQUAARQFLAGS2 DS B                                                   00438000
*  Bit definitions:                                                     00439000
ISGYQUAARQRQXVALID EQU X'80'                                            00440000
ISGYQUAARQTCB DS A                                                      00441000
ISGYQUAARQNEXT DS AD                                                    00442000
         ORG   ISGYQUAARQNEXT                                           00443000
         DS    CL4                                                      00444000
ISGYQUAARQNEXT31 DS A                                                   00445000
ISGYQUAARQRQX DS AD                                                     00446000
         ORG   ISGYQUAARQRQX                                            00447000
         DS    CL4                                                      00448000
ISGYQUAARQRQX31 DS A                                                    00449000
ISGYQUAARQENQTOKEN DS CL32                                              00450000
         DS    CL8                                                      00451000
*                                                                       00452000
*     ISGYQUAARQ Constants                                              00453000
*                                                                       00454000
*                                                                       00455000
ISGYQUAARQ_KMAXVERSION EQU 1                                            00456000
ISGYQUAARQ_KHBB7709 EQU 1                                               00457000
ISGYQUAARQ_KVERSION1 EQU 1                                              00458000
ISGYQUAARQ_LEN EQU *-ISGYQUAARQ                                         00459000
.L000E   ANOP                                                           00460000
         AIF   ('&ISGYQUAARQX' EQ 'NO').L0012                           00461000
         AIF   ('&DSECT' EQ 'YES').L0013                                00462000
         AIF   ('&ISGYQUAARQX' NE 'YES').L0012                          00463000
.L0013   ANOP                                                           00464000
*                                                                       00465000
*    *****************************************************************  00466000
*   *                                                                   00467000
*   * ISGYQUAA Requester Data Record Extension                          00468000
*   *   (Only returned when ANSDETAIL=FULL or higher)                   00469000
*   *                                                                   00470000
*   ************************************************************        00471000
*                                                                       00472000
*                                                                       00473000
         AIF   ('&DSECT' EQ 'YES').L0014                                00474000
ISGYQUAARQX DS 0D        Requester Data Record Extension                00475000
         AGO   .L0015                                                   00476000
.L0014   ANOP                                                           00477000
ISGYQUAARQX DSECT        Requester Data Record Extension                00478000
.L0015   ANOP                                                           00479000
ISGYQUAARQXMAX DS CL136  The max len map                                00480000
         ORG   ISGYQUAARQXMAX                                           00481000
ISGYQUAARQXFULL2FULL DS CL104                                           00482000
         ORG   ISGYQUAARQXFULL2FULL                                     00483000
ISGYQUAARQXVERSION DS H                                                 00484000
ISGYQUAARQXFLAGS1 DS B                                                  00485000
*  Bit definitions:                                                     00486000
ISGYQUAARQXNQXITCHANGED EQU X'80'                                       00487000
ISGYQUAARQXBATCHCHANGED EQU X'40'                                       00488000
ISGYQUAARQXRNLCHANGED EQU X'20'                                         00489000
ISGYQUAARQXORIGQNAMEVALID EQU X'10'                                     00490000
ISGYQUAARQXORIGRNAMEVALID EQU X'08'                                     00491000
ISGYQUAARQXORIGUCB@VALID EQU X'04'                                      00492000
ISGYQUAARQXORIGSCOPEVALID EQU X'02'                                     00493000
ISGYQUAARQXSERVICEASIDVALID EQU X'01'                                   00494000
ISGYQUAARQXFLAGS2 DS B                                                  00495000
*  Bit definitions:                                                     00496000
ISGYQUAARQXMUSTCOMPLETE EQU X'80'                                       00497000
ISGYQUAARQXAUTHORIZED EQU X'40'                                         00498000
ISGYQUAARQXALTSEREXTENDED EQU X'20'                                     00499000
ISGYQUAARQXMATCHINGTASK EQU X'10'                                       00500000
ISGYQUAARQXECBREQUEST EQU X'08'                                         00501000
ISGYQUAARQXUSERDATAVALID EQU X'04'                                      00502000
ISGYQUAARQXUSERDATAOMITTED EQU X'02'                                    00503000
         DS    CL2                                                      00504000
ISGYQUAARQXREQUESTERDATA DS CL42                                        00505000
         ORG   ISGYQUAARQXREQUESTERDATA                                 00506000
ISGYQUAARQXASID DS H                                                    00507000
ISGYQUAARQXSTOKEN DS CL8                                                00508000
ISGYQUAARQXTTOKEN DS CL16                                               00509000
ISGYQUAARQXJOBNAME DS CL8                                               00510000
ISGYQUAARQXSYSNAME DS CL8                                               00511000
ISGYQUAARQXMTCB DS A                                                    00512000
ISGYQUAARQXMASID DS H                                                   00513000
ISGYQUAARQXSERVICEASID DS H                                             00514000
ISGYQUAARQXECB DS A                                                     00515000
         ORG   ISGYQUAARQXECB                                           00516000
ISGYQUAARQXSVRB DS A                                                    00517000
ISGYQUAARQXUCB DS A                                                     00518000
ISGYQUAARQXDEVICENUM DS CL4                                             00519000
         DS    CL4                                                      00520000
ISGYQUAARQXORIGQNAME DS CL8                                             00521000
ISGYQUAARQXORIGRNAME DS AD                                              00522000
         ORG   ISGYQUAARQXORIGRNAME                                     00523000
         DS    CL4                                                      00524000
ISGYQUAARQXORIGRNAME31 DS A                                             00525000
ISGYQUAARQXORIGUCB@ DS A                                                00526000
ISGYQUAARQXORIGRNAMELEN DS X                                            00527000
ISGYQUAARQXORIGSCOPE DS X                                               00528000
ISGYQUAARQXUSERDATALEN DS H                                             00529000
ISGYQUAARQXUSERDATA DS AD                                               00530000
         ORG   ISGYQUAARQXUSERDATA                                      00531000
         DS    CL4                                                      00532000
ISGYQUAARQXUSERDATA31 DS A                                              00533000
ISGYQUAARQXENQTIME DS CL16                                              00534000
         DS    CL16                                                     00535000
*                                                                       00536000
*     ISGYQUAARQX Constants                                             00537000
*                                                                       00538000
*                                                                       00539000
ISGYQUAARQX_KMAXVERSION EQU 2                                           00540000
ISGYQUAARQX_KHBB7709 EQU 1                                              00541000
ISGYQUAARQX_KHBB7740 EQU 2                                              00542000
ISGYQUAARQX_KVERSION1 EQU 1                                             00543000
ISGYQUAARQX_KVERSION2 EQU 2                                             00544000
ISGYQUAARQX_LEN EQU *-ISGYQUAARQX                                       00545000
.L0012   ANOP                                                           00546000
         AIF   ('&ISGYQUAASYS' EQ 'NO').L0016                           00547000
         AIF   ('&DSECT' EQ 'YES').L0017                                00548000
         AIF   ('&ISGYQUAASYS' NE 'YES').L0016                          00549000
.L0017   ANOP                                                           00550000
*                                                                       00551000
*    ****************************************************************   00552000
*   *                                                                   00553000
*   * ISGYQUAA System Data                                              00554000
*   *   (Only relevant for REQINFO=ENQSTATS)                            00555000
*   *                                                                   00556000
*   ***********************************************************         00557000
*                                                                       00558000
*                                                                       00559000
         AIF   ('&DSECT' EQ 'YES').L0018                                00560000
ISGYQUAASYS DS 0D        REQINFO=ENQSTATS system data                   00561000
         AGO   .L0019                                                   00562000
.L0018   ANOP                                                           00563000
ISGYQUAASYS DSECT        REQINFO=ENQSTATS system data                   00564000
.L0019   ANOP                                                           00565000
ISGYQUAASYSMAX DS CL40   The max length map                             00566000
         ORG   ISGYQUAASYSMAX                                           00567000
ISGYQUAASYSVERSION DS H                                                 00568000
ISGYQUAASYSFLAGS1 DS B                                                  00569000
*  Bit definitions:                                                     00570000
ISGYQUAASYSAUTHORIZED EQU X'80'                                         00571000
         DS    CL5                                                      00572000
ISGYQUAASYSNEXT DS AD                                                   00573000
         ORG   ISGYQUAASYSNEXT                                          00574000
         DS    CL4                                                      00575000
ISGYQUAASYSNEXT31 DS A                                                  00576000
ISGYQUAASYSSP DS AD                                                     00577000
         ORG   ISGYQUAASYSSP                                            00578000
         DS    CL4                                                      00579000
ISGYQUAASYSSP31 DS A                                                    00580000
ISGYQUAASYSPEAKENQDATA DS CL8                                           00581000
         ORG   ISGYQUAASYSPEAKENQDATA                                   00582000
ISGYQUAASYSPEAKENQCOUNT DS F                                            00583000
ISGYQUAASYSPEAKENQASID DS H                                             00584000
         DS    CL2                                                      00585000
ISGYQUAASYSENQMAX DS F                                                  00586000
         DS    CL4                                                      00587000
*                                                                       00588000
*     ISGYQUAASys Constants                                             00589000
*                                                                       00590000
*                                                                       00591000
ISGYQUAASYS_KMAXVERSION EQU 1                                           00592000
ISGYQUAASYS_KHBB7730 EQU 1                                              00593000
ISGYQUAASYS_KVERSION1 EQU 1                                             00594000
ISGYQUAASYS_LEN EQU *-ISGYQUAASYS                                       00595000
.L0016   ANOP                                                           00596000
         AIF   ('&ISGYQUAASP' EQ 'NO').L001A                            00597000
         AIF   ('&DSECT' EQ 'YES').L001B                                00598000
         AIF   ('&ISGYQUAASP' NE 'YES').L001A                           00599000
.L001B   ANOP                                                           00600000
*                                                                       00601000
*    ****************************************************************   00602000
*   *                                                                   00603000
*   * ISGYQUAA Address Space Data                                       00604000
*   *   (Only relevant for REQINFO=ENQSTATS)                            00605000
*   *                                                                   00606000
*   ***********************************************************         00607000
*                                                                       00608000
*                                                                       00609000
         AIF   ('&DSECT' EQ 'YES').L001C                                00610000
ISGYQUAASP DS  0D        REQINFO=ENQSTATS address space specific data   00611000
         AGO   .L001D                                                   00612000
.L001C   ANOP                                                           00613000
ISGYQUAASP DSECT         REQINFO=ENQSTATS address space specific data   00614000
.L001D   ANOP                                                           00615000
ISGYQUAASPMAX DS CL16    The max length map                             00616000
         ORG   ISGYQUAASPMAX                                            00617000
ISGYQUAASPVERSION DS H                                                  00618000
         DS    CL2                                                      00619000
ISGYQUAASPCURRENQCOUNT DS F                                             00620000
ISGYQUAASPPEAKENQCOUNT DS F                                             00621000
ISGYQUAASPENQMAX DS F                                                   00622000
*                                                                       00623000
*     ISGYQUAASp Constants                                              00624000
*                                                                       00625000
*                                                                       00626000
ISGYQUAASP_KMAXVERSION EQU 1                                            00627000
ISGYQUAASP_KHBB7730 EQU 1                                               00628000
ISGYQUAASP_KVERSION1 EQU 1                                              00629000
ISGYQUAAUSERDATA_KINITIALLEN EQU 32 The initial length of              *00630000
                         ISGYQUAAUserdata                               00631000
ISGYQUAASP_LEN EQU *-ISGYQUAASP                                         00632000
.L001A   ANOP                                                           00633000
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 00634000
         AIF   ('&LIST' EQ 'YES').P4                                    00635000
.P3      ANOP                                                           00636000
         POP   PRINT                                                    00637000
.P4      ANOP                                                           00638000
.P_EXIT  ANOP                                                           00639000
         MEND                                                           00640000
**/ ISGYQUAA_2:;                                                        00641000
* %ISGYQUAA_INCLUDED = 'YES';                                           00642000
* %DCL ZCBPRINT CHAR EXT;                                               00643000
* %DEACTIVATE ZCBPRINT;                                                 00644000
* %DCL ISGYQUAA_LIST CHAR EXT;                                          00645000
* %DEACTIVATE ISGYQUAA_LIST;                                            00646000
* %IF ISGYQUAA_LIST = 'NO' !                                            00647000
*    ZCBPRINT = 'NO' %THEN                                              00648000
* %DO;                                                                  00649000
*   @LIST PUSH NOECHO;                                                  00650000
*   @LIST NOASSEMBLE NOECHO;                                            00651000
*   @LIST OFF C NOECHO;                                                 00652000
* %END;                                                                 00653000
*/* Start of PL/X Source                                             */ 00654000
* @LOGIC;                                                               00655000
* /* The following PRAGMA statements provide control info to the CBGEN  00656000
* tool. They must be in the logic/endlogic pair.  Various fields are    00657000
* DELETEd from ASM because we do not want duplicate ASM declares for    00658000
* them.                                                          @L3A*/ 00659000
* #PRAGMA TOOL=CBGEN.                                                   00660000
* #DELETE.ISGYQUAAHdrBase                                               00661000
* #DELETE.ISGYQUAARsBase                                                00662000
* #DELETE.ISGYQUAARsxBase                                               00663000
* #DELETE.ISGYQUAARqBase                                                00664000
* #DELETE.ISGYQUAARqxBase                                               00665000
* #DELETE.ISGYQUAARqxFull2                                              00666000
* #DELETE.ISGYQUAASysBase                                               00667000
* #DELETE.ISGYQUAASpBase                                                00668000
* #EPRAGMA.                                                             00669000
* @ENDLOGIC;                                                            00670000
*                                                                       00671000
*  /*****************************************************************   00672000
*   *                                                                   00673000
*   * ISGYQUAA General Constants                                        00674000
*   *                                                                   00675000
*   *****************************************************************/  00676000
* DCL                                                                   00677000
*   ISGYQUAA_kSTEP        Fixed(8) Constant(1)                          00678000
*  ,ISGYQUAA_kSYSTEM      Fixed(8) Constant(2)                          00679000
*  ,ISGYQUAA_kSYSTEMS     Fixed(8) Constant(ISGYQUAA_kSYSPLEX)          00680000
*  ,ISGYQUAA_kSYSPLEX     Fixed(8) Constant(3)                          00681000
*  ;                                                                    00682000
*                                                                       00683000
* DCL                                                                   00684000
*   ISGYQUAA_kQScanMinSummaryAnsLen Fixed(32)                           00685000
*     Constant(length(ISGYQUAAHdr)                                      00686000
*             +length(ISGYQUAARs)                                       00687000
*             +length(ISGYQUAARq)                                       00688000
*             +256);                /* The minimum answer area size     00689000
*                                      required when REQUEST=QSCAN,     00690000
*                                      ANSDETAIL=SUMMARY         @L3A*/ 00691000
* DCL                                                                   00692000
*   ISGYQUAA_kQScanMinFullAnsLen Fixed(32)                              00693000
*     Constant(length(ISGYQUAAHdrBase)                                  00694000
*             +length(ISGYQUAARsBase)                                   00695000
*             +length(ISGYQUAARqBase)+length(ISGYQUAARqxBase)           00696000
*             +(2*256));            /* The minimum answer area size     00697000
*                                      required when REQUEST=QSCAN,     00698000
*                                      ANSDETAIL=FULL            @L3A*/ 00699000
* DCL                                                                   00700000
*   ISGYQUAA_kQScanMinFull2AnsLen Fixed(32)                             00701000
*     Constant(length(ISGYQUAAHdrBase)                                  00702000
*             +length(ISGYQUAARsBase)+length(ISGYQUAARsxBase)           00703000
*             +length(ISGYQUAARqBase)+length(ISGYQUAARqxFull2)          00704000
*             +(2*256));            /* The minimum answer area size     00705000
*                                      required when REQUEST=QSCAN,     00706000
*                                      ANSDETAIL=FULL2           @L3A*/ 00707000
* DCL                                                                   00708000
*   ISGYQUAA_kQScanMinFull3AnsLen Fixed(32)                             00709000
*     Constant(length(ISGYQUAAHdrBase)                                  00710000
*             +length(ISGYQUAARsBase)+length(ISGYQUAARsxBase)           00711000
*             +length(ISGYQUAARqBase)+length(ISGYQUAARqxFull2)          00712000
*             +(2*256)               ] 2 Rnames                         00713000
*             +ISGYQUAAUserData_kInitialLen                             00714000
*             );                    /* The minimum answer area size     00715000
*                                      required when REQUEST=QSCAN,     00716000
*                                      ANSDETAIL=FULL3           @L4A*/ 00717000
*  /*****************************************************************   00718000
*   *                                                                   00719000
*   * ISGYQUAA Header Section                                           00720000
*   *                                                                   00721000
*   *****************************************************************/  00722000
*                                                                       00723000
* DCL                                                                   00724000
*   1 ISGYQUAAHdrBase type          /* Base Header Section       @L3C*/ 00725000
*    ,3 ISGYQUAAHdrID       Char(8) /* ISGYQUAA eyecatcher           */ 00726000
*    ,3 ISGYQUAAHdrVersion Fixed(16) /* Header version               */ 00727000
*    ,3 ISGYQUAAHdrReqInfo Fixed(16) /* The REQINFO of the request   */ 00728000
*    ,3 ISGYQUAAHdrNumRecords Fixed(32) /* Number of ISGYQUAARs         00729000
*                                      or ISGQUAALDs or                 00730000
*                                      ISGYQUAASys records returned     00731000
*                                                                @PAC*/ 00732000
*    ,3 ISGYQUAAHdrFirstRecord  Ptr(64) /* Addr of first data record */ 00733000
*      ,5 *                 Char(4) /* First word of 64-bit field    */ 00734000
*      ,5 ISGYQUAAHdrFirstRecord31 Ptr(31) /* Value of                  00735000
*                                      ISGYQUAAHDRFirstRecord           00736000
*                                      for AMODE 31 callers          */ 00737000
*    ,3 ISGYQUAAHdrTotalLen Fixed(64) /* Total Answer Area length       00738000
*                                      of the header and all the data   00739000
*                                      records returned              */ 00740000
*      ,5 *                 Char(4) /* First word of 64-bit field    */ 00741000
*      ,5 ISGYQUAAHdrTotalLen31 Fixed(31) /* Value of                   00742000
*                                      ISGYQUAAHDRTotalLen              00743000
*                                      for AMODE 31 callers          */ 00744000
*    ,3 *                   Char(8) /* Reserved                      */ 00745000
*    ,3 *        Char(0) Bdy(DWORD) /* Reserved                      */ 00746000
*   ;                                                                   00747000
*                                                                       00748000
* DCL                                                                   00749000
*   1 ISGYQUAAHdr type              /* Resource Data Record      @L3A*/ 00750000
*    ,3 ISGYQUAAHdrMax isa(ISGYQUAAHdrBase)/* The max length map @L3A*/ 00751000
*    ;                                                                  00752000
*                                                                       00753000
*  /* ISGYQUAAHDR Constants                                         */  00754000
* DCL                                                                   00755000
*   ISGYQUAAHdr_kID           Char(8)   Constant('ISGYQUAA')            00756000
*  ,ISGYQUAAHdr_kMaxVersion   Fixed(16) Constant(ISGYQUAAHdr_kVersion1) 00757000
*  ,ISGYQUAAHdr_kHBB7709      Fixed(16) Constant(ISGYQUAAHdr_kVersion1) 00758000
*  ,ISGYQUAAHdr_kVersion1     Fixed(16) Constant(1)                     00759000
*  ,ISGYQUAAHdr_kREQINFO_QSCAN Fixed(16) Constant(1)                    00760000
*  ,ISGYQUAAHdr_kREQINFO_ENQSTATS Fixed(16) Constant(2)       /* @L3C*/ 00761000
*  ;                                                                    00762000
*                                                                       00763000
*  /*****************************************************************   00764000
*   *                                                                   00765000
*   * ISGYQUAA Resource Data Record                                     00766000
*   *                                                                   00767000
*   *****************************************************************/  00768000
*                                                                       00769000
* DCL                                                                   00770000
*   1 ISGYQUAARsBase type           /* Base Resource Data Record @L3C*/ 00771000
*    ,3 ISGYQUAARsVersion Fixed(16) /* ISGYQUAARs version            */ 00772000
*    ,3 ISGYQUAARsFlags1 Bit(8)     /* First Flags byte              */ 00773000
*      ,5 ISGYQUAARsRQsOmitted Bit(1) /* Indicates if RQs were left     00774000
*                                      out because of insufficient      00775000
*                                      Answer Area Space             */ 00776000
*      ,5 ISGYQUAARsRsxValid Bit(1) /* Indicates that the               00777000
*                                      ISGYQUAARsRsx field is           00778000
*                                      valid                     @L3A*/ 00779000
*    ,3 *                   Char(5) /* Reserved                      */ 00780000
*    ,3 ISGYQUAARsNext      Ptr(64) /* Address of next RS record        00781000
*                                      returned                      */ 00782000
*      ,5 *                 Char(4) /* First word of 64-bit field    */ 00783000
*      ,5 ISGYQUAARsNext31  Ptr(31) /* Value of ISGYQUAARsNext          00784000
*                                      for AMODE 31 callers          */ 00785000
*    ,3 ISGYQUAARsFirstRq   Ptr(64) /* Addr of first QReq address    */ 00786000
*      ,5 *                 Char(4) /* First word of 64-bit field    */ 00787000
*      ,5 ISGYQUAARsFirstRq31 Ptr(31) /* Value of                       00788000
*                                      ISGYQUAARsFirstRq                00789000
*                                      for AMODE 31 callers      @P7C*/ 00790000
*    ,3 ISGYQUAARsRName     Ptr(64) /* Address of final Rname for       00791000
*                                      the resource              @P3C*/ 00792000
*      ,5 *                 Char(4) /* First word of 64-bit field    */ 00793000
*      ,5 ISGYQUAARsRName31 Ptr(31) /* Value of ISGYQUAARsRName         00794000
*                                      for AMODE 31 callers          */ 00795000
*    ,3 ISGYQUAARsQName     Char(8) /* Final QName of the resource      00796000
*                                                                @P3C*/ 00797000
*    ,3 ISGYQUAARsNumRq   Fixed(32) /* Number of Requester records      00798000
*                                      returned for this Resource    */ 00799000
*    ,3 ISGYQUAARsTotalRq Fixed(32) /* Total number of matching         00800000
*                                      requesters associated with this  00801000
*                                      resource. Check                  00802000
*                                      ISGYQUAARsRQsOmitted to see if   00803000
*                                      some RQs were not included       00804000
*                                      because of insufficient          00805000
*                                      answer area space. If this       00806000
*                                      number differs from              00807000
*                                      ISGYQUAARsNumRq and              00808000
*                                      ISGYQUAARsRQsOmitted is off      00809000
*                                      then not all matching requester  00810000
*                                      information was returned for     00811000
*                                      this resource because the        00812000
*                                      number exceeded the Requester    00813000
*                                      Limit.                           00814000
*                                      To obtain a count of all         00815000
*                                      requesters for this resource     00816000
*                                      (matching and not), add          00817000
*                                      ISGYQUAARsNumOwners,             00818000
*                                      ISGYQUAARsNumEWaiters,           00819000
*                                      ISGYQUAARsNumSWaiters,           00820000
*                                      ISGYQUAARsNumEUsers, and         00821000
*                                      ISGYQUAARsNumSUsers.             00822000
*                                      Note: If SERIALIZEBY=ENQ_ONLY    00823000
*                                      or SERIALIZEBY_RESERVE was       00824000
*                                      specified on the query,          00825000
*                                      then the counts only reflect     00826000
*                                      requests that match the          00827000
*                                      SERIALIZEBY filter.       @P3C*/ 00828000
*    ,3 ISGYQUAARsNumOwners Fixed(32) /* Number of matching requesters  00829000
*                                      that own this resource.          00830000
*                                      This number does not include     00831000
*                                      owners that have control of the  00832000
*                                      resource by a MASID request.     00833000
*                                      Note: If SERIALIZEBY=ENQ_ONLY    00834000
*                                      or SERIALIZEBY_RESERVE was       00835000
*                                      specified on the query,          00836000
*                                      then the counts only reflect     00837000
*                                      requests that match the          00838000
*                                      SERIALIZEBY filter.       @P3C*/ 00839000
*    ,3 ISGYQUAARsNumEWaiters Fixed(32) /* Number of requesters         00840000
*                                      waiting for exclusive control    00841000
*                                      of this resource                 00842000
*                                      Note: If SERIALIZEBY=ENQ_ONLY    00843000
*                                      or SERIALIZEBY_RESERVE was       00844000
*                                      specified on the query,          00845000
*                                      then the counts only reflect     00846000
*                                      requests that match the          00847000
*                                      SERIALIZEBY filter.       @P3C*/ 00848000
*    ,3 ISGYQUAARsNumSWaiters Fixed(32) /* Number of requesters         00849000
*                                      waiting for shared control       00850000
*                                      of this resource.                00851000
*                                      Note: If SERIALIZEBY=ENQ_ONLY    00852000
*                                      or SERIALIZEBY_RESERVE was       00853000
*                                      specified on the query,          00854000
*                                      then the counts only reflect     00855000
*                                      requests that match the          00856000
*                                      SERIALIZEBY filter.       @P3C*/ 00857000
*    ,3 ISGYQUAARsNumEUsers Fixed(32) /* Number of MASID requests       00858000
*                                      that have exclusive control of   00859000
*                                      this resource.                   00860000
*                                      Note: If SERIALIZEBY=ENQ_ONLY    00861000
*                                      or SERIALIZEBY_RESERVE was       00862000
*                                      specified on the query,          00863000
*                                      then the counts only reflect     00864000
*                                      requests that match the          00865000
*                                      SERIALIZEBY filter.       @P3C*/ 00866000
*    ,3 ISGYQUAARsNumSUsers Fixed(32) /* Number of MASID requests       00867000
*                                      that have shared control of      00868000
*                                      this resource.                   00869000
*                                      Note: If SERIALIZEBY=ENQ_ONLY    00870000
*                                      or SERIALIZEBY_RESERVE was       00871000
*                                      specified on the query,          00872000
*                                      then the counts only reflect     00873000
*                                      requests that match the          00874000
*                                      SERIALIZEBY filter.       @P3C*/ 00875000
*    ,3 ISGYQUAARsRNameLen Fixed(16) /* Length of resource RName     */ 00876000
*    ,3 ISGYQUAARsScope    Fixed(8) /* Final scope of resource. One of  00877000
*                                      either ISGYQUAA_kSTEP,           00878000
*                                      ISGYQUAA_kSYSTEM, or             00879000
*                                      ISGYQUAA_kSYSPLEX             */ 00880000
*    ,3 *                   Char(1) /* Reserved                  @L3C*/ 00881000
*    ,3 ISGYQUAARsRsx       Ptr(64) /* Address of resource record       00882000
*                                      extension. Valid only if         00883000
*                                      ISGYQUAARsRsxValid is set.       00884000
*                                                                @L3A*/ 00885000
*      ,5 *                 Char(4) /* First word of 64-bit field       00886000
*                                                                @L3A*/ 00887000
*      ,5 ISGYQUAARsRsx31   Ptr(31) /* Value of ISGYQUAARsRsx           00888000
*                                      for AMODE 31 callers      @L3A*/ 00889000
*    ,3 *        Char(0) Bdy(DWORD) /* Reserved                      */ 00890000
*   ;                                                                   00891000
*                                                                       00892000
* DCL                                                                   00893000
*   1 ISGYQUAARs type               /* Resource Data Record      @L3A*/ 00894000
*    ,3 ISGYQUAARsMax isa(ISGYQUAARsBase) /* The max length map  @L3A*/ 00895000
*    ;                                                                  00896000
*                                                                       00897000
*  /* ISGYQUAARS Constants                                           */ 00898000
* DCL                                                                   00899000
*   ISGYQUAARs_kMaxVersion Fixed(16) Constant(ISGYQUAARs_kVersion2)     00900000
*  ,ISGYQUAARs_kHBB7709    Fixed(16) Constant(ISGYQUAARs_kVersion1)     00901000
*  ,ISGYQUAARs_kHBB7740    Fixed(16) Constant(ISGYQUAARs_kVersion2)     00902000
*  ,ISGYQUAARs_kVersion1   Fixed(16) Constant(1)                        00903000
*  ,ISGYQUAARs_kVersion2   Fixed(16) Constant(2)                        00904000
*  ;                                                          /* @P8C*/ 00905000
*                                                                       00906000
*  /******************************************************************  00907000
*   *                                                                   00908000
*   * ISGYQUAA Resource Data Record Extension                           00909000
*   *   (Only returned when ANSDETAIL=FULL2 or higher)                  00910000
*   *                                                                   00911000
*   ************************************************************ @L3A*/ 00912000
*                                                                       00913000
* DCL                                                                   00914000
*   1 ISGYQUAARsxBase type          /* Base version for FULL2    @L3A*/ 00915000
*    ,3 ISGYQUAARsxVersion Fixed(16) /* ISGYQUAARsx version      @L3A*/ 00916000
*    ,3 ISGYQUAARsxFlags1    Bit(8) /* Flags byte                @L3A*/ 00917000
*      ,5 ISGYQUAARsxRscTokenValid Bit(1) /* Indicates that the         00918000
*                                      ISGYQUAARsxRscToken is valid.    00919000
*                                      Currently, for Star mode globals 00920000
*                                      the token is only valid for      00921000
*                                      resources for which the local    00922000
*                                      system has interest. Ring mode   00923000
*                                      globals and all locals will      00924000
*                                      always have a valid token @L5C*/ 00925000
*    ,3                   * Char(1) /* Reserved                  @L3A*/ 00926000
*    ,3 ISGYQUAARsxRscToken Char(32) /* This token can be used to       00927000
*                                      identify an instance of the      00928000
*                                      resource identified by           00929000
*                                      ISGYQUAARs. The token represents 00930000
*                                      the local systems view of the    00931000
*                                      resource and expires when no     00932000
*                                      requests for the resource        00933000
*                                      remain. Additionally, in Star    00934000
*                                      mode the token expires when      00935000
*                                      the local system no longer has   00936000
*                                      interest in (i.e. requests for)  00937000
*                                      the resource.                    00938000
*                                      Only valid if                    00939000
*                                      ISGYQUAARsxRscTokenValid is on.  00940000
*                                                                @L5C*/ 00941000
*    ,3                  * Char(12) /* Reserved                  @L3A*/ 00942000
*    ,3 *        Char(0) Bdy(DWORD) /* Reserved                  @L3A*/ 00943000
*   ;                                                                   00944000
*                                                                       00945000
* DCL                                                                   00946000
*   1 ISGYQUAARsx type              /* Resource Data Record Ext. @L3A*/ 00947000
*    ,3 ISGYQUAARsxMax isa(ISGYQUAARsxBase)/* The max length map @L3A*/ 00948000
*   ;                                                                   00949000
*                                                                       00950000
*  /* ISGYQUAARsx Constants                                      @L3A*/ 00951000
* DCL                                                                   00952000
*   ISGYQUAARsx_kMaxVersion Fixed(16) Constant(ISGYQUAARs_kVersion1)    00953000
*  ,ISGYQUAARsx_kHBB7740    Fixed(16) Constant(ISGYQUAARs_kVersion1)    00954000
*  ,ISGYQUAARsx_kVersion1   Fixed(16) Constant(1)                       00955000
*  ;                                                          /* @P8C*/ 00956000
*                                                                       00957000
*  /*****************************************************************   00958000
*   *                                                                   00959000
*   * ISGYQUAA Requester Data Record                                    00960000
*   *                                                                   00961000
*   *****************************************************************/  00962000
*                                                                       00963000
* DCL                                                                   00964000
*   1 ISGYQUAARqBase type           /* Requester Data Record     @L3C*/ 00965000
*    ,3 ISGYQUAARqVersion Fixed(16) /* ISGYQUAARQ version            */ 00966000
*    ,3 ISGYQUAARqFlags1     Bit(8) /* First flags byte              */ 00967000
*      ,5 ISGYQUAARqControl     Bit(1) /* Type of serialization for     00968000
*                                      request, where 0 = exclusive     00969000
*                                      control and 1 = shared control   00970000
*                                                                    */ 00971000
*      ,5 ISGYQUAARqReserve  Bit(1) /* Request specified (or was        00972000
*                                      changed by a dynamic exit) to    00973000
*                                      obtain a device reserve.         00974000
*                                      The device is known to be        00975000
*                                      reserved when                    00976000
*                                      ISGYQUAARqReserveConverted is    00977000
*                                      off and ISGYQUAARqSynchRes and   00978000
*                                      ISGYQUAARqPosted are on and one  00979000
*                                      of the following two conditions  00980000
*                                      are true. 1) The request         00981000
*                                      originated from the local system 00982000
*                                      2) Global Resource Serialization 00983000
*                                      is operating in Star mode.       00984000
*                                      The device will be setup to      00985000
*                                      be reserved on the first I/O     00986000
*                                      (which may have completed)       00987000
*                                      if ISGYQUAARqReserveConverted    00988000
*                                      is off, ISGYQUAARqSynchRes is    00989000
*                                      off, and ISGYQUAARqPosted is on. 00990000
*                                                                @P5C*/ 00991000
*      ,5 ISGYQUAARqReserveConverted Bit(1) /* Request specified to     00992000
*                                      obtain a device reserve, but     00993000
*                                      request was converted to a       00994000
*                                      global (SYSTEMS) ENQ      @P1C*/ 00995000
*      ,5 ISGYQUAARqSynchRes Bit(1) /* Request specified to obtain      00996000
*                                      a device reserve, the device     00997000
*                                      was already reserved by the      00998000
*                                      same system image or it was      00999000
*                                      committed to being done          01000000
*                                      synchronously (SYNCHRES).        01001000
*                                      Only valid if                    01002000
*                                      ISGYQUAARqMisc64Valid is set.    01003000
*                                                                @P5C*/ 01004000
*      ,5 ISGYQUAARqOwner    Bit(1) /* Requester is an owner of the     01005000
*                                      resource. If the requester is    01006000
*                                      not an owner, and also not a     01007000
*                                      Matching task user (See          01008000
*                                      ISGYQUAARqMATU) then the         01009000
*                                      requester is a waiter. Note      01010000
*                                      that if a non-converted reserve  01011000
*                                      (ISGYQUAARqReserve is on         01012000
*                                      and ISGYQUAARqReserveConverted   01013000
*                                      is off) then see                 01014000
*                                      ISGYQUAARqSynchRes to determine  01015000
*                                      the state of the reserve         01016000
*                                      processing.               @P1C*/ 01017000
*      ,5 ISGYQUAARqMATU    Bit(1)  /* Matching task use indicator.     01018000
*                                      Requester is using the           01019000
*                                      resource as the result of a      01020000
*                                      MASID/MTCB request            */ 01021000
*      ,5 ISGYQUAARqPosted Bit(1)   /* The requester has been informed  01022000
*                                      that the request has completed.  01023000
*                                      The ECB has been posted or       01024000
*                                      the requester's suspended TCB    01025000
*                                      RB has been posted. Note that    01026000
*                                      in Ring mode, when the request   01027000
*                                      originated on another system     01028000
*                                      and ISGYQUAARqSynchRes is on,    01029000
*                                      the requester may be waiting for 01030000
*                                      synchronous reserve processing   01031000
*                                      to complete.              @P5C*/ 01032000
*      ,5 ISGYQUAARqMisc64Valid Bit(1) /* In some cases not all the     01033000
*                                      information is available from    01034000
*                                      remote systems. This bit         01035000
*                                      indicates that the following     01036000
*                                      fields are valid:                01037000
*                                      ISGYQUAARQEnqToken and           01038000
*                                      ISGYQUAARQSynchRes.              01039000
*                                      Also, when this bit and the      01040000
*                                      ISGYQUAARqRqxValid bit is on,    01041000
*                                      the following fields are valid:  01042000
*                                      ISGYQUAARqxAltSerExtended,       01043000
*                                      ISGYQUAARqxNQXITChanged,         01044000
*                                      ISGYQUAARqxBatchChanged,         01045000
*                                      ISGYQUAARqxEnqTime,              01046000
*                                      ISGYQUAARqxRNLChanged,           01047000
*                                      ISGYQUAARqxOrigQNameValid,       01048000
*                                      ISGYQUAARqxOrigRNameValid,       01049000
*                                      ISGYQUAARqxOrigScopeValid,       01050000
*                                      ISGYQUAARqxOrigUCB@Valid,        01051000
*                                      ISGYQUAARqxSToken,               01052000
*                                      ISGYQUAARqxTToken,               01053000
*                                      ISGYQUAARqxUserDataValid, and    01054000
*                                      ISGYQUAARqxUserDataOmitted       01055000
*                                                                @L4C*/ 01056000
*    ,3 ISGYQUAARqFlags2     Bit(8) /* Second flags byte             */ 01057000
*      ,5 ISGYQUAARqRQXValid Bit(1) /* Indicates that the               01058000
*                                      ISGYQUAARqRQX field is valid  */ 01059000
*    ,3 ISGYQUAARqTcb       Ptr(31) /* TCB address of requester      */ 01060000
*    ,3 ISGYQUAARqNext      Ptr(64) /* Address of next requester record 01061000
*                                      returned                      */ 01062000
*      ,5 *                 Char(4) /* First word of 64-bit field    */ 01063000
*      ,5 ISGYQUAARqNext31  Ptr(31) /* Value of ISGYQUAARqNext          01064000
*                                      for AMODE 31 callers          */ 01065000
*    ,3 ISGYQUAARqRQX       Ptr(64) /* Address of requester record      01066000
*                                      extension. Valid only if         01067000
*                                      ISGYQUAARqRQXValid is set.    */ 01068000
*      ,5 *                 Char(4) /* First word of 64-bit field    */ 01069000
*      ,5 ISGYQUAARqRQX31   Ptr(31) /* Value of ISGYQUAARqRQX           01070000
*                                      for AMODE 31 callers          */ 01071000
*    ,3 ISGYQUAARqENQToken Char(32) /* ENQToken that represents this    01072000
*                                      request. Only valid              01073000
*                                      if ISGYQUAARqMisc64Valid         01074000
*                                      is set.                       */ 01075000
*    ,3 *                   Char(8) /* Reserved                      */ 01076000
*                                                                       01077000
*                                                                       01078000
*    ,3 *        Char(0) Bdy(DWORD) /* Reserved                      */ 01079000
*   ;                                                                   01080000
*                                                                       01081000
* DCL                                                                   01082000
*   1 ISGYQUAARq type             /* Requester Data Record       @L3A*/ 01083000
*    ,3 ISGYQUAARqMax isa(ISGYQUAARqBase) /* The max length map  @L3A*/ 01084000
*    ;                                                                  01085000
*                                                                       01086000
*  /* ISGYQUAARQ Constants                                          */  01087000
* DCL                                                                   01088000
*   ISGYQUAARq_kMaxVersion Fixed(16) Constant(ISGYQUAARq_kVersion1)     01089000
*  ,ISGYQUAARq_kHBB7709    Fixed(16) Constant(ISGYQUAARq_kVersion1)     01090000
*  ,ISGYQUAARq_kVersion1   Fixed(16) Constant(1)                        01091000
*   ;                                                         /* @L3C*/ 01092000
*                                                                       01093000
*  /******************************************************************  01094000
*   *                                                                   01095000
*   * ISGYQUAA Requester Data Record Extension                          01096000
*   *   (Only returned when ANSDETAIL=FULL or higher)                   01097000
*   *                                                                   01098000
*   ************************************************************ @L3C*/ 01099000
*                                                                       01100000
* DCL                                                                   01101000
*   1 ISGYQUAARqxBase type          /* Rqx of ANSDETAIL=FULL     @L3A*/ 01102000
*    ,3 ISGYQUAARqxVersion Fixed(16) /* ISGYQUAARQX version          */ 01103000
*    ,3 ISGYQUAARqxFlags1    Bit(8) /* Flags byte                    */ 01104000
*      ,5 ISGYQUAARqxNQXITChanged Bit(1) /* Indicates that the request  01105000
*                                      was modified by an ENQ exit.     01106000
*                                      ISGNQXIT or ISGNQXITFAST         01107000
*                                      Only valid if                    01108000
*                                      ISGYQUAARqMisc64Valid is set.    01109000
*                                                                @L1C*/ 01110000
*      ,5 ISGYQUAARqxBatchChanged Bit(1) /* Indicates that the request  01111000
*                                      was modified by a batch exit.    01112000
*                                      ISGNQXITBATCH,                   01113000
*                                      ISGNQXITPREBATCH, or             01114000
*                                      ISGNQXITBATCHCND.                01115000
*                                      Only valid if                    01116000
*                                      ISGYQUAARqMisc64Valid is set.    01117000
*                                                                @L1C*/ 01118000
*      ,5 ISGYQUAARqxRNLChanged Bit(1) /* Indicates that the scope was  01119000
*                                      modified by the RNLs             01120000
*                                      Only valid if                    01121000
*                                      ISGYQUAARqMisc64Valid is set.    01122000
*                                                                @L1C*/ 01123000
*      ,5 ISGYQUAARqxOrigQNameValid Bit(1) /* Indicates that the        01124000
*                                      ISGYQUAARqxOrigQName field is    01125000
*                                      valid. If off then the original  01126000
*                                      QName is the same as the final.  01127000
*                                      This bit is only valid if        01128000
*                                      ISGYQUAARqMisc64Valid is set.    01129000
*                                                                @P3C*/ 01130000
*      ,5 ISGYQUAARqxOrigRNameValid Bit(1) /* Indicates that the        01131000
*                                      ISGYQUAARqxOrigRName field is    01132000
*                                      valid. If off then the original  01133000
*                                      RName is the same as the final.  01134000
*                                      This bit is only valid if        01135000
*                                      ISGYQUAARqMisc64Valid is set.    01136000
*                                                                @P3C*/ 01137000
*      ,5 ISGYQUAARqxOrigUCB@Valid Bit(1) /* Indicates that the         01138000
*                                      ISGYQUAARqxOrigUCB field is      01139000
*                                      valid. If off then the original  01140000
*                                      UCB@ is the same as the final.   01141000
*                                      This bit is only valid if        01142000
*                                      ISGYQUAARqMisc64Valid is set.    01143000
*                                                                @P3C*/ 01144000
*      ,5 ISGYQUAARqxOrigScopeValid Bit(1) /* Indicates that the        01145000
*                                      ISGYQUAARqxOrigScope field is    01146000
*                                      valid. If off then the original  01147000
*                                      scope is the same as the final.  01148000
*                                      This bit is only valid if        01149000
*                                      ISGYQUAARqMisc64Valid is set.    01150000
*                                                                @P3C*/ 01151000
*      ,5 ISGYQUAARqxServiceAsidValid Bit(1) /* ISGYQUAARqxServiceAsid  01152000
*                                      field is valid                */ 01153000
*    ,3 ISGYQUAARqxFlags2    Bit(8) /* Second flags byte             */ 01154000
*      ,5 ISGYQUAARqxMustComplete Bit(1) /* Request set must complete   01155000
*                                                                    */ 01156000
*      ,5 ISGYQUAARqxAuthorized Bit(1) /* Requester was authorized   */ 01157000
*      ,5 ISGYQUAARqxAltSerExtended Bit(1) /* This request is being     01158000
*                                      managed by an alternate          01159000
*                                      serialization product at the     01160000
*                                      global level. This bit is only   01161000
*                                      valid if ISGYQUAARqMisc64Valid   01162000
*                                      is set.                   @P6A*/ 01163000
*      ,5 ISGYQUAARqxMatchingTask Bit(1) /* This is a matching task     01164000
*                                      (MTCB/MASID) request.            01165000
*                                      ISGYQUAARqxMTcb and              01166000
*                                      ISGYQUAARqxMAsid contain the     01167000
*                                      TCB and ASID of the matching     01168000
*                                      task                          */ 01169000
*      ,5 ISGYQUAARqxECBRequest Bit(1) /* ECB was specified on ENQ      01170000
*                                      request                       */ 01171000
*      ,5 ISGYQUAARqxUserdataValid Bit(1) /* Userdata was specified on  01172000
*                                      the ISGENQ request and           01173000
*                                      ANSDETAIL=FULL3 was specified on 01174000
*                                      this ISGQUERY request.           01175000
*                                      This bit is only valid if        01176000
*                                      ISGYQUAARqMisc64Valid is set.    01177000
*                                      If Userdata was expected for     01178000
*                                      this requester, and              01179000
*                                      ISGYQUAARqMisc64Valid is set,    01180000
*                                      but this bit is off, one of the  01181000
*                                      following conditions is true:    01182000
*                                      1)GRS is operating in STAR mode, 01183000
*                                      this resource is global, and the 01184000
*                                      ISGQUERY request specified       01185000
*                                      GATHERFROM=SYSPLEX. If the       01186000
*                                      resource request originated on   01187000
*                                      the current system, issue        01188000
*                                      another ISGQUERY specifying      01189000
*                                      GATHERFROM=SYSTEM to obtain the  01190000
*                                      Userdata.                        01191000
*                                      2) The                           01192000
*                                      ISGYQUAARqxUserdataOmitted bit   01193000
*                                      is set. See the declaration for  01194000
*                                      details.                  @P9C*/ 01195000
*      ,5 ISGYQUAARqxUserdataOmitted Bit(1) /* Userdata was specified   01196000
*                                      on the ISGENQ request and        01197000
*                                      ANSDETAIL=FULL3 was specified on 01198000
*                                      this ISGQUERY request, however,  01199000
*                                      there was not enough room in the 01200000
*                                      answer area to return the        01201000
*                                      userdata. Allocate a larger      01202000
*                                      answer area space. Use the       01203000
*                                      following formula to determine   01204000
*                                      the amount of storage needed:    01205000
*                                      (ISGYQUAA_kQScanMinFull3AnsLen + 01206000
*                                      ISGYQUAARqxUserdataLen -         01207000
*                                      ISGYQUAAUserDataInitialLen)      01208000
*                                                                @L4A*/ 01209000
*    ,3 *                   Char(2) /* Reserved                      */ 01210000
*    ,3 ISGYQUAARqxRequesterData                                        01211000
*      ,5 ISGYQUAARqxAsid   Fixed(16) /* ASID of ENQ requester       */ 01212000
*      ,5 ISGYQUAARqxSToken   Char(8) /* SToken of requester. Only      01213000
*                                      valid if ISGYQUAARqMisc64Valid   01214000
*                                      is set.                       */ 01215000
*      ,5 ISGYQUAARqxTToken   Char(16) /* TToken of requester. Only     01216000
*                                      valid if ISGYQUAARqMisc64Valid   01217000
*                                      is set.                       */ 01218000
*      ,5 ISGYQUAARqxJobName  Char(8) /* Job name of requester       */ 01219000
*      ,5 ISGYQUAARqxSysName  Char(8) /* System name of requester    */ 01220000
*    ,3 ISGYQUAARqxMTcb     Ptr(31) /* Matching task TCB (MTCB)         01221000
*                                      specified by requester.          01222000
*                                      Valid only if                    01223000
*                                      ISGYQUAARqxMatchingTask is set*/ 01224000
*    ,3 ISGYQUAARqxMAsid  Fixed(16) /* Matching task ASID (MASID)       01225000
*                                      specified by requester.          01226000
*                                      Valid only if                    01227000
*                                      ISGYQUAARqxMatchingTask is set*/ 01228000
*    ,3 ISGYQUAARqxServiceAsid Fixed(16) /* ASID of the task for which  01229000
*                                      a service PROVIDER performed     01230000
*                                      this ENQ request.                01231000
*                                      If ISGYQUAARqxServiceAsidValid   01232000
*                                      is set then ISGYQUAARqxAsid      01233000
*                                      is the ASID of the               01234000
*                                      service PROVIDER and             01235000
*                                      ISGYQUAARqServiceAsid            01236000
*                                      is the ASID of the service       01237000
*                                      REQUESTER.                       01238000
*                                      If ISGYQUAARqxServiceAsid is     01239000
*                                      zero, the service REQUESTER's    01240000
*                                      ASID is not available         */ 01241000
*    ,3 ISGYQUAARqxEcb      Ptr(31) /* ECB address if                   01242000
*                                      ISGYQUAARqxECBRequest is set  */ 01243000
*      ,5 ISGYQUAARqxSvrb   Ptr(31) /* SVRB address if                  01244000
*                                      ISGYQUAARqxECBRequest is zero */ 01245000
*    ,3 ISGYQUAARqxUcb      Ptr(31) /* Final UCB address if request     01246000
*                                      was for a device reserve on      01247000
*                                      this system for a three-digit    01248000
*                                      device-number device.            01249000
*                                      Otherwise, arithmetic zero.      01250000
*                                      Note that if                     01251000
*                                      ISGYQUAARqReserveConverted is    01252000
*                                      set the device was not reserved  01253000
*                                                                @P3C*/ 01254000
*    ,3 ISGYQUAARqxDeviceNum Char(4) /* If the request was for a device 01255000
*                                      reserve from the current system  01256000
*                                      then this field contains the     01257000
*                                      EBCDIC device number of the      01258000
*                                      the target of the reserve,       01259000
*                                      Otherwise it is arithmetic zero  01260000
*                                                                @P3C*/ 01261000
*    ,3 *                   Char(4) /* Reserved                      */ 01262000
*    ,3 ISGYQUAARqxOrigQName Char(8) /* Original QName specified on     01263000
*                                      request. Only valid              01264000
*                                      if ISGYQUAARqxOrigQNameValid     01265000
*                                      and ISGYQUAARqMisc64Valid        01266000
*                                      are set.                  @L1C*/ 01267000
*    ,3 ISGYQUAARqxOrigRName Ptr(64) /* Address of original RName       01268000
*                                      specified on request. Only valid 01269000
*                                      if ISGYQUAARqxOrigRNameValid     01270000
*                                      and ISGYQUAARqMisc64Valid        01271000
*                                      are set.                  @L1C*/ 01272000
*      ,5 *                 Char(4) /* First word of 64-bit field    */ 01273000
*      ,5 ISGYQUAARqxOrigRName31 Ptr(31) /* Value of                    01274000
*                                      ISGYQUAARqxOrigRName             01275000
*                                      for AMODE 31 callers          */ 01276000
*    ,3 ISGYQUAARqxOrigUCB@ Ptr(31) /* Original UCB@ specified on       01277000
*                                      request if the UCB address was   01278000
*                                      changed by a dynamic exit.       01279000
*                                      Note that a reserve conversion   01280000
*                                      does not change the UCB@, but    01281000
*                                      causes the device reserve        01282000
*                                      request to be ignored.           01283000
*                                      Only valid if                    01284000
*                                      if ISGYQUAARqxOrigUCB@Valid      01285000
*                                      and ISGYQUAARqMisc64Valid        01286000
*                                      are set.                  @L1C*/ 01287000
*    ,3 ISGYQUAARqxOrigRNameLen Fixed(8) /* Length of original RName    01288000
*                                      specified on request. Only valid 01289000
*                                      if ISGYQUAARqxOrigRNameValid     01290000
*                                      and ISGYQUAARqMisc64Valid        01291000
*                                      are set.                  @L1C*/ 01292000
*    ,3 ISGYQUAARqxOrigScope Fixed(8) /* Original scope specified on    01293000
*                                      request. One of either           01294000
*                                      ISGYQUAA_kSTEP,                  01295000
*                                      ISGYQUAA_kSYSTEM, or             01296000
*                                      ISGYQUAA_kSYSPLEX.               01297000
*                                      Only valid if                    01298000
*                                      if ISGYQUAARqxOrigScopeValid     01299000
*                                      and ISGYQUAARqMisc64Valid        01300000
*                                      are set.                  @L1C*/ 01301000
*    ,3 ISGYQUAARqxUserdataLen fixed(16) /* Length of Userdata          01302000
*                                      specified on request. Only valid 01303000
*                                      if ISGYQUAARqxUserdataValid and  01304000
*                                      ISGYQUAARqMisc64Valid are set.   01305000
*                                                                @L4A*/ 01306000
*    ,3 ISGYQUAARqxUserData Ptr(64) /* Address of userdata specified    01307000
*                                      on request. Only valid           01308000
*                                      if ISGYQUAARqxUserdataValid      01309000
*                                      and ISGYQUAARqMisc64Valid        01310000
*                                      are set.                         01311000
*                                      Note: The length,                01312000
*                                      ISGYQUAARqxUserdataLen, should   01313000
*                                      always be used when accessing    01314000
*                                      the userdata, as its length may  01315000
*                                      change in the future      @L4A*/ 01316000
*      ,5 *                 Char(4) /* First word of 64-bit field    */ 01317000
*      ,5 ISGYQUAARqxUserData31 Ptr(31) /* Value of                     01318000
*                                      ISGYQUAARqxUserData              01319000
*                                      for AMODE 31 callers      @L4A*/ 01320000
*    ,3 *        Char(0) Bdy(DWORD) /* Reserved                      */ 01321000
*   ;                                                                   01322000
*                                                                       01323000
* DCL                                                                   01324000
*   1 ISGYQUAARqxFull2 type         /* Rqx of ANSDETAIL=FULL2    @L3A*/ 01325000
*    ,3 ISGYQUAARqxFull2Full isa(ISGYQUAARqxBase) /* Rqx detail from    01326000
*                                      ANSDETAIL=FULL.           @L3A*/ 01327000
*    ,3 ISGYQUAARqxENQTime Char(16) /* This is the time, in extended    01328000
*                                      TOD format, of when the ENQ      01329000
*                                      request was originally made.     01330000
*                                      Only valid if                    01331000
*                                      ISGYQUAARqMisc64Valid is set.    01332000
*                                                                @P8C*/ 01333000
*    ,3 *                   Char(16) /* Reserved                 @L3A*/ 01334000
*   ;                                                                   01335000
*                                                                       01336000
* DCL                                                                   01337000
*   1 ISGYQUAARqx type            /* Requester Data Record Extension */ 01338000
*    ,3 ISGYQUAARqxMax isa(ISGYQUAARqxFull2)/* The max len map   @L3A*/ 01339000
*   ;                                                                   01340000
*                                                                       01341000
*  /* ISGYQUAARQX Constants                                         */  01342000
* DCL                                                                   01343000
*   ISGYQUAARqx_kMaxVersion Fixed(16) Constant(ISGYQUAARqx_kVersion2)   01344000
*  ,ISGYQUAARqx_kHBB7709    Fixed(16) Constant(ISGYQUAARqx_kVersion1)   01345000
*  ,ISGYQUAARqx_kHBB7740    Fixed(16) Constant(ISGYQUAARqx_kVersion2)   01346000
*  ,ISGYQUAARqx_kVersion1   Fixed(16) Constant(1)                       01347000
*  ,ISGYQUAARqx_kVersion2   Fixed(16) Constant(2)                       01348000
*   ;                                                         /* @P8C*/ 01349000
*                                                                       01350000
*  /*****************************************************************   01351000
*   *                                                                   01352000
*   * ISGYQUAA System Data                                              01353000
*   *   (Only relevant for REQINFO=ENQSTATS)                            01354000
*   *                                                                   01355000
*   *********************************************************** @L2A*/  01356000
*                                                                       01357000
* DCL                                                                   01358000
*   1 ISGYQUAASysBase type          /* Base REQINFO=ENQSTATS system     01359000
*                                      data                      @L3C*/ 01360000
*    ,3 ISGYQUAASysVersion fixed(16)/* ISGYQUAASys version       @L2A*/ 01361000
*    ,3 ISGYQUAASysFlags1 bit(8)    /* First Flags byte          @L2A*/ 01362000
*      ,5 ISGYQUAASysAuthorized bit(1) /* Indicates whether this block  01363000
*                                      refers to the authorized or      01364000
*                                      unauthorized counts       @L2A*/ 01365000
*    ,3 * char(5)                   /* Reserved                  @L2A*/ 01366000
*    ,3 ISGYQUAASysNext ptr(64)     /* Address of next system record    01367000
*                                      returned                  @L2A*/ 01368000
*      ,5 * char(4)                 /* First word of 64-bit field@L2A*/ 01369000
*      ,5 ISGYQUAASysNext31 ptr(31) /* Value of ISGYQUAASysNext         01370000
*                                      for AMODE 31 callers      @L2A*/ 01371000
*    ,3 ISGYQUAASysSp ptr(64)       /* Address of address-space         01372000
*                                      specific data (the               01373000
*                                      ISGYQUAASysAuthorized flag       01374000
*                                      applies to it as well)    @L2A*/ 01375000
*      ,5 * char(4)                 /* 1st word of 64-bit field  @L2A*/ 01376000
*      ,5 ISGYQUAASysSp31 ptr(31)   /* Value of ISGYQUAASysSp           01377000
*                                      for AMODE 31 callers      @L2A*/ 01378000
*    ,3 ISGYQUAASysPeakENQData char(8) bdy(dword)             /* @L2A*/ 01379000
*      ,5 ISGYQUAASysPeakENQCount fixed(31) /* Peak ENQ count of        01380000
*                                      requesters for any address       01381000
*                                      space for the life of the        01382000
*                                      system                    @L2A*/ 01383000
*      ,5 ISGYQUAASysPeakENQASID fixed(16) /* ASID associated with      01384000
*                                      with the overall peak for ENQ    01385000
*                                      requests.  Note that ASIDs are   01386000
*                                      reusable and the address space   01387000
*                                      may not still be active.  @L2A*/ 01388000
*      ,5 * char(2)                 /* unused                    @L2A*/ 01389000
*    ,3 ISGYQUAASysENQMax fixed(31) /* System-wide maximum limit of     01390000
*                                      ENQs from any one address space  01391000
*                                                                @L2A*/ 01392000
*    ,3 * char(4)                   /* unused                    @L2A*/ 01393000
*    ,3 * char(0) bdy(dword)        /*                           @L2A*/ 01394000
*   ;                                                                   01395000
*                                                                       01396000
* DCL                                                                   01397000
*   1 ISGYQUAASys type              /* REQINFO=ENQSTATS system          01398000
*                                      data                      @L3A*/ 01399000
*    ,3 ISGYQUAASysMax isa(ISGYQUAASysBase)/* The max length map @L3A*/ 01400000
*    ;                                                                  01401000
*                                                                       01402000
*  /* ISGYQUAASys Constants                                      @L2A*/ 01403000
* dcl                                                                   01404000
*   ISGYQUAASys_kMaxVersion fixed(16) constant(ISGYQUAASys_kVersion1)   01405000
*  ,ISGYQUAASys_kHBB7730 fixed(16) constant(ISGYQUAASys_kVersion1)      01406000
*  ,ISGYQUAASys_kVersion1 fixed(16) constant(1)                         01407000
*  ;                                                          /* @L3C*/ 01408000
*                                                                       01409000
*  /*****************************************************************   01410000
*   *                                                                   01411000
*   * ISGYQUAA Address Space Data                                       01412000
*   *   (Only relevant for REQINFO=ENQSTATS)                            01413000
*   *                                                                   01414000
*   *********************************************************** @L2A*/  01415000
*                                                                       01416000
* DCL                                                                   01417000
*   1 ISGYQUAASpBase type           /* Base REQINFO=ENQSTATS address    01418000
*                                      space specific data       @L3C*/ 01419000
*    ,3 ISGYQUAASpVersion Fixed(16) /* ISGYQUAASp version        @L2A*/ 01420000
*    ,3 * char(2)                   /* Reserved                  @L2A*/ 01421000
*    ,3 ISGYQUAASpCurrENQCount fixed(31) /* Current ENQ count for       01422000
*                                      the specified address space      01423000
*                                                                @L2A*/ 01424000
*    ,3 ISGYQUAASpPeakENQCount fixed(31) /* Peak ENQ count of           01425000
*                                      requesters for the life of the   01426000
*                                      specified address space.  @L2A*/ 01427000
*    ,3 ISGYQUAASpENQMax fixed(31)  /* If non-zero, the address-        01428000
*                                      space specific maximum number    01429000
*                                      of ENQs, set via ISGADMIN.       01430000
*                                      If zero, none exists and the     01431000
*                                      system maximum is used.   @L2A*/ 01432000
*    ,3 * char(0) bdy(dword)        /*                           @L2A*/ 01433000
*   ;                                                                   01434000
*                                                                       01435000
* DCL                                                                   01436000
*   1 ISGYQUAASp type               /* REQINFO=ENQSTATS address space   01437000
*                                      specific data             @L3A*/ 01438000
*    ,3 ISGYQUAASpMax isa(ISGYQUAASpBase) /* The max length map  @L3A*/ 01439000
*    ;                                                                  01440000
*                                                                       01441000
*  /* ISGYQUAASp Constants                                       @L2A*/ 01442000
* dcl                                                                   01443000
*   ISGYQUAASp_kMaxVersion fixed(16) constant(ISGYQUAASp_kVersion1)     01444000
*  ,ISGYQUAASp_kHBB7730    fixed(16) constant(ISGYQUAASp_kVersion1)     01445000
*  ,ISGYQUAASp_kVersion1   fixed(16) constant(1)                        01446000
*   ;                                                         /* @L3C*/ 01447000
*                                                                       01448000
* DCL                                                                   01449000
*   ISGYQUAAUserData char(*) type;  /* UserData returned with           01450000
*                                      ISGQUERY REQINFO=QSCAN and       01451000
*                                      ANSDETAIL=FULL3           @L4A*/ 01452000
*                                                                       01453000
* DCL                                                                   01454000
*   ISGYQUAAUserData_kInitialLen fixed(16) constant(32); /* The initial 01455000
*                                      length of ISGYQUAAUserdata       01456000
*                                                                @L4A*/ 01457000
*/* End of PL/X Source                                               */ 01458000
*/* End of PL/X Source                                               */ 01459000
* %IF ISGYQUAA_LIST = 'NO' !                                            01460000
*    ZCBPRINT = 'NO' %THEN                                              01461000
* %DO;                                                                  01462000
*   @LIST POP NOECHO;                                                   01463000
* %END;                                                                 01464000
* %END;                                                                 01465000
