          MACRO                                                                 
          IST6MCER &NO,&PARM1,&PARM2,&PARM3                                     
.*                                                                              
.* /***** START OF SPECIFICATIONS ************************************/         
.* /*                                                                */         
.* /*  MACRO NAME: IST6MCER                                          */         
.* /*                                                                */         
.* /*  DESCRIPTIVE NAME: ERROR MESSAGE MACRO                         */         
.* /*                                                                */         
.* /*  COPYRIGHT: LICENSED MATERIALS - PROPERTY OF IBM               */         
.* /*                                                                */         
.* /*             THIS PRODUCT CONTAINS "RESTRICTED MATERIALS OF IBM"*/         
.* /*                                                                */         
.* /*             5685-085 (C) COPYRIGHT IBM CORP. 1987, 1991.       */         
.* /*             ALL RIGHTS RESERVED.                               */         
.* /*                                                                */         
.* /*             U.S. GOVERNMENT USERS RESTRICTED RIGHTS -          */         
.* /*             USE, DUPLICATION OR DISCLOSURE RESTRICTED BY       */         
.* /*             GSA ADP SCHEDULE CONTRACT WITH IBM CORP.           */         
.* /*                                                                */         
.* /*             SEE COPYRIGHT INSTRUCTIONS.                        */         
.* /*                                                                */         
.* /*                                                                */         
.* /*  FUNCTION:                                                     */         
.* /*      GENERATES ERROR MESSAGE FOR APPCCMD MACRO                 */         
.* /*                                                                */         
.* /*  NOTES:                                                        */         
.* /*                                                                */         
.* /*  PROCESSOR: ASSEMBLER                                          */         
.* /*                                                                */         
.* /*  CREATED BY:                                                   */         
.* /*                                                                */         
.* /*  INTERNAL MACROS: NONE                                         */         
.* /*                                                                */         
.* /*  EXTERNAL REFERENCES: NONE                                     */         
.* /*                                                                */         
.* /*  CHANGE ACTIVITY:                                              */         
.* /*                                                                */         
.* /*  $MAC(IST6MCER),COMP(API),PROD(VTAM): ERROR MESSAGE MACRO      */         
.* /*                                                                */         
.* /*  FLAG REASON   RELEASE DATE   ORIGIN  FLAG DESCRIPTORS         */         
.* /*  ---- -------- ------- ------ ------  ---------------------    */         
.* /*  $BB= ACC@@AMS HVT3401 891025 615520: PL/AS CONVERSION         */         
.* /*  $D1= ID@@@MST FPAPI   950310 879315: Add BOTH/NEITHER message */         
.* /*                                                                */         
.* /***** END OF SPECIFICATIONS **************************************/         
.*                                                                              
.* A-000000-999999                                             @R495810         
.*                                                                              
         GBLB  &ISTER                                                           
         AIF   (&ISTER EQ 1).ERSTART                                            
*                                                                               
*  COPYRIGHT: LICENSED MATERIALS - PROPERTY OF IBM                              
*                                                                               
*             THIS PRODUCT CONTAINS "RESTRICTED MATERIALS OF IBM"               
*                                                                               
*             5685-085 (C) COPYRIGHT IBM CORP. 1987, 1991.                      
*             ALL RIGHTS RESERVED.                                              
*                                                                               
*             U.S. GOVERNMENT USERS RESTRICTED RIGHTS -                         
*             USE, DUPLICATION OR DISCLOSURE RESTRICTED BY                      
*             GSA ADP SCHEDULE CONTRACT WITH IBM CORP.                          
*                                                                               
*             SEE COPYRIGHT INSTRUCTIONS.                                       
*                                                                               
&ISTER   SETB  1                                                                
.ERSTART ANOP                                                                   
         AIF   (&NO EQ 1).MSG1                                                  
         AIF   (&NO EQ 2).MSG2                                                  
         AIF   (&NO EQ 3).MSG3                                                  
         AIF   (&NO EQ 4).MSG4                                                  
         AIF   (&NO EQ 5).MSG5                                                  
         AIF   (&NO EQ 6).MSG6                                                  
         AIF   (&NO EQ 7).MSG7                                                  
         AIF   (&NO EQ 8).MSG8                                                  
         AIF   (&NO EQ 9).MSG9                                                  
         AIF   (&NO EQ 10).MSG10                                                
         AIF   (&NO EQ 11).MSG11                                                
         AIF   (&NO EQ 12).MSG12                                                
         AIF   (&NO EQ 13).MSG13                                   @D1A         
.MSG0    MNOTE 4,'***APPC000 INVALID MNOTE MESSAGE REQUEST'                     
         MEXIT                                                                  
.MSG1    MNOTE 12,'***APPC001 &PARM1.= IS NOT SPECIFIED, NO MACRO EXPANX        
               SION INSTRUCTION WILL BE GENERATED'                              
         MEXIT                                                                  
.MSG2    MNOTE 12,'***APPC002 &PARM1.= &PARM2 IS NOT A VALID PARAMETER,X        
                NO MACRO EXPANSION INSTRUCTION WILL BE GENERATED'               
         MEXIT                                                                  
.MSG3    MNOTE 4,'***APPC003 PARAMETER &PARM1 CAN NOT BE SPECIFIED BY RX        
               EGISTER NOTATION - IGNORED'                                      
         MEXIT                                                                  
.MSG4    MNOTE 4,'***APPC004 &PARM1.= &PARM2 AND &PARM3 CONFLICT, BOTH X        
               DISREGARDED. PREVIOUS VALUE IN CONTROL BLOCK WILL BE USEX        
               D'                                                               
         MEXIT                                                                  
.MSG5    MNOTE 4,'***APPC005 &PARM1.= &PARM2 IS NOT A VALID PARAMETER VX        
               ALUE - IGNORED'                                                  
         MEXIT                                                                  
.MSG6    MNOTE 4,'***APPC006 &PARM1 IS NOT A VALID PARAMETER FOR &PARM3X        
               .= &PARM2'                                                       
         MEXIT                                                                  
.MSG7    MNOTE 4,'***APPC007 POSITIONAL PARAMETERS HAVE BEEN DETECTED. X        
               THEY WILL BE IGNORED'                                            
         MEXIT                                                                  
.MSG8    MNOTE 4,'***APPC008 &PARM1 CAN BE SPECIFIED BY REGISTER NOTATIX        
               ON ONLY'                                                         
         MEXIT                                                                  
.MSG9    MNOTE 4,'***APPC009 ECB AND EXIT MUTUALLY EXCLUSIVE; INTERNAL X        
               ECB ASSUMED'                                                     
         MEXIT                                                                  
.MSG10   MNOTE 4,'***APPC010 THE LENGTH OF PARAMETER &PARM1 IS LARGER TX        
               HAN &PARM2 BYTES'                                                
         MEXIT                                                                  
.MSG11   MNOTE 4,'***APPC011 INVALID DATA TYPE FOR &PARM1 - IGNORED'            
         MEXIT                                                                  
.MSG12   MNOTE 4,'***APPC012 UNBALANCED PARENTHESES OR APOSTROPHES FOR X        
               &PARM1.='                                                        
         MEXIT                                                     @D1A         
.MSG13   MNOTE 4,'***APPC013 KEYWORDS &PARM1. AND &PARM2. ARE INTERDEPEX        
               NDENT, SPECIFY BOTH OR NEITHER - KEYWORDS IGNORED'  @D1A         
         MEND                                                                   
