*%GOTO   ACBEXTPL;                          /* SKIP THE COMMENTS    */          
* /******************************************************************/          
* /*                                                                */          
* /*                                                                */          
* /* COPYRIGHT: LICENSED MATERIALS - PROPERTY OF IBM                */          
* /*                                                                */          
* /*            THIS PRODUCT CONTAINS "RESTRICTED MATERIALS OF IBM" */          
* /*                                                                */          
* /*            5695-117 (C) COPYRIGHT IBM CORP. 1987, 2004.        */          
* /*            ALL RIGHTS RESERVED.                                */          
* /*                                                                */          
* /*            U.S. GOVERNMENT USERS RESTRICTED RIGHTS -           */          
* /*            USE, DUPLICATION OR DISCLOSURE RESTRICTED BY        */          
* /*            GSA ADP SCHEDULE CONTRACT WITH IBM CORP.            */          
* /*                                                                */          
* /*            SEE COPYRIGHT INSTRUCTIONS.                         */          
* /*                                                                */          
* /*     ACB VTAM EXTENSION                                         */          
* /*                                                                */          
* /*     THE EXTENSION DESCRIBES CONTROL DATA THAT ONLY VTAM USES.  */          
* /*     THE EXTENSION IS CALLED BY THE VSAM EXTENSION,     @ZA34940*/          
* /*     IFGACBVS, UNDER THE FOLLOWING CONDITI0NS:          @ZA34940*/          
* /*                                                                */          
* /*        PLS:  THE MODULE CONTAINING AN  INCLUDE FOR IFGACB      */          
* /*              SETS THE MACRO VARIABLE 'ACBRPLXL' TO 'VTAM'      */          
* /*              PRIOR TO ISSUING THE INCLUDE.                     */          
* /*        BAL:  THE AM=VTAM PARAMETER IS CODED ON THE IFGACB      */          
* /*              MACRO CALL.                                       */          
* /*                                                                */          
* /* CHANGE ACTIVITY                                                */          
* /*                                                                */          
* /*      CBMM SPLIT SUPPORT                                @ZA34940*/          
* /*      SNA4 SUPPORT                                      @G69AKJP*/          
* /*      SNA4 RETURN CODE SUPPORT                          @G70AKMP*/          
* /*      DCR  4790.00Z                                     @D5P4790*/          
* /*      DCR  4792 (CODE APPLIED IN DCRS 4790,4791         @D5K4792*/          
* /*      PTM  P008904                                      @P5K8904*/          
* /*      PTM  P011080                                      @P011080*/          
* /*      DCR  4879.13                                      @R487913*/          
* /*      PTM  P012903                                      @P012903*/          
* /*      DCR  4879.27  MAXAPPL HIT                         @R487927*/          
* /*      PTM  P044037                                      @P044037*/          
* /*                                                                */          
* /* $MAC(ISTACBEX),COMP(O/C),PROD(VTAM): ACB VTAM EXTENSION        */          
* /*                                                                */          
* /* FLAG REASON   RELEASE DATE   ORIGIN  FLAG DESCRIPTORS          */          
* /* ---- -------- ------- ------ ------  ------------------------- */          
* /* $F1= FB3@@CLD HVT3303 880321 013298: PARTNER LU VERIFICATION   */          
* /* $B1= AP@@@CLD HVT3401 890314 496698: PERSISTENT LU-LU SESSIONS */          
* /*                                      (PLUS)                    */          
* /* $B2= AA@@@MST HVT3401 891018 042845: CROSS-MEMORY API SUPPORT  */          
* /* $V1= P076950  HVT3401 891129 042845: COMMENT CHANGES           */          
* /* $01= OY48290  VM341   920623 576146: INSTANCE COUNTER          */          
* /* $KF= NQNSTG2  NQNAME2 910605 457572: ENHANCED NQN SUPPORT (2)  */          
* /* $KG= S7A@@CLD HATAPPN 910920 792173: MS TRANSPORT              */          
* /* $I1= FF@@@MST APPCFDX 911111 879315: APPC FULL-DUPLEX SUPPORT  */          
* /* $I2= FO@@@MST PERFMON 920427 043006: PERFORMANCE MONITOR       */          
* /* $I3= FMA@@MST APISYNC 920730 595229: Api Synchronization       */          
* /* $L1= FYJ@@PLD VTAGENT 921208 045209: VTAM Agent                */          
* /* $L2= KA@@@PLD APPCRR  930709 576146: DCE Security Services     */          
* /* $U2= P105579  KEEPFRR 931008 879315: New ACB keyword           */          
* /* $U3= P109285  KEEPFRR 931104 879315: Implement FZKDR001 -      */          
* /*                                      remove P105579 changes    */          
* /* $N1= P126308  POLARIS 970918 879315: EXITFRR= on ACB PARMS     */          
* /*                                                                */          
* /* Flag Reason   Release  Date   Origin    Description            */          
* /* ---- -------- -------- ------ --------  ---------------------- */          
* /* $R1= X16MNPRT CSV1R6   031006 GIERLACH: MNPS Predatory Takeover*/          
* /*                                                                */          
* /******************************************************************/          
* /*                                                                */          
*%ACBEXTPL: ;                                                                   
*             2 ACBVTEXT,                   /* START OF PLS MAPPING             
*                                              OF VTAM EXTENSION    */          
*              3 ACBRTN      CHAR(6),       /* LA 15,32                         
*                                              BR 14  (VTAM)  X03004*/          
*              3 ACBFLAGS    BIT(16),       /* ACB FLAGS        @B2C*/          
*                4 ACBOPT1     BIT(8),      /* ACB OPTION FLAGS @B2C*/          
*                  5 ACBKPFRR    BIT(1),    /* APPLICATION WANTS VTAM           
*                                              TO KEEP ITS FRR STACK            
*                                              INTACT OVER SYNCHRONOUS          
*                                              VTAM API CALL    @B2A*/          
*                  5 ACBSRBEX    BIT(1),    /* APPLICATION WANTS ITS            
*                                              EXITS DRIVEN UNDER AN            
*                                              SRB              @B2A*/          
*                  5 ACBSRBSP    BIT(1),    /* APPLICATION SPECIFIED            
*                                              "SRBMODE" ON ACB @B2A*/          
*                  5 ACBPLUSC    BIT(1),    /* PLUS CAPABLE                     
*                                              0-PERSIST=NO                     
*                                              1-PERSIST=YES    @B1A*/          
*                  5 ACBPSINS    BIT(1),    /* PERSISTENT RECOVERY OR           
*                                              TAKEOVER APPLICATION             
*                                              INSTANCE         @B1A*/          
*                  5 ACBNQNAM    BIT(1),    /* NETWORK QUALIFIED NAMES          
*                                              ARE SUPPORTED    @KFA*/          
*                  5 ACBNMMST    BIT(1),    /* NETWORK MANAGEMENT               
*                                              SUPPORTS MANAGEMENT              
*                                              SERVICES TRANSPORT               
*                                              FUNCTION         @KGA*/          
*                  5 ACBVFRR     BIT(1),    /* User wants VTAM FRR              
*                                              coverage         @I3C*/          
*                4 ACBOPT2     BIT(8),      /* ACB OPTION FLAGS @I1C*/          
*                                                                               
*                  5 ACBAFDX     BIT(1),    /* APPLICATION SUPPORTS             
*                                              APPC FULL-DUPLEX @I1A*/          
*                  5 ACBPFMON    BIT(1),    /* APPLICATION SPECIFIED            
*                                              PERFMON=YES      @I2A*/          
*                  5 ACBCMIP     BIT(1),    /* APPL USES CMIP AGENT             
*                                                               @L1A*/          
*                  5 ACBEXFRR    BIT(1),    /* APPLICATION SPECIFIED            
*                                              EXITFRR=YES      @N1A*/          
*                  5 ACBFRCTO    BIT(1),    /* Application specified            
*                                              FORCETKO=YES     @R1A*/          
*                  5 *           BIT(3),    /* NOT USED - AVAILABLE             
*                                                               @R1C*/          
*              3 *           PTR(31),       /* RESERVED - NOT                   
*                                              AVAILABLE    @G69AKJP*/          
*              3 ACBTNIB     PTR(31),       /* POINTER TO NIB                   
*                                                           @P011080*/          
*              3 ACBAMSVL    PTR(31),       /* POINTER TO AMSI                  
*                                                           @D5P4790*/          
*              3 ACBRIVL     PTR(31),       /* POINTER TO RIVL                  
*                                                           @D5P4790*/          
*              3 ACBUSER     PTR(31),       /* USER FIELD   @D5P4790*/          
*              3 ACBAVPTR    PTR(31);       /* POINTER TO APPLICATION           
*                                              VECTOR           @L2A*/          
*     DCL 1    ACBACDEX DEFINED(ACBDEB)                                         
*                FIXED(24),                 /* VTAM OVERLAY OF ACBDEB           
*                                              - INDEX INTO VTAM                
*                                              ACDEB TABLE  @P012903*/          
*              2 ACBICTR  FIXED(8),         /* INSTANCE COUNTER                 
*                                                      @R487929 @01C*/          
*              2 ACBDEBI1 FIXED(8),         /* INDEX INTO ISTDEBX1              
*                                              TABLE        @R487929*/          
*              2 ACBDEBI2 FIXED(8);         /* INDEX INTO ISTDEBX2              
*                                              TABLE        @R487929*/          
*     DCL      ISTACB BASED(ADDR(IFGACB))   /* ISTACB LENGTH  X03004*/          
*                           CHAR(LENGTH(IFGACB));                               
*%/* VTAM ACBERFLG CODES                                      X03004*/          
*                  ACBNORM  = '''00''X';    /* NORMAL END   @Z40BHUC*/          
*                % ACBONVRT = '''14''X';    /* NO VIRTUAL MEMORY FOR            
*                                              CONTROL BLOCKS OR WORK           
*                                              AREAS(VTAM)    X03004*/          
*                % ACBCAQNR = '''40''X';    /* OUTSTANDING ACQUIRES             
*                                              NOT RELEASED(VTAM)               
*                                                             X03004*/          
*                % ACBCDSNR = '''42''X';    /* DESTINATIONS NOT                 
*                                              RELEASED(VTAM) X03004*/          
*                % ACBRNOCF = '''4C''X';    /* CLOSE FAILED, POI QUEUE          
*                                              NOT EMPTY OR REPLIES             
*                                              OUTSTANDING  @Z40BHUC*/          
*                % ACBOANAT = '''50''X';    /* VTAM NOT ACTIVE                  
*                                                             X03004*/          
*                % ACBOAHLT = '''52''X';    /* VTAM ACTIVE BUT                  
*                                              HALTING        X03004*/          
*                % ACBOAVFY = '''54''X';    /* APPLICATION VERIFICA-            
*                                              TION FAILED(VTAM)                
*                                                             X03004*/          
*                % ACBOANSN = '''56''X';    /* NON-APPLICATION ID               
*                                              NAME SPECIFIED(VTAM)             
*                                                             X03004*/          
*                % ACBOAPAA = '''58''X';    /* APPLICATION ACTIVE               
*                                              ALREADY(VTAM)  X03004*/          
*                % ACBOAPNM = '''5A''X';    /* NO MATCHING APPLICA-             
*                                              TION ID ENTRY(VTAM)              
*                                                             X03004*/          
*                % ACBOVINA = '''5C''X';    /* VTAM IN SYSTEM BUT               
*                                              NOT ACTIVE     X03004*/          
*                % ACBOAPSE = '''5E''X';    /* APPLICATION ID NOT IN            
*                                              REQUESTOR'S SPACE                
*                                              (VTAM)         X03004*/          
*                % ACBOUNDF = '''60''X';    /* INTERMITTENT                     
*                                              ERROR(VTAM)    X03004*/          
*                % ACBOAPLE = '''62''X';    /* APPLICATION ID LENGTH            
*                                              NOT VALID(VTAM)X03004*/          
*                % ACBOPWSE = '''64''X';    /* PASSWORD NOT IN RE-              
*                                              QUESTOR SPACE(VTAM)              
*                                                             X03004*/          
*                % ACBOPWLE = '''66''X';    /* PASSWORD LENGTH                  
*                                              INVALID(VTAM)  X03004*/          
*                % ACBRNOOF = '''68''X';    /* OPEN FAILS BECAUSE A             
*                                              PRIMARY POA ISSUED AN            
*                                              OPEN ACB BUT ANOTHER             
*                                              PRIMARY POA IS CURRENTLY         
*                                              ACTIVE       @Z40BHUC*/          
*                % ACBOAVSE = '''6A''X';    /* APPLICATION VECTOR NOT           
*                                              IN REQUESTOR'S SPACE             
*                                              (VTAM)           @L2A*/          
*                % ACBOAVLE = '''6C''X';    /* APPLICATION VECTOR               
*                                              LENGTH INVALID (VTAM)            
*                                                               @L2A*/          
*                % ACBTVTCL = '''70''X';    /* VTAM CLEANUP IN PROCESS          
*                                              FOR REQUESTED APPLID             
*                                                           @Z40BHUC*/          
*                % ACBESME  = '''72''X';    /*EXTERNAL SECURITY                 
*                                             MANAGER ERROR     @F1A*/          
*                % ACBOPSNE = '''74''X';    /* ACB ALREADY OPEN, TAKE-          
*                                              OVER BY ALTERNATE FAILED         
*                                              BECAUSE PERSISTENCE NOT          
*                                              ENABLED          @B1A*/          
*                % ACBOPSNC = '''76''X';    /* ACB ALREADY OPEN,                
*                                              RECOVERING APPL MUST BE          
*                                              CAPABLE OF PERSISTENCE           
*                                                               @B1A*/          
*                % ACBOPSMM = '''78''X';    /* OPEN MISMATCH BETWEEN            
*                                              RECOVERY AND FAILED              
*                                              APPLICATION - OPEN ACB           
*                                              FAILED      @B1A @I2C*/          
*                % ACBMOPEN = '''7A''X';    /* MONITOR ACB ALREADY              
*                                              OPEN - ONLY ONE MONITOR          
*                                              APPLICATION ACB MAY BE           
*                                              OPEN             @I2A*/          
*                % ACBSTONP = '''7C''X';    /* Active application does          
*                                              not accept SNPS take-            
*                                              over requests    @R1A*/          
*                % ACBNAUTH = '''8C''X';    /* MONITOR APPLICATION              
*                                              NOT CNM OR POA                   
*                                              AUTHORIZED       @I2A*/          
*                                                                               
*                % ACBOACT  = '''BC''X';    /* ACB ACTIVE     X03004*/          
*                % ACBCBUSY = '''BC''X';    /* ACB BUSY       X03004*/          
*                % ACBTANAE = '''F4''X';    /* APPL NOT AUTHORIZED  */          
*                % ACBTNBSE = '''F6''X';    /* INVALID NIB STORAGE              
*                                                           @G70AKMP*/          
*                % ACBTNBOE = '''FA''X';    /* INVALID NIB OPTIONS              
*                                                           @G70AKMP*/          
*                % ACBTRTTE = '''FE''X';    /* DUPLICATE UNSOLICITED            
*                                              RU ROUTING REQUESTED             
*                                                           @G70AKMP*/          
*        %INCLUDE SYSLIB(ISTGLBAL);         /* INCLUDE AMSI GLOBALS */          
*                                           /* MACRO        @P5K8904*/          
*        %GOTO ACBEND;                      /* GO TO END OF MACRO   */          
* /*                                                                            
*                    ASSEMBLER DSECT FOR ACB VTAM EXTENSION                     
*                                                                   *           
         MACRO                                                                  
         ISTACBEX                                                               
ACBRTN   DS    XL6                             IF VTAM IS INACTIVE,             
*                                              ACBINRTN CONTAINS A              
*                                              POINTER TO ACBRTN AT             
*                                              OFFSET 76(X'4C') TO SET          
*                                              A RETURN CODE AND RETURN         
*                                              TO THE CALLER. THE               
*                                              FIRST FOUR BYTES CONTAIN         
*                                              X'41F00020' (LA 15,32);          
*                                              THE LAST TWO BYTES               
*                                              CONTAIN X'07FE' (BR 14)          
*                                                                X03004         
ACBFLAGS DS    0XL2                            ACB FLAGS           @B2A         
ACBOPT1  DS    XL1                             ACB OPTION FLAGS    @B2A         
ACBKPFRR EQU   X'80'                           APPL WANTS VTAM TO               
*                                              KEEP ITS FRR STACK  @B2A         
ACBSRBEX EQU   X'40'                           APPLICATION WANTS ITS            
*                                              EXITS DRIVEN UNDER AN            
*                                              SRB                 @B2A         
ACBSRBSP EQU   X'20'                           APPLICATION SPECIFIED            
*                                              'SRBEXIT' ON ACB MACRO           
*                                                                  @V1A         
ACBPLUSC EQU   X'10'                           PLUS CAPABLE        @B1A         
*                                                                               
ACBPSINS EQU   X'08'                           PERSISTENT RECOVERY OR           
*                                              TAKEOVER APPLICATION             
*                                              INSTANCE            @B1A         
ACBNQNAM EQU   X'04'                           NETWORK QUALIFIED NAMES          
*                                              ARE SUPPORTED       @KFA         
ACBNMMST EQU   X'02'                           NETWORK MANAGEMENT               
*                                              SUPPORTS MANAGEMENT              
*                                              SERVICES TRANSPORT               
*                                              FUNCTION            @KGA         
ACBVFRR  EQU   X'01'                           User wants VTAM FRR              
*                                              coverage            @I3A         
*                                                                               
ACBOPT2  DS    XL1                             ACB OPTION FLAGS    @V1C         
*                                                                               
ACBAFDX  EQU   X'80'                           APPLICATION SUPPORTS             
*                                              APPC FULL-DUPLEX    @I1A         
ACBPFMON EQU   X'40'                           APPLICATION SPECIFIED            
*                                              PERFMON=YES         @I2A         
ACBCMIP  EQU   X'20'                           APPL USES CMIP AGENT@L1A         
ACBEXFRR EQU   X'10'                           APPLICATION SPECIFIED            
*                                              EXITFRR=YES         @N1A         
ACBFRCTO EQU   X'08'                           Application specified            
*                                              FORCETKO=YES        @R1A         
         DS    A                               RESERVED                         
ACBTNIB  DS    A                               NIB ADDRESS     @G69AKJP         
ACBAMSVL DS    A                               AMSI ADDRESS    @D5P4790         
ACBRIVL  DS    A                               RIVL ADDRESS    @D5P4790         
ACBUSER  DS    A                               USER FIELD      @D5P4790         
ACBAVPTR DS    A                               APPLICATION VECTOR               
*                                              ADDRESS             @L2A         
         ORG   ACBDEB                          VTAM OVERLAY OF ACBDEB  -        
                                                               @R487913         
ACBACDEX DS    FL3                             INDEX INTO VTAM         -        
                                               ACDEB TABLE     @R487913         
         ORG   ,                               RESTORE LOCATION        -        
                                               COUNTER         @R487913         
*              ACBERFLG ERROR CODES SPECIFIC TO VTAM             X03004         
ACBNORM  EQU   X'00'                           NORMAL END      @Z40BHUC         
ACBONVRT EQU   X'14'                           NO VIRTUAL MEMORY FOR            
*                                              CONTROL BLOCKS OR WORK           
*                                              AREAS(VTAM)       X03004         
ACBCAQNR EQU   X'40'                           OUTSTANDING ACQUIRES ARE         
*                                              NOT RELEASED(VTAM)X03004         
ACBCDSNR EQU   X'42'                           DESTINATIONS ARE NOT             
*                                              RELEASED(VTAM)    X03004         
ACBRNOCF EQU   X'4C'                           CLOSE FAILED, POI QUEUE          
*                                              NOT EMPTY OR REPLIES             
*                                              OUTSTANDING     @Z40BHUC         
ACBOANAT EQU   X'50'                           VTAM IS NOT ACTIVEX03004         
ACBOAHLT EQU   X'52'                           VTAM IS ACTIVE BUT               
*                                              HALTING           X03004         
ACBOAVFY EQU   X'54'                           APPLICATION VERIFICATION         
*                                              FAILED(VTAM)      X03004         
ACBOANSN EQU   X'56'                           A NON-APPLICATION ID             
*                                              NAME WAS SPECIFIED(VTAM)         
*                                                                X03004         
ACBOAPAA EQU   X'58'                           THE APPLICATION IS               
*                                              ACTIVE ALREADY(VTAM)             
*                                                                X03004         
ACBOAPNM EQU   X'5A'                           NO MATCHING APPLICATION          
*                                              ID ENTRY EXISTS(VTAM)            
*                                                                X03004         
ACBOVINA EQU   X'5C'                           VTAM IS IN THE SYSTEM            
*                                              BUT NOT ACTIVE    X03004         
ACBOAPSE EQU   X'5E'                           THE APPLICATION ID IS            
*                                              NOT IN REQUESTOR'S               
*                                              SPACE(VTAM)     @P044037         
ACBOUNDF EQU   X'60'                           INTERMITTENT ERROR(VTAM)         
*                                                                X03004         
ACBOAPLE EQU   X'62'                           THE APPLICATION ID               
*                                              LENGTH IS NOT                    
*                                              VALID(VTAM)       X03004         
ACBOPWSE EQU   X'64'                           THE PASSWORD IS NOT IN           
*                                              REQUESTOR'S SPACE(VTAM)          
*                                                                X03004         
ACBOPWLE EQU   X'66'                           THE PASSWORD LENGTH IS           
*                                              INVALID(VTAM)     X03004         
ACBRNOOF EQU   X'68'                           OPEN FAILS BECAUSE A             
*                                              PRIMARY POA ISSUED AN            
*                                              OPEN ACB BUT ANOTHER             
*                                              PRIMARY POA IS CURRENTLY         
*                                              ACTIVE          @Z40BHUC         
ACBOAVSE EQU   X'6A'                           APPLICATION VECTOR NOT           
*                                              IN REQUESTOR'S SPACE             
*                                              (VTAM)             @L2A          
ACBOAVLE EQU   X'6C'                           APPLICATION VECTOR               
*                                              LENGTH INVALID (VTAM)            
*                                                                 @L2A          
ACBTVTCL EQU   X'70'                           VTAM CLEANUP IN PROCESS          
*                                              FOR REQUESTED APPLIED            
*                                                             @Z40BHUC          
ACBESME  EQU   X'72'                           EXTERNAL SECURITY                
*                                              MANAGER ERROR       @F1A         
ACBOPSNE EQU   X'74'                           ACB ALREADY OPEN, TAKE-          
*                                              OVER BY ALTERNATE FAILED         
*                                              BECAUSE PERSISTENCE NOT          
*                                              ENABLED             @B1A         
ACBOPSNC EQU   X'76'                           ACB ALREADY OPEN,                
*                                              RECOVERING APPLICATION           
*                                              MUST BE CAPABLE OF               
*                                              PERSISTENCE         @B1A         
ACBOPSMM EQU   X'78'                           MACRF MISMATCH BETWEEN           
*                                              RECOVERY AND FAILED              
*                                              APPLICATION -                    
*                                              OPEN ACB FAILED     @B1A         
ACBMOPEN EQU   X'7A'                           MONITOR ACB ALREADY              
*                                              OPEN - ONLY ONE MONITOR          
*                                              APPLICATION ACB MAY BE           
*                                              OPEN                @I2A         
ACBSTONP EQU   X'7C'                           Active application does          
*                                              not accept SNPS take-            
*                                              over requests       @R1A         
ACBNAUTH EQU   X'8C'                           MONITOR APPLICATION NOT          
*                                              CNM OR POA AUTH     @I2A         
ACBOACT  EQU   X'BC'                           THE ACB IS ACTIVE X03004         
ACBCBUSY EQU   X'BC'                           THE ACB IS BUSY   X03004         
ACBTANAE EQU   X'F4'                           APPL NOT AUTHORIZED              
ACBTNBSE EQU   X'F6'                           INVALID NIB STORAGE              
*                                                             @G70AKMP          
ACBTNBOE EQU   X'FA'                           INVALID NIB OPTIONS              
*                                                             @G70AKMP          
ACBTRTTE EQU   X'FE'                           DUPLICATE UNSOLICITED            
*                                              RU ROUTING REQUESTED             
*                                                             @G70AKMP          
         ISTGLBAL ,                            INCLUDE AMSI GLOBALS             
*                                                             @P5K8904          
         MEND                                                                   
*        END OF ACB VTAM EXTENSION                                  */          
*%ACBEND: ;                                                                     
