*/********************************************************************/         
*/*                                                                  */         
*/*  MACRO-NAME: ISTBLXEN                                            */         
*/*                                                                  */         
*/*  MACRO-DESCRIPTIVE-NAME: EXTENDED BUFFER LIST ENTRY MAPPING MACRO*/         
*/*                                                                  */         
*/*  COPYRIGHT = LICENSED MATERIALS - PROPERTY OF IBM                */         
*/*                                                                  */         
*/*            THIS PRODUCT CONTAINS                                 */         
*/*            "RESTRICTED MATERIALS OF IBM"                         */         
*/*                                                                  */         
*/*            5685-085 (C) COPYRIGHT IBM CORP.                      */         
*/*            1996. ALL RIGHTS RESERVED.                            */         
*/*                                                                  */         
*/*            U.S. GOVERNMENT USERS RESTRICTED RIGHTS -             */         
*/*            USE, DUPLICATION OR DISCLOSURE RESTRICTED             */         
*/*            BY GSA ADP SCHEDULE CONTRACT WITH IBM CORP.           */         
*/*                                                                  */         
*/*            SEE COPYRIGHT INSTRUCTIONS.                           */         
*/*                                                                  */         
*/*  MACRO-FUNCTION: TO PROVIDE A BILINGUAL MAPPING FOR THE VTAM     */         
*/*                  EXTENDED BUFFER LIST ENTRY                      */         
*/*                                                                  */         
*/*  MACRO-NOTES: NONE                                               */         
*/*                                                                  */         
*/*  MACRO-LAST-CHANGED: AS FOLLOWS                                  */         
*/*                                                                  */         
*/*  $MAC(ISTBLXEN),COMP(API),PROD(VTAM): BUFFER LIST ENTRY          */         
*/*                                                                  */         
*/*  FLAG REASON   RELEASE DATE   ORIGIN  FLAG DESCRIPTORS           */         
*/*  ---- -------- ------- ------ ------  ----------------           */         
*/*  $D0= ID@@@MST FPAPI   941117 143576: Fastpath API fro APPC      */         
*/*  $S1= P119720  FPAPI   951113 510689: BLXEN_OWNACC to different  */         
*/*                                       offset                     */         
*/********************************************************************/         
*@LIST PUSH;                                                                    
*@LIST OFF;                                                                     
*                                   /* BILINGUAL HEADER                         
         MACRO                                                                  
         ISTBLXEN                                                               
ISTBLXEN DSECT                                                                  
BLXEN_CSM       DS    0CL28            THIS AREA MAPS THE CSM                   
*                                      BUFFER DESCRIPTOR                        
                DS    X                RESERVED.  THIS FIELD MUST BE            
*                                      SET TO ZERO.                             
BLXEN_SOURCE    DS    X                BUFFER SOURCE                            
BLXEN_CECSA     EQU   X'80'            INDICATES THAT THE STORAGE               
*                                      REFERENCED IN THE LIST IS                
*                                      CSM ECSA                                 
BLXEN_CDSPACE   EQU   X'40'            INDICATES THAT THE STORAGE               
*                                      REFERENCED IN THE LIST IS                
*                                      CSM DATA SPACE                           
BLXEN_TYPE      DS    X                BUFFER TYPE                              
BLXEN_FIXED     EQU   X'80'            INDICATES THAT THE STORAGE IS            
*                                      IN A GUARANTEED TO BE FIXED              
*                                      STATE                                    
BLXEN_PAGEABLE  EQU   X'40'            INDICATES THAT THE STORAGE IS            
*                                      IN A GUARANTEED TO BE PAGEABLE           
*                                      STATE                                    
BLXEN_PAGEELIG  EQU   X'20'            INDICATES THAT THE STORAGE               
*                                      IS ELIGIBLE TO BE PAGEFREED BY           
*                                      CSM                                      
                DS    XL1              RESERVED                                 
BLXEN_CTOKN     DS    XL12             CSM TOKEN                                
BLXEN_ALET      DS    F                CSM DATA SPACE ALET                      
BLXEN_AREA      DS    A                POINTER TO DATA                          
BLXEN_RLEN      DS    F                LENGTH OF DATA                           
BLXEN_RLENA     DS    F                LENGTH OF DATA ACCEPTED BY               
*                                      ... VTAM ON A REQUEST TO SEND            
*                                      ... DATA.                                
*                                      ... THIS FIELD SHOULD BE SET             
*                                      ... TO ZERO BY THE APPLICATION.          
*                                      ... VTAM SETS THIS FIELD                 
*                                      ... TO REFLECT THE AMOUNT OF             
*                                      ... DATA REFERENCED BY XBUFLST           
*                                      ... THAT HAS BEEN ACCEPTED BY            
*                                      ... VTAM.                                
BLXEN_VAFLAGS   DS    X                VTAM and APPL FLAGS                      
BLXEN_OWNACC    EQU   X'80'            VTAM HAS ACCEPTED OWNERSHIP              
*                                      OF THE CSM BUFFER                        
                DS    XL15             RESERVED                                 
         MEND ,                                                      */         
*@LIST POP;                                                                     
*                                                                               
*   DCL                                                                         
*     1 ISTBLXEN BDY(WORD) BASED,   /* EXTENDED BUFFER LIST ENTRY    */         
*       2 BLXEN_CSM CHAR(28) BDY(WORD), /* THIS AREA MAPS THE CSM               
*                                      BUFFER DESCRIPTOR             */         
*         3 *            CHAR(1),   /* RESERVED                      */         
*         3 BLXEN_SOURCE FIXED(8),  /* BUFFER SOURCE                 */         
*         3 BLXEN_TYPE   FIXED(8),  /* BUFFER TYPE                   */         
*         3 *            CHAR(1),   /* RESERVED                  @S1C*/         
*         3 BLXEN_CTOKN CHAR(12),   /* CSM TOKEN                     */         
*         3 BLXEN_ALET  FIXED(32),  /* CSM DATA SPACE ALET           */         
*         3 BLXEN_AREA PTR,         /* POINTER TO USER DATA          */         
*         3 BLXEN_RLEN FIXED,       /* LENGTH OF DATA                */         
*       2 BLXEN_RLENA FIXED,        /* LENGTH OF DATA ACCEPTED BY               
*                                      VTAM ON THE REQUEST.                     
*                                      THIS FIELD SHOULD BE SET TO              
*                                      ZERO BY THE APPLICATION.                 
*                                      VTAM SETS THIS FIELD                     
*                                      TO REFLECT THE AMOUNT OF                 
*                                      DATA REFERENCED BY XBUFLST               
*                                      THAT HAS BEEN ACCEPTED BY                
*                                      VTAM.                         */         
*       2 BLXEN_VAFLAGS,            /* VTAM and APPL FLAGS       @S1A*/         
*         4 BLXEN_OWNACC BIT(1),    /* VTAM HAS ACCEPTED OWNERSHIP              
*                                      OF THE CSM BUFFER         @S1M*/         
*         4 * BIT(7),               /* RESERVED                  @S1A*/         
*       2 *  CHAR(15);              /* RESERVED                  @S1C*/         
*                                                                               
*/********************************************************************/         
*/* VALUES FOR BLXEN_SOURCE                                          */         
*/********************************************************************/         
*DCL BLXEN_CECSA FIXED(8) CONSTANT(128); /* INDICATES THAT THE                  
*                                      STORAGE IS IN CSM ECSA        */         
*DCL BLXEN_CDSPACE FIXED(8) CONSTANT(64); /* INDICATES THAT THE                 
*                                      STORAGE IS IN CSM DATA SPACE  */         
*/********************************************************************/         
*/* VALUES FOR BLXEN_TYPE                                            */         
*/********************************************************************/         
*DCL BLXEN_FIXED FIXED(8) CONSTANT(128); /* INDICATES THAT THE STORAGE          
*                                      IS IN A GUARANTEED TO BE FIXED           
*                                      STATE                         */         
*DCL BLXEN_PAGEABLE FIXED(8) CONSTANT(64); /* INDICATES THAT THE                
*                                      STORAGE IS IN A GUARANTEED TO            
*                                      BE PAGEABLE STATE             */         
*DCL BLXEN_PAGEELIG FIXED(8) CONSTANT(32); /* INDICATES THAT THE                
*                                      STORAGE IS ELIGIBLE TO BE                
*                                      PAGEFREED BY CSM              */         
