         MACRO                                                                  
         ISTDPROC &DSECT=YES                                                    
.* /******************************************************************/         
.* /*  START OF SPECIFICATIONS                                       */         
.* /******************************************************************/         
.* /*                                                                */         
.* /*  MACRO-NAME: ISTDPROC                                          */         
.* /*                                                                */         
.* /*  MACRO-DESCRIPTIVE-NAME: VTAM PROCESS OPTIONS DEFINITION       */         
.* /*                          BLOCK MAPPING MACRO                   */         
.* /*                                                                */         
.* /*  COPYRIGHT: LICENSED MATERIALS - PROPERTY OF IBM               */         
.* /*                                                                */         
.* /*             THIS PRODUCT CONTAINS "RESTRICTED MATERIALS OF IBM"*/         
.* /*                                                                */         
.* /*             5655-127 (C) COPYRIGHT IBM CORP. 1991, 1996.       */         
.* /*             ALL RIGHTS RESERVED.                               */         
.* /*                                                                */         
.* /*             U.S. GOVERNMENT USERS RESTRICTED RIGHTS -          */         
.* /*             USE, DUPLICATION OR DISCLOSURE RESTRICTED BY       */         
.* /*             GSA ADP SCHEDULE CONTRACT WITH IBM CORP.           */         
.* /*                                                                */         
.* /*             SEE COPYRIGHT INSTRUCTIONS.                        */         
.* /*                                                                */         
.* /*  MACRO-FUNCTION: TO PROVIDE A VTAM BAL MAPPING FOR THE         */         
.* /*                  VTAM PROCESS OPTIONS DEFINITION BLOCK         */         
.* /*                                                                */         
.* /*  MACRO-FORMAT: AS FOLLOWS                                      */         
.* /*                                                                */         
.* /*        ISTDPROC                                                */         
.* /*                                                                */         
.* /*  MACRO-NOTES: (1) FOR EXTERNAL USE                             */         
.* /*               (2) NO PARAMETERS, EITHER POSITIONAL OR          */         
.* /*                   KEYWORD, ARE REQUIRED                        */         
.* /*                                                                */         
.* /*    REQUIRED-INNER-MACROS: NONE                                 */         
.* /*                                                                */         
.* /*    REQUIRED-INNER-MAPS: NONE                                   */         
.* /*                                                                */         
.* /*  MACRO-RESTRICTIONS: NONE                                      */         
.* /*                                                                */         
.* /*  MACRO-DEPENDENCIES: NONE                                      */         
.* /*                                                                */         
.* /*  MACRO-TYPE: EXTERNAL                                          */         
.* /*                                                                */         
.* /*    SOURCE-LANGUAGE: BAL                                        */         
.* /*                                                                */         
.* /*    SOURCE-LINES: 275                                           */         
.* /*                                                                */         
.* /*  MACRO-INPUT:                                                  */         
.* /*                                                                */         
.* /*    MACRO-GENERATION-TIME: SEE MACRO FORMAT                     */         
.* /*                                                                */         
.* /*    CODE-EXECUTION-TIME: NOT APPLICABLE                         */         
.* /*                                                                */         
.* /*  MACRO-OUTPUT:                                                 */         
.* /*                                                                */         
.* /*    MACRO-GENERATION-TIME: A DSECT DESCRIBING THE VTAM          */         
.* /*                           PROCESS OPTIONS DEFINITION           */         
.* /*                           BLOCK                                */         
.* /*                                                                */         
.* /*    CODE-EXECUTION-TIME: NOT APPLICABLE                         */         
.* /*                                                                */         
.* /*  MACRO-EXTERNAL-REFERENCES: NONE                               */         
.* /*                                                                */         
.* /*  MACRO-MESSAGES-ISSUED: NONE                                   */         
.* /*                                                                */         
.* /*  MACRO-TABLES: NONE                                            */         
.* /*                                                                */         
.* /*  MACRO-DATE-CREATED: NOTKNOWN                                  */         
.* /*                                                                */         
.* /*  MACRO-LAST-CHANGED: AS FOLLOWS                                */         
.* /*        01 - 10/12/77 - SNA4 FOR D4491.01               @D14AKMP*/         
.* /*        02 - 03/12/79 - SNA4 ASYSCIP/NASYSCIP           @G98AKNL*/         
.* /*        03 - 08/21/79 - SNA4 FOR OZ41382                @ZA41382*/         
.* /*                                                                */         
.* /* $MAC(ISTDPROC),COMP(API),PROD(VTAM): PROCESS OPTIONS MAPPING   */         
.* /*                                                                */         
.* /* FLAG REASON   RELEASE DATE   ORIGIN  FLAG DESCRIPTORS          */         
.* /* ---- -------- ------- ------ ------  ------------------------- */         
.* /* $W1= P117054  VMVSCS  941205 879315: ADD CONDITIONAL CS        */         
.* /* $D1= IVG@@MST STOKEN  950418 879315: PROC=STOKEN               */         
.* /*                                                                */         
.* /******************************************************************/         
.* /*  END OF SPECIFICATIONS                                         */         
.* /******************************************************************/         
.* /*                                                                */         
.* /*A-000000-999999                                                 */         
.* /*                                                                */         
* VTAM - ISTDPROC                                                               
*                                                                               
*        THIS STRUCTURE MAY BE USED TO MAP THE VTAM PROCESS                     
*        OPTIONS DEFNITION BLOCK                                                
*                                                                               
         AIF   ('&DSECT' EQ 'NO').CSECT                                         
ISTDPROC DSECT CL4       LENGTH = 4 BYTES                                       
         AGO   .PROBAL                                                          
.CSECT   ANOP                                                                   
ISTDPROC DS    CL4       LENGTH = 4 BYTES                                       
.PROBAL  ANOP                                                                   
         ORG   ISTDPROC                                                         
PROPROC  DS    BL4      PROCESSING OPTIONS                                      
         ORG   PROPROC                                                          
PROPROC1 DS    BL1      PROCESSING OPTIONS - 1                                  
PROASYIP EQU   X'80'    1=ASYIPX 0=NASYIPX                                      
PROTRUNC EQU   X'40'    1=TRUNC 0=KEEP                                          
PROXPOPT EQU   X'20'    1=BINARY 0=NBINARY                                      
PRODFASY EQU   X'10'    PROC-0=NDFASYX/1=DFASYX                                 
PRORESPX EQU   X'08'    PROC-0=NRESPX/1=RESPX                                   
PROCA    EQU   X'04'    1=RECEIVE ANY CA/0=NO CA                                
PROCS    EQU   X'02'    1=RECEIVE ANY CS/0=NO CS                                
PRORPLC  EQU   X'01'    1=OPTION IN RPL/0=NO RPL                                
PROPROC2 DS    BL1      PROCESSING OPTIONS - 2                                  
PRONEGBD EQU   X'80'    NEGOTIABLE BIND OPTIONS                                 
*                       0=NNEGBIND 1=NEGBIND                                    
PROERPO  EQU   X'40'    1=NERPOUT 0=ERPOUT                                      
PROLGOT  EQU   X'20'    1=NLGOUT 0=LGOUT                                        
PROSYSR  EQU   X'10'    0 = VTAM RESPONDS TO EXPEDITED DFC                      
*                       1 = APPLICATION RESPONDS                                
PROFIFOR EQU   X'08'    0 = NO ORDERING OF RESPONSES WITH REQUESTS              
*                       1 = RESPONSES KEPT IN ORDER WITH REQUESTS               
PRONTFL  EQU   X'04'    1=NTMFLL 0=TMFLL                                        
PROEMLC  EQU   X'02'    1=ELC 0=NELC                                            
PROCFTX  EQU   X'01'    1=CONFTXT 0=NCONFTXT                                    
PROPROC3 DS    BL1      PROCESSING OPTIONS - 3                                  
PROCPUID EQU   X'80'    ON = SURPRESS PROMPTING              @ZA41382           
PROERPI  EQU   X'40'    1=NERPIN 0=ERPIN                                        
PROLGIN  EQU   X'20'    1=NLGIN 0=LGIN                                          
PRONTO   EQU   X'10'    1=NTIMEOUT 0=TIMEOUT                                    
PROSUBLK EQU   X'08'    OFF = INHIBIT SUBBLOCKING                               
*                       ON = ALLOW SUBBLOCKING                                  
PROMONIT EQU   X'04'    1=MONITOR 0=NMONITOR                                    
PROMONT2 EQU   X'02'    1=MONITOR 0=NMONITOR                                    
PRORSV11 EQU   X'01'    RESERVED                                                
PROPROC4 DS    BL1      PROCESSING OPTIONS - 4                                  
PROEIB   EQU   X'80'    1=EIB 0=NEIB                                            
PROCNDCS EQU   X'40'    1=CONDITIONAL CS (ONLY IF PROCS ALSO SET): @W1C         
*                       WHEN COMPLETING A RECEIVE ANY, PUT SESSION              
*                       INTO CS MODE ONLY WHEN PIU IS NOT COMPLETELY            
*                       RECEIVED, OTHERWISE REMAIN IN CA MODE      @W1A         
PROSTOKN EQU   X'20'    1=STOKEN VALUE PROVIDED IN NIBSTKN/NIBSYM  @D1C         
*                       0=NO STOKEN PASSED, NIBSYM/NIBSTKN FIELD                
*                       CONTAINS A NAME                            @D1A         
PRORSV14 EQU   X'10'    RESERVED                                                
PROMODB  EQU   X'08'    BLOCK                                                   
PROMODM  EQU   X'04'    MSG                                                     
PROMODT  EQU   X'02'    TRANS (DEFAULT)                                         
PROMODC  EQU   X'01'    CONT                                                    
         ORG   ISTDPROC                                                         
PROPROCS DS    CL4      LENGTH = 4   BYTES                                      
         ORG   PROPROCS                                                         
PRORSV41 DS    BL1      PROCESSING OPTIONS - 1                                  
PROSETMS DS    CL3      SETMODE OPTION BYTES                                    
         ORG   PROSETMS                                                         
PROSETM2 DS    BL1      PROCESSING OPTIONS - 2                                  
PRORSV42 EQU   X'F8'    RESERVED                                                
PROSNTFL EQU   X'04'    INHIBIT TIME FILL SS - ONLY                             
PRORSV43 EQU   X'03'    RESERVED                                                
         ORG   PROSETMS+1                                                       
PROSETM3 DS    BL1      PROCESSING OPTIONS - 3                                  
PRORSV44 EQU   X'E0'    RESERVED                                                
PROSNTO  EQU   X'10'    ON = BSC - EIB INSERTION SS - INHIBIT TIMEOUT           
PRORSV45 EQU   X'08'    RESERVED                                                
PROSMONT EQU   X'04'    ON = MONITOR FOR ATTN INTS - SS ONLY                    
PRORSV46 EQU   X'03'    RESERVED                                                
         ORG   PROSETMS+2                                                       
PROSETM4 DS    BL1      PROCESSING OPTIONS - 4                                  
PROSCON  EQU   X'80'    ON = CONTINUOUS MODE (TPIOS ONLY)                       
PRORSV47 EQU   X'7C'    RESERVED                                                
PROSRDEF EQU   X'03'    RECORD DEFINITION 01 = BLOCK, 10 = MSG,                 
PROSBLCK EQU   X'01'    TO INDICATE BLOCK MODE                                  
PROSMSG  EQU   X'02'    TO INDICATE MSG MODE                                    
PROSTRNS EQU   X'03'    TO INDICATE TRANSMISSION MODE                           
PROSCONT EQU   X'83'    TO INDICATE CONTINUOUS MODE                             
PROSANDC EQU   X'7F'    TO EQUATE CONT TO TRANS FOR 370X                        
PROSORC  EQU   X'80'    TO RESTORE CONT INDICATOR                               
         MEND                                                                   
