         MACRO                                                                  
         ISTDPOHD                                                               
*        COPYRIGHT = LICENSED MATERIALS - PROPERTY OF IBM                       
*                                                                               
*                    "RESTRICTED MATERIALS OF IBM"                              
*                                                                               
*                    5695-117                                                   
*                                                                               
*                    (C) COPYRIGHT IBM CORP. 1979                               
*                                                                               
*   PROGRAM OPERATOR MESSAGE HEADER                                             
*                                                                               
ISTDPOHD DSECT                                                                  
POHRSVD  DS    CL1                 RESERVED                                     
POHSTAT  DS    CL1                 HEADER STATUS BITS                           
POHEND   EQU   X'80'               END LINE 1=YES                               
POHDATA  EQU   X'40'               DATA LINE 1=YES                              
POHLBL   EQU   X'20'               LABEL LINE 1=YES                             
POHCNTRL EQU   X'10'               CONTROL LINE 1=YES                           
POHPPSOL EQU   X'08'               MESSAGE CONTAINS COPY OF VTAM                
*                                  SOLICITED, UNSUPPRESSED MESSAGE              
*                                  THAT HAD BEEN SENT TO THE SYSTEM             
*                                  CONSOLE                                      
POHPPCMD EQU   X'04'               MESSAGE CONTAINS COPY OF VTAM                
*                                  OPERATOR COMMAND THAT HAD BEEN               
*                                  ENTERED FROM THE SYSTEM CONSOLE              
POHPPSUP EQU   X'0C'               MESSAGE CONTAINS COPY OF VTAM                
*                                  SOLICITED, SUPPRESSED MESSAGE                
*                                  THAT HAD BEEN SENT TO THE SYSTEM             
*                                  CONSOLE                                      
POHRREQ  EQU   X'02'               REPLY REQUESTED 1=YES                        
POHGEN   EQU   X'01'               ID ORIGIN  0=GENERATED BY VTAM               
*                                             1=GENERATED BY POA                
POHID    DS    CL2                 MESSAGE IDENTIFIER                           
         MEND                                                                   
