***********************************************************************         
*                                                                     *         
* MACRO NAME:   ISTDNIB                                               *         
*                                                                     *         
* DESCRIPTIVE-NAME:  NODE INFORMATION BLOCK DSECT                     *         
*                                                                     *         
* Copyright:    Licensed Materials - Property of IBM                  *         
*                                                                     *         
*               "Restricted Materials of IBM"                         *         
*                                                                     *         
*               5694-A01                                              *         
*                                                                     *         
*               Copyright IBM Corp. 1989, 2010                        *         
*                                                                     *         
*                                                                     *         
* Status:       CSV1R12                                               *         
*                                                                     *         
* FUNCTION:  TO PROVIDE AN ASSEMBLER-LANGUAGE MAPPING FOR THE         *         
*     NODE INFORMATION BLOCK.                                         *         
*                                                                     *         
*                                                                     *         
* CHANGE-ACTIVITY:                                                    *         
*                                                                     *         
* $MAC(ISTDNIB),COMP(API),PROD(VTAM): NODE INFORMATION BLOCK DSECT    *         
*                                                                     *         
* FLAG REASON   RELEASE DATE   ORIGIN  FLAG DESCRIPTORS               *         
* ---- -------- ------- ------ ------  ---------------------------    *         
* $F1= FM8@@CLD HVT3303 890126 109772: RCR0006 MTS API SUPPORT        *         
* $BB= ACC@@AMS HVT3401 891025 615520: PL/AS CONVERSION               *         
* $B1= AE@@@AMS HVT3401 890316 460025: SELECTIVE DATA ENCRYPTION      *         
* $B2= AP@@@CLD HVT3401 890322 496698: PERSISTENT LU-LU SESSIONS      *         
* $B3= AN@@@MST HVT3401 891011 571190: NON GEN TERMINAL SUPPORT       *         
* $V1= P086645  HVT3401 900820 014613: ADD NIBRPARM                   *         
* $J1= XI@@@CLD HVT3411 910215 014613: CICS REQUIREMENTS              *         
* $V2= P093524  HVT3401 910507 014613: IMPLEMENTED IN J1 XI@@@CLD     *         
* $V3= P096452  HVT3401 910618 014613: REMOVE RESTORE CONSTANTS       *         
* $KF= JN@@@CLD NQNAME2 910528 591683: ENHANCED NQN SUPPORT           *         
* $V4= P097368  HVT3401 910814 014613: RESUME DSECT AT END OF ISTDNIB *         
*                                      TO ALLOW FOR USER LOCAL        *         
*                                      ADDITIONS TO ISTDNIB           *         
* $I1= FG@@@MST GENRES  921109 879315: Generic Resource               *         
* $U2= P107241  VTEMRL  930213 595229: Add bit to indicate SIMLOGON   *         
*                                      completed successfully         *         
* $U3= P110887  GENRES  931022 879315: Add network name session bit   *         
* $D1= IVG@@MST STOKEN  950418 879315: Make NIBSTKN overlay of NIBSYM *         
* $21= OW16245  INDY    960918 978938: GR Enhancements                *         
* $E1= QPLDR008 PLRS    970820 652760: Selective MNPS data tracking   *         
* Flag Reason   Release  Date   Origin    Description                 *         
* ---- -------- -------- ------ --------  ------------------------    *         
* $A1= OW39247  CSV3R10  990825 WAMORAN : Real name option for        *         
*                                         INQUIRE,PERSESS             *         
* $L2= R12GRAFF CSV1R2   000629 Stevens : LU level GR AFFIN           *         
* $H1= RCTELMAC CSV1R12  091112 Cruse   : User CV support             *         
*                                                                     *         
***********************************************************************         
         MACRO                                                                  
         ISTDNIB                                                                
ISTDNIB  DSECT CL64     LENGTH = 64  BYTES                                      
         ORG   ISTDNIB                                                          
NIBST    EQU   *                                                                
NIBID    DS    CL1      NIB IDENTIFIER                                          
NIBFLG0  DS    BL1      FLAGS 0                                   @U3C          
NIBNNAMS EQU   X'80'    1=THIS SESSION USES THE NETWORK APPLICATION             
*                       NAME, EVEN THOUGH THE APPLICATION IS                    
*                       SUPPORTING A GENERIC NAME                 @U3A          
NIBAFFIN EQU   X'10'    0=VTAM is the default affinity owner                    
*                       1=APPLication owns all affinities                       
*                       Used for SETLOGON GNAMEADD, and OPNDST/OPNSEC           
*                       when NIBLAFFN is set on              @21A @L2C          
NIBNTRCK EQU   X'08'    0=VTAM will do data tracking for MNPS                   
*                       1=VTAM will not do data tracking for MNPS @E1A          
*                       Used for OPNDST/OPNSEC                    @E1A          
NIBREALN EQU   X'04'    0=VTAM will return substitute                           
*                         name if available                       @A1A          
*                       1=VTAM will always return real name       @A1A          
*                       Used for INQUIRE PERSESS @A1A                           
NIBLAFFN EQU   X'02'    LU level affinity specified for                         
*                       OPNDST/OPNSEC determined by bit NIBAFFIN  @L2A          
NIBCONDN DS    CL1      CONDN                                                   
NIBLEN   DS    CL1      NIB LENGTH                                              
NIBCID   DS    CL4      COMMUNICATION ID                                        
NIBUSER  DS    CL4      USER DATA AREA                                          
NIBSYM   DS    0CL8     SYMBOLIC NODE NAME                        @D1C          
NIBSTKN  DS    CL8      STOKEN VALUE (ONLY WHEN PROC=STOKEN)      @D1A          
NIBMODE  DS    CL8      MODE NAME FOR SKEL DVT                                  
         ORG   NIBMODE                                            @KFA          
NIBNET   DS    CL8      NETWORK ID OF NIBSYM WHEN NIBMODE NOT                   
*                       EQUAL TO RECORD AND NODE NAME IS                        
*                       AN NQN                                    @KFA          
NIBDEVCH EQU   *             AREA FOR DEVICE CHARACTERISTICS                    
         ISTDVCHR  DSECT=NO                                                     
NIBPROCD EQU   *             NIB PROCESSING OPTIONS                             
         ISTDPROC  DSECT=NO                                                     
NIBFLGS  DS    BL1      FLAGS                                                   
         ORG   NIBFLGS                                                          
NIBFLG1  DS    BL1      FLAGS 1                                                 
NIBLAST  EQU   X'80'    1=NOT LAST NIB                                          
NIBCON   EQU   X'40'    1=NODE CONNECTED                                        
NIBSDAPP EQU   X'20'    SDT / APPL=1,VTAM=0                                     
NIBSHLTP EQU   X'10'    DESTINATION IS REQUIRED BY ANOTHER APPLICATION          
NIBNACLQ EQU   X'08'    IF ACCEPT FAILED, LOGON CANCELLED                       
NIBRSV03 EQU   X'04'    RESERVED                                                
NIBRSV04 EQU   X'02'    RESERVED                                                
NIBASDP  EQU   X'01'    NIBASDPA CONTAINS ADDRESS OF APPLICATION                
*                          SUPPLIED DIAL PARAMTERS                @B3C          
NIBFLG2  DS    BL1      FLAGS 2                                   @B1C          
NIBCSEL  EQU   X'80'    SELECTIVE ENCRYPTION USED FOR SESSION     @B1A          
NIBCREQ  EQU   X'40'    MANDATORY ENCRYPTION USED FOR SESSION     @B1A          
*  THE FOLLOWING FOUR EQUATES ARE APPLICABLE ONLY FOR NIBS        @B2A          
*   BUILT BY INQUIRE OPTCD=PERSESS                                @B2A          
NIBPSPLU EQU   X'20'    APPLICATION IS PLU (BIT=1) OR SLU (BIT=0) @B2A          
NIBPSDFS EQU   X'10'    DFSYN DATA IS 1=CS MODE OR 0=CA MODE      @B2A          
NIBPSDFA EQU   X'08'    DFASY DATA IS 1=CS MODE OR 0=CA MODE      @B2A          
NIBPSRSP EQU   X'04'    RESP DATA IS 1=CS MODE OR 0=CA MODE       @B2A          
*                                                                 @B2A          
NIBRSV10 EQU   X'02'    RESERVED do not use                                     
NIBSLWRK EQU   X'01'    Simlogon successful for this NIB when ON  @U2C          
NIBLIMIT DS    FL2      RESPLIM VALUE                                           
NIBEXLST DS    AL4      EXIT LIST ADDRESS                                       
NIBGENN  DS    0CL8     GENERIC RESOURCE NAME (OVERLAYS NIBLMODE) @I1A          
*                          NIBGENN IS APPLICABLE ONLY FOR SETLOGON              
*                          OPTCD=GNAMEADD!GNAMEDEL, INQUIRE                     
*                          OPTCD=SESSNAME, OR CHANGE OPTCD=ENDAFFIN             
*                          or OPTCD=ENDAFFNF                      @L2C          
NIBLMODE DS    CL8      LOGON MODE                                              
NIBMTSAR DS    0A       POINTER TO MTS DATA.  (THIS OVERLAY OF    @F1A          
*                          THE NIBNDAR FIELD IS APPLICABLE ONLY WHEN            
*                          OPTCD=MTS IS SPECIFIED ON A REQSESS OR               
*                          CLSDST PASS MACRO)                                   
NIBNDAR  DS    A        POINTER TO BIND SESSION PARAMETERS                      
NIBASDPA DS   0A        POINTER TO APPLICATION SUPPLIED DIAL                    
*                          PARAMETERS ISSUED FOR SIMLOGON OR                    
*                          OPNDST OPTCD=ACQUIRE                   @B3A          
NIBUCVA  DS   0A        Pointer to application supplied Vector    @H1A          
*                                                                               
*                                                                               
NIBRPARM DS    A        POINTER TO RESTORE PARAMETER LIST FOR                   
*                          OPNDST OPTCD=RESTORE AND                             
*                          INQUIRE OPTCD=PERSESS                  @J1C          
NIBEND   EQU   *                                                                
NIBIDD   EQU   X'D0'    NIBID EQUATE                                            
NIBLNIB  EQU   (NIBEND-NIBST)    LENGTH OF NIB                                  
NIBRPRM  DSECT AL28     LENGTH = 28  BYTES                        @J1A          
*                       RESTORE PARAMETER LIST USED FOR                         
*                          OPNDST OPTCD=RESTORE AND                             
*                          INQUIRE OPTCD=PERSESS                                
*                          BASED ON NIBRPARM                      @J1A          
         ORG   NIBRPRM                                                          
NIBRBNDP DS    A        POINTER TO FIRST 36 BYTES OF BIND         @J1A          
NIBRC29P DS    A        POINTER TO CONTROL VECTOR 29              @V3C          
NIBRSQPP DS    A        POINTER TO SESSION QUALIFIER PAIR         @J1A          
         ORG   NIBRSQPP                                           @J2A          
NIBRMDNP DS    A        POINTER TO MODE NAME                      @J1A          
NIBRSIDP DS    A        POINTER TO SESSION INSTANCE IDENTIFIER    @J1A          
NIBRFM5P DS    A        POINTER TO FMH5                           @J1A          
NIBRBIDP DS    A        POINTER TO BID                            @J1A          
NIBRBISP DS    A        POINTER TO BIS                            @J1A          
*                                                                               
NIBVECS  DSECT          USER CONTROL VECTOR                       @H1A          
*                          MAPPING FOR USER SUPPLIED                            
*                          VECTORS                                              
*                          BASED ON NIBUCVA                       @H1A          
         ORG   NIBVECS                                            @H1A          
NIBVECL  DS    HL2      LENGTH OF VECTOR INCLUDING THIS FIELD     @H1A          
NIBVEC   DS    0X       CONTROL VECTOR DATA                       @H1A          
*                                                                               
ISTDNIB  DSECT          RESUME ISTDNIB DSECT                      @V4A          
         MEND                                                                   
