         MACRO                                                                  
         ISTEEHNA                                                               
* ********************************************************************          
* *                                                                  *          
* * MACRO NAME: ISTEEHNA                                             *          
* *                                                                  *          
* * DESCRIPTIVE NAME:   EE/HPR Network Management Record Data        *          
* *                                                                  *          
* * Copyright: Licensed Materials - Property of IBM                  *          
* *            5694-A01 Copyright IBM Corp. 2003, 2009               *          
* *            All rights reserved.                                  *          
* *            US Government Users Restricted Rights -               *          
* *            Use, duplication or disclosure restricted by          *          
* *            GSA ADP Schedule Contract with IBM Corp.              *          
* *            See IBM Copyright Instructions.                       *          
* *                                                                  *          
* * FUNCTION: Maps the request and response header for all SNA       *          
* *           Network Management Interface (NMI) records.  The       *          
* *           current processing provided is:                        *          
* *             (1) Socket Initialization (ISTEEHNA)                 *          
* *             (2) Socket Termination (ISTEEHNA)                    *          
* *             (3) Enterprise Extender Connection (ISTEECOA)        *          
* *             (4) Enterprise Extender Summary (ISTEESUA)           *          
* *             (5) HPR Connection (ISTHPRCA)                        *          
* *             (6) CSM Global Statistics (ISTCSMGA)                 *          
* *                                                                  *          
* *                                                                  *          
* * ALIGNMENT:                                                       *          
* *       This control block must be on a DWORD boundary.            *          
* *                                                                  *          
* * OPERATING SYSTEM SPECIFICS: None                                 *          
* *                                                                  *          
* * NOTES: None                                                      *          
* *                                                                  *          
* * SERIALIZATION CONCERNS: None                                     *          
* *                                                                  *          
* * CHANGE ACTIVITY:                                                 *          
* *                                                                  *          
* * $MAC(ISTEEHNA),COMP(MGMTSVC),PROD(VTAM): EE/HPR Network          *          
* *                                          Management Record Data  *          
* *                                                                  *          
* * Flag Reason   Release  Date   Origin    Description              *          
* * ---- -------- ------- ------ --------  ------------------------- *          
* * $Q0= R16EEMGT CSV1R5   030603 VANZIMM : Create assembler macro   *          
* * $  = D132928  X16BASE  031013 RKunkel : Fix copyright statement  *          
* * $X1= R8NMIEE  CSV1R8   050829 Zebrow  : Wildcard support for HPR *          
* *                                         Connection partner name  *          
* * $E1= D143380  RABASE   080116 HARISHS : Fix Typo                 *          
* * $F1= RBNMICSM CSV1R11  080515 AGFarrel: CSM Pool Owner Record    *          
* *                                                                  *          
* ********************************************************************          
*                                                                               
*                                                                               
* ********************************************************************          
* *                                                                  *          
* * Overall EE/HPR Network Management Interface Request and Response *          
* * Header Mapping.                                                  *          
* *                                                                  *          
* * This header is provided in every EE/HPR NMI request from the     *          
* * application client, and on every EE/HPR NMI response from VTAM.  *          
* *                                                                  *          
* ********************************************************************          
*                                                                               
EEHNMHEADER       DSECT   Header Overlay                                        
ISTEEHNA          DS 0C                                                         
EEHNMHEADERIDENT  DS 1CL4 Header EyeCatcher: "EEHH" (required          *        
                          input/output)                                         
EEHNMHEADERLENGTH DS 1FL4 Record Header Length (required input/output)          
EEHNMVERSION      DS 1FL2 EE/HPR Network Monitor Version (required     *        
                          input/output)                                         
EEHNMTYPE         DS 1FL2 EE/HPR Network Monitor Type (required        *        
                          input/output)                                         
EEHMNCORRELATOR   DS 1CL16 Request/response correlator supplied by     *        
                          client on request and returned by VTAM on    *        
                          the response                                          
                  ORG   EEHMNCORRELATOR                            @E1A         
EEHNMCORRELATOR   DS 1CL16 Redefine EEHMNCORRELATOR                @E1A         
                  ORG   EEHMNCORRELATOR+X'00000010'                @E1A         
EEHNMCLIENTID     DS 1FL4 Internal server identifier for requesting    *        
                          client                                                
EEHNMRETURNCODE   DS 1FL4 Errno value (output)                                  
EEHNMREASONCODE   DS 1FL4 ErrnoJr value (output)                                
EEHNMRECORDLENGTH DS 1FL4 Overall length of the input request and/or   *        
                          output response (required input/output)               
EEHNMTIMESTAMP    DS 1CL8 Timestamp when last piece of data was        *        
                          collected (output). Format is STCK value,    *        
                          time is GMT (not local).                              
EEHNMRSV1         DS 1CL16 Reserved                                             
EEHNMINPUTDATADESCRIPTORS DS 1CL8 Input section (filter) descriptors            
EEHNMTRIPLET      DS 0CL8                                                       
                  ORG   EEHNMINPUTDATADESCRIPTORS                               
EEHNMTOFFSET      DS 1FL4 Offset to start of first section of this type         
EEHNMTLENGTH      DS 1FL2 Length of this section                                
EEHNMTNUMBER      DS 1FL2 Number of instances of this section                   
EEHNMRSV2         DS 1CL8      Reserved                                         
EEHNMOUTPUTDATADESCRIPTORS DS 1CL16 Output section descriptors                  
EEHNMQUADRUPLET   DS 0CL16                                                      
                  ORG   EEHNMOUTPUTDATADESCRIPTORS                              
EEHNMQOFFSET      DS 1FL4 Offset to start of first record data within  *        
                          the response. Subsequent records are found   *        
                          using the length of the record being         *        
                          processed                                             
EEHNMRSV3         DS 1FL4 Reserved for EE/HPR NMI responses, since the *        
                          length of the records are variable within    *        
                          the response data                                     
EEHNMQNUMBER      DS 1FL4 Number of records returned on this response. *        
                          If less than EEHNMQMatch, then server is     *        
                          unable to return all of the record elements  *        
                          that matched the filters due to VTAM storage *        
                          constraints.                                          
EEHNMQMATCH       DS 1FL4 Number of record elements that matched the   *        
                          filters.                                              
EEHNMRSV4         DS 1CL16 Reserved                                             
EEHNMHEADER_LEN EQU *-EEHNMHEADER                                               
*                                                                               
*                                                                               
* ********************************************************************          
* * Internal Record Triplet mapping                                  *          
* ********************************************************************          
*                                                                               
*                                                                               
EEHNMRECORDTRIPLET DSECT Triplet structure used in all EE and HPR      *        
                         records for internally mapping the data                
EEHNM_RTOFFSET DS 1FL4   Offset from the start of the record to the    *        
                         first section of this particular type                  
EEHNM_RTLENGTH DS 1FL2   Length of each section of this particular     *        
                         type                                                   
EEHNM_RTNUMBER DS 1FL2   Number of instances of this particular type   *        
                         of section                                             
EEHNMRECORDTRIPLET_LEN EQU *-EEHNMRECORDTRIPLET                                 
*                                                                               
*                                                                               
* ********************************************************************          
* *                                                                  *          
* * EE/HPR Network Management Interface Request Filter Mapping       *          
* *                                                                  *          
* * The client application includes these filters ("pointed" to by   *          
* * the input triplet construct) on SNA NMI requests to indicate     *          
* * what specific information the server should return for this      *          
* * request. The valid filters are request-specific.                 *          
* *                                                                  *          
* * The server will set the bit EEHNMFilter_FilterCheck on output    *          
* * if any filter parameters were included that were inapplicable    *          
* * to the request type and thus were ignored by the server.         *          
* *                                                                  *          
* ********************************************************************          
*                                                                               
*                                                                               
EEHNMFILTER_T           DSECT     Filter Overlay                                
ISTEEFLT                DS 0C                                                   
EEHNMFILTER_EYE         DS 1CL4   Filter Eyecatcher (FLTR)                      
EEHNMFILTER_FLAGS       DS 1BL4   Filter flags                                  
                        ORG   EEHNMFILTER_FLAGS                                 
EEHNMFILTER_FLAGBYTE1   DS 1BL1 Byte 1 of filter flags                          
                        ORG   EEHNMFILTER_FLAGBYTE1                             
EEHNMFILTER_LOCIPF      EQU X'80' Local IP Address included                     
EEHNMFILTER_REMIPF      EQU X'40' Remote IP Address included                    
EEHNMFILTER_IPV6F       EQU X'20' IP Address(es) in IPv6               *        
                                  format 0 = IPv4                      *        
                                  format 1 = IPv6 format                        
EEHNMFILTER_LOCHNF      EQU X'10' Local Hostname included                       
EEHNMFILTER_REMHNF      EQU X'08' Remote Hostname included                      
EEHNMFILTER_RTPPUF      EQU X'04' RTP PU Name included                          
EEHNMFILTER_PRTRCPF     EQU X'02' Partner CP Name included                      
EEHNMFILTER_COSF        EQU X'01' APPN COS name included                        
                        ORG   EEHNMFILTER_FLAGBYTE1+X'00000001'                 
EEHNMFILTER_FLAGBYTE2   DS  1BL1  Byte 2 of filter flags          @F1C          
                        ORG   EEHNMFILTER_FLAGBYTE2               @F1A          
EEHNMFILTER_ASIDF       EQU X'80' ASID included                   @F1A          
                        ORG   EEHNMFILTER_FLAGBYTE2+X'00000001'   @F1A          
EEHNMFILTER_FLAGBYTE3   DS  1BL1  Byte 3 of filter flags - reserved             
EEHNMFILTER_FLAGBYTE4   DS  1BL1  Byte 4 of filter flags                        
                        ORG   EEHNMFILTER_FLAGBYTE4                             
EEHNMFILTER_FILTERCHECK EQU X'01' Output indicator set by Server if    *        
                                  inapplicable filters were specified  *        
                                  on request. The Server will ignore   *        
                                  inapplicable filters and return data *        
                                  matching the valid filters                    
                        ORG   EEHNMFILTER_FLAGS+X'00000004'                     
EEHNMFILTER_FILTERS     DS  0C Specific filter data               @F1C          
*                                                                               
*      ***************************************************************          
*      * For EE Summary requests, no filters are expected.           *          
*      *                                                             *          
*      * For EE Connection requests, no filters are required.        *          
*      *   Optional filters:                                         *          
*      *     Local IP address or hostname                            *          
*      *     Remote IP address or hostname                           *          
*      *                                                             *          
*      * For HPR Connection requests, RTP PU name or partner name    *          
*      *   is required, and COS is optional when partner name is     *          
*      *   also specified.                                           *          
*      *                                                             *          
*      *   For partner name, a question mark can be used to          *          
*      *   wildcard a single character and an asterisk can be        *          
*      *   used to wildcard zero or more characters.             @X1A*          
*      *                                                             *          
*      *     For example, a value of A?C* will match all             *          
*      *     names with a first character A and a third              *          
*      *     character C, but will not match two-character           *          
*      *     names or names beginning with B through Z.          @X1A*          
*      *                                                             *          
*      *     Also, to request all known connections use              *          
*      *     '*.*'. To request all known connections in              *          
*      *     the same network as this host, use '*'.             @X1A*          
*      *                                                             *          
*      * For CSM Statistics Requests, no filters are required.       *          
*      *   When no filters are provided, only the CSM Global Pool    *          
*      *   Output Section record and the CSM Summary Output Section  *          
*      *   are provided in the response.                         @F1C*          
*      *                                                             *          
*      *   Optional filters (at least one is required for the CSM    *          
*      *   Storage Owner Output Section record to be returned):      *          
*      *     ASID                                                @F1A*          
*      *                                                             *          
*      *     To request all CSM storage owner statistics,            *          
*      *     specify an ASID filter with a value of "0".         @F1A*          
*      *                                                             *          
*      ***************************************************************          
*                                                                               
EEHNMFILTER_LOCIPV6_ADDR DS 1CL16 Local IP Address                              
                         ORG   EEHNMFILTER_LOCIPV6_ADDR                         
                         DS 1CL12 Pad or start of IPv6 address                  
EEHNMFILTER_LOCIP_ADDR   DS 1BL4  IPv4 address                                  
EEHNMRSV5                DS 1CL12 Reserved for VTAM usage                       
EEHNMFILTER_REMIPV6_ADDR DS 1CL16 Remote IP Address                             
                         ORG   EEHNMFILTER_REMIPV6_ADDR                         
                         DS 1CL12 Pad or start of IPv6 address                  
EEHNMFILTER_REMIP_ADDR   DS 1BL4  IPv4 address                                  
EEHNMRSV6                DS 1CL12 Reserved for VTAM usage                       
EEHNMFILTER_LOCHN        DS 1CL65 Local Hostname                                
                         ORG   EEHNMFILTER_LOCHN                                
EEHNMFILTER_LOCHN_LEN    DS 1FL1  Length in bytes                               
EEHNMFILTER_LOCHNAME     DS 1CL64 Local Hostname                                
EEHNMFILTER_REMHN        DS 1CL65 Remote Hostname                               
                         ORG   EEHNMFILTER_REMHN                                
EEHNMFILTER_REMHN_LEN    DS 1FL1  Length in bytes                               
EEHNMFILTER_REMHNAME     DS 1CL64 Remote Hostname                               
EEHNMFILTER_RTPPU        DS 1CL8  RTP PU Name                                   
EEHNMFILTER_PRTRCP       DS 1CL18 Partner CP Name                               
                         ORG   EEHNMFILTER_PRTRCP                               
EEHNMFILTER_PRTRCP_LEN   DS 1FL1  Length in bytes                               
EEHNMFILTER_PRTRCPNAME   DS 1CL17 FQ Partner CP name                            
EEHNMFILTER_COS          DS 1CL8  APPN COS name                                 
EEHNMFILTER_CSMFILTERS   DS 1FL2  Offset of calculating base           *        
                                  portion of filter record        @F1A          
                         ORG   EEHNMFILTER_CSMFILTERS             @F1A          
EEHNMFilter_ASID         DS 1FL2  ASID                            @F1A          
EEHNMFILTER_END          DS 0C    End of Filter Record                          
EEHNMFILTER_T_LEN EQU *-EEHNMFILTER_T                                           
*                                                                               
*                                                                               
* ********************************************************************          
* *                                                                  *          
* * EE/HPR Network Management Interface Initialization Record        *          
* *                                                                  *          
* * This record is used to pass information about the VTAM EE/HPR    *          
* * Management Server to the client application. This is the first   *          
* * record written by the server to the client.                      *          
* *                                                                  *          
* ********************************************************************          
*                                                                               
*                                                                               
EEHNMINIT_T           DSECT     Init Record Overlay                             
ISTEEINT              DS 0C                                                     
EEHNMI_EYE            DS 1CL4   Init Record Eyecatcher (NMII)                   
EEHNMI_LEVEL          DS 1CL8   VTAM Level from ATCVT                           
EEHNMI_TIME           DS 1CL8   TOD VTAM started from ATCVT                     
EEHNMI_COMP           DS 1CL8   Component name                                  
EEHNMI_SUPPORTED      DS 1BL1   Functions supported                             
         ORG   EEHNMI_SUPPORTED                                                 
EEHNMI_IPV6_SUPP      EQU X'80' IPv6 addresses supported                        
EEHNMI_LOCAL_HOSTNAME EQU X'40' Local Hostname supported                        
EEHNMI_CSMSTATSFILTERS EQU X'20' CSM Statistics filters                *        
                                supported                        @F1A           
         ORG   EEHNMI_SUPPORTED+X'00000001'                                     
EEHNMRSV7             DS  1CL15 Reserved                                        
EEHNMI_END            DS  0C    End of Initialization Record                    
EEHNMINIT_T_LEN EQU *-EEHNMINIT_T                                               
*                                                                               
*                                                                               
* ********************************************************************          
* *                                                                  *          
* * EE/HPR Network Management Interface Termination Record           *          
* *                                                                  *          
* * This is the last record written by the server before the server  *          
* * closes the connection to the client.  Currently all data of      *          
* * interest resides in the header portion of this record so when    *          
* * EEHNMType = EEHNMTerminationType, this data record portion       *          
* * will not be included.  (EEHNMQNumber will be set to 0.)          *          
* ********************************************************************          
*                                                                               
*                                                                               
EEHNMTERM_T    DSECT      Term Record Overlay                                   
ISTEETRM       DS 0C                                                            
EEHNMT_EYE     DS  1CL4   Term Record Eyecatcher (NMIT)                         
EEHNMRSV8      DS  1CL28  Reserved                                              
EEHNMT_END     DS  0C     End of Termination Record                             
EEHNMTERM_T_LEN EQU *-EEHNMTERM_T                                               
*                                                                               
* ********************************************************************          
* * Eyecatcher constants for EE/HPR Network Management data          *          
* ********************************************************************          
*                                                                               
*                                                                               
EEHNM_ID   EQU C'EEHH'   EE/HPR NMI record data                                 
EEHNM_FLTR EQU C'FLTR'   EE/HPR NMI Input Filter record                         
EEHNM_INIT EQU C'NMII'   EE/HPR NMI Initialization record                       
EEHNM_TERM EQU C'NMIT'   EE/HPR NMI Termination record                          
*                                                                               
* ********************************************************************          
* * Constant for EEHNMI_Comp                                         *          
* ********************************************************************          
*                                                                               
*                                                                               
EEHNM_CONST      DSECT                                                          
EEHNMI_Comp_Name DC CL7'SNAMGMT'                                                
EEHNM_CONST_LEN EQU *-EEHNM_CONST                                               
*                                                                               
* ********************************************************************          
* * Equates for EEHNMVersion field                                   *          
* ********************************************************************          
*                                                                               
*                                                                               
EEHNMVERSION1       EQU 1 Initial EE/HPR Network Monitor version                
EEHNMCURRENTVERSION EQU 1 Current EE/HPR Network Monitor version                
*                                                                               
* ********************************************************************          
* * Equates for EEHNMType field                                      *          
* ********************************************************************          
*                                                                               
*                                                                               
EEHNMINITIALIZATIONTYPE EQU 1 Socket Connection Initialization data             
EEHNMTERMINATIONTYPE    EQU 2 Socket Connection Termination data                
EEHNMEECONNTYPE         EQU 3 EE Connection data processing                     
EEHNMEESUMMTYPE         EQU 4 EE Summary data processing                        
EEHNMHPRCONNTYPE        EQU 5 HPR Connection data processing                    
EEHNMCSMGLOBALTYPE      EQU 6 CSM GLOBAL Statistical Data processing            
*                                                                               
* ********************************************************************          
* * Miscellaneous equates                                            *          
* ********************************************************************          
*                                                                               
*                                                                               
EEHNM_FNUMBER_MIN_EESUMM  EQU 0 Minimum number of of filter records in *        
                                a valid EE Summary Request                      
EEHNM_FNUMBER_MIN_EECONN  EQU 0 Minimum number of of filter records in *        
                                a valid EE Connection Request                   
EEHNM_FNUMBER_MIN_HPRCONN EQU 1 Minimum number of filter records in a  *        
                                valid HPR Connection request                    
EEHNM_FNUMBER_MIN_CSMSTATS EQU 0 Minimum number of filter records in a *        
                                valid CSM Statistics request      @F1A          
EEHNM_FNUMBER_MAX_EESUMM  EQU 0 Maximum number of filter records in a  *        
                                valid EE Summary Request                        
EEHNM_FNUMBER_MAX_EECONN  EQU 1 Maximum number of filter records in a  *        
                                valid EE Connection Request                     
EEHNM_FNUMBER_MAX_HPRCONN EQU 4 Maximum number of filter records in a  *        
                                valid HPR Connection request                    
EEHNM_FNUMBER_MAX_CSMSTATS EQU 4 Maximum number of filter records in a *        
                                valid CSM Global Stats request    @F1A          
         MEND                                                                   
