         MACRO                                                                  
         ISTEESUA                                                               
* ********************************************************************          
* *                                                                  *          
* * MACRO NAME: ISTEESUA                                             *          
* *                                                                  *          
* * DESCRIPTIVE NAME:   NMI Enterprise Extender Summary Mapping      *          
* *                                                                  *          
* *                                                                  *          
* * Copyright: Licensed Materials - Property of IBM                  *          
* *            5694-A01 Copyright IBM Corp. 2003, 2008               *          
* *            All rights reserved.                                  *          
* *            US Government Users Restricted Rights -               *          
* *            Use, duplication or disclosure restricted by          *          
* *            GSA ADP Schedule Contract with IBM Corp.              *          
* *            See IBM Copyright Instructions.                       *          
* *                                                                  *          
* *                                                                  *          
* * FUNCTION: Maps the record formats returned in response to        *          
* *           an Network Management Enterprise Extender Summary      *          
* *           request. The records that are returned are:            *          
* *             (1) EE Summary Global Record (one)                   *          
* *             (2) EE Summary IP Address Record (one per local      *          
* *                 IP address being used for EE connections)        *          
* *                                                                  *          
* * STORAGE USED FOR CONTROL BLOCK:                                  *          
* *                                                                  *          
* *    ALLOCATED BY:                                                 *          
* *                                                                  *          
* *    FREED BY:                                                     *          
* *                                                                  *          
* *    POINTED TO BY:                                                *          
* *                                                                  *          
* *    TYPE:                                                         *          
* *                                                                  *          
* * ALIGNMENT:                                                       *          
* *       This control block MUST be on a DWORD boundary.            *          
* *                                                                  *          
* * OPERATING SYSTEM SPECIFICS:                                      *          
* *                                                                  *          
* * NOTES: None                                                      *          
* *                                                                  *          
* * SERIALIZATION CONCERNS:                                          *          
* *                                                                  *          
* * LIST RECOMPILE MODULES:                                          *          
* *                                                                  *          
* * CHANGE ACTIVITY:                                                 *          
* *                                                                  *          
* * $MAC(ISTEESUA),COMP(MGMTSVC),PROD(VTAM): NMI Enterprise Extender *          
* *                                          Summary Mapping         *          
* *                                                                  *          
* * FLAG REASON   RELEASE DATE   ORIGIN    FLAG DESCRIPTORS          *          
* * ---- -------- ------- ------ --------  ------------------------- *          
* * $Q0= R16EEMGT CSV1R5  030603 VANZIMM : Create assembler macro    *          
* * $  = D132928  X16BASE 031013 RKunkel : Fix copyright statement   *          
* * $Y1= R9SNAEEL CSV1R9  060328 HARISHS : EE LDLC timers            *          
* * $E1= D143380  RABASE  080117 HARISHS : Renamed second            *          
*                                          EESUMIP_RSV2 to           *          
*                                          EESUMIP_TIMER_RSV2        *          
* ********************************************************************          
*                                                                               
EESUMGLOBAL        DSECT   Enterprise Extender Summary Global record            
ISTEESMG           DS 0C                                                        
EESUMG_EYE         DS 1CL4 EE Summary Global ID (EESG)                          
EESUMG_LEN         DS 1FL4 Overall length of this record                        
EESUMG_RSV1        DS 1CL2 Reserved                                             
EESUMG_NUMTRIPLETS DS 1FL2 Number of triplets defined for this record           
EESUMG_TRIPLET     DS 1CL8 Only one triplet defined for this record    *        
                           This triplet is mapped by the               *        
                           EEHNMRECORDTRIPLET DSECT in ISTEEHNA MACRO           
EESUMG_END         DS 0C   End of record header                                 
EESUMGLOBAL_LEN    EQU *-EESUMGLOBAL                                            
*                                                                               
*                                                                               
EESUMGLOBALDATA DSECT    Enterprise Extender Summary Global data       *        
                         section                                                
EESUMGD_TOS_INFO DS 1CL5 TOS Information (IPv4) or Traffic class       *        
                         data (IPv6)                                            
         ORG   EESUMGD_TOS_INFO                                                 
EESUMGD_LOW_TOS          DS 1FL1 Low priority                                   
EESUMGD_MEDIUM_TOS       DS 1FL1 Medium priority                                
EESUMGD_HIGH_TOS         DS 1FL1 High priority                                  
EESUMGD_NETWORK_TOS      DS 1FL1 Network priority                               
EESUMGD_SIGNAL_TOS       DS 1FL1 Signal priority                                
EESUMGD_RSV1             DS 1CL1 Reserved                                       
EESUMGD_PORT_NUMBERS     DS 1CL10 Port Numbers                                  
         ORG   EESUMGD_PORT_NUMBERS                                             
EESUMGD_PORT_NUM_LOW     DS 1FL2 Low priority data                              
EESUMGD_PORT_NUM_MEDIUM  DS 1FL2 Medium priority data                           
EESUMGD_PORT_NUM_HIGH    DS 1FL2 High priority data                             
EESUMGD_PORT_NUM_NETWORK DS 1FL2 Network priority                               
EESUMGD_PORT_NUM_SIGNAL  DS 1FL2 LDLC signals                                   
* ********************************************************************          
* * The following LDLC timer operands that are specified on the PORT *          
* * definition statement or defaulted values.                    @Y1A*          
* ********************************************************************          
EESUMGD_TIMER_INFO       DS 1CL12 EE Timer Information                          
         ORG   EESUMGD_TIMER_INFO                                               
EESUMGD_TIMER_LIVTIME    DS 1FL4 LIVTIME                                        
EESUMGD_TIMER_SRQTIME    DS 1FL4 SRQTIME                                        
EESUMGD_TIMER_SRQRETRY   DS 1FL1 SRQRETRY                                       
EESUMGD_RSV2             DS 1CL3 Reserved                                       
EESUMGD_END              DS 0C End of EE Summary Global record         *        
                               information                                      
EESUMGLOBALDATA_LEN EQU *-EESUMGLOBALDATA                                       
*                                                                               
*                                                                               
EESUMIPADDRESS     DSECT     Enterprise Extender Summary IP Address    *        
                             record format                                      
ISTEESMI           DS 0C                                                        
EESUMI_EYE         DS 1CL4   EE Summary IPAddress ID field (EESI)               
EESUMI_LEN         DS 1FL4   Overall length of this record                      
EESUMI_RSV1        DS 1CL2   Reserved                                           
EESUMI_NUMTRIPLETS DS 1FL2   Number of triplets defined for this record         
EESUMI_IPTRIPLET   DS 1CL8   First triplet points to IP specific data  *        
                             This triplet is mapped by the             *        
                             EEHNMRECORDTRIPLET DSECT in ISTEEHNA MACRO         
EESUMI_HNTRIPLET   DS 1CL8   Second triplet points to hostname data    *        
                             This triplet is mapped by the             *        
                             EEHNMRECORDTRIPLET DSECT in ISTEEHNA MACRO         
EESUMI_END         DS  0C    End of record header                               
EESUMIPADDRESS_LEN EQU *-EESUMIPADDRESS                                         
*                                                                               
*                                                                               
EESUMIPADDRESSDATA DSECT   Enterprise Extender Summary IP Address      *        
                         specific section                                       
EESUMIP_LOCAL_IPV6_ADDRESS   DS 1CL16 Local IPv6 Address                        
         ORG   EESUMIP_LOCAL_IPV6_ADDRESS                                       
                             DS 1CL12 Pad or part of IPv6 address               
EESUMIP_LOCAL_IPV4_ADDRESS   DS 1CL4  Local IPv4 Address                        
EESUMIP_RSV1                 DS 1CL12 Reserved for VTAM usage                   
EESUMIP_FLAGS                DS 1CL1  Information Flags                         
         ORG   EESUMIP_FLAGS                                                    
EESUMIP_IPV6_ADDRESS         EQU X'80' Local IPAddress is IPv6         *        
                                      '1'B = IPv6 Address              *        
                                      '0'B = IPv4 Address                       
         ORG   EESUMIP_FLAGS+X'00000001'                                        
EESUMIP_RSV2                 DS 1CL3 Reserved                                   
EESUMIP_NUM_SRQRETRY_INOPS   DS 1FL4 Count of the number of lines that *        
                                     have INOPed due to SRQRETRY                
EESUMIP_NUM_ACTIVE_TOTAL_CONNS DS 1FL4 Total active EE connections for *        
                                     this IP address                            
EESUMIP_PREDEFINED_INFO      DS 1CL4 Predefined Connection Info        *        
                                     specific to this IP address                
         ORG   EESUMIP_PREDEFINED_INFO                                          
EESUMIP_NUM_AVAIL_LINES_PREDEFINED DS 1FL2 Total number of available   *        
                                     lines for predefined connections           
EESUMIP_NUM_ACTIVE_PREDEFINED_CONNS DS 1FL2 Total number of active     *        
                                     predefined connections                     
EESUMIP_LOCAL_VRN_INFO       DS 1CL6 Local VRN Info specific to this   *        
                                     IP address                                 
         ORG   EESUMIP_LOCAL_VRN_INFO                                           
EESUMIP_NUM_LOCAL_VRNS       DS 1FL2 Total number of Local VRNs        *        
                                     defined with this local IP address         
EESUMIP_NUM_AVAIL_LINES_LVRN DS 1FL2 Total number of available lines   *        
                                     for Local VRN connections                  
EESUMIP_NUM_ACTIVE_LVRN_CONNS DS 1FL2 Total number of active Local VRN *        
                                      connections                               
EESUMIP_GLOBAL_VRN_INFO      DS 1CL6 Global VRN Info for this specific *        
                                      IP address                                
         ORG   EESUMIP_GLOBAL_VRN_INFO                                          
EESUMIP_NUM_GLOBAL_VRNS      DS 1FL2 Total number of Global VRNs       *        
                                     defined with this local IP address         
EESUMIP_NUM_AVAIL_LINES_GVRN DS 1FL2 Total number of available lines   *        
                                     for Global VRN connections                 
EESUMIP_NUM_ACTIVE_GVRN_CONNS DS 1FL2 Total number of active Global    *        
                                     VRN connections                            
* ********************************************************************          
* * The following LDLC timer operands that are associated with the   *          
* * local static VIPA address. These operands are specified on the   *          
* * GROUP definition statement or sifted down from the PORT          *          
* * definition statement. Their values can be different from the     *          
* * values of the LDLC timer operands on EE Summary Global record.   *          
* *                                                              @Y1A*          
* ********************************************************************          
EESUMIP_TIMER_INFO           DS 1CL12 EE Timer Information         @Y1A         
         ORG   EESUMIP_TIMER_INFO                                  @Y1A         
EESUMIP_TIMER_LIVTIME        DS 1FL4 LIVTIME                       @Y1A         
EESUMIP_TIMER_SRQTIME        DS 1FL4 SRQTIME                       @Y1A         
EESUMIP_TIMER_SRQRETRY       DS 1FL1 SRQRETRY                      @Y1A         
EESUMIP_TIMER_RSV2           DS 1CL3 Reserved                 @Y1A @E1C         
EESUMIP_END                  DS 0C End of EE Summary IP Address section         
                                                                                
EESUMIPADDRESSDATA_LEN EQU *-EESUMIPADDRESSDATA                                 
*                                                                               
* ********************************************************************          
* * Provide mapping for hostname(s) that have been used to resolve   *          
* * to this IP address. Zero or multiple hostnames may be returned   *          
* * for any given IP address.                                        *          
* ********************************************************************          
*                                                                               
*                                                                               
EESUMI_HOSTNAMEDATA DSECT    Enterprise Extender Summary Hostnam       *        
                             section mapping                                    
EESUMIH_HOSTLEN     DS 1FL1  Actual length of hostname                          
EESUMIH_HOSTNAME    DS 1CL64 Hostname used to resolve to the local IP  *        
                             address reported in this EE Summary record         
EESUMI_HOSTNAMEDATA_LEN EQU *-EESUMI_HOSTNAMEDATA                               
*                                                                               
* ********************************************************************          
* * Eyecatcher constants for EE Summary records                      *          
* ********************************************************************          
*                                                                               
*                                                                               
EESUMG_ID EQU  C'EESG'   EE summary global record                               
EESUMI_ID EQU  C'EESI'   EE summary IP address record                           
*                                                                               
* ********************************************************************          
* * Constants for Triplet counts for the various records             *          
* ********************************************************************          
*                                                                               
*                                                                               
EESUMG_TRIPLETCNT EQU 1  EE Summary Global record has one triplet               
EESUMI_TRIPLETCNT EQU 2  EE Summary IP address record has two triplets          
         MEND                                                                   
