         MACRO                                                                  
         ISTEECOA                                                               
* ********************************************************************          
* *                                                                  *          
* * MACRO NAME: ISTEECOA                                             *          
* *                                                                  *          
* * DESCRIPTIVE NAME:   NMI Enterprise Extender Connection Mapping   *          
* *                                                                  *          
* * Copyright: Licensed Materials - Property of IBM                  *          
* *            5650-ZOS Copyright IBM Corp. 2003, 2013               *          
* *            US Government Users Restricted Rights -               *          
* *            Use, duplication or disclosure restricted by          *          
* *            GSA ADP Schedule Contract with IBM Corp.              *          
* *            See IBM Copyright Instructions.                       *          
* *                                                                  *          
* *                                                                  *          
* * FUNCTION: Maps the record formats returned in response to        *          
* *           an Network Management Enterprise Extender Connection   *          
* *           request. The records that are returned are:            *          
* *             (1) EE Connection Record Data (one per EE            *          
* *                 connection being reported)                       *          
* *                                                                  *          
* * STORAGE USED FOR CONTROL BLOCK:                                  *          
* *                                                                  *          
* *    ALLOCATED BY:                                                 *          
* *                                                                  *          
* *    FREED BY:                                                     *          
* *                                                                  *          
* *    POINTED TO BY:                                                *          
* *                                                                  *          
* *    TYPE:                                                         *          
* *                                                                  *          
* * ALIGNMENT:                                                       *          
* *       This control block MUST be on a DWORD boundary.            *          
* *                                                                  *          
* * OPERATING SYSTEM SPECIFICS:                                      *          
* *                                                                  *          
* * NOTES: None                                                      *          
* *                                                                  *          
* * SERIALIZATION CONCERNS:                                          *          
* *                                                                  *          
* *                                                                  *          
* * LIST RECOMPILE MODULES:                                          *          
* *                                                                  *          
* * CHANGE ACTIVITY:                                                 *          
* *                                                                  *          
* * $MAC(ISTEECOA),COMP(MGMTSVC),PROD(VTAM): NMI Enterprise Extender *          
* *                                          Connection Mapping      *          
* *                                                                  *          
* * FLAG REASON   RELEASE DATE   ORIGIN    FLAG DESCRIPTORS          *          
* * ---- -------- ------- ------ --------  ------------------------- *          
* * $Q0= R16EEMGT CSV1R5  030603 VANZIMM : Create assembler macro    *          
* * $  = D132928  X16BASE 031013 RKunkel : Fix copyright statement   *          
* * $H1= RCSNAEEH CSV1R12 090902 HARISHS : EE Health verification    *          
* * $H2= RCSNAEEH CSV1R12 091208 PatBrown: EE Health verification    *          
* * $V1= REFINAPV CSV2R1  111018 HARISHS : Add missing DSECTS        *          
* *                                        (FIN APAR OA37600)        *          
* *                                                                  *          
* ********************************************************************          
*                                                                               
EECONNRECORD       DSECT   Enterprise Extender Connection Data Block            
ISTEECOA           DS 0C                                                        
EECONN_EYE         DS 1CL4 EE Connection ID (EECO)                              
EECONN_LEN         DS 1FL4 Overall length of this record                        
EECONN_RSV1        DS 1CL2 Reserved                                             
EECONN_NUMTRIPLETS DS 1FL2 Number of triplets defined for this record  *        
                           These triplets are mapped by the            *        
                           EEHNMRECORDTRIPLET DSECT in ISTEEHNA MACRO           
EECONN_STTRIPLET   DS 1CL8 First triplet defines the static section             
EECONN_HNTRIPLET   DS 1CL8 Second triplet defines the associated       *        
                           hostname section(s)                                  
EECONN_VNTRIPLET   DS 1CL8 Third triplet defines the VRN section                
EECONN_PUTRIPLET   DS 1CL8 Fourth triplet defines the list of          *        
                           associated RTP PU names                              
EECONN_VERTRIPLET  DS 1CL8 Fifth triplet defines the health            *        
                           verification info section             @H1A           
EECONN_PBRTRIPLET  DS 1CL8 Sixth triplet defines the health            *        
                           verification PBR section              @H1A           
EECONN_DATA        DS 0C   End of record header                                 
EECONNRECORD_LEN EQU *-EECONNRECORD                                             
*                                                                               
* ********************************************************************          
* * Enterprise Extender Connection static information section        *          
* ********************************************************************          
*                                                                               
*                                                                               
EECONN_STATICDATA          DSECT    Static Information section                  
EECONNS_LOCAL_IPV6_ADDRESS DS 1CL16 Local IPv6 Address                          
         ORG   EECONNS_LOCAL_IPV6_ADDRESS                                       
EECONNS_PAD_LOCAL          DS 1CL12 Pad or part of IPv6 address                 
EECONNS_LOCAL_IPV4_ADDRESS DS 1CL4  Local IPv4 Address                          
EECONNS_RSV1               DS 1CL12 Reserved for VTAM usage                     
EECONNS_REMOTE_IPV6_ADDRESS DS 1CL16 Remote IPv6 address                        
         ORG   EECONNS_REMOTE_IPV6_ADDRESS                                      
EECONNS_PAD_REMOTE         DS 1CL12 Pad or part of IPv4 address                 
EECONNS_REMOTE_IPV4_ADDRESS DS 1CL4 Remote IPv4 Address                         
EECONNS_RSV2               DS 1CL12 Reserved for VTAM usage                     
EECONNS_STACK_NAME         DS 1CL8  Enterprise Extender TCP/IP stack   *        
                                    Name                                        
EECONNS_LINE_NAME          DS 1CL8  Enterprise Extender Line Name               
EECONNS_PU_NAME            DS 1CL8  Enterprise Extender PU Name                 
EECONNS_REMOTE_SAP         DS 1BL1  Remote SAP                                  
EECONNS_LOCAL_SAP          DS 1BL1  Local SAP                                   
EECONNS_FLAGS              DS 1CL1                                              
         ORG   EECONNS_FLAGS                                                    
EECONNS_IPV6_ADDRESS       EQU X'80' Local and Remote addresses are    *        
                                     IPv6                              *        
                                       '1'B - Both IPv6 Address        *        
                                       '0'B - Both IPv4 Address                 
EECONNS_DYNAMIC_PU         EQU X'40' Dynamic PU Indicator              *        
                                       '1'B - Dynamic                  *        
                                       '0'B - Predefined                        
EECONNS_KEEPACT            EQU X'20' KEEPACT boolean flag                       
EECONNS_DWINOP             EQU X'10' DWINOP boolean flag                        
         ORG   EECONNS_FLAGS+X'00000001'                                        
EECONNS_REDIAL_CNT         DS 1FL1  EE Redial Count                             
EECONNS_REDIAL_DLY         DS 1FL2  EE Redial Delay in seconds                  
EECONNS_VER_FAILED_FLAG    DS 1CL1  EE Health Verification error       *        
                                       indicators                @H1A           
         ORG   EECONNS_VER_FAILED_FLAG                           @H1A           
EECONNS_FUDP_STORAGE_ERROR EQU X'80' FUDP storage error          @H1A           
EECONNS_PBR_ERROR          EQU X'40' PBR error                   @H1A           
EECONNS_SENSE_RECEIVED     EQU X'20' Sense code                  @H1A           
EECONNS_NO_RESPONSE        EQU X'10' No response                 @H1A           
EECONNS_ERROR_CODE         EQU X'08' Error code                  @H1A           
EECONNS_STORAGE_ERROR      EQU X'04' VTAM Storage error          @H1A           
EECONNS_SEND_ERROR         EQU X'02' Unable to send probe        @H1A           
EECONNS_NO_ROUNTE          EQU X'01' No route                    @H1A           
*                                                                               
         ORG   EECONNS_VER_FAILED_FLAG+X'00000001'               @V1A           
EECONNS_VER_FAILED_FLAG2   DS 1CL1  EE Health Verification error       *        
                                    indicators                   @H2A           
         ORG   EECONNS_VER_FAILED_FLAG2                                         
EECONNS_NO_LDLC_PROBE_SUPPORT EQU X'80' EE connection partner does not *        
                                    appear to support EE LDLC Probe    *        
                                    signals                      @H2A           
         ORG   EECONNS_VER_FAILED_FLAG2+X'00000001'              @V1A           
EECONNS_TOTAL_LULU_COUNT   DS 1FL4  Count of LU-LU sessions on RTP     *        
                                    pipes using this EE connection              
*                                                                               
*      ***************************************************************          
*      * Outbound Data Transfer Information by Priority:             *          
*      *   Low                                                       *          
*      *   Medium                                                    *          
*      *   High                                                      *          
*      *   Network                                                   *          
*      *   Signal                                                    *          
*      ***************************************************************          
*                                                                               
*                                                                               
EECONNS_DATA_TRANSFER_INFO_OUTBOUND DS 1CL144 OutBound data transfer   *        
                                      information                               
         ORG   EECONNS_DATA_TRANSFER_INFO_OUTBOUND                              
EECONNS_SNA_BYTES_SENT_L      DS 1CL8                                           
         ORG   EECONNS_SNA_BYTES_SENT_L                                         
EECONNS_SNA_BYTES_SENT_LOW_OF DS 1FL4 Overflow for                     *        
                                      EEConnS_SNA_Bytes_Sent_Low                
EECONNS_SNA_BYTES_SENT_LOW    DS 1FL4 Total number of bytes sent over  *        
                         this EE connection - LOW priority. This       *        
                         includes the data bytes along with NLH, THDR  *        
                         and FID5                                               
EECONNS_NLPOUT_INFO_L         DS 1CL8                                           
         ORG   EECONNS_NLPOUT_INFO_L                                            
EECONNS_NLPOUT_OVERFLOW_LOW   DS 1FL4 Overflow for                     *        
                                      EEConn_NLPOut_Count_Low                   
EECONNS_NLPOUT_COUNT_LOW      DS 1FL4 Count of NLPs sent outbound - LOW*        
                                      priority                                  
EECONNS_NLPOUT_RXMT_INFO_L    DS 1CL8                                           
         ORG   EECONNS_NLPOUT_RXMT_INFO_L                                       
EECONNS_NLPOUT_RXMT_LOW_OF    DS 1FL4 Overflow for                     *        
                                      EEConn_NLPOut_Rxmt_Low                    
EECONNS_NLPOUT_RXMT_LOW       DS 1FL4 Count of NLPs retransmitted      *        
                                      outbound - LOW priority                   
EECONNS_SNA_BYTES_SENT_M DS 1CL8                                                
         ORG   EECONNS_SNA_BYTES_SENT_M                                         
EECONNS_SNA_BYTES_SENT_MED_OF DS 1FL4 Overflow for                     *        
                                      EEConnS_SNA_Bytes_Sent_Med                
EECONNS_SNA_BYTES_SENT_MED    DS 1FL4 Total number of bytes sent over  *        
                         this EE connection - MEDIUM priority. This    *        
                         includes data bytes along with NLH, THDR and  *        
                         FID5                                                   
EECONNS_NLPOUT_INFO_M         DS 1CL8                                           
         ORG   EECONNS_NLPOUT_INFO_M                                            
EECONNS_NLPOUT_OVERFLOW_MED   DS 1FL4 Overflow for                     *        
                                      EEConn_NLPOut_Count_Med                   
EECONNS_NLPOUT_COUNT_MED      DS 1FL4 Count of NLPs sent outbound -    *        
                                      MEDIUM priority                           
EECONNS_NLPOUT_RXMT_INFO_M    DS 1CL8                                           
         ORG   EECONNS_NLPOUT_RXMT_INFO_M                                       
EECONNS_NLPOUT_RXMT_MED_OF    DS 1FL4 Overflow for                     *        
                                      EEConn_NLPOut_Rxmt_Med                    
EECONNS_NLPOUT_RXMT_MED       DS 1FL4 Count of NLPs retransmitted      *        
                                      outbound - MEDIUM priority                
EECONNS_SNA_BYTES_SENT_H      DS 1CL8                                           
         ORG   EECONNS_SNA_BYTES_SENT_H                                         
EECONNS_SNA_BYTES_SENT_HIGH_OF DS 1FL4 Overflow for                    *        
                                       EEConnS_SNA_Bytes_Sent_High              
EECONNS_SNA_BYTES_SENT_HIGH   DS 1FL4 Total number of bytes sent over  *        
                         this EE connection - HIGH priority. This      *        
                         includes data bytes along with NLH, THDR and  *        
                         FID5                                                   
EECONNS_NLPOUT_INFO_H         DS 1CL8                                           
         ORG   EECONNS_NLPOUT_INFO_H                                            
EECONNS_NLPOUT_OVERFLOW_HIGH  DS 1FL4 Overflow for                     *        
                         EEConn_NLPOut_Count_High                               
EECONNS_NLPOUT_COUNT_HIGH     DS 1FL4 Count of NLPs sent outbound -    *        
                                      HIGH priority                             
EECONNS_NLPOUT_RXMT_INFO_H    DS 1CL8                                           
         ORG   EECONNS_NLPOUT_RXMT_INFO_H                                       
EECONNS_NLPOUT_RXMT_HIGH_OF   DS 1FL4 Overflow for                     *        
                                      EEConn_NLPOut_Rxmt_High                   
EECONNS_NLPOUT_RXMT_HIGH      DS 1FL4 Count of NLPs retransmitted      *        
                                      outbound - HIGH priority                  
EECONNS_SNA_BYTES_SENT_N      DS 1CL8                                           
         ORG   EECONNS_SNA_BYTES_SENT_N                                         
EECONNS_SNA_BYTES_SENT_NET_OF DS 1FL4 Overflow for                     *        
                                      EEConnS_SNA_Bytes_Sent_Net                
EECONNS_SNA_BYTES_SENT_NET    DS 1FL4 Total number of bytes sent over  *        
                         this EE connection - NETWORK priority. This   *        
                         includes data bytes along with NLH, THDR and  *        
                         FID5                                                   
EECONNS_NLPOUT_INFO_N         DS 1CL8                                           
         ORG   EECONNS_NLPOUT_INFO_N                                            
EECONNS_NLPOUT_OVERFLOW_NET   DS 1FL4 Overflow for                     *        
                                      EEConn_NLPOut_Count_Net                   
EECONNS_NLPOUT_COUNT_NET      DS 1FL4 Count of NLPs sent outbound -    *        
                                      NETWORK priority                          
EECONNS_NLPOUT_RXMT_INFO_N    DS 1CL8                                           
         ORG   EECONNS_NLPOUT_RXMT_INFO_N                                       
EECONNS_NLPOUT_RXMT_NET_OF    DS 1FL4 Overflow for                     *        
                                      EEConn_NLPOut_Rxmt_Net                    
EECONNS_NLPOUT_RXMT_NET       DS 1FL4 Count of NLPs retransmitted      *        
                                      outbound - NETWORK priority               
EECONNS_SNA_BYTES_SENT_S      DS 1CL8                                           
         ORG   EECONNS_SNA_BYTES_SENT_S                                         
EECONNS_SNA_BYTES_SENT_SIG_OF DS 1FL4 Overflow for                     *        
                                      EEConnS_SNA_Bytes_Sent_Sig                
EECONNS_SNA_BYTES_SENT_SIG    DS 1FL4 Total number of bytes sent over  *        
                         this EE connection - SIGNAL priority. This    *        
                         includes data bytes along with NLH, THDR and  *        
                         FID5                                                   
EECONNS_NLPOUT_INFO_S         DS 1CL8                                           
         ORG   EECONNS_NLPOUT_INFO_S                                            
EECONNS_NLPOUT_OVERFLOW_SIG   DS 1FL4 Overflow for                     *        
                                      EEConn_NLPOut_Count_Sig                   
EECONNS_NLPOUT_COUNT_SIG      DS 1FL4 Count of NLPs sent outbound -    *        
                                      SIGNAL priority                           
EECONNS_NLPOUT_RXMT_INFO_S DS 1CL8                                              
         ORG   EECONNS_NLPOUT_RXMT_INFO_S                                       
EECONNS_NLPOUT_RXMT_SIG_OF    DS 1FL4 Overflow for                     *        
                                      EEConn_NLPOut_Rxmt_Sig                    
EECONNS_NLPOUT_RXMT_SIG       DS 1FL4 Count of NLPs retransmitted      *        
                                      outbound - SIGNAL priority                
EECONNS_SNA_BYTES_SENT_A      DS 1CL8                                           
         ORG   EECONNS_SNA_BYTES_SENT_A                                         
EECONNS_SNA_BYTES_SENT_ALL_OF DS 1FL4 Overflow for                     *        
                                EEConnS_SNA_Bytes_Sent_ALL                      
EECONNS_SNA_BYTES_SENT_ALL    DS 1FL4 Total number of bytes sent over  *        
                         this EE connection - ALL priorities. This     *        
                         includes data bytes along with NLH, THDR and  *        
                         FID5                                                   
EECONNS_NLPOUT_INFO_A         DS 1CL8                                           
         ORG   EECONNS_NLPOUT_INFO_A                                            
EECONNS_NLPOUT_OVERFLOW_ALL   DS 1FL4 Overflow for                     *        
                                      EEConn_NLPOut_Count_All                   
EECONNS_NLPOUT_COUNT_ALL      DS 1FL4 Count of NLPs sent outbound - All*        
                                      priorities                                
EECONNS_NLPOUT_RXMT_INFO_A    DS 1CL8                                           
         ORG   EECONNS_NLPOUT_RXMT_INFO_A                                       
EECONNS_NLPOUT_RXMT_ALL_OF    DS 1FL4 Overflow for                     *        
                                      EEConn_NLPOut_Rxmt_ALL                    
EECONNS_NLPOUT_RXMT_ALL       DS 1FL4 Count of NLPs retransmitted      *        
                                      outbound - ALL priorities                 
*                                                                               
*      ***************************************************************          
*      * Inbound Data Transfer Information by Priority:              *          
*      *   Low                                                       *          
*      *   Medium                                                    *          
*      *   High                                                      *          
*      *   Network                                                   *          
*      *   Signal                                                    *          
*      ***************************************************************          
*                                                                               
*                                                                               
EECONNS_DATA_TRANSFER_INFO_INBOUND DS 1CL96 InBound data transfer      *        
                                            information                         
         ORG   EECONNS_DATA_TRANSFER_INFO_INBOUND                               
EECONNS_SNA_BYTES_RCV_L       DS 1CL8                                           
         ORG   EECONNS_SNA_BYTES_RCV_L                                          
EECONNS_SNA_BYTES_RCV_LOW_OF  DS 1FL4 Overflow for                     *        
                                      EEConnS_SNA_Bytes_Rcv_Low                 
EECONNS_SNA_BYTES_RCV_LOW     DS 1FL4 Total number of bytes received   *        
                         over this EE connection - LOW priority. This  *        
                         includes data bytes along with NLH, THDR and  *        
                         FID5                                                   
EECONNS_NLPIN_INFO_L          DS 1CL8                                           
         ORG   EECONNS_NLPIN_INFO_L                                             
EECONNS_NLPIN_OVERFLOW_LOW    DS 1FL4 Overflow for                     *        
                                      EEConn_NLPIn_Count_Low                    
EECONNS_NLPIN_COUNT_LOW       DS 1FL4 Count of NLPs received inbound - *        
                                      LOW priority                              
EECONNS_SNA_BYTES_RCV_M       DS 1CL8                                           
         ORG   EECONNS_SNA_BYTES_RCV_M                                          
EECONNS_SNA_BYTES_RCV_MED_OF  DS 1FL4 Overflow for                     *        
                                      EEConnS_SNA_Bytes_Rcv_Med                 
EECONNS_SNA_BYTES_RCV_MED     DS 1FL4 Total number of bytes received   *        
                         over this EE connection - MEDIUM priority.    *        
                         This includes data bytes along with NLH, THDR *        
                         and FID5                                               
EECONNS_NLPIN_INFO_M          DS 1CL8                                           
         ORG   EECONNS_NLPIN_INFO_M                                             
EECONNS_NLPIN_OVERFLOW_MED    DS 1FL4 Overflow for                     *        
                                      EEConn_NLPIn_Count_Med                    
EECONNS_NLPIN_COUNT_MED       DS 1FL4 Count of NLPs received inbound - *        
                                      MEDIUM priority                           
EECONNS_SNA_BYTES_RCV_H       DS 1CL8                                           
         ORG   EECONNS_SNA_BYTES_RCV_H                                          
EECONNS_SNA_BYTES_RCV_HIGH_OF DS 1FL4 Overflow for                     *        
                                      EEConnS_SNA_Bytes_Rcv_High                
EECONNS_SNA_BYTES_RCV_HIGH    DS 1FL4 Total number of bytes received   *        
                         over this EE connection - HIGH priority. This *        
                         includes data bytes along with NLH, THDR and  *        
                         FID5                                                   
EECONNS_NLPIN_INFO_H          DS 1CL8                                           
         ORG   EECONNS_NLPIN_INFO_H                                             
EECONNS_NLPIN_OVERFLOW_HIGH   DS 1FL4 Overflow for                     *        
                                      EEConn_NLPIn_Count_High                   
EECONNS_NLPIN_COUNT_HIGH      DS 1FL4 Count of NLPs received inbound   *        
                                      - HIGH priority                           
EECONNS_SNA_BYTES_RCV_N       DS 1CL8                                           
         ORG   EECONNS_SNA_BYTES_RCV_N                                          
EECONNS_SNA_BYTES_RCV_NET_OF  DS 1FL4 Overflow for                     *        
                                     EEConnS_SNA_Bytes_Rcv_Net                  
EECONNS_SNA_BYTES_RCV_NET     DS 1FL4 Total number of bytes received   *        
                         over this EE connection - NETWORK priority.   *        
                         This includes data bytes along with NLH, THDR *        
                         and FID5                                               
EECONNS_NLPIN_INFO_N          DS 1CL8                                           
         ORG   EECONNS_NLPIN_INFO_N                                             
EECONNS_NLPIN_OVERFLOW_NET    DS 1FL4 Overflow for                     *        
                                      EEConn_NLPIn_Count_Net                    
EECONNS_NLPIN_COUNT_NET       DS 1FL4 Count of NLPs received inbound - *        
                                      NETWORK priority                          
EECONNS_SNA_BYTES_RCV_S       DS 1CL8                                           
         ORG   EECONNS_SNA_BYTES_RCV_S                                          
EECONNS_SNA_BYTES_RCV_SIG_OF  DS 1FL4 Overflow for                     *        
                                      EEConnS_SNA_Bytes_Rcv_Sig                 
EECONNS_SNA_BYTES_RCV_SIG     DS 1FL4 Total number of bytes received   *        
                         over this EE connection - SIGNAL priority.    *        
                         This includes data bytes along with NLH, THDR *        
                         and FID5                                               
EECONNS_NLPIN_INFO_S          DS 1CL8                                           
         ORG   EECONNS_NLPIN_INFO_S                                             
EECONNS_NLPIN_OVERFLOW_SIG    DS 1FL4 Overflow for                     *        
                                      EEConn_NLPIn_Count_Sig                    
EECONNS_NLPIN_COUNT_SIG       DS 1FL4 Count of NLPs received inbound - *        
                                      SIGNAL priority                           
EECONNS_SNA_BYTES_RCV_A       DS 1CL8                                           
         ORG   EECONNS_SNA_BYTES_RCV_A                                          
EECONNS_SNA_BYTES_RCV_ALL_OF  DS 1FL4 Overflow for                     *        
                                      EEConnS_SNA_Bytes_Rcv_ALL                 
EECONNS_SNA_BYTES_RCV_ALL     DS 1FL4 Total number of bytes received   *        
                         over this EE connection for all priorities    *        
                         This includes data bytes along with NLH, THDR *        
                         and FID5                                               
EECONNS_NLPIN_INFO_A          DS 1CL8                                           
         ORG   EECONNS_NLPIN_INFO_A                                             
EECONNS_NLPIN_OVERFLOW_ALL    DS 1FL4 Overflow for                     *        
                                      EEConn_NLPIn_Count_All                    
EECONNS_NLPIN_COUNT_ALL       DS 1FL4 Count of NLPs received inbound - *        
                                      ALL priorities                            
EECONNS_CONNECTION_ACT_TOD    DS 1CL8 TOD the EE connection was        *        
                                      activated                                 
EECONNS_NUM_SRQRETRY_GT_ONE   DS 1FL2 Number of times this connection  *        
                         has had signal responses require more than    *        
                         one retry.                                             
EECONNS_NUM_SRQRETRY_EQ_MAX   DS 1FL2 Number of times this connection  *        
                         has had signal responses require the maximum  *        
                         allowable retries.                                     
EECONNS_HVER_TOD              DS 1CL8 TOD when EE health verification  *        
                                      info received from the remote    *        
                                      partner                    @H1A           
EECONNS_HVER_SUCCESS_TOD      DS 1CL8 TOD when last EE health          *        
                         verification was successful             @H1A           
EECONNS_HVER_FAIL_TOD         DS 1CL8 TOD when last EE health          *        
                         verification failed                     @H1A           
EECONNS_END                   DS 0C    End of EEConn static section             
EECONN_STATICDATA_LEN EQU *-EECONN_STATICDATA                                   
*                                                                               
* ********************************************************************          
* * Enterprise Extender Connection Associated Hostname section       *          
* ********************************************************************          
*                                                                               
*                                                                               
EECONN_HOSTNAMEDATA DSECT   Associated hostname section                         
EECONNH_FLAGS  DS 1BL1   Hostname indicators                                    
         ORG   EECONNH_FLAGS                                                    
EECONNH_USAGE  EQU X'80' Local vs. Remote hostname                     *        
                           '1'B - hostname was used to obtain remote IP*        
                                  address                              *        
                           '0'B - hostname was used to obtain local IP *        
                                  address                                       
         ORG   EECONNH_FLAGS+X'00000001'                                        
EECONNH_LENGTH DS 1FL1   Actual length of the hostname being reported. *        
                         For convenience, the section will always have *        
                         space for a maximum sized hostname                     
EECONNH_HOST   DS 1CL64  Hostname being reported                                
EECONNH_END    DS 0C     End of hostname section                                
EECONN_HOSTNAMEDATA_LEN EQU *-EECONN_HOSTNAMEDATA                               
*                                                                               
* ********************************************************************          
* * Enterprise Extender Connection Associated VRN section            *          
* ********************************************************************          
*                                                                               
*                                                                               
EECONN_VRNDATA  DSECT    Associated VRN data section                            
EECONNV_HEADER  DS 1CL1  Header data                                            
         ORG   EECONNV_HEADER                                                   
EECONNV_FLAGS   DS 1BL1  VRN data indicators                                    
         ORG   EECONNV_FLAGS                                                    
EECONNV_TYPE    EQU X'80' VRN type being reported:                     *        
                           '1'B - Global VRN                           *        
                           '0'B - Local VRN                                     
         ORG   EECONNV_HEADER+X'00000001'                                       
EECONNV_VRNNAME DS 0C    Virtual Routing Node Name. The length of the  *        
                         name is obtained from the total length of the *        
                         VRN section, as shown in the record triplet,  *        
                         less the section header information                    
EECONN_VRNDATA_LEN EQU *-EECONN_VRNDATA                                         
*                                                                               
* ********************************************************************          
* * Enterprise Extender Connection Associated RTP PU name section    *          
* ********************************************************************          
*                                                                               
*                                                                               
EECONN_RTPPUDATA DSECT    Associated RTP PU name section                        
EECONNP_NAME     DS 1CL8  RTP PU name, right padded with blanks                 
EECONN_RTPPUDATA_LEN EQU *-EECONN_RTPPUDATA                                     
*                                                                               
* ********************************************************************          
* * Enterprise Extender Connection Health Verification section       *          
* ********************************************************************          
*                                                                               
*                                                                               
EECONN_VERDATA   DSECT           EE Health verification section  @H1A           
EECONNHV_COMMON_DATA  DS 1CL48   EE health common information    @H1A           
         ORG   EECONNHV_COMMON_DATA                              @H1A           
EECONNHV_RSV1         DS 1CL4    Reserved                        @H1A           
EECONNHV_INTFNAME     DS 1CL16   Interface Name                  @H1A           
EECONNHV_INTFTYPE     DS 1CL16   Interface Type                  @H1A           
EECONNHV_RSV2         DS 1CL1    Reserved                        @H1A           
EECONNHV_COMMON_FLAGS DS 1CL1    Common Flags                    @H1A           
         ORG   EECONNHV_COMMON_FLAGS                             @H1A           
EECONNHV_NOROUTE   EQU X'80'     No route to destination from the      *        
                                 local EE TCP/IP stack           @H1A           
EECONNHV_NOSTORAGE EQU X'40'     FastUDP encountered storage           *        
                                 shortage                        @H1A           
EECONNHV_PBR       EQU X'20'     Policy Based routing used for         *        
                                 EE health verificatin           @H1A           
         ORG   EECONNHV_COMMON_FLAGS+X'00000001'                 @V1A           
EECONNHV_TOTALROUTES  DS 1FL1    Total routes found by TCP/IP    @H1A           
EECONNHV_RSV3         DS 1CL9    Available                       @H1A           
EECONNHV_PORT_DATA5   DS 5CL(EECONNHV_PORT_DATA_LEN) Five ports data   *        
                                 defined                         @H1A           
EECONNHV_VEREND       DS 0C      End of EE verification info     @H1A           
EECONN_VERDATA_LEN EQU *-EECONN_VERDATA                          @H1A           
*                                                                               
* ********************************************************************          
* * Enterprise Extender Connection Health Verification port data.    *          
* * There are five ports. EECONNHV_PORT_DATA5 contains five elements *          
* * of EECONNHV_PORT_DATA.                                       @H1A*          
* ********************************************************************          
*                                                                               
*                                                                               
EECONNHV_PORT_DATA DSECT         EE Health verification port     @H1A           
EECONNHV_RSV4         DS 1CL1    Reserved                        @H1A           
EECONNHV_PORT_FLAGS   DS 1CL1    Flags                           @H1A           
         ORG   EECONNHV_PORT_FLAGS                               @H1A           
EECONNHV_SUCCESS     EQU X'80'   Success test over this port     @H1A           
EECONNHV_EXPIRED     EQU X'40'   EE health ver time expired      @H1A           
EECONNHV_PBR_NOTRY   EQU X'20'   1=no test because of policy based     *        
                                 routing definitions             @H1A           
EECONNHV_PBR_NOROUTE EQU X'10'   1=no test because there was not       *        
                                 route calculated for this port  @H1A           
EECONNHV_HOP_LIMIT   EQU X'08'   Unable to reach the destination @H1A           
EECONNHV_ROUTE_LOOP  EQU X'04'   Detected a looping route, test        *        
                                 was terminated                  @H1A           
         ORG   EECONNHV_PORT_FLAGS+X'00000001'                   @V1A           
EECONNHV_RSV5         DS 1CL2    Reserved                        @H1A           
EECONNHV_SENSE        DS 1FL4    Received SENSE code             @H1A           
EECONNHV_HOP_DATA     DS 1CL24   EE Health Hop information       @H1A           
         ORG   EECONNHV_HOP_DATA                                 @H1A           
EECONNHV_IPV6         DS 1CL16   IPv6 Address                    @H1A           
         ORG   EECONNHV_IPV6                                     @H1A           
EECONNHV_IPV4         DS 1CL4    IPv4 Address                    @H1A           
EECONNHV_PAD1         DS 1CL12   Pad or part of IPv6 address     @H1A           
EECONNHV_RTT          DS 1FL2    Round Trip Time                 @H1A           
EECONNHV_ATTEMPTS     DS 1FL1    Number of Attempts              @H1A           
EECONNHV_ERROR_TYPE   DS 1FL1    ICMP or ICMPv6 Error Type       @H1A           
EECONNHV_ERROR_CODE   DS 1FL1    ICMP or IPMPv6 Error Code       @H1A           
EECONNHV_RSV6         DS 1CL3    Available                       @H1A           
EECONNHV_PORTEND      DS 0C      End of EE port data             @H1A           
EECONNHV_PORT_DATA_LEN EQU *-EECONNHV_PORT_DATA                  @H1A           
*                                                                               
* ********************************************************************          
* * Enterprise Extender Connection PBR data for Health Verification  *          
* * section                                                      @H1A*          
* ********************************************************************          
*                                                                               
*                                                                               
EECONN_PBRDATA   DSECT               EE Verification PBR data    @H1A           
EECONNHP_ROUTING_RULE_NAME  DS 1CL32 When EECONNHV_PBR=1 this is the   *        
                                     routing rule name for each of the *        
                                     EE ports                    @H1A           
EECONNHP_ROUTING_RULE_NAME4 DS 4CL32 Four more entries of Routing      *        
                                     Rule Name                   @H1A           
EECONNHP_ROUTE_TABLE_NAME   DS 1CL8  When EECONNHV_PBR=1 this is the   *        
                                     route table names being used for  *        
                                     each of the EE ports        @H1A           
EECONNHP_ROUTE_TABLE_NAME4  DS 4CL8  Four more entries of Route        *        
                                     Table Name                  @H1A           
EECONNHP_PBREND      DS 0C           End of EE PBR data          @H1A           
EECONN_PBRDATA_LEN EQU *-EECONN_PBRDATA                          @H1A           
*                                                                               
* ********************************************************************          
* * Eyecatcher constants for EE Connection records               @H1A*          
* ********************************************************************          
*                                                                               
*                                                                               
EECONN_ID EQU  C'EECO'   EE connection record                                   
*                                                                               
* ********************************************************************          
* * Constants for Triplet counts for the EE Connection record        *          
* ********************************************************************          
*                                                                               
*                                                                               
EECONN_TRIPLETCNT EQU 6  EE Connection record has six triplets   @H1C           
         MEND                                                                   
