         MACRO                                                                  
         ISTHPRCA                                                               
* ********************************************************************          
* *                                                                  *          
* * MACRO NAME: ISTHPRCA                                             *          
* *                                                                  *          
* * DESCRIPTIVE NAME:   NMI HPR Connection Mapping                   *          
* *                                                                  *          
* * Copyright: Licensed Materials - Property of IBM                  *          
* *            5694-A01 (C) Copyright IBM Corp. 2003, 2004           *          
* *            All rights reserved.                                  *          
* *            US Government Users Restricted Rights -               *          
* *            Use, duplication or disclosure restricted by          *          
* *            GSA ADP Schedule Contract with IBM Corp.              *          
* *            See IBM Copyright Instructions.                       *          
* *                                                                  *          
* *                                                                  *          
* *                                                                  *          
* * FUNCTION: Maps the record formats returned in response to        *          
* *           an Network Management HPR Connection request. The      *          
* *           records that can be returned are:                      *          
* *             (1) HPR Connection Global Record (one)               *          
* *             (2) HPR Connection Specific Record (one per HPR      *          
* *                 connection being reported)                       *          
* *                                                                  *          
* * STORAGE USED FOR CONTROL BLOCK:                                  *          
* *                                                                  *          
* *    ALLOCATED BY:                                                 *          
* *                                                                  *          
* *    FREED BY:                                                     *          
* *                                                                  *          
* *    POINTED TO BY:                                                *          
* *                                                                  *          
* *    TYPE:                                                         *          
* *                                                                  *          
* * ALIGNMENT:                                                       *          
* *       This control block MUST be on a DWORD boundary.            *          
* *                                                                  *          
* * OPERATING SYSTEM SPECIFICS:                                      *          
* *                                                                  *          
* * NOTES: None                                                      *          
* *                                                                  *          
* * SERIALIZATION CONCERNS:                                          *          
* *                                                                  *          
* * LIST RECOMPILE MODULES:                                          *          
* *                                                                  *          
* * CHANGE ACTIVITY:                                                 *          
* *                                                                  *          
* * $MAC(ISTHPRCA),COMP(MGMTSVC),PROD(VTAM): NMI HPR Connection      *          
* *                                          Mapping                 *          
* *                                                                  *          
* * FLAG REASON   RELEASE  DATE   ORIGIN    FLAG DESCRIPTORS         *          
* * ---- -------- -------  ------ --------  ------------------------ *          
* * $Q0= R16EEMGT CSV1R5   030603 VANZIMM : Create assembler macro   *          
* * $  = D132928  X16BASE  031013 RKunkel : Fix copyright statement  *          
* * $A1= OA31685  HVT61B0  100125 kunkel  : Document progressive mode*          
* *                                         ARB                      *          
* * $A2= OA37942  HVT61C0  111102 kunkel  : Report 4-Bit Pathswitch  *          
* *                                         reason to NMI            *          
* * $A3= OA52128  HVT6210  170221 kunkel  : Document HPRConnDS_State *          
* *                                         values                   *          
* * $A4= OA54244  HVT6210  171115 kunkel  : Correct ASMA144E error   *          
* *                                                                  *          
* ********************************************************************          
*                                                                               
HPRCONNGLOBAL        DSECT   HPR Connection Global Data record                  
ISTHPRCG             DS 0C                                                      
HPRCONNG_EYE         DS 1CL4 HPRConn EyeCatcher (HPRG)                          
HPRCONNG_LEN         DS 1FL4 Overall length of this record                      
HPRCONNG_RSV1        DS 1CL2 Reserved                                           
HPRCONNG_NUMTRIPLETS DS 1FL2 Number of triplets defined for this       *        
                             record                                             
HPRCONNG_TRIPLET     DS 1CL8 Only one triplet defined for this record  *        
                             This triplet is mapped by the             *        
                             EEHNMRECORDTRIPLET DSECT in ISTEEHNA MACRO         
HPRCONNG_END         DS 0C   End of record header                               
HPRCONNGLOBAL_LEN EQU *-HPRCONNGLOBAL                                           
*                                                                               
*                                                                               
HPRCONNGLOBALDATA       DSECT    HPR Connection Global Data section             
HPRCONNGD_ENDPOINT_NAME DS 1CL16 Node name of this VTAM                         
         ORG   HPRCONNGD_ENDPOINT_NAME                                          
HPRCONNGD_CPNETID       DS 1CL8  NETID                                          
HPRCONNGD_CPNAME        DS 1CL8  CPNAME                                         
HPRCONNGLOBALDATA_LEN EQU *-HPRCONNGLOBALDATA                                   
*                                                                               
*                                                                               
HPRCONNDATA          DSECT   HPR Connection Specific Data record                
ISTHPRCA             DS 0C                                                      
HPRCONND_EYE         DS 1CL4 HPRConn EyeCatcher (HPRC)                          
HPRCONND_LEN         DS 1FL4 Overall length of this record                      
HPRCONND_RSV1        DS 1CL2 Reserved                                           
HPRCONND_NUMTRIPLETS DS 1FL2 Number of triplets defined for this       *        
                             record                                    *        
                             These triplets are mapped by the          *        
                             EEHNMRECORDTRIPLET DSECT in ISTEEHNA MACRO         
HPRCONND_STTRIPLET   DS 1CL8 First triplet points to static data       *        
                             section                                            
HPRCONND_CVTRIPLET   DS 1CL8 Second triplet points to RSCV data        *        
                             section                                            
HPRCONND_PSTRIPLET   DS 1CL8 Third triplet points to pathswitch data   *        
                         (only present if at least one switch has      *        
                         occurred)                                              
HPRCONND_END         DS 0C       End of record header                           
HPRCONNDATA_LEN EQU *-HPRCONNDATA                                               
*                                                                               
*                                                                               
HPRCONNSPECIFICDATA   DSECT      HPR Connection Specific Data section           
HPRCONNDS_NAME                DS 1CL8 RTP PU Name                               
HPRCONNDS_FQ_PARTNER_NAME     DS 1CL16 FullyQualified Partner CPName            
         ORG   HPRCONNDS_FQ_PARTNER_NAME                                        
HPRCONNDS_CPNETID             DS 1CL8 NETID - destination                       
HPRCONNDS_CPNAME              DS 1CL8 CPNAME - destination                      
HPRCONNDS_LOCAL_NCB_PUNAME    DS 1CL8 Physical NCB PU Name                      
HPRCONNDS_FIRST_HOP           DS 1CL16 First Hop CPName                         
         ORG   HPRCONNDS_FIRST_HOP                                              
HPRCONNDS_FIRST_HOP_CPNETID   DS 1CL8 NETID                                     
HPRCONNDS_FIRST_HOP_CPNAME    DS 1CL8 CPNAME                                    
HPRCONNDS_NET_HEADER          DS 1CL2 NLH header                                
         ORG   HPRCONNDS_NET_HEADER                                             
HPRCONNDS_NET_HEAD_BIT        DS 1BL2 Net header overlay                        
         ORG   HPRCONNDS_NET_HEAD_BIT                                           
HPRCONNDS_ROUTING_MODE        EQU X'E0' Routing Mode                            
HPRCONNDS_TPF                 EQU X'06'  Transmission Priority                  
                              DS    1BL.009                                     
         ORG   HPRCONNDS_NET_HEADER+X'00000002'                                 
HPRCONNDS_FLAGS               DS 1BL2  Informational flags                      
         ORG   HPRCONNDS_FLAGS                                                  
HPRCONNDS_FLAGS1              DS 1BL1                                           
         ORG   HPRCONNDS_FLAGS1                                                 
HPRCONNDS_ARB_ALGORITHM       EQU X'C0' ARB Algorithm                  *        
                                          '00'B - Original             *        
                                          '01'B - Responsive Mode      *        
                                          '10'B - Progressive Mode @A1C         
HPRCONNDS_ARB_MODE            EQU X'30' ARB Pacing Mode                *        
                                          '00'B - Green mode           *        
                                          '01'B - Yellow mode          *        
                                          '10'B - Red mode                      
HPRCONNDS_ROLE                EQU X'0C' Passive or Active              *        
                                          '10'B - Active               *        
                                          '01'B - Passive                       
HPRCONNDS_MNPS                EQU X'02' RTP connection is being used   *        
                                        by an MNPS application                  
HPRCONNDS_DYNLU               EQU X'01' DYNLU support indicator                 
         ORG   HPRCONNDS_FLAGS1+X'00000001'                                     
HPRCONNDS_FLAGS2              DS 1BL1                                           
         ORG   HPRCONNDS_FLAGS2                                                 
HPRCONNDS_XNETALS             EQU X'80' XNETALS support indicator               
         ORG   HPRCONNDS_FLAGS+X'00000002'                                      
HPRCONNDS_STATE               DS 1FL1 RTP Connection State             *        
                                      See constants below                       
HPRCONNDS_COS_ORIGINAL        DS 1CL8 Original COS                              
                              DS 1CL3 Unused                                    
HPRCONNDS_DATA_TRANSFER_INFO_OUTBOUND DS 1CL28 OutBound data           *        
                                      transfer information                      
         ORG   HPRCONNDS_DATA_TRANSFER_INFO_OUTBOUND                            
HPRCONNDS_DATA_BYTES_SENT_INFO DS 1CL8                                          
         ORG   HPRCONNDS_DATA_BYTES_SENT_INFO                                   
HPRCONNDS_DATA_BYTES_SENT_OVERFLOW DS 1FL4 Overflow for                *        
                         HPRConn_Data_Bytes_Sent                                
HPRCONNDS_DATA_BYTES_SENT     DS 1FL4 Number of data bytes sent over   *        
                                      this RTP connection.                      
HPRCONNDS_TOTAL_BYTES_SENT_INFO DS 1CL8                                         
         ORG   HPRCONNDS_TOTAL_BYTES_SENT_INFO                                  
HPRCONNDS_TOTAL_BYTES_SENT_OVERFLOW DS 1FL4 Overflow for               *        
                                      HPRConn_Total_Bytes_Sent                  
HPRCONNDS_TOTAL_BYTES_SENT    DS 1FL4 Total number of bytes sent over  *        
                         this RTP connection. This includes data bytes *        
                         along with NLH, THDR and FID5                          
HPRCONNDS_NLPOUT_INFO         DS 1CL8                                           
         ORG   HPRCONNDS_NLPOUT_INFO                                            
HPRCONNDS_NLPOUT_OVERFLOW     DS 1FL4 Overflow for HPRConn_NLPOut_Count         
HPRCONNDS_NLPOUT_COUNT        DS 1FL4 Count of NLPs sent outbound               
HPRCONNDS_LARGEST_NLPOUT      DS 1FL2 Largest NLP sent                          
HPRCONNDS_NUM_REXMITTED_NLPS  DS 1FL2 Number of retransmitted NLPs              
HPRCONNDS_DATA_TRANSFER_INFO_INBOUND DS 1CL28 InBound data transfer    *        
                         information                                            
         ORG   HPRCONNDS_DATA_TRANSFER_INFO_INBOUND                             
HPRCONNDS_DATA_BYTES_RCV_INFO DS 1CL8                                           
         ORG   HPRCONNDS_DATA_BYTES_RCV_INFO                                    
HPRCONNDS_DATA_BYTES_RCV_OVERFLOW DS 1FL4 Overflow for                 *        
                         HPRConn_Data_Bytes_Rcv                                 
HPRCONNDS_DATA_BYTES_RCV      DS 1FL4 Number of data bytes received    *        
                                      over this RTP connection.                 
HPRCONNDS_TOTAL_BYTES_RCV_INFO DS 1CL8                                          
         ORG   HPRCONNDS_TOTAL_BYTES_RCV_INFO                                   
HPRCONNDS_TOTAL_BYTES_RCV_OVERFLOW DS 1FL4 Overflow for                *        
                                           HPRConn_Total_Bytes_Rcv              
HPRCONNDS_TOTAL_BYTES_RCV     DS 1FL4 Total number of bytes received   *        
                         over this RTP connection. This includes data  *        
                         bytes along with NLH, THDR and FID5                    
HPRCONNDS_NLPIN_INFO          DS 1CL8 Inbound Data                              
         ORG   HPRCONNDS_NLPIN_INFO                                             
HPRCONNDS_NLPIN_OVERFLOW      DS 1FL4 Overflow for HPRConn_NLPIn_Count          
HPRCONNDS_NLPIN_COUNT         DS 1FL4 Count of NLPs received inbound            
HPRCONNDS_LARGEST_NLPIN       DS 1FL2 Largest NLP received                      
HPRCONNDS_RSV1                DS 1FL2 Reserved                                  
HPRCONNDS_ARB_INFO            DS 1CL28 ARB Information                          
         ORG   HPRCONNDS_ARB_INFO                                               
HPRCONNDS_INITIAL_SEND_RATE   DS 1FL4 Initial Send Rate                         
HPRCONNDS_ALLOWED_SEND_RATE   DS 1FL4 Allowed Send Rate                         
*                                                                               
*      ***************************************************************          
*      *                                                             *          
*      * The next five threshholds are valid only if                 *          
*      * HPRConnDS_ARB_Algorithm indicates "ARB Responsive mode" or  *          
*      * "ARB Progressive mode" is being used.                   @A1C*          
*      *                                                             *          
*      ***************************************************************          
*                                                                               
*                                                                               
HPRCONNDS_MAXIMUM_SEND_RATE   DS 1FL4 Highwater mark for               *        
                                      HPRConnDS_Actual_Send_Rate                
HPRCONNDS_ACTUAL_SEND_RATE    DS 1FL4 Actual Send Rate                          
HPRCONNDS_ARB2_RCVR_THRESHOLD DS 1FL4 Current receiver threshold       *        
                                      (value in microsecs)                      
HPRCONNDS_ARB2_RCVR_THRESHOLD_MIN DS 1FL4 Min receiver threshold       *        
                                      (value in microsecs)                      
HPRCONNDS_ARB2_RCVR_THRESHOLD_MAX DS 1FL4 Max receiver threshold       *        
                                      (value in microsecs)                      
HPRCONNDS_QUEUE_INFO          DS 1CL28                                          
         ORG   HPRCONNDS_QUEUE_INFO                                             
HPRCONNDS_NUM_NLPS_ON_PENDING_SENDS_Q DS 1FL4 Number of NLPs on        *        
                                      RPNCB_PENDING_SENDS_Q                     
HPRCONNDS_NUM_NLPS_ON_OOSQ    DS 1FL4 Number of NLPs on the            *        
                                      RPN_OutOfSeq_Msg_Q                        
HPRCONNDS_NUM_NLPS_ON_IN_SEGMENTS_Q DS 1FL4 Number of NLPS on          *        
                                      contained within the             *        
                                      RPN_RCV_Segments_DaPtr                    
HPRCONNDS_WAIT_FOR_ACK_Q_INFO DS 1CL16                                          
         ORG   HPRCONNDS_WAIT_FOR_ACK_Q_INFO                                    
HPRCONNDS_NLPS_ON_WAIT_FOR_ACK_Q DS 1FL4 Number of NLPs on             *        
                                      RPNCB_WAIT_FOR_ACK_Q                      
HPRCONNDS_MAX_NUM_NLPS_ON_WAIT_FOR_ACK_Q DS 1FL4 High water mark for   *        
                                      the number of NLPs on            *        
                                      RPNCB_WAIT_FOR_ACK_Q                      
HPRCONNDS_MAX_NUM_NLPS_ON_WAIT_TOD DS 1CL8 TOD clock of high water     *        
                                      mark for number of NLPs on       *        
                                      RPNCB_WAIT_FOR_ACK_Q                      
HPRCONNDS_TIMER_INFO          DS 1CL12                                          
         ORG   HPRCONNDS_TIMER_INFO                                             
HPRCONNDS_SMOOTH_DEVIATION    DS 1FL4 Responsive mode ARB or           *        
                                      Progressive mode ARB smoothing   *        
                                      deviation.                  @A1C          
HPRCONNDS_SRTT                DS 1FL4 Smoothed roundtrip time in ms             
HPRCONNDS_LIVENESS_TIME       DS 1FL4 Liveness time length in seconds           
HPRCONNDS_LULU_SESSION_COUNT  DS 1FL4 Active LU-LU sessions using this *        
                                      RTP connection                            
HPRCONNDS_ACTIVATION_TOD      DS 1CL8 TOD HPR Pipe activated                    
HPRCONNDS_LOCAL_TCID          DS 1BL8 Local TCID                                
HPRCONNDS_REMOTE_TCID         DS 1BL8 Remote TCID                               
HPRCONNDS_LOCAL_NCE_INFO      DS 1CL9                                           
         ORG   HPRCONNDS_LOCAL_NCE_INFO                                         
HPRCONNDS_LOCAL_NCE_LEN       DS 1FL1 Local NCE length                          
HPRCONNDS_LOCAL_NCE           DS 1CL8 Local NCE                                 
HPRCONNDS_REMOTE_NCE_INFO     DS 1CL9                                           
         ORG   HPRCONNDS_REMOTE_NCE_INFO                                        
HPRCONNDS_NCE_ID_LEN          DS 1FL1 Remote NCEID length                       
HPRCONNDS_NCE_ID              DS 1CL8 Remote NCEID                              
HPRCONNDS_LOCAL_ANR_INFO      DS 1CL9 Local ANR information                     
         ORG   HPRCONNDS_LOCAL_ANR_INFO                                         
HPRCONNDS_LOCAL_ANR_LEN       DS 1FL1 Local ANR length                          
HPRCONNDS_LOCAL_ANR           DS 1CL8 Local ANR label outbound                  
HPRCONNDS_END DS 0C      End of HPR Connection Specific Data section            
HPRCONNSPECIFICDATA_LEN EQU *-HPRCONNSPECIFICDATA                               
*                                                                               
* ********************************************************************          
* * Mapping for the Route Selection Control Vector data. The route   *          
* * data may not be available if the connection is currently in the  *          
* * process of path switching.                                       *          
* ********************************************************************          
*                                                                               
*                                                                               
HPRCONNRSCVDATA DSECT    HPR Connection RSCV section                            
HPRCONNDR_RSCV DS 0C     RSCV data associated with the HPR connection. *        
                         The length of the RSCV is obtained from the   *        
                         appropriate triplet data. Please refer to the *        
                         Common Fields chapter of the                  *        
                         SNA Network Architecture - Network Products   *        
                         Formats manual. Specifically see the Route    *        
                         Selection (x'2B') Control Vector mapping      *        
                         to interpret the contents of this field.      *        
                                                             @A3C @A4C          
HPRCONNRSCVDATA_LEN EQU *-HPRCONNRSCVDATA                                       
*                                                                               
* ********************************************************************          
* * Mapping for the HPR Connection Pathswitch Data. This section     *          
* * will only be supplied if a pathswitch had occurred in the life   *          
* * of the HPR connection being reported.                            *          
* ********************************************************************          
*                                                                               
*                                                                               
HPRCONNPATHSWITCHDATA DSECT   HPR Connection Pathswitch data section            
HPRCONNDP_TOD_LAST_PATHSWITCH DS 1CL8 TOD when last path switch was    *        
                                      initiated                                 
HPRCONNDP_PS_FLAGS            DS 1CL1 Path Switch Flags                         
         ORG   HPRCONNDP_PS_FLAGS                                               
HPRCONNDP_IN_PS               EQU X'80' RTP pipe in currently in the   *        
                                       process of pathswitching        *        
                                         '1'B - Pipe is pathswitching  *        
                                         '0'B - Pipe is not switching           
HPRCONNDP_LAST_PS_REASON      EQU X'78' Last Path Switch Reason        *        
                                        See constants below       @A1C          
         ORG   HPRCONNDP_PS_FLAGS+X'00000001'                                   
HPRCONNDP_RSV1                DS    1CL1   Reserved                             
HPRCONNDP_CNT_PS_INITIATED_REM DS 1FL2 Number of Path switches         *        
                                       initiated by the remote RTP     *        
                                       partner                                  
HPRCONNDP_CNT_PS_INITIATED_LOC DS 1FL2 Total number of path switches   *        
                                       initiated by this node                   
HPRCONNDP_CNT_PS_DUE_TO_FAILURE DS 1FL2 Number of Path switches        *        
                         initiated by this node due to errors (i.e.,   *        
                         TGINOP, short response time retries, or no    *        
                         NCB)                                                   
HPRCONNDP_CNT_PS_DUE_TO_PSRETRY DS 1FL2 Number of Path switches        *        
                         initiated by this node due to PSRETRY.                 
HPRCONNDP_END DS 0C      End of Pathswitch Data                                 
*                                                                               
* ********************************************************************          
* * Eyecatcher constants for HPR Connection records                  *          
* ********************************************************************          
*                                                                               
*                                                                               
HPRCONNG_ID EQU C'HPRG'  HPR connection global record                           
HPRCONND_ID EQU C'HPRC'  HPR connection specific data record                    
*                                                                               
* ********************************************************************          
* * Constants for Triplet counts for the various records             *          
* ********************************************************************          
*                                                                               
*                                                                               
HPRCONNG_TRIPLETCNT EQU 1 HPR Connection Global record has one triplet          
HPRCONND_TRIPLETCNT EQU 3 HPR Conn Specific record has three triplets           
*                                                                               
* ********************************************************************          
* * Constants for ARB Algorithm                                      *          
* ********************************************************************          
*                                                                               
*                                                                               
HPRCONNDS_ARB_ORIGINAL   EQU B'00' ARB original mode                            
HPRCONNDS_ARB_RESPONSIVE EQU B'01' ARB responsive mode                          
HPRCONNDS_ARB_PROGRESSIVE EQU B'10' ARB progressive mode          @A1A          
*                                                                               
* ********************************************************************          
* * Constants for ARB Mode                                           *          
* ********************************************************************          
*                                                                               
*                                                                               
HPRCONNDS_ARB_GREENMODE EQU B'00' Green                                         
HPRCONNDS_ARB_YELLOWMODE EQU B'01' Yellow                                       
HPRCONNDS_ARB_REDMODE EQU B'10' Red                                             
*                                                                               
* ********************************************************************          
* * Constants for Endpoint Role                                      *          
* ********************************************************************          
*                                                                               
*                                                                               
HPRCONNDS_ROLE_ACTIVE EQU B'00001000' Active, or the node that setup   *        
                         the pipe                                               
HPRCONNDS_ROLE_PASSIVE EQU B'00000100' Passive, or the partner         *        
                         endpoint that was told to set up the pipe              
*                                                                               
* ********************************************************************          
* * Constants for Pathswitch reason codes : HPRConnDP_Last_PS_Reason *          
* ********************************************************************          
*                                                                               
*                                                                               
HPRCONNDP_PS_XMIT         EQU B'0001' Pathswitch initiated for         *        
                                      transmission stall recovery @A2A          
HPRCONNDP_PS_TGINOP       EQU B'0010' TG INOP condition was detected   *        
                                                                  @A2C          
HPRCONNDP_PS_SRTRETRY     EQU B'0100' Short request timer expiration   *        
                                                                  @A2C          
HPRCONNDP_PS_NONCB        EQU B'0110' No NCB was available to use @A2C          
HPRCONNDP_PS_MODIFY       EQU B'1000' Operator issued pathswitch       *        
                                      request                     @A2C          
HPRCONNDP_PS_AUTOSWTCH    EQU B'1010' Pathswitch driven due to         *        
                                      automatic retry timer       @A2C          
HPRCONNDP_PS_PARTNER      EQU B'1100' Partner initiated last switch    *        
                                                                  @A2C          
HPRCONNDP_PS_MNPS         EQU B'1110' Pathswitch initiated for MNPS    *        
                                      endpoint recovery           @A2A          
HPRCONNPATHSWITCHDATA_LEN EQU *-HPRCONNPATHSWITCHDATA                           
*                                                                               
* ********************************************************************          
* * Constants for RTP Connection State : HPRConnDS_State        @A3A *          
* ********************************************************************          
*                                                                               
*                                                                               
HPRConnDS_Initial         EQU X'00' INITIAL - Initial state at RTP     *        
                                    startup time                  @A3A          
HPRConnDS_ALS_PENDING     EQU X'0A' ALS_PENDING - RTP is waiting       *        
                                    for adjacent link station          *        
                                    processing                    @A3A          
HPRConnDS_ALS_ASSIGNED    EQU X'0F' ALS_ASSIGNED - Adjacent link       *        
                                    station processing is complete     *        
                                                                  @A3A          
HPRConnDS_OPENED          EQU X'14' OPENED - Initial state for the RTP *        
                                    active partner after startup  @A3A          
HPRConnDS_CALLING         EQU X'1E' CALLING- RTP active partner sending*        
                                    connection setup to the passive    *        
                                    RTP partner                   @A3A          
HPRConnDS_LISTENING       EQU X'28' LISTENING - Initial state for the  *        
                                    passive RTP partner after startup  *        
                                                                  @A3A          
HPRConnDS_CONNECTED       EQU X'32' CONNECTED - RTP is active     @A3A          
HPRConnDS_GONE            EQU X'3C' GONE - RTP has completed cleanup   *        
                                    processing                    @A3A          
HPRConnDS_DISCONNECT      EQU X'46' DISCONNECT - RTP is performing     *        
                                    disconnect processing         @A3A          
HPRConnDS_PENDING_ACT     EQU X'50' PENDING_ACT - RTP is waiting       *        
                                    for activation to complete    @A3A          
HPRConnDS_PENDING_INACT   EQU X'5A' PENDING_INACT - RTP is waiting     *        
                                    for deactivation to complete  @A3A          
HPRConnDS_RECOVERY        EQU X'64' MNPS RECOVERY - Multinode          *        
                                    persistent session recovery is     *        
                                    in progress                   @A3A          
HPRConnDS_PENDING_TAKEOVER EQU X'6E' MNPS PENDING TAKEOVER - Multinode *        
                                     persistent session planned        *        
                                     takeover is in progress      @A3A          
         MEND                                                                   
