         MACRO                                                                  
&NAME    ISTRPL6 &CD=,                                                 X        
               &CONMODE=,                                              X        
               &CONXMOD=,                                              X        
               &FILL=,                                                 X        
               &LOCKS=,                                                X        
               &LOGMODE=,                                              X        
               &LUAFFIN=,                                              X        
               &LUNAME=,                                               X        
               &NAMEUSE=,                                              X        
               &NETID=,                                                X        
               &QUALIFY=,                                              X        
               &RTSRTRN=,                                              X        
               &SENSE=,                                                X        
               &TYPE=,                                                 X        
               &USERFLD=,                                              X        
               &VTRINA=,                                               X        
               &VTRINL=,                                               X        
               &VTROUTA=,                                              X        
               &VTROUTL=                                     @S1C @L3C          
.* /***** START OF SPECIFICATIONS ************************************/         
.* /*                                                                */         
.* /*  MACRO NAME: ISTRPL6                                           */         
.* /*                                                                */         
.* /*  DESCRIPTIVE NAME:                                             */         
.* /*     CREATE A RPL APPC/VTAM EXTENSION                           */         
.* /*                                                                */         
.* /*  COPYRIGHT: LICENSED MATERIALS - PROPERTY OF IBM               */         
.* /*                                                                */         
.* /*             THIS PRODUCT CONTAINS "RESTRICTED MATERIALS OF IBM"*/         
.* /*                                                                */         
.* /*             5694-A01 (C) COPYRIGHT IBM CORP. 1987, 2001.       */         
.* /*             ALL RIGHTS RESERVED.                               */         
.* /*                                                                */         
.* /*             U.S. GOVERNMENT USERS RESTRICTED RIGHTS -          */         
.* /*             USE, DUPLICATION OR DISCLOSURE RESTRICTED BY       */         
.* /*             GSA ADP SCHEDULE CONTRACT WITH IBM CORP.           */         
.* /*                                                                */         
.* /*             SEE COPYRIGHT INSTRUCTIONS.                        */         
.* /*                                                                */         
.* /*                                                                */         
.* /*  FUNCTION:                                                     */         
.* /*    THE FUNCTION OF THIS MACRO IS TO BUILD, AT ASSEMBLY         */         
.* /*    TIME, AN RPL6(RPL APPC/VTAM EXTENSION) FOR APPC USERS.      */         
.* /*    THE RPL6 IS USED TO STORE THE INFORMATION THAT WILL BE      */         
.* /*    USED BY THE ACF/VTAM APPC CODE TO PERFORM ITS FUNCTION.     */         
.* /*                                                                */         
.* /*                                                                */         
.* /*  NOTES:                                                        */         
.* /*                                                                */         
.* /*                                                                */         
.* /*  PROCESSOR: ASSEMBLER                                          */         
.* /*                                                                */         
.* /*  CREATED BY:                                                   */         
.* /*                                                                */         
.* /*  INTERNAL MACROS:                                              */         
.* /*                                                                */         
.* /*  EXTERNAL REFERENCES: NONE                                     */         
.* /*                                                                */         
.* /*  CHANGE ACTIVITY:                                              */         
.* /*    12/08/86 - ADD RPL6STBF & RPL6STDS FOR STG SHORTAGE @P043961*/         
.* /*    07/11/88 - ADD CD= KEYWORD FOR RECEIVE              @P058398*/         
.* /*    08/17/88 - ADD THE CHECK FOR QUALIFY=CONWIN         @P059623*/         
.* /*                                                                */         
.* /* $MAC(ISTRPL6),COMP(API),PROD(VTAM): CREATE A RPL APPC/VTAM     */         
.* /*                                     EXTENSION                  */         
.* /*                                                                */         
.* /* FLAG REASON   RELEASE DATE   ORIGIN  FLAG DESCRIPTORS          */         
.* /* ---- -------- ------- ------ ------  ------------------------- */         
.* /* $F1= FS1@@CLD HVT3302 880504 255471: SYNCPOINT SUPPORT         */         
.* /* $Q1= P060480  HVT3302 880906 255471: ADD .* FOR CONTINUATION   */         
.* /* $Q2= P059623  HVT3302 880817 255471: ADD THE CHECK FOR         */         
.* /*                                      QUALIFY=CONWIN            */         
.* /* $F2= RCR0004  HVT3302 880907 255471: SYNCPOINT RCR SUPPORT     */         
.* /* $B1= AP@@@CLD HVT3401 890516 496698: PERSISTENT LU-LU SESSIONS */         
.* /* $BB= ACC@@AMS HVT3401 891025 615520: PL/AS CONVERSION          */         
.* /* $V1= P082013  HVT3401 900828 474203: Syncpoint processing for  */         
.* /*                                      persistent applications   */         
.* /* $KF= S4N@@CLD HATAPPN 910326 692313: CP-CP SESSIONS            */         
.* /* $KG= NQNSTG2  NQNAME2 910628 457572: ENHANCED NQN SUPPORT (2)  */         
.* /* $KH= SZADR001 ALWFREE 910814 584390: APPC ALLOCATE Enhancement */         
.* /* $I1= BR@@@MST APPCE01 911108 510689: APPC Receive Immediate    */         
.* /* $I2= FF@@@MST APPCFDX 911231 879315: APPC Full-Duplex support  */         
.* /* $I3= FT@@@MST APPCTST 920218 510689: APPC TestStat             */         
.* /* $L1= KA@@@PLD APPCRR  930810 446638: DCE Security Services     */         
.* /* $U2= P110887  GENRES  931024 879315: Generic Resource support  */         
.* /* $L2= KA@DR006 APPCRR  940713 576146: Vector Format             */         
.* /* $D1= IA@@@MST V51APPC 941121 941213: APPCCMD enhancements      */         
.* /* $S1= P119717  FPAPI   950914 879315: Fastpath API for APPC     */         
.* /* Flag Reason   Release  Date   Origin    Description            */         
.* /* ---- -------- -------- ------ --------  ---------------------- */         
.* /* $L3= R12GRAFF CSV1R2   000829 ROTHWELL: LU level GR AFFIN      */         
.* /***** END OF SPECIFICATIONS **************************************/         
.*                                                                              
.* A-000000-999999                                             @R495810         
.*                                                                              
*                                                                               
* COPYRIGHT: LICENSED MATERIALS - PROPERTY OF IBM                               
*                                                                               
*            THIS PRODUCT CONTAINS "RESTRICTED MATERIALS OF IBM"                
*                                                                               
*            5695-117 (C) COPYRIGHT IBM CORP. 1987, 1994.                       
*            ALL RIGHTS RESERVED.                                               
*                                                                               
*            U.S. GOVERNMENT USERS RESTRICTED RIGHTS -                          
*            USE, DUPLICATION OR DISCLOSURE RESTRICTED BY                       
*            GSA ADP SCHEDULE CONTRACT WITH IBM CORP.                           
*                                                                               
*            SEE COPYRIGHT INSTRUCTIONS.                                        
*                                                                               
*                                                                               
         LCLA  &NUM                                                             
         LCLA  &LEN                                                             
         LCLB  &CDBIT              CD INDICATOR                @P058398         
         LCLB  &FILLBIT            FILL INDICATOR                               
         LCLB  &LOCKBIT            LOCKS INDICATOR                              
         LCLB  &TYPEB1             TYPE INDICATOR - FIRST BIT                   
         LCLB  &TYPEB2             TYPE INDICATOR - SECOND BIT                  
         LCLB  &CMODB1             CONMODE INDICATOR - FIRST BIT                
         LCLB  &CMODB2             CONMODE INDICATOR - SECOND BIT               
         LCLB  &CXMDB1             CONXMOD INDICATOR - FIRST BIT   @I2A         
         LCLB  &CXMDB2             CONXMOD INDICATOR - SECOND BIT  @I2A         
         LCLB  &NAMUB1             NAMEUSE INDICATOR - FIRST BIT   @U2A         
         LCLB  &NAMUB2             NAMEUSE INDICATOR - SECOND BIT  @U2A         
         LCLB  &LUAF1,&LUAF2       LUAFFIN INDICATOR BITS          @L3A         
         LCLB  &RTSRBIT            RTSRTRN INDICATOR               @I2A         
         LCLC  &CHAR,&CHAR1,&CHAR2,&CHAR3,&CHAR4                                
.*                                                                              
&LEN     SETA  4                                                                
&CDBIT   SETB  0                                               @P058398         
&FILLBIT SETB  0                                                                
&LOCKBIT SETB  0                                                                
&TYPEB1  SETB  0                                                                
&TYPEB2  SETB  0                                                                
&CMODB1  SETB  0                                                                
&CMODB2  SETB  0                                                                
&CXMDB1  SETB  0                                                   @I2A         
&CXMDB2  SETB  0                                                   @I2A         
&NAMUB1  SETB  0                                                   @U2A         
&NAMUB2  SETB  0                                                   @U2A         
&LUAF1   SETB  0                                                   @L3A         
&LUAF2   SETB  0                                                   @L3A         
&RTSRBIT SETB  0                                                   @I2A         
.*                                                                              
&NAME    DS    0F                  START OF LU 6.2 EXTENSION TO THE RPL         
         DC    C'APPC'             ACRONYM IN EBCDIC                            
.*                                                                              
         DC    X'00'               TYPE OF APPCCMD                              
.*                                                                              
         AIF   ('&QUALIFY' NE '').QUALN    IS "QUALIFY=" SPECIFIED @L1C         
         DC    X'00'               SUBTYPE OF APPCCMD                           
         AGO   .ENDQUAL                                                         
.QUALN   ANOP                                                      @L1A         
         AIF   ('&QUALIFY' NE 'NULL').QUAL1  IS "QUALIFY=NULL"?    @L1A         
         DC    X'00'               QUALIFY=NULL                    @L1A         
         AGO   .ENDQUAL                                            @L1A         
.QUAL1   ANOP                                                                   
         AIF   ('&QUALIFY' NE 'ABNDPROG').QUAL2  IS "QUALIFY=ABNDPROG"?         
         DC    X'01'               QUALIFY=ABNDPROG                             
         AGO   .ENDQUAL                                                         
.QUAL2   ANOP                                                                   
         AIF   ('&QUALIFY' NE 'ABNDSERV').QUAL3  IS "QUALIFY=ABNDSERV"?         
         DC    X'02'               QUALIFY=ABNDSERV                             
         AGO   .ENDQUAL                                                         
.QUAL3   ANOP                                                                   
         AIF   ('&QUALIFY' NE 'ABNDTIME').QUAL4  IS "QUALIFY=ABNDTIME"?         
         DC    X'03'               QUALIFY=ABNDTIME                             
         AGO   .ENDQUAL                                                         
.QUAL4   ANOP                                                                   
         AIF   ('&QUALIFY' NE 'ABNDUSER').QUAL5  IS "QUALIFY=ABNDUSER"?         
         DC    X'04'               QUALIFY=ABNDUSER                             
         AGO   .ENDQUAL                                                         
.QUAL5   ANOP                                                                   
         AIF   ('&QUALIFY' NE 'ANY').QUAL6      IS "QUALIFY=ANY"?               
         DC    X'05'               QUALIFY=ANY                                  
         AGO   .ENDQUAL                                                         
.QUAL6   ANOP                                                                   
         AIF   ('&QUALIFY' NE 'CNOS').QUAL7     IS "QUALIFY=CNOS"?              
         DC    X'06'               QUALIFY=CNOS                                 
         AGO   .ENDQUAL                                                         
.QUAL7   ANOP                                                                   
         AIF   ('&QUALIFY' NE 'CONFIRM').QUAL8  IS "QUALIFY=CONFIRM"?           
         DC    X'07'               QUALIFY=CONFIRM                              
         AGO   .ENDQUAL                                                         
.QUAL8   ANOP                                                                   
         AIF   ('&QUALIFY' NE 'CONFRMD').QUAL9  IS "QUALIFY=CONFRMD"?           
         DC    X'08'               QUALIFY=CONFRMD                              
         AGO   .ENDQUAL                                                         
.QUAL9   ANOP                                                                   
         AIF   ('&QUALIFY' NE 'DATA').QUAL10    IS "QUALIFY=DATA"?              
         DC    X'09'               QUALIFY=DATA                                 
         AGO   .ENDQUAL                                                         
.QUAL10  ANOP                                                                   
         AIF   ('&QUALIFY' NE 'DATACON').QUAL11 IS "QUALIFY=DATACON"?           
         DC    X'0A'               QUALIFY=DATACON                              
         AGO   .ENDQUAL                                                         
.QUAL11  ANOP                                                                   
         AIF   ('&QUALIFY' NE 'DATAFLU').QUAL12 IS "QUALIFY=DATAFLU"?           
         DC    X'0B'               QUALIFY=DATAFLU                              
         AGO   .ENDQUAL                                                         
.QUAL12  ANOP                                                                   
         AIF   ('&QUALIFY' NE 'DEFINE').QUAL13  IS "QUALIFY=DEFINE"?            
         DC    X'0C'               QUALIFY=DEFINE                               
         AGO   .ENDQUAL                                                         
.QUAL13  ANOP                                                                   
         AIF   ('&QUALIFY' NE 'DISPLAY').QUAL14 IS "QUALIFY=DISPLAY"?           
         DC    X'0D'               QUALIFY=DISPLAY                              
         AGO   .ENDQUAL                                                         
.QUAL14  ANOP                                                                   
         AIF   ('&QUALIFY' NE 'ERROR').QUAL15   IS "QUALIFY=ERROR"?             
         DC    X'0E'               QUALIFY=ERROR                                
         AGO   .ENDQUAL                                                         
.QUAL15  ANOP                                                                   
         AIF   ('&QUALIFY' NE 'FLUSH').QUAL16   IS "QUALIFY=FLUSH"?             
         DC    X'0F'               QUALIFY=FLUSH                                
         AGO   .ENDQUAL                                                         
.QUAL16  ANOP                                                                   
         AIF   ('&QUALIFY' NE 'RQSEND').QUAL17  IS "QUALIFY=RQSEND"?            
         DC    X'10'               QUALIFY=RQSEND                               
         AGO   .ENDQUAL                                                         
.QUAL17  ANOP                                                                   
         AIF   ('&QUALIFY' NE 'SPEC').QUAL18    IS "QUALIFY=SPEC"?              
         DC    X'11'               QUALIFY=SPEC                                 
         AGO   .ENDQUAL                                                         
.QUAL18  ANOP                                                                   
         AIF   ('&QUALIFY' NE 'ACTSESS').QUAL19 IS "QUALIFY=ACTSESS"?           
         DC    X'12'               QUALIFY=ACTSESS                              
         AGO   .ENDQUAL                                                         
.QUAL19  ANOP                                                                   
         AIF   ('&QUALIFY' NE 'DACTSESS').QUAL20 IS "QUALIFY=DACTSESS"?         
         DC    X'13'               QUALIFY=DACTSESS                             
         AGO   .ENDQUAL                                                         
.QUAL20  ANOP                                                                   
         AIF   ('&QUALIFY' NE 'ALLOCD').QUAL21 IS "QUALIFY=ALLOCD"?             
         DC    X'14'               QUALIFY=ALLOCD                               
         AGO   .ENDQUAL                                                         
.QUAL21  ANOP                                                                   
         AIF   ('&QUALIFY' NE 'IMMED').QUAL22 IS "QUALIFY=IMMED"?               
         DC    X'15'               QUALIFY=IMMED                                
         AGO   .ENDQUAL                                                         
.QUAL22  ANOP                                                      @Q2A         
         AIF   ('&QUALIFY' NE 'CONWIN').QUAL23 IS "QUALIFY=CONWIN"?             
         DC    X'16'               QUALIFY=CONWIN                               
         AGO   .ENDQUAL                                                         
.QUAL23  ANOP                                                      @F1A         
         AIF   ('&QUALIFY' NE 'SESSION').QUAL24 IS "QUALIFY=SESSION"?           
         DC    X'17'               QUALIFY=SESSION                              
         AGO   .ENDQUAL                                                         
.QUAL24  ANOP                                                                   
         AIF   ('&QUALIFY' NE 'CONV').QUAL25 IS "QUALIFY=CONV"?    @F1A         
         DC    X'18'               QUALIFY=CONV                                 
         AGO   .ENDQUAL                                                         
.QUAL25  ANOP                                                      @F2A         
         AIF   ('&QUALIFY' NE 'SUSPEND').QUAL26 IS "QUALIFY=SUSPEND"?           
         DC    X'19'               QUALIFY=SUSPEND                              
         AGO   .ENDQUAL                                                         
.QUAL26  ANOP                                                      @F2A         
         AIF   ('&QUALIFY' NE 'RESUME').QUAL27 IS "QUALIFY=RESUME"?             
         DC    X'1A'               QUALIFY=RESUME                               
         AGO   .ENDQUAL                                                         
.QUAL27  ANOP                                                      @B1A         
         AIF   ('&QUALIFY' NE 'RESTORE').QUAL28 IS "QUALIFY=RESTORE"?           
         DC    X'1B'               QUALIFY=RESTORE                              
         AGO   .ENDQUAL                                                         
.QUAL28  ANOP                                                      @V1A         
         AIF   ('&QUALIFY' NE 'SYNCBEG').QUAL29 IS "QUALIFY=SYNCBEG"?           
         DC    X'1C'               QUALIFY=SYNCBEG                              
         AGO   .ENDQUAL                                                         
.QUAL29  ANOP                                                      @V1A         
         AIF   ('&QUALIFY' NE 'SYNCEND').QUAL30 IS "QUALIFY=SYNCEND"?           
         DC    X'1D'               QUALIFY=SYNCEND                              
         AGO   .ENDQUAL                                                         
.QUAL30  ANOP                                                      @KFA         
         AIF   ('&QUALIFY' NE 'CONVGRP').QUAL31 IS "QUALIFY=CONVGRP"?           
         DC    X'1E'               QUALIFY=CONVGRP                              
         AGO   .ENDQUAL                                                         
.QUAL31  ANOP                                                      @KHA         
         AIF   ('&QUALIFY' NE 'WHENFREE').QUAL32 IS "QUALIFY=WHENFREE"?         
         DC    X'1F'               QUALIFY=WHENFREE                @KHA         
         AGO   .ENDQUAL                                            @KHA         
.QUAL32  ANOP                                                      @V1C         
         AIF   ('&QUALIFY' NE 'IANY').QUAL33 IS "QUALIFY=IANY"?    @I1A         
         DC    X'20'               QUALIFY=IANY                    @I1A         
         AGO   .ENDQUAL                                            @I1A         
.QUAL33  ANOP                                                      @I1A         
         AIF   ('&QUALIFY' NE 'ISPEC').QUAL34 IS "QUALIFY=ISPEC"?  @I1A         
         DC    X'21'               QUALIFY=ISPEC                   @I1A         
         AGO   .ENDQUAL                                            @I1A         
.QUAL34  ANOP                                                      @I1A         
         AIF   ('&QUALIFY' NE 'ALL').QUAL35 IS "QUALIFY=ALL"?      @I3A         
         DC    X'22'               QUALIFY=ALL                     @I3A         
         AGO   .ENDQUAL                                            @I3A         
.QUAL35  ANOP                                                      @I3A         
         AIF   ('&QUALIFY' NE 'IALL').QUAL36 IS "QUALIFY=IALL"?    @I3A         
         DC    X'23'               QUALIFY=IALL                    @I3A         
         AGO   .ENDQUAL                                            @I3A         
.QUAL36  ANOP                                                      @I3A         
         AIF   ('&QUALIFY' NE 'QUEUE').QUAL37 IS "QUALIFY=QUEUE"?  @D1A         
         DC    X'24'               QUALIFY=QUEUE                   @D1A         
         AGO   .ENDQUAL                                            @D1A         
.QUAL37  ANOP                                                      @D1A         
         AIF   ('&QUALIFY' NE 'DATAQUE').QUAL38 IS "QUALIFY=DATAQUE"?           
         DC    X'25'               QUALIFY=DATAQUE                 @D1A         
         AGO   .ENDQUAL                                            @D1A         
.QUAL38  ANOP                                                      @D1A         
         IST6MCER 5,QUALIFY,&QUALIFY            INVALID "QUALIFY="VALUE         
         DC    X'00'               SUBTYPE OF APPCCMD                           
.ENDQUAL ANOP                                                                   
         DC    XL2'0'              RESERVED                                     
         DC    XL4'0'              CONVERSATION ID                              
.*                                                                              
         AIF   ('&USERFLD' NE '').USF1          IS "USERFLD=" SPECIFIED         
.*                                              NO - SET TO ZEROS               
         DC    XL4'0'              USER FIELD                                   
         AGO   .USF5                                                            
.USF1    ANOP                                                                   
&CHAR1   SETC  '&USERFLD'(1,2)                                                  
&NUM     SETA  K'&USERFLD                                                       
&CHAR2   SETC  '&USERFLD'(&NUM,1)                                               
         AIF   ('&CHAR1' EQ 'C''').CKQ                                          
         AIF   ('&CHAR1' NE 'X''').USF11                                        
&LEN     SETA  8                                                                
         AGO   .CKQ                                                             
.USF11   AIF   ('&CHAR1' EQ 'F''').CKQ                                          
         AIF   ('&CHAR1' EQ 'A(').CKP                                           
         AIF   ('&CHAR1' EQ 'V(').CKP                                           
         IST6MCER 11,USERFLD                                                    
         DC    XL4'0'              USER FIELD                                   
         AGO   .USF5                                                            
.CKP     AIF   ('&CHAR2' EQ ')').USF3                                           
         AGO   .USF2                                                            
.CKQ     AIF   ('&CHAR2' EQ '''').USF3                                          
.USF2    IST6MCER 12,USERFLD                                                    
         DC    XL4'0'              USER FIELD                                   
         AGO   .USF5                                                            
.USF3    ANOP                                                                   
&NUM     SETA  &NUM-3                                                           
         AIF   (&NUM GT &LEN).USF4                                              
&CHAR3   SETC  '&USERFLD'(3,&NUM)                                               
&CHAR4   SETC  '&CHAR1'(2,1)                                                    
&CHAR1   SETC  '&CHAR1'(1,1)                                                    
&CHAR    SETC  '&CHAR1.L4&CHAR4&CHAR3&CHAR2'                                    
         DC    &CHAR               USER FIELD                                   
         AGO   .USF5                                                            
.USF4    ANOP                                                                   
         IST6MCER 10,USERFLD,4                                                  
         DC    XL4'0'              USER FIELD                                   
.USF5    ANOP                                                                   
.*                                                                              
         AIF   ('&SENSE' NE '').SENS1           IS "SENSE=" SPECIFIED           
.*                                              NO - SET TO ZEROS               
         DC    XL4'0'              OUTBOUND SENSE DATA                          
         AGO   .SENS5                                                           
.SENS1   ANOP                                                                   
&NUM     SETA  K'&SENSE                                                         
&CHAR1   SETC  '&SENSE'(1,2)                                                    
&CHAR2   SETC  '&SENSE'(&NUM,1)                                                 
         AIF   ('&CHAR1' NE 'X''').SENS2                                        
         AIF   ('&CHAR2' NE '''').SENS3                                         
&NUM     SETA   &NUM-3                                                          
         AIF   (&NUM GT 8).SENS4                                                
&CHAR3   SETC  '&SENSE'(3,&NUM)                                                 
         DC    XL4'&CHAR3'         OUTBOUND SENSE DATA                          
         AGO   .SENS5                                                           
.SENS2   ANOP                                                                   
         IST6MCER 11,SENSE                                                      
         DC    XL4'0'              OUTBOUND SENSE DATA                          
         AGO   .SENS5                                                           
.SENS3   ANOP                                                                   
         IST6MCER 12,SENSE                                                      
         DC    XL4'0'              OUTBOUND SENSE DATA                          
         AGO   .SENS5                                                           
.SENS4   ANOP                                                                   
         IST6MCER 10,SENSE,4                                                    
         DC    XL4'0'              OUTBOUND SENSE DATA                          
.SENS5   ANOP                                                                   
.*                                                                              
         DC    XL4'0'              SENSE DATA RETURNED BY APPCCMD               
         DC    XL4'0'              SIGNAL DATA RETURNED                         
         DC    X'00'               LENGTH OF SESSION IDENTIFICATION             
         DC    XL3'0'              RESERVED                                     
         DC    XL8'0'              SESSION IDENTIFICATION                       
         DC    XL2'0'              PRIMARY RETURN CODE                          
         DC    XL2'0'              SECONDARY RETURN CODE                        
.*                                                                              
         DS    0F                  RPL6FLGS                                     
         AIF   ('&FILL' EQ '').FIL1             IS FILL SPECIFIED?              
         AIF   ('&FILL' NE 'LL').FIL2           IS "FILL=LL"?                   
.*                                              YES - CONTINUE                  
.FIL1    ANOP                                                                   
&FILLBIT SETB  1                                YES - SET LL ON                 
         AGO   .FIL4                                                            
.*                                              NO - CONTINUE                   
.FIL2    ANOP                                                                   
         AIF   ('&FILL' NE 'BUFF').FIL3         IS "FILL=BUFF"?                 
         AGO   .FIL4                                                            
.*                                              NO - CONTINUE                   
.FIL3    ANOP                                                                   
         IST6MCER 5,FILL,&FILL                                                  
.FIL4    ANOP                                                                   
         AIF   ('&CD' EQ '').CD4                CD= SPECIFIED?                  
         AIF   ('&CD' NE 'DEFER').CD2           IS "CD=DEFER"?                  
.*                                              YES - CONTINUE                  
.CD1     ANOP                                                                   
&CDBIT   SETB  1                                YES - SET CD ON                 
         AGO   .CD4                                                             
.*                                              NO - CONTINUE                   
.CD2     ANOP                                                                   
         AIF   ('&CD' NE 'IMMED').CD3           IS "CD=IMMED"?                  
         AGO   .CD4                                                             
.*                                              NO - CONTINUE                   
.CD3     ANOP                                                                   
         IST6MCER 5,CD,&CD                                                      
.CD4     ANOP                                                                   
         DC    B'&FILLBIT.&CDBIT.000000'                                        
         AIF   ('&RTSRTRN' EQ '').RTSR4    RTSRTRN= SPECIFIED?     @I2A         
         AIF   ('&RTSRTRN' NE 'BOTH').RTSR2  IS "RTSRTRN=BOTH"?    @I2A         
.RTSR1   ANOP                                                      @I2A         
.*                                         BIT IS INITIALIZED TO   @I2A         
.*                                         RTSRTRN=BOTH (DEFAULT)  @I2A         
         AGO   .RTSR4                                              @I2A         
.RTSR2   ANOP                                                      @I2A         
         AIF   ('&RTSRTRN' NE 'EXPD').RTSR3  IS "RTSRTRN=EXPD"?    @I2A         
&RTSRBIT SETB  1                           YES - SET BIT ON        @I2A         
         AGO   .RTSR4                                              @I2A         
.RTSR3   ANOP                                                      @I2A         
         IST6MCER 5,RTSRTRN,&RTSRTRN                               @I2A         
.RTSR4   ANOP                                                      @I2A         
         AIF   ('&CONXMOD' EQ '').CXMD5    IS "CONXMOD=" SPECIFIED @I2A         
         AIF   ('&CONXMOD' NE 'CS').CXMD2  IS "CONXMOD=CS"?        @I2A         
.CXMD1   ANOP                                                      @I2A         
.*                                         BITS ARE INITIALIZED TO @I2A         
.*                                         CONXMOD=CS (DEFAULT)    @I2A         
         AGO   .CXMD5                                              @I2A         
.CXMD2   ANOP                                                      @I2A         
         AIF   ('&CONXMOD' NE 'CA').CXMD3  IS "CONXMOD=CA"?        @I2A         
&CXMDB2  SETB  1                           SET BIT ON TO INDICATE  @I2A         
.*                                         CONXMOD=CA              @I2A         
         AGO   .CXMD5                                              @I2A         
.CXMD3   ANOP                                                      @I2A         
         AIF   ('&CONXMOD' NE 'SAME').CXMD4  IS CONXMOD=SAME ?     @I2A         
&CXMDB1  SETB  1                           SET BIT ON TO INDICATE  @I2A         
&CXMDB2  SETB  1                           CONXMOD=SAME(2 BITS)    @I2A         
         AGO   .CXMD5                                              @I2A         
.CXMD4   ANOP                                                      @I2A         
         IST6MCER 5,CONXMOD,&CONXMOD                               @I2A         
.CXMD5   ANOP                                                      @I2A         
         AIF   ('&TYPE' EQ '').TYP5     IS TYPE SPECIFIED?                      
.*                                      YES - CONTINUE                          
.TYP1    ANOP                                                                   
         AIF   ('&TYPE' NE 'PROGRAM').TYP2      IS "TYPE=PROGRAM"?              
&TYPEB2  SETB  1                                YES - SET PROG ON               
         AGO   .TYP5                                                            
.*                                              NO - CONTINUE                   
.TYP2    ANOP                                                                   
         AIF   ('&TYPE' NE 'SERVICE').TYP3      IS "TYPE=SERVICE"?              
&TYPEB1  SETB  1                                      SET SVC ON                
         AGO   .TYP5                                                            
.*                                              NO - CONTINUE                   
.TYP3    ANOP                                                                   
         AIF   ('&TYPE' NE 'USER').TYP4         IS "TYPE=USER"?                 
&TYPEB1  SETB  1                                                                
&TYPEB2  SETB  1                                                                
         AGO   .TYP5                                                            
.TYP4    ANOP                                                                   
         IST6MCER 5,TYPE,&TYPE                                                  
.TYP5    ANOP                                                                   
         AIF   ('&NAMEUSE' NE '').NAMU2    IS "NAMEUSE=" OMITTED   @U2A         
.NAMU1   ANOP                                                      @U2A         
.*                                  BITS ARE INITIALIZED TO ZERO   @U2A         
.*                                  FOR UNSPECIFIED NAMEUSE        @U2A         
         AGO   .NAMU5                                              @U2A         
.NAMU2   ANOP                                                      @U2A         
         AIF   ('&NAMEUSE' NE 'APNAME').NAMU3  IS "NAMEUSE=APNAME" @U2A         
&NAMUB1  SETB  1                    SET BIT ON FOR NAMEUSE=APNAME  @U2A         
         AGO   .NAMU5                                              @U2A         
.NAMU3   ANOP                                                      @U2A         
         AIF   ('&NAMEUSE' NE 'GNAME').NAMU4  IS "NAMEUSE=GNAME"   @U2A         
&NAMUB2  SETB  1                    SET BIT ON FOR NAMEUSE=GNAME   @U2A         
         AGO   .NAMU5                                              @U2A         
.NAMU4   ANOP                                                      @U2A         
         IST6MCER 5,NAMEUSE,&NAMEUSE                               @U2A         
.NAMU5   ANOP                                                      @U2A         
         DC    B'0&RTSRBIT.&CXMDB1.&CXMDB2.&TYPEB1.&TYPEB2.&NAMUB1.&NAMX        
               UB2.'                                               @U2C         
.*                                                                              
         AIF   ('&LOCKS' EQ '').LOK1            IS LOCKS SPECIFIED?             
         AIF   ('&LOCKS' NE 'SHORT').LOK2       IS "LOCKS=SHORT"?               
.*                                              YES - CONTINUE                  
.LOK1    ANOP                                                                   
&LOCKBIT SETB  1                                YES - SET SHORT ON              
         AGO   .LOK4                                                            
.*                                              NO - CONTINUE                   
.LOK2    ANOP                                                                   
         AIF   ('&LOCKS' NE 'LONG').LOK3        IS "LOCKS=LONG"?                
         AGO   .LOK4                                                            
.*                                              NO - CONTINUE                   
.LOK3    ANOP                                                                   
         IST6MCER 5,LOCKS,&LOCKS                                                
.LOK4    ANOP                                                                   
         AIF   ('&CONMODE' EQ '').CMOD1         IS "CONMODE=" SPECIFIED         
         AIF   ('&CONMODE' NE 'CS').CMOD2       IS "CONMODE=CS"?                
.CMOD1   ANOP                                                                   
&CMODB1  SETB  1                                SET BIT ON TO INDICATE          
.*                                              CONMODE=CS                      
         AGO   .CMOD6                                                           
.CMOD2   ANOP                                                                   
         AIF   ('&CONMODE' NE 'LLCA').CMOD3     IS "CONMODE=LLCA"?              
         AGO   .CMOD6                                                           
.CMOD3   ANOP                                                                   
         AIF   ('&CONMODE' NE 'BUFFCA').CMOD4   IS "CONMODE=BUFFCA"?            
&CMODB2  SETB  1                                SET BIT ON TO INDICATE          
.*                                              CONMODE=BUFFCA                  
         AGO   .CMOD6                                                           
.CMOD4   ANOP                                                                   
         AIF   ('&CONMODE' NE 'SAME').CMOD5     IS CONMODE = SAME ?             
&CMODB1  SETB  1                                SET BIT ON TO INDICATE          
&CMODB2  SETB  1                                CONMODE=SAME(2 BITS)            
         AGO   .CMOD6                                                           
.CMOD5   ANOP                                                                   
         IST6MCER 5,CONMODE,&CONMODE                                            
.CMOD6   ANOP                                                                   
         DC    B'&LOCKBIT.000&CMODB1&CMODB2.00'                                 
.*                                                                              
         AIF   ('&LUAFFIN' NE '').LUAFF2   IS "LUAFFIN=" OMITTED   @L3A         
.LUAFF1  ANOP                                                      @L3A         
.*                                  BITS ARE INITIALIZED TO ZERO   @L3A         
.*                                  FOR UNSPECIFIED LUAFFIN        @L3A         
         AGO   .LUAFF5                                             @L3A         
.LUAFF2  ANOP                                                      @L3A         
         AIF   ('&LUAFFIN' NE 'NOTAPPL').LUAFF3 "LUAFFIN=NOTAPPL"? @L3A         
&LUAF1   SETB  1                    SET BIT ON FOR LUAFFIN=NOTAPPL @L3A         
         AGO   .LUAFF5                                             @L3A         
.LUAFF3  ANOP                                                      @L3A         
         AIF   ('&LUAFFIN' NE 'APPL').LUAFF4  IS "LUAFFIN=APPL"?   @L3A         
&LUAF2   SETB  1                    SET BIT ON FOR LUAFFIN=APPL    @L3A         
         AGO   .LUAFF5                                             @L3A         
.LUAFF4  ANOP                                                      @L3A         
         IST6MCER 5,LUAFFIN,&LUAFFIN                               @L3A         
.LUAFF5  ANOP                                                      @L3A         
         DC    B'&LUAF1&LUAF2.000000'                                           
.*                                                                              
         AIF   ('&LUNAME' NE '').LUNAM1         IS "LUNAME=" SPECIFIED          
.*                                              NO - SET TO ZEROS               
         DC    XL8'0'              LU NAME                                      
         AGO   .LUNAM3                                                          
.LUNAM1  ANOP                                                                   
         AIF   (K'&LUNAME GT 8).LUNAM2          IS LUNAME TOO LARGE             
.*                                              NO - INSERT VALUE               
         DC    CL8'&LUNAME'        LU NAME                                      
         AGO   .LUNAM3                                                          
.LUNAM2  ANOP                                                                   
         IST6MCER 10,LUNAME,8                   YES - ISSUE MNOTE               
.*                                              AND SET TO ZEROS                
         DC    XL8'0'              LU NAME                                      
.LUNAM3  ANOP                                                                   
*                                                                               
         AIF   ('&LOGMODE' NE '').LMOD1         IS "LOGMODE=" SPECIFIED         
.*                                              NO - SET TO ZEROS               
         DC    XL8'0'              LOGMODE NAME                                 
         AGO   .LMOD4                                                           
.LMOD1   ANOP                                                                   
         AIF   ('&LOGMODE' NE 'C''''').LMOD2                                    
         DC    CL8' '              LOGMODE NAME                                 
         AGO   .LMOD4                                                           
.LMOD2   ANOP                                                                   
         AIF   (K'&LOGMODE GT 8).LMOD3          IS LOGMODE TOO LARGE            
.*                                              NO - INSERT VALUE               
         DC    CL8'&LOGMODE'       LOGMODE NAME                                 
         AGO   .LMOD4                                                           
.LMOD3   ANOP                                                                   
         IST6MCER 10,LOGMODE,8                  YES - ISSUE MNOTE               
.*                                              AND SET TO ZEROS                
         DC    XL8'0'              LOGMODE NAME                                 
.LMOD4   ANOP                                                                   
         DC    XL2'0'              WHAT RECEIVED INDICATOR                      
*                                  FIELD                                        
         DC    X'00'               RETURNED INDICATORS AS                       
*                                  A RESULT OF APPCCMD                          
         DC    X'00'               LENGTH OF THE FMH5 RECEIVED                  
         DC    X'00'               RESERVED                                     
         DC    X'00'               RPL6 ACTIVE INDICATOR                        
         DC    XL2'0'              RESERVED                                     
         DC    A(0)                TASK ID                                      
         DC    A(0)                ADDRESS OF RPL                               
         DC    A(0)                CURRENT BUFFER ADDRESS   @P043961            
*                                  AT STORAGE SHORTAGE      @P043961            
         DC    A(0)                DISPLACEMENT IN CURRENT  @P043961            
*                                  BUFFER AT STORAGE        @P043961            
*                                  SHORTAGE                 @P043961            
.VOUTL   ANOP                      OUTPUT VECTOR LENGTH PARM CHECK @S1A         
.*                                     ENSURE BOTH PARMS ARE CODED              
.*                                     OR BOTH PARMS ARE NOT CODED @S1A         
         AIF   (('&VTROUTA' EQ '') AND ('&VTROUTL' EQ '')).NOVOLP  @S1A         
         AIF   (('&VTROUTA' EQ '') OR  ('&VTROUTL' EQ '')).VOLERR  @S1A         
         DC    AL2(&VTROUTL)       VECTOR OUTPUT AREA LENGTH       @S1A         
         AGO   .VINL                                               @S1A         
.VOLERR  ANOP                                                      @S1A         
         IST6MCER 13,VTROUTA,VTROUTL   ONLY ONE PARM CODED         @S1A         
.NOVOLP  DC    AL2(0)              VECTOR OUTPUT AREA LENGTH       @S1C         
.VINL    ANOP                      INPUT VECTOR LENGTH PARM CHECK  @S1A         
.*                                     ENSURE BOTH PARMS ARE CODED              
.*                                     OR BOTH PARMS ARE NOT CODED @L1A         
         AIF   (('&VTRINA' EQ '') AND ('&VTRINL' EQ '')).NOVILP    @L1A         
         AIF   (('&VTRINA' EQ '') OR  ('&VTRINL' EQ '')).VILERR    @S1C         
         DC    AL2(&VTRINL)        VECTOR INPUT AREA LENGTH        @L2C         
         AGO   .NETID                                              @L1A         
.VILERR  ANOP                                                      @S1C         
         IST6MCER 13,VTRINA,VTRINL     ONLY ONE PARM CODED         @S1C         
.NOVILP  DC    AL2(0)              VECTOR INPUT AREA LENGTH        @L2C         
.NETID   ANOP                                                                   
         AIF   ('&NETID' NE '').NETID1        IS "NETID=" SPECIFIED             
.*                                            NO - SET TO ZEROS @KGA            
         DC    XL8'0'              NETID                        @KGA            
         AGO   .NETID3                                                          
.NETID1  ANOP                                                                   
         AIF   (K'&NETID GT 8).NETID2         IS NETID TOO LARGE                
.*                                            NO - INSERT VALUE @KGA            
         DC    CL8'&NETID'         NETID                        @KGA            
         AGO   .NETID3                                                          
.NETID2  ANOP                                                                   
         IST6MCER 10,NETID,8                  YES - ISSUE MNOTE @KGA            
.*                                            AND SET TO ZEROS                  
         DC    XL8'0'              NETID                        @KGA            
.NETID3  ANOP                                                                   
*                                                                               
         DC    XL4'0'              Conversation Group ID        @KFA            
.VOUTA   ANOP                     OUTPUT VECTOR ADDRESS PARM CHECK @S1A         
.*                                     ENSURE BOTH PARMS ARE CODED              
.*                                     OR BOTH PARMS ARE NOT CODED @S1A         
         AIF   (('&VTROUTA' EQ '') AND ('&VTROUTL' EQ '')).NOVOAP  @S1A         
         AIF   (('&VTROUTA' EQ '') OR  ('&VTROUTL' EQ '')).VOAERR  @S1A         
         DC    A(&VTROUTA)         VECTOR OUTPUT AREA ADDRESS      @S1A         
         AGO   .VINA                                               @S1A         
.VOAERR  ANOP                                                      @S1A         
.* *** ERROR MESSAGE ALREADY ISSUED IN VTROUTL VALIDATION ABOVE    @S1A         
.NOVOAP  DC    A(0)                VECTOR OUTPUT AREA ADDRESS      @S1C         
.VINA    ANOP                      INPUT VECTOR ADDRESS PARM CHECK @S1A         
.*                                     ENSURE BOTH PARMS ARE CODED              
.*                                     OR BOTH PARMS ARE NOT CODED @L1A         
         AIF   (('&VTRINA' EQ '') AND ('&VTRINL' EQ '')).NOVIAP    @S1C         
         AIF   (('&VTRINA' EQ '') OR  ('&VTRINL' EQ '')).VIAERR    @S1C         
         DC    A(&VTRINA)          VECTOR INPUT AREA ADDRESS       @L2C         
         AGO   .REXIT                                              @L1A         
.VIAERR  ANOP                                                      @S1C         
.* *** ERROR MESSAGE ALREADY ISSUED IN VTRINL CHECKING ABOVE       @S1C         
.NOVIAP  DC    A(0)                VECTOR INPUT AREA ADDRESS       @L2C         
.*                                                                 @L1A         
.REXIT   MEND                                                      @L1C         
