*/********************************************************************/         
*/*                                                                  */         
*/*  MACRO-NAME: ISTSREST                                            */         
*/*                                                                  */         
*/*  MACRO-DESCRIPTIVE-NAME: APPC/VTAM RESTORE STRUCTURE             */         
*/*                                                                  */         
*/*  COPYRIGHT: LICENSED MATERIALS - PROPERTY OF IBM                 */         
*/*                                                                  */         
*/*             THIS PRODUCT CONTAINS "RESTRICTED MATERIALS OF IBM"  */         
*/*                                                                  */         
*/*             5685-085 (C) COPYRIGHT IBM CORP. 1991                */         
*/*             ALL RIGHTS RESERVED.                                 */         
*/*                                                                  */         
*/*             U.S. GOVERNMENT USERS RESTRICTED RIGHTS -            */         
*/*             USE, DUPLICATION OR DISCLOSURE RESTRICTED BY         */         
*/*             GSA ADP SCHEDULE CONTRACT WITH IBM CORP.             */         
*/*                                                                  */         
*/*             SEE COPYRIGHT INSTRUCTIONS.                          */         
*/*                                                                  */         
*/*  MACRO-FUNCTION: THIS STRUCTURE IS SPECIFIED BY THE APPLICATION  */         
*/*                  PROGRAM WHEN IT ISSUES THE APPCCMD RESTORE.     */         
*/*                  VTAM WILL FILL IN THE LU NAME AND MODE AND      */         
*/*                  AS MUCH ADDITIONAL INFORMATION AS IS REQUESTED  */         
*/*                  BY THE APPLICATION WITH THE SCOPE PARAMETER.    */         
*/*                                                                  */         
*/*  MACRO-BOUNDARY: HWORD                                           */         
*/*                                                                  */         
*/*  MACRO-CREATED-BY: THE USER                                      */         
*/*                                                                  */         
*/*  MACRO-LOCATION: USER'S STORAGE                                  */         
*/*                                                                  */         
*/*  MACRO-DEPENDENCIES: NONE                                        */         
*/*                                                                  */         
*/*  MACRO-LAST-CHANGED: AS FOLLOWS                                  */         
*/*                                                                  */         
*/* $MAC(ISTSREST),COMP(LNS),PROD(VTAM): RESTORE INFORMATION         */         
*/*                                                                  */         
*/* FLAG REASON   RELEASE DATE   ORIGIN  FLAG DESCRIPTORS            */         
*/* ---- -------- ------- ------ ------  --------------------------- */         
*/* $B0= AP@@@CLD HVT3401 890321 496698: PERSISTENT LU-LU SESSIONS   */         
*/* $V1= P095993  HVT3401 910516 879315: Add structure chaining      */         
*/* $KF= NQNSTG2  NQNAME2 910619 457572: ENHANCED NQN SUPPORT (2)    */         
*/* $Y1= P115208  FREEDOM 940706 879315: Remove use of %GOTO         */         
*/*                                                                  */         
*/********************************************************************/         
*/*A-000000-999999                                                   */         
*@LISTPUSH;                         /*                           @Y1A*/         
*@LISTOFF;                          /*                           @Y1C*/         
*                                   /* BILINGUAL HEADER                         
*                                                                               
         MACRO                                                                  
         ISTSREST                                                               
ISTSREST DSECT                      RESTORE STRUCTURE                           
*                                                                               
*                                                                               
*                                                                               
SRENAME    DS  CL8                  LU NAME                                     
SREMODE    DS  CL8                  LU MODE                                     
SRENXTAD   DS  A                    NEXT RESTORE STRUCTURE ADDRESS @V1A         
SRESLDAD   DS  A                    SLD STRUCTURE ADDRESS          @V1C         
SRESESAD   DS  A                    ADDRESS OF FIRST SRESESS       @V1A         
SREMFLGS   DS  XL2                  MODE LEVEL FLAGS                            
SREMDRS    EQU X'80'                1=MODE HAS BEEN RESTORED                    
SRESESCT   DS  H                    NUMBER OF SRESESS STRUCTURES                
SRENETID   DS  CL8                  NETID OF LU                    @KFA         
SREEND     DS  0X                   END OF ISTSREST STRUCTURE      @V1C         
*                                                                               
SRESESS    DSECT                    SESSION INFORMATION                         
SRESNXTA   DS  A                    NEXT SESSION STRUCTURE ADDRESS @V1A         
SRESFLGS   DS  XL3                  SESSION LEVEL FLAGS                         
SREPCONV   EQU X'80'                1=CONVERSATION PENDING DEALLOCATION         
*                                   FOR PERSISTENT LU-LU SESSIONS               
SRESPNDA   EQU X'40'                1=SESSION PENDING DEACTIVATION              
*                                   FOR PERSISTENT LU-LU SESSIONS               
SRESIDL    DS  XL1                  SESSION INSTANCE IDENTIFIER LENGTH          
SRESESID   DS  XL8                  SESSION INSTANCE IDENTIFIER                 
SRESEND    DS  0X                   END OF SESSION INFORMATION                  
         MEND                                                        */         
*                                                                               
*@LISTPOP;                          /* BEGIN PL/X MAPPING        @Y1C*/         
*                                                                               
*DCL                                                                            
*  1 ISTSREST BASED BDY(WORD),      /* RESTORE INFORMATION       @V1C*/         
*    2 FIXED_PART,                  /* FIELD TO OBTAIN LEN IF NEEDED */         
*      3 SRENAME  CHAR(8),          /* LU NAME                       */         
*      3 SREMODE  CHAR(8),          /* MODE NAME                     */         
*      3 SRENXTAD PTR,              /* NEXT RESTORE STRUCTURE ADDRESS           
*                                                                @V1A*/         
*      3 SRESLDAD PTR,              /* ISTSLD STRUCTURE ADDRESS  @V1C*/         
*      3 SRESESAD PTR,              /* ADDRESS OF FIRST SRESESS                 
*                                      STRUCTURE                 @V1C*/         
*                                                                               
*      3 SREMFLGS BIT(16),          /* MODE LEVEL FLAGS              */         
*        4 SREMDRS BIT(1),          /* 1=MODE HAS BEEN RESTORED      */         
*        4 *       BIT(15),         /* AVAILABLE                     */         
*      3 SRESESCT FIXED(15),        /* NUMBER OF SRESESS STRUCTURES  */         
*      3 SRENETID CHAR(8),          /* NETID OF LU               @KFA*/         
*    2 SREEND CHAR(0) BDY(WORD);    /* END OF ISTSREST STRUCTURE @V1C*/         
*DCL                                                                            
*  1 SRESESS BASED BDY(WORD),       /* SESSION INFORMATION - ONE PER            
*                                      RESTORED PENDING RECOVERY                
*                                      SESSION                   @V1C*/         
*    2 SRESNXTA PTR,                /* NEXT SESSION STRUCTURE ADDRESS           
*                                                                @V1A*/         
*    2 SRESFLGS CHAR(3),            /* SESSION LEVEL FLAGS           */         
*      3 SREPCONV BIT(1),           /* 1=CONVERSATION PENDING                   
*                                      DEALLOCATION FOR                         
*                                      PERSISTENT LU-LU SESSIONS     */         
*      3 SRESPNDA BIT(1),           /* 1=SESSION PENDING                        
*                                      DEALLOCATION FOR                         
*                                      PERSISTENT LU-LU SESSIONS     */         
*      3 *        BIT(22),          /* AVAILABLE                     */         
*    2 SRESIDL  FIXED(8),           /* SESSION INSTANCE IDENTIFIER              
*                                      LENGTH                        */         
*    2 SRESESID CHAR(8),            /* SESSION INSTANCE IDENTIFIER   */         
*    2 SRESEND  CHAR(0) BDY(WORD);  /* END SESSION INFORMATION   @V1A*/         
