*/********************************************************************/         
*/*                                                                  */         
*/*  MACRO-NAME: ISTSLD                                              */         
*/*                                                                  */         
*/*  MACRO-ACRONYM: SLD                                              */         
*/*                                                                  */         
*/*  MACRO-DESCRIPTIVE-NAME: SESSION LIMITS - DEFINE/DISPLAY         */         
*/*                                                                  */         
*/*  COPYRIGHT: LICENSED MATERIALS - PROPERTY OF IBM                 */         
*/*                                                                  */         
*/*             THIS PRODUCT CONTAINS "RESTRICTED MATERIALS OF IBM"  */         
*/*                                                                  */         
*/*             5695-117 (C) COPYRIGHT IBM CORP. 1987, 1993.         */         
*/*             ALL RIGHTS RESERVED.                                 */         
*/*                                                                  */         
*/*             U.S. GOVERNMENT USERS RESTRICTED RIGHTS -            */         
*/*             USE, DUPLICATION OR DISCLOSURE RESTRICTED BY         */         
*/*             GSA ADP SCHEDULE CONTRACT WITH IBM CORP.             */         
*/*                                                                  */         
*/*             SEE COPYRIGHT INSTRUCTIONS.                          */         
*/*                                                                  */         
*/*  MACRO-FUNCTION: THIS STRUCTURE IS SPECIFIED BY THE APPLICATION  */         
*/*                  PROGRAM WHEN IT ISSUES THE APPCCMD DEFINE OR    */         
*/*                  DISPLAY.  FOR DEFINE IT PROVIDES VTAM WITH THE  */         
*/*                  DEFINED SESSION LIMITS AND OTHER DEFINED PARA-  */         
*/*                  METERS NEEDED TO DO CNOS NEGOTIATIONS.  FOR     */         
*/*                  DISPLAY IT PROVIDES VTAM WITH A STRUCTURE TO    */         
*/*                  FILL IN CERTAIN LM TABLE PARAMETERS WHICH ARE   */         
*/*                  RETURNED TO THE APPLICATION.                    */         
*/*                                                                  */         
*/*  MACRO-BOUNDARY: HWORD                                           */         
*/*                                                                  */         
*/*  MACRO-CREATED-BY: THE USER                                      */         
*/*                                                                  */         
*/*  MACRO-LOCATION: USER'S STORAGE                                  */         
*/*                                                                  */         
*/*  MACRO-DEPENDENCIES: AS FOLLOW                                   */         
*/*                                                                  */         
*/*    REQUIRED-INNER-MAPS: NONE                                     */         
*/*                                                                  */         
*/*    REQUIRED-BY: NONE                                             */         
*/*                                                                  */         
*/*  MACRO-LAST-CHANGED: AS FOLLOWS                                  */         
*/*   01/08/86 - CREATED FOR APPC SUPPORT                    @R495808*/         
*/*   04/29/87 - CONVERSATION LEVEL SECURITY                 @R507300*/         
*/*   12/10/87 - CORRECT RESERVED FIELDS                     @P052442*/         
*/*   01/05/88 - CHANGE FIELD DESCRIPTIONS                   @P052802*/         
*/*   03/11/88 - DISPLAY FULLY QUALIFIED PARTNER LU NAME     @P054797*/         
*/*   03/24/88 - CORRECT MISSING COMMENT STATEMENT           @P055092*/         
*/*                                                                  */         
*/* $MAC(ISTSLD),COMP(COPR),PROD(VTAM): SESSION LIMITS - DEFINE/     */         
*/*                                                        DISPLAY   */         
*/*                                                                  */         
*/* FLAG REASON   RELEASE DATE   ORIGIN  FLAG DESCRIPTORS            */         
*/* ---- -------- ------- ------ ------  --------------------------- */         
*/* $F1= FB3@@CLD HVT3303 880317 013298: PARTNER LU VERIFICATION     */         
*/* $F2= FS1@@CLD HVT3303 880503 255471: SYNCPOINT SUPPORT           */         
*/* $B1= AG@@@MST HVT3401 890424 692313: APPC OPERATOR COMMANDS      */         
*/* $B2= AV@@@AMS HVT3401 890711 577378: PERSISTENT VERIFICATION     */         
*/* $B3= AP@@@CLD HVT3401 890802 450767: PERSISTENT LU-LU SESSIONS   */         
*/* $V1= P095993  HVT3401 910520 914077: Put on WORD boundary        */         
*/* $I1= FF@@@MST APPCFDX 920116 879315: APPC Full-Duplex support    */         
*/* $L1= KN@@@MST NAMEMIS 930806 143576: Name Mismatch Detection     */         
*/* $U2= P110887  GENRES  930928 879315: Display USRFD information   */         
*/* $U3= P113436  VTEMRL  940203 879315: Correct spelling error      */         
*/* $Y1= P115208  FREEDOM 940706 879315: Remove use of %GOTO         */         
*/* $Y2= P116806  NAMEMIS 941021 143576: KN@DR002 - Define new type  */         
*/*                                      of entry                    */         
*/* $21= OW15631  INDY    951221 879315: CINIT fails 08880010        */         
*/*                                                                  */         
*/*  MACRO-NOTES: NONE                                               */         
*/*                                                                  */         
*/********************************************************************/         
*/*A-000000-999999                                           @R495808*/         
*@LISTPUSH;                         /*                           @Y1A*/         
*@LISTOFF;                          /*                           @Y1C*/         
*                                   /* BILINGUAL HEADER                         
*                                                                               
         MACRO                                                                  
         ISTSLD                                                                 
ISTSLD   DSECT                      SESSION LIMITS - DEFINE/DISPLAY             
*                                                                               
* BEGINING OF LU SPECIFIC FIELDS                                                
*                                                                               
SLDLUPAR DS    0XL40                LU SPECIFIC FIELDS         @P054797         
SLDLU1   DS    XL1                  LU SPECIFIC FIELDS - BYTE 1                 
SLDSCAP  EQU   X'C0'                LU'S SESSION CAPABILITY MASK                
SLDPARR  EQU   X'C0'                PARALLEL SESSION CAPABLE                    
SLDPNDGP EQU   X'80'                PENDING PARALLEL STATE                      
SLDPNDGS EQU   X'40'                PENDING SINGLE STATE                        
SLDSINGL EQU   X'00'                SINGLE SESSION CAPABLE                      
SLDSYNCH EQU   X'30'                NEGOTIATED LEVEL OF SYNCHRONIZATION         
*                                                                  @F2A         
SLDCSBK  EQU   X'20'                CONFIRM, SYNC POINT, BACKOUT                
*                                   SUPPORTED                      @F2A         
SLDCONF  EQU   X'10'                CONFIRM SUPPORTED              @F2A         
SLDSYNRT EQU   X'00'                SYNCHRONIZATION LEVEL NOT SET  @F2A         
*        EQU   X'0F'                RESERVED                       @F2C         
SLDLU2   DS    XL1                  LU SPECIFIC FIELDS - BYTE 2                 
SLDCLSV  EQU   X'80'                SECURITY SUBFIELD ACCEPTANCE                
*                                   INFORMATION IS VALID           @U3C         
SLDCSLV  EQU   SLDCLSV                (previous incorrect label,   @U3A         
*                                     possibly used by existing                 
*                                     applications)                             
SLDPCLSA EQU   X'40'                PARTNER LU ACCEPTS SECURITY                 
*                                   SUBFIELDS ON FMH5          @P052802         
SLDPAVFA EQU   X'20'                PARTNER LU ACCEPTS REQUESTS FOR             
*                                   ALREADY VERIFIED FUNCTION      @F1C         
SLDPPV   EQU   X'10'                PARTNER LU ACCEPTS REQUESTS FOR             
*                                   PERSISTENT VERIFICATION        @B2A         
SLDLCLSA EQU   X'08'                LOCAL LU ACCEPTS SECURITY                   
*                                   SUBFIELDS ON FMH5 FROM THIS                 
*                                   PARTNER LU                 @P052802         
SLDLAVFA EQU   X'04'                LOCAL LU ACCEPTS REQUESTS FOR               
*                                   ALREADY VERIFIED FUNCTION      @F1C         
SLDLPV   EQU   X'02'                LOCAL LU ACCEPTS REQUESTS FOR               
*                                   PERSISTENT VERIFICATION        @B2A         
*        EQU   X'01'                RESERVED                                    
SLDFQNLN DS    XL1                  LENGTH OF FULLY QUALIFIED                   
*                                   PARTNER LU NAME            @P054797         
SLDFQNAM DS    XL17                 FULLY QUALIFIED PARTNER LU                  
*                                   NAME - USE SLDFQNLN FOR                     
*                                   ACTUAL LENGTH OF NAME      @P055092         
SLDLU3   DS    XL1                  LU-SPECIFIC INDICATORS         @I1A         
SLDCNVCP EQU   X'C0'                CONVERSATION CAPABILITY FIELD  @I1A         
SLDCNVFD EQU   X'80'                FULL-DUPLEX OR HALF-DUPLEX,    @I1A         
*                                   EXPEDITED DATA ALLOWED         @I1A         
SLDCNVHD EQU   X'40'                HALF-DUPLEX CONVERSATIONS ONLY @I1A         
SLDCNVUN EQU   X'00'                CAPABILITY IS UNKNOWN          @I1A         
*        EQU   X'20' - X'01'        RESERVED                                    
SLDNMUSE DS    XL1                  APPLICATION NAME USE FIELD,    @U2A         
*                                   INDICATES FORM OF LU NAME USED BY           
*                                   LOCAL LU FOR SESSIONS WITH THIS             
*                                   PARTNER LU                     @U2A         
SLDNMUUN EQU   X'00'                NAME USE NOT YET KNOWN         @U2A         
SLDNMUUV EQU   X'01'                USERVAR NAME IS BEING USED     @U2A         
SLDNMUAN EQU   X'02'                APPL NETWORK NAME BEING USED   @U2A         
SLDNMUGN EQU   X'03'                GENERIC NAME IS BEING USED     @U2A         
SLDTYPE  DS    XL1                  TYPE OF LU ENTRY               @L1A         
SLDSUPNM EQU   X'00'                SUPPLIED_NAME ENTRY            @L1A         
SLDRCVNM EQU   X'01'                RCVD_NAME ENTRY                @L1A         
SLDVARNM EQU   X'02'                VARIANT_NAME ENTRY             @L1A         
SLDUNUNM EQU   X'03'                UNUSABLE_NAME ENTRY            @L1A         
SLDDISNM EQU   X'04'                DISASSOC_NAME ENTRY            @Y2A         
         DS    XL17                 RESERVED                       @L1C         
*                                                                               
* END OF LU SPECIFIC FIELDS                                                     
*                                                                               
* BEGINING OF MODE SPECIFIC FIELDS                                              
*                                                                               
SLDDSESL DS    H                    DEFINED SESSION LIMIT                       
SLDDMCWL DS    H                    DEFINED NUMBER OF CONTENTION WINNER         
*                                   SESSIONS -- LOCAL LU                        
SLDDMCWP DS    H                    DEFINED NUMBER OF CONTENTION WINNER         
*                                   SESSIONS -- PARTNER LU                      
SLDDEFPA DS    XL1                  DEFINED PARAMETERS                          
SLDDRSPL EQU   X'80'                DEFINED ACCEPTANCE OF DEACTIVATION          
*                                   RESPONSIBILITY, IF SET THEN THE             
*                                   LOCAL LU WILL ACCEPT RESPONSIBILITY         
SLDDDRAL EQU   X'40'                DEFINED ACCEPTANCE OF REQUEST TO            
*                                   DRAIN QUEUED ALLOCS, IF SET THEN            
*                                   LOCAL LU WILL ACCEPT THE REQUEST            
SLDDELET EQU   X'20'                MODE DELETION INDICATOR, IF SET             
*                                   APPL WILL ALLOW DELETION OF MODE            
SLDAUTOS EQU   X'10'                AUTOSES SPECIFIED AS ON DEFINE @B1A         
SLDMDSUS EQU   X'08'                MODE PENDING RECOVERY          @B3A         
SLDDLUNS EQU   X'04'                DELETE IF UNUSABLE             @21A         
*        EQU   X'02'-X'01'          RESERVED                       @21C         
SLDCNSPA DS    XL1                  CNOS PARAMETERS                             
SLDDRAL  EQU   X'80'                DRAINING OF LOCAL LU                        
SLDDRAP  EQU   X'40'                DRAINING OF PARTNER LU                      
*        EQU   X'20'-X'01'          RESERVED                                    
SLDSESSL DS    H                    SESSION LIMIT                               
SLDMCWL  DS    H                    MINIMUM NUMBER OF CONTENTION WINNER         
*                                   SESSIONS -- LOCAL LU                        
SLDMCWP  DS    H                    MINIMUM NUMBER OF CONTENTION WINNER         
*                                   SESSIONS -- PARTNER LU                      
SLDAUTO  DS    H                    AUTO ACTIVATE LIMIT                         
SLDSESSC DS    H                    CURRENT SESSION COUNT                       
SLDWINLC DS    H                    NUMBER OF CURRENT CONTENTION WINNER         
*                                   SESSIONS -- LOCAL LU                        
SLDWINPC DS    H                    NUMBER OF CURRENT CONTENTION WINNER         
*                                   SESSIONS -- PARTNER LU                      
SLDFREEC DS    H                    NUMBER OF FREE SESSIONS                     
SLDQALLC DS    H                    NUMBER OF ALLOCATE REQUEST WAITING          
*                                   FOR FREE SESSIONS              @B1A         
         DS    XL2                  RESERVED                       @B1A         
*                                                                               
* END OF MODE SPECIFIC FIELDS                                                   
*                                                                               
SLDEND   DS    0X                   END OF ISTSLD                               
         MEND                                                        */         
*                                                                               
*@LISTPOP;                          /* BEGIN PL/X MAPPING        @Y1C*/         
*                                                                               
*DCL                                                                            
*  1 ISTSLD  BASED BDY(WORD),       /* SESSION LIMITS-DEFINE/DISPLAY            
*                                                                @V1C*/         
*    3 SLDLUPAR,                    /* LU SPECIFIC FIELDS            */         
*      5 SLDLU1   BIT(8),           /* LU SPECIFIC FIELDS - BYTE 1   */         
*        7 SLDSCAP  BIT(2),         /* LU'S SESSION CAPABILITY       */         
*        7 SLDSYNCH BIT(2),         /* NEGOTIATED LEVEL OF                      
*                                      SYNCHRONIZATION           @F2A*/         
*        7 *        BIT(4),         /* NOT USED                  @F2C*/         
*      5 SLDLU2   BIT(8),           /* LU SPECIFIC FIELD - BYTE 2    */         
*        7 SLDCLSV  BIT(1),         /* SECURITY SUBFIELD ACCEPTANCE             
*                                      INFORMATION IS VALID  @P052802*/         
*        7 SLDPCLSI BIT(3),         /* PARTNER LU SECURITY ACCEPTANCE           
*                                      INFORMATION           @P052802*/         
*          9 SLDPCLSA BIT(1),       /* PARTNER LU ACCEPTS SECURITY              
*                                      SUBFIELDS ON FMH5     @P052802*/         
*          9 SLDPAVFA BIT(1),       /* PARTNER LU ACCEPTS REQUESTS FOR          
*                                      ALREADY VERIFIED FUNCTION @F1C*/         
*          9 SLDPPV   BIT(1),       /* PARTNER LU ACCEPTS REQUESTS FOR          
*                                      PERSISTENT VERIFICATION   @B2C*/         
*        7 SLDLCLSI BIT(3),         /* LOCAL LU SECURITY ACCEPTANCE             
*                                      INFORMATION FOR SESSIONS                 
*                                      WITH THIS PARTNER     @P052802*/         
*          9 SLDLCLSA BIT(1),       /* LOCAL LU ACCEPTS SECURITY                
*                                      SUBFIELDS ON FMH5                        
*                                      FROM THIS PARTNER LU  @P052802*/         
*          9 SLDLAVFA BIT(1),       /* LOCAL LU ACCEPTS REQUESTS FOR            
*                                      ALREADY VERIFIED FUNCTION @F1C*/         
*          9 SLDLPV   BIT(1),       /* LOCAL LU ACCEPTS REQUESTS FOR            
*                                      PERSISTENT VERIFICATION   @B2C*/         
*        7 *        BIT(1),         /* NOT USED              @R507300*/         
*      5 SLDFQNLN FIXED(8),         /* LENGTH OF FULLY QUALIFIED                
*                                      PARTNER LU NAME       @P054797*/         
*      5 SLDFQNAM CHAR(17),         /* FULLY QUALIFIED PARTNER                  
*                                      LU NAME               @P054797*/         
*      5 SLDLU3   BIT(8),           /* LU SPECIFIC INDICATORS    @I1A*/         
*        7 SLDCNVCP BIT(2),         /* CONVERSATION PROTOCOL CAPABILITY         
*                                      FOR SESSION               @I1A*/         
*        7 *        BIT(6),         /* RESERVED                  @U2A*/         
*      5 SLDNMUSE BIT(8),           /* APPLICATION NAME USE FIELD,              
*                                      INDICATES FORM OF LU NAME USED           
*                                      BY LOCAL LU FOR SESSIONS WITH            
*                                      THIS PARTNER LU           @U2A*/         
*      5 SLDTYPE    BIT(8),         /* TYPE OF LU ENTRY          @L1A*/         
*      5 *        CHAR(17),         /* RESERVED                  @L1C*/         
*    3 SLDDSESL FIXED(15),          /* DEFINED SESSION LIMIT         */         
*    3 SLDDMCWL FIXED(15),          /* DEFINED NUMBER OF CONTENTION             
*                                      WINNER SESSIONS -- LOCAL LU   */         
*    3 SLDDMCWP FIXED(15),          /* DEFINED NUMBER OF CONTENTION             
*                                      WINNER SESSIONS -- PARTNER LU */         
*    3 SLDDEFPA BIT(8),             /* DEFINED PARAMETERS            */         
*      5 SLDDRSPL BIT(1),           /* DEFINED ACCEPTANCE OF                    
*                                      DEACTIVATION RESPONSIBILITY:             
*                                      B'0' - WILL NOT ACCEPT,                  
*                                      B'1' - WILL ACCEPT            */         
*      5 SLDDDRAL BIT(1),           /* DEFINED ACCEPTANCE OF REQUEST            
*                                      TO DRAIN QUEUED ALLOCATES:               
*                                      B'0' - WILL NOT ACCEPT,                  
*                                      B'1' - WILL ACCEPT            */         
*      5 SLDDELET BIT(1),           /* DELETION OF THE MODE:                    
*                                      B'0' - DO NOT DELETE,                    
*                                      B'1' - DO DELETE              */         
*      5 SLDAUTOS BIT(1),           /* AUTOSES SPECIFIED AS INPUT               
                                                                 @B1A*/         
*      5 SLDMDSUS BIT(1),           /* MODE PENDING RECOVERY     @B3A*/         
*      5 SLDDLUNS BIT(1),           /* DELETE IF UNUSABLE        @21A*/         
*      5 *        BIT(2),           /* NOT USED                  @21C*/         
*    3 SLDCNSPA  BIT(8),            /* CNOS PARAMETERS               */         
*      5 SLDDRAL   BIT(1),          /* DRAINING OF LOCAL LU:                    
*                                      B'0' - NO DRAINING,                      
*                                      B'1' - ALLOW DRAINING         */         
*      5 SLDDRAP   BIT(1),          /* DRAINING OF PARTNER LU:                  
*                                      B'0' - NO DRAINING,                      
*                                      B'1' - ALLOW DRAINING         */         
*      5 *         BIT(6),          /* NOT USED                      */         
*    3 SLDSESSL  FIXED(15),         /* SESSION LIMIT                 */         
*    3 SLDMCWL   FIXED(15),         /* MINIMUM NUMBER OF CONTENTION             
*                                      WINNER SESSIONS -- LOCAL LU   */         
*    3 SLDMCWP   FIXED(15),         /* MINIMUM NUMBER OF CONTENTION             
*                                      WINNER SESSIONS -- PARTNER LU */         
*    3 SLDAUTO  FIXED(15),          /* AUTO ACTIVATE LIMIT           */         
*    3 SLDSESSC  FIXED(15),         /* CURRENT SESSION COUNT         */         
*    3 SLDWINLC  FIXED(15),         /* NUMBER OF CURRENT CONTENTION             
*                                      WINNER SESSIONS -- LOCAL LU   */         
*    3 SLDWINPC  FIXED(15),         /* NUMBER OF CURRENT CONTENTION             
*                                      WINNER SESSIONS -- PARTNER LU */         
*    3 SLDFREEC  FIXED(15),         /* NUMBER OF FREE SESSIONS       */         
*    3 SLDQALLC FIXED(15),          /* NUMBER OF ALLOCATION REQUEST             
*                                      WAITING FOR FREE SESSIONS @B1A*/         
*    3 *        CHAR(2),            /* NOT USED                  @B1A*/         
*    3 SLDEND   CHAR(0) BDY(WORD);  /* CONTROL BLOCK END         @V1C*/         
*                                                                               
*/********************************************************************/         
*/*                                                                  */         
*/* VALUES FOR SLDSCAP                                               */         
*/*                                                                  */         
*/********************************************************************/         
*DCL SLDSINGL BIT(2) CONSTANT('00'B); /* SINGLE SESSION CAPABLE      */         
*DCL SLDPNDGS BIT(2) CONSTANT('01'B); /* PENDING SINGLE STATE        */         
*DCL SLDPNDGP BIT(2) CONSTANT('10'B); /* PENDING PARALLEL STATE      */         
*DCL SLDPARR  BIT(2) CONSTANT('11'B); /* PARALLEL SESSION CAPABLE    */         
*                                                                               
*/********************************************************************/         
*/*                                                                  */         
*/* VALUES FOR SLDSYNCH                                              */         
*/*                                                                  */         
*/********************************************************************/         
*DCL SLDSYNRT BIT(2) CONSTANT('00'B); /* SYNCHRONIZATION LEVEL NOT              
*                                        SET                     @F2A*/         
*DCL SLDCONF  BIT(2) CONSTANT('01'B); /* CONFIRM SUPPORTED       @F2A*/         
*DCL SLDCSBK  BIT(2) CONSTANT('10'B); /* CONFIRM, SYNC POINT AND                
*                                        BACKOUT SUPPORTED       @F2A*/         
*/********************************************************************/         
*/* VALUES FOR SLDCNVCP                                              */         
*/********************************************************************/         
*DCL SLDCNVUN BIT(2) CONSTANT('00'B); /* CAPABILITY IS UNKNOWN   @I1A*/         
*DCL SLDCNVHD BIT(2) CONSTANT('01'B); /* HDX CONVERSATIONS ONLY  @I1A*/         
*DCL SLDCNVFD BIT(2) CONSTANT('10'B); /* FDX OR HDX CONVERSATIONS AND           
*                                        EXPEDITED DATA ALLOWED  @I1A*/         
*/********************************************************************/         
*/* VALUES FOR SLDNMUSE                                              */         
*/********************************************************************/         
*DCL SLDNMUUN BIT(8) CONSTANT('00'X); /* NAME USE IS NOT KNOWN   @U2A*/         
*DCL SLDNMUUV BIT(8) CONSTANT('01'X); /* USERVAR NAME BEING USED @U2A*/         
*DCL SLDNMUAN BIT(8) CONSTANT('02'X); /* APPL NAME BEING USED    @U2A*/         
*DCL SLDNMUGN BIT(8) CONSTANT('03'X); /* GENERIC NAME BEING USED @U2A*/         
*                                                                               
*/********************************************************************/         
*/* VALUES FOR SLDTYPE                                               */         
*/********************************************************************/         
*DCL SLDSUPNM BIT(8) CONSTANT('00'X);  /* SUPPLIED NAME          @L1A*/         
*DCL SLDRCVNM BIT(8) CONSTANT('01'X);  /* RCVD_NAME ENTRY        @L1A*/         
*DCL SLDVARNM BIT(8) CONSTANT('02'X);  /* VARIANT_NAME ENTRY     @L1A*/         
*DCL SLDUNUNM BIT(8) CONSTANT('03'X);  /* UNUSABLE_NAME ENTRY    @L1A*/         
*DCL SLDDISNM BIT(8) CONSTANT('04'X);  /* DISASSOC_NAME ENTRY    @Y2A*/         
*                                                                               
*/********************************************************************/         
*/*                                                                  */         
*/* ISTSLD LENGTH OF MIGRATION LEVEL                                 */         
*/*                                                                  */         
*/********************************************************************/         
*DCL SLDMLEN FIXED(8) CONSTANT(64);   /* LENGTH OF MIGRATION LEVEL              
*                                                                @B1A*/         
