*/********************************************************************/         
*/*                                                                  */         
*/*  MACRO-NAME: ISTSLCNS                                            */         
*/*                                                                  */         
*/*  MACRO-ACRONYM: SLC                                              */         
*/*                                                                  */         
*/*  MACRO-DESCRIPTIVE-NAME: SESSION LIMITS FOR CNOS                 */         
*/*                                                                  */         
*/*  COPYRIGHT: LICENSED MATERIALS - PROPERTY OF IBM                 */         
*/*                                                                  */         
*/*             THIS PRODUCT CONTAINS "RESTRICTED MATERIALS OF IBM"  */         
*/*                                                                  */         
*/*             5695-117 (C) COPYRIGHT IBM CORP. 1987, 1991, 1992.   */         
*/*             ALL RIGHTS RESERVED.                                 */         
*/*                                                                  */         
*/*             U.S. GOVERNMENT USERS RESTRICTED RIGHTS -            */         
*/*             USE, DUPLICATION OR DISCLOSURE RESTRICTED BY         */         
*/*             GSA ADP SCHEDULE CONTRACT WITH IBM CORP.             */         
*/*                                                                  */         
*/*             SEE COPYRIGHT INSTRUCTIONS.                          */         
*/*                                                                  */         
*/*  MACRO-FUNCTION: THIS STRUCTURE IS SPECIFIED BY THE APPLICATION  */         
*/*                  PROGRAM WHEN IT ISSUES THE APPCCMD CNOS.  IT    */         
*/*                  PROVIDES VTAM WITH THE CNOS SESSION LIMITS AND  */         
*/*                  OTHER PARAMETERS WHICH ARE NOT IN THE RPL OR    */         
*/*                  RPL6.                                           */         
*/*                                                                  */         
*/*  MACRO-BOUNDARY: HWORD                                           */         
*/*                                                                  */         
*/*  MACRO-CREATED-BY: THE USER                                      */         
*/*                                                                  */         
*/*  MACRO-LOCATION: USER'S STORAGE                                  */         
*/*                                                                  */         
*/*  MACRO-DEPENDENCIES: AS FOLLOW                                   */         
*/*                                                                  */         
*/*    REQUIRED-INNER-MAPS: NONE                                     */         
*/*                                                                  */         
*/*    REQUIRED-BY: NONE                                             */         
*/*                                                                  */         
*/*  MACRO-LAST-CHANGED: AS FOLLOWS                                  */         
*/*   01/08/86 - CREATED FOR APPC SUPPORT                    @R495808*/         
*/*   10/21/86 - ADVANCE SESSION CAPABILITY KNOWLEDGE ADDED  @P041930*/         
*/*   04/29/87 - CONVERSATION LEVEL SECURITY                 @R507300*/         
*/*   01/05/88 - CHANGE FIELD DESCRIPTIONS                   @P052802*/         
*/*                                                                  */         
*/* $MAC(ISTSLCNS),COMP(COPR),PROD(VTAM): SESSION LIMITS FOR CNOS    */         
*/*                                                                  */         
*/* FLAG REASON   RELEASE DATE   ORIGIN  FLAG DESCRIPTORS            */         
*/* ---- -------- ------- ------ ------  --------------------------- */         
*/* $F1= FB3@@CLD HVT3303 880321 013298: PARTNER LU VERIFICATION     */         
*/* $B1= AG@@@MST HVT3401 890425 692313: APPC OPERATOR COMMANDS      */         
*/* $B2= AV@@@AMS HVT3401 890426 577378: PERSISTENT VERIFICATION     */         
*/* $Y1= P115208  FREEDOM 940706 879315: Remove use of %GOTO         */         
*/*                                                                  */         
*/********************************************************************/         
*                                                                               
*/*A-000000-999999                                           @R495808*/         
*@LISTPUSH;                         /*                           @Y1A*/         
*@LISTOFF;                          /*                           @Y1C*/         
*                                   /* BILINGUAL HEADER                         
*                                                                               
         MACRO                                                                  
         ISTSLCNS                                                               
ISTSLCNS DSECT                      SESSION LIMITS FOR CNOS                     
SLCSESSL DS    H                    SESSION LIMIT                               
SLCMCWL  DS    H                    MINIMUM NUMBER OF CONTENTION WINNER         
*                                   SESSIONS - LOCAL LU                         
SLCMCWP  DS    H                    MIMIMUM NUMBER OF CONTENTION WINNER         
*                                   SESSIONS - PARTNER LU                       
SLCPARMS DS    XL1                  CNOS PARAMETERS                             
SLCDRAL  EQU   X'80'                DRAINING OF LOCAL LU REQUESTED              
SLCDRAP  EQU   X'40'                DRAINING OF PARTNER LU REQUESTED            
SLCPRSPL EQU   X'20'                RESPONSIBLE FOR DEACTIVATION                
*                                   IF SET, PARTNER LU IS RESPONSIBLE           
*                                   IF NOT SET, LOCAL LU IS RESPONSIBLE         
SLCALL   EQU   X'10'                INDICATES IF CNOS IS FOR ONE MODE           
*                                   OR ALL MODES                                
*                                   IF SET, CNOS IS FOR ALL MODES               
*                                   IF NOT SET, CNOS IS FOR ONE MODE            
SLCSSLU  EQU   X'08'                INDICATE IF THE PARTNER LU IS ONLY          
*                                   SINGLE SESSION CAPABLE     @P041930         
*                                                                               
SLCLCLSI EQU   X'07'                LOCAL LU SECURITY SUBFIELD                  
*                                   ACCEPTANCE INFORMATION     @P052802         
SLCLNONE EQU   X'00'                NONE ACCEPTED              @R507300         
SLCLCONV EQU   X'04'                SECURITY SUBFIELDS ACCEPTED                 
*                                   ON FMH5                    @P052802         
SLCLAVFA EQU   X'02'                ALREADY VERIFIED REQUESTS ACCEPTED          
*                                                                  @F1A         
SLCLPV   EQU   X'01'                PERSISTENT VERIFICATION REQUESTS            
*                                   ACCEPTED                       @B2C         
         DS    XL1                  RESERVED                       @B1A         
SLCDSESL DS    H                    DEFINED SESSION LIMIT          @B1A         
SLCDMCWL DS    H                    DEFINED MINIMUM NUMBER OF                   
*                                   CONTENTION WINNER SESSIONS                  
*                                   - LOCAL LU                     @B1A         
SLCDMCWP DS    H                    DEFINED MINUMUM NUMBER OF                   
*                                   CONTENTION WINNER SESSIONS                  
*                                   - PARTNER LU                   @B1A         
SLCPARM2 DS    XL1                  INDICATORS                     @B1A         
SLCDDRAL EQU   X'80'                DEFINED DRAINING OF LOCAL LU   @B1A         
SLCDRSPL EQU   X'40'                DEFINED ACCEPTANCE DEACTIVATION             
*                                   RESPONSIBILITY OF LOCAL LU     @B1A         
SLCDEFND EQU   X'20'                ON-ATTN CNOS DRIVEN DUE TO MODIFY           
*                                   DEFINE. OFF- ATTN CNOS DRIVEN DUE           
*                                   TO CNOS PROCESSED ON TARGET SIDE.           
*        EQU   X'10'-X'01'          RESERVED                       @B1A         
         DS    XL1                  RESERVED                       @B1A         
*                                                                               
SLCEND   DS    0X                   END OF ISTSLCNS                             
         MEND                                                        */         
*                                                                               
*@LISTPOP;                          /* BEGIN PL/X MAPPING        @Y1C*/         
*                                                                               
*DCL                                                                            
*  1 ISTSLCNS BDY(HWORD) BASED,     /* SESSION LIMITS FOR CNOS       */         
*    3 SLCSESSL FIXED(15),          /* SESSION LIMIT                 */         
*    3 SLCMCWL  FIXED(15),          /* MINIMUM NUMBER OF CONTENTION             
*                                      WINNER SESSIONS - LOCAL LU    */         
*    3 SLCMCWP  FIXED(15),          /* MINIMUM NUMBER OF CONTENTION             
*                                      WINNER SESSION - PARTNER LU   */         
*    3 SLCPARMS BIT(8),             /* CNOS PARAMETERS               */         
*      5 SLCDRAL  BIT(1),           /* DRAINING OF LOCAL LU:                    
*                                      B'0' - NO DRAINING REQUESTED,            
*                                      B'1' - DRAINING REQUESTED     */         
*      5 SLCDRAP  BIT(1),           /* DRAINING OF PARTNER LU:                  
*                                      B'0' - NO DRAINING REQUESTED,            
*                                      B'1' - DRAINING REQUESTED     */         
*      5 SLCPRSPL BIT(1),           /* RESPONSIBLE FOR DEACTIVATION:            
*                                      B'0' - LOCAL LU RESPONSIBLE,             
*                                      B'1' - PARTNER LU RESPONSIBLE */         
*      5 SLCALL   BIT(1),           /* INDICATES IF CNOS IS FOR ONE             
*                                      MODE OR ALL MODES:                       
*                                      B'0' - ONE MODE,                         
*                                      B'1' - ALL MODES              */         
*      5 SLCSSLU  BIT(1),           /* INDICATES IF THE PARTNER LU IS           
*                                      ONLY SINGLE SESSION CAPABLE              
*                                      B'0' - SINGLE SESSION CAPABILITY         
*                                             IS UNKNOWN                        
*                                      B'1' - SINGLE SESSION CAPABILITY         
*                                             IS KNOWN       @P041930*/         
*      5 SLCLCLSI BIT(3),           /* LOCAL LU SECURITY SUBFIELD               
*                                      ACCEPTANCE INDICATORS @P052802*/         
*        6 SLCLCONV BIT(1),         /* LOCAL LU ACCEPTS SECURITY                
*                                      SUBFIELDS ON FMH5     @P052802*/         
*        6 SLCLAVFA BIT(1),         /* LOCAL LU ACCEPTS REQUESTS FOR            
*                                      ALREADY VERIFIED          @F1A*/         
*        6 SLCLPV   BIT(1),         /* LOCAL LU ACCEPTS REQUESTS FOR            
*                                      PERSISTENT VERIFICATION   @B2C*/         
*    3 * CHAR(1),                   /* RESERVED                  @B1A*/         
*    3 SLCDSESL FIXED(15),          /* DEFINED SESSION LIMIT     @B1A*/         
*    3 SLCDMCWL FIXED(15),          /* DEFINED MINIMUM NUMBER OF                
*                                      CONTENTION WINNER SESSIONS               
*                                      - LOCAL LU                @B1A*/         
*    3 SLCDMCWP FIXED(15),          /* DEFINED MINIMUM NUMBER OF                
*                                      CONTENTION WINNER SESSIONS               
*                                      - PARTNER LU              @B1A*/         
*    3 SLCPARM2 BIT(8),             /* INDICATOR                 @B1A*/         
*      5 SLCDDRAL BIT(1),           /* DEFINED DRAINING OF LOCAL LU             
*                                                                @B1A*/         
*      5 SLCDRSPL BIT(1),           /* DEFINED ACCEPTANCE OF                    
*                                      DEACTIVATION RESPONSIBILITY              
*                                      OF LOCAL LU               @B1A*/         
*      5 SLCDEFND BIT(1),           /* ON- ATTN CNOS EXIT WAS DRIVEN            
*                                      DUE TO APPCCMD DEFINE. OFF ATTN          
*                                      CNOS EXIT DRIVEN DUE TO A APPC-          
*                                      CMD CNOS.                     */         
*      5 *        BIT(5),           /* RESERVED                  @B1A*/         
*    3 *          CHAR(1),          /* RESERVED                  @B1A*/         
*    3 SLCEND     CHAR(0);          /* END OF CONTROL BLOCK      @B1A*/         
*                                                                               
*/********************************************************************/         
*/*                                                                  */         
*/*    CONSTANT FOR LENGTH OF MIGRATION LEVEL OF ISTSLCNS            */         
*/*                                                                  */         
*/********************************************************************/         
*DCL                                                                            
*    SLCMLEN FIXED(8) CONSTANT(7);  /* LENGTH OF MIGRATION LEVEL @B1A*/         
*                                                                               
