*%dcl ISTSMF77_inc fixed external;                                              
*%if ISTSMF77_inc=0 %then %do;                                                  
*%ISTSMF77_inc=1;                                                               
*%GOTO IST771; /*                                                               
         MACRO                                                                  
         ISTSMF77 &HEADER=YES,    YES = SMF HEADER DSECTS FOR ALL RECS X        
               &SNA=YES           YES = GEN SNA SMF 119 DSECTS                  
         AGO   .M010000      */                                                 
*%IST771: ;                                                                     
*/********************* START OF SPECIFICATIONS **********************/         
*/*                                                                  */         
*/* MACRO NAME:       ISTSMF77                                       */         
*/*                                                                  */         
*/* DESCRIPTIVE NAME: SMF Record Type 119 Mapping                    */         
*/*                                                                  */         
*/* COMPONENT NAME:   Mapping SNA 119 Records                        */         
*/*                                                                  */         
*/* Copyright: Licensed Materials - Property of IBM                  */         
*/*            This module is "Restricted Materials of IBM"          */         
*/*            5650-ZOS Copyright IBM Corp. 2016                     */         
*/*                                                                  */         
*/*            US Government Users Restricted Rights -               */         
*/*            Use, duplication or disclosure restricted by          */         
*/*            GSA ADP Schedule Contract with IBM Corp.              */         
*/*            See IBM Copyright Instructions.                       */         
*/*                                                                  */         
*/* Status:    CSV2R2                                                */         
*/*                                                                  */         
*/* Function:           This macro is used to map SMF type 119       */         
*/*                     records.                                     */         
*/*                                                                  */         
*/* Part Type:          MACRO                                        */         
*/*                                                                  */         
*/* Storage Attributes:                                              */         
*/*   Subpool:          0-255                                        */         
*/*   Data Space:       N/A                                          */         
*/*   Key:              0-15                                         */         
*/*   Residency:        N/A                                          */         
*/*                                                                  */         
*/* Method of Access:   ASSEMBLER                                    */         
*/*                                                                  */         
*/*                       ISTSMF77                                   */         
*/*                                                                  */         
*/*                     PL/X                                         */         
*/*                                                                  */         
*/*                       Specify '%include syslib(ISTSMF77)'        */         
*/*                                                                  */         
*/* Notes for Use:      None.                                        */         
*/*                                                                  */         
*/* Serialization:      N/A                                          */         
*/*                                                                  */         
*/* Change Activity:                                                 */         
*/*                                                                  */         
*/* $MAC(ISTSMF77),COMP(SMF),PROD(SNA):                              */         
*/*                                                                  */         
*/* Flag Reason   Release  Date   Origin    Description              */         
*/* ---- -------- -------- ------ --------  ------------------------ */         
*/* $A0= OA49911  HVT6220  160607 MWS     : 3270 Vulnerability       */         
*/*                                         (sysroute of OA48802)    */         
*/* $A1= OA58513  HVT6220  191023 Cruse   : Adding IST119DS_DIFLAG   */         
*/********************************************************************/         
*/* NOTE: Changes to this part need to be mirrored in                */         
*/*       istsmf.h as well                                           */         
*/********************************************************************/         
*%GOTO IST772; /*                                                               
.M010000 ANOP                                                                   
         AIF   ('&HEADER' NE 'YES').M020000                                     
*---------------------------------------------------------------------*         
*                                                                               
* SMF Type 119 Record                                                           
*                                                                               
IST119Header   DSECT ,          SMF Record Header                               
IST119HDLength  DS  BL2         Record length                                   
IST119HDSegDesc DS  BL2         Segment descriptor                              
IST119HDFlags   DS  BL1         Header flags                                    
IST119HDSUB    EQU X'40'        Subtypes are valid                              
IST119HDSP4    EQU X'10'        MVS/SP Version 4 and above                      
IST119HDSP3    EQU X'08'        MVS/SP Version 3 and above                      
IST119HDSP2    EQU X'04'        MVS/SP Version 2 and above                      
IST119HDVS2    EQU X'02'        MVS/VS2                                         
IST119HDType    DS  BL1         Record type (119, x'77')                        
IST119HDTime    DS  CL4         Time record was moved to SMF buffer             
IST119HDDate    DS  PL4         Date record was moved to SMF buffer             
IST119HDSID     DS  CL4         System ID                                       
IST119HDSSI     DS  CL4         Subsystem ID                                    
IST119HDSubType DS  BL2         Record subtype                                  
IST119HDLN     EQU *-IST119Header                                               
*                                                                               
IST119Type         EQU   119    SMF 119 Record type                             
*                                                                               
IST119HDST_DS3270  EQU   81     SMF IDS3270 subtyupe                            
*                                                                               
IST_MAX_RECLEN     EQU   32756  SMF Maximum record length                       
*                                                                               
* Self Defining section, basic level. All records will have at least            
* two triplets, one for the Stack Identification section and one for            
* a record specific section                                                     
*                                                                               
IST119SDefSect DSECT ,          SMF Self-defining section                       
IST119SD_TRN    DS  BL2         Number of triplets                              
IST119SDrsvd    DS  BL2         reserved                                        
IST119IDOff     DS  BL4         Offset to IP/SNA Ident section                  
IST119IDLen     DS  BL2         Length of IP/SNA Ident section                  
IST119IDNum     DS  BL2         Number of IP/SNA Ident section                  
IST119S1Off     DS  BL4         Offset to first record section                  
IST119S1Len     DS  BL2         Length of first record section                  
IST119S1Num     DS  BL2         Number of section instances                     
IST119SDLN     EQU *-IST119SDefSect                                             
*                                                                               
* Additional mapping for records with three sections.                           
IST119SD3Triples  DSECT ,       SMF Self-defining section, 3rd triple           
IST119S2Off     DS  BL4         Offset to 2nd record section                    
IST119S2Len     DS  BL2         Length of 2nd record section                    
IST119S2Num     DS  BL2         Number of section instances                     
IST119S3LN     EQU *-IST119SD3Triples                                           
*                                                                               
* Additional mapping for records with four sections.                            
IST119SD4Triples  DSECT ,       SMF Self-defining section, 4th triple           
IST119S3Off     DS  BL4         Offset to 3rd record section                    
IST119S3Len     DS  BL2         Length of 3rd record section                    
IST119S3Num     DS  BL2         Number of section instances                     
IST119S4LN     EQU *-IST119SD4Triples                                           
*                                                                               
*    Mapping of a triplet in the Self-defining section                          
*                                                                               
IST119SDTriplet   DSECT ,                                                       
IST119Off         DS    F       Offset of section                               
IST119Len         DS    H       Length of section                               
IST119Num         DS    H       Number of sections                              
IST119End         DS    0C      End of triplet                                  
                                                                                
                                                                                
*                                                                               
*---------------------------------------------------------------------*         
*                                                                               
* IP/SNA Identification section, common to all records (Section 0)              
*                                                                               
IST119Ident DSECT                                                               
IST119TI_SYSName      DS  CL8     System name                                   
IST119TI_SysplexName  DS  CL8     Sysplex name                                  
IST119TI_Stack        DS  CL8     Stack name                                    
IST119TI_ReleaseID    DS  CL8     SNA release identifier                        
IST119TI_Comp         DS  CL8     IP/SNA subcomponent                           
IST119TI_ASName       DS  CL8     Address space name of writer                  
IST119TI_UserID       DS  CL8     User ID of security context                   
IST119TI_ASID         DS  BL4     ASID of writer                                
     ORG IST119TI_ASID                                                          
IST119TI_fill2        DS  BL2     High order bytes not used                     
IST119TI_ASID2        DS  BL2     Low order bytes contain ASID                  
IST119TI_Reason       DS  BL1     Reason for writing record                     
IST119TI_ReasonIntInc   EQU X'C0'  - Interval record, incomplete                
IST119TI_ReasonInt      EQU X'80'  - Interval record                            
IST119TI_ReasonIEndInc  EQU X'60'  - Interval ending stats, incomplete          
IST119TI_ReasonIEnd     EQU X'20'  - Interval ending stats                      
IST119TI_ReasonIShtInc  EQU X'50'  - Interval shutdown stats,incomplete         
IST119TI_ReasonISht     EQU X'10'  - Interval shutdown stats                    
IST119TI_ReasonEvtInc   EQU X'48'  - Event record, incomplete                   
IST119TI_ReasonEvt      EQU X'08'  - Event record, complete                     
IST119TI_RecordID     DS  BL1     ID value for correlating records              
IST119TI_rsvd         DS  CL2'0'  Reserved                                      
IST119TILN    EQU *-IST119Ident                                                 
*                                                                               
IST119TI_IDentDefs DSECT                                                        
IST119DS_Comp3270     DC  C'IDS3270 '                                           
.*                                                                              
.M020000 ANOP                                                                   
         AIF   ('&SNA' NE 'YES').M075000                                        
*---------------------------------------------------------------------*         
*                                                                               
* VTAM 3270 Intrusion Detection Services event record                           
*      (Subtype  81)   (Section  1)                                             
*                                                                               
*---------------------------------------------------------------------*         
IST119DS_32            DSECT ,                                                  
IST119DS_Time          DS  BL8     STCK time of incident (UTC)                  
IST119DS_PLUNAME       DS  CL17    PLU Netid.name                               
IST119DS_SLUNAME       DS  CL17    SLU Netid.name                               
IST119DS_Rsvd02A       DS  CL10    Reserved                                     
IST119DS_SID           DS  CL8     Session id                                   
IST119DS_IncTk         DS  FL4     Incident token                               
IST119DS_ECode         DS  Cl1     Incident error code                          
IST119DS_DSCOUNT       DS  FL1     DSCOUNT pararmeter                           
IST119DS_DSACTION      DS  BL1     DSACTION parameters                          
IST119DS_DSACT_Rpt     EQU X'0C'   DSACTION Report Level                        
IST119DS_DSACT_SYS     EQU X'08'   Syslog                                       
IST119DS_DSACT_CON     EQU X'0C'   Console                                      
*                                                                               
IST119DS_DSACT_Int     EQU X'03'   DSACTION Intervention                        
IST119DS_DSACT_None    EQU X'01'   None                                         
IST119DS_DSACT_Sense   EQU X'02'   Sense                                        
IST119DS_DSACT_Term    EQU X'03'   Term                                         
                       DS  CL1     Not used - available                         
IST119DS_RIPV6         DS  0BL16   Remote IP address (IPv6)                     
*                                   (TN3270 sessions only)                      
IST119DS_RIPRsvd       DS  CL10    zeros if IPv4 address                        
IST119DS_RIPFmt        DS  CL2     zeros if IPv4 address                        
IST119DS_RIPV4         DS  CL4     Remote IP address (IPv4)                     
IST119DS_RPort         DS  H       Remote port number                           
*                                   (TN3270 sessions only)                      
IST119DS_Row           DS  FL1     Row                                          
IST119DS_Col           DS  FL1     Column                                       
IST119DS_Offset        DS  FL2     Offset into 3270 display space               
IST119DS_OBufO         DS  FL2     Output buffer offset                         
IST119DS_IBufO         DS  FL2     Input  buffer offset                         
IST119DS_OBufL         DS  FL2     Output buffer length                         
IST119DS_IBufL         DS  FL2     Input  buffer length                         
IST119DS_OSEQ          DS  FL2     Outbound PIU Sequence number                 
IST119DS_ISEQ          DS  FL2     Inbpound PIU Sequence number                 
IST119DS_OFLD          DS  XL32    First 32 bytes of outbound                   
*                                   PIU field                                   
IST119DS_IFLD          DS  XL32    First 32 bytes of inbound                    
*                                   PIU field                                   
IST119DS32LN           EQU *-IST119DS_32                                        
*---------------------------------------------------------------------*         
*                                                                               
* VTAM 3270 Intrusion Detection Services event record                           
*      (Subtype  81)   (Section  2) (Outbound buffer)                           
*                                                                               
*---------------------------------------------------------------------*         
IST119DS_DO            DSECT ,     IDS 3270 Outbound buffer                     
IST119DS_DOTime        DS  BL8     STCK time of buffer (UTC)                    
IST119DS_DOFSNF        DS  H       First Sequence number                        
IST119DS_DOLSNF        DS  H       Last Sequence number                         
IST119DS_DOOFF         DS  H       Offset of data in IST119DS_DORU              
IST119DS_DOLEN         DS  H       Length of data in IST119DS_DORU              
IST119DS_DODSBn        DS  FL1     DSCOUNT buffer number                        
IST119DS_DOFlag        DS  BL2     Flags                                        
IST119DS_DOCDATA       EQU X'80'   Confidential data                            
IST119DS_DOTH          DS  CL26    Transmission header                          
IST119DS_DORH          DS  CL3     Request header                               
IST119DS_DORU          DS  0CL4096 outbound RU data                             
IST119DSDOLN           EQU *-IST119DS_DO Base IST119DO length                   
*                                                                               
*---------------------------------------------------------------------*         
*                                                                               
* VTAM 3270 Intrusion Detection Services event record                           
*      (Subtype  81)   (Section  3) (Inbound buffer)                            
*                                                                               
*---------------------------------------------------------------------*         
IST119DS_DI            DSECT ,     IDS 3270 Inbound buffer                      
IST119DS_DITime        DS  BL8     STCK time of buffer (UTC)                    
IST119DS_DIFSNF        DS  H       First Sequence number                        
IST119DS_DILSNF        DS  H       Last Sequence number                         
IST119DS_DIOFF         DS  H       Offset of data in IST119DS_DIRU              
IST119DS_DILEN         DS  H       Length of data in IST119DS_DIRU              
                       Ds  FL1     Reserved                                     
IST119DS_DIFLAG        DS  BL2     Flags                         @A1C           
IST119DS_DICDATA       EQU X'80'   Confidential data             @A1C           
IST119DS_DITH          DS  CL26    Transmission header                          
IST119DS_DIRH          DS  CL3     Request header                               
IST119DS_DIRU          DS  0CL4096 Inbound RU data                              
IST119DSDILN           EQU *-IST119DS_DI Base IST119DI length                   
.M075000 ANOP  ,                                                                
.M080000 ANOP                                                                   
        MEND       */                                                           
*%IST772: ;                                                                     
*                                                                               
*/********************************************************************/         
*/*                                                                  */         
*/* Mapping for the Common SMF record header that is part of all     */         
*/* IP/SNA SMF records. The only fields that need to be set by the   */         
*/* SMF processing are the Length, Flags, Type, and Subtype values.  */         
*/* The rest are filled in by MVS SMF processing.                    */         
*/*                                                                  */         
*/********************************************************************/         
*                                                                               
* DCL                                                                           
*  1 IST119Header BASED BDY(WORD),  /* Header overlay                */         
*    3 IST119HDLength    FIXED(15), /* Length of record              */         
*    3 IST119HDSegDesc   FIXED(15), /* Segment Descriptor            */         
*    3 IST119HDFlags     BIT(8),    /* System Indicator              */         
*      5 *               BIT(1),    /* Reserved                      */         
*      5 IST119HDSub     BIT(1),    /* Subtypes are valid.           */         
*      5 *               BIT(1),    /* Reserved                      */         
*      5 IST119HDSP4     BIT(1),    /* MVS/SP Version 4 and above    */         
*      5 IST119HDSP3     BIT(1),    /* MVS/SP Version 3 and above    */         
*      5 IST119HDSP2     BIT(1),    /* MVS/SP Version 2 and above    */         
*      5 IST119HDVS2     BIT(1),    /* MVS/VS2                       */         
*      5 *               BIT(1),    /* Reserved                      */         
*    3 IST119HDType      FIXED(8),  /* Record type number is 119,               
*                                      or hex 77.                    */         
*    3 IST119HDTime      FIXED(31) BDY(HWORD), /* TOD, Using format             
*                                      from TIME macro with BINARY   */         
*    3 IST119HDDate      CHAR(4),   /* DATE Record written CCYYDDDS  */         
*    3 IST119HDSID       CHAR(4),   /* SYSTEM Id from Installation   */         
*    3 IST119HDSSI       CHAR(4),   /* Subsystem identification      */         
*    3 IST119HDSubType   FIXED(16), /* SMF sub type field            */         
*    3 IST119HDEnd       CHAR(0);   /* End of header mapping         */         
*                                                                               
*/********************************************************************/         
*/* Constants for IST119HDType Field                                 */         
*/********************************************************************/         
* Declare                                                                       
*   IST119Type             FIXED(8) CONSTANT(119);                              
*                                                                               
*/********************************************************************/         
*/* Constants for IST119HDFlags Field                                */         
*/********************************************************************/         
* Declare                                                                       
*   IST119FlagsValue       BIT(8) CONSTANT('50'X); /* Subtypes are              
*                                      valid and MVS V4 and above    */         
*                                                                               
*/********************************************************************/         
*/* Constants for IST119HDSubType field                              */         
*/********************************************************************/         
* Declare                                                                       
*   IST119HDST_DS3270      FIXED(16) CONSTANT(81);                              
*                                                                               
* Declare                                                                       
*   IST_MAX_RECLEN         FIXED(16) CONSTANT(32756);                           
*                                   /* Maximum SMF 119 record size   */         
*                                                                               
*/********************************************************************/         
*/*                                                                  */         
*/* Mappings for the Self Defining Section triplets. Each Type 119   */         
*/* record will have at least two triplets, so the basic mapping     */         
*/* will include at least that many triplets. Additional mappings    */         
*/* will be defined for records that have more triplets.             */         
*/*                                                                  */         
*/********************************************************************/         
*                                                                               
* DCL                                                                           
*  1 IST119SDefSect BASED(ADDR(IST119HDEnd)),                                   
*    3 IST119SD_TRN      FIXED(16), /* Number of triplets            */         
*    3 *                 CHAR(2),   /* Unused, available             */         
*                                                                               
*    /* The first triplet points to the IP/SNA Common Stack          */         
*    /* Identification section used by all Type 119 records.         */         
*                                                                               
*    3 IST119IDOff       FIXED(32), /* Offset to Common section      */         
*    3 IST119IDLen       FIXED(16), /* Length of Common section      */         
*    3 IST119IDNum       FIXED(16), /* Number of Common sections     */         
*                                                                               
*    /* The next triplet defines the first of the record specific    */         
*    /* sections for a given record.                                 */         
*                                                                               
*    3 IST119S1Off       FIXED(32), /* Offset, first record section  */         
*    3 IST119S1Len       FIXED(16), /* Length, first record section  */         
*    3 IST119S1Num       FIXED(16), /* Number, first record sections */         
*    3 IST119S1End       CHAR(0);   /* End of Self Defining Section             
*                                      with two triplets             */         
*                                                                               
* /* The next mapping extends the self defining section to have an   */         
* /* additional (third) triplet, counting the Common Stack section.  */         
*                                                                               
* DCL                                                                           
*  1 IST119SDThreeTriplets BASED(ADDR(IST119S1End)),                            
*    3 IST119S2Off       FIXED(32), /* Offset, second record section */         
*    3 IST119S2Len       FIXED(16), /* Length, second record section */         
*    3 IST119S2Num       FIXED(16), /* Number, second record sections*/         
*    3 IST119S2End       CHAR(0);   /* End of Self Defining Section             
*                                      with three triplets           */         
*                                                                               
* /* The next mapping extends the self defining section to have an   */         
* /* additional (fourth) triplet, counting the Common Stack section. */         
*                                                                               
* DCL                                                                           
*  1 IST119SDFourTriplets BASED(ADDR(IST119S2End)),                             
*    3 IST119S3Off       FIXED(32), /* Offset, third record section  */         
*    3 IST119S3Len       FIXED(16), /* Length, third record section  */         
*    3 IST119S3Num       FIXED(16), /* Number, third record sections */         
*    3 IST119S3End       CHAR(0);   /* End of Self Defining Section             
*                                      with four triplets            */         
*                                                                               
*                                                                               
* /* Mapping of a triplet in the Self-defining section               */         
*                                                                               
* DCL                                                                           
*  1 IST119SDTriplet    BASED,                                                  
*    3 IST119Off         FIXED(32), /* Offset of section             */         
*    3 IST119Len         FIXED(16), /* Length of section             */         
*    3 IST119Num         FIXED(16), /* Number of sections            */         
*    3 IST119End         CHAR(0);   /* End of triplet                */         
*                                                                               
*                                                                               
*/********************************************************************/         
*/*                                                                  */         
*/* Mapping for the IP/SNA Common Stack Identification Section that  */         
*/* is included in all IP/SNA Type 119 SMF records. The section is   */         
*/* the first one included in the record, after the last of the      */         
*/* self defining triplets.                                          */         
*/*                                                                  */         
*/********************************************************************/         
*                                                                               
* DCL                               /* Section 0                     */         
*  1 IST119Ident BASED,                                                         
*    3 IST119TI_SYSName  CHAR(8),   /* System name                   */         
*    3 IST119TI_SysplexName  CHAR(8), /* Sysplex name                */         
*    3 IST119TI_Stack    CHAR(8),   /* Stack name                    */         
*    3 IST119TI_ReleaseID  CHAR(8), /* SNA release identifier        */         
*    3 IST119TI_Comp     CHAR(8),   /* IP/SNA subcomponent           */         
*    3 IST119TI_ASName   CHAR(8),   /* Address space name of writer  */         
*    3 IST119TI_UserID   CHAR(8),   /* User ID of security context   */         
*    3 IST119TI_ASID     FIXED(32), /* ASID of writer                */         
*      5 *               CHAR(2),   /* Filler                        */         
*      5 IST119TI_ASID2  FIXED(16), /* ASID currently just 2 bytes   */         
*    3 IST119TI_Reason   CHAR(1),   /* Reason for writing record     */         
*    3 IST119TI_RecordID FIXED(8),  /* ID value used for correlating */         
*                                   /* records                       */         
*    3 *                 CHAR(2),   /* Padding, available            */         
*    3 IST119TI_End      CHAR(0);   /* End of section mapping        */         
*                                                                               
*/********************************************************************/         
*/* Constants for IST119TI_Comp field                                */         
*/********************************************************************/         
* Declare                                                                       
*   IST119TI_CompIDS     CHAR(8) CONSTANT('IDS3270 ');                          
*                                                                               
*/********************************************************************/         
*/* Constants for IST119TI_Reason field                              */         
*/********************************************************************/         
* Declare                                                                       
*   IST119TI_ReasonIntInc CHAR(1) CONSTANT('C0'X), /* Interval record,          
*                                      incomplete reporting          */         
*   IST119TI_ReasonInt  CHAR(1) CONSTANT('80'X), /* Interval record,            
*                                      completed reporting           */         
*   IST119TI_ReasonIEndInc  CHAR(1) CONSTANT('60'X), /* Interval record         
*                                      ending statistics, incomplete            
*                                      recording                     */         
*   IST119TI_ReasonIEnd CHAR(1) CONSTANT('20'X), /* Interval record             
*                                      ending statistics, completed             
*                                      recording                     */         
*   IST119TI_ReasonIShtInc  CHAR(1) CONSTANT('50'X), /* Interval record         
*                                      shutdown statistics, incomplete          
*                                      recording                     */         
*   IST119TI_ReasonISht CHAR(1) CONSTANT('10'X), /* Interval record             
*                                      shutdown statistics, completed           
*                                      recording                     */         
*   IST119TI_ReasonEvtInc  CHAR(1) CONSTANT('48'X), /* Event record,            
*                                      incomplete reporting          */         
*   IST119TI_ReasonEvt  CHAR(1) CONSTANT('08'X), /* Event record,               
*                                      completed reporting           */         
*   IST119TI_ReasonStart  CHAR(1) CONSTANT('FF'X); /* Start value,              
*                                      used as interface value to the           
*                                      IF Stats, Port Stats, and                
*                                      SMC-R Group Stats record                 
*                                      builder routines              */         
*/********************************************************************/         
*/* Constants for All SMF records using IPv4 addresses               */         
*/********************************************************************/         
* Declare                                                                       
*   IST119MappedAddr  CHAR(2) CONSTANT('FFFF'X); /* Indicates that the          
*                                      address is strictly an IPv4              
*                                      address                       */         
*                                                                               
*                                                                               
*/*------------------------------------------------------------------*/         
*/*                                                                  */         
*/* VTAM 3270 Intrusion Detection Services event record              */         
*/*      (Subtype 81)    (Section  1)                                */         
*/*                                                                  */         
*/*------------------------------------------------------------------*/         
* Declare                                                                       
* 1 IST119DS_32           Based,                                                
*  3 IST119DS_Time        Char(8),   /* STCK time of the incident(UTC)*/        
*  3 IST119DS_PLUNAME     Char(17),  /* PLU NetId.name                */        
*  3 IST119DS_SLUNAME     Char(17),  /* SLU NetId.name                */        
*  3 IST119DS_Rsvd02A     Char(10),  /* Reserved                      */        
*  3 IST119DS_SID         Char(8),   /* Session Id                    */        
*  3 IST119DS_IncTk       Fixed(32), /* Incident token                */        
*  3 IST119DS_ECODE       Char(1),   /* Incident error code           */        
*  3 IST119DS_DSCOUNT     Fixed(8),  /* DSCOUNT parameter             */        
*  3 IST119DS_DSACTION    Bit(8),    /* DSACTION parameters           */        
*    5 *                  Bit(4),    /* Not used - reserved           */        
*    5 IST119DS_DSACT_Rpt Bit(2),    /* DSACTION Report Level         */        
*    5 IST119DS_DSACT_Int Bit(2),    /* DSACTION Intervention         */        
*  3 *                    Char(1),   /* Not used - available          */        
*  3 IST119DS_RIPV6       Char(16),  /* Remote IP address (IPv6)      */        
*                                    /*  (TN3270 sessions only)       */        
*    5 IST119DS_RIPRsvd    Char(10), /* zeros if IPv4 address         */        
*    5 IST119DS_RIPFmt     Char(2),  /* zeros if IPv4 address         */        
*    5 IST119DS_RIPV4      Char(4),  /* Remote IP address (IPv4)      */        
*  3 IST119DS_RPort       Fixed(16), /* Remote port number            */        
*                                    /*  (TN3270 sessions only)       */        
*  3 IST119DS_Row         Fixed(8),  /* Row                           */        
*  3 IST119DS_Col         Fixed(8),  /* Column                        */        
*  3 IST119DS_Offset      Fixed(16), /* Offset into 3270 buffer       */        
*  3 IST119DS_OBufO       Fixed(16), /* Output buffer offset          */        
*  3 IST119DS_IBufO       Fixed(16), /* Input  buffer offset          */        
*  3 IST119DS_OBufL       Fixed(16), /* Output buffer length          */        
*  3 IST119DS_IBufL       Fixed(16), /* Input  buffer length          */        
*  3 IST119DS_OSEQ        Fixed(16), /* Outbound PIU sequence Nr      */        
*  3 IST119DS_ISEQ        Fixed(16), /* Inbpound PIU sequence Nr      */        
*  3 IST119DS_OFLD        Char(32),  /* 32 bytes of outbound 3270     */        
*                                    /*   data stream                 */        
*  3 IST119DS_IFLD        Char(32),  /* 32 bytes of inbound 3270      */        
*                                    /*   data stream                 */        
*  3 IST119DS_End         Char(0);                                              
*   /* Constants for IST119DS_DSACT_Rpt - Report level                */        
*  Dcl                                                                          
*    IST119DS_DSACT_SYS    Bit(2)  Constant('10'B), /* Syslog         */        
*    IST119DS_DSACT_CON    Bit(2)  Constant('11'B); /* Console        */        
*                                                                               
*   /* Constants for IST119DS_DSACT_Int - Intervention level          */        
*  Dcl                                                                          
*    IST119DS_DSACT_None   Bit(2)  Constant('01'B), /* None           */        
*    IST119DS_DSACT_Sense  Bit(2)  Constant('10'B), /* Sense          */        
*    IST119DS_DSACT_Term   Bit(2)  Constant('11'B); /* Term           */        
*                                                                               
*/*------------------------------------------------------------------*/         
*/*                                                                  */         
*/* VTAM 3270 Intrusion Detection Services event record              */         
*/*      (Subtype 81)    (Section  2)  (Outbound Buffer)             */         
*/*                                                                  */         
*/*------------------------------------------------------------------*/         
* Declare                                                                       
* 1 IST119DS_DO           Based,                                                
*  3 IST119DS_DOHdr,                 /* Header portion                */        
*   5 IST119DS_DOTime     Char(8),   /* STCK time of buffer (UTC)     */        
*   5 IST119DS_DOFSNF     Fixed(16), /* First sequence number         */        
*   5 IST119DS_DOLSNF     Fixed(16), /* Last sequence number          */        
*   5 IST119DS_DOOFF      Fixed(15), /* Offset of data in DS_DORU     */        
*   5 IST119DS_DOLEN      Fixed(15), /* Length of data in DS_DORU     */        
*   5 IST119DS_DODSBn     Fixed(8),  /* DSCOUNT buffer number         */        
*   5 IST119DS_DOFlag     Bit(16),   /* Flags                         */        
*    7 IST119DS_DOCData   Bit(1),    /* Confidental data              */        
*   5 IST119DS_DOTH       Char(26),  /* SNA Transmission header       */        
*   5 IST119DS_DORH       Char(3),   /* SNA Request header            */        
*  3 IST119DS_DORU        Char(4096),/* Outbound RU data              */        
*  3 IST119DS_DOEnd       Char(0);                                              
*                                                                               
*/*------------------------------------------------------------------*/         
*/*                                                                  */         
*/* VTAM 3270 Intrusion Detection Services event record              */         
*/*      (Subtype 81)   (Section  3)   (Inbound buffer)              */         
*/*                                                                  */         
*/*------------------------------------------------------------------*/         
* Declare                                                                       
* 1 IST119DS_DI           Based,                                                
*  3 IST119DS_DIHdr,                 /* Header portion                */        
*   5 IST119DS_DITime     Char(8),   /* STCK time of buffer (UTC)     */        
*   5 IST119DS_DIFSNF     Fixed(16), /* First Sequence number         */        
*   5 IST119DS_DILSNF     Fixed(16), /* Last Sequence number          */        
*   5 IST119DS_DIOFF      Fixed(15), /* Offset of data in DS_DIRU     */        
*   5 IST119DS_DILEN      Fixed(15), /* Length of data in DS_DIRU     */        
*   5 *                   Fixed(8),  /* Reserved                      */        
*   5 IST119DS_DIFlag     Bit(16),   /* Flags                         */        
*    7 IST119DS_DICData   Bit(1),    /* Confidental data              */        
*   5 IST119DS_DITH       Char(26),  /* SNA Transmission header       */        
*   5 IST119DS_DIRH       Char(3),   /* SNA Request header            */        
*  3 IST119DS_DIRU        Char(4096),/* Inbound RU Data              */         
*  3 IST119DI_DIEnd       Char(0);                                              
*                                                                               
*                                                                               
*%end;                                                                          
