*/*                                                                             
         MACRO                                                                  
         ISTXPL &DSECT=YES,&LIST=YES,&ISTXPL=YES,&XPLVEC=COND                   
 TITLE   'ISTXPL  - PERFORMANCE EXIT PARAMETER  LIST                '           
**/                                                                             
*/* START OF SPECIFICATIONS ******************************************          
*01* DESCRIPTIVE NAME: PERFORMANCE EXIT PARAMETER  LIST                         
*01* MACRO NAME:  ISTXPL                                                        
* END OF SPECIFICATIONS **********************************************/         
*/*                                                                             
* ********************************************************************          
* *                                                                  *          
* * MACRO-NAME: ISTXPL                                               *          
* *                                                                  *          
* * MACRO-ACRONYM: XPL                                               *          
* *                                                                  *          
* * MACRO-DESCRIPTIVE-NAME: EXIT PARAMETER LIST                      *          
* *                                                                  *          
* *  COPYRIGHT: LICENSED MATERIALS - PROPERTY OF IBM                 *          
* *                                                                  *          
* *             THIS PRODUCT CONTAINS "RESTRICTED MATERIALS OF IBM"  *          
* *                                                                  *          
* *             5650-ZOS COPYRIGHT IBM CORP. 1994, 2015              *          
* *             ALL RIGHTS RESERVED.                                 *          
* *                                                                  *          
* *             U.S. GOVERNMENT USERS RESTRICTED RIGHTS -            *          
* *             USE, DUPLICATION OR DISCLOSURE RESTRICTED BY         *          
* *             GSA ADP SCHEDULE CONTRACT WITH IBM CORP.             *          
* *                                                                  *          
* *             SEE COPYRIGHT INSTRUCTIONS.                          *          
* *                                                                  *          
* *  MACRO-FUNCTION:                                                 *          
* *                                                                  *          
* *       ISTXPL is a Management Services Control Block containing   *          
* *       the information passed back to the Performance Monitor via *          
* *       the VTAM Inline Exit Facility.                             *          
* *                                                                  *          
* *                                                                  *          
* *  MACRO-BOUNDARY: DWORD                                           *          
* *                                                                  *          
* *  MACRO-CREATED-BY: THE USER                                      *          
* *                                                                  *          
* *  MACRO-LOCATION: NA                                              *          
* *                                                                  *          
* *  MACRO-DEPENDENCIES: AS FOLLOW                                   *          
* *                                                                  *          
* *       CHANGES to the XPL MUST follow the conventions set by the  *          
* *       original desing of PMI.  They are as follows:              *          
* *            1)  Reserved fields SHOULD NOT become defined from    *          
* *                one release of VTAM to the next.  Within a release*          
* *                development cycle, flag bits and other fields not *          
* *                allocated may be used or redefined, otherwise     *          
* *                THEY SHOULD BE LEFT ALONE]                        *          
* *            2)  A new fields may be appended to the vector from   *          
* *                relase to release                             @D3A*          
* *                                                                  *          
* *    REQUIRED-INNER-MAPS:  NONE                                    *          
* *                                                                  *          
* *    REQUIRED-BY: NONE                                             *          
* *                                                                  *          
* * MACRO-NOTES:                                                     *          
* *                                                                  *          
* *                                                                  *          
* * MACRO_LAST-CHANGED:                                              *          
* *                                                                  *          
* * $MAC(ISTXPL),COMP(MGMTSVC),PROD(VTAM): Monitor Exit Parm List    *          
* *                                                                  *          
* * FLAG REASON   RELEASE DATE   ORIGIN  FLAG DESCRIPTORS            *          
* * ---- -------- ------- ------ ------  --------------------------- *          
* * $L0= FO@@@MST PERFMON 920511 043006: Performance Monitor         *          
* *                                      Interface                   *          
* * $L1= FO@DR001 PERFMON 930325 595229: BN and DLS enhancements     *          
* * $L2= KP@@@MST PMIII   930524 595229: Multiple Monitors           *          
* * $L3= KP@DR003 PMIII   930914 595229: SMF Enhancements            *          
* * $L4= KP@DR009 PMIII   940228 043006: Support Level Recognition   *          
* * $Y1= P112751  PERFMON 940325 043006: VR counts in error          *          
* * $L5= KP@DR008 PMIII   940520 043006: Add DIRSIZE start option    *          
* * $Y2= P118118  PMIII   950315 043006: Adjust XPLGSBV_XPANO length *          
* * $D1= ID@@@MST FPAPI   950324 658994: Fast Path API for APPC      *          
* * $D2= IP@@@MST MNPS    950714 421970: MNPS                        *          
* * $D3= IY@@@MST HPRNW   950614 595229: HPR Network Management - PMI*          
* * $D4= IY@DR004 HPRNW   960424 792173: Add RTP PU name to PMI      *          
* * $S1= P123204  MNPS    960708 421970: Strengthen boundary value   *          
* * $S2= P123209  MNPS    960724 658994: Add vector GETSTOR data     *          
* * $S3= P123839  MNPS    960828 226653: Remove GETSTOR vector       *          
* * $S4= P125018  FPAPI   961114 143576: Corrected mapping of CSM    *          
* *                                      vectors                     *          
* * $91= OW31324  CSV2R7  980526 714761: Corrected mapping of CSM    *          
* *                                      vectors in assembler portion*          
* *                                                                  *          
* * Flag Reason   Release  Date   Origin    Description              *          
* *----- -------- -------- ------ --------  ------------------------ *          
* * $A1= OW33528  CSV2R8   990212 WAMORAN : SME HPR Pipe             *          
* *                                         authorization            *          
* * $  = OW39301  CSV3R10  990528 WAMORAN : Update OW33528 change    *          
* *                                         activity to prevent      *          
* *                                         compiler messages        *          
* * $L6= D130557  CSV1R2   001010 Zebrow  : Missed hit for 64 bit    *          
* *                                         real support             *          
* * $A2= OA49911  HVT6220  151105 EZebrow : 3270 Vulnerability       *          
* *                                         (sysroute of OA48802)    *          
* *                                                                  *          
* ********************************************************************          
* ********************************************************************          
* *             Parameter List Header                                *          
* ********************************************************************          
*                                                                               
*                                                                               
         AIF   ('&ISTXPL' EQ 'NO').L0002                                        
         AIF   ('&DSECT' EQ 'YES').L0003                                        
         AIF   ('&ISTXPL' NE 'YES').L0002                                       
ISTXPL   DS    0X        Monitor Exit Parameter List                            
         AGO   .L0004                                                           
.L0003   ANOP                                                                   
ISTXPL   DSECT           Monitor Exit Parameter List                            
.L0004   ANOP                                                                   
XPLHEAD  DS    0CL0024   Control Block Header                                   
XPLHEAD_LEN DS 1FL2      Entire XPL length in bytes - includes this    *        
                         field, header, and vectors                             
XPLHEAD_HLEN DS 1FL2     XPL header length in bytes                             
XPLHEAD_TRANS DS 1FL1    Reason for transmission                                
XPLHEAD_CORR DS 1CL0002  Correlator, PRID from CNMRU, Zero if          *        
                         Unsolicited                                            
XPLHEAD_MONACBN DS 1CL0008 Requesting monitor ACB name,                *        
                         Blanks if unsolcted                                    
XPLHEAD_FLAGS DS 0BL1    Flag byte                                              
XPLHEAD_GEN EQU X'FC'    General Use                                            
XPLHEAD_SMFIM EQU X'04'  SMF Interval Missed                                    
XPLHEAD_SEG EQU X'03'    Segmenting indicator                                   
XPLHEAD_FIRST EQU X'02'  First Segment indicator                                
XPLHEAD_LAST EQU X'01'   Last Segment indicator                                 
         ORG   XPLHEAD_FLAGS+X'00000001'                                        
XPLHEAD_TIME DS 1CL0008  SMF interval time stamp for SMF data                   
XPLHEAD_END DS 0C        Begin First Vector                                     
ISTXPL_LEN EQU *-ISTXPL                                                         
.L0002   ANOP                                                                   
*                                                                               
* ********************************************************************          
* *                    Vector Format                                 *          
* ********************************************************************          
*                                                                               
*                                                                               
         AIF   ('&XPLVEC' EQ 'NO').L0005                                        
         AIF   ('&DSECT' EQ 'YES').L0006                                        
         AIF   ('&XPLVEC' NE 'YES').L0005                                       
XPLVEC   DS    0X        Vector Format                                          
         AGO   .L0007                                                           
.L0006   ANOP                                                                   
XPLVEC   DSECT           Vector Format                                          
.L0007   ANOP                                                                   
XPLVEC_COM DS  0CL0008   Common Vector Format                                   
XPLVEC_LEN DS  1FL2      Length of vector including this length field           
XPLVEC_CAT DS  0CL0006   Data Type/Category                                     
XPLVEC_MAJ DS  1CL0002   Major Category: Global, VR,...                         
XPLVEC_SUB DS  1CL0002   Data Subcategory                                       
XPLVEC_REC DS  1CL0002   Record Type Subcategory                                
XPLVEC_DAT DS  0C        Vector data                                            
XPLV_LEN   EQU *-XPLVEC                                                         
*                                                                               
* ********************************************************************          
* ********************************************************************          
* **********            GLOBAL DATA VECTORS                 **********          
* ********************************************************************          
* ********************************************************************          
* ********************************************************************          
* *             Global Environment Vector                            *          
* ********************************************************************          
*                                                                               
         ORG   XPLVEC_DAT                                                       
XPLGENV  DS    0X                                                               
XPLGENV_TASK DS 0CL0004  VTAM Task Id                                           
XPLGENV_ASCB DS 0CL0004  ASCB Address (MVS/ESA)                                 
XPLGENV_ID DS  0CL0004   Machine/Task ID (VM/ESA)                               
XPLGENV_PCB DS 1CL0004   PCB Address (VSE/ESA)                                  
XPLGENV_SLN DS 1CL0008   VTAM Start List Name                                   
XPLGENV_CFN DS 1CL0008   VTAM Configuration File Name                           
XPLGENV_CRFN DS 1CL0008  VTAM Configuration Restart File Name                   
XPLGENV_DLR DS 1CL0004   Current number D/L/R requests                          
XPLGENV_MDLR DS 1CL0004  Max number D/L/R requests since last COLLECT  *        
                         CNM RU                                                 
XPLGENV_MDLRE DS 1CL0004 Max number D/L/R requests ever used                    
XPLGENV_SMEAO DS 0BL2    Session Manager Exit active options                    
XPLGENV_SMEB1 DS 0BL1    SME Bits 1                                             
XPLGENV_IAUTH EQU X'80'  Initial Authorized will be processed                   
XPLGENV_SAUTH EQU X'40'  Secondary Authorized will be processed                 
XPLGENV_IFAF EQU X'20'   Init and Final Accounting Functions will be   *        
                         processed                                              
XPLGENV_GWPS EQU X'10'   Gateway Path selection will be processed               
XPLGENV_EF EQU X'08'     End Function will be processed                         
XPLGENV_STA EQU X'04'    Session takeover accounting will be processed          
XPLGENV_SSCPS EQU X'02'  SSCP Selection Function will be processed              
XPLGENV_ASSCP EQU X'01'  Adjacent SSCP Selection for DSRLST will be    *        
                         processed                                              
         ORG   XPLGENV_SMEB1+X'00000001'                                        
XPLGENV_SMEB2 DS 0BL1    SME Bits 2                                             
XPLGENV_ELUST EQU X'80'  Exit Functions allowed for LU session         *        
                         takeover                                               
XPLGENV_IAAIO EQU X'40'  Init Authorization allowed for Init Other CD           
XPLGENV_ALIAS EQU X'20'  Alias selection will be processed                      
XPLGENV_ALS EQU X'10'    ALS selection will be processed                        
XPLGENV_DSSIB EQU X'08'  ALS Selection processed for DSSIB requests             
XPLGENV_CDRSC EQU X'04'  ALS Selection processed for CDRSC requests             
XPLGENV_SMEMR EQU X'02'  SME supports MODIFY REPLACE                            
XPLGENV_VR EQU X'01'     VR selection will be processed                         
         ORG   XPLGENV_SMEAO+X'00000002'                                        
XPLGENV_GEFGS DS 0BL1    Global Environment Flags                               
XPLGENV_SSCPG EQU X'80'  SSCP Gateway capability                                
XPLGENV_ANN EQU X'40'    APPN Network Node capability                           
XPLGENV_AEN EQU X'20'    APPN End Node capability                               
XPLGENV_ADS EQU X'10'    APPN DS Capability                                     
XPLGENV_AIN EQU X'08'    APPN Interchange Node capability                       
XPLGENV_AMDH EQU X'04'   APPN Migration data Host capability                    
XPLGENV_BNC EQU X'02'    Border Node capability                                 
         ORG   XPLGENV_GEFGS+X'00000001'                                        
XPLGENV_DSMEAO DS 0CL0002 Directory Services Manager Exit active       *        
                         options                                                
XPLGENV_DSMEB1 DS 0BL1   DSME Bits 1                                            
XPLGENV_DIAUTH EQU X'80' Initial Authorized will be processed                   
XPLGENV_BNSO EQU X'10'   Border Node Selection Option Supported                 
XPLGENV_DEF EQU X'08'    End function will be processed                         
         ORG   XPLGENV_DSMEB1+X'00000001'                                       
XPLGENV_DSMEB2 DS 0BL1   DSME Bits 2                                            
XPLGENV_DSMMR EQU X'02'  DSME supports MODIFY REPLACE                           
         ORG   XPLGENV_DSMEAO+X'00000002'                                       
XPLGENV_TMINV DS 1CL0002 Tuning Statistics Timing interval                      
XPLGENV_FLGS2 DS 0BL1    Environment flags                                      
XPLGENV_TUNAC EQU X'80'  Tuning stat is active                                  
XPLGENV_TUNRQ EQU X'40'  TNSTAT task attatched                                  
XPLGENV_TUNCL EQU X'20'  Display TUNSTAT RECORD at Console                      
         ORG   XPLGENV_FLGS2+X'00000001'                                        
XPLGENV_DIRSZ DS 1CL0004 DIRSIZE start option value                             
XPLGENV_SMEAO2 DS 0BL2   Session Manager Exit active options part II            
XPLGENV_SMEB3 DS 0BL1    SME Bits 3                                             
XPLGENV_MNPS  EQU X'80'  MNPS Recovery calls will be processed                  
XPLGENV_HPRVR EQU X'40'  HPR VR Selection                                       
XPLGENV_HPROLU EQU X'20' HPR RTP OLU Pipe Authorization                         
XPLGENV_HPRANR EQU X'10' HPR RTP ANR Pipe Authorization                         
XPLGENV_HPRDLU EQU X'08' HPR RTP DLU Pipe Authorization                         
         ORG   XPLGENV_SMEAO2+X'00000002'                                       
XPLGENV_LCL_NETID DS 1CL0008 Local Net ID                                       
XPLGENV_LCL_CPNAME DS 1CL0008 Local CP Name                                     
XPLGENV_FLGS3 DS 0BL1    Environment flags 3                                    
XPLGENV_MNPSCAP EQU X'80' MNPS capability                                       
XPLGENV_HPRCP EQU X'60'  HPR Support/Capability                                 
         ORG   XPLGENV_FLGS3+X'00000001'                                        
XPLGENV_LEN EQU *-XPLGENV                                                       
         ORG   ,                                                                
*                                                                               
* ********************************************************************          
* *             Global Inline Exit Vector                            *          
* ********************************************************************          
*                                                                               
         ORG   XPLVEC_DAT                                                       
XPLGIEV  DS    0X                                                               
XPLGIEV_ENM DS 1CL0008   Exit Name                                              
XPLGIEV_EMNM DS 1CL0008  Exit Module Name                                       
XPLGIEV_EL DS  1CL0004   Exit Level                                             
XPLGIEV_ESTAT DS 1FL1    Exit status                                            
XPLGIEV_LEN EQU *-XPLGIEV                                                       
         ORG   ,                                                                
*                                                                               
* ********************************************************************          
* *             Global Storage Buffer Pool Vector                    *          
* ********************************************************************          
*                                                                               
         ORG   XPLVEC_DAT                                                       
XPLGSBV  DS    0X                                                               
XPLGSBV_BPID DS 1CL0004  Buffer pool ID(name)                                   
XPLGSBV_SIZE DS 1CL0002  Size of each Buffer in Pool                            
XPLGSBV_BASNM DS 1CL0004 Base Num Buffers defined at VTAM              *        
                         Initialization                                         
XPLGSBV_CURNM DS 1CL0004 Current num buffers defined                            
XPLGSBV_TOTAV DS 1CL0004 Total num buffer available                             
XPLGSBV_STATA DS 1CL0004 Num static buffer available                            
XPLGSBV_MXUSE DS 1CL0004 Maximum num buffers in use since last COLLECT *        
                         CNM RU                                                 
XPLGSBV_XSZBU DS 1CL0002 Expansion size (buffers), same as number      *        
                         buffers per extent                                     
XPLGSBV_XSZBY DS 1CL0004 Expansion size (bytes)                                 
XPLGSBV_XTHRE DS 1CL0002 Expansion Threshold                                    
XPLGSBV_XLIM DS 1CL0004  Expansion limit                                        
XPLGSBV_CTHRE DS 1CL0002 Contraction Threshold                                  
XPLGSBV_NMEXP DS 1CL0004 Number of Expansions                                   
XPLGSBV_SDTHR DS 1CL0004 Slow Down Threshold                                    
XPLGSBV_NUMQR DS 1CL0004 Num of queued requests (RPH)                           
XPLGSBV_NMBNQ DS 1CL0004 Num buffers needed to satisfy queued requests          
XPLGSBV_MXNQR DS 1CL0004 Maximum num of queued requests since last     *        
                         COLLECT CNM RU                                         
XPLGSBV_MXNAL DS 1CL0004 Maximum number of bytes allocated since last  *        
                         COLLECT CNM RU                                         
XPLGSBV_ATTFL DS 0BL2    Pool attribute flags                                   
XPLGSBV_ATTR1 DS 0BL1    Pool attribute flags                                   
XPLGSBV_FIXST EQU X'40'  1=Fixed - 0=Pageable storage                           
XPLGSBV_FTCH EQU X'20'   Pool resides in fetch protected storage                
XPLGSBV_BEL24 EQU X'08'  Storage allocated below 24 bit line                    
         ORG   XPLGSBV_ATTFL+X'00000001'                                        
XPLGSBV_ATTR2 DS 0BL1    Pool attribute flags                                   
XPLGSBV_USRFX EQU X'80'  User request fixed buffer                              
         ORG   XPLGSBV_ATTFL+X'00000002'                                        
XPLGSBV_SPNUM DS 1CL0002 Subpool Number                                         
XPLGSBV_BSENO DS 1CL0002 User specified BASENO                                  
XPLGSBV_XPANO DS 1CL0002 User specified xpand buff                              
XPLGSBV_NPXB DS 1CL0004  Number of Active Extents                               
XPLGSBV_NABIE DS 1CL0004 Number of available buffers in all extents             
XPLGSBV_LEN EQU *-XPLGSBV                                                       
         ORG   ,                                                                
*                                                                               
* ********************************************************************          
* *             Global Storage Private Storage Vector                *          
* ********************************************************************          
*                                                                               
         ORG   XPLVEC_DAT                                                       
XPLGSPV  DS    0X                                                               
XPLGSPV_CURR DS 1CL0004  Current private storage alloc                          
XPLGSPV_MAX DS 1CL0004   Max private storage allocated                          
XPLGSPV_LEN EQU *-XPLGSPV                                                       
         ORG   ,                                                                
*                                                                               
* ********************************************************************          
* *             Global Storage CSA Vector                            *          
* ********************************************************************          
*                                                                               
         ORG   XPLVEC_DAT                                                       
XPLGSCV  DS    0X                                                               
XPLGSCV_MXCSA DS 1CL0004 Maximum size CSA allowed                               
XPLGSCV_MXC24 DS 1CL0004 Max size CSA allowed below 16M line                    
XPLGSCV_CUCSA DS 1CL0004 Current CSA allocated for VTAM                         
XPLGSCV_TOTHW DS 1CL0004 Total CSA high-water mark since last COLLECT  *        
                         CNM RU                                                 
XPLGSCV_TOTHT DS 1CL0008 Timestamp for high-water mark for Total CSA   *        
                         allocated                                              
XPLGSCV_TOTLW DS 1CL0004 Total CSA low-water mark since last COLLECT   *        
                         CNM RU                                                 
XPLGSCV_TOTLT DS 1CL0008 Timestamp for low-water mark for Total CSA    *        
                         allocated                                              
XPLGSCV_MTOTC DS 1CL0004 Max Total CSA ever used                                
XPLGSCV_CUC24 DS 1CL0004 Current CSA allocated below 16M line                   
XPLGSCV_C24MX DS 1CL0004 Max CSA 24 ever used                                   
XPLGSCV_C24HW DS 1CL0004 CSA 24 high-water mark since last COLLECT CNM *        
                         RU                                                     
XPLGSCV_C24HT DS 1CL0008 Timestamp for high-water mark for TCSA 24     *        
                         allocated                                              
XPLGSCV_C24LW DS 1CL0004 CSA 24 low-water mark since last COLLECT CNM  *        
                         RU                                                     
XPLGSCV_C24LT DS 1CL0008 Timestamp for low-water mark for CSA 24       *        
                         allocated                                              
XPLGSCV_LEN EQU *-XPLGSCV                                                       
         ORG   ,                                                                
*                                                                               
* ********************************************************************          
* *             Global Storage GETBLK Vector                         *          
* ********************************************************************          
*                                                                               
         ORG   XPLVEC_DAT                                                       
XPLGSGV  DS    0X                                                               
XPLGSGV_NAME DS 1CL0008  Pool Name                                              
XPLGSGV_BLEN DS 1CL0004  Subpool buffer length                                  
XPLGSGV_BPPAG DS 1CL0002 Number buffers per page                                
XPLGSGV_PGSIZ DS 1CL0004 Page size                                              
XPLGSGV_ByteU DS 1CL0004 Number of bytes in use                                 
XPLGSGV_ByteUInMeg_Byte DS 0BL1 1st byte of XPLGSGV_ByteU, used        *        
                             to test ByteUInMeg indicator (bit 0) @A2A          
XPLGSGV_ByteUInMeg Equ X'80' When 0,  XPLGSGV_ByteU bits 1-31          *        
                                      contain byte count               *        
                             When 1,  XPLGSGV_ByteU bits 1-31          *        
                                      contain megabyte count      @A2A          
XPLGSGV_BUHW DS 1CL0004  Number of bytes in use high- water mark since *        
                         last COLLECT CNM RU processed                          
XPLGSGV_BUHWInMeg_Byte DS 0BL1 1st byte of XPLGSGV_BUHW, used          *        
                             to test BUHWInMeg indicator (bit 0)  @A2A          
XPLGSGV_BUHWInMeg Equ X'80'  When 0,  XPLGSGV_BUHW bits 1-31           *        
                                      contain byte count               *        
                             When 1,  XPLGSGV_BUHW bits 1-31           *        
                                      contain megabyte count      @A2A          
XPLGSGV_BUHT DS 1CL0008  Timestamp for number of bytes in use          *        
                         high-water mark since last COLLECT CNM RU              
XPLGSGV_ByteA DS 1CL0004 Number of bytes allocated                              
XPLGSGV_ByteAInMeg_Byte DS 0BL1 1st byte of XPLGSGV_ByteA, used        *        
                             to test ByteAInMeg indicator (bit 0) @A2A          
XPLGSGV_ByteAInMeg Equ X'80' When 0,  XPLGSGV_ByteA bits 1-31          *        
                                      contain byte count               *        
                             When 1,  XPLGSGV_ByteA bits 1-31          *        
                                      contain megabyte count      @A2A          
XPLGSGV_BAHW DS 1CL0004  Number of bytes allocated high- water mark    *        
                         since last COLLECT CNM RU processed                    
XPLGSGV_BAHWInMeg_Byte DS 0BL1 1st byte of XPLGSGV_BAHW, used          *        
                             to test BAHWInMeg indicator (bit 0)  @A2A          
XPLGSGV_BAHWInMeg Equ X'80'  When 0,  XPLGSGV_BAHW bits 1-31           *        
                                      contain byte count               *        
                             When 1,  XPLGSGV_BAHW bits 1-31           *        
                                      contain megabyte count      @A2A          
XPLGSGV_BAHT DS 1CL0008  Timestamp for number of bytes allocated       *        
                         high-water mark since last COLLECT CNM RU              
XPLGSGV_LEN EQU *-XPLGSGV                                                       
         ORG   ,                                                                
*                                                                               
* ********************************************************************          
* *             Global Session Vector                                *          
* ********************************************************************          
*                                                                               
         ORG   XPLVEC_DAT                                                       
XPLGSEV  DS    0X                                                               
XPLGSEV_STTAK DS 1CL0004 Number successful LU-LU session starts and    *        
                         takeovers                                              
XPLGSEV_STOP DS 1CL0004  Number LU-LU session stops                             
XPLGSEV_FAIL DS 1CL0004  Number LU-LU session set-up failures                   
XPLGSEV_ACTHW DS 1CL0004 Number of active LU-LU sessions high-water    *        
                         mark since last COLLECT CNM RU processed               
XPLGSEV_ACTHT DS 1CL0008 Timestamp for number of active LU-LU sessions *        
                         high-water mark since last COLLECT CNM RU              
XPLGSEV_ACTLW DS 1CL0004 Number of active LU-LU sessions low-water     *        
                         mark since last COLLECT CNM RU processed               
XPLGSEV_ACTLT DS 1CL0008 Timestamp for number of active LU-LU sessions *        
                         low-water mark since last COLLECT CNM RU               
XPLGSEV_QINIT DS 1CL0004 Number of LU-LU sessions in Queued Initiate   *        
                         status                                                 
XPLGSEV_PENDR DS 1CL0004 Number of LU-LU sessions in Pending           *        
                         Reallocation status                                    
XPLGSEV_PENDA DS 1CL0004 Number of LU-LU sessions in Pending Active    *        
                         status                                                 
XPLGSEV_ACT DS 1CL0004   Number active LU-LU sessions                           
XPLGSEV_PENDT DS 1CL0004 Number of LU-LU sessions in Pending           *        
                         Termination status                                     
XPLGSEV_DAPLU DS 1CL0004 Number defined APPL LUs                                
XPLGSEV_DDELU DS 1CL0004 Number defined non-appl dependent LUs                  
XPLGSEV_DCDRS DS 1CL0004 Number defined CDRSCs                                  
XPLGSEV_DPU DS 1CL0004   Number defined PUs                                     
XPLGSEV_AAPLU DS 1CL0004 Number active APPLU LUs                                
XPLGSEV_ADELU DS 1CL0004 Number active non-appl dependent LUs                   
XPLGSEV_ACDRS DS 1CL0004 Number active CDRSCs                                   
XPLGSEV_APU DS 1CL0004   Number active PUs                                      
XPLGSEV_RCPF DS 1CL0004  Number retriable CP-CP session failures                
XPLGSEV_NRCPF DS 1CL0004 Number non-retriable CP-CP session failures            
XPLGSEV_SCPIN DS 1CL0004 Number successful CP-CP session initiations            
XPLGSEV_DLREN DS 1CL0004 Number of DLR end nodes                                
XPLGSEV_DLRNN DS 1CL0004 Number of DLR network nodes                            
XPLGSEV_DLRPU DS 1CL0004 Number of DLR served PUs                               
XPLGSEV_DLRLU DS 1CL0004 Number of DLR served LUs                               
XPLGSEV_AILUS DS 1CL0004 Number active ILUs                                     
XPLGSEV_SRVEN DS 1CL0004 Number of ENs served by this NN (i.e. CP-CP   *        
                         session active) INVALID when we are EN                 
XPLGSEV_CPSNN DS 1CL0004 Number NN with which this NN has CP-CP        *        
                         sessions, INVALID when we are EN                       
XPLGSEV_LEN EQU *-XPLGSEV                                                       
         ORG   ,                                                                
*                                                                               
* ********************************************************************          
* *             Global APPN Directory Services Vector                *          
* ********************************************************************          
*                                                                               
         ORG   XPLVEC_DAT                                                       
XPLGADV  DS    0X                                                               
XPLGADV_NRFLD DS 1CL0004 Number resources found in local database               
XPLGADV_NRFDS DS 1CL0004 Number resources found from Directory Server           
XPLGADV_NRFDB DS 1CL0004 Number resources found via domain broadcast            
XPLGADV_NRFNB DS 1CL0004 Number resources found via network broadcast           
XPLGADV_FSRCH DS 1CL0004 Number of failed searches (receive negative   *        
                         reply)                                                 
XPLGADV_NBNCE DS 1CL0004 Number of times network broadcast not         *        
                         performed due to negative cache entry                  
XPLGADV_ESRRF DS 1CL0004 Number of external search requests - resource *        
                         found                                                  
XPLGADV_ESRNF DS 1CL0004 Number of external search requests - resource *        
                         ^ found                                                
XPLGADV_DSNRR DS 1CL0004 Number referrals received                              
XPLGADV_DSPRR DS 1CL0004 Number positive replies received from an      *        
                         Alternate Directory Server                             
XPLGADV_DSNNR DS 1CL0004 Number negative replies received from an      *        
                         Alternate Directory Server                             
XPLGADV_RRCGC DS 1CL0004 Number of resources removed from cache due to *        
                         garbage collection                                     
XPLGADV_ADJDS DS 1CL0004 Number of adjacent nodes in a different       *        
                         subnet                                                 
XPLGADV_ROBCH DS 1CL0004 Number of times a CHACHE entry is discarded   *        
                         due to DIRSIZE max being reached                       
XPLGADV_REGRS DS 1CL0004 Number of registered resources at a Cesntral  *        
                         Directory Server or at an NN                           
XPLGADV_CACHE DS 1CL0004 Number of entries in the CACHE                         
XPLGADV_LEN EQU *-XPLGADV                                                       
         ORG   ,                                                                
*                                                                               
* ********************************************************************          
* *         Global APPN Directory Services Border Node Vector                   
* ********************************************************************          
*                                                                               
         ORG   XPLVEC_DAT                                                       
XPLGBNV  DS    0X                                                               
XPLGBNV_CPNME DS 0CL0016 Network qualified CPNAME                               
XPLGBNV_NETID DS 1CL0008 Adjacent Node Network ID                               
XPLGBNV_NAME DS 1CL0008  Adjacent Node Name                                     
XPLGBNV_SSRCH DS 1CL0004 Number of subnet searches sent to adjacent    *        
                         Node                                                   
XPLGBNV_RSRCH DS 1CL0004 Number of subnet searches received from ADJ   *        
                         node                                                   
XPLGBNV_LEN EQU *-XPLGBNV                                                       
         ORG   ,                                                                
*                                                                               
* ********************************************************************          
* *             Global APPN Topology Data Vector                     *          
* ********************************************************************          
*                                                                               
         ORG   XPLVEC_DAT                                                       
XPLGATV  DS    0X                                                               
XPLGATV_NRTET DS 1CL0004 Number of routes - using existing tree                 
XPLGATV_NRTMT DS 1CL0004 Number of routes - using modified tree                 
XPLGATV_NRTNT DS 1CL0004 Number of routes - using new tree                      
XPLGATV_TDUON DS 1CL0004 Number of TDUs originated by this node                 
XPLGATV_TDUPN DS 1CL0004 Number of TDUs propagated by this node                 
XPLGATV_TDUDU DS 1CL0004 Number of TDUs received by this node          *        
                         resulting in topology database update                  
XPLGATV_TDUDN DS 1CL0004 Number of TDUs received by this node and      *        
                         discarded for normal reasons                           
XPLGATV_TDUDR DS 1CL0004 Number of TDUs received by this node and      *        
                         discarded because is a RSN ^ OK (rebroadcast)          
XPLGATV_TDUDI DS 1CL0004 Number of TDUs received by this node and      *        
                         discarded because of data inconsistency       *        
                         (rebroadcast)                                          
XPLGATV_NNTD DS 1CL0004  Number of network nodes in topology database           
XPLGATV_ENTD DS 1CL0004  Number of end nodes in topology database               
XPLGATV_TGTD DS 1CL0004  Number of TGs in topology database                     
XPLGATV_TGFL DS 1CL0004  Number of TG failures                                  
XPLGATV_DPUAL DS 1CL0004 Num of dynamic PU allocations                          
XPLGATV_DTCF DS 1CL0004  Number of trees discarded due to Cache being  *        
                         full                                                   
XPLGATV_NMTRE DS 1CL0004 Number of trees                                        
XPLGATV_VNTD DS 1CL0004  Number of Virtual nodes in the topology       *        
                         database                                               
XPLGATV_CDSTD DS 1CL0004 Number Central Directory Servers in topology  *        
                         database                                               
XPLGATV_ICNCN DS 1CL0004 Number of IC Nodes in the topology database            
XPLGATV_ENCON DS 1CL0004 Number of ENs connected to this node                   
XPLGATV_NNCON DS 1CL0004 Number of NNs connected to this node                   
XPLGATV_VNCON DS 1CL0004 Number of VNs connected to this node                   
XPLGATV_LEN EQU *-XPLGATV                                                       
         ORG   ,                                                                
*                                                                               
* ********************************************************************          
* *             Global CSM Buffer Pool Vector                        *          
* ********************************************************************          
*                                                                               
         ORG   XPLVEC_DAT                                                       
XPLGCBV  DS    0X                                                               
XPLGCBV_SIZE DS 1CL0004  Buffer size                                            
XPLGCBV_SRCE DS 0BL1     Buffer source                                          
XPLGCBV_ECSA EQU X'80'   Buffer source is ECSA                                  
XPLGCBV_DS   EQU X'40'   Buffer source is Data Space (DS)                       
         ORG   XPLGCBV_SRCE+X'00000004'                          @91C           
XPLGCBV_INUSE DS 1CL0004 Number of buffers in pool that are in use              
XPLGCBV_FREE DS 1CL0004  Number of available buffers in pool                    
XPLGCBV_LEN EQU *-XPLGCBV                                                       
         ORG   ,                                                                
*                                                                               
* ********************************************************************          
* *             Global CSM Storage Usage Vector                      *          
* ********************************************************************          
*                                                                               
         ORG   XPLVEC_DAT                                                       
XPLGCSV   DS 0X           Global CSM Storage Usage Vector                       
XPLGCSV_MaxFInMeg_Byte DS 0BL1 1st byte of XPLGCSV_MAXFIXED, used               
*                            to test MaxFInMeg indicator (bit 0)  @L6A          
XPLGCSV_MaxFInMeg EQU X'80'   When 0,  XPLGCSV_MAXFIXED bits 1-31               
*                                     contain byte count                        
*                            When 1,  XPLGCSV_MAXFIXED bits 1-31                
*                                     contain megabyte count      @L6A          
XPLGCSV_MAXFIXED DS 1CL0004  Installation maximum fixed storage                 
XPLGCSV_CurFInMeg_Byte DS 0BL1 1st byte of XPLGCSV_CURFIXED, used               
*                            to test CurFInMeg indicator (bit 0)  @L6A          
XPLGCSV_CurFInMeg EQU X'80'   When 0,  XPLGCSV_CURFIXED bits 1-31               
*                                     contain byte count                        
*                            When 1,  XPLGCSV_CURFIXED bits 1-31                
*                                     contain megabyte count      @L6A          
XPLGCSV_CURFIXED DS 1CL0004  Current fixed storage usage                        
XPLGCSV_MAXECSA DS 1CL0004  Installation maximum ECSA storage                   
XPLGCSV_CURECSA DS 1CL0004  Current ECSA storage usage                          
XPLGCSV_LEN EQU *-XPLGCSV                                                       
         ORG   ,                                                                
*                                                                               
* ********************************************************************          
* ********************************************************************          
* **********        VIRTUAL ROUTE DATA VECTORS              **********          
* ********************************************************************          
* ********************************************************************          
* ********************************************************************          
* *                 Basic Route Data Vector                          *          
* ********************************************************************          
*                                                                               
         ORG   XPLVEC_DAT                                                       
XPLVBRV  DS    0X                                                               
XPLVBRV_DSTSA DS 1CL0004 Destination Subarea                                    
XPLVBRV_TPRIO DS 1FL1    Transmission Priority                                  
XPLVBRV_VRNUM DS 1FL1    Virtual Route number                                   
XPLVBRV_ADJSA DS 1CL0004 Adjacent Subarea                                       
XPLVBRV_ERTNM DS 0BL1    Explicit Route number                                  
XPLVBRV_IERNM EQU X'F0'  Initial Explicit Route number                          
XPLVBRV_AERNM EQU X'0F'  Actual Explicit Route number                           
         ORG   XPLVBRV_ERTNM+X'00000001'                                        
XPLVBRV_RERNM DS 1FL1    Reverse Explicit Route number                          
XPLVBRV_SESVR DS 1CL0002 Number of sessions on VR                               
XPLVBRV_MINWS DS 1FL1    Current minimum window size                            
XPLVBRV_MAXWS DS 1FL1    Current maximum window size                            
XPLVBRV_DEFWS DS 1FL1    Default window size                                    
XPLVBRV_DFMWS DS 1FL1    Default maximum window size                            
XPLVBRV_WSRES DS 1CL0004 Number of time window size reset to the       *        
                         minimum                                                
XPLVBRV_PIUWS DS 1CL0004 Number of PIUs on the VR waiting to be sent            
XPLVBRV_VRST DS 1FL1     Virtual Route state                                    
XPLVBRV_FCDATA DS 0CL0073 Flow Control state data                               
XPLVBRV_FCST DS 0BL1     Flow Control state                                     
XPLVBRV_ROUTE EQU X'03'  Route status - 00 = blocked 01 = held 10 =    *        
                         open                                                   
         ORG   XPLVBRV_FCST+X'00000001'                                         
XPLVBRV_NTHLD DS 1CL0004 Num times route in held state                          
XPLVBRV_THLDC DS 1CL0008 Time VR has been in held state if currently   *        
                         held                                                   
XPLVBRV_THLDT DS 1CL0008 Time VR has been in held state (Total not     *        
                         including current held time)                           
XPLVBRV_THLDM DS 1CL0008 Time VR has been in held state (Maximum time  *        
                         held for any given instance)                           
XPLVBRV_TMHLD DS 1CL0008 Timestamp for Time VR has been in held state  *        
                         (Maximum time held for any given instance)             
XPLVBRV_NTBLK DS 1CL0004 Number of times VR blocked                             
XPLVBRV_TBLKC DS 1CL0008 Time VR has been in blocked state if          *        
                         currently blocked                                      
XPLVBRV_TBLKT DS 1CL0008 Time VR has been in blocked state (Total not  *        
                         including current blocked time)                        
XPLVBRV_TBLKM DS 1CL0008 Time VR has been in blocked state (Maximum    *        
                         time blocked for any given instance)                   
XPLVBRV_TMBLK DS 1CL0008 Timestamp for Time VR has been in blocked     *        
                         state (Maximum time blocked held for any      *        
                         given instance                                         
XPLVBRV_LUSCT DS 1CL0002 Total number of LU-LU sessions on the VR               
XPLVBRV_CPRSC DS 1CL0002 Current pacing request send count                      
XPLVBRV_CPWSZ DS 1CL0001 Current pacing window size                             
XPLVBRV_OPIUC DS 1CL0004 Outbound PIU count over VR                             
XPLVBRV_IPIUC DS 1CL0004 Inbound PIU count over VR                              
XPLVBRV_LEN EQU *-XPLVBRV                                                       
         ORG   ,                                                                
*                                                                               
* ********************************************************************          
* ********************************************************************          
* **********        Rapid Transport Protocol Vectors        **********          
* ********************************************************************          
* ********************************************************************          
* ********************************************************************          
* *                   Basic RTP Data Vector                          *          
* ********************************************************************          
*                                                                               
         ORG   XPLVEC_DAT                                                       
XPLRTPV  DS    0X                                                               
XPLRTPV_FLAGS DS 0BL2    RTP Flag Bytes                                         
XPLRTPV_PATHSWITCH EQU X'80' Path Switch occured                                
XPLRTPV_CLOSEOUT EQU X'40' RTP deleted OR Name changed and not         *        
                         monitored                                              
XPLRTPV_PSW_NAME EQU X'20' Path Switch occured with name change                 
         ORG   XPLRTPV_FLAGS+X'00000002'                                        
XPLRTPV_LCL_NCE DS 0BL8 Local NCE                                               
         ORG   XPLRTPV_LCL_NCE+X'00000008'                                      
XPLRTPV_LCL_TCID DS 0BL8 Local TCID                                             
         ORG   XPLRTPV_LCL_TCID+X'00000008'                                     
XPLRTPV_RTP_PU DS 1CL0008 RTP PU Name                                           
XPLRTPV_RMT_NETID DS 1CL0008 Remote Net ID                                      
XPLRTPV_RMT_CPNAME DS 1CL0008 Remote CP Name                                    
XPLRTPV_RMT_PSW_NETID DS 1CL0008 Remote Net ID after Path Switch                
XPLRTPV_RMT_PSW_CPNAME DS 1CL0008 Remote CP Name after Path Switch              
XPLRTPV_RMT_NCE DS 0BL8 Remote NCE                                              
         ORG   XPLRTPV_RMT_NCE+X'00000008'                                      
XPLRTPV_RMT_TCID DS 0BL8 Remote TCID                                            
         ORG   XPLRTPV_RMT_TCID+X'00000008'                                     
XPLRTPV_RTP_STATE DS 1FL1 RTP State                                             
XPLRTPV_PSW_TIMER DS 1FL4 Path Switch Timer                                     
XPLRTPV_RTRP_DLAY DS 1FL4 Round Trip Delay                                      
XPLRTPV_STATS_1 DS 0CL0054 Data segment                                         
XPLRTPV_BYTES_SNT DS 1FL4 Number bytes sent over RTP                            
XPLRTPV_BYTES_RCVV DS 1FL4 Number bytes received over RTP                       
XPLRTPV_PIUS_FRST DS 1FL4 Number 1st in segment PIUs sent over RTP              
XPLRTPV_PIUS_MIDL DS 1FL4 Number middle in segmnt PIUs sent over RTP            
XPLRTPV_PIUS_LAST DS 1FL4 Number last in segmnt PIUs sent over RTP              
XPLRTPV_PIUS_WHOL DS 1FL4 Number unsegmented PIUs sent over RTP                 
XPLRTPV_PIUR_FRST DS 1FL4 Num 1st in segment PIUs received over RTP             
XPLRTPV_PIUR_MIDL DS 1FL4 Num middle in segmnt PIUs received over RTP           
XPLRTPV_PIUR_LAST DS 1FL4 Num last in segmnt PIUs received over RTP             
XPLRTPV_PIUR_WHOL DS 1FL4 Number unsegmented PIUs received over RTP             
XPLRTPV_SNDR_CHNG DS 1FL4 Number times allowed send rate changed                
XPLRTPV_EPINI_PSW DS 1FL2 Total Path Switch Attempts initiated by RTP  *        
                         endpoint                                               
XPLRTPV_VTAMI_PSW DS 1FL2 Total Path Switch Attempts initiated by      *        
                         this VTAM                                              
XPLRTPV_OPCMD_PSW DS 1FL2 Path Switch Attempts due to Operator or VTAM *        
                         Command                                                
XPLRTPV_UNSUC_PSV DS 1FL2 Total unsuccessful Path Switch attempts      *        
                         initiated by this VTAM                                 
XPLRTPV_UNSUC_PSO DS 1FL2 Unsuccessful Path Switch due to Operator     *        
                         Command                                                
XPLRTPV_LULU_SESS_COUNT DS 1FL4 Count of active LU-LU sessions using   *        
                         this RTP                                               
XPLRTPV_TOT_BKPTM DS 1FL4 Time in milliseconds back pressure has been  *        
                         been applied                                           
XPLRTPV_TOT_BACKP DS 1FL2 Total number of times back pressure has been *        
                         applied                                                
XPLRTPV_PSW_BACKP DS 1FL2 Number of times back pressure applied due to *        
                         path switch                                            
XPLRTPV_QDP_BACKP DS 1FL2 Number of times back pressure applied due to *        
                         queue depth exceeded                                   
XPLRTPV_RESNT_NLP DS 1FL4 Number retransmitted NLPs                             
XPLRTPV_UNAK_BUFS DS 1FL4 Current number of unacknowledge buffers               
XPLRTPV_LEN EQU *-XPLRTPV                                                       
         ORG   ,                                                                
*                                                                               
* ********************************************************************          
* *                          RTP RSCV Vector                         *          
* ********************************************************************          
*                                                                               
         ORG   XPLVEC_DAT                                                       
XPLRSCV  DS    0X                                                               
XPLRSCV_DATA DS  0C      Actual Data for CV2B                                   
XPLRSCV_LEN EQU *-XPLRSCV                                                       
         ORG   ,                                                                
*                                                                               
* ********************************************************************          
* *                       RTP COS/TPF Vector                         *          
* ********************************************************************          
*                                                                               
         ORG   XPLVEC_DAT                                                       
XPLCOSV  DS    0X                                                               
XPLCOSV_DATA DS  0C      Actual Data for CV2C                                   
XPLCOSV_LEN EQU *-XPLCOSV                                                       
         ORG   ,                                                                
*                                                                               
* ********************************************************************          
* ********************************************************************          
* **********          Application Data Vectors              **********          
* ********************************************************************          
* ********************************************************************          
* ********************************************************************          
* *                MNPS Application Recovery Data                    *          
* ********************************************************************          
*                                                                               
         ORG   XPLVEC_DAT                                                       
XPLMRCV  DS    0X                                                               
XPLMRCV_NAME   DS 1CL0008 Application Name                                      
XPLMRCV_SESSOK DS 1CL0004 Number of sessions successfully recovered             
XPLMRCV_SESSAT DS 1CL0004 Number of session recoveries attempted                
XPLMRCV_PIPEOK DS 1CL0004 Number of HPR pipes successfully recovered            
XPLMRCV_PIPEAT DS 1CL0004 Number of HPR pipe recoveries attempted               
XPLMRCV_RECTIM DS 1CL0008 Total recovery time                                   
XPLMRCV_LEN EQU *-XPLMRCV                                                       
         ORG   ,                                                                
*                                                                               
* ********************************************************************          
* *                   MNPS Application Data                          *          
* ********************************************************************          
*                                                                               
         ORG   XPLVEC_DAT                                                       
XPLMDTV  DS    0X                                                               
XPLMDTV_NAME   DS 1CL0008 Application Name                                      
XPLMDTV_STRUCT DS 1CL0016 CFS structure name containing appl data               
XPLMDTV_NRWRIT DS 1CL0004 Number of CFS Writes for this application             
XPLMDTV_NRBYTE DS 1CL0004 Number of Bytes written to CFS                        
XPLMDTV_LEN EQU *-XPLMDTV                                                       
         ORG   ,                                                                
*                                                                               
* ********************************************************************          
* ********************************************************************          
* **********     Coupling Facility Data Vectors             **********          
* ********************************************************************          
* ********************************************************************          
* ********************************************************************          
* *                    MNPS Structure Vector                         *          
* ********************************************************************          
*                                                                               
*                                                                               
         ORG   XPLVEC_DAT                                                       
XPLCFMV  DS    0X                                                               
XPLCFMV_NAME   DS 1CL0016 Structure Name                                        
XPLCFMV_SIZE   DS 1CL0004 Size, in 1K blocks, of the structure                  
XPLCFMV_PERCNT DS 1CL0001 Percentage of 1K blocks in use                        
XPLCFMV_LEN EQU *-XPLCFMV                                                       
         ORG   ,                                                                
*                                                                               
* ********************************************************************          
* *             Constants for Reason For Transmission                *          
* ********************************************************************          
*                                                                               
XPLTRAN_COLRQ EQU X'00'  Monitor requested COLLECT                              
XPLTRAN_UNSOL EQU X'01'  Unsolicited notification                               
XPLTRAN_SMFID EQU X'02'  SMF Interval Data                                      
XPLTRAN_SMFER EQU X'03'  SMF Related Errors                                     
*                                                                               
* ********************************************************************          
* *             Constants for GLOBAL Data Vectors                    *          
* ********************************************************************          
*                                                                               
XPLMAJ_GLOBAL EQU X'0001' Global Data                                           
*                                                                               
* ********************************************************************          
* *             Constants for Virtual Route Data                     *          
* ********************************************************************          
*                                                                               
XPLMAJ_VR EQU  X'0002'   Virtual Route Data                                     
*                                                                               
* ********************************************************************          
* *             Constants for RTP Data                               *          
* ********************************************************************          
XPLMAJ_RTP EQU X'0003'   RTP Data                                               
*                                                                               
*                                                                               
* ********************************************************************          
* *             Constants for Application Data                       *          
* ********************************************************************          
XPLMAJ_APP EQU X'0004'   Application Data                                       
*                                                                               
*                                                                               
* ********************************************************************          
* *             Constants for Coupling Facility Data                 *          
* ********************************************************************          
XPLMAJ_CFS EQU X'0005'   Coupling Facility Data                                 
*                                                                               
.L0005   ANOP                                                                   
.P_EXIT  ANOP                                                                   
         MEND                                                                   
**/                                                                             
*/* Start of PL/X Source                                             */         
*@SPACE;                                                                        
*/********************************************************************/         
*/*                                                                  */         
*/* MACRO-NAME: ISTXPL                                               */         
*/*                                                                  */         
*/* MACRO-ACRONYM: XPL                                               */         
*/*                                                                  */         
*/* MACRO-DESCRIPTIVE-NAME: EXIT PARAMETER LIST                      */         
*/*                                                                  */         
*/*  COPYRIGHT: LICENSED MATERIALS - PROPERTY OF IBM                 */         
*/*                                                                  */         
*/*             THIS PRODUCT CONTAINS "RESTRICTED MATERIALS OF IBM"  */         
*/*                                                                  */         
*/*             5650-ZOS COPYRIGHT IBM CORP. 1994, 2015              */         
*/*             ALL RIGHTS RESERVED.                                 */         
*/*                                                                  */         
*/*             U.S. GOVERNMENT USERS RESTRICTED RIGHTS -            */         
*/*             USE, DUPLICATION OR DISCLOSURE RESTRICTED BY         */         
*/*             GSA ADP SCHEDULE CONTRACT WITH IBM CORP.             */         
*/*                                                                  */         
*/*             SEE COPYRIGHT INSTRUCTIONS.                          */         
*/*                                                                  */         
*/*  MACRO-FUNCTION:                                                 */         
*/*                                                                  */         
*/*       ISTXPL is a Management Services Control Block containing   */         
*/*       the information passed back to the Performance Monitor via */         
*/*       the VTAM Inline Exit Facility.                             */         
*/*                                                                  */         
*/*                                                                  */         
*/*  MACRO-BOUNDARY: DWORD                                           */         
*/*                                                                  */         
*/*  MACRO-CREATED-BY: THE USER                                      */         
*/*                                                                  */         
*/*  MACRO-LOCATION: NA                                              */         
*/*                                                                  */         
*/*  MACRO-DEPENDENCIES: AS FOLLOW                                   */         
*/*                                                                  */         
*/*       CHANGES to the XPL MUST follow the conventions set by the  */         
*/*       original desing of PMI.  They are as follows:              */         
*/*            1)  Reserved fields SHOULD NOT become defined from    */         
*/*                one release of VTAM to the next.  Within a release*/         
*/*                development cycle, flag bits and other fields not */         
*/*                allocated may be used or redefined, otherwise     */         
*/*                THEY SHOULD BE LEFT ALONE]                        */         
*/*            2)  A new fields may be appended to the vector from   */         
*/*                relase to release                             @D3A*/         
*/*                                                                  */         
*/*    REQUIRED-INNER-MAPS:  NONE                                    */         
*/*                                                                  */         
*/*    REQUIRED-BY: NONE                                             */         
*/*                                                                  */         
*/* MACRO-NOTES:                                                     */         
*/*                                                                  */         
*/*                                                                  */         
*/* MACRO_LAST-CHANGED:                                              */         
*/*                                                                  */         
*/* $MAC(ISTXPL),COMP(MGMTSVC),PROD(VTAM): Monitor Exit Parm List    */         
*/*                                                                  */         
*/* FLAG REASON   RELEASE DATE   ORIGIN  FLAG DESCRIPTORS            */         
*/* ---- -------- ------- ------ ------  --------------------------- */         
*/* $L0= FO@@@MST PERFMON 920511 043006: Performance Monitor         */         
*/*                                      Interface                   */         
*/* $L1= FO@DR001 PERFMON 930325 595229: BN and DLS enhancements     */         
*/* $L2= KP@@@MST PMIII   930524 595229: Multiple Monitors           */         
*/* $L3= KP@DR003 PMIII   930914 595229: SMF Enhancements            */         
*/* $L4= KP@DR009 PMIII   940228 043006: Support Level Recognition   */         
*/* $Y1= P112751  PERFMON 940325 043006: VR counts in error          */         
*/* $L5= KP@DR008 PMIII   940520 043006: Equate data field lengths   */         
*/*                                      with their source           */         
*/* $Y2= P118118  PMIII   950315 043006: Adjust XPLGSBV_XPANO length */         
*/* $D1= ID@@@MST FPAPI   950324 658994: Fast Path API for APPC      */         
*/* $D2= IP@@@MST MNPS    950714 421970: MNPS                        */         
*/* $D3= IY@@@MST HPRNW   950614 595229: HPR Network Management - PMI*/         
*/* $D4= IY@DR004 HPRNW   960424 792173: Add RTP PU name to PMI      */         
*/* $S1= P123204  MNPS    960708 421970: Strengthen boundary value   */         
*/* $S2= P123209  MNPS    960724 658994: Add vector GETSTOR data     */         
*/* $S3= P123839  MNPS    960828 226653: Remove GETSTOR vector       */         
*/*                                                                  */         
*/* Flag Reason   Release  Date   Origin    Description              */         
*/*----- -------- -------- ------ --------  ------------------------ */         
*/* $A1= OW33528  CSV2R8   990212 WAMORAN : SME HPR Pipe             */         
*/*                                         authorization            */         
*/* $  = OW39301  CSV3R10  990528 WAMORAN : Update OW33528 change    */         
*/*                                         activity to prevent      */         
*/*                                         compiler messages        */         
*/* $L6= D130557  CSV1R2   001010 Zebrow  : Missed hit for 64 bit    */         
*/*                                         real support             */         
*/* $A2= OA49911  HVT6220  151105 EZebrow : 3270 Vulnerability       */         
*/*                                         (sysroute of OA48802)    */         
*/*                                                                  */         
*/********************************************************************/         
*/********************************************************************/         
*/*             Parameter List Header                                */         
*/********************************************************************/         
*                                                                               
*DCL                                                                            
*  1 ISTXPL   BASED,                /* Monitor Exit Parameter List   */         
*    2 XPLHEAD,                     /* Control Block Header          */         
*      3 XPLHEAD_LEN   FIXED(16) BDY(BYTE), /* Entire XPL length in             
*                                      bytes - includes this field,             
*                                      header, and vectors           */         
*      3 XPLHEAD_HLEN  FIXED(16) BDY(BYTE), /* XPL header length in             
*                                      bytes                     @L4A*/         
*      3 XPLHEAD_TRANS FIXED(8),    /* Reason for transmission   @L3C*/         
*      3 XPLHEAD_CORR  CHAR(2),     /* Correlator, PRID from CNMRU,             
*                                      Zero if Unsolicited           */         
*      3 XPLHEAD_MONACBN CHAR(8),   /* Requesting monitor ACB name,             
*                                      Blanks if unsolcted  @L2A @L3C*/         
*      3 XPLHEAD_FLAGS BIT(8),      /* Flag byte                 @L3A*/         
*        4 XPLHEAD_GEN   BIT(6),    /* General Use               @L3A*/         
*          5 *             BIT(5),  /* Reserved                  @L3A*/         
*          5 XPLHEAD_SMFIM BIT(1),  /* SMF Interval Missed       @L3A*/         
*        4 XPLHEAD_SEG   BIT(2),    /* Segmenting indicator      @L3A*/         
*          5 XPLHEAD_FIRST BIT(1),  /* First Segment indicator   @L3A*/         
*          5 XPLHEAD_LAST  BIT(1),  /* Last Segment indicator    @L3A*/         
*      3 XPLHEAD_TIME  CHAR(8),     /* SMF interval time stamp, ZERO            
*                                      if SMFID is off           @L3A*/         
*    2 XPLHEAD_END     CHAR(0);     /* Begin First Vector            */         
*                                                                               
*/********************************************************************/         
*/*                    Vector Format                                 */         
*/********************************************************************/         
*                                                                               
*DCL                                                                            
*  1 XPLVEC  BASED BDY(WORD),       /* Vector Format             @S1C*/         
*    2 XPLVEC_COM    CHAR(8),       /* Common Vector Format          */         
*      3 XPLVEC_LEN    FIXED(16) BDY(BYTE), /* Length of vector                 
*                                      including this length field   */         
*      3 XPLVEC_CAT    CHAR(6),     /* Data Type/Category            */         
*        4 XPLVEC_MAJ    CHAR(2),   /* Major Category: Global, VR,...*/         
*        4 XPLVEC_SUB    CHAR(2),   /* Data Subcategory              */         
*        4 XPLVEC_REC    CHAR(2),   /* Record Type Subcategory       */         
*    2 XPLVEC_DAT    CHAR(*);       /* Vector data                   */         
*                                                                               
*                                                                               
*/********************************************************************/         
*/********************************************************************/         
*/**********            GLOBAL DATA VECTORS                 **********/         
*/********************************************************************/         
*/********************************************************************/         
*                                                                               
*/********************************************************************/         
*/*             Global Environment Vector                            */         
*/********************************************************************/         
*                                                                               
*DCL                                                                            
*  1 XPLGENV   DEFINED(XPLVEC_DAT), /* Global Environment Vector     */         
*    2 XPLGENV_TASK  CHAR(4),       /* VTAM Task Id                  */         
*      3 XPLGENV_ASCB  CHAR(4),     /* ASCB Address (MVS/ESA)        */         
*        4 XPLGENV_ID    CHAR(4),   /* Machine/Task ID (VM/ESA)      */         
*          5 XPLGENV_PCB   CHAR(4), /* PCB Address (VSE/ESA)         */         
*    2 XPLGENV_SLN   CHAR(8),       /* VTAM Start List Name          */         
*    2 XPLGENV_CFN   CHAR(8),       /* VTAM Configuration File Name  */         
*    2 XPLGENV_CRFN  CHAR(8),       /* VTAM Configuration Restart               
*                                        File Name                   */         
*    2 XPLGENV_DLR   CHAR(4),       /* Current number D/L/R requests */         
*    2 XPLGENV_MDLR  CHAR(4),       /* Max number D/L/R requests since          
*                                        last COLLECT CNM RU         */         
*    2 XPLGENV_MDLRE CHAR(4),       /* Max number D/L/R requests ever           
*                                        used                        */         
*    2 XPLGENV_SMEAO BIT(16),       /* Session Manager Exit active              
*                                        options                     */         
*      3 XPLGENV_SMEB1 BIT(8),      /* SME Bits 1                    */         
*        4 XPLGENV_IAUTH BIT(1),    /* Initial Authorized will be               
*                                        processed                   */         
*        4 XPLGENV_SAUTH BIT(1),    /* Secondary Authorized will be             
*                                        processed                   */         
*        4 XPLGENV_IFAF  BIT(1),    /* Init and Final Accounting                
*                                        Functions will be processed */         
*        4 XPLGENV_GWPS  BIT(1),    /* Gateway Path selection will be           
*                                        processed                   */         
*        4 XPLGENV_EF    BIT(1),    /* End Function will be                     
*                                        processed                   */         
*        4 XPLGENV_STA   BIT(1),    /* Session takeover accounting              
*                                        will be processed           */         
*        4 XPLGENV_SSCPS BIT(1),    /* SSCP Selection Function will be          
*                                        processed                   */         
*        4 XPLGENV_ASSCP BIT(1),    /* Adjacent SSCP Selection for              
*                                        DSRLST will be processed    */         
*      3 XPLGENV_SMEB2 BIT(8),      /* SME Bits 2                    */         
*        4 XPLGENV_ELUST BIT(1),    /* Exit Functions allowed for LU            
*                                        session takeover            */         
*        4 XPLGENV_IAAIO BIT(1),    /* Init Authorization allowed for           
*                                        Init Other CD               */         
*        4 XPLGENV_ALIAS BIT(1),    /* Alias selection will be                  
*                                        processed                   */         
*        4 XPLGENV_ALS   BIT(1),    /* ALS selection will be                    
*                                        processed                   */         
*        4 XPLGENV_DSSIB BIT(1),    /* ALS Selection processed for              
*                                        DSSIB requests              */         
*        4 XPLGENV_CDRSC BIT(1),    /* ALS Selection processed for              
*                                        CDRSC requests              */         
*        4 XPLGENV_SMEMR BIT(1),    /* SME supports MODIFY REPLACE   */         
*        4 XPLGENV_VR    BIT(1),    /* VR selection will be processed*/         
*    2 XPLGENV_GEFGS BIT(8),        /* Global Environment Flags      */         
*      3 XPLGENV_SSCPG BIT(1),      /* SSCP Gateway capability       */         
*      3 XPLGENV_ANN   BIT(1),      /* APPN Network Node capability  */         
*      3 XPLGENV_AEN   BIT(1),      /* APPN End Node capability      */         
*      3 XPLGENV_ADS   BIT(1),      /* APPN DS Capability            */         
*      3 XPLGENV_AIN   BIT(1),      /* APPN Interchange Node                    
*                                        capability                  */         
*      3 XPLGENV_AMDH  BIT(1),      /* APPN Migration data Host                 
*                                        capability                  */         
*      3 XPLGENV_BNC   BIT(1),      /* Border Node capability    @L1A*/         
*      3 *             BIT(1),      /* Reserved                  @L1C*/         
*    2 XPLGENV_DSMEAO CHAR(2),      /* Directory Services Manager Exit          
*                                        active options          @L1A*/         
*      3 XPLGENV_DSMEB1 BIT(8),     /* DSME Bits 1               @L1A*/         
*        4 XPLGENV_DIAUTH BIT(1),   /* Initial Authorized will be               
*                                        processed               @L1A*/         
*        4 *             BIT(2),    /* Reserved                  @L1A*/         
*        4 XPLGENV_BNSO  BIT(1),    /* Border Node Selection Option             
*                                        Supported               @L1A*/         
*        4 XPLGENV_DEF   BIT(1),    /* End function will be processed           
*                                                                @L1A*/         
*        4 *             BIT(3),    /* Reserved                  @L1A*/         
*      3 XPLGENV_DSMEB2 BIT(8),     /* DSME Bits 2               @L1A*/         
*        4 *             BIT(6),    /* Reserved                  @L1A*/         
*        4 XPLGENV_DSMMR BIT(1),    /* DSME supports MODIFY REPLACE             
*                                                                @L1A*/         
*        4 *             BIT(1),    /* Reserved             @L1A @L2C*/         
*    2 XPLGENV_TMINV  CHAR(2),      /* Tuning Statistics Timing                 
*                                      interval                  @L2A*/         
*    2 XPLGENV_FLGS2 BIT(8),        /* Environment flags 2       @L2A*/         
*      3 XPLGENV_TUNAC BIT(1),      /* Tuning stat is active     @L2A*/         
*      3 XPLGENV_TUNRQ BIT(1),      /* TNSTAT task attatched     @L2A*/         
*      3 XPLGENV_TUNCL BIT(1),      /* Display TUNSTAT RECORD at                
*                                      Console                   @L2A*/         
*      3 *             BIT(5),      /* Reserved                  @L5C*/         
*    2 XPLGENV_DIRSZ  CHAR(4),      /* DIRSIZE start option value               
*                                                           @L5A @D2C*/         
*    2 XPLGENV_SMEAO2 BIT(16),      /* Session Manager Exit active              
*                                        options part II         @D2A*/         
*      3 XPLGENV_SMEB3 BIT(8),      /* SME Bits 3                @D2A*/         
*        4 XPLGENV_MNPS BIT(1),     /* MNPS Recovery calls will be              
*                                      processed                 @D2A*/         
*        4 XPLGENV_HPRVR BIT(1),    /* SME supports HPR VR selection            
*                                                                @A1A*/         
*        4 XPLGENV_HPROLU BIT(1),   /* SME supports HPR OLU Pipe                
*                                      authorization             @A1A*/         
*        4 XPLGENV_HPRANR BIT(1),   /* SME supports HPR ANR Pipe                
*                                      authorization             @A1A*/         
*        4 XPLGENV_HPRDLU BIT(1),   /* SME supports HPR DLU Pipe                
*                                      authorization             @A1A*/         
*        4 *          BIT(3),       /* Reserved for SME usage    @D2A*/         
*      3 *            BIT(8),       /* Reserved for SME usage    @D2A*/         
*    2 XPLGENV_LCL_NETID   CHAR(8), /* Local Net ID              @D3A*/         
*    2 XPLGENV_LCL_CPNAME  CHAR(8), /* Local CP Name             @D3A*/         
*    2 XPLGENV_FLGS3 BIT(8),        /* Environment flags 3       @D3A*/         
*      3 XPLGENV_MNPSCAP BIT(1),    /* MNPS Capability           @D2A*/         
*      3 XPLGENV_HPRCP BIT(2),      /* HPR Support/Capability                   
*                                      00  HPR Not supported                    
*                                      01  HPR Base  support                    
*                                      10  HPR Tower support     @D3A*/         
*      3 *             BIT(5);      /* Reserved - to be used only at            
*                                      V4R4 time]                @D3A*/         
*                                                                               
*/********************************************************************/         
*/*             Global Inline Exit Vector                            */         
*/********************************************************************/         
*                                                                               
*DCL                                                                            
*  1 XPLGIEV   DEFINED(XPLVEC_DAT), /* Global Inline Exit Vector     */         
*    2 XPLGIEV_ENM   CHAR(8),       /* Exit Name                     */         
*    2 XPLGIEV_EMNM  CHAR(8),       /* Exit Module Name              */         
*    2 XPLGIEV_EL    CHAR(4),       /* Exit Level                    */         
*    2 XPLGIEV_ESTAT FIXED(8);      /* Exit status                   */         
*                                                                               
*/********************************************************************/         
*/*             Global Storage Buffer Pool Vector                    */         
*/********************************************************************/         
*                                                                               
*DCL                                                                            
*  1 XPLGSBV   DEFINED(XPLVEC_DAT), /* Global Storage Buffer Pool               
*                                        Vector                      */         
*    2 XPLGSBV_BPID  CHAR(4),       /* Buffer pool ID(name)          */         
*    2 XPLGSBV_SIZE  CHAR(2),       /* Size of each Buffer in Pool   */         
*    2 XPLGSBV_BASNM CHAR(4),       /* Base Num Buffers defined at              
*                                        VTAM Initialization         */         
*    2 XPLGSBV_CURNM CHAR(4),       /* Current num buffers defined   */         
*    2 XPLGSBV_TOTAV CHAR(4),       /* Total num buffer available    */         
*    2 XPLGSBV_STATA CHAR(4),       /* Num static buffer available   */         
*    2 XPLGSBV_MXUSE CHAR(4),       /* Maximum num buffers in use               
*                                        since last COLLECT CNM RU   */         
*    2 XPLGSBV_XSZBU CHAR(2),       /* Expansion size (buffers), same           
*                                      as number buffers per extent  */         
*    2 XPLGSBV_XSZBY CHAR(4),       /* Expansion size (bytes)        */         
*    2 XPLGSBV_XTHRE CHAR(2),       /* Expansion Threshold           */         
*    2 XPLGSBV_XLIM  CHAR(4),       /* Expansion limit               */         
*    2 XPLGSBV_CTHRE CHAR(2),       /* Contraction Threshold         */         
*    2 XPLGSBV_NMEXP CHAR(4),       /* Number of Expansions          */         
*    2 XPLGSBV_SDTHR CHAR(4),       /* Slow Down Threshold           */         
*    2 XPLGSBV_NUMQR CHAR(4),       /* Num of queued requests (RPH)  */         
*    2 XPLGSBV_NMBNQ CHAR(4),       /* Num buffers needed to satisfy            
*                                        queued requests             */         
*    2 XPLGSBV_MXNQR CHAR(4),       /* Maximum num of queued requests           
*                                        since last COLLECT CNM RU   */         
*    2 XPLGSBV_MXNAL CHAR(4),       /* Maximum number of bytes                  
*                                      allocated  since last                    
*                                      COLLECT CNM RU                */         
*    2 XPLGSBV_ATTFL BIT(16),       /* Pool attribute flags          */         
*      3 XPLGSBV_ATTR1 BIT(8),      /* Pool attributes - Byte 1  @L4A*/         
*        4 *             BIT(1),    /* Reserved                      */         
*        4 XPLGSBV_FIXST BIT(1),    /* 1=Fixed - 0=Pageable storage  */         
*        4 XPLGSBV_FTCH  BIT(1),    /* Pool resides in fetch                    
*                                        protected storage           */         
*        4 *             BIT(1),    /* Reserved                      */         
*        4 XPLGSBV_BEL24 BIT(1),    /* Storage allocated below 24 bit           
*                                        line                        */         
*        4 *             BIT(3),    /* Reserved                      */         
*      3 XPLGSBV_ATTR2 BIT(8),      /* Pool attributes - Byte 1  @L4A*/         
*        4 XPLGSBV_USRFX BIT(1),    /* User request fixed buffer     */         
*        4 *             BIT(7),    /* Reserved - Not Available      */         
*    2 XPLGSBV_SPNUM CHAR(2),       /* Subpool Number            @L2A*/         
*    2 XPLGSBV_BSENO CHAR(2),       /* User specified BASENO     @L2A           
*                                                                @Y2C*/         
*    2 XPLGSBV_XPANO CHAR(2),       /* User specified xpand buff @L2A           
*                                                                @Y2C*/         
*    2 XPLGSBV_NPXB  CHAR(4),       /* Number of Active Extents  @L2A*/         
*    2 XPLGSBV_NABIE CHAR(4);       /* Number of available buffers in           
*                                        all extents             @L2A*/         
*                                                                               
*/********************************************************************/         
*/*             Global Storage Private Storage Vector                */         
*/********************************************************************/         
*                                                                               
*DCL                                                                            
*  1 XPLGSPV   DEFINED(XPLVEC_DAT), /* Global Storage Private Storage           
*                                        Vector                      */         
*    2 XPLGSPV_CURR  CHAR(4),       /* Current private storage alloc */         
*    2 XPLGSPV_MAX   CHAR(4);       /* Max private storage allocated */         
*                                                                               
*/********************************************************************/         
*/*             Global Storage CSA Vector                            */         
*/********************************************************************/         
*                                                                               
*DCL                                                                            
*  1 XPLGSCV   DEFINED(XPLVEC_DAT), /* Global Storage CSA Vector     */         
*    2 XPLGSCV_MXCSA CHAR(4),       /* Maximum size CSA allowed      */         
*    2 XPLGSCV_MXC24 CHAR(4),       /* Max size CSA allowed below               
*                                        16M line                    */         
*    2 XPLGSCV_CUCSA CHAR(4),       /* Current CSA allocated for VTAM*/         
*    2 XPLGSCV_TOTHW CHAR(4),       /* Total CSA high-water mark since          
*                                        last COLLECT CNM RU         */         
*    2 XPLGSCV_TOTHT CHAR(8),       /* Timestamp for high-water mark            
*                                        for Total CSA allocated     */         
*    2 XPLGSCV_TOTLW CHAR(4),       /* Total CSA low-water mark since           
*                                        last COLLECT CNM RU         */         
*    2 XPLGSCV_TOTLT CHAR(8),       /* Timestamp for low-water mark             
*                                        for Total CSA allocated     */         
*    2 XPLGSCV_MTOTC CHAR(4),       /* Max Total CSA ever used       */         
*    2 XPLGSCV_CUC24 CHAR(4),       /* Current CSA allocated below              
*                                        16M line                    */         
*    2 XPLGSCV_C24MX CHAR(4),       /* Max CSA 24 ever used          */         
*    2 XPLGSCV_C24HW CHAR(4),       /* CSA 24 high-water mark since             
*                                        last COLLECT CNM RU         */         
*    2 XPLGSCV_C24HT CHAR(8),       /* Timestamp for high-water mark            
*                                        for TCSA 24 allocated       */         
*    2 XPLGSCV_C24LW CHAR(4),       /* CSA 24 low-water mark since              
*                                        last COLLECT CNM RU         */         
*    2 XPLGSCV_C24LT CHAR(8);       /* Timestamp for low-water mark             
*                                        for CSA 24 allocated        */         
*                                                                               
*/********************************************************************/         
*/*             Global Storage GETBLK Vector                         */         
*/********************************************************************/         
*                                                                               
*DCL                                                                            
*  1 XPLGSGV   DEFINED(XPLVEC_DAT), /* Global Storage GETBLK Vector  */         
*    2 XPLGSGV_NAME  CHAR(8),       /* Pool Name                     */         
*    2 XPLGSGV_BLEN  CHAR(4),       /* Subpool buffer length         */         
*    2 XPLGSGV_BPPAG CHAR(2),       /* Number buffers per page       */         
*    2 XPLGSGV_PGSIZ CHAR(4),       /* Page size                     */         
*    2 XPLGSGV_ByteU CHAR(4),       /* Number of bytes in use        */         
*      3 XPLGSGV_ByteUInMeg_Byte Bit(8), /* Byte containing inMEG               
*                                      indicator (bit 0)         @A2A*/         
*        4 XPLGSGV_ByteUInMeg Bit(1), /* When 0, XPLGSGV_ByteU bits             
*                                      1-31 contain byte count                  
*                                      When 1, XPLGSGV_ByteU bits 1-31          
*                                      contain megabyte count    @A2A*/         
*    2 XPLGSGV_BUHW  CHAR(4),       /* Number of bytes in use high-             
*                                      water mark since last COLLECT            
*                                      CNM RU processed              */         
*      3 XPLGSGV_BUHWInMeg_Byte Bit(8), /* Byte containing inMEG                
*                                      indicator (bit 0)         @A2A*/         
*        4 XPLGSGV_BUHWInMeg Bit(1), /* When 0, XPLGSGV_BUHW bits               
*                                      1-31 contain byte count                  
*                                      When 1, XPLGSGV_BUHW bits 1-31           
*                                      contain megabyte count    @A2A*/         
*    2 XPLGSGV_BUHT  CHAR(8),       /* Timestamp for number of bytes            
*                                      in use high-water mark                   
*                                      since last COLLECT CNM RU     */         
*    2 XPLGSGV_ByteA CHAR(4),       /* Number of bytes allocated     */         
*      3 XPLGSGV_ByteAInMeg_Byte Bit(8), /* Byte containing inMEG               
*                                      indicator (bit 0)         @A2A*/         
*        4 XPLGSGV_ByteAInMeg Bit(1), /* When 0, XPLGSGV_ByteA bits             
*                                      1-31 contain byte count                  
*                                      When 1, XPLGSGV_ByteA bits 1-31          
*                                      contain megabyte count    @A2A*/         
*    2 XPLGSGV_BAHW  CHAR(4),       /* Number of bytes allocated high-          
*                                      water mark since last COLLECT            
*                                      CNM RU processed              */         
*      3 XPLGSGV_BAHWInMeg_Byte Bit(8), /* Byte containing inMEG                
*                                      indicator (bit 0)         @A2A*/         
*        4 XPLGSGV_BAHWInMeg Bit(1), /* When 0, XPLGSGV_BAHW bits               
*                                      1-31 contain byte count                  
*                                      When 1, XPLGSGV_BAHW bits 1-31           
*                                      contain megabyte count    @A2A*/         
*    2 XPLGSGV_BAHT  CHAR(8);       /* Timestamp for number of bytes            
*                                        allocated high-water mark              
*                                        since last COLLECT CNM RU   */         
*                                                                               
*                                                                               
*/********************************************************************/         
*/*             Global Session Vector                                */         
*/********************************************************************/         
*                                                                               
*DCL                                                                            
*  1 XPLGSEV   DEFINED(XPLVEC_DAT), /* Global Session Vector         */         
*    2 XPLGSEV_STTAK CHAR(4),       /* Number successful LU-LU session          
*                                        starts and takeovers        */         
*    2 XPLGSEV_STOP  CHAR(4),       /* Number LU-LU session stops    */         
*    2 XPLGSEV_FAIL  CHAR(4),       /* Number LU-LU session set-up              
*                                        failures                    */         
*    2 XPLGSEV_ACTHW CHAR(4),       /* Number of active LU-LU sessions          
*                                        high-water mark since last             
*                                        COLLECT CNM RU processed    */         
*    2 XPLGSEV_ACTHT CHAR(8),       /* Timestamp for number of active           
*                                        LU-LU sessions high-water mark         
*                                        since last COLLECT CNM RU   */         
*    2 XPLGSEV_ACTLW CHAR(4),       /* Number of active LU-LU sessions          
*                                        low-water mark since last              
*                                        COLLECT CNM RU processed    */         
*    2 XPLGSEV_ACTLT CHAR(8),       /* Timestamp for number of active           
*                                        LU-LU sessions low-water mark          
*                                        since last COLLECT CNM RU   */         
*    2 XPLGSEV_QINIT CHAR(4),       /* Number of LU-LU sessions in              
*                                        Queued Initiate status      */         
*    2 XPLGSEV_PENDR CHAR(4),       /* Number of LU-LU sessions in              
*                                        Pending Reallocation status */         
*    2 XPLGSEV_PENDA CHAR(4),       /* Number of LU-LU sessions in              
*                                        Pending Active status       */         
*    2 XPLGSEV_ACT   CHAR(4),       /* Number active LU-LU sessions  */         
*    2 XPLGSEV_PENDT CHAR(4),       /* Number of LU-LU sessions in              
*                                        Pending Termination status  */         
*    2 XPLGSEV_DAPLU CHAR(4),       /* Number defined APPL LUs       */         
*    2 XPLGSEV_DDELU CHAR(4),       /* Number defined non-appl                  
*                                        dependent LUs               */         
*    2 XPLGSEV_DCDRS CHAR(4),       /* Number defined CDRSCs         */         
*    2 XPLGSEV_DPU   CHAR(4),       /* Number defined PUs            */         
*    2 XPLGSEV_AAPLU CHAR(4),       /* Number active APPLU LUs       */         
*    2 XPLGSEV_ADELU CHAR(4),       /* Number active non-appl                   
*                                        dependent LUs               */         
*    2 XPLGSEV_ACDRS CHAR(4),       /* Number active CDRSCs          */         
*    2 XPLGSEV_APU   CHAR(4),       /* Number active PUs             */         
*    2 XPLGSEV_RCPF  CHAR(4),       /* Number retriable CP-CP session           
*                                        failures                    */         
*    2 XPLGSEV_NRCPF CHAR(4),       /* Number non-retriable CP-CP               
*                                        session failures            */         
*    2 XPLGSEV_SCPIN CHAR(4),       /* Number successful CP-CP session          
*                                         initiations            @L1C*/         
*    2 XPLGSEV_DLREN CHAR(4),       /* Number of DLR end nodes   @L1A*/         
*    2 XPLGSEV_DLRNN CHAR(4),       /* Number of DLR network nodes              
*                                                                @L1A*/         
*    2 XPLGSEV_DLRPU CHAR(4),       /* Number of DLR served PUs  @L1A*/         
*    2 XPLGSEV_DLRLU CHAR(4),       /* Number of DLR served LUs  @L1A           
*                                                                @L2C*/         
*    2 XPLGSEV_AILUS CHAR(4),       /* Number active ILUs        @L2A*/         
*    2 XPLGSEV_SRVEN CHAR(4),       /* Number of ENs served by this NN          
*                                      (i.e. CP-CP session active)              
*                                      INVALID when we are EN    @L2A*/         
*    2 XPLGSEV_CPSNN CHAR(4);       /* Number NN with which this NN has         
*                                      CP-CP sessions, INVALID when we          
*                                      are EN                    @L2A*/         
*                                                                               
*/********************************************************************/         
*/*             Global APPN Directory Services Vector                */         
*/********************************************************************/         
*                                                                               
*DCL                                                                            
*  1 XPLGADV   DEFINED(XPLVEC_DAT), /* Global APPN Directory Services           
*                                        Vector                      */         
*    2 XPLGADV_NRFLD CHAR(4),       /* Number resources found in                
*                                        local database              */         
*    2 XPLGADV_NRFDS CHAR(4),       /* Number resources found from              
*                                        Directory Server            */         
*    2 XPLGADV_NRFDB CHAR(4),       /* Number resources found via               
*                                        domain broadcast            */         
*    2 XPLGADV_NRFNB CHAR(4),       /* Number resources found via               
*                                        network broadcast           */         
*    2 XPLGADV_FSRCH CHAR(4),       /* Number of failed searches                
*                                        (receive negative reply)    */         
*    2 XPLGADV_NBNCE CHAR(4),       /* Number of times network                  
*                                        broadcast not performed due            
*                                        to negative cache entry     */         
*    2 XPLGADV_ESRRF CHAR(4),       /* Number of external search                
*                                        requests - resource found   */         
*    2 XPLGADV_ESRNF CHAR(4),       /* Number of external search                
*                                        requests - resource ^ found */         
*    2 XPLGADV_DSNRR CHAR(4),       /* Number referrals received     */         
*    2 XPLGADV_DSPRR CHAR(4),       /* Number positive replies received         
*                                        from an Alternate Directory            
*                                        Server                      */         
*    2 XPLGADV_DSNNR CHAR(4),       /* Number negative replies received         
*                                        from an Alternate Directory            
*                                        Server                      */         
*    2 XPLGADV_RRCGC CHAR(4),       /* Number of resources removed              
*                                        from cache due to garbage              
*                                        collection              @L1C*/         
*    2 XPLGADV_ADJDS CHAR(4),       /* Number of adjacent nodes in a            
*                                        different subnet   @L1A @L2C*/         
*    2 XPLGADV_ROBCH CHAR(4),       /* Number of times a CHACHE entry           
*                                        is discarded due to DIRSIZE            
*                                        max being reached       @L2A*/         
*    2 XPLGADV_REGRS CHAR(4),       /* Number of registered resources           
*                                        at a Cesntral Directory Server         
*                                        or at an NN             @L2A*/         
*    2 XPLGADV_CACHE CHAR(4);       /* Number of entries in the CACHE           
*                                                                @L2A*/         
*                                                                               
*/********************************************************************/         
*/*         Global APPN Directory Services Border Node Vector    @L1A*/         
*/********************************************************************/         
*                                                                               
*DCL                                                                            
*  1 XPLGBNV   DEFINED(XPLVEC_DAT), /* Global APPN Directory Services           
*                                        Border Node Vector          */         
*    2 XPLGBNV_CPNME CHAR(16),      /* Network qualified CPNAME  @L1A*/         
*      3 XPLGBNV_NETID CHAR(8),     /* Adjacent Node Network ID  @L1A*/         
*      3 XPLGBNV_NAME  CHAR(8),     /* Adjacent Node Name        @L1A*/         
*    2 XPLGBNV_SSRCH CHAR(4),       /* Number of subnet searches sent           
*                                        to adjacent Node        @L1A*/         
*    2 XPLGBNV_RSRCH CHAR(4);       /* Number of subnet searches                
*                                        received from ADJ node  @L1A*/         
*                                                                               
*/********************************************************************/         
*/*             Global APPN Topology Data Vector                     */         
*/********************************************************************/         
*                                                                               
*DCL                                                                            
*  1 XPLGATV   DEFINED(XPLVEC_DAT), /* Global APPN Topology data                
*                                        Vector                      */         
*    2 XPLGATV_NRTET CHAR(4),       /* Number of routes - using                 
*                                        existing tree               */         
*    2 XPLGATV_NRTMT CHAR(4),       /* Number of routes - using                 
*                                        modified tree               */         
*    2 XPLGATV_NRTNT CHAR(4),       /* Number of routes - using                 
*                                        new tree                    */         
*    2 XPLGATV_TDUON CHAR(4),       /* Number of TDUs originated by             
*                                        this node                   */         
*    2 XPLGATV_TDUPN CHAR(4),       /* Number of TDUs propagated by             
*                                        this node                   */         
*    2 XPLGATV_TDUDU CHAR(4),       /* Number of TDUs received by this          
*                                        node resulting in topology             
*                                        database update             */         
*    2 XPLGATV_TDUDN CHAR(4),       /* Number of TDUs received by this          
*                                        node and discarded for normal          
*                                        reasons                     */         
*    2 XPLGATV_TDUDR CHAR(4),       /* Number of TDUs received by this          
*                                        node and discarded because is          
*                                        a RSN ^ OK (rebroadcast)    */         
*    2 XPLGATV_TDUDI CHAR(4),       /* Number of TDUs received by this          
*                                        node and discarded because of          
*                                        data inconsistency                     
*                                        (rebroadcast)               */         
*    2 XPLGATV_NNTD  CHAR(4),       /* Number of network nodes in               
*                                        topology database           */         
*    2 XPLGATV_ENTD  CHAR(4),       /* Number of end nodes in                   
*                                        topology database           */         
*    2 XPLGATV_TGTD  CHAR(4),       /* Number of TGs in topology                
*                                        database                    */         
*    2 XPLGATV_TGFL  CHAR(4),       /* Number of TG failures         */         
*    2 XPLGATV_DPUAL CHAR(4),       /* Num of dynamic PU allocations */         
*    2 XPLGATV_DTCF  CHAR(4),       /* Number of trees discarded                
*                                      due to Cache being full       */         
*    2 XPLGATV_NMTRE CHAR(4),       /* Number of trees           @L2C*/         
*    2 XPLGATV_VNTD  CHAR(4),       /* Number of Virtual nodes in the           
*                                        topology database       @L2A*/         
*    2 XPLGATV_CDSTD CHAR(4),       /* Number Central Directory Servers         
*                                        in topology database    @L2A*/         
*    2 XPLGATV_ICNCN CHAR(4),       /* Number of IC Nodes in the                
*                                        topology database       @L2A*/         
*    2 XPLGATV_ENCON CHAR(4),       /* Number of ENs connected to this          
*                                        node                    @L2A*/         
*    2 XPLGATV_NNCON CHAR(4),       /* Number of NNs connected to this          
*                                        node                    @L2A*/         
*    2 XPLGATV_VNCON CHAR(4);       /* Number of VNs connected to this          
*                                        node               @L2A @L4C*/         
*                                                                               
*/********************************************************************/         
*/*             Global CSM Buffer Pool Vector                        */         
*/********************************************************************/         
*                                                                               
* DCL                                                                           
*  1 XPLGCBV   DEFINED(XPLVEC_DAT),  /* Global CSM Buffer Pool                  
*                                        Vector                  @D1A*/         
*    2 XPLGCBV_SIZE FIXED(31) BDY(BYTE), /* Buffer size                         
*                                                                @D1A*/         
*    2 XPLGCBV_SRCE  FIXED(8),       /* Buffer source Flag       @S4C*/         
*    2 *             CHAR(3),        /* Not used - Available     @S4C*/         
*    2 XPLGCBV_INUSE FIXED(31) BDY(BYTE),/* Number of buffers in                
*                                           pool that are inuse. @D1A*/         
*    2 XPLGCBV_FREE  FIXED(31) BDY(BYTE);/* Number of available                 
*                                           buffers in pool.     @D1A*/         
*                                                                               
*/********************************************************************/         
*/*             Global CSM Storage Usage Vector                      */         
*/********************************************************************/         
*                                                                               
* DCL                                                                           
*  1 XPLGCSV   DEFINED(XPLVEC_DAT),         /* Global CSM Storage               
*                                              Usage Vector      @D1C*/         
*    2 XPLGCSV_MAXFIXED FIXED(32) BDY(BYTE),/* Installation maximum             
*                                              Fixed storage     @S4C*/         
*      3 XPLGCSV_MaxFInMeg_Byte Bit(8),     /* Byte containing inMEG            
*                                              indicator (bit 0) @L6A*/         
*        4 XPLGCSV_MaxFInMeg Bit(1),        /* When 0,                          
*                                               XPLGCSV_MAXFIXED bits           
*                                               1-31 contain byte count         
*                                              When 1,                          
*                                               XPLGCSV_MAXFIXED bits           
*                                               1-31 contain megabyte           
*                                               count            @L6A*/         
*    2 XPLGCSV_CURFIXED FIXED(32) BDY(BYTE),/* Current fixed storage            
*                                              in use.           @S4C*/         
*      3 XPLGCSV_CurFInMeg_Byte Bit(8),     /* Byte containing inMEG            
*                                              indicator (bit 0) @L6A*/         
*        4 XPLGCSV_CurFInMeg Bit(1),        /* When 0,                          
*                                               XPLGCSV_CURFIXED bits           
*                                               1-31 contain byte count         
*                                              When 1,                          
*                                               XPLGCSV_CURFIXED bits           
*                                               1-31 contain megabyte           
*                                               count            @L6A*/         
*    2 XPLGCSV_MAXECSA FIXED(32) BDY(BYTE), /* Installation maximum             
*                                              ECSA storage      @S4C*/         
*    2 XPLGCSV_CURECSA FIXED(32)BDY(BYTE);  /* Current ECSA storage             
*                                              in use.           @S4C*/         
*                                                                               
*/********************************************************************/         
*/********************************************************************/         
*/**********        VIRTUAL ROUTE DATA VECTORS              **********/         
*/********************************************************************/         
*/********************************************************************/         
*                                                                               
*/********************************************************************/         
*/*                 Basic Route Data Vector                          */         
*/********************************************************************/         
*                                                                               
*DCL                                                                            
*  1 XPLVBRV   DEFINED(XPLVEC_DAT), /* Virtual Basic Route Data                 
*                                        Vector                      */         
*    2 XPLVBRV_DSTSA CHAR(4),       /* Destination Subarea           */         
*    2 XPLVBRV_TPRIO FIXED(8),      /* Transmission Priority         */         
*    2 XPLVBRV_VRNUM FIXED(8),      /* Virtual Route number          */         
*    2 XPLVBRV_ADJSA CHAR(4),       /* Adjacent Subarea              */         
*    2 XPLVBRV_ERTNM BIT(8),        /* Explicit Route number     @L5C*/         
*      3 XPLVBRV_IERNM BIT(4),      /* Initial ER number         @L5A*/         
*      3 XPLVBRV_AERNM BIT(4),      /* Actual ER number          @L5A*/         
*    2 XPLVBRV_RERNM FIXED(8),      /* Reverse Explicit Route number */         
*    2 XPLVBRV_SESVR CHAR(2),       /* Number of sessions on VR      */         
*    2 XPLVBRV_MINWS FIXED(8),      /* Current minimum window size   */         
*    2 XPLVBRV_MAXWS FIXED(8),      /* Current maximum window size   */         
*    2 XPLVBRV_DEFWS FIXED(8),      /* Default window size           */         
*    2 XPLVBRV_DFMWS FIXED(8),      /* Default maximum window size   */         
*    2 XPLVBRV_WSRES CHAR(4),       /* Number of time window size               
*                                        reset to the minimum        */         
*    2 XPLVBRV_PIUWS CHAR(4),       /* Number of PIUs on the VR                 
*                                        waiting to be sent          */         
*    2 XPLVBRV_VRST  FIXED(8),      /* Virtual Route state       @L4C*/         
*    2 XPLVBRV_FCDATA,              /* Flow Control state data       */         
*      3 XPLVBRV_FCST  BIT(8),      /* Flow Control state        @L4C*/         
*        4 *           BIT(6),      /* Reserved                  @L4C*/         
*        4 XPLVBRV_ROUTE BIT(2),    /* Route status - 00 = blocked   */         
*                                   /*                01 = held      */         
*                                   /*                10 = open      */         
*      3 XPLVBRV_NTHLD CHAR(4),     /* Num times route in held state */         
*      3 XPLVBRV_THLDC CHAR(8),     /* Time VR has been in held state           
*                                        if currently held           */         
*      3 XPLVBRV_THLDT CHAR(8),     /* Time VR has been in held state           
*                                        (Total not including current           
*                                         held time)                 */         
*      3 XPLVBRV_THLDM CHAR(8),     /* Time VR has been in held state           
*                                        (Maximum time held for any             
*                                         given instance)            */         
*      3 XPLVBRV_TMHLD CHAR(8),     /* Timestamp for Time VR has been           
*                                        in held state (Maximum time            
*                                        held for any given instance)*/         
*      3 XPLVBRV_NTBLK CHAR(4),     /* Number of times VR blocked    */         
*      3 XPLVBRV_TBLKC CHAR(8),     /* Time VR has been in blocked              
*                                        state if currently blocked  */         
*      3 XPLVBRV_TBLKT CHAR(8),     /* Time VR has been in blocked              
*                                        state (Total not including             
*                                         current blocked time)      */         
*      3 XPLVBRV_TBLKM CHAR(8),     /* Time VR has been in blocked              
*                                        state (Maximum time blocked            
*                                        for any given instance)     */         
*      3 XPLVBRV_TMBLK CHAR(8),     /* Timestamp for Time VR has been           
*                                        in blocked state (Maximum time         
*                                        blocked held for any given             
*                                        instance                @L2C*/         
*    2 XPLVBRV_LUSCT FIXED(15) BDY(BYTE), /* Total number of LU-LU              
*                                        sessions on the VR      @L5C*/         
*    2 XPLVBRV_CPRSC FIXED(15) BDY(BYTE), /* Current pacing request             
*                                        send count              @L5C*/         
*    2 XPLVBRV_CPWSZ FIXED(8),      /* Current pacing window                    
*                                        size                    @L5C*/         
*    2 XPLVBRV_OPIUC FIXED(32) BDY(BYTE), /* Outbound PIU count over            
*                                        VR                      @Y1C*/         
*    2 XPLVBRV_IPIUC FIXED(32) BDY(BYTE); /* Inbound PIU count over             
*                                        VR                      @Y1C*/         
*                                                                               
*/********************************************************************/         
*/********************************************************************/         
*/**********        Rapid Transport Protocol Vectors        *****@D3A*/         
*/********************************************************************/         
*/********************************************************************/         
*                                                                               
*/********************************************************************/         
*/*                   Basic RTP Data Vector                      @D3A*/         
*/* WARNING:  XPLRTPV_STATS_1 must match exactly with RPDCB_STATS_1  */         
*/********************************************************************/         
*                                                                               
*DCL                                                                            
*  1 XPLRTPV  DEFINED(XPLVEC_DAT),  /* Rapid Transport Protocol                 
*                                        Data Vector             @D3A*/         
*    2 XPLRTPV_FLAGS    BIT(16),    /* RTP Flag Bytes            @D3A*/         
*      3 XPLRTPV_PATHSWTCH BIT(1),  /* Path Switch occured       @D3A*/         
*      3 XPLRTPV_CLOSEOUT  BIT(1),  /* RTP deleted/Closeout info @D3A*/         
*      3 XPLRTPV_PSW_NAME  BIT(1),  /* Path Switch - Name CHange @D3A*/         
*      3 *                 BIT(13), /* Reserved                  @D3A*/         
*    2 XPLRTPV_LCL_NCE     BIT(64) BDY(BYTE), /* Local NCE  @D3A @D4C*/         
*    2 XPLRTPV_LCL_TCID    BIT(64) BDY(BYTE), /* Local TCID      @D3A*/         
*    2 XPLRTPV_RTP_PU      CHAR(8),           /* RTP PU Name     @D4A*/         
*    2 XPLRTPV_RMT_NETID   CHAR(8),           /* Remote Net ID   @D3A*/         
*    2 XPLRTPV_RMT_CPNAME  CHAR(8),           /* Remote CP Name  @D3A*/         
*    2 XPLRTPV_RMT_PSW_NETID   CHAR(8),       /* Remote Net ID after            
*                                                Path Switch     @D3A*/         
*    2 XPLRTPV_RMT_PSW_CPNAME  CHAR(8),       /* Remote CP Name after           
*                                                Path Switch     @D3A*/         
*    2 XPLRTPV_RMT_NCE     BIT(64) BDY(BYTE), /* Remote NCE @D3A @D4C*/         
*    2 XPLRTPV_RMT_TCID    BIT(64) BDY(BYTE), /* Remote TCID     @D3A*/         
*    2 XPLRTPV_RTP_STATE  FIXED(8) BDY(BYTE), /* RTP State       @D3A*/         
*    2 XPLRTPV_PSW_TIMER FIXED(32) BDY(BYTE), /* Path Switch Timer              
*                                                                @D3A*/         
*    2 XPLRTPV_RTRP_DLAY FIXED(32) BDY(BYTE), /* Round Trip Delay               
*                                                                @D3A*/         
*    2 XPLRTPV_STATS_1,                       /* Data segment    @D3A*/         
*      3 XPLRTPV_BYTES_SNT FIXED(32) BDY(BYTE), /* Number bytes sent            
*                                                  over RTP      @D3A*/         
*      3 XPLRTPV_BYTES_RCVV FIXED(32) BDY(BYTE), /* Num. bytes received         
*                                                  over RTP      @D3A*/         
*      3 XPLRTPV_PIUS_FRST FIXED(32) BDY(BYTE), /* Number 1st in segmnt         
*                                                  PIUs sent     @D3A*/         
*      3 XPLRTPV_PIUS_MIDL FIXED(32) BDY(BYTE), /* Num middle in segmnt         
*                                                  PIUs sent     @D3A*/         
*      3 XPLRTPV_PIUS_LAST FIXED(32) BDY(BYTE), /* Num last in segmnt           
*                                                  PIUs sent     @D3A*/         
*      3 XPLRTPV_PIUS_WHOL FIXED(32) BDY(BYTE), /* Number unsegmented           
*                                                  PIUs sent     @D3A*/         
*      3 XPLRTPV_PIUR_FRST FIXED(32) BDY(BYTE), /* Number 1st in segmnt         
*                                                  PIUs received @D3A*/         
*      3 XPLRTPV_PIUR_MIDL FIXED(32) BDY(BYTE), /* Num middle in segmnt         
*                                                  PIUs recved   @D3A*/         
*      3 XPLRTPV_PIUR_LAST FIXED(32) BDY(BYTE), /* Num last in segmnt           
*                                                  PIUs received @D3A*/         
*      3 XPLRTPV_PIUR_WHOL FIXED(32) BDY(BYTE), /* Num unsegmented PIUs         
*                                                  received      @D3A*/         
*      3 XPLRTPV_SNDR_CHNG FIXED(32) BDY(BYTE), /* Number times allowed         
*                                                send rate chngd @D3A*/         
*      3 XPLRTPV_EPINI_PSW FIXED(16) BDY(BYTE), /* Path Switch Attempts         
*                                                  Initiated by RTP             
*                                                  end point     @D3A*/         
*      3 XPLRTPV_VTAMI_PSW FIXED(16) BDY(BYTE), /* Total path switch            
*                                                  attempts initiated           
*                                                  by this VTAM  @D3A*/         
*      3 XPLRTPV_OPCMD_PSW FIXED(16) BDY(BYTE), /* Path Switch Attempts         
*                                                  due to Operator              
*                                                  Command       @D3A*/         
*      3 XPLRTPV_UNSUC_PSV FIXED(16) BDY(BYTE), /* Total Unsuccessful           
*                                                  Path Switch attempts         
*                                                                @D3A*/         
*      3 XPLRTPV_UNSUC_PSO FIXED(16) BDY(BYTE), /* Unsuccessful Path            
*                                                  Switch due to Op.            
*                                                  Command       @D3A*/         
*    2 XPLRTPV_LULU_SESS_COUNT FIXED(32) BDY(BYTE), /* Count of active          
*                                                  LU-LU sessions               
*                                                  using the RTP @D3A*/         
*    2 XPLRTPV_TOT_BKPTM FIXED(32) BDY(BYTE), /* Time in milliseconds           
*                                                back pressure has              
*                                                been applied    @D3A*/         
*    2 XPLRTPV_TOT_BACKP FIXED(16) BDY(BYTE), /* Total number of times          
*                                                back pressure has been         
*                                                applied         @D3A*/         
*    2 XPLRTPV_PSW_BACKP FIXED(16) BDY(BYTE), /* Number of times back           
*                                                pressure applied due           
*                                                to path switch  @D3A*/         
*    2 XPLRTPV_QDP_BACKP FIXED(16) BDY(BYTE), /* Number of times back           
*                                                pressure applied due           
*                                                to queue depth                 
*                                                exceeded        @D3A*/         
*    2 XPLRTPV_RESNT_NLP FIXED(32) BDY(BYTE), /* Number retransmitted           
*                                                NLPs            @D3A*/         
*    2 XPLRTPV_UNAK_BUFS FIXED(32) BDY(BYTE); /* Current num of unac-           
*                                                knowledge buffs @D3A*/         
*/********************************************************************/         
*/*                          RTP RSCV Vector                     @D3A*/         
*/********************************************************************/         
*                                                                               
*DCL                                                                            
*  1 XPLRSCV  DEFINED(XPLVEC_DAT),  /* RTP RSCV Vector (see CV 2B)              
*                                                                @D3A*/         
*    2 XPLRSCV_DATA      CHAR(*);   /* Actual Data for CV2B      @D3A*/         
*                                                                               
*/********************************************************************/         
*/*                       RTP COS/TPF Vector                     @D3A*/         
*/********************************************************************/         
*                                                                               
*DCL                                                                            
*  1 XPLCOSV  DEFINED(XPLVEC_DAT),  /* RTP COS/TPF Vector  (see CV 2C)          
*                                                                @D3A*/         
*    2 XPLCOSV_DATA      CHAR(*);   /* Actual Data for CV2C      @D3A*/         
*                                                                               
*/********************************************************************/         
*/********************************************************************/         
*/**********           Application Data Vectors             *****@D2A*/         
*/********************************************************************/         
*/********************************************************************/         
*                                                                               
*/********************************************************************/         
*/*                  MNPS Application Recovery Data              @D2A*/         
*/********************************************************************/         
*                                                                               
*DCL                                                                            
*  1 XPLMRCV   DEFINED(XPLVEC_DAT), /* MNPS Application Recovery                
*                                      Data                      @D2A*/         
*    2 XPLMRCV_NAME   CHAR(8),      /* Application Name          @D2A*/         
*    2 XPLMRCV_SESSOK CHAR(4),      /* Number of sessions successfully          
*                                      recovered                 @D2A*/         
*    2 XPLMRCV_SESSAT CHAR(4),      /* Number of session recoveries             
*                                      attempted                 @D2A*/         
*    2 XPLMRCV_PIPEOK CHAR(4),      /* Number of HPR pipes successfully         
*                                      recovered                 @D2A*/         
*    2 XPLMRCV_PIPEAT CHAR(4),      /* Number of HPR pipe recoveries            
*                                      attempted                 @D2A*/         
*    2 XPLMRCV_RECTIM CHAR(8);      /* Total recovery time for                  
*                                      switching all the sessions and           
*                                      pipes                     @D2A*/         
*                                                                               
*/********************************************************************/         
*/*                    MNPS Application Data Vector                  */         
*/********************************************************************/         
*                                                                               
*DCL                                                                            
*  1 XPLMDTV   DEFINED(XPLVEC_DAT), /* MNPS Application Data     @D2A*/         
*    2 XPLMDTV_NAME   CHAR(8),      /* Application Name          @D2A*/         
*    2 XPLMDTV_STRUCT CHAR(16),     /* CFS structure name containing            
*                                      this application's data   @D2A*/         
*    2 XPLMDTV_NRWRIT CHAR(4) BDY(WORD), /* Number of CFS Writes for            
*                                      this application     @D2A @S1C*/         
*    2 XPLMDTV_NRBYTE CHAR(4);      /* Number of Bytes written to               
*                                      CFS for this application  @D2A*/         
*                                                                               
*/********************************************************************/         
*/********************************************************************/         
*/**********       Coupling Facility Data Vectors           *****@D2A*/         
*/********************************************************************/         
*/********************************************************************/         
*                                                                               
*/********************************************************************/         
*/*                MNPS Coupling Facility Vector                     */         
*/********************************************************************/         
*                                                                               
*DCL                                                                            
*  1 XPLCFMV   DEFINED(XPLVEC_DAT), /* MNPS Coupling Facility Data              
*                                                                @D2A*/         
*    2 XPLCFMV_NAME   CHAR(16),     /* Structure Name            @D2A*/         
*    2 XPLCFMV_SIZE   CHAR(4),      /* Size, in 1K blocks, of the               
*                                      structure                 @D2A*/         
*    2 XPLCFMV_PERCNT CHAR(1);      /* Percentage of 1K blocks in               
*                                      use                       @D2A*/         
*                                                                               
*/********************************************************************/         
*/*             Constants for Reason For Transmission            @L3A*/         
*/********************************************************************/         
*                                                                               
*DCL XPLTRAN_COLRQ BIT(8) CONSTANT('00'X), /* Monitor requested COLLECT         
*                                                                @L3A*/         
*    XPLTRAN_UNSOL BIT(8) CONSTANT('01'X), /* Unsolicited notification          
*                                                                @L3A*/         
*    XPLTRAN_SMFID BIT(8) CONSTANT('02'X), /* SMF Interval Data  @L3A*/         
*    XPLTRAN_SMFER BIT(8) CONSTANT('03'X); /* SMF Related Errors @L3A*/         
*                                                                               
*/********************************************************************/         
*/*             Constants for GLOBAL Data Vectors                    */         
*/********************************************************************/         
*                                                                               
*DCL XPLMAJ_GLOBAL BIT(16) CONSTANT('0001'X), /* Global Data         */         
*                                                                               
*    XPLGENVID BIT(48) CONSTANT('000100010001'X), /* Global                     
*                                        Environment Vector          */         
*    XPLGIEXID BIT(48) CONSTANT('000100020001'X), /* Global Inline              
*                                        Exit Vector                 */         
*    XPLGSBFID BIT(48) CONSTANT('000100030001'X), /* Global Storage             
*                                        Buffer Pool Vector          */         
*    XPLGSPSID BIT(48) CONSTANT('000100030002'X), /* Global Storage             
*                                        Private Storage Vector      */         
*    XPLGCSAID BIT(48) CONSTANT('000100030003'X), /* Global Storage             
*                                        CSA Vector                  */         
*    XPLGGBLID BIT(48) CONSTANT('000100030004'X), /* Global Storage             
*                                        GETBLK Vector               */         
*    XPLGSESID BIT(48) CONSTANT('000100040001'X), /* Global Session             
*                                        Vector                      */         
*    XPLGADSID BIT(48) CONSTANT('000100050001'X), /* Global APPN                
*                                        Directory Services Vector   */         
*    XPLGABNID BIT(48) CONSTANT('000100050002'X), /* Global APPN                
*                                        Directory Services Border Node         
*                                        Vector                  @L1A*/         
*    XPLGATPID BIT(48) CONSTANT('000100060001'X), /* Global APPN                
*                                        Topology Data vector        */         
*    XPLGCBFID BIT(48) CONSTANT('000100070001'X), /* Global CSM                 
*                                        Buffer Pool Vector      @D1A*/         
*    XPLGCSSID BIT(48) CONSTANT('000100070002'X); /* Global CSM                 
*                                        Storage Usage Vector    @D1C*/         
*                                                                               
*/********************************************************************/         
*/*             Constants for Virtual Route Data                     */         
*/********************************************************************/         
*                                                                               
*DCL XPLMAJ_VR BIT(16) CONSTANT('0002'X); /* Virtual Route Data      */         
*DCL XPLVBASID BIT(48) CONSTANT('000200010001'X); /* Basic Route     */         
*                                                                               
*/********************************************************************/         
*/*             Constants for RTP Data                           @D3A*/         
*/********************************************************************/         
*                                                                               
*DCL XPLMAJ_RTP BIT(16) CONSTANT('0003'X); /* RTP Data           @D3A*/         
*DCL XPL_RTP_BAS BIT(48) CONSTANT('000300010001'X); /* RTP Nums  @D3A*/         
*DCL XPL_RTP_RSC BIT(48) CONSTANT('000300010002'X); /* RTP RSCV  @D3A*/         
*DCL XPL_RTP_COS BIT(48) CONSTANT('000300010003'X); /* RTP COS   @D3A*/         
*                                                                               
*/********************************************************************/         
*/*             Constants for Application Data                   @D2A*/         
*/********************************************************************/         
*                                                                               
*DCL XPLMAJ_APP BIT(16) CONSTANT('0004'X); /* Application Data   @D2A*/         
*DCL XPL_APP_MRCID BIT(48) CONSTANT('000400010001'X); /* MNPS appl              
*                                        recovery data           @D2A*/         
*DCL XPL_APP_MDTID BIT(48) CONSTANT('000400010002'X); /* MNPS appl              
*                                        data                    @D2A*/         
*                                                                               
*/********************************************************************/         
*/*             Constants for Coupling Factility Data            @D2A*/         
*/********************************************************************/         
*                                                                               
*DCL XPLMAJ_CFS BIT(16) CONSTANT('0005'X); /* Coupling Facility Data            
*                                                                @D2A*/         
*DCL XPL_CFS_CFMID BIT(48) CONSTANT('000500010001'X); /* MNPS coupling          
*                                        facility data           @D2A*/         
*                                                                               
*/* End of PL/X Source                                               */         
