*/* Start of Specifications for ITTCTXI ******************************* 00027700
*                                                                       00055400
* $MAC(ITTCTXI) COMP(SCTRC) PROD(HBB7780):                              00055501
*                                                                       00110800
* MACRO NAME: ITTCTXI                                                   00152300
*                                                                       00193900
* DESCRIPTIVE-NAME: CTRACE Exit Interface                               00221600
*   ACRONYM: ITTCTXI                                                    00249300
*                                                                       00277000
* DSECT NAME: CTXI                                                      00313900
* COMPONENT: Component Trace (SCTRC)                                    00350800
*                                                                       00387800
* EYE CATCHER: CTXI                                                     00397000
*   OFFSET: 0                                                           00406200
*   LENGTH: 4                                                           00415400
*                                                                       00424600
* PROPRIETARY STATEMENT:                                                00433800
*                                                                       00443200
*   LICENSED MATERIALS - PROPERTY OF IBM                                00470900
*   5694-A01 COPYRIGHT IBM CORP. 1988, 2011                             00498701
*                                                                       00581700
* STATUS: HBB7780                                                       00581801
*                                                                       00597500
* EXTERNAL CLASSIFICATION:                                              00605400
* GUPI: BASE                                                            00613300
* DMTI: FIELDS CTXICNTL                                                 00621200
* END OF EXTERNAL CLASSIFICATION:                                       00629100
*                                                                       00637100
*                                                                       00664800
* FUNCTION:  Provide information to the exits called by the             00683200
* Component Trace IPCS CTRACE subcommand.                               00701600
*                                                                       00720200
* POINTED TO BY:   Passed as a parameter                                00734000
*                                                                       00747800
* CREATED BY:      CTRACE subcommand processor                          00761600
* INITIALIZED BY:  CTRACE subcommand processor                          00775400
* DELETED BY:      CTRACE subcommand processor                          00789200
*                                                                       00803300
*                                                                       00831000
* STORAGE ATTRIBUTES:                                                   00858700
*                                                                       00886400
*   FREQUENCY:       One per invocation of the CTRACE subcommand        00904800
*   VIRTUAL STORAGE: Private storage in IPCS users address space        00923200
*   KEY:             8                                                  00941600
*   SUBPOOL:         1                                                  00960000
*   SIZE:            80 bytes                                           00978400
*                                                                       00997200
*                                                                       01024900
* SERIALIZATION: None                                                   01052600
*                                                                       01080300
* METHOD OF ACCESS:                                                     01130300
*                                                                       01385000
*  PL/AS  --->  %INCLUDE SYSLIB(ITTCTXI)                                01412700
*                    SET %CTXISTORAGE to desired attributes,            01440400
*                      the default is BASED.                            01468100
*                                                                       01495800
*  BAL ------>  ITTCTXI                                                 01523500
*                                                                       01551200
* ===================================================================== 01567800
*                                                                       01584400
* CHANGE ACTIVITY:                                                      01601000
*                                                                       01617600
*   Line items=                                                         01634200
* $L1= JUP03  ,JBB3320,88117,PDE4: Ignore prior symbols                 01667400
*    = CTRCENH,HBB4410,890918,PDE4: MULTIPLE sub names                  01684000
*    = PROD520,HBB5520,940721,PD81ST: Copyright change                  01700600
* $L2= RSMCTRAC,HBB7780,100719,RSTLAK: N-Way RSM CTRACE Support         01700701
*                                                                       01717400
* --------------------------------------------------------------------- 01724300
*                                                                       01731200
*   Design changes=                                                     01738100
* $D0= DCR0258,HBB3310,87139,PDE4: CTRACE subcommand                    01745000
*                                                                       01751900
* --------------------------------------------------------------------- 01758800
*                                                                       01765700
*   PTMs=                                                               01772600
* $P1= PC41666,HBB3310,87306,PDE4: Include index into format table      01779500
*    = PEO3818,HBB4410,900402,PD34G1: Add USERDATA support.             01786400
* $P2= PH31695,HBB4420,901022,PD34EY: Update SNP/USRD comments          01793300
*    = PH32058,HBB4420,910104,PD34EY: SHOWHDR format complete           01800200
* $P3= PKB2961,HBB4430,920729,PD00G1: Document mapping of OPT area,     01807100
*      pointed to by CTXIOPT.                                           01814000
*    = PIG5012,HBB5520,940415,PD27ZI: CDPI for SHOWHDR                  01820900
* $P4= PYN0366,HBB7708,020522,PDE1: Supply address of format table to   01827800
*      exits, the one referenced by CTXITNX                             01832400
*    = PYN0457,HBB7708,020626,PDE1: Correct assembler syntax error      01837000
* $P5= PYN0459,HBB7708,020627,PDE1: Correct another                     01839300
*    = ME20738,HBB7780,110125,RSTLDK: Asset protection                  01839402
*                                                                       01841600
* --------------------------------------------------------------------- 01848500
*                                                                       01855900
*   Maintenance=                                                        01862800
* $01= OY67212,HBB3310,93273,PDXP: Declaration for CTXIUSRL should be   01869700
*      Full word in ASM                                                 01876600
*                                                                       01883600
* ===================================================================== 01911300
*                                                                       01939000
* MODULE TYPE:  Bilingual Macro                                         01966700
*                                                                       01994400
*   PROCESSOR:  ASSEM-PL/X                                              02022200
*                                                                       02050000
*** End of Specifications for ITTCTXI ********************************/ 02070000
*                                                                       02090000
*   %GOTO ITTCTXI;                                                      02110000
*                                                                       02130000
*/*                                                                     02150000
         MACRO                                                          02200000
         ITTCTXI ,                                                      02250000
         IEZBITS ,               Define symbolic bits                   02300000
CTXI     DSECT ,       Component Trace Exit Interface Block             02350000
CTXIID   DS    0CL5    CTXI identifier and level                        02400000
CTXIIDC  DC    CL4'CTXI' CTXI identifier constant                       02450000
CTXILVL  DC    CL1'1'  CTXI level                                       02500000
CTXIFLGS DC    B'00000000' Processing flags                             02550000
CTXIDONE EQU   BIT0    All entries have been processed. The user exit   02600000
*                      has this opportunity to complete report          02650000
*                      generation, tabulate results and free storage.   02700000
CTXICMPL EQU   BIT1    The buffer described is complete (copied), and   02750000
*                      is not wrapped                                   02800000
CTXIIGSY EQU   BIT2    Ignore existing buffer definition symbols,       02816600
*                      component dependent options determine       @L1A 02833300
         DC    XL2'00' Reserved                                         02850000
CTXIUSWA DC    A(0)    Address of a 4K user work area. Zeroed and       02900000
*                      reused by FIND and FILTER functions              02950000
CTXIUSER DC    A(0)    A field that may be used to anchor storage       03000000
*                      GETMAINED by an exit program.                    03050000
CTXIUSRL DC    F'0'    Length of storage got by exit               @01C 03100000
CTXICOMP DC    CL8' '  The name of the component which produced the     03150000
*                      CTE                                              03200000
CTXICNTL DC    A(0)    The address of the component trace control       03250000
*                      area. See ITTCNTL for details.                   03300000
CTXIOPT  DC    A(0)    The address of a buffer containing the OPTIONS   03350000
*                      specified on the CTRACE command. These are       03400000
*                      component specific options.                      03450000
*                      The mapping for this buffer is equivalent to     03460000
*                      the "options list header" in the CTSS.  See the  03470000
*                      CTSSOPTL DSECT in the ITTCTSS macro for the      03480000
*                      mapping.                                    @P3C 03490000
CTXIESR  DC    A(0)    The address of an Equate Symbol Record to be     03500000
*                      filled in by the component exit. This describes  03550000
*                      a buffer containing trace entries to be          03600000
*                      processed.                                       03650000
CTXICTE  DC    A(0)    The address of an Component Trace Entry (CTE)    03700000
*                      currently being formatted                        03750000
CTXIFMP  DC    A(0)    The address of an initialized format parameter   03800000
CTXITNX  DC    F'0'    Index into format table                     @P1A 03825000
CTXISNP  DC    A(0)    -> ITTSTAB structure                        @P2C 03830000
CTXIUSRD DC    XL16'00' User data from CTRACE DEFINE or CTSSUSRD   @P2C 03835000
CTXIFMTB DC    A(0)    Address of sorted format table              @P5C 03840000
CTXICPU  DC    XL2'00' CPU to get trace data for                   @L2A 03850001
         DC    XL2'00' Reserved                                    @L2C 03850101
CTXIEND  DS    0F      End of CTXI                                      03850200
         MEND  ,                                                     */ 03900000
*                                                                       04000000
*%ITTCTXI:                                                              04050000
*   IF CTXISTORAGE = ''                                                 04083300
*      %THEN                                                            04116600
*     %CTXISTORAGE = 'BASED';       /* Default attribute             */ 04150000
*   DECLARE                                                             04200000
*     1    CTXI     CTXISTORAGE BDY(WORD), /* Component Trace Exit      04250000
*                                      Interface Block               */ 04300000
*      2    CTXIID   CHAR(5),       /* CTXI identifier and level     */ 04350000
*       3    CTXIIDC  CHAR(4),      /* CTXI identifier constant      */ 04400000
*       3    CTXILVL  CHAR(1),      /* CTXI level                    */ 04450000
*      2    CTXIFLGS BIT(24),       /* Processing flags              */ 04500000
*       3    CTXIDONE BIT(1),       /* All entries have been            04550000
*                                      processed. The user exit has     04600000
*                                      this opportunity to complete     04650000
*                                      report generation, tabulate      04700000
*                                      results and free storage.     */ 04750000
*       3    CTXICMPL BIT(1),       /* The buffer described is          04800000
*                                      complete (copied), and is not    04850000
*                                      wrapped                       */ 04900000
*       3    CTXIIGSY BIT(1),       /* Ignore existing buffer           04910000
*                                      definition symbols, component    04920000
*                                      dependent options determine      04930000
*                                                                @L1A*/ 04940000
*       3    CTXILocBufByCPU Bit(1), /* If set, assume that CTRACE      04950001
*                                       data is seperated by CPUs.      04960001
*                                       Default is that all CPUs        04970001
*                                       are lumped together      @L2A*/ 04970101
*      2    CTXIUSWA PTR(31),       /* Address of a 4K user work        04970200
*                                      area. Zeroed and reused by       05000000
*                                      FIND and FILTER functions     */ 05050000
*      2    CTXIUSER PTR(31),       /* A field that may be used to      05100000
*                                      anchor storage GETMAINED by an   05150000
*                                      exit program.                 */ 05200000
*      2    CTXIUSRL FIXED(31),     /* Length of storage got by exit */ 05250000
*      2    CTXICOMP CHAR(8),       /* The name of the component        05300000
*                                      which produced the CTE        */ 05350000
*      2    CTXICNTL PTR(31),       /* The address of the component     05400000
*                                      trace control area. See          05450000
*                                      ITTCNTL for details.          */ 05500000
*      2    CTXIOPT  PTR(31),       /* The address of a buffer          05550000
*                                      containing the OPTIONS           05600000
*                                      specified on the CTRACE          05650000
*                                      command. These are component     05700000
*                                      specific options. The mapping    05715000
*                                      for this buffer is equivalent    05730000
*                                      to the "options list header"     05745000
*                                      in the CTSS. See the CTSSOPTL    05760000
*                                      DECLARE in the ITTCTSS macro     05775000
*                                      for the mapping.          @P3C*/ 05796800
*      2    CTXIESR  PTR(31),       /* The address of an Equate         05818700
*                                      Symbol Record to be filled in    05850000
*                                      by the component exit. This      05900000
*                                      descibes a buffer containing     05950000
*                                      trace entries to be processed.*/ 06000000
*      2    CTXICTE  PTR(31),       /* The address of an Component      06050000
*                                      Trace Entry (CTE) currently      06100000
*                                      being formatted               */ 06150000
*      2    CTXIFMP  PTR(31),       /* The address of an initialized    06200000
*                                      format parameter              */ 06250000
*      2    CTXITNX  FIXED(31),     /* Index into format table   @P1A*/ 06300000
*      2    CTXISNP  PTR(31),       /* -> ITTSTAB structure      @P2C*/ 06350000
*      2    CTXIUSRD CHAR(16),      /* User data from CTRACE DEFINE     06400000
*                                      or CTSSUSRD               @P2C*/ 06450000
*      2    CTXIFMTB PTR(31),       /* -> Sorted format table    @P4A*/ 06500000
*      2    CTXICPU  FIXED(16),     /* CPU to get trace data for @L2A*/ 06510001
*      2    *        CHAR(2),       /* Reserved                  @L2C*/ 06520001
*      2    CTXIEND  CHAR(0),       /* End of CTXI                   */ 06600000
*     CTXIIDCC CHAR(5) CONSTANT('CTXI1'); /* Block ident, level      */ 06650000
