*/********************************************************************/         
*/*                                                                  */         
*/*  MACRO-NAME: IVTBFL64                                            */         
*/*                                                                  */         
*/*  MACRO-DESCRIPTIVE-NAME: CSM Buffer Descriptor Mapping used      */         
*/*                          by programs running 64-bit addressing   */         
*/*                          mode.                                   */         
*/*                                                                  */         
*/*                                                                  */         
*/*  COPYRIGHT = Licensed Materials - Property of IBM                */         
*/*                                                                  */         
*/*              "Restricted Materials of IBM"                       */         
*/*                                                                  */         
*/*              5650-ZOS                                            */         
*/*                                                                  */         
*/*              Copyright IBM Corp. 2015                            */         
*/*                                                                  */         
*/*              Status = CSV2R2                                     */         
*/*                                                                  */         
*/*              All Rights Reserved.                                */         
*/*                                                                  */         
*/*              U.S. Government Users Restricted Rights -           */         
*/*              Use, Duplication or Disclosure Restricted           */         
*/*              by GSA ADP Schedule Contract with IBM Corp.         */         
*/*                                                                  */         
*/*              See Copyright Instructions.                         */         
*/*                                                                  */         
*/*  MACRO-FUNCTION: To provide a mapping for the CSM Buffer         */         
*/*                  Descriptor used on IVTCSM requests              */         
*/*                  issued by programs running in 64-bit            */         
*/*                  addressing mode.                                */         
*/*                                                                  */         
*/*  MACRO-NOTES:  None                                              */         
*/*                                                                  */         
*/*  $MAC(IVTBFL64),COMP(CSM),PROD(VTAM): CSM Buffer Descriptor      */         
*/*                                       for 64-bit addressing mode */         
*/*                                                                  */         
*/*  FLAG REASON   RELEASE DATE   ORIGIN  FLAG DESCRIPTORS           */         
*/*  ---- -------- ------- ------ ------  ---------------------      */         
*/*  $V0= REPRF64B CSV2R1  120807 HARISHS : 64-Bit addr support      */         
*/*  $31= 19016    RFBASE  131210 HARISHS : 64-Bit indicator         */         
*/*                                                                  */         
*/*  Note: Any changes to this file should be duplicated in the      */         
*/*        file ivtbfl64.h in both SNA and IP releases.              */         
*/*        IVTBFl64 must start at the double word boundary.          */         
*/*        The length of IVTBFL64 must be on double word boundary.   */         
*/********************************************************************/         
*@LISTPUSH;                         /*                               */         
*@LISTOFF;                          /*                               */         
*                                   /* Bilingual header                         
         MACRO                                                                  
         IVTBFL64                                                               
IVTBFL64 DSECT 0D                      Buffer Descriptor                        
BFL64_BUFL     DS    1CL28             Length of ivtbufl                        
               ORG   BFL64_BUFL                                                 
               DS    X                 Version of buffer descriptor             
               DS    X                 Buffer source                            
BUFL_HVCOMM    EQU   X'08'             Indicates that the storage               
*                                      is in a HVCOMM                           
               DS    X                 Buffer type               @31A           
BUFL_FLAGS     DS    X                 Buffer flags              @31A           
BUFL_BUFLST64  EQU   X'80'             64-bit buffer list entry  @31A           
               DS    1CL12             Reserved - Next twelve                   
*                                      bytes of ivtbufl          @31C           
BUFL_ADDR64    DS    AD                64-bit buffer addr                       
               DS    1CL4              Reserved - Last four bytes               
*                                      of ivtbufl                               
               DS    1CL4              Reserved                                 
BFL64_END      DS    0D                End of IVTBFL64                          
         MEND                                                        */         
*@LISTPOP;                          /* Begin PL/X mapping            */         
*                                                                               
*   DCL                                                                         
*     1 IVTBFL64 BDY(DWORD) BASED,  /* Buffer descriptor             */         
*      2 BFL64_BUFL CHAR(LENGTH(IVTBUFL)) BDY(DWORD), /* IVTBUFL     */         
*        3 *        CHAR(3),        /* Reserved - First three bytes             
*                                      of ivtbufl                @31A*/         
*        3 BUFL_FLAGS FIXED(8),     /* Flag byte                 @31A*/         
*          4 BUFL_BUFLST64 BIT(1),  /* 64-bit buffer list entry  @31A*/         
*          4 *             BIT(7),  /* Not used, available       @31A*/         
*        3 *        CHAR(12),       /* Reserved - Skip twelve                   
*                                      bytes of ivtbufl          @31C*/         
*        3 BUFL_ADDR64 PTR(64) BDY(DWORD), /* 64-bit buffer addr     */         
*        3 *        CHAR(4),        /* Reserved - Last four bytes               
*                                      of ivtbufl                    */         
*      2 *          CHAR(4),        /* Reserved                      */         
*      2 BFL64_END  CHAR(0) BDY(DWORD); /* End of control block      */         
*/********************************************************************/         
*/* VALUES FOR BUFL_SOURCE for 64-bit storage                        */         
*/********************************************************************/         
*DCL BUFL_HVCOMM FIXED(8) CONSTANT(8); /* Indicates that the storage            
*                                      is in a HVCOMM                */         
*DCL BUFL_U64BSTOR FIXED(8) CONSTANT(4); /* Indicates an user 64-bit            
*                                      storage                       */         
