*/********************************************************************/         
*/*                                                                  */         
*/*  MACRO-NAME: IVTDATSP                                            */         
*/*                                                                  */         
*/*  MACRO-DESCRIPTIVE-NAME: CSM DATA SPACE INFORMATION              */         
*/*                                                                  */         
*/*  COPYRIGHT:    LICENSED MATERIALS - PROPERTY OF IBM              */         
*/*                                                                  */         
*/*                "RESTRICTED MATERIALS OF IBM"                     */         
*/*                                                                  */         
*/*                5694-A01                                          */         
*/*                                                                  */         
*/*                (C) COPYRIGHT IBM CORP. 1996, 2003                */         
*/*                                                                  */         
*/*                                                                  */         
*/*  STATUS:       CSV1R5                                            */         
*/*                                                                  */         
*/*  MACRO-FUNCTION: TO PROVIDE A MAPPING FOR THE CSM DATA SPACE     */         
*/*                  INFORMATION REQUIRED TO DUMP CSM DATA SPACES.   */         
*/*                  AN ADDRESS TO THIS INFORMATION IS RETURNED      */         
*/*                  FOR A IVTCSM DUMP_INFO REQUEST.                 */         
*/*                                                                  */         
*/*  MACRO-NOTES:  NONE                                              */         
*/*                                                                  */         
*/*  $MAC(IVTDATSP),COMP(CSM),PROD(VTAM): CSM DATA SPACE INFORMATION */         
*/*                                                                  */         
*/*  FLAG REASON   RELEASE DATE   ORIGIN  FLAG DESCRIPTORS           */         
*/*  ---- -------- ------- ------ ------  ---------------------      */         
*/*  $D0= ID@@@MST FPAPI   950206 143576: Fastpath API for APPC      */         
*/*  $S1= P119993  FPAPI   951213 143576: Add eyecatcher             */         
*/*                                                                  */         
*/*  Flag Reason   Release  Date   Origin    Description             */         
*/*  ---- -------- -------- ------ --------  ----------------------- */         
*/*  $A1= OW54223  CSV1R5   020520 JPERKINS: Updated the comment of  */         
*/*                                          DATSP_SLEN              */         
*/*                                                                  */         
*/********************************************************************/         
*@LISTPUSH;                         /*                               */         
*@LISTOFF;                          /*                               */         
*                                   /* BILINGUAL HEADER                         
         MACRO                                                                  
         IVTDATSP                                                               
IVTDATSP DSECT                         CSM DATA SPACE INFORMATION               
DATSP_ACRO DS    CL4                   Eyecatcher 'DATS'         @S1A           
DATSP_SNUM DS    F                     NUMBER OF DATA SPACES                    
DATSP_SLEN DS    F                     Total length of all data space           
*                                      information entries       @A1C           
DATSP_SINF DS    5XL20                 CONTAINS ALL THE DATA SPACE              
*                                        INFORMATION ENTRIES.  THESE            
*                                        ENTRIES ARE MAPPED BY THE              
*                                        DATSP_ENT DSECT.                       
*                                        THERE WILL BE ONE ENTRY FOR            
*                                        EACH DATA SPACE INDICATED BY           
*                                        DATSP_SNUM, AND EACH ENTRY             
*                                        MUST BE SEPARATELY MAPPED BY           
*                                        THE DATSP_ENT DSECT.                   
DATSP_ENT  DSECT                       DATA SPACE INFORMATION ENTRY             
DATSP_TOKN DS    XL8                   STOKEN FOR THE DATA SPACE                
DATSP_NAME DS    XL8                   DATA SPACE NAME                          
DATSP_ALET DS    F                     ALET FOR THE DATA SPACE                  
         MEND                                                        */         
*@LISTPOP;                          /* BEGIN PL/X MAPPING            */         
*                                                                               
*   DCL                                                                         
*     1 IVTDATSP BDY(WORD) BASED,   /* CSM DATA SPACE INFORMATION    */         
*      2 DATSP_ACRO CHAR(4),        /* Eyecatcher 'DATS'         @S1A*/         
*      2 DATSP_SNUM FIXED(31),      /* NUMBER OF DATA SPACES         */         
*      2 DATSP_SLEN FIXED(31),      /* Total length of all data space           
*                                      information entries       @A1C*/         
*      2 DATSP_SINF(5) CHAR(LENGTH(DATSP_ENT));                                 
*                                   /* CONTAINS ALL DATA SPACE                  
*                                      INFORMATION ENTRIES.  THESE              
*                                      ENTRIES ARE MAPPED BY THE                
*                                      DATSP_ENT DSECT.                         
*                                      THERE WILL BE ONE ENTRY FOR              
*                                      EACH DATA SPACE INDICATED BY             
*                                      DATSP_SNUM, AND EACH ENTRY MUST          
*                                      BE SEPARATELY MAPPED BY THE              
*                                      DATSP_ENT DSECT.              */         
*   DCL                                                                         
*     1 DATSP_ENT BASED,            /* DATA SPACE INFORMATION ENTRY  */         
*      2 DATSP_TOKN CHAR(8),        /* STOKEN FOR THE DATA SPACE     */         
*      2 DATSP_NAME CHAR(8),        /* DATA SPACE NAME               */         
*      2 DATSP_ALET FIXED(31);      /* ALET FOR THE DATA SPACE       */         
