*/********************************************************************/         
*/*                                                                  */         
*/*  MACRO-NAME: IVTSTATA                                            */         
*/*                                                                  */         
*/*  MACRO-DESCRIPTIVE-NAME: CSM RESOURCE STATUS AREA MAPPING        */         
*/*                                                                  */         
*/*  COPYRIGHT = Restricted Materials of IBM                         */         
*/*                                                                  */         
*/*              Licensed Materials - Property of IBM                */         
*/*              5650-ZOS Copyright IBM Corp. 1996,  2019            */         
*/*              Status = CSV2R4                                     */         
*/*                                                              @31C*/         
*/*              U.S. GOVERNMENT USERS RESTRICTED RIGHTS -           */         
*/*              USE, DUPLICATION OR DISCLOSURE RESTRICTED           */         
*/*              BY GSA ADP SCHEDULE CONTRACT WITH IBM CORP.         */         
*/*                                                                  */         
*/*              SEE COPYRIGHT INSTRUCTIONS.                         */         
*/*                                                                  */         
*/*  MACRO-FUNCTION: TO PROVIDE A MAPPING FOR THE AREA POINTED TO    */         
*/*                  BY THE STATAREA PARAMETER ON AN IVTCSM          */         
*/*                  RESOURCE_STATS REQUEST.                         */         
*/*                                                                  */         
*/*  MACRO-NOTES:  NONE                                              */         
*/*                                                                  */         
*/*  $MAC(IVTSTATA),COMP(CSM),PROD(VTAM): CSM RESOURCE STATUS AREA   */         
*/*                                                                  */         
*/*  FLAG REASON   RELEASE DATE   ORIGIN  FLAG DESCRIPTORS           */         
*/*  ---- -------- ------- ------ ------  ---------------------      */         
*/*  $D0= ID@@@MST FPAPI   950206 143576: Fastpath API for APPC      */         
*/*  $S1= P119992  FPAPI   951213 143576: Add eyecatcher             */         
*/*  $S2= P120325  FPAPI   951215 984146: Storage constraint DR      */         
*/*                                                                  */         
*/* FLAG REASON   RELEASE DATE   ORIGIN   FLAG DESCRIPTORS           */         
*/* ---- -------- ------- ------ ------   -------------------------- */         
*/* $Q1= R16CSM   CSV1R5  021104 HARISHS: CSM Monitor indicator      */         
*/* $31= RFN64BIT CSV2R2  130516 HARISHS: Enable HVCOMM support      */         
*/* $A1= OA54110  HVT6220 171011 HARISHS: CSM storage fragmentation  */         
*/*                                                                  */         
*/********************************************************************/         
*@LISTPUSH;                         /*                               */         
*@LISTOFF;                          /*                               */         
*                                   /* Bilingual header                         
         MACRO                                                                  
         IVTSTATA                                                               
IVTSTATA DSECT                         CSM resource status area                 
STATA_ACRO  DS    CL4                  Eyecatcher 'STAT'         @S1A           
STATA_WORD  DS    0CL4                 Status word               @Q1A           
STATA_LEN   DS    XL2                  Number of bytes of resource              
*                                        statistics                             
STATA_FLAG  DS    X                    Status flag                              
STATA_ESTAT EQU   X'C0'                ECSA storage status                      
STATA_ECRIT EQU   X'80'                ECSA storage critical                    
STATA_ECONS EQU   X'40'                ECSA storage constrained                 
*                                                                               
STATA_DSTAT EQU   X'30'                Data space storage status                
STATA_DCRIT EQU   X'20'                Data space storage                       
*                                      critical                                 
STATA_DCONS EQU   X'10'                Data space storage                       
*                                      constrained                              
*                                                                               
STATA_FSTAT EQU   X'0C'                Fixed storage status                     
STATA_FCRIT EQU   X'08'                Fixed storage critical                   
STATA_FCONS EQU   X'04'                Fixed storage constrained                
STATA_HSTAT EQU   X'03'                HVCOMM storage status     @31A           
STATA_HCRIT EQU   X'02'                HVCOMM storage critical   @31A           
STATA_HCONS EQU   X'01'                HVCOMM storage constrained@31A           
STATA_FLAG2 DS    X                    Misc - Flags              @Q1C           
STATA_MONITOR EQU X'80'                CSM Monitor active        @Q1A           
STATA_STOFRAG EQU X'40'                CSM storage fragmentation @A1A           
         MEND                                                        */         
*@LISTPOP;                          /* Begin PL/X mapping            */         
*                                                                               
*   DCL                                                                         
*     1 IVTSTATA BDY(WORD) BASED,   /* CSM resource status area      */         
*      2 STATA_ACRO CHAR(4),        /* Eyecatcher 'STAT'         @S1A*/         
*      2 STATA_WORD CHAR(4) BDY(WORD), /* Status word            @Q1A*/         
*        3 STATA_LEN FIXED(15),     /* Number of bytes of resource              
*                                      statistics                @Q1C*/         
*        3 STATA_FLAG  BIT(8),      /* Status flag               @Q1C*/         
*          4 STATA_ESTAT BIT(2),    /* ECSA storage status       @Q1C*/         
*            5 STATA_ECRIT BIT(1) ABNL, /* ECSA storage critical @S2C           
*                                                                @Q1C*/         
*            5 STATA_ECONS BIT(1) ABNL, /* ECSA storage constrained             
*                                                           @S2C @Q1C*/         
*          4 STATA_DSTAT BIT(2),    /* Data space storage status @Q1C*/         
*            5 STATA_DCRIT BIT(1),  /* Data space storage critical              
*                                                                @Q1C*/         
*            5 STATA_DCONS BIT(1),  /* Data space storage constrained           
*                                                                @Q1C*/         
*          4 STATA_FSTAT BIT(2),    /* Fixed storage status      @Q1C*/         
*            5 STATA_FCRIT BIT(1) ABNL, /* Fixed storage critical               
*                                                           @S2C @Q1C*/         
*            5 STATA_FCONS BIT(1) ABNL, /* Fixed storage constrained            
*                                                           @S2C @Q1C*/         
*          4 STATA_HSTAT   BIT(2),  /* HVCOMM storage status                    
*                                                           @Q1C @31C*/         
*            5 STATA_HCRIT BIT(1) ABNL, /* HVCOMM storage critical              
*                                                                @31A*/         
*            5 STATA_HCONS BIT(1) ABNL, /* HVCOMM storage constrained           
*                                                                @31A*/         
*        3 STATA_FLAG2 BIT(8),      /* Misc - Flags              @Q1C*/         
*          4 STATA_MONITOR BIT(1) ABNL, /* CSM Monitor active    @Q1A*/         
*          4 STATA_STOFRAG BIT(1) ABNL, /* CSM storage fragmentation            
*                                                                @A1A*/         
*          4 *           BIT(6);    /* Not used - Available @Q1A @A1C*/         
