*                                                                       00001000
* %DCL IWMECD_INCLUDED CHAR EXT;                                        00002000
* %DEACTIVATE IWMECD_INCLUDED;                                          00003000
* %IF IWMECD_INCLUDED = '' %THEN                                        00004000
* %DO;                                                                  00005000
*%/* Start of PL/X PreProlog Code */;                                   00006000
*/* Update rules:                                                   */  00007000
*/*   - Note, this is a CBGEN macro. This means, only the PLX       */  00008000
*/*           version needs to be updated.                          */  00009000
*/*   - Run CBGEN after updating                                    */  00010000
*/*   - With OA31910, this macro is stabilized. New development     */  00011000
*/*          will only be done to macro IWMECDX.                    */  00012000
*%/* End of PL/X PreProlog Code */;                                     00013000
*/* Macro made bi-lingual on 10336. CBGEN compile date 09235         */ 00014000
*% /*                                                                   00015000
         MACRO                                                          00016000
         IWMECD &DSECT=YES,&LIST=YES,&TITLE=YES,&ECD=YES                00017000
         GBLC  &IWMECD_INCLUDED                                         00018000
         GBLC  &ZCBPRINT                                                00019000
&IWMECD_INCLUDED SETC 'YES'                                             00020000
         AIF   ('&LIST' EQ 'NONE').P0                                   00021000
         AIF   ('&TITLE' EQ 'NO').P5                                    00022000
 TITLE   'IWMECD  - Enclave Classification Data Mapping                *00023000
               '                                                        00024000
.P5      ANOP                                                           00025000
**/ IWMECD_1:;                                                          00026000
*/* START OF SPECIFICATIONS ******************************************* 00027000
*                                                                       00028000
* ***PROPRIETARY_STATEMENT********************************************* 00029000
***01* PROPRIETARY STATEMENT=                                         * 00030000
*                                                                     * 00031000
*                                                                     * 00032000
*   LICENSED MATERIALS - PROPERTY OF IBM                              * 00033000
*   5647-A01     COPYRIGHT IBM CORP. 1999, 2000                       * 00034000
*                                                                     * 00035000
*   STATUS= HBB7703                                                   * 00036000
*                                                                     * 00037000
*  **END_OF_PROPRIETARY_STATEMENT*************************************/ 00038000
*/*                                                                     00039000
* EXTERNAL CLASSIFICATION: GUPI                                         00040000
* END OF EXTERNAL CLASSIFICATION                                        00041000
*                                                                       00042000
* MACRO NAME: IWMECD                                                    00043000
*                                                                       00044000
* DESCRIPTIVE NAME: Enclave Classification Data Mapping                 00045000
*                                                                       00046000
* FUNCTION: Provides a mapping of the classification data returned      00047000
*           from the IWMECQRY service.                                  00048000
*                                                                       00049000
* METHOD-OF-ACCESS:                                                     00050000
*                                                                       00051000
*   PLAS: %INCLUDE SYSLIB(IWMECD)                                       00052000
*   ASM:  IWMECD                                                        00053000
*                                                                       00054000
* POINTED-TO-BY: N/A                                                    00055000
*                                                                       00056000
* CREATED-BY: N/A                                                       00057000
*                                                                       00058000
* DELETED-BY: N/A                                                       00059000
*                                                                       00060000
* STORAGE-ATTRIBUTES: N/A                                               00061000
*                                                                       00062000
*   ALLOCATION-METHOD: N/A                                              00063000
*                                                                       00064000
*   SUBPOOL/DATASPACE: N/A                                              00065000
*                                                                       00066000
*   KEY: N/A                                                            00067000
*                                                                       00068000
*   FREQUENCY: N/A                                                      00069000
*                                                                       00070000
* DSECT NAME: ECD                                                @P1C   00071000
*                                                                       00072000
* EYE CATCHER: NONE                                                     00073000
* OFFSET: N/A                                                           00074000
* LENGTH: N/A                                                           00075000
*                                                                       00076000
* SIZE: See assembler listing                                           00077000
*             ECD -- X'0270' bytes                                   51 00078000
*                                                                       00079000
* COMPONENT: Workload Manager (SCWLM)                                   00080000
*                                                                       00081000
* SERIALIZATION: N/A                                                    00082000
*                                                                       00083000
* DEPENDENCIES: N/A                                                     00084000
*                                                                       00085000
* NOTES: RMF and DB2 must be notified of changes to this macro.@WLMPBAT 00086000
*                                                                       00087000
* CHANGE-ACTIVITY:                                                      00088000
*   $L0=ENCLV    HBB5520  940310  PDD0:  Enclave support                00089000
*   $P1=PN71675  HBB5520  941020  PDD0:  Fillin DSECT name              00090000
*   $XVS WLMPENH HBB6603  950605  PDBB:  John Arwe                      00091000
*                                        Add procedure name, perform    00092000
*   $WLMPENH     HBB6603  951101  PDKN:  Kin Ng - New classification    00093000
*                                        attributes                     00094000
*   $WLMPBAT     JBB6604  960924  B9HAGD: Greg Dritschler               00095000
*                                         Classify by priority          00096000
*   $WLMPMQS     JBB6607  980410  B9HARF: Rich Fine                     00097000
*                                         Classify by process name      00098000
*                                                              @WLMPMQS 00099000
*   $OW42751     HBB7703  000608  B9HASN: Sue Norton                    00100000
*                                         Fix odd length of x'249'.     00101000
*                                         Always return a multiple of   00102000
*                                         8 bytes for the length.       00103000
*                                                              @OW42751 00104000
*   $WLMPGMY     HBB7703  000328  3241MO: Michael Ostmeyer     @OW43813 00105000
*                                         Classify by system name       00106000
*   $PYD0411     HBB7703  000917  3241MO: Michael Ostmeyer     @OW43813 00107000
*                                         Add reserved fields and move  00108000
*                                         classification field to       00109000
*                                         version 5 section             00110000
*                                                                       00111000
*END OF SPECIFICATIONS ***********************************************/ 00112000
*% /*                                                                   00113000
.P0      ANOP                                                           00114000
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 00115000
         AIF   ('&LIST' EQ 'YES').P2                                    00116000
.P1      ANOP                                                           00117000
         PUSH  PRINT                                                    00118000
         PRINT OFF                                                      00119000
.P2      ANOP                                                           00120000
         AIF   ('&ECD' EQ 'NO').L0002                                   00121000
         AIF   ('&DSECT' EQ 'YES').L0003                                00122000
         AIF   ('&ECD' NE 'YES').L0002                                  00123000
ECD      DS    0D                                                       00124000
         AGO   .L0004                                                   00125000
.L0003   ANOP                                                           00126000
ECD      DSECT                                                          00127000
.L0004   ANOP                                                           00128000
ECD_LENGTH_FIELDS DS 0CL4                                               00129000
ECDCLLL  DS    X         Collection length                              00130000
ECDCORL  DS    X         Correlation length                             00131000
ECDSSPL  DS    X         Subsystem Parameter length                     00132000
ECDACCL  DS    X         Account Information length                     00133000
ECD_CHAR_FIELD1 DS 0CL94                                                00134000
ECDTRXN  DS    CL8       Transaction program name                       00135000
ECDUSER  DS    CL8       Userid                                         00136000
ECDTRXC  DS    CL8       Transaction class                              00137000
ECDNET   DS    CL8       Network ID                                     00138000
ECDLU    DS    CL8       Logical Unit name                              00139000
ECDPLAN  DS    CL8       Plan                                           00140000
ECDPCKG  DS    CL8       Package                                        00141000
ECDCNCTN DS    CL8       Connection                                     00142000
ECDCOLL  DS    CL18      Collection                                     00143000
ECDCORR  DS    CL12      Correlation                                    00144000
ECD_CHAR_FIELD2 DS 0CL20                                                00145000
ECDSUBT  DS    CL4       Subsystem Type                                 00146000
ECDFCN   DS    CL8       Function Name                                  00147000
ECDSUBN  DS    CL8       Subsystem Name                                 00148000
ECD_CHAR_FIELD3 DS 0CL398                                               00149000
ECDSSPM  DS    CL255     Subsystem Parameter                            00150000
ECDACCT  DS    CL143     Account Information                            00151000
ECD_VERSION DS X         Version                                        00152000
ECD_PROCEDURENAME DS CL18 Proc name                                     00153000
         DS    X         Reserved This is a doubleword boundary         00154000
ECD_LENGTH DS  H         Length                                         00155000
ECD_PERFORM DS CL8       Perform= value, EBCDIC format                  00156000
ECD_PROCNAME_LEN DS X    Procedure name length                          00157000
         DS    CL1       Reserved                                       00158000
ECD_END_VERSION1 DS 0CL4 End of version 1 answer area                   00159000
ECD_PRIORITY DS F        Subsystem priority in binary format. Contains *00160000
                         hexadecimal 80000000 if the subsystem did not *00161000
                         provide a priority.                            00162000
ECD_END_VERSION2 DS 0C   End of version 2 answer area                   00163000
ECD_START_VERSION3 DS 0CL33 Start of version 3 answer area              00164000
ECD_PROCESSNAME DS CL32  Process name                                   00165000
ECD_PROCESSNAME_LEN DS X Process name length                            00166000
ECD_END_VERSION3 DS 0C   End of version 3 answer area                   00167000
         DS    CL7       Reserved, to insure dword BDY IN ASSEMBLER     00168000
ECD_START_VERSION4 DS 0C Version 4. Force double word boundry for      *00169000
                         future versions.                               00170000
ECD_END_VERSION4 DS 0C   End of version 4 answer area                   00171000
ECD_START_VERSION5 DS 0CL32 Start of Version 5. Force double word      *00172000
                         boundry for future versions.                   00173000
ECD_SCHEDULINGENVIRONMENT DS CL16                                       00174000
ECD_SCHEDULINGENVIRONMENT_LEN DS X                                      00175000
ECD_SUBSYSTEMCOLLECTIONNAME DS CL8                                      00176000
         DS    CL7       Reserved                                       00177000
ECD_END_VERSION5 DS 0C   End of version 5 answer area                   00178000
ECD_VERSION1 EQU 1       ECD version 1                                  00179000
ECD_VERSION2 EQU 2       ECD version 2                                  00180000
ECD_VERSION3 EQU 3       ECD version 3                                  00181000
ECD_VERSION4 EQU 4       ECD version 4                                  00182000
ECD_VERSION5 EQU 5       ECD version 5                                  00183000
ECD_VERSION_LATEST EQU 5 ECD version W2EQY                              00184000
ECD_VERSION1_LEN EQU 548 Length of version 1 ECD                        00185000
ECD_VERSION2_LEN EQU 552 Length of version 2 ECD                        00186000
ECD_VERSION3_LEN EQU 585 Length of version 3 ECD                        00187000
ECD_VERSION4_LEN EQU 592 Length of version 4 ECD                        00188000
ECD_VERSION5_LEN EQU 624 Length of version 5 ECD                        00189000
ECD_LEN  EQU   *-ECD                                                    00190000
.L0002   ANOP                                                           00191000
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 00192000
         AIF   ('&LIST' EQ 'YES').P4                                    00193000
.P3      ANOP                                                           00194000
         POP   PRINT                                                    00195000
.P4      ANOP                                                           00196000
.P_EXIT  ANOP                                                           00197000
         MEND                                                           00198000
**/ IWMECD_2:;                                                          00199000
* %IWMECD_INCLUDED = 'YES';                                             00200000
* %DCL ZCBPRINT CHAR EXT;                                               00201000
* %DEACTIVATE ZCBPRINT;                                                 00202000
* %DCL IWMECD_LIST CHAR EXT;                                            00203000
* %DEACTIVATE IWMECD_LIST;                                              00204000
* %IF IWMECD_LIST ^= 'NO' &                                             00205000
*    ZCBPRINT ^= 'NO' %THEN                                             00206000
*   %GOTO IWMECD_3;                                                     00207000
*   @LIST PUSH NOECHO;                                                  00208000
*   @LIST NOASSEMBLE NOECHO;                                            00209000
*   @LIST OFF C NOECHO;                                                 00210000
* %IWMECD_3:;                                                           00211000
*/* Start of PL/X Source                                             */ 00212000
*                                                                       00213000
* DCL 1 ECD BASED BDY(DWORD),                                           00214000
*       3 ECD_Length_Fields,                                            00215000
*        5 ECDCLLL FIXED(8),         /* Collection length            */ 00216000
*        5 ECDCORL FIXED(8),         /* Correlation length           */ 00217000
*        5 ECDSSPL FIXED(8),         /* Subsystem Parameter length   */ 00218000
*        5 ECDACCL FIXED(8),         /* Account Information length   */ 00219000
*       3 ECD_Char_Field1,                                              00220000
*        5 ECDTRXN CHAR(8),          /* Transaction program name     */ 00221000
*        5 ECDUSER CHAR(8),          /* Userid                       */ 00222000
*        5 ECDTRXC CHAR(8),          /* Transaction class            */ 00223000
*        5 ECDNET  CHAR(8),          /* Network ID                   */ 00224000
*        5 ECDLU   CHAR(8),          /* Logical Unit name            */ 00225000
*        5 ECDPLAN CHAR(8),          /* Plan                         */ 00226000
*        5 ECDPCKG CHAR(8),          /* Package                      */ 00227000
*        5 ECDCNCTN CHAR(8),         /* Connection                   */ 00228000
*        5 ECDCOLL CHAR(18),         /* Collection                   */ 00229000
*        5 ECDCORR CHAR(12),         /* Correlation                  */ 00230000
*       3 ECD_Char_Field2,                                              00231000
*        5 ECDSUBT CHAR(4),          /* Subsystem Type               */ 00232000
*        5 ECDFCN  CHAR(8),          /* Function Name                */ 00233000
*        5 ECDSUBN CHAR(8),          /* Subsystem Name               */ 00234000
*       3 ECD_Char_Field3,                                              00235000
*        5 ECDSSPM CHAR(255),        /* Subsystem Parameter          */ 00236000
*        5 ECDACCT CHAR(143)         /* Account Information          */ 00237000
*     , 3 ECD_Version Fixed(8)      /* Version               @WLMPENH*/ 00238000
*     , 3 ECD_ProcedureName Char(18) /* Proc name            @WLMPENH*/ 00239000
*     , 3 *          Fixed(8)       /* Reserved              @WLMPENH*/ 00240000
*/* This is a doubleword boundary                            @WLMPENH*/ 00241000
*     , 3 ECD_Length Fixed(16)      /* Length                @WLMPENH*/ 00242000
*     , 3 ECD_Perform Char(8)       /* Perform= value,                  00243000
*                                      EBCDIC format         @WLMPENH*/ 00244000
*     , 3 ECD_Procname_Len Fixed(8) /* Procedure name length @WLMPENH*/ 00245000
*     , 3 *           Char(1)       /* Reserved              @WLMPENH*/ 00246000
*     , 3 ECD_End_Version1          /* End of version 1                 00247000
*                                      answer area           @WLMPBAT*/ 00248000
*     ,   5 ECD_Priority Fixed(31)  /* Subsystem priority in binary     00249000
*                                      format.  Contains hexadecimal    00250000
*                                      80000000 if the subsystem did    00251000
*                                      not provide a priority.          00252000
*                                                            @WLMPBAT*/ 00253000
*     , 3 ECD_End_Version2 char(0)  /* End of version 2                 00254000
*                                      answer area           @WLMPBAT*/ 00255000
*     , 3 ECD_Start_Version3        /* Start of version 3               00256000
*                                      answer area           @WLMPMQS*/ 00257000
*     ,   5 ECD_ProcessName Char(32)  /* Process name        @WLMPMQS*/ 00258000
*     ,   5 ECD_ProcessName_Len fixed(8)  /* Process name               00259000
*                                            length          @WLMPMQS*/ 00260000
*     , 3 ECD_End_Version3 char(0)  /* End of version 3                 00261000
*                                      answer area           @WLMPMQS*/ 00262000
*     , 3 * char(7)                 /* Reserved, to insure dword        00263000
*                                      BDY IN ASSEMBLER      @PYD0411*/ 00264000
*     , 3 ECD_Start_Version4 char(0) bdy(dword)  /* Version 4.  Force   00265000
*                                      double word boundry for future   00266000
*                                      versions.             @OW42751*/ 00267000
*     , 3 ECD_End_Version4 char(0) bdy(dword)   /* End of version 4     00268000
*                                      answer area           @OW42751*/ 00269000
*     , 3 ECD_Start_Version5 bdy(dword)  /* Start of Version 5.  Force  00270000
*                                      double word boundry for future   00271000
*                                      versions.             @PYD0411*/ 00272000
*     ,   5 ECD_SchedulingEnvironment Char(16)            /* @WLMPGMY*/ 00273000
*     ,   5 ECD_SchedulingEnvironment_Len Fixed(8)        /* @WLMPGMY*/ 00274000
*     ,   5 ECD_SubsystemCollectionName char(8)           /* @WLMPGMY*/ 00275000
*     ,   5 * Char(7)                           /* Reserved  @PYD0411*/ 00276000
*     , 3 ECD_End_Version5 char(0) bdy(dword)   /* End of version 5     00277000
*                                      answer area           @PYD0411*/ 00278000
*     , 3 * Char(0) bdy(dword);     /* End of mapping        @OW42751*/ 00279000
*                                                                       00280000
* DCL ECD_VERSION1                                                      00281000
*   FIXED(8) CONSTANT(1);           /* ECD version 1         @WLMPBAT*/ 00282000
*                                                                       00283000
* DCL ECD_VERSION2                                                      00284000
*   FIXED(8) CONSTANT(2);           /* ECD version 2         @WLMPBAT*/ 00285000
*                                                                       00286000
* DCL ECD_VERSION3                                                      00287000
*   FIXED(8) CONSTANT(3);           /* ECD version 3         @WLMPMQS*/ 00288000
*                                                                       00289000
* DCL ECD_VERSION4                                                      00290000
*   FIXED(8) CONSTANT(4);           /* ECD version 4         @OW42751*/ 00291000
*                                                                       00292000
* DCL ECD_VERSION5                                                      00293000
*   FIXED(8) CONSTANT(5);           /* ECD version 5         @PYD0411*/ 00294000
*                                                                       00295000
* DCL ECD_VERSION_Latest                                                00296000
*   FIXED(8) CONSTANT(ECD_VERSION5);  /* ECD version W2EQY   @PYD0411*/ 00297000
*                                                                       00298000
* DCL ECD_VERSION1_LEN                                                  00299000
*   FIXED(16) CONSTANT(OFFSET(ECD.ECD_End_Version1)-OFFSET(ECD)); /*    00300000
*                                      Length of version 1 ECD       */ 00301000
*                                                                       00302000
* DCL ECD_VERSION2_LEN                                                  00303000
*   FIXED(16) CONSTANT(OFFSET(ECD.ECD_End_Version2)-OFFSET(ECD)); /*    00304000
*                                      Length of version 2 ECD          00305000
*                                                            @WLMPBAT*/ 00306000
* DCL ECD_VERSION3_LEN                                                  00307000
*   FIXED(16) CONSTANT(OFFSET(ECD.ECD_End_Version3)-OFFSET(ECD)); /*    00308000
*                                      Length of version 3 ECD          00309000
*                                                            @WLMPMQS*/ 00310000
* DCL ECD_VERSION4_LEN                                                  00311000
*   FIXED(16) CONSTANT(OFFSET(ECD.ECD_End_Version4)-OFFSET(ECD)); /*    00312000
*                                      Length of version 4 ECD          00313000
*                                                            @OW42751*/ 00314000
* DCL ECD_VERSION5_LEN                                                  00315000
*   FIXED(16) CONSTANT(OFFSET(ECD.ECD_End_Version5)-OFFSET(ECD)); /*    00316000
*                                      Length of version 5 ECD          00317000
*                                                            @WLMPGMY*/ 00318000
*/* End of PL/X Source                                               */ 00319000
* %IF IWMECD_LIST ^= 'NO' &                                             00320000
*    ZCBPRINT ^= 'NO' %THEN                                             00321000
*   %GOTO IWMECD_4;                                                     00322000
*   @LIST POP NOECHO;                                                   00323000
* %IWMECD_4:;                                                           00324000
* %END;                                                                 00325000
