*                                                                       00001000
* %DCL IWMRENF2_INCLUDED CHAR EXT;                                      00002000
* %DEACTIVATE IWMRENF2_INCLUDED;                                        00003000
* %IF IWMRENF2_INCLUDED = '' %THEN                                      00004000
* %DO;                                                                  00005000
*/* Macro made bi-lingual on 19322. CBGEN compile date 19044         */ 00006000
*% /*                                                                   00007000
         MACRO                                                          00008000
         IWMRENF2 &DSECT=YES,&LIST=YES,&TITLE=YES,&WLMENF56=YES         00009000
         GBLC  &IWMRENF2_INCLUDED                                       00010000
         GBLC  &ZCBPRINT                                                00011000
&IWMRENF2_INCLUDED SETC 'YES'                                           00012000
         AIF   ('&LIST' EQ 'NONE').P0                                   00013000
         AIF   ('&TITLE' EQ 'NO').P5                                    00014000
 TITLE   'IWMRENF2  - ENF signal 56 parameter list                '     00015000
.P5      ANOP                                                           00016000
**/ IWMRENF2_1:;                                                        00017000
*/****START OF SPECIFICATIONS*****************************************/ 00018000
*/*                                                                  */ 00019000
*/*01* Proprietary statement:                                        */ 00020000
*/*                                                                  */ 00021000
*/*      Licensed Materials - Property of IBM                        */ 00022000
*/*      5650-ZOS     Copyright IBM Corp. 1997, 2021                 */ 00023000
*/*      Status = HBB77D0                                            */ 00024000
*/*                                                                  */ 00025000
*/*01* External classification: GUPI                                 */ 00026000
*/*01* End of External classification                                */ 00027000
*/*                                                                  */ 00028000
*/*01* Status: HBB7706                                               */ 00029000
*/*                                                                  */ 00030000
*/*01* Descriptive Name: ENF signal 56 parameter list                */ 00031000
*/*                                                                  */ 00032000
*/*02*  Acronym: N/A                                                 */ 00033000
*/*                                                                  */ 00034000
*/*01* Macro Name: IWMRENF2                                          */ 00035000
*/*                                                                  */ 00036000
*/*01* DSECT Name: WLMENF56                                          */ 00037000
*/*                                                                  */ 00038000
*/*01* Component: WLM (SCWLM)                                        */ 00039000
*/*                                                                  */ 00040000
*/*01* Eye-Catcher: NONE                                             */ 00041000
*/*02*  Offset: N/A                                                  */ 00042000
*/*02*  Length: N/A                                                  */ 00043000
*/*                                                                  */ 00044000
*/*01* Storage Attributes:                                           */ 00045000
*/*02*  Key: 0                                                       */ 00046000
*/*02*  Residency: Above 16M line, in the private storage of the     */ 00047000
*/*       address space in which the listen exit receives control    */ 00048000
*/*                                                                  */ 00049000
*/*01* Size: See assembly listing                                    */ 00050000
*/*                                                                  */ 00051000
*/*01* Created by: WLM                                               */ 00052000
*/*                                                                  */ 00053000
*/*01* Pointed to by: First word of the parameter list passed to     */ 00054000
*/*       the listen exit                                            */ 00055000
*/*                                                                  */ 00056000
*/*01* Serialization: None                                           */ 00057000
*/*                                                                  */ 00058000
*/*01* Function: Maps the parameter list passed to ENF listen exits  */ 00059000
*/*      exits that are listening for event code 56.                 */ 00060000
*/*                                                                  */ 00061000
*/*02*  Qualifiers:                                                  */ 00062000
*/*                                                                  */ 00063000
*/*      - WLMENF56_Qual_Reset:                                      */ 00064000
*/*                                                                  */ 00065000
*/*        A job has been successfully reset through the RESET       */ 00066000
*/*        operator command or via the IWMRESET-service.             */ 00067000
*/*                                                                  */ 00068000
*/*      - WLMENF56_Qual_EnclaveReset:                               */ 00069000
*/*                                                                  */ 00070000
*/*        An enclave has been successfully reset via the            */ 00071000
*/*        IWMERES-service.                                          */ 00072000
*/*                                                                  */ 00073000
*/*01* Restrictions: N/A                                             */ 00074000
*/*                                                                  */ 00075000
*/*01* Method of Access:                                             */ 00076000
*/*                                                                  */ 00077000
*/*02*  ASM:                                                         */ 00078000
*/*          Specify: IWMRENF2                                       */ 00079000
*/*                                                                  */ 00080000
*/*02*  PLX:                                                         */ 00081000
*/*                                                                  */ 00082000
*/*          %INCLUDE SYSLIB(IWMRENF2)                               */ 00083000
*/*          If "BASED" is not wanted, set macro variable            */ 00084000
*/*          WLMENF56BASE to the desired attribute(s).               */ 00085000
*/*                                                                  */ 00086000
*/*01* Change Activity:                                              */ 00087000
*/*    $L0=WLMPBAT   JBB6604  961104 B9HAGD: Batch Initiator Mgmt    */ 00088000
*/*    $WLMPECR      HBB7706  010307 3241JH: Enclave Service Class   */ 00089000
*/*                                          Reset                   */ 00090000
*/*    $CBGMETA      HBB77D0  191106 3241BH: Bill Heisser            */ 00091000
*/*                                       convert to CBGEN Metadata  */ 00092000
*/*                                                                  */ 00093000
*/****END OF SPECIFICATIONS*******************************************/ 00094000
*% /*                                                                   00095000
.P0      ANOP                                                           00096000
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 00097000
         AIF   ('&LIST' EQ 'YES').P2                                    00098000
.P1      ANOP                                                           00099000
         PUSH  PRINT                                                    00100000
         PRINT OFF                                                      00101000
.P2      ANOP                                                           00102000
         AIF   ('&WLMENF56' EQ 'NO').L0002                              00103000
         AIF   ('&DSECT' EQ 'YES').L0003                                00104000
         AIF   ('&WLMENF56' NE 'YES').L0002                             00105000
WLMENF56 DS    0F        ENF event 56 parameters                        00106000
         AGO   .L0004                                                   00107000
.L0003   ANOP                                                           00108000
WLMENF56 DSECT           ENF event 56 parameters                        00109000
.L0004   ANOP                                                           00110000
WLMENF56_QUAL DS BL4     Qualifier code - see below                     00111000
WLMENF56_JOBNAME DS CL8  Name of job that was reset. Blank, in case of *00112000
                         enclave reset qualifier code.                  00113000
WLMENF56_JOBID DS CL8    JES job id of the job that was reset.         *00114000
                         Contains blanks if the job is not running     *00115000
                         under JES. Available with JES2 4.1.0, JES3    *00116000
                         4.2.1, and later releases. Blank, in case of  *00117000
                         enclave reset qualifier code.                  00118000
WLMENF56_ENTRY_TIME DS F Entry time in hundredths of a second since    *00119000
                         midnight. For a job, this is the program      *00120000
                         entry time or zero, if the job is not running *00121000
                         under JES. Available with JES2 4.1.0, JES3    *00122000
                         4.2.1, and later releases. For an enclave,    *00123000
                         this is the time the enclave was created.      00124000
WLMENF56_ENTRY_DATE DS CL4 Entry date in the form 0cyydddF. For a job, *00125000
                         this is the program entry data or zero, if    *00126000
                         the job is not running under JES. Available   *00127000
                         with JES2 4.1.0, JES3 4.2.1, and later        *00128000
                         releases. For an enclave this is the date the *00129000
                         enclave was created.                           00130000
WLMENF56_OPERATOR DS CL8 Operator ID that reset the job or enclave, if *00131000
                         available                                      00132000
WLMENF56_FLAGS DS B      Indicators                                     00133000
*  Bit definitions:                                                     00134000
WLMENF56_SRVCLASS EQU X'80' The job's service class was reset           00135000
WLMENF56_PERFORM EQU X'40' The job's performance group was reset        00136000
WLMENF56_QUIESCE EQU X'20' The job was quiesced                         00137000
WLMENF56_RESUME EQU X'10' The job was resumed                           00138000
WLMENF56_ENCLAVESRVCLASS EQU X'08' The enclave service class was reset  00139000
WLMENF56_ENCLAVEQUIESCE EQU X'04' The enclave was quiesced              00140000
WLMENF56_ENCLAVERESUME EQU X'02' The enclave was resumed                00141000
WLMENF56_FLAGS2 DS B     Additional characteristics                     00142000
*  Bit definitions:                                                     00143000
WLMENF56_INDEPENDENTENCLAVE EQU X'80' On = Original independent        *00144000
                         enclave                                        00145000
WLMENF56_VERSION DS X    Version. Zero represents initial version.     *00146000
                         Current version='01'x                          00147000
WLMENF56_RSV DS CL1      Reserved for future use                        00148000
WLMENF56_OLDSRV DS CL8   Service class name that was associated with   *00149000
                         the job or the enclave before it was reset.   *00150000
                         Contains blanks if the system is in           *00151000
                         compatibility mode.                            00152000
WLMENF56_NEWSRV DS CL8   Service class that was assigned to the job or *00153000
                         the enclave. Contains blanks if the system is *00154000
                         in compatibility mode.                         00155000
WLMENF56_OLDPGN DS H     Performance group that was associated with    *00156000
                         the job before it was reset. Contains zero if *00157000
                         the system is in goal mode or in case of      *00158000
                         enclave reset qualifier code.                  00159000
WLMENF56_NEWPGN DS H     Performance group that was assigned to the    *00160000
                         job. Contains zero if the system is in goal   *00161000
                         mode or in case of enclave reset qualifier    *00162000
                         code.                                          00163000
WLMENF56_STOKEN DS BL8   STOKEN of the address space in which the job  *00164000
                         is running. Zero, in case of enclave reset    *00165000
                         qualifier code.                                00166000
WLMENF56_ENCLAVETOKEN DS CL8 Enclave token. Zero, in case of job reset *00167000
                         qualifier code.                                00168000
WLMENF56_ENCLAVEOWNER DS CL8 Name of the address space that owns the   *00169000
                         enclave. Blank, in case of job reset          *00170000
                         qualifier code.                                00171000
*                                                                       00172000
*    Version numbers                                                    00173000
*                                                                       00174000
*                                                                       00175000
WLMENF56_CURRENTVERSION EQU 1 Supports enclave reset                    00176000
*                                                                       00177000
*    Qualifier values                                                   00178000
*                                                                       00179000
*                                                                       00180000
WLMENF56_QUAL_RESET EQU X'80000000' A job was reset using the RESET    *00181000
                         system command or IWMRESET macro               00182000
WLMENF56_QUAL_ENCLAVERESET EQU X'40000000' An enclave was reset using  *00183000
                         the IWMERES-macro                              00184000
WLMENF56_LEN EQU *-WLMENF56                                             00185000
.L0002   ANOP                                                           00186000
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 00187000
         AIF   ('&LIST' EQ 'YES').P4                                    00188000
.P3      ANOP                                                           00189000
         POP   PRINT                                                    00190000
.P4      ANOP                                                           00191000
.P_EXIT  ANOP                                                           00192000
         MEND                                                           00193000
**/ IWMRENF2_2:;                                                        00194000
* %IWMRENF2_INCLUDED = 'YES';                                           00195000
* %DCL ZCBPRINT CHAR EXT;                                               00196000
* %DEACTIVATE ZCBPRINT;                                                 00197000
* %DCL IWMRENF2_LIST CHAR EXT;                                          00198000
* %DEACTIVATE IWMRENF2_LIST;                                            00199000
* %IF IWMRENF2_LIST = 'NO' !                                            00200000
*    ZCBPRINT = 'NO' %THEN                                              00201000
* %DO;                                                                  00202000
*   @LIST PUSH NOECHO;                                                  00203000
*   @LIST NOASSEMBLE NOECHO;                                            00204000
*   @LIST OFF C NOECHO;                                                 00205000
* %END;                                                                 00206000
*/* Start of PL/X Source                                             */ 00207000
*%IF WLMENF56BASE='' %THEN                                              00208000
*  %WLMENF56BASE='BASED';                                               00209000
* DECLARE                                                               00210000
*  1 WLMENF56 WLMENF56BASE,         /* ENF event 56 parameters       */ 00211000
*     3 WLMENF56_QUAL      BIT(32), /* Qualifier code - see below    */ 00212000
*     3 WLMENF56_JOBNAME   CHAR(8), /* Name of job that was reset.      00213000
*                                      Blank, in case of enclave reset  00214000
*                                      qualifier code.       @WLMPECR*/ 00215000
*     3 WLMENF56_JOBID     CHAR(8), /* JES job id of the job that was   00216000
*                                      reset.  Contains blanks if the   00217000
*                                      job is not running under JES.    00218000
*                                      Available with JES2 4.1.0,       00219000
*                                      JES3 4.2.1, and later releases.  00220000
*                                      Blank, in case of enclave reset  00221000
*                                      qualifier code.       @WLMPECR*/ 00222000
*     3 WLMENF56_ENTRY_TIME BIN(32),/* Entry time in hundredths of a    00223000
*                                      second since midnight.           00224000
*                                      For a job, this is the program   00225000
*                                      entry time or zero, if the job   00226000
*                                      is not running under JES.        00227000
*                                      Available with JES2 4.1.0,       00228000
*                                      JES3 4.2.1, and later releases.  00229000
*                                      For an enclave, this is the      00230000
*                                      time the enclave was created.    00231000
*                                                            @WLMPECR*/ 00232000
*     3 WLMENF56_ENTRY_DATE CHAR(4),/* Entry date in the form 0cyydddF. 00233000
*                                      For a job, this is the program   00234000
*                                      entry data or zero, if the job   00235000
*                                      is not running under JES.        00236000
*                                      Available with JES2 4.1.0,       00237000
*                                      JES3 4.2.1, and later releases.  00238000
*                                      For an enclave this is the       00239000
*                                      date the enclave was created.    00240000
*                                                            @WLMPECR*/ 00241000
*     3 WLMENF56_OPERATOR  CHAR(8), /* Operator ID that reset the       00242000
*                                      job or enclave, if available     00243000
*                                                            @WLMPECR*/ 00244000
*     3 WLMENF56_FLAGS     BIT(8),  /* Indicators                    */ 00245000
*                                                                       00246000
*       5 WLMENF56_SRVCLASS BIT(1), /* The job's service class was      00247000
*                                      reset                         */ 00248000
*       5 WLMENF56_PERFORM BIT(1),  /* The job's performance group      00249000
*                                      was reset                     */ 00250000
*       5 WLMENF56_QUIESCE BIT(1),  /* The job was quiesced          */ 00251000
*       5 WLMENF56_RESUME BIT(1),   /* The job was resumed           */ 00252000
*       5 WLMENF56_EnclaveSrvclass Bit(1), /* The enclave service class 00253000
*                                      was reset             @WLMPECR*/ 00254000
*       5 WLMENF56_EnclaveQuiesce Bit(1),  /* The enclave was quiesced  00255000
*                                                            @WLMPECR*/ 00256000
*       5 WLMENF56_EnclaveResume Bit(1),   /* The enclave was resumed   00257000
*                                                            @WLMPECR*/ 00258000
*     3 WLMENF56_Flags2    Bit(8),  /* Additional characteristics       00259000
*                                                            @WLMPECR*/ 00260000
*       5 WLMENF56_IndependentEnclave Bit(1), /* On = Original          00261000
*                                      independent enclave   @WLMPECR*/ 00262000
*     3 WLMENF56_Version   Fixed(8),/* Version. Zero represents         00263000
*                                      initial version.                 00264000
*                                      Current version='01'x @WLMPECR*/ 00265000
*     3 WLMENF56_RSV       CHAR(1), /* Reserved for future use          00266000
*                                                            @WLMPECR*/ 00267000
*     3 WLMENF56_OLDSRV    CHAR(8), /* Service class name that was      00268000
*                                      associated with the job or the   00269000
*                                      enclave before it was reset.     00270000
*                                      Contains blanks if the system is 00271000
*                                      in compatibility mode.           00272000
*                                                            @WLMPECR*/ 00273000
*     3 WLMENF56_NEWSRV    CHAR(8), /* Service class that was assigned  00274000
*                                      to the job or the enclave.       00275000
*                                      Contains blanks if the system is 00276000
*                                      in compatibility mode.           00277000
*                                                            @WLMPECR*/ 00278000
*     3 WLMENF56_OLDPGN   FIXED(16),/* Performance group that was       00279000
*                                      associated with the job before   00280000
*                                      it was reset.  Contains zero if  00281000
*                                      the system is in goal mode or    00282000
*                                      in case of enclave reset         00283000
*                                      qualifier code.       @WLMPECR*/ 00284000
*     3 WLMENF56_NEWPGN   FIXED(16),/* Performance group that was       00285000
*                                      assigned to the job.  Contains   00286000
*                                      zero if the system is in goal    00287000
*                                      mode or in case of enclave reset 00288000
*                                      qualifier code.       @WLMPECR*/ 00289000
*     3 WLMENF56_STOKEN   BIT(64),  /* STOKEN of the address space      00290000
*                                      in which the job is running.     00291000
*                                      Zero, in case of enclave reset   00292000
*                                      qualifier code.       @WLMPECR*/ 00293000
*     3 WLMENF56_EnclaveToken Char(8), /* Enclave token. Zero, in case  00294000
*                                      of job reset qualifier code.     00295000
*                                                            @WLMPECR*/ 00296000
*     3 WLMENF56_EnclaveOwner Char(8); /* Name of the address space     00297000
*                                      that owns the enclave. Blank,    00298000
*                                      in case of job reset qualifier   00299000
*                                      code.                 @WLMPECR*/ 00300000
*                                                                       00301000
* /* Version numbers                                                 */ 00302000
*                                                                       00303000
* DECLARE                                                               00304000
*   WLMENF56_CurrentVersion Fixed(8) Constant(1); /* Supports enclave   00305000
*                                      reset                 @WLMPECR*/ 00306000
*                                                                       00307000
* /* Qualifier values                                                */ 00308000
*                                                                       00309000
* DECLARE                                                               00310000
*   WLMENF56_QUAL_RESET BIT(32) CONSTANT('80000000'X); /*               00311000
*                                      A job was reset using the        00312000
*                                      RESET system command or          00313000
*                                      IWMRESET macro                */ 00314000
* DECLARE                                                               00315000
*   WLMENF56_QUAL_EnclaveReset BIT(32) CONSTANT('40000000'X); /*        00316000
*                                      An enclave was reset using the   00317000
*                                      IWMERES-macro         @WLMPECR*/ 00318000
*/* End of PL/X Source                                               */ 00319000
* %IF IWMRENF2_LIST = 'NO' !                                            00320000
*    ZCBPRINT = 'NO' %THEN                                              00321000
* %DO;                                                                  00322000
*   @LIST POP NOECHO;                                                   00323000
* %END;                                                                 00324000
* %END;                                                                 00325000
