*                                                                       00001000
* %DCL IWMSVDEF_INCLUDED CHAR EXT;                                      00002000
* %DEACTIVATE IWMSVDEF_INCLUDED;                                        00003000
* %IF IWMSVDEF_INCLUDED = '' %THEN                                      00004000
* %DO;                                                                  00005000
*/* Macro made bi-lingual on 22122. CBGEN compile date 21138         */ 00006000
*% /*                                                                   00007000
         MACRO                                                          00008000
         IWMSVDEF &DSECT=YES,&LIST=YES,&TITLE=YES,&SVDEFHDR=YES,       *00009000
               &SVDEFPOL=COND,&SVDEFWKL=COND,&SVDEFSCL=COND,           *00010000
               &SVDEFGRP=COND,&SVDEFRCL=COND,&SVDEFCLA=COND,           *00011000
               &SVDEFPDA=COND,&SVDEFRGA=COND,&SVDEFCON=COND,           *00012000
               &SVDEFEMS=COND,&SVDEFEXT=COND                            00013000
         GBLC  &IWMSVDEF_INCLUDED                                       00014000
         GBLC  &ZCBPRINT                                                00015000
&IWMSVDEF_INCLUDED SETC 'YES'                                           00016000
         AIF   ('&LIST' EQ 'NONE').P0                                   00017000
         AIF   ('&TITLE' EQ 'NO').P5                                    00018000
 TITLE   'IWMSVDEF  - WLM Service Definition mapping              '     00019000
.P5      ANOP                                                           00020000
**/ ;                                                                   00021000
*/***START OF SPECIFICATIONS******************************************/ 00022000
*/*                                                                  */ 00023000
*/*01* Proprietary statement:                                        */ 00024000
*/*                                                                  */ 00025000
*/*      LICENSED MATERIALS - PROPERTY OF IBM                        */ 00026000
*/*      5650-ZOS COPYRIGHT IBM CORP. 1993, 2022                     */ 00027000
*/*                                                                  */ 00028000
*/*                                                                  */ 00029000
*/*01* External classification: GUPI                                 */ 00030000
*/*01* End of External classification                                */ 00031000
*/*                                                                  */ 00032000
*/*01* Status: HBB77D0                                               */ 00033000
*/*                                                                  */ 00034000
*/*01* Descriptive Name: WLM Service Definition mapping              */ 00035000
*/*                                                                  */ 00036000
*/*02*  Acronym: SVDEF                                               */ 00037000
*/*                                                                  */ 00038000
*/*01* Macro Name: IWMSVDEF                                          */ 00039000
*/*                                                                  */ 00040000
*/*01* DSECT Name: SVDEFHDR                                          */ 00041000
*/*                SVDEFPOL                                      @P3A*/ 00042000
*/*                SVDEFWKL                                      @P3A*/ 00043000
*/*                SVDEFSCL                                      @P3A*/ 00044000
*/*                SVDEFGRP                                      @P3A*/ 00045000
*/*                SVDEFRCL                                      @P3A*/ 00046000
*/*                SVDEFCLA                                      @P3A*/ 00047000
*/*                SVDEFPDA                                      @P3A*/ 00048000
*/*                SVDEFRGA                                      @P3A*/ 00049000
*/*                SVDEFCON                                      @P3A*/ 00050000
*/*                SVDEFEXT                                      @P3A*/ 00051000
*/*                SVDEFEMS                                  @LEWMSMA*/ 00052000
*/*                                                                  */ 00053000
*/*01* Component: Workload Manager (SCWLM)                           */ 00054000
*/*                                                                  */ 00055000
*/*01* Eye-Catcher: SVDE                                             */ 00056000
*/*02*  Offset: 0                                                    */ 00057000
*/*02*  Length: CHAR(4)                                              */ 00058000
*/*                                                                  */ 00059000
*/*01* Storage Attributes:                                           */ 00060000
*/*02*  Subpool: Any                                                 */ 00061000
*/*02*  Key: Any                                                     */ 00062000
*/*02*  Residency: Above 16M line                                    */ 00063000
*/*                                                                  */ 00064000
*/*01* Size: Determined at run time                                  */ 00065000
*/*            SVDEFHDR -- X'0160' bytes                             */ 00066000
*/*            SVDEFPOL -- X'0048' bytes                             */ 00067000
*/*            SVDEFWKL -- X'0048' bytes                             */ 00068000
*/*            SVDEFSCL -- X'0050' bytes                             */ 00069000
*/*            SVDEFGRP -- X'00B8' bytes                             */ 00070000
*/*            SVDEFRCL -- X'0058' bytes                             */ 00071000
*/*            SVDEFCLA -- X'0020' bytes                             */ 00072000
*/*            SVDEFPDA -- X'0010' bytes                             */ 00073000
*/*            SVDEFRGA -- X'0020' bytes                             */ 00074000
*/*            SVDEFCON -- X'0030' bytes                             */ 00075000
*/*            SVDEFEMS -- X'0300' bytes                             */ 00076000
*/*            SVDEFEXT -- X'0020' bytes                             */ 00077000
*/*                                                                  */ 00078000
*/*01* Created by: Caller                                            */ 00079000
*/*                                                                  */ 00080000
*/*01* Pointed to by: offset into SERVD (IWMSERVD)                   */ 00081000
*/*                                                                  */ 00082000
*/*01* Serialization: None                                           */ 00083000
*/*                                                                  */ 00084000
*/*01* Function: Contains general service definition information     */ 00085000
*/*              including service policies, workloads, service      */ 00086000
*/*              classes, report classes, resource groups,           */ 00087000
*/*              base and override service classes (including the    */ 00088000
*/*              period information), base and override resource     */ 00089000
*/*              group values, and constant information.             */ 00090000
*/*                                                                  */ 00091000
*/*              All timestamps are local time expressed in          */ 00092000
*/*              STCK format.                                        */ 00093000
*/*                                                                  */ 00094000
*/*01* Restrictions:                                                 */ 00095000
*/*              None                                                */ 00096000
*/*                                                                  */ 00097000
*/*01* Method of Access:                                             */ 00098000
*/*                                                                  */ 00099000
*/*02*  ASM:                                                         */ 00100000
*/*          Specify: IWMSVDEF                                       */ 00101000
*/*                                                                  */ 00102000
*/*02*  PLX:                                                         */ 00103000
*/*                                                                  */ 00104000
*/*          %INCLUDE SYSLIB(IWMSVDEF)                               */ 00105000
*/*          Using on SVDEFHDR gives addressability to the SVDEF @P1C*/ 00106000
*/*          header section.                                         */ 00107000
*/*          Subsequent usings must be done to get addressability    */ 00108000
*/*          to the additional sections (DSECTs) as follows:         */ 00109000
*/*          DSECT    USING                                          */ 00110000
*/*          -----    -----                                          */ 00111000
*/*          SVDEFPOL A(SVDEFHDR) + SVDEFPO                      @P1C*/ 00112000
*/*          SVDEFWKL A(SVDEFHDR) + SVDEFWO                      @P1C*/ 00113000
*/*          SVDEFSCL A(SVDEFHDR) + SVDEFCO                      @P1C*/ 00114000
*/*          SVDEFGRP A(SVDEFHDR) + SVDEFGO                      @P1C*/ 00115000
*/*          SVDEFRCL A(SVDEFHDR) + SVDEFRO                      @P1C*/ 00116000
*/*          SVDEFCLA A(SVDEFHDR) + SVDEFCAO                         */ 00117000
*/*          SVDEFPDA A(SVDEFSCL) + SVDEFCAS                         */ 00118000
*/*          SVDEFRGA A(SVDEFHDR) + SVDEFGAO                         */ 00119000
*/*          SVDEFCON A(SVDEFHDR) + SVDEFCNO                         */ 00120000
*/*          SVDEFEMS A(SVDEFHDR) + SVDEF_EWLM_MS_OFF        @LEWMSMA*/ 00121000
*/*          SVDEFEXT A(SVDEFHDR) + SVDEF_EXT_OFF  or            @P1A*/ 00122000
*/*                   A(SVDEFHDR) + SVDEF_SP_EXT_OFF  or         @L1A*/ 00123000
*/*                   A(SVDEFHDR) + SVDEF_WD_EXT_OFF  or         @L1A*/ 00124000
*/*                   A(SVDEFHDR) + SVDEF_CD_EXT_OFF  or         @L1A*/ 00125000
*/*                   A(SVDEFHDR) + SVDEF_RG_EXT_OFF  or         @L1A*/ 00126000
*/*                   A(SVDEFHDR) + SVDEF_RD_EXT_OFF  or         @L1A*/ 00127000
*/*                   A(SVDEFHDR) + SVDEF_CLA_EXT_OFF or         @L1A*/ 00128000
*/*                   A(SVDEFHDR) + SVDEF_RGA_EXT_OFF            @P1C*/ 00129000
*/*                                                                  */ 00130000
*/*          In cases where there are multiple elements in a         */ 00131000
*/*          section, subsequent elements can be found by adding     */ 00132000
*/*          the size of one element (in the header section) to      */ 00133000
*/*          the element at hand.                                    */ 00134000
*/*                                                                  */ 00135000
*/*01* Notes:                                                        */ 00136000
*/*                                                                  */ 00137000
*/*    The ASSEMBLER section of this macro is automatically  @LEWMSMA*/ 00138000
*/*    generated using CBGEN                                 @LEWMSMA*/ 00139000
*/*                                                                  */ 00140000
*/*    To add extensions to the service definition:              @P6A*/ 00141000
*/*                                                              @P6A*/ 00142000
*/*    The following fields must be updated:                     @P6A*/ 00143000
*/*                                                              @P6A*/ 00144000
*/*     1) SVDEF_EXT_DATA_OFF - the offset to the beginning of   @P6A*/ 00145000
*/*                             the extension data, from the     @P6A*/ 00146000
*/*                             beginning of IWMSVDEF.           @P6A*/ 00147000
*/*     2) SVDEF_EXT_DATA_LEN - the total length of the          @P6A*/ 00148000
*/*                             extension data, not including    @P6A*/ 00149000
*/*                             the length of the extension      @P6A*/ 00150000
*/*                             entries.                         @P6A*/ 00151000
*/*                                                              @P6A*/ 00152000
*/*    For each part of the service definition with extensions,  @P6A*/ 00153000
*/*    the appropriate fields in the SVDEF must be updated with: @P6A*/ 00154000
*/*                                                              @P6A*/ 00155000
*/*     1) the offset to the extension entries from the          @P6A*/ 00156000
*/*        beginning of IWMSVDEF (i.e. SVDEF_EXT_OFF).           @P6A*/ 00157000
*/*                                                              @P6A*/ 00158000
*/*     2) the number of extension entries (i.e. SVDEF_EXT_NUM). @P6A*/ 00159000
*/*                                                              @P6A*/ 00160000
*/*     3) the length of an extension entry (i.e. SVDEF_EXT_SIZ).@P6A*/ 00161000
*/*                                                              @P6A*/ 00162000
*/*    Each extension entry (mapped by DSECT SVDEFEXT) must have @P6A*/ 00163000
*/*    the following fields filled in:                           @P6A*/ 00164000
*/*                                                              @P6A*/ 00165000
*/*     1) SVDEFID - identifier of the product adding the        @P6A*/ 00166000
*/*                  extension.                                  @P6A*/ 00167000
*/*                                                              @P6A*/ 00168000
*/*     2) SVDEFROB - The name of the related object. For        @P6A*/ 00169000
*/*                   example, if you are adding an extension    @P6A*/ 00170000
*/*                   to a service class, this field should      @P6A*/ 00171000
*/*                   contain the service class name.            @P6A*/ 00172000
*/*                                                              @P6A*/ 00173000
*/*     3) SVDEFEPN - Related policy name, if the extension is   @P6A*/ 00174000
*/*                   for a service class or resource group.     @P6A*/ 00175000
*/*                   Otherwise, leave blank.                    @P6A*/ 00176000
*/*                                                              @P6A*/ 00177000
*/*     4) SVDEFEDL - The length of the extension data.          @P6A*/ 00178000
*/*                                                              @P6A*/ 00179000
*/*     5) SVDEFEDO - The offset to the extension data from the  @P6A*/ 00180000
*/*                   start of the extension data.               @P6A*/ 00181000
*/*                                                              @P6A*/ 00182000
*/*                                                              @P6A*/ 00183000
*/*                                                                  */ 00184000
*/*01* Change Activity:                                              */ 00185000
*/*    $L0= WLMI,    HBB5510, 930315,PD00BV: WLM Stage I             */ 00186000
*/*    $T1= PIG5037, HBB5510, 940202,PD88IK: OW01260: CDPI change@T1A*/ 00187000
*/*    $L1= WLMRM,   HBB5510, 940117,PD00BV: WLM 5.2             @L1A*/ 00188000
*/*    $P1= PN71296  HBB5520, 940908,PD88D5: Correct DSECT info  @P1A*/ 00189000
*/*    $P2= PIG5510  HBB5510, 940915,PD72DB: OW08866                 */ 00190000
*/*                                          Migration support   @P2A*/ 00191000
*/*    $P3= PN71675  HBB5520  941020 PD88D0: Correct DSECT info  @P3A*/ 00192000
*/*    $P4= PIG5386  HBB5520  940915 PD72DB: OW08866                 */ 00193000
*/*                                          Migration support   @P4A*/ 00194000
*/*    $P5= PN71993  HBB5520  941122 PD88CG: OW08866                 */ 00195000
*/*                                          Migration support   @P5A*/ 00196000
*/*    $P6= PN72034  HBB5520  941201 PD88D0: Prolog updates      @P6A*/ 00197000
*/*    $WLMPSTP      HBB6603  950612 PD88DB: Stored SQL procedures   */ 00198000
*/*                                                          @WLMPSTP*/ 00199000
*/*         OW15413  HBB5520  950908 B9HACG: Correct assembler form  */ 00200000
*/*                                          of the macro.   @WA15413*/ 00201000
*/*    $PQC1647      HBB6603  960627 PDB9DB: Support option for      */ 00202000
*/*                                          I/O execution delay     */ 00203000
*/*                                          and velocity    @PQC1647*/ 00204000
*/*    $PQC2520      HBB6603  960917 PDB9DB: Fix defaults    @PQC2520*/ 00205000
*/*    $WLMPBAT      JBB6604  960926 B9HAGD: Classify by priority    */ 00206000
*/*                                                          @WLMPBAT*/ 00207000
*/*    $WLMPSDC      HBB6606  970807 B9HAKP: Service defn comments   */ 00208000
*/*                                                          @WLMPSDC*/ 00209000
*/*    $WLMPMQS      JBB6607  970417 B9HARF: Process Name            */ 00210000
*/*                                                          @WLMPMQS*/ 00211000
*/*    $WLMPTAL      JBB6607  980501 B9HAMS: Scott Monheimer         */ 00212000
*/*                                          Dynamic alias tuning    */ 00213000
*/*                                          Add SVDEFDAM    @WLMPTAL*/ 00214000
*/*    $OW39854      JBB6607  990914 PDVA:   Victor Alonzo           */ 00215000
*/*                                          Changed comment for     */ 00216000
*/*                                          SVDEFDAM to ON means    */ 00217000
*/*                                          available       @OW39854*/ 00218000
*/*                                                                  */ 00219000
*/*    $WLMPGMY      HBB7703  991027 B9HAPC: Patrick Chan            */ 00220000
*/*                                          Add constants for       */ 00221000
*/*                                          functionality level 11  */ 00222000
*/*                                                          @WLMPGMY*/ 00223000
*/*    $OW43587      HBB7703  990310 B9HAPC: Patrick Chan            */ 00224000
*/*                                          The following changes   */ 00225000
*/*                                          are flagged by @WLMCGMC:*/ 00226000
*/*                                          - Add bit for CPU       */ 00227000
*/*                                            CPU protection        */ 00228000
*/*                                                          @WLMCGMC*/ 00229000
*/*    $WLMPLNX      HBB7705  001012 B9HAPC: Patrick Chan            */ 00230000
*/*                                          Add LEVEL013 for LINUX  */ 00231000
*/*                                          support.        @WLMPLNX*/ 00232000
*/*                                                                  */ 00233000
*/*    $WLMPESC      HBB7730  050919 3141MG: Matthias Gubitz         */ 00234000
*/*                                          Add LEVEL017 for Service*/ 00235000
*/*                                          Class Correlation       */ 00236000
*/*                                                          @WLMPESC*/ 00237000
*/*    $WLMPEEG      HBB7730  050907 3241SW: Stefan Wirag            */ 00238000
*/*                                          Add LEVEL019 for Process*/ 00239000
*/*                                          Entitlement Groups      */ 00240000
*/*    $LEWLTM       HBB7750  060607 3241HB: Helmut Belzner          */ 00241000
*/*                                          Add LEVEL021 for EWLM   */ 00242000
*/*                                          e2e transaction         */ 00243000
*/*                                          management support      */ 00244000
*/*    $ME10212      HBB7750  070511 3241BH: Bill Heisser            */ 00245000
*/*                                          Restricted Material stmt*/ 00246000
*/*                                          in Copyright removed    */ 00247000
*/*    $LPOLMP       HBB7750  070502 3241GV: Guenter Vater           */ 00248000
*/*                                          XML policy mapping      */ 00249000
*/*    $LEXTRC       HBB7760  080331 3241TB: Thomas Blattmann        */ 00250000
*/*                                          extend max nummber of   */ 00251000
*/*                                          report classes to 2047  */ 00252000
*/*    $LEWMSM       HBB7760  080404 3241HB: Helmut Belzner          */ 00253000
*/*                                          EWLM managed server     */ 00254000
*/*                                          integration             */ 00255000
*/*    $ME17808      HBB7770  091126 3241MG: Matthias Gubitz         */ 00256000
*/*                                          Add LEVEL025 for GPMP   */ 00257000
*/*                                          settings                */ 00258000
*/*    $CASECNV      HBB7780  101011 3241HB: Helmut Belzner          */ 00259000
*/*                                          Add mapping declaration */ 00260000
*/*                                          of SVDEFID f. conversion*/ 00261000
*/*                                          Constants of CASE part  */ 00262000
*/*                                          are added.              */ 00263000
*/*    $OA30928      HBB7780  101014 3241MG: Matthias Gubitz         */ 00264000
*/*                                          Reword GPMP section     */ 00265000
*/*    $LSPMGR       HBB7790  110307 3241IS: Irene Stahl             */ 00266000
*/*                                          SPM groups              */ 00267000
*/*    $LIOMGT       HBB7790  110705 3241MG: Matthias Gubitz         */ 00268000
*/*                                          I/O priority group      */ 00269000
*/*    $OA41645      HBB7790  130320 3241MG: Matthias Gubitz         */ 00270000
*/*                                          I/O priority group      */ 00271000
*/*    $OA47042      HBB7790  150608 3241IS: Irene Stahl             */ 00272000
*/*                                          Special reporting       */ 00273000
*/*    $LRESPT       HBB77B0  160122 3241MG: Matthias Gubitz         */ 00274000
*/*                                          Shorter response time   */ 00275000
*/*                                          goal                    */ 00276000
*/*    $OA50845      HBB7790  160509 3241IS: Irene Stahl             */ 00277000
*/*                                          Force "Honorpriority"   */ 00278000
*/*                                          to NO for specialty     */ 00279000
*/*                                          processors              */ 00280000
*/*                           160623 3241IS: Memory capping          */ 00281000
*/*    $OA52312      HBB77B0  170110 3241IS: Irene Stahl     @LWBGRP */ 00282000
*/*                                          Workload billing groups */ 00283000
*/*    $LHWCON       HBB77C0  171219 3241IS: Irene Stahl     @LHWCON */ 00284000
*/*                                          zCBP support            */ 00285000
*/*    $LCOEFF       HBB77D0  200512 3241MG: Matthias Gubitz         */ 00286000
*/*                                          Service coefficient     */ 00287000
*/*                                          removal                 */ 00288000
*/*    $LBOOS3       HBB77D0  210111 3241IS: Irene Stahl     @OA60841*/ 00289000
*/*                                          System Recovery Boost   */ 00290000
*/*                                          stage 3                 */ 00291000
*/*                                                                  */ 00292000
*/***END OF SPECIFICATIONS********************************************/ 00293000
*% /*                                                                   00294000
.P0      ANOP                                                           00295000
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 00296000
         AIF   ('&LIST' EQ 'YES').P2                                    00297000
.P1      ANOP                                                           00298000
         PUSH  PRINT                                                    00299000
         PRINT OFF                                                      00300000
.P2      ANOP                                                           00301000
         AIF   ('&SVDEFHDR' EQ 'NO').L0002                              00302000
         AIF   ('&DSECT' EQ 'YES').L0003                                00303000
         AIF   ('&SVDEFHDR' NE 'YES').L0002                             00304000
SVDEFHDR DS    0D                                                       00305000
         AGO   .L0004                                                   00306000
.L0003   ANOP                                                           00307000
SVDEFHDR DSECT                                                          00308000
.L0004   ANOP                                                           00309000
SVDEFNAM DS    CL4       Eyecatcher (SVDE)                              00310000
SVDEFLVL DS    X         Functionality level of the SVDEF. The         *00311000
                         functionality level defines the highest level *00312000
                         of WLM function that exists in the SVDEF.      00313000
SVDEFWVN DS    X         WLM version number                             00314000
SVDEFDIL DS    H         Size of header section                         00315000
SVDEFDES DS    CL32      Service definition description                 00316000
SVDEFSIZ DS    F         Size of SVDEF                                  00317000
SVDEFPO  DS    F         Offset of policy section if the number of     *00318000
                         policies is nonzero (otherwise this field is  *00319000
                         ignored)                                       00320000
SVDEFPN  DS    H         Number of policy entries                       00321000
SVDEFPS  DS    H         Size of policy entry                           00322000
SVDEFWO  DS    F         Offset of workload section if the number of   *00323000
                         workloads is nonzero (otherwise this field is *00324000
                         ignored)                                       00325000
SVDEFWN  DS    H         Number of workload entries                     00326000
SVDEFWS  DS    H         Size of workload entry                         00327000
SVDEFCO  DS    F         Offset of service class section if number of  *00328000
                         service classes is nonzero (otherwise this    *00329000
                         field is ignored)                              00330000
SVDEFCN  DS    H         Number of service class entries                00331000
SVDEFCS  DS    H         Size of service class entry                    00332000
SVDEFGO  DS    F         Offset of resource group section if number of *00333000
                         resource groups is nonzero (otherwise this    *00334000
                         field is ignored)                              00335000
SVDEFGN  DS    H         Number of resource group entries               00336000
SVDEFGS  DS    H         Size of resource group entry                   00337000
SVDEFRO  DS    F         Offset of report class section if number of   *00338000
                         report classes is nonzero (otherwise this     *00339000
                         field is ignored)                              00340000
SVDEFRN  DS    H         Number of report class entries                 00341000
SVDEFRS  DS    H         Size of report class entry                     00342000
SVDEFCAO DS    F         Offset of service class attribute section if  *00343000
                         number of service class attributes is nonzero *00344000
                         (otherwise this field is ignored)              00345000
SVDEFCAN DS    H         Number of service class attribute entries      00346000
SVDEFCAS DS    H         Size of service class attribute entry          00347000
SVDEFGAO DS    F         Offset of resource group attribute section if *00348000
                         number of service class attributes is nonzero *00349000
                         (otherwise this field is ignored)              00350000
SVDEFGAN DS    H         Number of resource group attribute entries     00351000
SVDEFGAS DS    H         Size of resource group attribute entry         00352000
SVDEFCNO DS    F         Offset of constant information section         00353000
SVDEFCNS DS    H         Size of constant information entry             00354000
SVDEFCPS DS    H         Size of each service class period entry        00355000
SVDEFID  DS    CL32      Service definition id starts here (can be     *00356000
                         mapped by SVIDSSVD in IWMSVIDS)                00357000
         ORG   SVDEFID                                                  00358000
SVDEFIDN DS    CL8       Service definition name                        00359000
SVDEFTDI DS    CL8       Timestamp (STCK format) in local time the     *00360000
                         service definition was installed (on install  *00361000
                         processing (IWMDINST) this field is set by    *00362000
                         WLM)                                           00363000
SVDEFIDU DS    CL8       Userid of the service administrator that      *00364000
                         installed the service definition (on install  *00365000
                         processing (IWMDINST) this field is set by    *00366000
                         WLM)                                           00367000
SVDEFIDS DS    CL8       Name of the system on which the service       *00368000
                         definition was installed (on install          *00369000
                         processing (IWMDINST) this field is set by    *00370000
                         WLM)                                           00371000
         DS    CL32      Reserved for additional triplets               00372000
SVDEFPRO DS    CL32      ID of product which performed the             *00373000
                         installation (mapped by SVIDSPRD)              00374000
SVDEF_EXT_OFF DS F       Offset of service definition extension        *00375000
                         section if number of service definition       *00376000
                         extensions is nonzero (otherwise this field   *00377000
                         is ignored)                                    00378000
SVDEF_EXT_NUM DS H       Number of service definition extension        *00379000
                         entries                                        00380000
SVDEF_EXT_SIZ DS H       Size of service definition extension entry     00381000
SVDEF_SP_EXT_OFF DS F    Offset of policy extension section if number  *00382000
                         of policy extensions is nonzero (otherwise    *00383000
                         this field is ignored)                         00384000
SVDEF_SP_EXT_NUM DS H    Number of policy extension entries             00385000
SVDEF_SP_EXT_SIZ DS H    Size of policy extension entry                 00386000
SVDEF_WD_EXT_OFF DS F    Offset of workload extension section if       *00387000
                         number of workload extensions is nonzero      *00388000
                         (otherwise this field is ignored)              00389000
SVDEF_WD_EXT_NUM DS H    Number of workload extension entries           00390000
SVDEF_WD_EXT_SIZ DS H    Size of workload extension entry               00391000
SVDEF_CD_EXT_OFF DS F    Offset of service class extension section if  *00392000
                         number of service class extensions is nonzero *00393000
                         (otherwise this field is ignored)              00394000
SVDEF_CD_EXT_NUM DS H    Number of service class extension entries      00395000
SVDEF_CD_EXT_SIZ DS H    Size of service class extension entry          00396000
SVDEF_RG_EXT_OFF DS F    Offset of resource group extension section if *00397000
                         number of resource group extensions is        *00398000
                         nonzero (otherwise this field is ignored)      00399000
SVDEF_RG_EXT_NUM DS H    Number of resource group extension entries     00400000
SVDEF_RG_EXT_SIZ DS H    Size of resource group extension entry         00401000
SVDEF_RD_EXT_OFF DS F    Offset of report class extension section if   *00402000
                         number of report class extensions is nonzero  *00403000
                         (otherwise this field is ignored)              00404000
SVDEF_RD_EXT_NUM DS H    Number of report class extension entries       00405000
SVDEF_RD_EXT_SIZ DS H    Size of report class extension entry           00406000
SVDEF_CLA_EXT_OFF DS F   Offset of service class attribute extension   *00407000
                         section if number of service class attribute  *00408000
                         extensions is nonzero (otherwise this field   *00409000
                         is ignored)                                    00410000
SVDEF_CLA_EXT_NUM DS H   Number of service class attribute extension   *00411000
                         entries                                        00412000
SVDEF_CLA_EXT_SIZ DS H   Size of service class attribute extension     *00413000
                         entry                                          00414000
SVDEF_RGA_EXT_OFF DS F   Offset of resource group attribute extension  *00415000
                         section if number of resource class attribute *00416000
                         extensions is nonzero (otherwise this field   *00417000
                         is ignored)                                    00418000
SVDEF_RGA_EXT_NUM DS H   Number of resource group attribute extension  *00419000
                         entries                                        00420000
SVDEF_RGA_EXT_SIZ DS H   Size of resource group attribute extension    *00421000
                         entry                                          00422000
SVDEF_EWLM_MS_OFF DS F   Offset of GPMP settings section                00423000
SVDEF_EWLM_MS_SIZ DS H   Length of GPMP settings entry                  00424000
SVDEF_EWLM_MS_NUM DS H   Number of GPMP settings entries                00425000
         DS    CL24      Reserved for additional extension triplets     00426000
SVDEF_EXT_DATA_OFF DS F  Offset of extended data (0 if no extended     *00427000
                         data exists)                                   00428000
SVDEF_EXT_DATA_LEN DS F  Length of extended data                        00429000
SVDEF_CODEPAGE DS CL40   Codepage used to create service definition     00430000
         DS    CL4       Reserved                                       00431000
SVDEFHDR_LEN EQU *-SVDEFHDR                                             00432000
.L0002   ANOP                                                           00433000
         AIF   ('&SVDEFPOL' EQ 'NO').L0005                              00434000
         AIF   ('&DSECT' EQ 'YES').L0006                                00435000
         AIF   ('&SVDEFPOL' NE 'YES').L0005                             00436000
SVDEFPOL DS    0D        Service policy section                         00437000
         AGO   .L0007                                                   00438000
.L0006   ANOP                                                           00439000
SVDEFPOL DSECT           Service policy section                         00440000
.L0007   ANOP                                                           00441000
SVDEFPNM DS    CL8       Policy name                                    00442000
SVDEFPDE DS    CL32      Policy description                             00443000
SVDEFPIU DS    CL8       Userid of policy creator                       00444000
SVDEFPIT DS    CL8       Timestamp of initial creation                  00445000
SVDEFPRU DS    CL8       Userid of policy last update                   00446000
SVDEFPRT DS    CL8       Timestamp of policy last update                00447000
SVDEFPOL_LEN EQU *-SVDEFPOL                                             00448000
.L0005   ANOP                                                           00449000
         AIF   ('&SVDEFWKL' EQ 'NO').L0008                              00450000
         AIF   ('&DSECT' EQ 'YES').L0009                                00451000
         AIF   ('&SVDEFWKL' NE 'YES').L0008                             00452000
SVDEFWKL DS    0D        Workload section                               00453000
         AGO   .L000A                                                   00454000
.L0009   ANOP                                                           00455000
SVDEFWKL DSECT           Workload section                               00456000
.L000A   ANOP                                                           00457000
SVDEFWNM DS    CL8       Workload name                                  00458000
SVDEFWDE DS    CL32      Workload description                           00459000
SVDEFWIU DS    CL8       Userid of workload creator                     00460000
SVDEFWIT DS    CL8       Timestamp of initial creation                  00461000
SVDEFWRU DS    CL8       Userid of workload last update                 00462000
SVDEFWRT DS    CL8       Timestamp of workload last update              00463000
SVDEFWKL_LEN EQU *-SVDEFWKL                                             00464000
.L0008   ANOP                                                           00465000
         AIF   ('&SVDEFSCL' EQ 'NO').L000B                              00466000
         AIF   ('&DSECT' EQ 'YES').L000C                                00467000
         AIF   ('&SVDEFSCL' NE 'YES').L000B                             00468000
SVDEFSCL DS    0D        Service class section                          00469000
         AGO   .L000D                                                   00470000
.L000C   ANOP                                                           00471000
SVDEFSCL DSECT           Service class section                          00472000
.L000D   ANOP                                                           00473000
SVDEFCNM DS    CL8       Service class name                             00474000
SVDEFCDE DS    CL32      Service class description                      00475000
SVDEFCWN DS    CL8       Name of associated workload                    00476000
SVDEFCIU DS    CL8       Userid of service class creator                00477000
SVDEFCIT DS    CL8       Timestamp of initial creation                  00478000
SVDEFCRU DS    CL8       Userid of service class last update            00479000
SVDEFCRT DS    CL8       Timestamp of service class last update         00480000
SVDEFSCL_LEN EQU *-SVDEFSCL                                             00481000
.L000B   ANOP                                                           00482000
         AIF   ('&SVDEFGRP' EQ 'NO').L000E                              00483000
         AIF   ('&DSECT' EQ 'YES').L000F                                00484000
         AIF   ('&SVDEFGRP' NE 'YES').L000E                             00485000
SVDEFGRP DS    0D        Resource group section                         00486000
         AGO   .L0010                                                   00487000
.L000F   ANOP                                                           00488000
SVDEFGRP DSECT           Resource group section                         00489000
.L0010   ANOP                                                           00490000
SVDEFGNM DS    CL8       Resource group name                            00491000
SVDEFGDE DS    CL32      Resource group description                     00492000
SVDEFGIU DS    CL8       Userid of resource group creator               00493000
SVDEFGIT DS    CL8       Timestamp of initial creation                  00494000
SVDEFGRU DS    CL8       Userid of resource group last update           00495000
SVDEFGRT DS    CL8       Timestamp of resource group last update        00496000
SVDEFGFL DS    BL4       Indicators                                     00497000
*  Bit definitions:                                                     00498000
SVDEFTRG EQU   X'80'     This is a Tenant Resource Group                00499000
SVDEFTRG_HWCONTAINER EQU X'40' This is a Tenant Resource Group which   *00500000
                         is enabled for zCBP.                           00501000
         DS    CL4       Reserved to align to DWORD boundary            00502000
SVDEF_TENANTID DS CL8    ID of associated Tenant                        00503000
SVDEF_TENANTNAME DS CL32 Name of associated Tenant                      00504000
SVDEF_TRGSOLUTIONID DS CL64 Solution Id of the Tenant Resource Group    00505000
SVDEFGRP_LEN EQU *-SVDEFGRP                                             00506000
.L000E   ANOP                                                           00507000
         AIF   ('&SVDEFRCL' EQ 'NO').L0011                              00508000
         AIF   ('&DSECT' EQ 'YES').L0012                                00509000
         AIF   ('&SVDEFRCL' NE 'YES').L0011                             00510000
SVDEFRCL DS    0D        Report class section                           00511000
         AGO   .L0013                                                   00512000
.L0012   ANOP                                                           00513000
SVDEFRCL DSECT           Report class section                           00514000
.L0013   ANOP                                                           00515000
SVDEFRNM DS    CL8       Report class name                              00516000
SVDEFRDE DS    CL32      Report class description                       00517000
SVDEFRIU DS    CL8       Userid of report class creator                 00518000
SVDEFRIT DS    CL8       Timestamp of initial creation                  00519000
SVDEFRRU DS    CL8       Userid of report class last update             00520000
SVDEFRRT DS    CL8       Timestamp of report class recent update        00521000
SVDEFRFL DS    BL4       Indicators                                     00522000
*  Bit definitions:                                                     00523000
SVDEFTRC EQU   X'80'     This is a Tenant Report Class                  00524000
         DS    CL4       Reserved to align to DWORD boundary            00525000
SVDEF_TRG_NAME DS CL8    Name of associated Tenant Resource Group       00526000
SVDEFRCL_LEN EQU *-SVDEFRCL                                             00527000
.L0011   ANOP                                                           00528000
         AIF   ('&SVDEFCLA' EQ 'NO').L0014                              00529000
         AIF   ('&DSECT' EQ 'YES').L0015                                00530000
         AIF   ('&SVDEFCLA' NE 'YES').L0014                             00531000
.L0015   ANOP                                                           00532000
*                                                                       00533000
*      ***************************************************************  00534000
*      *                                                             *  00535000
*      * Each service class (SVDEFSCL) requires there be one service *  00536000
*      * class attribute entry (SVDEFCLA) which describes the base   *  00537000
*      * performance characteristics of that service class. In this  *  00538000
*      * "base" service class attribute entry, the SVDEFSPN field is *  00539000
*      * blanks. There may exist additional service class attribute  *  00540000
*      * entries for "overrides". That is, the performance           *  00541000
*      * characteristics of a service class (the "attributes") may be*  00542000
*      * overridden from policy to policy. To override the attributes*  00543000
*      * for a given service class for a specific service policy, an *  00544000
*      * additional SVDEFCLA entry must be provided in which the     *  00545000
*      * SVDEFSPN field contains the name of the policy to which the *  00546000
*      * service class attribute "override" pertains. If no override *  00547000
*      * service class attribute for a specific policy is found when *  00548000
*      * a policy is being activated from this service definition -  *  00549000
*      * in other words, if no SVDEFCLA entry is found for a         *  00550000
*      * particular service class (SVDEFSCL) in which the policy name*  00551000
*      * (SVDEFSPN) matches the name of the policy being activated - *  00552000
*      * then the base attribute entry will be used to express the   *  00553000
*      * performance characteristics of that service class in the    *  00554000
*      * policy being activated                                      *  00555000
*      *                                                             *  00556000
*      ***************************************************************  00557000
*                                                                       00558000
*                                                                       00559000
         AIF   ('&DSECT' EQ 'YES').L0016                                00560000
SVDEFCLA DS    0D        Service class attributes section               00561000
         AGO   .L0017                                                   00562000
.L0016   ANOP                                                           00563000
SVDEFCLA DSECT           Service class attributes section               00564000
.L0017   ANOP                                                           00565000
SVDEFSCN DS    CL8       Service class name with which this attribute  *00566000
                         is associated                                  00567000
SVDEFSPN DS    CL8       Name of policy that service class attribute   *00568000
                         is associated with (this field will be blanks *00569000
                         if it is a base attribute)                     00570000
SVDEFCGN DS    CL8       Name of the resource group this service class *00571000
                         is associated with - blanks if no resource    *00572000
                         group association                              00573000
SVDEFCPN DS    H         Number of service class periods for this      *00574000
                         service class attribute                        00575000
SVDEFFLG DS    CL1       Service Class Attribute                        00576000
*  Bit definitions:                                                     00577000
SVDEFCPC EQU   X'80'     Service Class CPU protection attribute         00578000
SVDEFIPG EQU   X'40'     Service Class assigned to I/O priority group   00579000
SVDEF_INELIGHONORPRIORITY EQU X'20' Service Class Honor Priority       *00580000
                         attribute. When on, specialty engine eligible *00581000
                         work in this service class will not be        *00582000
                         offloaded to CPs for help processing           00583000
SVDEFCAT DS    CL5       Reserved (keep structure on dword boundary     00584000
SVDEFCLA_LEN EQU *-SVDEFCLA                                             00585000
.L0014   ANOP                                                           00586000
         AIF   ('&SVDEFPDA' EQ 'NO').L0018                              00587000
         AIF   ('&DSECT' EQ 'YES').L0019                                00588000
         AIF   ('&SVDEFPDA' NE 'YES').L0018                             00589000
SVDEFPDA DS    0D        Service class period data mapping              00590000
         AGO   .L001A                                                   00591000
.L0019   ANOP                                                           00592000
SVDEFPDA DSECT           Service class period data mapping              00593000
.L001A   ANOP                                                           00594000
SVDEFTYP DS    B         Goal type indicators - mutually exclusive      00595000
*  Bit definitions:                                                     00596000
SVDEFPRC EQU   X'80'     Percentile response time goal                  00597000
SVDEFAVG EQU   X'40'     Average response time goal                     00598000
SVDEFVEL EQU   X'20'     Velocity goal                                  00599000
SVDEFDSC EQU   X'10'     Discretionary goal                             00600000
SVDEFRTU DS    X         Response time unit indicator - indicates the  *00601000
                         units in which the SVDEFVAL field is          *00602000
                         expressed 1 => milliseconds, 2 => seconds 3   *00603000
                         => minutes, 4 => hours                         00604000
SVDEFPER DS    H         Goal percentile value                          00605000
SVDEFIMP DS    H         Importance level 1 (most important) to 5      *00606000
                         (least important). Must be specified for all  *00607000
                         goal types except discretionary (for          *00608000
                         discretionary, importance is ignored)          00609000
         DS    H         Reserved                                       00610000
SVDEFVAL DS    F         Response time goal or speed goal Zero if      *00611000
                         discretionary or if no goal defined            00612000
SVDEFDUR DS    F         Service class period duration, in service     *00613000
                         units, or zero for last period                 00614000
SVDEFPDA_LEN EQU *-SVDEFPDA                                             00615000
.L0018   ANOP                                                           00616000
         AIF   ('&SVDEFRGA' EQ 'NO').L001B                              00617000
         AIF   ('&DSECT' EQ 'YES').L001C                                00618000
         AIF   ('&SVDEFRGA' NE 'YES').L001B                             00619000
.L001C   ANOP                                                           00620000
*                                                                       00621000
*      ***************************************************************  00622000
*      *                                                             *  00623000
*      * Each resource group (SVDEFGRP) requires there be one        *  00624000
*      * resource group attribute entry (SVDEFRGA) which describes   *  00625000
*      * the base service rates of that resource group. In this      *  00626000
*      * "base" resource group attribute entry, the SVDEFRPN field is*  00627000
*      * blanks. There may exist additional resource group attribute *  00628000
*      * entries for "overrides". That is, the service rates of a    *  00629000
*      * resource group (the "attributes") may be overridden from    *  00630000
*      * policy to policy. To override the attributes for a given    *  00631000
*      * resource group for a specific service policy, an additional *  00632000
*      * SVDEFRGA entry must be provided in which the SVDEFRPN field *  00633000
*      * contains the name of the policy to which the resource group *  00634000
*      * attribute "override" pertains. If no override resource group*  00635000
*      * attribute for a specific policy is found when a policy is   *  00636000
*      * being activated from this service definition - in other     *  00637000
*      * words, if no SVDEFRGA entry is found for a particular       *  00638000
*      * resource group (SVDEFGRP) in which the policy name          *  00639000
*      * (SVDEFRPN) matches the name of the policy being activated - *  00640000
*      * then the base attribute entry will be used to express the   *  00641000
*      * service rates of that resource group in the policy being    *  00642000
*      * activated.                                                  *  00643000
*      *                                                             *  00644000
*      ***************************************************************  00645000
*                                                                       00646000
*                                                                       00647000
         AIF   ('&DSECT' EQ 'YES').L001D                                00648000
SVDEFRGA DS    0D        Resource group attributes section              00649000
         AGO   .L001E                                                   00650000
.L001D   ANOP                                                           00651000
SVDEFRGA DSECT           Resource group attributes section              00652000
.L001E   ANOP                                                           00653000
SVDEFRGN DS    CL8       Resource group name                            00654000
SVDEFRPN DS    CL8       Resource group attribute policy name           00655000
SVDEFGMN DS    F         Minimum service rate, in raw CPU service      *00656000
                         units                                          00657000
SVDEFGMX DS    F         Maximum service rate, in raw CPU service      *00658000
                         units                                          00659000
SVDEFGLT DS    BL4       Indicators                                     00660000
*  Bit definitions:                                                     00661000
SVDEFMXS EQU   X'80'     Maximum service rate was specified             00662000
SVDEFMNS EQU   X'40'     Minimum service rate was specified             00663000
SVDEFGPV EQU   X'10'     Service rates in percentage of total LPAR     *00664000
                         capacity                                       00665000
SVDEFGPC EQU   X'08'     Service rates in percentage of a single       *00666000
                         processor                                      00667000
SVDEFMLS EQU   X'04'     Memory limit was specified ?                   00668000
SVDEFISP EQU   X'02'     Include Specialty Processor Consumption was   *00669000
                         specified                                      00670000
SVDEFGMS EQU   X'01'     Service rates in MSU/h                         00671000
SVDEF_MEMORYLIMIT DS F   Maximum memory limit in GB                     00672000
SVDEFRGA_LEN EQU *-SVDEFRGA                                             00673000
.L001B   ANOP                                                           00674000
         AIF   ('&SVDEFCON' EQ 'NO').L001F                              00675000
         AIF   ('&DSECT' EQ 'YES').L0020                                00676000
         AIF   ('&SVDEFCON' NE 'YES').L001F                             00677000
SVDEFCON DS    0D        Constants                                      00678000
         AGO   .L0021                                                   00679000
.L0020   ANOP                                                           00680000
SVDEFCON DSECT           Constants                                      00681000
.L0021   ANOP                                                           00682000
SVDEFFL1 DS    B         Flag 1                                         00683000
*  Bit definitions:                                                     00684000
SVDEFSCO EQU   X'80'     Service coefficients were specified            00685000
SVDEFFL2 DS    B         Flag 2                                         00686000
*  Bit definitions:                                                     00687000
SVDEFIOM EQU   X'80'     When set indicates that we should include the *00688000
                         I/O delays in the execution velocity           00689000
SVDEFDAM EQU   X'40'     When set indicates dynamic alias tuning is    *00690000
                         available                                      00691000
SVDEFIOE EQU   X'20'     When set indicates I/O priority groups are    *00692000
                         enabled                                        00693000
SVDEFDGM EQU   X'10'     When set indicates that Discretionary Goal    *00694000
                         Management is deactivated                      00695000
SVDEFFL3 DS    B         Flag 3 - reserved                              00696000
SVDEFFL4 DS    B         Flag 4 - reserved                              00697000
SVDEFCFF DS    CL16      Service coefficients. Starting with z/OS      *00698000
                         V2R5, the system takes pre-set values         *00699000
                         (CPU=1*10000, SRB=1*10000, IOC=0, MSO=0). Any *00700000
                         deviating values below are ignored             00701000
         ORG   SVDEFCFF                                                 00702000
SVDEFCPU DS    F         CPU service coefficient * 10000 - the number  *00703000
                         by which accumulated CPU service units will   *00704000
                         be multiplied (weighted)                       00705000
SVDEFIOC DS    F         I/O service coefficient * 10000 - the number  *00706000
                         by which accumulated I/O service units will   *00707000
                         be multiplied (weighted)                       00708000
SVDEFMSO DS    F         Storage service coefficient * 10000 - the     *00709000
                         number by which accumulated storage service   *00710000
                         units will be multiplied (weighted)            00711000
SVDEFSRB DS    F         SRB service coefficient * 10000 - the number  *00712000
                         by which accumulated SRB service units will   *00713000
                         be multiplied (weighted)                       00714000
         DS    CL28      Reserved (keep structure on dword boundary)    00715000
SVDEFCON_LEN EQU *-SVDEFCON                                             00716000
.L001F   ANOP                                                           00717000
         AIF   ('&SVDEFEMS' EQ 'NO').L0022                              00718000
         AIF   ('&DSECT' EQ 'YES').L0023                                00719000
         AIF   ('&SVDEFEMS' NE 'YES').L0022                             00720000
SVDEFEMS DS    0D        GPMP settings                                  00721000
         AGO   .L0024                                                   00722000
.L0023   ANOP                                                           00723000
SVDEFEMS DSECT           GPMP settings                                  00724000
.L0024   ANOP                                                           00725000
SVDEFEFL DS    B         Flags                                          00726000
*  Bit definitions:                                                     00727000
SVDEFEAY EQU   X'80'     GPMP should be activated                       00728000
SVDEFALS EQU   X'40'     Reserved                                       00729000
SVDEFALC EQU   X'20'     Reserved                                       00730000
         DS    BL3       Reserved                                       00731000
SVDEFEDP DS    F         Reserved                                       00732000
SVDEFEDN DS    CL256     Reserved                                       00733000
SVDEFSKN DS    CL240     Reserved                                       00734000
         DS    F         Reserved                                       00735000
SVDEFNSY DS    H         Number of host systems to be excluded          00736000
         DS    H         Reserved                                       00737000
SVDEFSYN DS    CL8       Names of host systems to be excluded           00738000
         ORG   SVDEFSYN+256                                             00739000
SVDEFEMS_LEN EQU *-SVDEFEMS                                             00740000
.L0022   ANOP                                                           00741000
         AIF   ('&SVDEFEXT' EQ 'NO').L0025                              00742000
         AIF   ('&DSECT' EQ 'YES').L0026                                00743000
         AIF   ('&SVDEFEXT' NE 'YES').L0025                             00744000
SVDEFEXT DS    0F        Extension section entry                        00745000
         AGO   .L0027                                                   00746000
.L0026   ANOP                                                           00747000
SVDEFEXT DSECT           Extension section entry                        00748000
.L0027   ANOP                                                           00749000
SVDEFVID DS    CL8       Vendor/product id that owns the entry          00750000
SVDEFROB DS    CL8       Related object name - name of object (for     *00751000
                         example, service class name SVDEFCNM) which   *00752000
                         this extension entry extends                   00753000
SVDEFEPN DS    CL8       Related policy name - valid only if this      *00754000
                         entry extends a service class attribute or    *00755000
                         resource group attribute entry (otherwise     *00756000
                         this field is ignored). Note that a value of  *00757000
                         blanks indicates that the attribute which     *00758000
                         this entry extends is a base attribute         00759000
SVDEFEDL DS    H         Extended data length                           00760000
         DS    CL2       Reserved                                       00761000
SVDEFEDO DS    F         Offset to extended data - offset is from the  *00762000
                         beginning of the extended data whose offset   *00763000
                         is in SVDEF_EXT_DATA_OFF                       00764000
*                                                                       00765000
*    *****************************************************************  00766000
*    *                                                               *  00767000
*    * Constants                                                     *  00768000
*    *                                                               *  00769000
*    *****************************************************************  00770000
*                                                                       00771000
*                                                                       00772000
SVDEF_RTU_MS EQU 1       SVDEFRTU value indicating that SVDEFVAL value *00773000
                         is expressed in milliseconds                   00774000
SVDEF_RTU_SECOND EQU 2   SVDEFRTU value indicating that SVDEFVAL value *00775000
                         is expressed in seconds                        00776000
SVDEF_RTU_MINUTE EQU 3   SVDEFRTU value indicating that SVDEFVAL value *00777000
                         is expressed in minutes                        00778000
SVDEF_RTU_HOUR EQU 4     SVDEFRTU value indicating that SVDEFVAL value *00779000
                         is expressed in hours                          00780000
SVDEF_NAME EQU C'SVDE'   'SVDE' acronym                                 00781000
SVDEF_LEVEL001 EQU 1     Functionality level introduced by WLM in      *00782000
                         SP510.                                         00783000
SVDEF_SP510 EQU 1        WLM SP510 version                              00784000
SVDEF_LEVEL002 EQU 2     Functionality level introduced by WLM in      *00785000
                         SP520.                                         00786000
SVDEF_SP520 EQU 2        WLM SP520 version                              00787000
SVDEF_LEVEL003 EQU 3     Functionality level introduced by WLM in      *00788000
                         OS/390 V1R3                                    00789000
SVDEF_SP530 EQU 3        WLM version number for OS/390 V1R3             00790000
SVDEF_LEVEL004 EQU 4     Functionality level introduced by WLM in      *00791000
                         OS/390 V2R4                                    00792000
SVDEF_SP604 EQU 4        WLM version number for OS/390 V2R4             00793000
SVDEF_LEVEL005 EQU 5     Functionality level introduced by WLM in      *00794000
                         OS/390 V2R5                                    00795000
SVDEF_SP605 EQU 5        WLM version number for OS/390 V2R5             00796000
SVDEF_LEVEL006 EQU 6     Functionality level introduced by WLM in      *00797000
                         OS/390 V2R6                                    00798000
SVDEF_SP606 EQU 6        WLM version number for OS/390 V2R6             00799000
SVDEF_LEVEL007 EQU 7     Functionality level introduced by WLM in      *00800000
                         OS/390 V2R7                                    00801000
SVDEF_SP607 EQU 7        WLM version number for OS/390 V2R7             00802000
SVDEF_LEVEL008 EQU 8     Functionality level introduced by WLM in      *00803000
                         OS/390 V2R7                                    00804000
SVDEF_SP608 EQU 8        WLM version number for OS/390 V2R7             00805000
SVDEF_LEVEL009 EQU 9     Functionality level reserved for WLM OS/390   *00806000
                         V2R8                                           00807000
SVDEF_RESERVED_R08 EQU 9 WLM version number reserved for OS/390 V2R8    00808000
SVDEF_LEVEL010 EQU 10    Functionality level reserved for WLM OS/390   *00809000
                         V2R9                                           00810000
SVDEF_RESERVED_R09 EQU 10 WLM version number reserved for OS/390 V2R9   00811000
SVDEF_LEVEL011 EQU 11    Functionality level introduced by WLM in      *00812000
                         OS/390 V2R10                                   00813000
SVDEF_SP703 EQU 11       WLM version number for OS/390 V2R10            00814000
SVDEF_LEVEL012 EQU 12    Functionality level reserved for WLM OS/390   *00815000
                         V2R11                                          00816000
SVDEF_RESERVED_R11 EQU 12 WLM version number reserved for OS/390 V2R11  00817000
SVDEF_LEVEL013 EQU 13    Functionality level introduced by WLM in      *00818000
                         OS/390 V2R12                                   00819000
SVDEF_SP705 EQU 13       WLM version number for OS/390 V2R12            00820000
SVDEF_LEVEL014 EQU 14    Functionality level reserved for WLM in z/OS  *00821000
                         V1R3                                           00822000
SVDEF_RESERVED_R13 EQU 14 WLM version number reserved for z/OS V1R3     00823000
SVDEF_LEVEL015 EQU 15    Functionality level reserved for WLM in z/OS  *00824000
                         V1R4                                           00825000
SVDEF_RESERVED_R14 EQU 15 WLM version number reserved for z/OS V1R4     00826000
SVDEF_LEVEL016 EQU 16    Functionality level reserved for WLM in z/OS  *00827000
                         V1R5                                           00828000
SVDEF_RESERVED_R15 EQU 16 WLM version number reserved for z/OS V1R5     00829000
SVDEF_LEVEL017 EQU 17    Functionality level introduced by WLM in z/OS *00830000
                         V1R6                                           00831000
SVDEF_SP709 EQU 17       WLM version number in z/OS V1R6                00832000
SVDEF_RESERVED_R16 EQU 17 WLM version number reserved for z/OS V1R16    00833000
SVDEF_LEVEL018 EQU 18    Functionality level reserved for WLM z/OS     *00834000
                         V1R17                                          00835000
SVDEF_RESERVED_R17 EQU 18 WLM version number reserved for z/OS V1R17    00836000
SVDEF_LEVEL019 EQU 19    Functionality level introduced with WLM z/OS  *00837000
                         V1R18                                          00838000
SVDEF_SP730 EQU 19       WLM version number introduced with z/OS V1R18  00839000
SVDEF_LEVEL020 EQU 20    Functionality level reserved for WLM z/OS     *00840000
                         V1R18 APARS etc                                00841000
SVDEF_LEVEL021 EQU 21    Functionality level introduced with WLM z/OS  *00842000
                         V1R10                                          00843000
SVDEF_SP750 EQU 21       WLM version number introduced with z/OS V1R10  00844000
SVDEF_LEVEL022 EQU 22    Functionality level reserved for WLM z/OS     *00845000
                         V1R10 APARS etc                                00846000
SVDEF_LEVEL023 EQU 23    Functionality level introduced with WLM z/OS  *00847000
                         V1R11                                          00848000
SVDEF_SP760 EQU 23       WLM version number introduced with z/OS V1R11  00849000
SVDEF_LEVEL025 EQU 25    Functionality level introduced with WLM z/OS  *00850000
                         V1R12                                          00851000
SVDEF_SP770 EQU 25       WLM version number introduced with z/OS V1R12  00852000
SVDEF_LEVEL029 EQU 29    Functionality level introduced with WLM z/OS  *00853000
                         V2R1                                           00854000
SVDEF_SP790 EQU 29       WLM version number introduced with z/OS V2R1   00855000
SVDEF_LEVEL030 EQU 30    Functionality level introduced for Special    *00856000
                         Reporting                                      00857000
SVDEF_LEVEL031 EQU 31    Functionality level introduced for Specialty  *00858000
                         Engines Containment                            00859000
SVDEF_LEVEL032 EQU 32    Functionality level introduced for Workload   *00860000
                         billing groups                                 00861000
SVDEF_SP7B0 EQU 35       WLM version number introduced with z/OS V2R3   00862000
SVDEF_LEVEL035 EQU 35    Functionality level introduced with WLM z/OS  *00863000
                         V2R3                                           00864000
SVDEF_LEVEL038 EQU 38    Functionality level introduced for System     *00865000
                         Recovery Boost stage 3                         00866000
SVDEF_CURRENT_VER EQU 38 Current version level used when checking      *00867000
                         functionality within WLM product               00868000
SVDEFEXT_LEN EQU *-SVDEFEXT                                             00869000
.L0025   ANOP                                                           00870000
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 00871000
         AIF   ('&LIST' EQ 'YES').P4                                    00872000
.P3      ANOP                                                           00873000
         POP   PRINT                                                    00874000
.P4      ANOP                                                           00875000
.P_EXIT  ANOP                                                           00876000
         MEND                                                           00877000
**/ ;                                                                   00878000
* %IWMSVDEF_INCLUDED = 'YES';                                           00879000
* %DCL ZCBPRINT CHAR EXT;                                               00880000
* %DEACTIVATE ZCBPRINT;                                                 00881000
* %DCL IWMSVDEF_LIST CHAR EXT;                                          00882000
* %DEACTIVATE IWMSVDEF_LIST;                                            00883000
* %IF IWMSVDEF_LIST = 'NO' !                                            00884000
*    ZCBPRINT = 'NO' %THEN                                              00885000
* %DO;                                                                  00886000
*   @LIST PUSH NOECHO;                                                  00887000
*   @LIST NOASSEMBLE NOECHO;                                            00888000
*   @LIST OFF C NOECHO;                                                 00889000
* %END;                                                                 00890000
*/* Start of PL/X Source                                             */ 00891000
*                                                                       00892000
* DCL 1 SVDEFHDR BASED,                                                 00893000
*     3 SVDEFNAM CHAR(4),      /* Eyecatcher (SVDE)                  */ 00894000
*     3 SVDEFLVL FIXED(8),     /* Functionality level of the SVDEF.     00895000
*                                 The functionality level defines       00896000
*                                 the highest level of WLM function     00897000
*                                 that exists in the SVDEF.          */ 00898000
*     3 SVDEFWVN FIXED(8),     /* WLM version number                 */ 00899000
*     3 SVDEFDIL FIXED(16),    /* Size of header section             */ 00900000
*     3 SVDEFDES CHAR(32),     /* Service definition description     */ 00901000
*     3 SVDEFSIZ FIXED(32),    /* Size of SVDEF                      */ 00902000
*     3 SVDEFPO FIXED(32),     /* Offset of policy section if the       00903000
*                                 number of policies is nonzero         00904000
*                                 (otherwise this field is ignored)  */ 00905000
*     3 SVDEFPN FIXED(16),     /* Number of policy entries           */ 00906000
*     3 SVDEFPS FIXED(16),     /* Size of policy entry               */ 00907000
*     3 SVDEFWO FIXED(32),     /* Offset of workload section if the     00908000
*                                 number of workloads is nonzero        00909000
*                                 (otherwise this field is ignored)  */ 00910000
*     3 SVDEFWN FIXED(16),     /* Number of workload entries         */ 00911000
*     3 SVDEFWS FIXED(16),     /* Size of workload entry             */ 00912000
*     3 SVDEFCO FIXED(32),     /* Offset of service class section if    00913000
*                                 number of service classes is nonzero  00914000
*                                 (otherwise this field is ignored)  */ 00915000
*     3 SVDEFCN FIXED(16),     /* Number of service class entries    */ 00916000
*     3 SVDEFCS FIXED(16),     /* Size of service class entry        */ 00917000
*     3 SVDEFGO FIXED(32),     /* Offset of resource group section if   00918000
*                                 number of resource groups is nonzero  00919000
*                                 (otherwise this field is ignored)  */ 00920000
*     3 SVDEFGN FIXED(16),     /* Number of resource group entries   */ 00921000
*     3 SVDEFGS FIXED(16),     /* Size of resource group entry       */ 00922000
*     3 SVDEFRO FIXED(32),     /* Offset of report class section if     00923000
*                                 number of report classes is nonzero   00924000
*                                 (otherwise this field is ignored)  */ 00925000
*     3 SVDEFRN FIXED(16),     /* Number of report class entries     */ 00926000
*     3 SVDEFRS FIXED(16),     /* Size of report class entry         */ 00927000
*     3 SVDEFCAO FIXED(32),    /* Offset of service class attribute     00928000
*                                 section if number of service class    00929000
*                                 attributes is nonzero                 00930000
*                                 (otherwise this field is ignored)  */ 00931000
*     3 SVDEFCAN FIXED(16),    /* Number of service class attribute     00932000
*                                 entries                            */ 00933000
*     3 SVDEFCAS FIXED(16),    /* Size of service class attribute       00934000
*                                 entry                              */ 00935000
*     3 SVDEFGAO FIXED(32),    /* Offset of resource group attribute    00936000
*                                 section if number of service class    00937000
*                                 attributes is nonzero                 00938000
*                                 (otherwise this field is ignored)  */ 00939000
*     3 SVDEFGAN FIXED(16),    /* Number of resource group attribute    00940000
*                                 entries                            */ 00941000
*     3 SVDEFGAS FIXED(16),    /* Size of resource group attribute      00942000
*                                 entry                              */ 00943000
*     3 SVDEFCNO FIXED(32),    /* Offset of constant information        00944000
*                                 section                            */ 00945000
*     3 SVDEFCNS FIXED(16),    /* Size of constant information entry */ 00946000
*     3 SVDEFCPS FIXED(16),    /* Size of each service class period     00947000
*                                 entry                              */ 00948000
*     3 SVDEFID,               /* Service definition id starts here     00949000
*                                 (can be mapped by SVIDSSVD in         00950000
*                                 IWMSVIDS)                          */ 00951000
*       5 SVDEFIDN CHAR(8),    /* Service definition name            */ 00952000
*       5 SVDEFTDI CHAR(8),    /* Timestamp (STCK format) in local time 00953000
*                                 the service definition was installed  00954000
*                                 (on install processing (IWMDINST)     00955000
*                                 this field is set by WLM)          */ 00956000
*       5 SVDEFIDU CHAR(8),    /* Userid of the service administrator   00957000
*                                 that installed the service definition 00958000
*                                 (on install processing (IWMDINST)     00959000
*                                 this field is set by WLM)          */ 00960000
*       5 SVDEFIDS CHAR(8),    /* Name of the system on which the       00961000
*                                 service definition was installed      00962000
*                                 (on install processing (IWMDINST)     00963000
*                                 this field is set by WLM)          */ 00964000
*     3 *        CHAR(32),     /* Reserved for additional triplets      00965000
*                                                                @L1A*/ 00966000
*     3 SVDEFPRO CHAR(32),     /* ID of product which performed the     00967000
*                                 installation (mapped by SVIDSPRD)     00968000
*                                                                @L1A*/ 00969000
*     3 SVDEF_EXT_OFF FIXED(32), /* Offset of service definition        00970000
*                                 extension section if number of        00971000
*                                 service definition extensions         00972000
*                                 is nonzero (otherwise this field      00973000
*                                 is ignored)                    @L1A*/ 00974000
*     3 SVDEF_EXT_NUM FIXED(16), /* Number of service definition        00975000
*                                   extension entries            @L1A*/ 00976000
*     3 SVDEF_EXT_SIZ FIXED(16), /* Size of service definition          00977000
*                                   extension entry              @L1A*/ 00978000
*     3 SVDEF_SP_EXT_OFF FIXED(32), /* Offset of policy extension       00979000
*                                 section if number of policy           00980000
*                                 extensions is nonzero (otherwise      00981000
*                                 this field is ignored)         @L1A*/ 00982000
*     3 SVDEF_SP_EXT_NUM FIXED(16), /* Number of policy extension       00983000
*                                      entries                   @L1A*/ 00984000
*     3 SVDEF_SP_EXT_SIZ FIXED(16), /* Size of policy extension         00985000
*                                      entry                     @L1A*/ 00986000
*     3 SVDEF_WD_EXT_OFF FIXED(32), /* Offset of workload extension     00987000
*                                 section if number of workload         00988000
*                                 extensions is nonzero (otherwise      00989000
*                                 this field is ignored)         @L1A*/ 00990000
*     3 SVDEF_WD_EXT_NUM FIXED(16), /* Number of workload extension     00991000
*                                      entries                   @L1A*/ 00992000
*     3 SVDEF_WD_EXT_SIZ FIXED(16), /* Size of workload extension       00993000
*                                      entry                     @L1A*/ 00994000
*     3 SVDEF_CD_EXT_OFF FIXED(32), /* Offset of service class          00995000
*                                 extension section if number of        00996000
*                                 service class extensions is nonzero   00997000
*                                 (otherwise this field is ignored)     00998000
*                                                                @L1A*/ 00999000
*     3 SVDEF_CD_EXT_NUM FIXED(16), /* Number of service class          01000000
*                                      extension entries         @L1A*/ 01001000
*     3 SVDEF_CD_EXT_SIZ FIXED(16), /* Size of service class            01002000
*                                      extension entry           @L1A*/ 01003000
*     3 SVDEF_RG_EXT_OFF FIXED(32), /* Offset of resource group         01004000
*                                 extension section if number of        01005000
*                                 resource group extensions is nonzero  01006000
*                                 (otherwise this field is ignored)     01007000
*                                                                @L1A*/ 01008000
*     3 SVDEF_RG_EXT_NUM FIXED(16), /* Number of resource group         01009000
*                                      extension entries         @L1A*/ 01010000
*     3 SVDEF_RG_EXT_SIZ FIXED(16), /* Size of resource group           01011000
*                                      extension entry           @L1A*/ 01012000
*     3 SVDEF_RD_EXT_OFF FIXED(32), /* Offset of report class           01013000
*                                 extension section if number of        01014000
*                                 report class extensions is nonzero    01015000
*                                 (otherwise this field is ignored)     01016000
*                                                                @L1A*/ 01017000
*     3 SVDEF_RD_EXT_NUM FIXED(16), /* Number of report class           01018000
*                                      extension entries         @L1A*/ 01019000
*     3 SVDEF_RD_EXT_SIZ FIXED(16), /* Size of report class             01020000
*                                      extension entry           @L1A*/ 01021000
*     3 SVDEF_CLA_EXT_OFF FIXED(32), /* Offset of service class         01022000
*                                 attribute extension section if        01023000
*                                 number of service class attribute     01024000
*                                 extensions is nonzero (otherwise      01025000
*                                 this field is ignored)         @L1A*/ 01026000
*     3 SVDEF_CLA_EXT_NUM FIXED(16), /* Number of service class         01027000
*                                      attribute extension entries      01028000
*                                                                @L1A*/ 01029000
*     3 SVDEF_CLA_EXT_SIZ FIXED(16), /* Size of service class           01030000
*                                      attribute extension entry        01031000
*                                                                @L1A*/ 01032000
*     3 SVDEF_RGA_EXT_OFF FIXED(32), /* Offset of resource group        01033000
*                                 attribute extension section if        01034000
*                                 number of resource class attribute    01035000
*                                 extensions is nonzero (otherwise      01036000
*                                 this field is ignored)         @L1A*/ 01037000
*     3 SVDEF_RGA_EXT_NUM FIXED(16), /* Number of resource group        01038000
*                                      attribute extension entries      01039000
*                                                                @L1A*/ 01040000
*     3 SVDEF_RGA_EXT_SIZ FIXED(16), /* Size of resource group          01041000
*                                      attribute extension entry        01042000
*                                                                @L1A*/ 01043000
*     3 SVDEF_EWLM_MS_OFF FIXED(32), /* Offset of GPMP settings         01044000
*                                       section              @OA30928*/ 01045000
*     3 SVDEF_EWLM_MS_SIZ FIXED(16), /* Length of GPMP settings         01046000
*                                       entry                @ME17808*/ 01047000
*     3 SVDEF_EWLM_MS_NUM FIXED(16), /* Number of GPMP settings         01048000
*                                       entries              @ME17808*/ 01049000
*     3 *        CHAR(24),  /* Reserved for additional extension        01050000
*                              triplets                      @LEWMSMC*/ 01051000
*     3 SVDEF_EXT_DATA_OFF FIXED(32), /* Offset of extended data        01052000
*                              (0 if no extended data exists)    @L1A*/ 01053000
*     3 SVDEF_EXT_DATA_LEN FIXED(32), /* Length of extended data @L1A*/ 01054000
*     3 SVDEF_CODEPAGE     CHAR(40),  /* Codepage used to create     */ 01055000
*                                     /* service definition   @LPOLMP*/ 01056000
*     3 *        CHAR(4),             /* Reserved             @LPOLMP*/ 01057000
*     3 *        CHAR(0) BDY(DWORD), /*                          @L1A*/ 01058000
*                                                                       01059000
*   1 SVDEFPOL BASED(ADDR(SVDEFHDR) + SVDEFPO), /* Service              01060000
*                              policy section                        */ 01061000
*     3 SVDEFPNM CHAR(8),   /* Policy name                           */ 01062000
*     3 SVDEFPDE CHAR(32),  /* Policy description                    */ 01063000
*     3 SVDEFPIU CHAR(8),   /* Userid of policy creator              */ 01064000
*     3 SVDEFPIT CHAR(8),   /* Timestamp of initial creation         */ 01065000
*     3 SVDEFPRU CHAR(8),   /* Userid of policy last update          */ 01066000
*     3 SVDEFPRT CHAR(8),   /* Timestamp of policy last update       */ 01067000
*     3 *        CHAR(0) BDY(DWORD), /*                          @L1A*/ 01068000
*                                                                       01069000
*   1 SVDEFWKL BASED(ADDR(SVDEFHDR) + SVDEFWO), /* Workload             01070000
*                              section                               */ 01071000
*     3 SVDEFWNM CHAR(8),   /* Workload name                         */ 01072000
*     3 SVDEFWDE CHAR(32),  /* Workload description                  */ 01073000
*     3 SVDEFWIU CHAR(8),   /* Userid of workload creator            */ 01074000
*     3 SVDEFWIT CHAR(8),   /* Timestamp of initial creation         */ 01075000
*     3 SVDEFWRU CHAR(8),   /* Userid of workload last update        */ 01076000
*     3 SVDEFWRT CHAR(8),   /* Timestamp of workload last update     */ 01077000
*     3 *        CHAR(0) BDY(DWORD), /*                          @L1A*/ 01078000
*                                                                       01079000
*   1 SVDEFSCL BASED(ADDR(SVDEFHDR) + SVDEFCO), /* Service              01080000
*                              class section                         */ 01081000
*     3 SVDEFCNM CHAR(8),   /* Service class name                    */ 01082000
*     3 SVDEFCDE CHAR(32),  /* Service class description             */ 01083000
*     3 SVDEFCWN CHAR(8),   /* Name of associated workload           */ 01084000
*     3 SVDEFCIU CHAR(8),   /* Userid of service class creator       */ 01085000
*     3 SVDEFCIT CHAR(8),   /* Timestamp of initial creation         */ 01086000
*     3 SVDEFCRU CHAR(8),   /* Userid of service class last update   */ 01087000
*     3 SVDEFCRT CHAR(8),   /* Timestamp of service class last          01088000
*                              update                                */ 01089000
*     3 *        CHAR(0) BDY(DWORD), /*                          @L1A*/ 01090000
*                                                                       01091000
*   1 SVDEFGRP BASED(ADDR(SVDEFHDR) + SVDEFGO), /* Resource             01092000
*                              group section                         */ 01093000
*     3 SVDEFGNM CHAR(8),   /* Resource group name                   */ 01094000
*     3 SVDEFGDE CHAR(32),  /* Resource group description            */ 01095000
*     3 SVDEFGIU CHAR(8),   /* Userid of resource group creator      */ 01096000
*     3 SVDEFGIT CHAR(8),   /* Timestamp of initial creation         */ 01097000
*     3 SVDEFGRU CHAR(8),   /* Userid of resource group last update  */ 01098000
*     3 SVDEFGRT CHAR(8),   /* Timestamp of resource group last         01099000
*                              update                                */ 01100000
*     3 SVDEFGFL BIT(32),   /* Indicators                    @LWBGRPA*/ 01101000
*       5 SVDEFTRG BIT(1),  /* This is a Tenant Resource Group          01102000
*                                                            @LWBGRPA*/ 01103000
*       5 SVDEFTRG_HWContainer BIT(1), /* This is a Tenant Resource     01104000
*                              Group which is enabled for zCBP.         01105000
*                                                            @LHWCONA*/ 01106000
*     3 *        CHAR(4),   /* Reserved to align to DWORD boundary      01107000
*                                                            @LWBGRPA*/ 01108000
*     3 SVDEF_TenantID CHAR(8), /* ID of associated Tenant   @LWBGRPA*/ 01109000
*     3 SVDEF_TenantName CHAR(32), /* Name of associated Tenant         01110000
*                                                            @LWBGRPA*/ 01111000
*     3 SVDEF_TRGSolutionId CHAR(64), /* Solution Id of the Tenant      01112000
*                              Resource Group                @LWBGRPA*/ 01113000
*     3 *        CHAR(0) BDY(DWORD), /*                          @L1A*/ 01114000
*                                                                       01115000
*   1 SVDEFRCL BASED(ADDR(SVDEFHDR) + SVDEFRO), /* Report               01116000
*                              class section                         */ 01117000
*     3 SVDEFRNM CHAR(8),   /* Report class name                     */ 01118000
*     3 SVDEFRDE CHAR(32),  /* Report class description              */ 01119000
*     3 SVDEFRIU CHAR(8),   /* Userid of report class creator        */ 01120000
*     3 SVDEFRIT CHAR(8),   /* Timestamp of initial creation         */ 01121000
*     3 SVDEFRRU CHAR(8),   /* Userid of report class last              01122000
*                              update                                */ 01123000
*     3 SVDEFRRT CHAR(8),   /* Timestamp of report class                01124000
*                              recent update                         */ 01125000
*     3 SVDEFRFL BIT(32),   /* Indicators                    @LWBGRPA*/ 01126000
*       5 SVDEFTRC BIT(1),  /* This is a Tenant Report Class @LWBGRPA*/ 01127000
*     3 *        CHAR(4),   /* Reserved to align to DWORD boundary      01128000
*                                                            @LWBGRPA*/ 01129000
*     3 SVDEF_TRG_Name CHAR(8), /* Name of associated Tenant Resource   01130000
*                              Group                         @LWBGRPA*/ 01131000
*     3 *        CHAR(0) BDY(DWORD), /*                          @L1A*/ 01132000
*                                                                       01133000
*   /* Each service class (SVDEFSCL) requires there be one service      01134000
*      class attribute entry (SVDEFCLA) which describes the base        01135000
*      performance characteristics of that service class. In this       01136000
*      "base" service class attribute entry, the SVDEFSPN field is      01137000
*      blanks.                                                          01138000
*                                                                       01139000
*      There may exist additional service class attribute entries for   01140000
*      "overrides". That is, the performance characteristics of a       01141000
*      service class (the "attributes") may be overridden from policy   01142000
*      to policy.                                                       01143000
*                                                                       01144000
*      To override the attributes for a given service class for a       01145000
*      specific service policy, an additional SVDEFCLA entry must       01146000
*      be provided in which the SVDEFSPN field contains the name of     01147000
*      the policy to which the service class attribute "override"       01148000
*      pertains.                                                        01149000
*                                                                       01150000
*      If no override service class attribute for a specific policy is  01151000
*      found when a policy is being activated from this service         01152000
*      definition - in other words, if no SVDEFCLA entry is found for   01153000
*      a particular service class (SVDEFSCL) in which the policy name   01154000
*      (SVDEFSPN) matches the name of the policy being activated -      01155000
*      then the base attribute entry will be used to express the        01156000
*      performance characteristics of that service class in the         01157000
*      policy being activated                                        */ 01158000
*                                                                       01159000
*   1 SVDEFCLA BASED(ADDR(SVDEFHDR) + SVDEFCAO), /* Service             01160000
*                              class attributes section              */ 01161000
*     3 SVDEFSCN CHAR(8),   /* Service class name with which this       01162000
*                              attribute is associated               */ 01163000
*     3 SVDEFSPN CHAR(8),   /* Name of policy that service class        01164000
*                              attribute is associated with (this       01165000
*                              field will be blanks if it is a base     01166000
*                              attribute)                            */ 01167000
*     3 SVDEFCGN CHAR(8),   /* Name of the resource group this service  01168000
*                              class is associated with - blanks if no  01169000
*                              resource group association            */ 01170000
*     3 SVDEFCPN FIXED(16), /* Number of service class periods for      01171000
*                              this service class attribute          */ 01172000
*     3 SVDEFFLG CHAR(1),   /* Service Class Attribute                  01173000
*                                                            @WLMPGMC*/ 01174000
*       5 SVDEFCPC BIT(1),  /* Service Class CPU protection attribute   01175000
*                                                            @WLMPGMC*/ 01176000
*       5 SVDEFIPG BIT(1),  /* Service Class assigned to I/O            01177000
*                              priority group                @LIOMGTA*/ 01178000
*       5 SVDEF_InEligHonorPriority BIT(1),                          /* 01179000
*                              Service Class Honor Priority attribute.  01180000
*                              When on, specialty engine eligible       01181000
*                              work in this service class will not      01182000
*                              be offloaded to CPs for help processing  01183000
*                                                            @OA50845*/ 01184000
*       5 *        BIT(5),  /* Reserved bit for future releases         01185000
*                                                            @OA50845*/ 01186000
*     3 SVDEFCAT CHAR(5),   /* Reserved (keep structure on dword        01187000
*                              boundary                          @L1C*/ 01188000
*     3 *        CHAR(0) BDY(DWORD), /*                          @L1A*/ 01189000
*                                                                       01190000
*   1 SVDEFPDA BASED, /* Service class period                           01191000
*                              data mapping                          */ 01192000
*     3 SVDEFTYP BIT(8),    /* Goal type indicators - mutually          01193000
*                              exclusive                             */ 01194000
*       5 SVDEFPRC BIT(1),  /* Percentile response time goal         */ 01195000
*       5 SVDEFAVG BIT(1),  /* Average response time goal            */ 01196000
*       5 SVDEFVEL BIT(1),  /* Velocity goal                         */ 01197000
*       5 SVDEFDSC BIT(1),  /* Discretionary goal                    */ 01198000
*     3 SVDEFRTU FIXED(8),  /* Response time unit indicator - indicates 01199000
*                              the units in which the SVDEFVAL field is 01200000
*                              expressed                                01201000
*                              1 => milliseconds, 2 => seconds          01202000
*                              3 => minutes, 4 => hours              */ 01203000
*     3 SVDEFPER FIXED(16), /* Goal percentile value        */          01204000
*     3 SVDEFIMP FIXED(16), /* Importance level 1 (most important) to   01205000
*                              5 (least important). Must be specified   01206000
*                              for all goal types except discretionary  01207000
*                              (for discretionary, importance is        01208000
*                              ignored)                              */ 01209000
*     3 *        FIXED(16), /* Reserved                              */ 01210000
*     3 SVDEFVAL FIXED(32), /* Response time goal or speed goal         01211000
*                              Zero if discretionary or if no goal      01212000
*                              defined                               */ 01213000
*     3 SVDEFDUR FIXED(32), /* Service class period duration, in        01214000
*                              service units, or zero for last period*/ 01215000
*     3 *        CHAR(0) BDY(DWORD), /*                          @L1A*/ 01216000
*                                                                       01217000
*   /* Each resource group (SVDEFGRP) requires there be one             01218000
*      resource group attribute entry (SVDEFRGA) which describes the    01219000
*      base service rates of that resource group. In this "base"        01220000
*      resource group attribute entry, the SVDEFRPN field is blanks.    01221000
*                                                                       01222000
*      There may exist additional resource group attribute entries for  01223000
*      "overrides". That is, the service rates of a resource group      01224000
*      (the "attributes") may be overridden from policy to policy.      01225000
*                                                                       01226000
*      To override the attributes for a given resource group for a      01227000
*      specific service policy, an additional SVDEFRGA entry must       01228000
*      be provided in which the SVDEFRPN field contains the name of     01229000
*      the policy to which the resource group attribute "override"      01230000
*      pertains.                                                        01231000
*                                                                       01232000
*      If no override resource group attribute for a specific policy is 01233000
*      found when a policy is being activated from this service         01234000
*      definition - in other words, if no SVDEFRGA entry is found for   01235000
*      a particular resource group (SVDEFGRP) in which the policy name  01236000
*      (SVDEFRPN) matches the name of the policy being activated -      01237000
*      then the base attribute entry will be used to express the        01238000
*      service rates of that resource group in the policy being         01239000
*      activated.                                                    */ 01240000
*                                                                       01241000
*   1 SVDEFRGA BASED(ADDR(SVDEFHDR) + SVDEFGAO), /* Resource            01242000
*                              group attributes section              */ 01243000
*     3 SVDEFRGN CHAR(8),   /* Resource group name                   */ 01244000
*     3 SVDEFRPN CHAR(8),   /* Resource group attribute policy name  */ 01245000
*     3 SVDEFGMN FIXED(32), /* Minimum service rate, in raw CPU         01246000
*                              service units                         */ 01247000
*     3 SVDEFGMX FIXED(32), /* Maximum service rate, in raw CPU         01248000
*                              service units                         */ 01249000
*     3 SVDEFGLT BIT(32),   /* Indicators                            */ 01250000
*       5 SVDEFMXS BIT(1),  /* Maximum service rate was specified    */ 01251000
*       5 SVDEFMNS BIT(1),  /* Minimum service rate was specified    */ 01252000
*       5 *        BIT(1),  /* Reserved bit to be consistent with       01253000
*                              SVPOLGSD field in SVPOL structure -      01254000
*                              not used in SVDEF             @WLMPEEG*/ 01255000
*       5 SVDEFGPV BIT(1),  /* Service rates in percentage of total     01256000
*                              LPAR capacity                 @WLMPEEG*/ 01257000
*       5 SVDEFGPC BIT(1),  /* Service rates in percentage of a single  01258000
*                              processor                     @WLMPEEG*/ 01259000
*       5 SVDEFMLS BIT(1),  /* Memory limit was specified ?  @OA50845*/ 01260000
*       5 SVDEFISP BIT(1),  /* Include Specialty Processor Consumption  01261000
*                              was specified                 @LWBGRPA*/ 01262000
*       5 SVDEFGMS BIT(1),  /* Service rates in MSU/h        @LWBGRPA*/ 01263000
*     3 SVDEF_MemoryLimit FIXED(32), /* Maximum memory limit in GB      01264000
*                                                            @OA50845*/ 01265000
*     3 *        CHAR(0) BDY(DWORD), /*                          @L1A*/ 01266000
*                                                                       01267000
*   1 SVDEFCON BASED(ADDR(SVDEFHDR) + SVDEFCNO), /* Constants           01268000
*                                                                    */ 01269000
*     3 SVDEFFL1 BIT(8),    /* Flag 1                        @PQC1647*/ 01270000
*       5 SVDEFSCO BIT(1),  /* Service coefficients were specified   */ 01271000
*     3 SVDEFFL2 BIT(8),    /* Flag 2                        @PQC1647*/ 01272000
*       5 SVDEFIOM BIT(1),  /* When set indicates that we    @PQC2520   01273000
*                              should include the I/O        @PQC2520   01274000
*                              delays in the execution velocity      */ 01275000
*       5 SVDEFDAM BIT(1),  /* When set indicates dynamic alias tuning  01276000
*                              is available                  @OW39854*/ 01277000
*       5 SVDEFIOE BIT(1),  /* When set indicates I/O priority groups   01278000
*                              are enabled                   @OA41645*/ 01279000
*       5 SVDEFDGM BIT(1),  /* When set indicates that Discretionary    01280000
*                              Goal Management is deactivated           01281000
*                                                            @LWBGRPA*/ 01282000
*     3 SVDEFFL3 BIT(8),    /* Flag 3 - reserved             @PQC1647*/ 01283000
*     3 SVDEFFL4 BIT(8),    /* Flag 4 - reserved             @PQC1647*/ 01284000
*     3 SVDEFCFF,           /* Service coefficients. Starting with      01285000
*                              z/OS V2R5, the system takes pre-set      01286000
*                              values (CPU=1*10000, SRB=1*10000,        01287000
*                              IOC=0, MSO=0). Any deviating values      01288000
*                              below are ignored             @LCOEFFA*/ 01289000
*       5 SVDEFCPU FIXED(32), /* CPU service coefficient * 10000 - the  01290000
*                              number by which accumulated CPU service  01291000
*                              units will be multiplied (weighted)   */ 01292000
*       5 SVDEFIOC FIXED(32), /* I/O service coefficient * 10000 - the  01293000
*                              number by which accumulated I/O service  01294000
*                              units will be multiplied (weighted)   */ 01295000
*       5 SVDEFMSO FIXED(32), /* Storage service coefficient * 10000 -  01296000
*                              the number by which accumulated storage  01297000
*                              service units will be multiplied         01298000
*                              (weighted)                            */ 01299000
*       5 SVDEFSRB FIXED(32), /* SRB service coefficient * 10000 - the  01300000
*                              number by which accumulated SRB service  01301000
*                              units will be multiplied (weighted)   */ 01302000
*     3 *        CHAR(28),  /* Reserved (keep structure on dword        01303000
*                              boundary)                         @L1C*/ 01304000
*     3 *        CHAR(0) BDY(DWORD), /*                          @L1A*/ 01305000
*                                                                       01306000
*   1 SVDEFEMS BASED(ADDR(SVDEFHDR) + SVDEF_EWLM_MS_OFF), /*            01307000
*                              GPMP settings                 @OA30928*/ 01308000
*     3 SVDEFEFL BIT(8),    /* Flags                         @LEWMSMA*/ 01309000
*       5 SVDEFEAY BIT(1),  /* GPMP should be activated      @ME17808*/ 01310000
*       5 SVDEFALS BIT(1),  /* Reserved                      @ME17808*/ 01311000
*       5 SVDEFALC BIT(1),  /* Reserved                      @ME17808*/ 01312000
*     3 *        BIT(24),   /* Reserved                      @LEWMSMA*/ 01313000
*     3 SVDEFEDP FIXED(32), /* Reserved                      @ME17808*/ 01314000
*     3 SVDEFEDN CHAR(256), /* Reserved                      @ME17808*/ 01315000
*     3 SVDEFSKN CHAR(240), /* Reserved                      @ME17808*/ 01316000
*     3 *        FIXED(32), /* Reserved                      @LEWMSMA*/ 01317000
*     3 SVDEFNSY FIXED(16), /* Number of host systems to be excluded    01318000
*                                                            @LEWMSMA*/ 01319000
*     3 *        FIXED(16), /* Reserved                      @LEWMSMA*/ 01320000
*     3 SVDEFSYN(32) CHAR(8),  /* Names of host systems to be           01321000
*                                 excluded                   @LEWMSMA*/ 01322000
*     3 *        CHAR(0) BDY(DWORD), /*                      @LEWMSMA*/ 01323000
*                                                                       01324000
*   1 SVDEFEXT BASED,       /* Extension section entry           @L1A*/ 01325000
*     3 SVDEFVID CHAR(8),   /* Vendor/product id that owns the          01326000
*                              entry                             @L1A*/ 01327000
*     3 SVDEFROB CHAR(8),   /* Related object name - name of object     01328000
*                              (for example, service class name         01329000
*                              SVDEFCNM) which this extension entry     01330000
*                              extends                           @L1A*/ 01331000
*     3 SVDEFEPN CHAR(8),   /* Related policy name - valid only if      01332000
*                              this entry extends a service class       01333000
*                              attribute or resource group attribute    01334000
*                              entry (otherwise this field is           01335000
*                              ignored). Note that a value of blanks    01336000
*                              indicates that the attribute which this  01337000
*                              entry extends is a base attribute @L1A*/ 01338000
*     3 SVDEFEDL FIXED(16), /* Extended data length              @L1A*/ 01339000
*     3 *        CHAR(2),   /* Reserved                          @L1A*/ 01340000
*     3 SVDEFEDO FIXED(32); /* Offset to extended data - offset is from 01341000
*                              the beginning of the extended data whose 01342000
*                              offset is in SVDEF_EXT_DATA_OFF   @P1C*/ 01343000
*                                                                       01344000
*   /*****************************************************************/ 01345000
*   /*                                                               */ 01346000
*   /* Constants                                                     */ 01347000
*   /*                                                               */ 01348000
*   /*****************************************************************/ 01349000
*                                                                       01350000
*   DECLARE                                                             01351000
*     SVDEF_RTU_MS FIXED(8) CONSTANT(1), /* SVDEFRTU value indicating   01352000
*                                      that SVDEFVAL value is           01353000
*                                      expressed in milliseconds     */ 01354000
*     SVDEF_RTU_SECOND FIXED(8) CONSTANT(2), /* SVDEFRTU value          01355000
*                                      indicating that SVDEFVAL value   01356000
*                                      is expressed in seconds       */ 01357000
*     SVDEF_RTU_MINUTE FIXED(8) CONSTANT(3), /* SVDEFRTU value          01358000
*                                      indicating that SVDEFVAL value   01359000
*                                      is expressed in minutes       */ 01360000
*     SVDEF_RTU_HOUR FIXED(8) CONSTANT(4), /* SVDEFRTU value            01361000
*                                      indicating that SVDEFVAL value   01362000
*                                      is expressed in hours         */ 01363000
*                                                                       01364000
*     SVDEF_NAME CHAR(4) CONSTANT('SVDE'), /* 'SVDE' acronym         */ 01365000
*     SVDEF_LEVEL001_IN_CHAR                                   /*@P5A*/ 01366000
*                    CHAR(8)  CONSTANT('LEVEL001'),            /*@P5A*/ 01367000
*     SVDEF_LEVEL002_IN_CHAR                                   /*@P5A*/ 01368000
*                    CHAR(8)  CONSTANT('LEVEL002'),            /*@P5A*/ 01369000
*     SVDEF_LEVEL003_IN_CHAR                               /*@WLMPSTP*/ 01370000
*                    CHAR(8)  CONSTANT('LEVEL003'),        /*@WLMPSTP*/ 01371000
*     SVDEF_LEVEL004_IN_CHAR                               /*@WLMPBAT*/ 01372000
*                    CHAR(8)  CONSTANT('LEVEL004'),        /*@WLMPBAT*/ 01373000
*     SVDEF_LEVEL005_IN_CHAR                               /*@WLMPSDC*/ 01374000
*                    CHAR(8)  CONSTANT('LEVEL005'),        /*@WLMPSDC*/ 01375000
*     SVDEF_LEVEL006_IN_CHAR                               /*@WLMPSDC*/ 01376000
*                    CHAR(8)  CONSTANT('LEVEL006'),        /*@WLMPSDC*/ 01377000
*     SVDEF_LEVEL007_IN_CHAR                               /*@WLMPSDC*/ 01378000
*                    CHAR(8)  CONSTANT('LEVEL007'),        /*@WLMPMQS*/ 01379000
*     SVDEF_LEVEL008_IN_CHAR                               /*@WLMPTAL*/ 01380000
*                    CHAR(8)  CONSTANT('LEVEL008'),        /*@WLMPTAL*/ 01381000
*     SVDEF_LEVEL009_IN_CHAR                               /*@WLMPGMY*/ 01382000
*                    CHAR(8)  CONSTANT('LEVEL009'),        /*@WLMPGMY*/ 01383000
*     SVDEF_LEVEL010_IN_CHAR                               /*@WLMPGMY*/ 01384000
*                    CHAR(8)  CONSTANT('LEVEL010'),        /*@WLMPGMY*/ 01385000
*     SVDEF_LEVEL011_IN_CHAR                               /*@WLMPGMY*/ 01386000
*                    CHAR(8)  CONSTANT('LEVEL011'),        /*@WLMPGMY*/ 01387000
*     SVDEF_LEVEL001 FIXED(8) CONSTANT(1), /*                           01388000
*                                Functionality level introduced by      01389000
*                                WLM in SP510.                   @P2C*/ 01390000
*     SVDEF_SP510 FIXED(8) CONSTANT(1), /*                              01391000
*                                WLM SP510 version               @P2C*/ 01392000
*     SVDEF_LEVEL002 FIXED(8) CONSTANT(2), /*                           01393000
*                                Functionality level introduced by      01394000
*                                WLM in SP520.                   @P2C*/ 01395000
*     SVDEF_SP520 FIXED(8) CONSTANT(2), /*                              01396000
*                                WLM SP520 version               @P2C*/ 01397000
*     SVDEF_LEVEL003 FIXED(8) CONSTANT(3), /*                           01398000
*                                Functionality level introduced by      01399000
*                                WLM in OS/390 V1R3          @WLMPSTP*/ 01400000
*     SVDEF_SP530 FIXED(8) CONSTANT(3), /*                              01401000
*                                WLM version number for OS/390 V1R3     01402000
*                                                            @WLMPSTP*/ 01403000
*     SVDEF_LEVEL004 FIXED(8) CONSTANT(4), /*                           01404000
*                                Functionality level introduced by      01405000
*                                WLM in OS/390 V2R4          @WLMPBAT*/ 01406000
*     SVDEF_SP604 FIXED(8) CONSTANT(4), /*                              01407000
*                                WLM version number for OS/390 V2R4     01408000
*                                                            @WLMPBAT*/ 01409000
*     SVDEF_LEVEL005 FIXED(8) CONSTANT(5), /*                           01410000
*                                Functionality level introduced by      01411000
*                                WLM in OS/390 V2R5          @WLMPSDC*/ 01412000
*     SVDEF_SP605 FIXED(8) CONSTANT(5), /*                              01413000
*                                WLM version number for OS/390 V2R5     01414000
*                                                            @WLMPSDC*/ 01415000
*     SVDEF_LEVEL006 FIXED(8) CONSTANT(6), /*                           01416000
*                                Functionality level introduced by      01417000
*                                WLM in OS/390 V2R6          @WLMPSDC*/ 01418000
*     SVDEF_SP606 FIXED(8) CONSTANT(6), /*                              01419000
*                                WLM version number for OS/390 V2R6     01420000
*                                                            @WLMPSDC*/ 01421000
*     SVDEF_LEVEL007 FIXED(8) CONSTANT(7), /*                           01422000
*                                Functionality level introduced by      01423000
*                                WLM in OS/390 V2R7          @WLMPMQS*/ 01424000
*     SVDEF_SP607 FIXED(8) CONSTANT(7), /*                              01425000
*                                WLM version number for OS/390 V2R7     01426000
*                                                            @WLMPMQS*/ 01427000
*     SVDEF_LEVEL008 FIXED(8) CONSTANT(8), /*                           01428000
*                                Functionality level introduced by      01429000
*                                WLM in OS/390 V2R7          @WLMPTAL*/ 01430000
*     SVDEF_SP608 FIXED(8) CONSTANT(8), /*                              01431000
*                                WLM version number for OS/390 V2R7     01432000
*                                                            @WLMPTAL*/ 01433000
*     SVDEF_LEVEL009 FIXED(8) CONSTANT(9), /*                           01434000
*                                Functionality level reserved for       01435000
*                                WLM OS/390 V2R8             @WLMPGMY*/ 01436000
*     SVDEF_RESERVED_R08 FIXED(8) CONSTANT(9), /*                       01437000
*                                WLM version number reserved for        01438000
*                                OS/390 V2R8                            01439000
*                                                            @WLMPGMY*/ 01440000
*     SVDEF_LEVEL010 FIXED(8) CONSTANT(10), /*                          01441000
*                                Functionality level reserved for       01442000
*                                WLM OS/390 V2R9             @WLMPGMY*/ 01443000
*     SVDEF_RESERVED_R09 FIXED(8) CONSTANT(10), /*                      01444000
*                                WLM version number reserved for        01445000
*                                OS/390 V2R9                            01446000
*                                                            @WLMPGMY*/ 01447000
*     SVDEF_LEVEL011 FIXED(8) CONSTANT(11), /*                          01448000
*                                Functionality level introduced by      01449000
*                                WLM in OS/390 V2R10         @WLMPGMY*/ 01450000
*     SVDEF_SP703 FIXED(8) CONSTANT(11), /*                             01451000
*                                WLM version number for OS/390 V2R10    01452000
*                                                            @WLMPGMY*/ 01453000
*     SVDEF_LEVEL012 FIXED(8) CONSTANT(12), /*                          01454000
*                                Functionality level reserved for       01455000
*                                WLM OS/390 V2R11            @WLMPLNX*/ 01456000
*     SVDEF_RESERVED_R11 FIXED(8) CONSTANT(12), /*                      01457000
*                                WLM version number reserved for        01458000
*                                OS/390 V2R11                           01459000
*                                                            @WLMPLNX*/ 01460000
*     SVDEF_LEVEL013 FIXED(8) CONSTANT(13), /*                          01461000
*                                Functionality level introduced by      01462000
*                                WLM in OS/390 V2R12         @WLMPLNX*/ 01463000
*     SVDEF_SP705 FIXED(8) CONSTANT(13), /*                             01464000
*                                WLM version number for OS/390 V2R12    01465000
*                                                            @WLMPLNX*/ 01466000
*     SVDEF_LEVEL014 FIXED(8) CONSTANT(14), /*                          01467000
*                                Functionality level reserved for       01468000
*                                WLM in z/OS V1R3            @WLMPESC*/ 01469000
*     SVDEF_RESERVED_R13 FIXED(8) CONSTANT(14), /*                      01470000
*                                WLM version number reserved for        01471000
*                                z/OS V1R3                   @WLMPESC*/ 01472000
*     SVDEF_LEVEL015 FIXED(8) CONSTANT(15), /*                          01473000
*                                Functionality level reserved for       01474000
*                                WLM in z/OS V1R4            @WLMPESC*/ 01475000
*     SVDEF_RESERVED_R14 FIXED(8) CONSTANT(15), /*                      01476000
*                                WLM version number reserved for        01477000
*                                z/OS V1R4                   @WLMPESC*/ 01478000
*     SVDEF_LEVEL016 FIXED(8) CONSTANT(16), /*                          01479000
*                                Functionality level reserved for       01480000
*                                WLM in z/OS V1R5            @WLMPESC*/ 01481000
*     SVDEF_RESERVED_R15 FIXED(8) CONSTANT(16), /*                      01482000
*                                WLM version number reserved for        01483000
*                                z/OS V1R5                   @WLMPESC*/ 01484000
*     SVDEF_LEVEL017 FIXED(8) CONSTANT(17), /*                          01485000
*                                Functionality level introduced by      01486000
*                                WLM in z/OS V1R6            @WLMPESC*/ 01487000
*     SVDEF_SP709 FIXED(8) CONSTANT(17), /*                             01488000
*                                WLM version number in z/OS V1R6        01489000
*                                                            @WLMPESC*/ 01490000
*     SVDEF_RESERVED_R16 FIXED(8) CONSTANT(17), /*                      01491000
*                                WLM version number reserved for        01492000
*                                z/OS V1R16                             01493000
*                                                            @WLMPEEG*/ 01494000
*     SVDEF_LEVEL018 FIXED(8) CONSTANT(18), /*                          01495000
*                                Functionality level reserved for       01496000
*                                WLM z/OS V1R17              @WLMPEEG*/ 01497000
*     SVDEF_RESERVED_R17 FIXED(8) CONSTANT(18), /*                      01498000
*                                WLM version number reserved for        01499000
*                                z/OS V1R17                             01500000
*                                                            @WLMPEEG*/ 01501000
*     SVDEF_LEVEL019 FIXED(8) CONSTANT(19), /*                          01502000
*                                Functionality level introduced with    01503000
*                                WLM z/OS V1R18              @WLMPEEG*/ 01504000
*     SVDEF_SP730 FIXED(8) CONSTANT(19), /*                             01505000
*                                WLM version number introduced with     01506000
*                                z/OS V1R18                  @WLMPEEG*/ 01507000
*     SVDEF_LEVEL020 FIXED(8) CONSTANT(20), /*                          01508000
*                                Functionality level reserved for       01509000
*                                WLM z/OS V1R18 APARS etc    @LEWLTM */ 01510000
*                                                                       01511000
*     SVDEF_LEVEL021 FIXED(8) CONSTANT(21), /*                          01512000
*                                Functionality level introduced with    01513000
*                                WLM z/OS V1R10              @LEWLTM */ 01514000
*     SVDEF_SP750 FIXED(8) CONSTANT(21), /*                             01515000
*                                WLM version number introduced with     01516000
*                                z/OS V1R10                  @LEWLTMA*/ 01517000
*     SVDEF_LEVEL022 FIXED(8) CONSTANT(22), /*                          01518000
*                                Functionality level reserved for       01519000
*                                WLM z/OS V1R10 APARS etc    @LEWMSMA*/ 01520000
*                                                                       01521000
*     SVDEF_LEVEL023 FIXED(8) CONSTANT(23), /*                          01522000
*                                Functionality level introduced with    01523000
*                                WLM z/OS V1R11              @LEXTRCA*/ 01524000
*     SVDEF_SP760 FIXED(8) CONSTANT(23), /*                             01525000
*                                WLM version number introduced with     01526000
*                                z/OS V1R11                  @LEWMSMA*/ 01527000
*                                                                       01528000
*     SVDEF_LEVEL025 FIXED(8) CONSTANT(25), /*                          01529000
*                                Functionality level introduced with    01530000
*                                WLM z/OS V1R12              @ME17808*/ 01531000
*     SVDEF_SP770 FIXED(8) CONSTANT(25), /*                             01532000
*                                WLM version number introduced with     01533000
*                                z/OS V1R12                  @ME17808*/ 01534000
*                                                                       01535000
*     SVDEF_LEVEL029 FIXED(8) CONSTANT(29), /*                          01536000
*                                Functionality level introduced with    01537000
*                                WLM z/OS V2R1               @LSPMGRA*/ 01538000
*     SVDEF_SP790 FIXED(8) CONSTANT(29), /*                             01539000
*                                WLM version number introduced with     01540000
*                                z/OS V2R1                   @LSPMGRA*/ 01541000
*                                                                       01542000
*     SVDEF_LEVEL030 FIXED(8) CONSTANT(30), /*                          01543000
*                                Functionality level introduced for     01544000
*                                Special Reporting           @OA47042*/ 01545000
*                                                                       01546000
*     SVDEF_LEVEL031 FIXED(8) CONSTANT(31), /*                          01547000
*                                Functionality level introduced for     01548000
*                                Specialty Engines Containment          01549000
*                                                            @OA50845*/ 01550000
*                                                                       01551000
*     SVDEF_LEVEL032 FIXED(8) CONSTANT(32), /*                          01552000
*                                Functionality level introduced for     01553000
*                                Workload billing groups     @LWBGRPA*/ 01554000
*                                                                       01555000
*     SVDEF_SP7B0 FIXED(8) CONSTANT(35), /*                             01556000
*                                WLM version number introduced with     01557000
*                                z/OS V2R3                   @LRESPTA*/ 01558000
*                                                                       01559000
*     SVDEF_LEVEL035 FIXED(8) CONSTANT(35), /*                          01560000
*                                Functionality level introduced with    01561000
*                                WLM z/OS V2R3               @LRESPTA*/ 01562000
*                                                                       01563000
*     SVDEF_LEVEL038 FIXED(8) CONSTANT(38), /*                          01564000
*                                Functionality level introduced for     01565000
*                                System Recovery Boost stage 3          01566000
*                                                            @LBOOS3A*/ 01567000
*                                                                       01568000
*     SVDEF_CURRENT_VER FIXED(8) CONSTANT(SVDEF_LEVEL038); /*           01569000
*                                Current version level used when        01570000
*                                checking functionality within WLM      01571000
*                                product                     @LBOOS3C*/ 01572000
* @LOGIC;                                                               01573000
* #PRAGMA TOOL=CBGEN.                                                   01574000
* #DELETE.SVDEF_LEVEL001_IN_CHAR                                        01575000
* #DELETE.SVDEF_LEVEL002_IN_CHAR                                        01576000
* #DELETE.SVDEF_LEVEL003_IN_CHAR                                        01577000
* #DELETE.SVDEF_LEVEL004_IN_CHAR                                        01578000
* #DELETE.SVDEF_LEVEL005_IN_CHAR                                        01579000
* #DELETE.SVDEF_LEVEL006_IN_CHAR                                        01580000
* #DELETE.SVDEF_LEVEL007_IN_CHAR                                        01581000
* #DELETE.SVDEF_LEVEL008_IN_CHAR                                        01582000
* #DELETE.SVDEF_LEVEL009_IN_CHAR                                        01583000
* #DELETE.SVDEF_LEVEL010_IN_CHAR                                        01584000
* #DELETE.SVDEF_LEVEL011_IN_CHAR                                        01585000
* #DELETE.SVDEF_LEVEL012_IN_CHAR                                        01586000
* #DELETE.SVDEF_LEVEL013_IN_CHAR                                        01587000
* #DELETE.SVDEF_LEVEL014_IN_CHAR                                        01588000
* #DELETE.SVDEF_LEVEL015_IN_CHAR                                        01589000
* #DELETE.SVDEF_LEVEL016_IN_CHAR                                        01590000
* #DELETE.SVDEF_LEVEL017_IN_CHAR                                        01591000
* #DELETE.SVDEF_LEVEL018_IN_CHAR                                        01592000
* #DELETE.SVDEF_LEVEL019_IN_CHAR                                        01593000
* #EPRAGMA.                                                             01594000
* @ENDLOGIC;                                                            01595000
*/* End of PL/X Source                                               */ 01596000
* %IF IWMSVDEF_LIST = 'NO' !                                            01597000
*    ZCBPRINT = 'NO' %THEN                                              01598000
* %DO;                                                                  01599000
*   @LIST POP NOECHO;                                                   01600000
* %END;                                                                 01601000
* %END;                                                                 01602000
