*                                                                       00001000
* %DCL IWMSVPCD_INCLUDED CHAR EXT;                                      00002000
* %DEACTIVATE IWMSVPCD_INCLUDED;                                        00003000
* %IF IWMSVPCD_INCLUDED = '' %THEN                                      00004000
* %DO;                                                                  00005000
*%/* Start of PL/X PreProlog Code */;                                   00006000
*                                                                       00007000
*%/* End of PL/X PreProlog Code */;                                     00008000
*/* Macro made bi-lingual on 21209. CBGEN compile date 21138         */ 00009000
*% /*                                                                   00010000
         MACRO                                                          00011000
         IWMSVPCD &DSECT=YES,&LIST=YES,&TITLE=YES,&SVPCD_MAP=YES        00012000
         GBLC  &IWMSVPCD_INCLUDED                                       00013000
         GBLC  &ZCBPRINT                                                00014000
&IWMSVPCD_INCLUDED SETC 'YES'                                           00015000
         AIF   ('&LIST' EQ 'NONE').P0                                   00016000
         AIF   ('&TITLE' EQ 'NO').P5                                    00017000
 TITLE   'IWMSVPCD  - IWMWQRY Answer Area                         '     00018000
.P5      ANOP                                                           00019000
**/ ;                                                                   00020000
*/*****START OF SPECIFICATIONS****************************************/ 00021000
*/*                                                                  */ 00022000
*/*01* PROPRIETARY_STATEMENT *****************************************/ 00023000
*/*                                                                  */ 00024000
*/*    LICENSED MATERIALS - PROPERTY OF IBM                          */ 00025000
*/*    5650-ZOS COPYRIGHT IBM CORP. 1993, 2015                       */ 00026000
*/*                                                                  */ 00027000
*/*** END_OF_PROPRIETARY_STATEMENT ***********************************/ 00028000
*/*                                                                  */ 00029000
*/* ---------------------------------------------------------------- */ 00030000
*/* This member is converted from CASE part IWMSVPCD                 */ 00031000
*/* to SCLM PLX source member IWMSVPCD.                              */ 00032000
*/* From release 2.2 the CASE part must not be used any longer.      */ 00033000
*/* Instead maintenance has to be done in the PLX part.              */ 00034000
*/* From release 2.3 the CASE part is deleted.              @CCNV7A0 */ 00035000
*/* ---------------------------------------------------------------- */ 00036000
*/*                                                                  */ 00037000
*/*01* External classification: GUPI                                 */ 00038000
*/*01* End of External classification                                */ 00039000
*/*                                                                  */ 00040000
*/*01* Status: HBB77A0                                               */ 00041000
*/*                                                                  */ 00042000
*/*01* Descriptive Name: IWMWQRY Answer Area                         */ 00043000
*/*                                                                  */ 00044000
*/*02*  Acronym: SVPCD                                               */ 00045000
*/*                                                                  */ 00046000
*/*01* Macro Name: IWMSVPCD                                          */ 00047000
*/*                                                                  */ 00048000
*/*01* DSECT Name: SVPCDHD                                           */ 00049000
*/*                                                                  */ 00050000
*/*01* Component: Workload Manager (SCWLM)                           */ 00051000
*/*                                                                  */ 00052000
*/*01* Eye-Catcher: SVPC                                             */ 00053000
*/*02*  Offset: 0                                                    */ 00054000
*/*02*  Length: CHAR(4)                                              */ 00055000
*/*                                                                  */ 00056000
*/*01* Storage Attributes:                                           */ 00057000
*/*02*  Subpool: Any                                                 */ 00058000
*/*02*  Key: 0                                                       */ 00059000
*/*02*  Residency: Above 16M line                                    */ 00060000
*/*                                                                  */ 00061000
*/*01* Size: Determined at run time                                  */ 00062000
*/*            SVPCD_MAP -- X'0018' bytes                            */ 00063000
*/*01* Created by: Caller                                            */ 00064000
*/*                                                                  */ 00065000
*/*01* Pointed to by: R1 and AR1                                     */ 00066000
*/*                                                                  */ 00067000
*/*01* Serialization: None                                           */ 00068000
*/*                                                                  */ 00069000
*/*01* Function: Contains service policy information                 */ 00070000
*/*                                                                  */ 00071000
*/*01* Restrictions:                                                 */ 00072000
*/*              None                                                */ 00073000
*/*                                                                  */ 00074000
*/*01* Method of Access:                                             */ 00075000
*/*                                                                  */ 00076000
*/*02*  ASM:                                                         */ 00077000
*/*          Specify: IWMSVPCD                                       */ 00078000
*/*                                                                  */ 00079000
*/*02*  PLX:                                                         */ 00080000
*/*                                                                  */ 00081000
*/*          %INCLUDE SYSLIB(IWMSVPCD)                               */ 00082000
*/*          %INCLUDE SYSLIB(IWMSVPOL)                               */ 00083000
*/*          Using on SVPCD_MAP gains addressability to the header.  */ 00084000
*/*                                                                  */ 00085000
*/*          Service class data:                                     */ 00086000
*/*          The service class information is mapped by              */ 00087000
*/*          the SVPOLCD mapping in IWMSVPOL and can be accessed     */ 00088000
*/*          by adding the offset of the class data (SVPCDDCO) to    */ 00089000
*/*          the address of SVPCD_MAP. There is one service class    */ 00090000
*/*          entry returned.                                         */ 00091000
*/*                                                                  */ 00092000
*/*          Service class period data:                              */ 00093000
*/*                                                                  */ 00094000
*/*          The period information is mapped by the SVPOLPD         */ 00095000
*/*          mapping in IWMSVPOL. Access to the beginning of         */ 00096000
*/*          the period data (there can be multiple periods)         */ 00097000
*/*          is gained by adding the address of SVPCD_MAP, the       */ 00098000
*/*          offset of the class data (SVPCDDCO) and the size        */ 00099000
*/*          of the class data (SVPCDDCL). The SVPCDDPL field        */ 00100000
*/*          in the header indicates the size of each period.        */ 00101000
*/*          addressability to subsequent periods can be gained      */ 00102000
*/*          by adding this value to the address of each period.     */ 00103000
*/*                                                                  */ 00104000
*/*          DSECT    USING                                          */ 00105000
*/*          -----    -----                                          */ 00106000
*/*          SVPOLCD  A(SVPCD_MAP) + SVPCDDCO                        */ 00107000
*/*          SVPOLPD  A(SVPOLHD) + SVPCDDCO + SVPCDDCL (multiple)    */ 00108000
*/*                                                                  */ 00109000
*/*          In cases where there are multiple elements in a         */ 00110000
*/*          section, subsequent elements can be found by adding     */ 00111000
*/*          the size of one element to the basing.                  */ 00112000
*/*                                                                  */ 00113000
*/*02*  VIA ATTRIBUTE:                                               */ 00114000
*/*                                                                  */ 00115000
*/*          Not available at the moment ...                         */ 00116000
*/*                                                                  */ 00117000
*/********************************************************************/ 00118000
*/*                                                                  */ 00119000
*/*01* Change Activity:                                              */ 00120000
*/*                                                                  */ 00121000
*/*    $L0= WLMI,    HBB5510, 930315,PD00BV: WLM Stage I             */ 00122000
*/*    $CPYRIGHT,    HBB77A0  130909 3241BH  BILL HEISSER            */ 00123000
*/*                                     REMOVE 'RESTRICTED MATERIAL" */ 00124000
*/*    $CCNV7A0,     HBB77A0  131104 3241IS: Irene Stahl             */ 00125000
*/*                                          CASE conversion         */ 00126000
*/*    $CCNV7A0,     HBB77A0  140110 3241IS: Irene Stahl             */ 00127000
*/*                                          CASE conversion cleanup */ 00128000
*/*                                                                  */ 00129000
*/***END OF SPECIFICATIONS********************************************/ 00130000
*% /*                                                                   00131000
.P0      ANOP                                                           00132000
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 00133000
         AIF   ('&LIST' EQ 'YES').P2                                    00134000
.P1      ANOP                                                           00135000
         PUSH  PRINT                                                    00136000
         PRINT OFF                                                      00137000
.P2      ANOP                                                           00138000
         AIF   ('&SVPCD_MAP' EQ 'NO').L0002                             00139000
         AIF   ('&DSECT' EQ 'YES').L0003                                00140000
         AIF   ('&SVPCD_MAP' NE 'YES').L0002                            00141000
.L0003   ANOP                                                           00142000
*                                                                       00143000
*    *****************************************************************  00144000
*    *                                                               *  00145000
*    * IWMSVPCD.679: based variable for storage mapping              *  00146000
*    *                                                               *  00147000
*    *****************************************************************  00148000
*                                                                       00149000
*                                                                       00150000
         AIF   ('&DSECT' EQ 'YES').L0004                                00151000
SVPCD_MAP DS   0F                                                       00152000
         AGO   .L0005                                                   00153000
.L0004   ANOP                                                           00154000
SVPCD_MAP DSECT                                                         00155000
.L0005   ANOP                                                           00156000
SVPCDNAM DS    CL4       IWMSVPCD.13: Eyecatcher - SVCD                 00157000
SVPCDRS1 DS    CL3       IWMSVPCD.590: Reserved                         00158000
SVPCDDVN DS    X         IWMSVPCD.19: Version                           00159000
SVPCDDIL DS    H         IWMSVPCD.25: Length of header section          00160000
SVPCDRS2 DS    CL2       IWMSVPCD.596: Reserved                         00161000
SVPCDDLE DS    F         IWMSVPCD.31: Length of SVPCD                   00162000
SVPCDDCO DS    F         IWMSVPCD.37: Service class section offset      00163000
SVPCDDCL DS    H         IWMSVPCD.43: Length of the service class      *00164000
                         entry                                          00165000
SVPCDDPL DS    H         IWMSVPCD.61: Length of each period entry       00166000
SVPCD_MAP_LEN EQU *-SVPCD_MAP                                           00167000
.L0002   ANOP                                                           00168000
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 00169000
         AIF   ('&LIST' EQ 'YES').P4                                    00170000
.P3      ANOP                                                           00171000
         POP   PRINT                                                    00172000
.P4      ANOP                                                           00173000
.P_EXIT  ANOP                                                           00174000
         MEND                                                           00175000
**/ ;                                                                   00176000
* %IWMSVPCD_INCLUDED = 'YES';                                           00177000
* %DCL ZCBPRINT CHAR EXT;                                               00178000
* %DEACTIVATE ZCBPRINT;                                                 00179000
* %DCL IWMSVPCD_LIST CHAR EXT;                                          00180000
* %DEACTIVATE IWMSVPCD_LIST;                                            00181000
* %IF IWMSVPCD_LIST = 'NO' !                                            00182000
*    ZCBPRINT = 'NO' %THEN                                              00183000
* %DO;                                                                  00184000
*   @LIST PUSH NOECHO;                                                  00185000
*   @LIST NOASSEMBLE NOECHO;                                            00186000
*   @LIST OFF C NOECHO;                                                 00187000
* %END;                                                                 00188000
*/* Start of PL/X Source                                             */ 00189000
*                                                                       00190000
*   /*****************************************************************/ 00191000
*   /*                                                               */ 00192000
*   /* IWMSVPCD.679: based variable for storage mapping              */ 00193000
*   /*                                                               */ 00194000
*   /*****************************************************************/ 00195000
*                                                                       00196000
*   DECLARE                                                             00197000
*     1    SVPCD_MAP BASED(*) BDY(WORD),                                00198000
*      2    SVPCDNAM CHAR(4),       /* IWMSVPCD.13: Eyecatcher - SVCD*/ 00199000
*      2    SVPCDRS1 CHAR(3),       /* IWMSVPCD.590: Reserved        */ 00200000
*      2    SVPCDDVN FIXED(8),      /* IWMSVPCD.19: Version          */ 00201000
*      2    SVPCDDIL FIXED(16),     /* IWMSVPCD.25: Length of header    00202000
*                                      section                       */ 00203000
*      2    SVPCDRS2 CHAR(2),       /* IWMSVPCD.596: Reserved        */ 00204000
*      2    SVPCDDLE FIXED(32),     /* IWMSVPCD.31: Length of SVPCD  */ 00205000
*      2    SVPCDDCO FIXED(32),     /* IWMSVPCD.37: Service class       00206000
*                                      section offset                */ 00207000
*      2    SVPCDDCL FIXED(16),     /* IWMSVPCD.43: Length of the       00208000
*                                      service class entry           */ 00209000
*      2    SVPCDDPL FIXED(16);     /* IWMSVPCD.61: Length of each      00210000
*                                      period entry                  */ 00211000
*/* End of PL/X Source                                               */ 00212000
* %IF IWMSVPCD_LIST = 'NO' !                                            00213000
*    ZCBPRINT = 'NO' %THEN                                              00214000
* %DO;                                                                  00215000
*   @LIST POP NOECHO;                                                   00216000
* %END;                                                                 00217000
* %END;                                                                 00218000
