*                                                                       00001000
* %DCL IWMSVIDS_INCLUDED CHAR EXT;                                      00002000
* %DEACTIVATE IWMSVIDS_INCLUDED;                                        00003000
* %IF IWMSVIDS_INCLUDED = '' %THEN                                      00004000
* %DO;                                                                  00005000
*/* Macro made bi-lingual on 19322. CBGEN compile date 19044         */ 00006000
*% /*                                                                   00007000
         MACRO                                                          00008000
         IWMSVIDS &DSECT=YES,&LIST=YES,&TITLE=YES,&SVIDSSVP=YES,       *00009000
               &SVIDSSVD=COND,&SVIDSPRD=COND                            00010000
         GBLC  &IWMSVIDS_INCLUDED                                       00011000
         GBLC  &ZCBPRINT                                                00012000
&IWMSVIDS_INCLUDED SETC 'YES'                                           00013000
         AIF   ('&LIST' EQ 'NONE').P0                                   00014000
         AIF   ('&TITLE' EQ 'NO').P5                                    00015000
 TITLE   'IWMSVIDS  - WLM Service Definition identifier mappings  '     00016000
.P5      ANOP                                                           00017000
**/ IWMSVIDS_1:;                                                        00018000
*/***START OF SPECIFICATIONS******************************************/ 00019000
*/*                                                                  */ 00020000
*/*01* Proprietary statement:                                        */ 00021000
*/*                                                                  */ 00022000
*/*      LICENSED MATERIALS - PROPERTY OF IBM                        */ 00023000
*/*      5650-ZOS     COPYRIGHT IBM CORP. 1994, 2021                 */ 00024000
*/*                                                                  */ 00025000
*/*                                                                  */ 00026000
*/*01* External classification: GUPI                                 */ 00027000
*/*01* End of External classification                                */ 00028000
*/*                                                                  */ 00029000
*/*01* Status: HBB77D0                                               */ 00030000
*/*                                                                  */ 00031000
*/*01* Descriptive Name: WLM Service Definition identifier mappings  */ 00032000
*/*                                                                  */ 00033000
*/*02*  Acronym: SVIDS                                               */ 00034000
*/*                                                                  */ 00035000
*/*01* Macro Name: IWMSVIDS                                          */ 00036000
*/*                                                                  */ 00037000
*/*01* DSECT Name:                                                   */ 00038000
*/*02*  SVIDSSVP (DSECT name of service policy id mapping)           */ 00039000
*/*02*  SVIDSSVD (DSECT name of service definition id mapping)       */ 00040000
*/*02*  SVIDSPRD (DSECT name of product id mapping)                  */ 00041000
*/*                                                                  */ 00042000
*/*01* Component: Workload Manager (SCWLM)                           */ 00043000
*/*                                                                  */ 00044000
*/*01* Eye-Catcher: None                                             */ 00045000
*/*02*  Offset: 0                                                    */ 00046000
*/*02*  Length: CHAR(4)                                              */ 00047000
*/*                                                                  */ 00048000
*/*01* Storage Attributes:                                           */ 00049000
*/*02*  Subpool: Any                                                 */ 00050000
*/*02*  Key: Any                                                     */ 00051000
*/*02*  Residency: Above 16M line                                    */ 00052000
*/*                                                                  */ 00053000
*/*01* Size: Determined at run time                                  */ 00054000
*/*                                                                  */ 00055000
*/*01* Created by: N/A                                               */ 00056000
*/*                                                                  */ 00057000
*/*01* Pointed to by: R1 and AR1                                     */ 00058000
*/*                                                                  */ 00059000
*/*01* Serialization: None                                           */ 00060000
*/*                                                                  */ 00061000
*/*01* Function: Contains mappings for data returned from the        */ 00062000
*/*              IWMCQRY and IWMDINST services.                      */ 00063000
*/*                                                                  */ 00064000
*/*      SVIDSSVP (DSECT name of service policy id mapping)          */ 00065000
*/*                                                                  */ 00066000
*/*        -This is used to map the output returned via the          */ 00067000
*/*         POLICY_ID keyword of the IWMCQRY service.                */ 00068000
*/*                                                                  */ 00069000
*/*      SVIDSSVD (DSECT name of service definition id mapping)      */ 00070000
*/*                                                                  */ 00071000
*/*        -This is used to map the output returned via the          */ 00072000
*/*         QRY_BASEID keyword on the IWMDINST service.              */ 00073000
*/*                                                                  */ 00074000
*/*      SVIDSPRD (DSECT name of product id mapping)                 */ 00075000
*/*                                                                  */ 00076000
*/*        -This is used to map the output returned via the          */ 00077000
*/*         PRODUCT_ID keyword on the IWMDINST service.              */ 00078000
*/*                                                                  */ 00079000
*/*      All timestamps are local time expressed in                  */ 00080000
*/*      STCK format.                                                */ 00081000
*/*                                                                  */ 00082000
*/*01* Restrictions:                                                 */ 00083000
*/*              None                                                */ 00084000
*/*                                                                  */ 00085000
*/*01* Method of Access:                                             */ 00086000
*/*                                                                  */ 00087000
*/*02*  ASM:                                                         */ 00088000
*/*          Specify: IWMSVIDS                                       */ 00089000
*/*                                                                  */ 00090000
*/*02*  PLX:                                                         */ 00091000
*/*                                                                  */ 00092000
*/*          %INCLUDE SYSLIB(IWMSVIDS)                               */ 00093000
*/*                                                                  */ 00094000
*/*02*  VIA ATTRIBUTE:                                               */ 00095000
*/*                                                                  */ 00096000
*/*          Specify %SVIDSVIA = 'YES'                               */ 00097000
*/*          prior to %INCLUDE statement.                            */ 00098000
*/*          For VIA(0) specify %GLOBALARMODE='YES'                  */ 00099000
*/*                                                                  */ 00100000
*/*------------------------------------------------------------------*/ 00101000
*/*                                                                  */ 00102000
*/*01* Change Activity:                                              */ 00103000
*/*    $L0= WLMRM,   HBB5520, 940407,PD00BV: WLM RM                  */ 00104000
*/*    $P1=PN71296 HBB5520  940908 PD88D5: Correct DSECT info    @P1A*/ 00105000
*/*    $P2=PN72034 HBB5520  941201 PD88D0: Added more info on the    */ 00106000
*/*                                        usage of the different    */ 00107000
*/*                                        DSECTs in the prolog  @P2A*/ 00108000
*/*    $PQC0795      HBB6603  960820 PDB9DB: Time stamps in local    */ 00109000
*/*                                          time            @PQC0795*/ 00110000
*/*    $PUX0238      HBB6605  970714 PDB9DB: Remove flags in         */ 00111000
*/*                                          prolog          @PUX0238*/ 00112000
*/*    $ME05838      HBB7730 060215 3241BH: Bill Heisser - removal of*/ 00113000
*/*                                         obsolete Prop info only  */ 00114000
*/*    $CBGMETA    HBB77D0  190813 3241BH: Bill Heisser              */ 00115000
*/*                                        convert to CBGEN Metadata */ 00116000
*/*                                                                  */ 00117000
*/***END OF SPECIFICATIONS********************************************/ 00118000
*% /*                                                                   00119000
.P0      ANOP                                                           00120000
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 00121000
         AIF   ('&LIST' EQ 'YES').P2                                    00122000
.P1      ANOP                                                           00123000
         PUSH  PRINT                                                    00124000
         PRINT OFF                                                      00125000
.P2      ANOP                                                           00126000
         AIF   ('&SVIDSSVP' EQ 'NO').L0002                              00127000
         AIF   ('&DSECT' EQ 'YES').L0003                                00128000
         AIF   ('&SVIDSSVP' NE 'YES').L0002                             00129000
SVIDSSVP DS    0X        Service policy id mapping                      00130000
         AGO   .L0004                                                   00131000
.L0003   ANOP                                                           00132000
SVIDSSVP DSECT           Service policy id mapping                      00133000
.L0004   ANOP                                                           00134000
SVIDSSVP_NAME DS CL8     Service policy name                            00135000
SVIDSSVP_TIMESTAMP DS CL8 Activation timestamp                          00136000
SVIDSSVP_LEN EQU *-SVIDSSVP                                             00137000
.L0002   ANOP                                                           00138000
         AIF   ('&SVIDSSVD' EQ 'NO').L0005                              00139000
         AIF   ('&DSECT' EQ 'YES').L0006                                00140000
         AIF   ('&SVIDSSVD' NE 'YES').L0005                             00141000
SVIDSSVD DS    0X        Service definition id mapping                  00142000
         AGO   .L0007                                                   00143000
.L0006   ANOP                                                           00144000
SVIDSSVD DSECT           Service definition id mapping                  00145000
.L0007   ANOP                                                           00146000
SVIDSSVD_NAME DS CL8     Service definition name                        00147000
SVIDSSVD_TIMESTAMP DS CL8 Installation timestamp                        00148000
SVIDSSVD_USERID DS CL8   Userid that installed the service definition   00149000
SVIDSSVD_SYSTEM_NAME DS CL8 System on which the installation was done   00150000
SVIDSSVD_LEN EQU *-SVIDSSVD                                             00151000
.L0005   ANOP                                                           00152000
         AIF   ('&SVIDSPRD' EQ 'NO').L0008                              00153000
         AIF   ('&DSECT' EQ 'YES').L0009                                00154000
         AIF   ('&SVIDSPRD' NE 'YES').L0008                             00155000
SVIDSPRD DS    0X        Product id mapping                             00156000
         AGO   .L000A                                                   00157000
.L0009   ANOP                                                           00158000
SVIDSPRD DSECT           Product id mapping                             00159000
.L000A   ANOP                                                           00160000
SVIDSPRD_NAME DS CL8     Product name                                   00161000
SVIDSPRD_VERSION DS CL8  Version                                        00162000
SVIDSPRD_SANDBOX DS CL16 Product sandbox                                00163000
SVIDSPRD_LEN EQU *-SVIDSPRD                                             00164000
.L0008   ANOP                                                           00165000
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 00166000
         AIF   ('&LIST' EQ 'YES').P4                                    00167000
.P3      ANOP                                                           00168000
         POP   PRINT                                                    00169000
.P4      ANOP                                                           00170000
.P_EXIT  ANOP                                                           00171000
         MEND                                                           00172000
**/ IWMSVIDS_2:;                                                        00173000
* %IWMSVIDS_INCLUDED = 'YES';                                           00174000
* %DCL ZCBPRINT CHAR EXT;                                               00175000
* %DEACTIVATE ZCBPRINT;                                                 00176000
* %DCL IWMSVIDS_LIST CHAR EXT;                                          00177000
* %DEACTIVATE IWMSVIDS_LIST;                                            00178000
* %IF IWMSVIDS_LIST = 'NO' !                                            00179000
*    ZCBPRINT = 'NO' %THEN                                              00180000
* %DO;                                                                  00181000
*   @LIST PUSH NOECHO;                                                  00182000
*   @LIST NOASSEMBLE NOECHO;                                            00183000
*   @LIST OFF C NOECHO;                                                 00184000
* %END;                                                                 00185000
*/* Start of PL/X Source                                             */ 00186000
*                                                                       00187000
* DCL 1 SVIDSSVP BASED,        /* Service policy id mapping          */ 00188000
*     3 SVIDSSVP_Name CHAR(8), /* Service policy name                */ 00189000
*     3 SVIDSSVP_Timestamp CHAR(8); /* Activation timestamp          */ 00190000
*                                                                       00191000
* DCL 1 SVIDSSVD BASED,        /* Service definition id mapping      */ 00192000
*     3 SVIDSSVD_Name CHAR(8), /* Service definition name            */ 00193000
*     3 SVIDSSVD_Timestamp CHAR(8), /* Installation timestamp        */ 00194000
*     3 SVIDSSVD_Userid CHAR(8), /* Userid that installed the service   00195000
*                                 definition                         */ 00196000
*     3 SVIDSSVD_System_name CHAR(8); /* System on which the            00197000
*                                 installation was done              */ 00198000
*                                                                       00199000
* DCL 1 SVIDSPRD BASED,        /* Product id mapping                 */ 00200000
*     3 SVIDSPRD_Name CHAR(8), /* Product name                       */ 00201000
*     3 SVIDSPRD_Version CHAR(8), /* Version                         */ 00202000
*     3 SVIDSPRD_Sandbox CHAR(16); /* Product sandbox                */ 00203000
*                                                                       00204000
*                                                                       00205000
*/* End of PL/X Source                                               */ 00206000
* %IF IWMSVIDS_LIST = 'NO' !                                            00207000
*    ZCBPRINT = 'NO' %THEN                                              00208000
* %DO;                                                                  00209000
*   @LIST POP NOECHO;                                                   00210000
* %END;                                                                 00211000
* %END;                                                                 00212000
