*                                                                       00001000
* %DCL IWMSVDCR_INCLUDED CHAR EXT;                                      00002000
* %DEACTIVATE IWMSVDCR_INCLUDED;                                        00003000
* %IF IWMSVDCR_INCLUDED = '' %THEN                                      00004000
* %DO;                                                                  00005000
*/* Macro made bi-lingual on 22122. CBGEN compile date 21138         */ 00006000
*% /*                                                                   00007000
         MACRO                                                          00008000
         IWMSVDCR &DSECT=YES,&LIST=YES,&TITLE=YES,&SVDCRHDR=YES,       *00009000
               &SVDCRSST=COND,&SVDCRRUL=COND,&SVDCRGRP=COND,           *00010000
               &SVDCRGVS=COND,&SVDCREXT=COND                            00011000
         GBLC  &IWMSVDCR_INCLUDED                                       00012000
         GBLC  &ZCBPRINT                                                00013000
&IWMSVDCR_INCLUDED SETC 'YES'                                           00014000
         AIF   ('&LIST' EQ 'NONE').P0                                   00015000
         AIF   ('&TITLE' EQ 'NO').P5                                    00016000
 TITLE   'IWMSVDCR  - WLM Service Definition Classification       '     00017000
.P5      ANOP                                                           00018000
**/ ;                                                                   00019000
*/***START OF SPECIFICATIONS******************************************/ 00020000
*/*                                                                  */ 00021000
*/*01* Proprietary statement:                                        */ 00022000
*/*                                                                  */ 00023000
*/*      LICENSED MATERIALS - PROPERTY OF IBM                        */ 00024000
*/*      5650-ZOS COPYRIGHT IBM CORP. 1993, 2022                     */ 00025000
*/*                                                                  */ 00026000
*/*                                                                  */ 00027000
*/*01* External classification: GUPI                             @L2C*/ 00028000
*/*01* End of External classification                                */ 00029000
*/*                                                                  */ 00030000
*/*01* Status: HBB77D0                                               */ 00031000
*/*                                                                  */ 00032000
*/*01* Descriptive Name: WLM Service Definition Classification       */ 00033000
*/*                      Rule mapping                                */ 00034000
*/*                                                                  */ 00035000
*/*02*  Acronym: SVDCR                                               */ 00036000
*/*                                                                  */ 00037000
*/*01* Macro Name: IWMSVDCR                                          */ 00038000
*/*                                                                  */ 00039000
*/*01* DSECT Name: SVDCRHDR                                      @P1C*/ 00040000
*/*                SVDCRSST                                      @P4A*/ 00041000
*/*                SVDCRRUL                                      @P4A*/ 00042000
*/*                SVDCRGRP                                      @P4A*/ 00043000
*/*                SVDCRGVS                                      @P4A*/ 00044000
*/*                SVDCREXT                                      @P4A*/ 00045000
*/*                                                                  */ 00046000
*/*01* Component: Workload Manager (SCWLM)                           */ 00047000
*/*                                                                  */ 00048000
*/*01* Eye-Catcher: SVDC                                             */ 00049000
*/*02*  Offset: 0                                                    */ 00050000
*/*02*  Length: CHAR(4)                                              */ 00051000
*/*                                                                  */ 00052000
*/*01* Storage Attributes:                                           */ 00053000
*/*02*  Subpool: Any                                                 */ 00054000
*/*02*  Key: Any                                                     */ 00055000
*/*02*  Residency: Above 16M line                                    */ 00056000
*/*                                                                  */ 00057000
*/*01* Size: Determined at run time                                  */ 00058000
*/*            SVDCRHDR -- X'0080' bytes                             */ 00059000
*/*            SVDCRSST -- X'0060' bytes                             */ 00060000
*/*            SVDCRRUL -- X'004C' bytes                             */ 00061000
*/*            SVDCRGRP -- X'0054' bytes                             */ 00062000
*/*            SVDCRGVS -- X'002C' bytes                             */ 00063000
*/*            SVDCREXT -- X'0018' bytes                             */ 00064000
*/*                                                                  */ 00065000
*/*01* Created by: Caller                                            */ 00066000
*/*                                                                  */ 00067000
*/*01* Pointed to by: offset within SERVD (IWMSERVD) mapping     @P1C*/ 00068000
*/*                                                                  */ 00069000
*/*01* Serialization: None                                           */ 00070000
*/*                                                                  */ 00071000
*/*01* Function: Contains service definition classification rule     */ 00072000
*/*              information returned by the IWMCQRY service         */ 00073000
*/*                                                                  */ 00074000
*/*              All timestamps are local time expressed in          */ 00075000
*/*              STCK format.                                        */ 00076000
*/*                                                                  */ 00077000
*/*01* Restrictions:                                                 */ 00078000
*/*              Some fields are not applicable for this structure   */ 00079000
*/*              when it is returned by the IWMCQRY service. Those   */ 00080000
*/*              fields are noted in the comments.                   */ 00081000
*/*                                                                  */ 00082000
*/*01* Method of Access:                                             */ 00083000
*/*                                                                  */ 00084000
*/*02*  ASM:                                                         */ 00085000
*/*          Specify: IWMSVDCR                                       */ 00086000
*/*                                                                  */ 00087000
*/*02*  PLX:                                                         */ 00088000
*/*                                                                  */ 00089000
*/*          %INCLUDE SYSLIB(IWMSVDCR)                               */ 00090000
*/*          Using on SVDCRHDR gives addressability to the header    */ 00091000
*/*          area of the service definition classification rule.     */ 00092000
*/*          Subsequent usings must be done to get addressability    */ 00093000
*/*          to the additional sections (DSECTs) as follows:         */ 00094000
*/*          DSECT    USING                                          */ 00095000
*/*          -----    -----                                          */ 00096000
*/*          SVDCRSST A(SVDCRHDR) + SVDCRSO   (multiple)             */ 00097000
*/*          SVDCRRUL A(SVDCRSST) + SVDCRSRO  (multiple)             */ 00098000
*/*          SVDCRGRP A(SVDCRHDR) + SVDCRGO   (multiple)         @L2C*/ 00099000
*/*          SVDCRGVS A(SVDCRGRP) + SVDCRGVO  (multiple)         @P1C*/ 00100000
*/*          SVDCREXT A(SVDCRHDR) + SVDCR_SST_EXT_OFF (multiple) @L2A*/ 00101000
*/*                                                                  */ 00102000
*/*          Subsequent elements of a section can be found           */ 00103000
*/*          by adding the size of one element as indicated          */ 00104000
*/*          in the header to the basing.                            */ 00105000
*/*                                                                  */ 00106000
*/*01* Notes:                                                    @P7A*/ 00107000
*/*    The ASSEMBLER section of this macro is automatically  @LEWMSMA*/ 00108000
*/*    generated using CBGEN                                 @LEWMSMA*/ 00109000
*/*                                                                  */ 00110000
*/*    To add extensions to the service definition               @P7A*/ 00111000
*/*      classification rules:                                   @P7A*/ 00112000
*/*                                                              @P7A*/ 00113000
*/*    The following fields must be updated:                     @P7A*/ 00114000
*/*                                                              @P7A*/ 00115000
*/*     1) SVDCR_EXT_DATA_OFF - the offset to the beginning of   @P7A*/ 00116000
*/*                             the extension data, from the     @P7A*/ 00117000
*/*                             beginning of IWMSVDCR.           @P7A*/ 00118000
*/*     2) SVDCR_EXT_DATA_LEN - the total length of the          @P7A*/ 00119000
*/*                             extension data, not including    @P7A*/ 00120000
*/*                             the length of the extension      @P7A*/ 00121000
*/*                             entries.                         @P7A*/ 00122000
*/*                                                              @P7A*/ 00123000
*/*    For each part of the service definition classification    @P7A*/ 00124000
*/*    rules with extensions, the appropriate fields in the      @P7A*/ 00125000
*/*    SVDCR must be updated with:                               @P7A*/ 00126000
*/*                                                              @P7A*/ 00127000
*/*     1) the offset to the extension entries from the          @P7A*/ 00128000
*/*        beginning of IWMSVDCR (i.e. SVDCR_SST_EXT_OFF).       @P7A*/ 00129000
*/*                                                              @P7A*/ 00130000
*/*     2) the number of extension entries                       @P7A*/ 00131000
*/*         (i.e. SVDCR_SST_EXT_NUM).                            @P7A*/ 00132000
*/*                                                              @P7A*/ 00133000
*/*     3) the length of an extension entry                      @P7A*/ 00134000
*/*         (i.e. SVDCR_SST_EXT_SIZ).                            @P7A*/ 00135000
*/*                                                              @P7A*/ 00136000
*/*    Each extension entry (mapped by DSECT SVDCREXT) must have @P7A*/ 00137000
*/*    the following fields filled in:                           @P7A*/ 00138000
*/*                                                              @P7A*/ 00139000
*/*     1) SVDCRID - identifier of the product adding the        @P7A*/ 00140000
*/*                  extension.                                  @P7A*/ 00141000
*/*                                                              @P7A*/ 00142000
*/*     2) SVDCRROB - Name of related object.                    @P7A*/ 00143000
*/*                                                              @P7A*/ 00144000
*/*     3) SVDCREDL - The length of the extension data.          @P7A*/ 00145000
*/*                                                              @P7A*/ 00146000
*/*     4) SVDCREDO - The offset to the extension data from the  @P7A*/ 00147000
*/*                   start of the extension data.               @P7A*/ 00148000
*/*                                                              @P7A*/ 00149000
*/*                                                                  */ 00150000
*/*01* Change Activity:                                              */ 00151000
*/*    $L0=WLMI    HBB5510  921231 PD88IK: Workload Manager I        */ 00152000
*/*    $T1=PIG5037 HBB5510  940202 PD88IK: OW01260: CDPI change  @T1A*/ 00153000
*/*    $L1=ENCLV   HBB5520  940210 PDD5  : Enclave Support           */ 00154000
*/*    $L2=WLMRM   HBB5520  940323 PDBV  : WLM RM                @L2A*/ 00155000
*/*    $P1=PN71296 HBB5520  940908 PDD5  : Correct DSECT info    @P1A*/ 00156000
*/*    $P2=PN71610 HBB5520  940915 PDDB  : Reserve future            */ 00157000
*/*                                        qualifier types       @P2A*/ 00158000
*/*    $P3=PN71618 HBB5520  940915 PDDB  : Reserve future            */ 00159000
*/*                                        group types           @P3A*/ 00160000
*/*    $P4=PN71675 HBB5520  941020 PDD0  : Correct DSECT info    @P4A*/ 00161000
*/*    $P5=PIG5510 HBB5510  940915 PD72DB: OW08866                   */ 00162000
*/*                                        Migration support     @P5A*/ 00163000
*/*    $P6=PIG5386 HBB5520  940915 PD72DB: OW08866                   */ 00164000
*/*                                        Migration support     @P6A*/ 00165000
*/*    $P7=PN72034 HBB5520  941201 PD88D0: Prolog updates        @P7A*/ 00166000
*/*    OW13309              950605 PD88DA: Add SVDCR_LEVEL000        */ 00167000
*/*                                                          @WA13309*/ 00168000
*/*    $WLMPSTP    HBB6603  950612 PD88DB: Stored SQL procedures     */ 00169000
*/*                                                          @WLMPSTP*/ 00170000
*/*    $WLMPENH    HBB6603  951101 PD88KN: Kin Ng- New classification*/ 00171000
*/*                                        attributes        @WLMPENH*/ 00172000
*/*    $WLMPBAT    JBB6604  960925 B9HAGD: Classify by priority      */ 00173000
*/*                                                          @WLMPBAT*/ 00174000
*/*    $WLMPSDC    HBB6606  970905 B9HAKP: Add description fields for*/ 00175000
*/*                                        Serv Def comments @WLMPSDC*/ 00176000
*/*    $PVT0380    HBB6606  970905 B9HADB: Description fields for    */ 00177000
*/*                                        Serv Def comments         */ 00178000
*/*                                        not for IWMCQRY   @WLMPSDC*/ 00179000
*/*    $WLMPMQS    JBB6607  980417 B9HARF: Process Name              */ 00180000
*/*                                                          @WLMPMQS*/ 00181000
*/*    $WLMPGMY    HBB7703  991027 B9HAPC: Patrick Chan              */ 00182000
*/*                                        - Add constant for        */ 00183000
*/*                                        funcationality level 11   */ 00184000
*/*                                        - Add constant for WLM R8,*/ 00185000
*/*                                        funcationality level 8    */ 00186000
*/*                                        - Add bit for System Name,*/ 00187000
*/*                                        Sysplex Name, Subsystem   */ 00188000
*/*                                        Collection, Scheduling    */ 00189000
*/*                                        Environment and system    */ 00190000
*/*                                        name group                */ 00191000
*/*                                                          @WLMPGMY*/ 00192000
*/*    $OW43587    HBB7703  000310 B9HAPC: Patrick Chan              */ 00193000
*/*                                        The following changes are */ 00194000
*/*                                        flagged by @WLMCGMS:      */ 00195000
*/*                                        - Add storage protection  */ 00196000
*/*                                          bit             @WLMCGMS*/ 00197000
*/*                                        The following changes are */ 00198000
*/*                                        flagged by @WLMCGMT:      */ 00199000
*/*                                        - Add bit for Transaction */ 00200000
*/*                                          Region Management       */ 00201000
*/*                                                          @WLMCGMT*/ 00202000
*/*                                                                  */ 00203000
*/*    $WLMPLNX    HBB7705  001012 B9HAPC: Patrick Chan              */ 00204000
*/*                                        Add LEVEL013 for LINUX    */ 00205000
*/*                                        support.          @WLMPLNX*/ 00206000
*/*                                                                  */ 00207000
*/*    $WLMPESC    HBB7730  050907 3141MG: Matthias Gubitz           */ 00208000
*/*                                        Add LEVEL017 for Service  */ 00209000
*/*                                        Class Correlation         */ 00210000
*/*    $WLMPEEG    HBB7730  050907 3241SW: Stefan Wirag              */ 00211000
*/*                                        Add LEVEL019 for Process  */ 00212000
*/*                                        Entitlement Groups        */ 00213000
*/*    $LEWLTM     HBB7750  060607 3241HB: Helmut Belzner            */ 00214000
*/*                                        EWLM E2E Transaction      */ 00215000
*/*                                        Management support        */ 00216000
*/*    $ME10212    HBB7750  070511 3241BH: Bill Heisser              */ 00217000
*/*                                        Restricted Material stmt  */ 00218000
*/*                                        in Copyright removed      */ 00219000
*/*    $LEXTRC     HBB7760  080331 3241TB: Thomas Blattmann          */ 00220000
*/*                                        extend max num of report  */ 00221000
*/*                                        classes to 2047           */ 00222000
*/*    $LEWMSM     HBB7760  080320 3241HB: Helmut Belzner            */ 00223000
*/*                                        EWLM managed server       */ 00224000
*/*                                        integration               */ 00225000
*/*    $ME17808    HBB7770  091126 3241MG: Matthias Gubitz           */ 00226000
*/*                                        Add LEVEL025 for GPMP     */ 00227000
*/*                                        settings                  */ 00228000
*/*    $CASECNV    HBB7780  101011 3241HB: Helmut Belzner            */ 00229000
*/*                                        CASE conversion           */ 00230000
*/*                                        Constants of CASE part are*/ 00231000
*/*                                        added to PLX part.@CASECNV*/ 00232000
*/*    $LCRTME     HBB7780  110201 3241IS: Irene Stahl               */ 00233000
*/*                                        CICS Response Time        */ 00234000
*/*                                        Management Enhancement    */ 00235000
*/*    $LSPMGR     HBB7790  110307 3241IS: Irene Stahl               */ 00236000
*/*                                        SPM groups                */ 00237000
*/*    $LSPMGR     HBB7790  110519 3241IS: Irene Stahl               */ 00238000
*/*                                        New qualifier types CAI,  */ 00239000
*/*                                        CTN for DB2               */ 00240000
*/*    $OA47042    HBB7790  150608 3241IS: Irene Stahl               */ 00241000
*/*                                        Special reporting         */ 00242000
*/*    $LRESPT     HBB77B0  160122 3241MG: Matthias Gubitz           */ 00243000
*/*                                        Shorter response time     */ 00244000
*/*                                        goal                      */ 00245000
*/*    $OA50845    HBB7790 160509 3241IS:  Irene Stahl               */ 00246000
*/*                                        Force "Honorpriority"     */ 00247000
*/*                                        to NO for specialty       */ 00248000
*/*                                        processors                */ 00249000
*/*    $OA52312    HBB77B0 170110 3241IS:  Irene Stahl       @LWBGRP */ 00250000
*/*                                        Workload billing groups   */ 00251000
*/*    $LBOOS3     HBB77D0 210111 3241IS:  Irene Stahl       @OA60841*/ 00252000
*/*                                        System Recovery Boost     */ 00253000
*/*                                        stage 3                   */ 00254000
*/*                                                                  */ 00255000
*/***END OF SPECIFICATIONS********************************************/ 00256000
*% /*                                                                   00257000
.P0      ANOP                                                           00258000
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 00259000
         AIF   ('&LIST' EQ 'YES').P2                                    00260000
.P1      ANOP                                                           00261000
         PUSH  PRINT                                                    00262000
         PRINT OFF                                                      00263000
.P2      ANOP                                                           00264000
         AIF   ('&SVDCRHDR' EQ 'NO').L0002                              00265000
         AIF   ('&DSECT' EQ 'YES').L0003                                00266000
         AIF   ('&SVDCRHDR' NE 'YES').L0002                             00267000
.L0003   ANOP                                                           00268000
*                                                                       00269000
*    *****************************************************************  00270000
*    *                                                               *  00271000
*    * Service definition classification rule header section         *  00272000
*    *                                                               *  00273000
*    *****************************************************************  00274000
*                                                                       00275000
*                                                                       00276000
         AIF   ('&DSECT' EQ 'YES').L0004                                00277000
SVDCRHDR DS    0D        Service definition classification rule header *00278000
                         section                                        00279000
         AGO   .L0005                                                   00280000
.L0004   ANOP                                                           00281000
SVDCRHDR DSECT           Service definition classification rule header *00282000
                         section                                        00283000
.L0005   ANOP                                                           00284000
SVDCRNAM DS    CL4       Eyecatcher                                     00285000
SVDCRLVL DS    X         Functionality level of the SVDCR.              00286000
*                                                                       00287000
*      ***************************************************************  00288000
*      *                                                             *  00289000
*      * The functionality level defines                                00290000
*      * the highest level of WLM function                              00291000
*      * that exists in the SVDCR.                                      00292000
*      *                                                             *  00293000
*      ***************************************************************  00294000
*                                                                       00295000
*                                                                       00296000
SVDCRWVN DS    X         WLM version number                             00297000
SVDCRDIL DS    H         Size in bytes of header section                00298000
SVDCRSIZ DS    F         Size in bytes of the whole classification     *00299000
                         rule definition                                00300000
SVDCRSO  DS    F         Offset of subsystem type section if number of *00301000
                         subsystems is nonzero (otherwise this field   *00302000
                         is ignored)                                    00303000
SVDCRSN  DS    H         Number of subsystem type entries               00304000
SVDCRSS  DS    H         Size of a subsystem type entry                 00305000
SVDCRRO  DS    F         Offset of classification rule section if      *00306000
                         number of classification rules is nonzero     *00307000
                         (otherwise this field is ignored)              00308000
SVDCRRN  DS    H         Number of classification rule entries          00309000
SVDCRRS  DS    H         Size of a classification rule entry            00310000
SVDCRGO  DS    F         Offset of group section if number of groups   *00311000
                         is nonzero (othwerwise this field is ignored)  00312000
SVDCRGN  DS    H         Number of group entries                        00313000
SVDCRGS  DS    H         Size of a group entry                          00314000
SVDCRVO  DS    F         Offset of group value section if the groups   *00315000
                         is nonzero (othwerwise this field is ignored   00316000
SVDCRVN  DS    H         Number of group value entries                  00317000
SVDCRVS  DS    H         Size of a group value entry                    00318000
SVDCRLN  DS    H         Deepest allowed level of nesting of           *00319000
                         classification rules (cannot exceed 4)         00320000
         DS    CL2       Reserved                                       00321000
         DS    CL32      Reserved for additional triplets               00322000
SVDCR_EXT_DATA_OFF DS F  Offset of extended data - this field not      *00323000
                         applicable for the IWMCQRY interface           00324000
SVDCR_EXT_DATA_LEN DS F  Length of extended data - this field not      *00325000
                         applicable for the IWMCQRY interface           00326000
SVDCR_SST_EXT_OFF DS F   Offset of subsystem type extension section if *00327000
                         number of subsystem type extensions is        *00328000
                         nonzero (otherwise this field is ignored) -   *00329000
                         this field not applicable for the IWMCQRY     *00330000
                         interface                                      00331000
SVDCR_SST_EXT_NUM DS H   Number of subsystem type extension entries -  *00332000
                         this field not applicable for the IWMCQRY     *00333000
                         interface                                      00334000
SVDCR_SST_EXT_SIZ DS H   Length of each subsystem type extension entry *00335000
                         - this field not applicable for the IWMCQRY   *00336000
                         interface                                      00337000
         DS    CL32      Reserved for additional extension triplets     00338000
SVDCRHDR_LEN EQU *-SVDCRHDR                                             00339000
.L0002   ANOP                                                           00340000
         AIF   ('&SVDCRSST' EQ 'NO').L0006                              00341000
         AIF   ('&DSECT' EQ 'YES').L0007                                00342000
         AIF   ('&SVDCRSST' NE 'YES').L0006                             00343000
.L0007   ANOP                                                           00344000
*                                                                       00345000
*      ***************************************************************  00346000
*      *                                                             *  00347000
*      * Subsystem type section                                      *  00348000
*      *                                                             *  00349000
*      ***************************************************************  00350000
*                                                                       00351000
*                                                                       00352000
         AIF   ('&DSECT' EQ 'YES').L0008                                00353000
SVDCRSST DS    0F        Subsystem type section                         00354000
         AGO   .L0009                                                   00355000
.L0008   ANOP                                                           00356000
SVDCRSST DSECT           Subsystem type section                         00357000
.L0009   ANOP                                                           00358000
SVDCRSNM DS    CL4       Subsystem type name                            00359000
SVDCRSDE DS    CL32      Subsystem type description (this field not    *00360000
                         provided for IWMCQRY)                          00361000
SVDCRSFL DS    CL1       Subsystem type flags                           00362000
*  Bit definitions:                                                     00363000
SVDCRSCI EQU   X'80'     Default service class name specified           00364000
SVDCRSPI EQU   X'40'     Default report class name specified            00365000
SVDCRSAL EQU   X'20'     Always use EWLM cLassification rule            00366000
SVDCRSHE EQU   X'10'     Honor existing EWLM cLassification             00367000
         DS    CL3       Reserved                                       00368000
SVDCRSCN DS    CL8       Service class name to which work for this     *00369000
                         subsystem type will be classified if not      *00370000
                         overridden by service class associated with a *00371000
                         particular rule. This field valid only if     *00372000
                         SVDCRSCI is on                                 00373000
SVDCRSPN DS    CL8       Report class name to which work for this      *00374000
                         subsystem type will be reported if not        *00375000
                         overridden by report class associated with a  *00376000
                         particular rule. This field valid only if     *00377000
                         SVDCRSPI is on                                 00378000
SVDCRSRO DS    F         Offset to the first classification rule for   *00379000
                         this subsystem type from the beginning of     *00380000
                         this SVDCRSST entry                            00381000
SVDCRSRN DS    H         Total number of classification rules for this *00382000
                         subsystem type                                 00383000
         DS    CL2       Reserved                                       00384000
SVDCRSIU DS    CL8       Userid of subsystem type creator (this field  *00385000
                         not provided for IWMCQRY)                      00386000
SVDCRSIT DS    CL8       Timestamp of initial creation (this field not *00387000
                         provided for IWMCQRY)                          00388000
SVDCRSRU DS    CL8       Userid of subsystem type last update (this    *00389000
                         field not provided for IWMCQRY)                00390000
SVDCRSRT DS    CL8       Timestamp of subsystem type last update (this *00391000
                         field not provided for IWMCQRY)                00392000
SVDCRSST_LEN EQU *-SVDCRSST                                             00393000
.L0006   ANOP                                                           00394000
         AIF   ('&SVDCRRUL' EQ 'NO').L000A                              00395000
         AIF   ('&DSECT' EQ 'YES').L000B                                00396000
         AIF   ('&SVDCRRUL' NE 'YES').L000A                             00397000
.L000B   ANOP                                                           00398000
*                                                                       00399000
*      ***************************************************************  00400000
*      *                                                             *  00401000
*      * Classification rule section                                 *  00402000
*      *                                                             *  00403000
*      ***************************************************************  00404000
*                                                                       00405000
*                                                                       00406000
         AIF   ('&DSECT' EQ 'YES').L000C                                00407000
SVDCRRUL DS    0F        Classification rule entry                      00408000
         AGO   .L000D                                                   00409000
.L000C   ANOP                                                           00410000
SVDCRRUL DSECT           Classification rule entry                      00411000
.L000D   ANOP                                                           00412000
SVDCRRQT DS    CL4       Classification rule qualifier type to         *00413000
                         indicate the type of value in SVDCRRQV. Each  *00414000
                         qualifier type takes a character value with   *00415000
                         optional masking or wildcarding unless        *00416000
                         otherwise noted.                               00417000
         ORG   SVDCRRQT                                                 00418000
SVDCRRQT_BYTE1 DS CL1    First byte                                     00419000
*  Bit definitions:                                                     00420000
SVDCRRTN EQU   X'80'     Transaction name                               00421000
SVDCRRTC EQU   X'40'     Transaction class                              00422000
SVDCRRUI EQU   X'20'     Userid                                         00423000
SVDCRRSN EQU   X'10'     Subsystem name                                 00424000
SVDCRRNI EQU   X'08'     Net id                                         00425000
SVDCRRLU EQU   X'04'     LU name                                        00426000
SVDCRRAC EQU   X'02'     Accounting information                         00427000
SVDCRRSP EQU   X'01'     Subsystem parameter                            00428000
SVDCRRQT_BYTE2 DS CL1    Second byte                                    00429000
*  Bit definitions:                                                     00430000
SVDCRRQT_COLL_NAME EQU X'80' Collection name                            00431000
SVDCRRQT_CORR_INFO EQU X'40' Correlation information                    00432000
SVDCRRQT_CONN_TYPE EQU X'20' Connection type                            00433000
SVDCRRQT_PACK_NAME EQU X'10' Package name                               00434000
SVDCRRQT_PLAN_NAME EQU X'08' Plan name                                  00435000
SVDCRRQT_PERFORM EQU X'04' Perform - although this is a number, it is  *00436000
                         treated as character data, i.e. masking and   *00437000
                         wildcarding can be used, relational operators *00438000
                         cannot be used                                 00439000
SVDCRRQT_PROC_NAME EQU X'02' Procedure Name                             00440000
SVDCRRQT_PRIORITY EQU X'01' Priority - qualifier value is a number     *00441000
                         optionally preceded by a relational operator   00442000
SVDCRRQT_BYTE3 DS CL1    Third byte                                     00443000
*  Bit definitions:                                                     00444000
SVDCRRQT_PROCESS_NAME EQU X'80' Process Name                            00445000
SVDCRRQT_SYSTEM_NAME EQU X'40' System Name                              00446000
SVDCRRQT_SYSPLEX_NAME EQU X'20' Sysplex Name                            00447000
SVDCRRQT_SUBSYSTEM_COLLECTION EQU X'10' Subsystem Collection            00448000
SVDCRRQT_SCHEDULING_ENVIRONMENT EQU X'08' Scheduling Environment        00449000
SVDCRRQT_EWLM_SCLASS EQU X'04' EWLM service class                       00450000
SVDCRRQT_EWLM_TCLASS EQU X'02' EWLM transaction class                   00451000
SVDCRRQT_CLIENT_USERID EQU X'01' Client UserId                          00452000
SVDCRRQT_BYTE4 DS CL1    Fourth byte                                    00453000
*  Bit definitions:                                                     00454000
SVDCRRQT_CLIENT_WORKSTATION_NAME EQU X'80' Client workstation name      00455000
SVDCRRQT_CLIENT_IP_ADDRESS EQU X'40' Client IP address                  00456000
SVDCRRQT_CLIENT_AI EQU X'20' Client Accounting Information              00457000
SVDCRRQT_CLIENT_TN EQU X'10' Client Transaction Name                    00458000
SVDCRRQT_B4_RSV08 EQU X'08' Reserved for future type and must be zero   00459000
SVDCRRQT_B4_RSV04 EQU X'04' Reserved for future type and must be zero   00460000
SVDCRRQT_B4_RSV02 EQU X'02' Reserved for future type and must be zero   00461000
SVDCRRQT_B4_RSV01 EQU X'01' Reserved for future type and must be zero   00462000
*                                                                       00463000
*         Format of SVDCRRQV (rule qualifier value):                    00464000
*                                                                       00465000
*         If SVDCRRGI is off (indicating this qualifier value           00466000
*         does not refer to a group name) special characters            00467000
*         or operators can be used based on the data type of            00468000
*         the qualifier value.                                          00469000
*                                                                       00470000
*         For attributes that take character data (such as              00471000
*         transaction name) the following special characters            00472000
*         apply:                                                        00473000
*                                                                       00474000
*           - Asterisk (*) in the last non-blank character              00475000
*             position indicates wildcard (note: an asterisk            00476000
*             in any other position is treated simply as the            00477000
*             asterisk character)                                       00478000
*                                                                       00479000
*           - Mask character (%) in any position indicates              00480000
*             that position will match any value for that               00481000
*             character                                                 00482000
*                                                                       00483000
*         For attributes that take numeric data (such as                00484000
*         priority), the qualifier value consists of 1 to 8             00485000
*         EBCDIC digits, optionally preceded by one of the              00486000
*         operators shown below.  The operator must be in               00487000
*         position 1, and the digits must follow the operator           00488000
*         with no intervening blanks.  If no operator appears           00489000
*         (digits must begin in position 1), an equal                   00490000
*         comparison is performed.  Trailing blanks can appear          00491000
*         after the digits to pad the value to 8 characters.            00492000
*                                                                       00493000
*           - Less than (<)                                             00494000
*           - Greater than (>)                                          00495000
*           - Less than or equal (<=)                                   00496000
*           - Greater than or equal (>=)                                00497000
*           - Not equal (<>)                                            00498000
*                                                                       00499000
*         If SVDCRRGI is on (indicating this field contains             00500000
*         a group name), then no wildcard or mask characters            00501000
*         or relational operators may be specified.                     00502000
*                                                                       00503000
*                                                                       00504000
*                                                                       00505000
         ORG   SVDCRRQT+4                                               00506000
SVDCRRQV DS    CL8       Classification rule qualifier value (see      *00507000
                         description of format above)                   00508000
SVDCRRSV DS    H         Substring value index - starting position of  *00509000
                         substring. Ignored if SVDCRRSU is off.         00510000
         DS    CL2       Reserved                                       00511000
SVDCRRFL DS    CL1       Classification rule flags                      00512000
*  Bit definitions:                                                     00513000
SVDCRRSU EQU   X'20'     Substringing used for qualifier value         *00514000
                         (mutually exclusive with SVDCRRGI, qualifier  *00515000
                         must take character data)                      00516000
SVDCRRCI EQU   X'08'     Service class name specified for this rule     00517000
SVDCRRPI EQU   X'04'     Report class name specified for this rule      00518000
SVDCRRGI EQU   X'02'     Qualifier value refers to a group              00519000
SVDCRSTR EQU   X'01'     Storage Protection                             00520000
SVDCRRF2 DS    CL1       Classification rule flags                      00521000
SVDCRRF3 DS    CL1       Classification rule flags byte 3. Currently,  *00522000
                         this byte contain bits that are going to be   *00523000
                         used in both SVPOL and SVDEF                   00524000
*  Bit definitions:                                                     00525000
SVDCRTRM EQU   X'80'     Transaction or Region Management Option       *00526000
                         Transaction: SVDCRTRM = 0 Region : SVDCRTRM = *00527000
                         1                                              00528000
SVDCRTRB EQU   X'40'     Transaction or Region Management Option Set   *00529000
                         when value BOTH is specified                   00530000
*                                                                       00531000
*      ***************************************************************  00532000
*      *                                                             *  00533000
*      * Reporting Flags: '00' = normal transaction,                    00534000
*      * '01' = mobile transaction,                                     00535000
*      * '10' = categoryA transaction,                                  00536000
*      * '11' = categoryB transaction                                   00537000
*      *                                                             *  00538000
*      ***************************************************************  00539000
*                                                                       00540000
*                                                                       00541000
SVDCR_SPECRPT1 EQU X'20' Reporting Flag1                                00542000
SVDCR_SPECRPT2 EQU X'10' Reporting Flag2                                00543000
SVDCR_BOOST EQU X'08'    Boost enabled                                  00544000
         DS    CL1       Reserved                                       00545000
SVDCRRCN DS    CL8       Service class name this rule will assign if   *00546000
                         rule matches. Valid only if classification    *00547000
                         rule flag (SVDCRRCI) indicates that the       *00548000
                         service class name was specified.              00549000
SVDCRRPN DS    CL8       Report class name, if SVDCRRPI is ON           00550000
SVDCRRLV DS    H         Nesting level of rule from 1 to 4              00551000
         DS    CL2       Reserved                                       00552000
         DS    F         Reserved                                       00553000
SVDCRDES DS    CL32      Rule definition - this field not applicable   *00554000
                         for IWMCQRY                                    00555000
SVDCRRUL_LEN EQU *-SVDCRRUL                                             00556000
.L000A   ANOP                                                           00557000
         AIF   ('&SVDCRGRP' EQ 'NO').L000E                              00558000
         AIF   ('&DSECT' EQ 'YES').L000F                                00559000
         AIF   ('&SVDCRGRP' NE 'YES').L000E                             00560000
.L000F   ANOP                                                           00561000
*                                                                       00562000
*      ***************************************************************  00563000
*      *                                                             *  00564000
*      * Group section                                               *  00565000
*      *                                                             *  00566000
*      ***************************************************************  00567000
*                                                                       00568000
*                                                                       00569000
         AIF   ('&DSECT' EQ 'YES').L0010                                00570000
SVDCRGRP DS    0F        Group section                                  00571000
         AGO   .L0011                                                   00572000
.L0010   ANOP                                                           00573000
SVDCRGRP DSECT           Group section                                  00574000
.L0011   ANOP                                                           00575000
SVDCRGRN DS    CL8       Name of group                                  00576000
SVDCRGDE DS    CL32      Group description (this field not provided    *00577000
                         for IWMCQRY)                                   00578000
SVDCRGTY DS    CL2       Qualifier type information for group describe *00579000
                         the type in the value list                     00580000
         ORG   SVDCRGTY                                                 00581000
SVDCRGTY_BYTE1 DS CL1    First byte                                     00582000
*  Bit definitions:                                                     00583000
SVDCRGTN EQU   X'80'     Transaction name                               00584000
SVDCRGTC EQU   X'40'     Transaction class                              00585000
SVDCRGUI EQU   X'20'     Userid                                         00586000
SVDCRGSN EQU   X'10'     Subsystem name                                 00587000
SVDCRGNI EQU   X'08'     Net id                                         00588000
SVDCRGLU EQU   X'04'     LU name                                        00589000
SVDCRGTY_CONN_TYPE EQU X'02' Connection type                            00590000
SVDCRGTY_PACK_NAME EQU X'01' Package name                               00591000
SVDCRGTY_BYTE2 DS CL1    Second byte                                    00592000
*  Bit definitions:                                                     00593000
SVDCRGTY_PLAN_NAME EQU X'80' Plan name                                  00594000
SVDCRGTY_PERFORM EQU X'40' Perform                                      00595000
SVDCRGTY_SYSTEM_NAME EQU X'20' System Name Group                        00596000
SVDCRGTY_AI EQU X'10'    Accounting Information Group                   00597000
SVDCRGTY_CI EQU X'08'    Correlation Information Group                  00598000
SVDCRGTY_CIP EQU X'04'   Client IP Address Group                        00599000
SVDCRGTY_CN EQU X'02'    Collection Name Group                          00600000
SVDCRGTY_CUI EQU X'01'   Client UserId Group                            00601000
         ORG   SVDCRGTY+2                                               00602000
SVDCRGTY_BYTE3 DS CL1    Third byte                                     00603000
*  Bit definitions:                                                     00604000
SVDCRGTY_CWN EQU X'80'   Client Workstation Name Group                  00605000
SVDCRGTY_PC EQU X'40'    Process Name Group                             00606000
SVDCRGTY_PR EQU X'20'    Procedure Name Group                           00607000
SVDCRGTY_PX EQU X'10'    Sysplex Name Group                             00608000
SVDCRGTY_SE EQU X'08'    Scheduling Environment Group                   00609000
SVDCRGTY_SPM EQU X'04'   Subsystem Parameter Group                      00610000
SVDCRGTY_SSC EQU X'02'   Subsystem Collection Group                     00611000
SVDCRGTY_CAI EQU X'01'   Client Accounting Information Group            00612000
SVDCRGTY_BYTE4 DS CL1    Fourth byte                                    00613000
*  Bit definitions:                                                     00614000
SVDCRGTY_CTN EQU X'80'   Client Transaction Name Group                  00615000
SVDCRGVO DS    F         Offset to the first group value for this      *00616000
                         group from the beginning of this SVDCRGRP     *00617000
                         entry                                          00618000
SVDCRGVN DS    H         Total number of values for this group          00619000
         DS    CL2       Reserved                                       00620000
SVDCRGIU DS    CL8       Userid of group creator (this field not       *00621000
                         provided for IWMCQRY)                          00622000
SVDCRGIT DS    CL8       Timestamp of initial creation (this field not *00623000
                         provided for IWMCQRY)                          00624000
SVDCRGRU DS    CL8       Userid of group last update (this field not   *00625000
                         provided for IWMCQRY)                          00626000
SVDCRGRT DS    CL8       Timestamp of group last update (this field    *00627000
                         not provided for IWMCQRY)                      00628000
SVDCRGRP_LEN EQU *-SVDCRGRP                                             00629000
.L000E   ANOP                                                           00630000
         AIF   ('&SVDCRGVS' EQ 'NO').L0012                              00631000
         AIF   ('&DSECT' EQ 'YES').L0013                                00632000
         AIF   ('&SVDCRGVS' NE 'YES').L0012                             00633000
.L0013   ANOP                                                           00634000
*                                                                       00635000
*      ***************************************************************  00636000
*      *                                                             *  00637000
*      * Group value section                                         *  00638000
*      *                                                             *  00639000
*      ***************************************************************  00640000
*                                                                       00641000
*                                                                       00642000
         AIF   ('&DSECT' EQ 'YES').L0014                                00643000
SVDCRGVS DS    0H        Group member                                   00644000
         AGO   .L0015                                                   00645000
.L0014   ANOP                                                           00646000
SVDCRGVS DSECT           Group member                                   00647000
.L0015   ANOP                                                           00648000
SVDCRGVV DS    CL8       Group value                                    00649000
SVDCRGSV DS    H         Substring value index - starting position of  *00650000
                         substring. Ignored if SVDCRGSU is off          00651000
SVDCRGFL DS    CL1       Group value flags                              00652000
*  Bit definitions:                                                     00653000
SVDCRGSU EQU   X'80'     Substringing used for qualifier value          00654000
         DS    CL1       Reserved                                       00655000
SVDCRGDS DS    CL32      Group value definition, this field not        *00656000
                         applicable for IWMCQRY                         00657000
SVDCRGVS_LEN EQU *-SVDCRGVS                                             00658000
.L0012   ANOP                                                           00659000
         AIF   ('&SVDCREXT' EQ 'NO').L0016                              00660000
         AIF   ('&DSECT' EQ 'YES').L0017                                00661000
         AIF   ('&SVDCREXT' NE 'YES').L0016                             00662000
.L0017   ANOP                                                           00663000
*                                                                       00664000
*      ***************************************************************  00665000
*      *                                                             *  00666000
*      * Extension section NOTE: No extension data is returned on the*  00667000
*      * IWMCQRY interface                                           *  00668000
*      *                                                             *  00669000
*      ***************************************************************  00670000
*                                                                       00671000
*                                                                       00672000
         AIF   ('&DSECT' EQ 'YES').L0018                                00673000
SVDCREXT DS    0F        Extension section entry                        00674000
         AGO   .L0019                                                   00675000
.L0018   ANOP                                                           00676000
SVDCREXT DSECT           Extension section entry                        00677000
.L0019   ANOP                                                           00678000
SVDCRVID DS    CL8       Unique vendor id that owns the entry           00679000
SVDCRROB DS    CL4       Related subsystem type name - name of         *00680000
                         subsystem which this extension entry extends   00681000
         DS    CL4       Reserved in case 8-character extension        *00682000
                         becomes necessary                              00683000
SVDCREDL DS    H         Extended data length                           00684000
         DS    CL2       Reserved                                       00685000
SVDCREDO DS    F         Offset to extended data - offset is from the  *00686000
                         beginning of the extended data whose offset   *00687000
                         is in SVDCR_EXT_DATA_OFF                       00688000
*                                                                       00689000
*    *****************************************************************  00690000
*    *                                                               *  00691000
*    * Constants                                                     *  00692000
*    *                                                               *  00693000
*    *****************************************************************  00694000
*                                                                       00695000
*                                                                       00696000
SVDCR_ID EQU   C'SVDC'   SVDCR identifier                               00697000
SVDCR_LEVEL000 EQU 0     Functionality level introduced by WLM in      *00698000
                         SP510 before migration coexistence             00699000
SVDCR_LEVEL001 EQU 1     Functionality level introduced by WLM in      *00700000
                         SP510.                                         00701000
SVDCR_SP510 EQU 1        WLM SP510 version                              00702000
SVDCR_LEVEL002 EQU 2     Functionality level introduced by WLM in      *00703000
                         SP520.                                         00704000
SVDCR_SP520 EQU 2        WLM SP520 version                              00705000
SVDCR_LEVEL003 EQU 3     Functionality level introduced by WLM in      *00706000
                         OS/390 V1R3.                                   00707000
SVDCR_SP530 EQU 3        WLM version number for OS/390 V1R3             00708000
SVDCR_LEVEL004 EQU 4     Functionality level introduced by WLM in      *00709000
                         OS/390 V2R4                                    00710000
SVDCR_SP604 EQU 4        WLM version number for OS/390 V2R4             00711000
SVDCR_LEVEL005 EQU 5     Functionality level introduced by WLM in      *00712000
                         OS/390 V2R5                                    00713000
SVDCR_SP605 EQU 5        WLM version number for OS/390 V2R5             00714000
SVDCR_LEVEL006 EQU 6     Functionality level introduced by WLM in      *00715000
                         OS/390 V2R6                                    00716000
SVDCR_SP606 EQU 6        WLM version number for OS/390 V2R6             00717000
SVDCR_LEVEL007 EQU 7     Functionality level introduced by WLM in      *00718000
                         OS/390 V2R7                                    00719000
SVDCR_SP607 EQU 7        WLM version number for OS/390 V2R7             00720000
SVDCR_LEVEL008 EQU 8     Functionality level reserved for WLM OS/390   *00721000
                         V2R7                                           00722000
SVDCR_SP608 EQU 8        WLM version number for OS/390 V2R7             00723000
SVDCR_LEVEL009 EQU 9     Functionality level reserved for WLM OS/390   *00724000
                         V2R8                                           00725000
SVDCR_RESERVED_R08 EQU 9 WLM version number reserved for OS/390 V2R8    00726000
SVDCR_LEVEL010 EQU 10    Functionality level reserved for WLM OS/390   *00727000
                         V2R9                                           00728000
SVDCR_RESERVED_R09 EQU 10 WLM version number reserved for OS/390 V2R9   00729000
SVDCR_LEVEL011 EQU 11    Functionality level introduced by WLM in      *00730000
                         OS/390 V2R10                                   00731000
SVDCR_SP703 EQU 11       WLM version number for OS/390 V2R10            00732000
SVDCR_LEVEL012 EQU 12    Functionality level reserved for WLM in       *00733000
                         OS/390 V2R11                                   00734000
SVDCR_RESERVED_R11 EQU 12 WLM version number reserved for OS/390 V2R11  00735000
SVDCR_LEVEL013 EQU 13    Functionality level introduced by WLM in      *00736000
                         OS/390 V2R12                                   00737000
SVDCR_SP705 EQU 13       WLM version number for OS/390 V2R12            00738000
SVDCR_LEVEL014 EQU 14    Functionality level reserved for WLM z/OS     *00739000
                         V1R3                                           00740000
SVDCR_RESERVED_R13 EQU 14 WLM version number reserved for z/OS V1R3     00741000
SVDCR_LEVEL015 EQU 15    Functionality level reserved for WLM z/OS     *00742000
                         V1R4                                           00743000
SVDCR_RESERVED_R14 EQU 15 WLM version number reserved for z/OS V1R4     00744000
SVDCR_LEVEL016 EQU 16    Functionality level reserved for WLM z/OS     *00745000
                         V1R5                                           00746000
SVDCR_RESERVED_R15 EQU 16 WLM version number reserved for z/OS V1R5     00747000
SVDCR_LEVEL017 EQU 17    Functionality level reserved for WLM z/OS     *00748000
                         V1R6                                           00749000
SVDCR_RESERVED_R16 EQU 17 WLM version number reserved for z/OS V1R6     00750000
SVDCR_LEVEL018 EQU 18    Functionality level reserved for WLM z/OS     *00751000
                         V1R7                                           00752000
SVDCR_RESERVED_R17 EQU 18 WLM version number reserved for z/OS V1R7     00753000
SVDCR_LEVEL019 EQU 19    Functionality level introduced with WLM z/OS  *00754000
                         V1R8                                           00755000
SVDCR_RESERVED_R19 EQU 20 WLM version number reserved for z/OS V1R8     00756000
SVDCR_LEVEL021 EQU 21    Functionality level introduced with WLM z/OS  *00757000
                         V1R10                                          00758000
SVDCR_RESERVED_R21 EQU 22 WLM version number reserved for z/OS V1R10    00759000
SVDCR_LEVEL023 EQU 23    Functionality level introduced with WLM z/OS  *00760000
                         V1R11                                          00761000
SVDCR_RESERVED_R23 EQU 24 WLM version number reserved for z/OS V1R11   *00762000
                         APARs etc                                      00763000
SVDCR_LEVEL025 EQU 25    Functionality level introduced with WLM z/OS  *00764000
                         V1R12                                          00765000
SVDCR_RESERVED_R25 EQU 26 WLM version number reserved for z/OS V1R12   *00766000
                         APARs etc                                      00767000
SVDCR_LEVEL029 EQU 29    Functionality level introduced with WLM z/OS  *00768000
                         V2R1. There was no new functionality level    *00769000
                         for z/OS V1R13, therefore, level 27 and 28 is *00770000
                         left free                                      00771000
SVDCR_RESERVED_R29 EQU 30 WLM version number reserved for z/OS V2R1    *00772000
                         APARs etc                                      00773000
SVDCR_LEVEL030 EQU 30    WLM version number for Special Reporting       00774000
SVDCR_LEVEL031 EQU 31    WLM version number for Specialty Engines      *00775000
                         Containment                                    00776000
SVDCR_LEVEL032 EQU 32    WLM version number for Workload billing       *00777000
                         groups                                         00778000
SVDCR_LEVEL035 EQU 35    Functionality level introduced with WLM z/OS  *00779000
                         V2R3                                           00780000
SVDCR_LEVEL038 EQU 38    Functionality level introduced for System     *00781000
                         Recovery Boost stage 3                         00782000
SVDCR_SP709 EQU 17       WLM version number introduced with WLM z/OS   *00783000
                         V1R6                                           00784000
SVDCR_SP730 EQU 19       WLM version number introduced with z/OS V1R8   00785000
SVDCR_SP750 EQU 21       WLM version number introduced with z/OS V1R10  00786000
SVDCR_SP760 EQU 23       WLM version number introduced with z/OS V1R11  00787000
SVDCR_SP770 EQU 25       WLM version number introduced with z/OS V1R12  00788000
SVDCR_SP790 EQU 29       WLM version number introduced with z/OS V2R1   00789000
SVDCR_SP7B0 EQU 35       WLM version number introduced with z/OS V2R3   00790000
SVDCR_CURRENT_VER EQU 38 Current version level used when checking      *00791000
                         functionality within WLM product               00792000
SVDCR_NLEVEL EQU 4       SVDCR deepest level of nesting allowed         00793000
SVDCR_SECTION EQU 25     IWMSVDCR.77: Symbolic constant                 00794000
SVDCR_HDR_SECTION EQU 26 IWMSVDCR.68: Symbolic constant                 00795000
SVDCR_SST_SECTION EQU 27 IWMSVDCR.1245: Symbolic constant               00796000
SVDCR_RUL_SECTION EQU 28 IWMSVDCR.1016: Symbolic constant               00797000
SVDCR_GRP_SECTION EQU 29 IWMSVDCR.880: Symbolic constant                00798000
SVDCR_GVS_SECTION EQU 30 IWMSVDCR.889: Symbolic constant                00799000
SVDCR_EXT_SECTION EQU 31 IWMSVDCR.313: Symbolic constant                00800000
SVDCR_CONTEXT_RSN EQU 1  IWMSVDCR.322: Contextual problem               00801000
SVDCR_ENTRY_RSN EQU 2    IWMSVDCR.331: Entry problem                    00802000
SVDCREXT_LEN EQU *-SVDCREXT                                             00803000
.L0016   ANOP                                                           00804000
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 00805000
         AIF   ('&LIST' EQ 'YES').P4                                    00806000
.P3      ANOP                                                           00807000
         POP   PRINT                                                    00808000
.P4      ANOP                                                           00809000
.P_EXIT  ANOP                                                           00810000
         MEND                                                           00811000
**/ ;                                                                   00812000
* %IWMSVDCR_INCLUDED = 'YES';                                           00813000
* %DCL ZCBPRINT CHAR EXT;                                               00814000
* %DEACTIVATE ZCBPRINT;                                                 00815000
* %DCL IWMSVDCR_LIST CHAR EXT;                                          00816000
* %DEACTIVATE IWMSVDCR_LIST;                                            00817000
* %IF IWMSVDCR_LIST = 'NO' !                                            00818000
*    ZCBPRINT = 'NO' %THEN                                              00819000
* %DO;                                                                  00820000
*   @LIST PUSH NOECHO;                                                  00821000
*   @LIST NOASSEMBLE NOECHO;                                            00822000
*   @LIST OFF C NOECHO;                                                 00823000
* %END;                                                                 00824000
*/* Start of PL/X Source                                             */ 00825000
*   /*****************************************************************/ 00826000
*   /*                                                               */ 00827000
*   /* Service definition classification rule header section         */ 00828000
*   /*                                                               */ 00829000
*   /*****************************************************************/ 00830000
*                                                                       00831000
* DCL 1 SVDCRHDR BASED BDY(DWORD), /* Service definition                00832000
*                              classification rule header section    */ 00833000
*     3 SVDCRNAM CHAR(4),   /* Eyecatcher                            */ 00834000
*     3 SVDCRLVL FIXED(8),  /* Functionality level of the SVDCR. @P5C*/ 00835000
*                           /* The functionality level defines   @P5A*/ 00836000
*                           /* the highest level of WLM function @P5A*/ 00837000
*                           /* that exists in the SVDCR.         @P5A*/ 00838000
*     3 SVDCRWVN FIXED(8),  /* WLM version number                @P5C*/ 00839000
*     3 SVDCRDIL FIXED(16), /* Size in bytes of header section   @L2A*/ 00840000
*     3 SVDCRSIZ FIXED(32), /* Size in bytes of the whole               00841000
*                              classification rule definition        */ 00842000
*     3 SVDCRSO FIXED(32),  /* Offset of subsystem type section if      00843000
*                              number of subsystems is nonzero          00844000
*                              (otherwise this field is ignored)     */ 00845000
*     3 SVDCRSN FIXED(16),  /* Number of subsystem type entries      */ 00846000
*     3 SVDCRSS FIXED(16),  /* Size of a subsystem type entry        */ 00847000
*     3 SVDCRRO FIXED(32),  /* Offset of classification rule section    00848000
*                              if number of classification rules is     00849000
*                              nonzero (otherwise this field is         00850000
*                              ignored)                              */ 00851000
*     3 SVDCRRN FIXED(16),  /* Number of classification rule entries */ 00852000
*     3 SVDCRRS FIXED(16),  /* Size of a classification rule entry   */ 00853000
*     3 SVDCRGO FIXED(32),  /* Offset of group section if number of     00854000
*                              groups is nonzero (othwerwise this       00855000
*                              field is ignored)                     */ 00856000
*     3 SVDCRGN FIXED(16),  /* Number of group entries               */ 00857000
*     3 SVDCRGS FIXED(16),  /* Size of a group entry                 */ 00858000
*     3 SVDCRVO FIXED(32),  /* Offset of group value section if the     00859000
*                              groups is nonzero (othwerwise this       00860000
*                              field is ignored                      */ 00861000
*     3 SVDCRVN FIXED(16),  /* Number of group value entries         */ 00862000
*     3 SVDCRVS FIXED(16),  /* Size of a group value entry           */ 00863000
*     3 SVDCRLN FIXED(16),  /* Deepest allowed level of nesting of      00864000
*                              classification rules (cannot exceed 4)*/ 00865000
*     3 *       CHAR(2),    /* Reserved                              */ 00866000
*     3 *       CHAR(32),   /* Reserved for additional triplets  @L2A*/ 00867000
*     3 SVDCR_EXT_DATA_OFF FIXED(32), /* Offset of extended data -      00868000
*                              this field not applicable for the        00869000
*                              IWMCQRY interface                 @L2A*/ 00870000
*     3 SVDCR_EXT_DATA_LEN FIXED(32), /* Length of extended data -      00871000
*                              this field not applicable for the        00872000
*                              IWMCQRY interface                 @L2A*/ 00873000
*     3 SVDCR_SST_EXT_OFF FIXED(32), /* Offset of subsystem type        00874000
*                              extension section if number of subsystem 00875000
*                              type extensions is nonzero (otherwise    00876000
*                              this field is ignored) - this field not  00877000
*                              applicable for the IWMCQRY interface     00878000
*                                                                @L2A*/ 00879000
*     3 SVDCR_SST_EXT_NUM FIXED(16), /* Number of subsystem type        00880000
*                              extension entries - this field not       00881000
*                              applicable for the IWMCQRY interface     00882000
*                                                                @L2A*/ 00883000
*     3 SVDCR_SST_EXT_SIZ FIXED(16), /* Length of each subsystem        00884000
*                              type extension entry - this field not    00885000
*                              applicable for the IWMCQRY interface     00886000
*                                                                @L2A*/ 00887000
*     3 *       CHAR(32),   /* Reserved for additional extension        00888000
*                              triplets                          @L2A*/ 00889000
*                                                                       00890000
*   /*****************************************************************/ 00891000
*   /*                                                               */ 00892000
*   /* Subsystem type section                                        */ 00893000
*   /*                                                               */ 00894000
*   /*****************************************************************/ 00895000
*                                                                       00896000
*   1 SVDCRSST BASED(ADDR(SVDCRHDR) + SVDCRSO), /* Subsystem            00897000
*                              type section                          */ 00898000
*     3 SVDCRSNM CHAR(4),   /* Subsystem type name                   */ 00899000
*     3 SVDCRSDE CHAR(32),  /* Subsystem type description               00900000
*                              (this field not provided for IWMCQRY)    00901000
*                                                                @P1C*/ 00902000
*     3 SVDCRSFL CHAR(1),   /* Subsystem type flags                  */ 00903000
*       5 SVDCRSCI BIT(1),  /* Default service class name specified  */ 00904000
*       5 SVDCRSPI BIT(1),  /* Default report class name specified   */ 00905000
*       5 SVDCRSAL BIT(1),  /* Always use EWLM cLassification rule      00906000
*                                                             @LEWLTM*/ 00907000
*       5 SVDCRSHE BIT(1),  /* Honor existing EWLM cLassification       00908000
*                                                             @LEWLTM*/ 00909000
*       5 *        BIT(4),  /* Reserved                       @LEWLTM*/ 00910000
*     3 *       CHAR(3),    /* Reserved                              */ 00911000
*     3 SVDCRSCN CHAR(8),   /* Service class name to which work for     00912000
*                              this subsystem type will be classified   00913000
*                              if not overridden by service class       00914000
*                              associated with a particular rule. This  00915000
*                              field valid only if SVDCRSCI is on    */ 00916000
*     3 SVDCRSPN CHAR(8),   /* Report class name to which work for      00917000
*                              this subsystem type will be reported     00918000
*                              if not overridden by report class        00919000
*                              associated with a particular rule. This  00920000
*                              field valid only if SVDCRSPI is on    */ 00921000
*     3 SVDCRSRO FIXED(32), /* Offset to the first classification       00922000
*                              rule for this subsystem type from        00923000
*                              the beginning of this SVDCRSST entry  */ 00924000
*     3 SVDCRSRN FIXED(16), /* Total number of classification rules     00925000
*                              for this subsystem type               */ 00926000
*     3 *        CHAR(2),   /* Reserved                              */ 00927000
*     3 SVDCRSIU CHAR(8),   /* Userid of subsystem type creator         00928000
*                              (this field not provided for IWMCQRY) */ 00929000
*     3 SVDCRSIT CHAR(8),   /* Timestamp of initial creation            00930000
*                              (this field not provided for IWMCQRY) */ 00931000
*     3 SVDCRSRU CHAR(8),   /* Userid of subsystem type last update     00932000
*                              (this field not provided for IWMCQRY) */ 00933000
*     3 SVDCRSRT CHAR(8),   /* Timestamp of subsystem type last         00934000
*                              update                                   00935000
*                              (this field not provided for IWMCQRY) */ 00936000
*                                                                       00937000
*   /*****************************************************************/ 00938000
*   /*                                                               */ 00939000
*   /* Classification rule section                                   */ 00940000
*   /*                                                               */ 00941000
*   /*****************************************************************/ 00942000
*                                                                       00943000
*   1 SVDCRRUL BASED, /* Classification rule entry                   */ 00944000
*     3 SVDCRRQT CHAR(4),   /* Classification rule qualifier type to    00945000
*                              indicate the type of value in SVDCRRQV.  00946000
*                              Each qualifier type takes a character    00947000
*                              value with optional masking or           00948000
*                              wildcarding unless otherwise noted.      00949000
*                                                            @WLMPMQS*/ 00950000
*      4  SVDCRRQT_BYTE1 CHAR(1), /* First byte                  @L1A*/ 00951000
*       5 SVDCRRTN BIT(1),  /* Transaction name                      */ 00952000
*       5 SVDCRRTC BIT(1),  /* Transaction class                     */ 00953000
*       5 SVDCRRUI BIT(1),  /* Userid                                */ 00954000
*       5 SVDCRRSN BIT(1),  /* Subsystem name                        */ 00955000
*       5 SVDCRRNI BIT(1),  /* Net id                                */ 00956000
*       5 SVDCRRLU BIT(1),  /* LU name                               */ 00957000
*       5 SVDCRRAC BIT(1),  /* Accounting information                */ 00958000
*       5 SVDCRRSP BIT(1),  /* Subsystem parameter                   */ 00959000
*      4  SVDCRRQT_BYTE2 CHAR(1), /* Second byte                 @L1A*/ 00960000
*       5 SVDCRRQT_COLL_NAME BIT(1), /* Collection name          @L1A*/ 00961000
*       5 SVDCRRQT_CORR_INFO BIT(1), /* Correlation information  @L1A*/ 00962000
*       5 SVDCRRQT_CONN_TYPE BIT(1), /* Connection type          @L1A*/ 00963000
*       5 SVDCRRQT_PACK_NAME BIT(1), /* Package name             @L1A*/ 00964000
*       5 SVDCRRQT_PLAN_NAME BIT(1), /* Plan name                @L1A*/ 00965000
*       5 SVDCRRQT_PERFORM   BIT(1), /* Perform - although this         00966000
*                                  is a number, it is treated as        00967000
*                                  character data, i.e. masking         00968000
*                                  and wildcarding can be used,         00969000
*                                  relational operators cannot be used  00970000
*                                                            @WLMPBAT*/ 00971000
*       5 SVDCRRQT_PROC_NAME BIT(1), /* Procedure Name       @WLMPENH*/ 00972000
*       5 SVDCRRQT_PRIORITY  BIT(1), /* Priority - qualifier value      00973000
*                                  is a number optionally preceded      00974000
*                                  by a relational operator             00975000
*                                                            @WLMPBAT*/ 00976000
*      4 SVDCRRQT_BYTE3 CHAR(1), /* Third byte               @WLMPMQS*/ 00977000
*       5 SVDCRRQT_PROCESS_NAME BIT(1), /* Process Name      @WLMPMQS*/ 00978000
*       5 SVDCRRQT_SYSTEM_NAME  BIT(1), /* System Name       @WLMPGMY*/ 00979000
*       5 SVDCRRQT_SYSPLEX_NAME BIT(1), /* Sysplex Name      @WLMPGMY*/ 00980000
*       5 SVDCRRQT_SUBSYSTEM_COLLECTION BIT(1), /* Subsystem            00981000
*                                      Collection            @WLMPGMY*/ 00982000
*       5 SVDCRRQT_SCHEDULING_ENVIRONMENT BIT(1), /* Scheduling         00983000
*                                      Environment           @WLMPGMY*/ 00984000
*       5 SVDCRRQT_EWLM_SCLASS BIT(1), /* EWLM service class @WLMPESC*/ 00985000
*       5 SVDCRRQT_EWLM_TCLASS BIT(1), /* EWLM transaction class        00986000
*                                                            @WLMPESC*/ 00987000
*       5 SVDCRRQT_CLIENT_USERID BIT(1), /* Client UserId    @LSPMGRC*/ 00988000
*      4 SVDCRRQT_BYTE4 CHAR(1),    /* Fourth byte           @LSPMGRC*/ 00989000
*       5 SVDCRRQT_CLIENT_WORKSTATION_NAME BIT(1), /* Client            00990000
*                                      workstation name      @LSPMGRC*/ 00991000
*       5 SVDCRRQT_CLIENT_IP_ADDRESS BIT(1), /* Client IP address       00992000
*                                                            @LSPMGRC*/ 00993000
*       5 SVDCRRQT_CLIENT_AI BIT(1), /* Client Accounting Information   00994000
*                                                            @LSPMGRC*/ 00995000
*       5 SVDCRRQT_CLIENT_TN BIT(1), /* Client Transaction Name         00996000
*                                                            @LSPMGRC*/ 00997000
*       5 SVDCRRQT_B4_RSV08 BIT(1), /* Reserved for future type and     00998000
*                                      must be zero          @WLMPMQS*/ 00999000
*       5 SVDCRRQT_B4_RSV04 BIT(1), /* Reserved for future type and     01000000
*                                      must be zero          @WLMPMQS*/ 01001000
*       5 SVDCRRQT_B4_RSV02 BIT(1), /* Reserved for future type and     01002000
*                                      must be zero          @WLMPMQS*/ 01003000
*       5 SVDCRRQT_B4_RSV01 BIT(1), /* Reserved for future type and     01004000
*                                      must be zero          @WLMPMQS*/ 01005000
*                                                                       01006000
* /*      Format of SVDCRRQV (rule qualifier value):                    01007000
*                                                                       01008000
*         If SVDCRRGI is off (indicating this qualifier value           01009000
*         does not refer to a group name) special characters            01010000
*         or operators can be used based on the data type of            01011000
*         the qualifier value.                                          01012000
*                                                                       01013000
*         For attributes that take character data (such as              01014000
*         transaction name) the following special characters            01015000
*         apply:                                                        01016000
*                                                                       01017000
*           - Asterisk (*) in the last non-blank character              01018000
*             position indicates wildcard (note: an asterisk            01019000
*             in any other position is treated simply as the            01020000
*             asterisk character)                                       01021000
*                                                                       01022000
*           - Mask character (%) in any position indicates              01023000
*             that position will match any value for that               01024000
*             character                                                 01025000
*                                                                       01026000
*         For attributes that take numeric data (such as                01027000
*         priority), the qualifier value consists of 1 to 8             01028000
*         EBCDIC digits, optionally preceded by one of the              01029000
*         operators shown below.  The operator must be in               01030000
*         position 1, and the digits must follow the operator           01031000
*         with no intervening blanks.  If no operator appears           01032000
*         (digits must begin in position 1), an equal                   01033000
*         comparison is performed.  Trailing blanks can appear          01034000
*         after the digits to pad the value to 8 characters.            01035000
*                                                                       01036000
*           - Less than (<)                                             01037000
*           - Greater than (>)                                          01038000
*           - Less than or equal (<=)                                   01039000
*           - Greater than or equal (>=)                                01040000
*           - Not equal (<>)                                            01041000
*                                                                       01042000
*         If SVDCRRGI is on (indicating this field contains             01043000
*         a group name), then no wildcard or mask characters            01044000
*         or relational operators may be specified.                     01045000
*                                                            @WLMPBAT*/ 01046000
*                                                                       01047000
*     3 SVDCRRQV CHAR(8),   /* Classification rule qualifier value      01048000
*                              (see description of format above)        01049000
*                                                            @WLMPBAT*/ 01050000
*     3 SVDCRRSV FIXED(16), /* Substring value index - starting         01051000
*                              position of substring. Ignored if        01052000
*                              SVDCRRSU is off.                      */ 01053000
*     3 *        CHAR(2),   /* Reserved                              */ 01054000
*     3 SVDCRRFL CHAR(1),   /* Classification rule flags             */ 01055000
*       5 *        BIT(2),  /* Reserved (must not be used - to          01056000
*                              maintain compatibility with version      01057000
*                              5.1.0)                            @L2C*/ 01058000
*       5 SVDCRRSU BIT(1),  /* Substringing used for qualifier value    01059000
*                              (mutually exclusive with SVDCRRGI,       01060000
*                              qualifier must take character data)      01061000
*                                                            @WLMPBAT*/ 01062000
*       5 *        BIT(1),  /* Reserved (must not be used - to          01063000
*                              maintain compatibility with version      01064000
*                              5.1.0)                            @L2C*/ 01065000
*       5 SVDCRRCI BIT(1),  /* Service class name specified for this    01066000
*                              rule                                  */ 01067000
*       5 SVDCRRPI BIT(1),  /* Report class name specified for this     01068000
*                              rule                                  */ 01069000
*       5 SVDCRRGI BIT(1),  /* Qualifier value refers to a group     */ 01070000
*       5 SVDCRSTR BIT(1),  /* Storage Protection                       01071000
*                                                            @WLMPGMS*/ 01072000
*     3 SVDCRRF2 CHAR(1),   /* Classification rule flags     @WLMPGMT*/ 01073000
*       5 *        BIT(3),  /* Reserved, these bit are used in SVPCR    01074000
*                                                            @WLMPGMT*/ 01075000
*       5 *        BIT(5),  /* Reserved                                 01076000
*                                                            @WLMPGMT*/ 01077000
*     3 SVDCRRF3 CHAR(1),   /* Classification rule flags byte 3.        01078000
*                              Currently, this byte contain bits that   01079000
*                              are going to be used in both SVPOL and   01080000
*                              SVDEF                         @WLMPGMT*/ 01081000
*       5 SVDCRTRM BIT(1),  /* Transaction or Region Management Option  01082000
*                              Transaction: SVDCRTRM = 0                01083000
*                              Region     : SVDCRTRM = 1                01084000
*                                                            @WLMPGMT*/ 01085000
*       5 SVDCRTRB BIT(1),  /* Transaction or Region Management Option  01086000
*                              Set when value BOTH is specified         01087000
*                                                            @LCRTMEA*/ 01088000
*       /* Reporting Flags: '00' = normal transaction,       @OA47042*/ 01089000
*       /*                  '01' = mobile transaction,       @OA47042*/ 01090000
*       /*                  '10' = categoryA transaction,    @OA47042*/ 01091000
*       /*                  '11' = categoryB transaction     @OA47042*/ 01092000
*       5 SVDCR_SPECRPT1 BIT(1), /* Reporting Flag1          @OA47042*/ 01093000
*       5 SVDCR_SPECRPT2 BIT(1), /* Reporting Flag2          @OA47042*/ 01094000
*       5 SVDCR_BOOST    BIT(1), /* Boost enabled            @LBOOS3A*/ 01095000
*       5 *        BIT(3),  /* Reserved                                 01096000
*                                                            @LBOOS3C*/ 01097000
*     3 *        CHAR(1),   /* Reserved                      @WLMPGMT*/ 01098000
*     3 SVDCRRCN CHAR(8),   /* Service class name this rule will assign 01099000
*                              if rule matches. Valid only if           01100000
*                              classification rule flag (SVDCRRCI)      01101000
*                              indicates that the service class name    01102000
*                              was specified.                        */ 01103000
*     3 SVDCRRPN CHAR(8),   /* Report class name, if SVDCRRPI is ON  */ 01104000
*     3 SVDCRRLV FIXED(16), /* Nesting level of rule from 1 to 4     */ 01105000
*     3 *        CHAR(2),   /* Reserved                              */ 01106000
*     3 *        FIXED(32), /* Reserved                              */ 01107000
*     3 SVDCRDES CHAR(32),  /* Rule definition - this field             01108000
*                              not applicable for IWMCQRY    @WLMPMQS*/ 01109000
*                                                                       01110000
*   /*****************************************************************/ 01111000
*   /*                                                               */ 01112000
*   /* Group section                                                 */ 01113000
*   /*                                                               */ 01114000
*   /*****************************************************************/ 01115000
*                                                                       01116000
*   1 SVDCRGRP BASED, /* Group section                               */ 01117000
*     3 SVDCRGRN CHAR(8),   /* Name of group                         */ 01118000
*     3 SVDCRGDE CHAR(32),  /* Group description                        01119000
*                              (this field not provided for IWMCQRY)    01120000
*                                                                @P1C*/ 01121000
*     3 SVDCRGTY CHAR(2),   /* Qualifier type information for group     01122000
*                              describe the type in the value list      01123000
*                                                                @L1C*/ 01124000
*      4  SVDCRGTY_BYTE1 CHAR(1), /* First byte                  @L1A*/ 01125000
*       5 SVDCRGTN BIT(1),  /* Transaction name                      */ 01126000
*       5 SVDCRGTC BIT(1),  /* Transaction class                     */ 01127000
*       5 SVDCRGUI BIT(1),  /* Userid                                */ 01128000
*       5 SVDCRGSN BIT(1),  /* Subsystem name                        */ 01129000
*       5 SVDCRGNI BIT(1),  /* Net id                                */ 01130000
*       5 SVDCRGLU BIT(1),  /* LU name                               */ 01131000
*       5 SVDCRGTY_CONN_TYPE BIT(1), /* Connection type          @L1A*/ 01132000
*       5 SVDCRGTY_PACK_NAME BIT(1), /* Package name             @L1A*/ 01133000
*      4  SVDCRGTY_BYTE2 CHAR(1), /* Second byte                 @L1A*/ 01134000
*       5 SVDCRGTY_PLAN_NAME BIT(1), /* Plan name                @L1A*/ 01135000
*       5 SVDCRGTY_PERFORM   BIT(1), /* Perform              @WLMPENH*/ 01136000
*       5 SVDCRGTY_SYSTEM_NAME BIT(1),  /* System Name Group @WLMPGMY*/ 01137000
*       5 SVDCRGTY_AI  BIT(1), /* Accounting Information Group          01138000
*                                                            @LSPMGRC*/ 01139000
*       5 SVDCRGTY_CI  BIT(1), /* Correlation Information Group         01140000
*                                                            @LSPMGRC*/ 01141000
*       5 SVDCRGTY_CIP BIT(1), /* Client IP Address Group               01142000
*                                                            @LSPMGRC*/ 01143000
*       5 SVDCRGTY_CN  BIT(1), /* Collection Name Group                 01144000
*                                                            @LSPMGRC*/ 01145000
*       5 SVDCRGTY_CUI BIT(1), /* Client UserId Group                   01146000
*                                                            @LSPMGRC*/ 01147000
*     3  SVDCRGTY_BYTE3 CHAR(1), /* Third byte               @LSPMGRC*/ 01148000
*       5 SVDCRGTY_CWN BIT(1), /* Client Workstation Name Group         01149000
*                                                            @LSPMGRC*/ 01150000
*       5 SVDCRGTY_PC  BIT(1), /* Process Name Group                    01151000
*                                                            @LSPMGRC*/ 01152000
*       5 SVDCRGTY_PR  BIT(1), /* Procedure Name Group                  01153000
*                                                            @LSPMGRC*/ 01154000
*       5 SVDCRGTY_PX  BIT(1), /* Sysplex Name Group                    01155000
*                                                            @LSPMGRC*/ 01156000
*       5 SVDCRGTY_SE  BIT(1), /* Scheduling Environment Group          01157000
*                                                            @LSPMGRC*/ 01158000
*       5 SVDCRGTY_SPM BIT(1), /* Subsystem Parameter Group             01159000
*                                                            @LSPMGRC*/ 01160000
*       5 SVDCRGTY_SSC BIT(1), /* Subsystem Collection Group            01161000
*                                                            @LSPMGRC*/ 01162000
*       5 SVDCRGTY_CAI BIT(1), /* Client Accounting Information Group   01163000
*                                                            @LSPMGRC*/ 01164000
*     3  SVDCRGTY_BYTE4 CHAR(1), /* Fourth byte              @LSPMGRC*/ 01165000
*       5 SVDCRGTY_CTN BIT(1), /* Client Transaction Name Group         01166000
*                                                            @LSPMGRC*/ 01167000
*       5 *            BIT(7), /* reserved                   @LSPMGRC*/ 01168000
*     3 SVDCRGVO FIXED(32), /* Offset to the first group value for      01169000
*                              this group from the beginning of this    01170000
*                              SVDCRGRP entry                        */ 01171000
*     3 SVDCRGVN FIXED(16), /* Total number of values for this group */ 01172000
*     3 *        CHAR(2),   /* Reserved                              */ 01173000
*     3 SVDCRGIU CHAR(8),   /* Userid of group creator                  01174000
*                              (this field not provided for IWMCQRY) */ 01175000
*     3 SVDCRGIT CHAR(8),   /* Timestamp of initial creation            01176000
*                              (this field not provided for IWMCQRY) */ 01177000
*     3 SVDCRGRU CHAR(8),   /* Userid of group last update              01178000
*                              (this field not provided for IWMCQRY) */ 01179000
*     3 SVDCRGRT CHAR(8),   /* Timestamp of group last update           01180000
*                              (this field not provided for IWMCQRY) */ 01181000
*                                                                       01182000
*   /*****************************************************************/ 01183000
*   /*                                                               */ 01184000
*   /* Group value section                                           */ 01185000
*   /*                                                               */ 01186000
*   /*****************************************************************/ 01187000
*                                                                       01188000
*   1 SVDCRGVS BASED, /* Group member                                */ 01189000
*     3 SVDCRGVV CHAR(8),   /* Group value                           */ 01190000
*     3 SVDCRGSV FIXED(16), /* Substring value index - starting         01191000
*                              position of substring. Ignored if        01192000
*                              SVDCRGSU is off               @LSPMGRC*/ 01193000
*     3 SVDCRGFL CHAR(1),   /* Group value flags                     */ 01194000
*       5 SVDCRGSU BIT(1),  /* Substringing used for qualifier value    01195000
*                                                            @LSPMGRC*/ 01196000
*       5 *        BIT(7),  /* Reserved                              */ 01197000
*     3 *        CHAR(1),   /* Reserved                              */ 01198000
*     3 SVDCRGDS CHAR(32),  /* Group value definition, this             01199000
*                              field not applicable for IWMCQRY         01200000
*                                                            @WLMPMQS*/ 01201000
*                                                                       01202000
*   /*****************************************************************/ 01203000
*   /*                                                               */ 01204000
*   /* Extension section                                             */ 01205000
*   /*                                                               */ 01206000
*   /* NOTE: No extension data is returned on the IWMCQRY interface  */ 01207000
*   /*                                                               */ 01208000
*   /*****************************************************************/ 01209000
*                                                                       01210000
*   1 SVDCREXT BASED,       /* Extension section entry           @L2A*/ 01211000
*     3 SVDCRVID CHAR(8),   /* Unique vendor id that owns the entry     01212000
*                                                                @L2A*/ 01213000
*     3 SVDCRROB CHAR(4),   /* Related subsystem type name - name of    01214000
*                              subsystem which this extension entry     01215000
*                              extends                           @L2A*/ 01216000
*     3 * CHAR(4),          /* Reserved in case 8-character extension   01217000
*                              becomes necessary                 @L2A*/ 01218000
*     3 SVDCREDL FIXED(16), /* Extended data length              @L2A*/ 01219000
*     3 *        CHAR(2),   /* Reserved                          @L2A*/ 01220000
*     3 SVDCREDO FIXED(32); /* Offset to extended data - offset is from 01221000
*                              the beginning of the extended data whose 01222000
*                              offset is in SVDCR_EXT_DATA_OFF   @L2A*/ 01223000
*                                                                       01224000
*   /*****************************************************************/ 01225000
*   /*                                                               */ 01226000
*   /* Constants                                                     */ 01227000
*   /*                                                               */ 01228000
*   /*****************************************************************/ 01229000
*                                                                       01230000
* DECLARE                                                               01231000
*   SVDCR_ID CHAR(4) CONSTANT('SVDC'), /* SVDCR identifier           */ 01232000
*   SVDCR_LEVEL000 FIXED(8) CONSTANT(0),       /* Functionality level   01233000
*                                       introduced by WLM in SP510      01234000
*                                       before migration coexistence    01235000
*                                                            @WA13309*/ 01236000
*   SVDCR_LEVEL001 FIXED(8) CONSTANT(1), /*                             01237000
*                                Functionality level introduced by      01238000
*                                WLM in SP510.                   @P5C*/ 01239000
*   SVDCR_SP510 FIXED(8) CONSTANT(1), /*                                01240000
*                                WLM SP510 version               @P5C*/ 01241000
*   SVDCR_LEVEL002 FIXED(8) CONSTANT(2), /*                             01242000
*                                Functionality level introduced by      01243000
*                                WLM in SP520.                   @P5C*/ 01244000
*   SVDCR_SP520 FIXED(8) CONSTANT(2),  /*                               01245000
*                                WLM SP520 version               @P5C*/ 01246000
*   SVDCR_LEVEL003 FIXED(8) CONSTANT(3), /*                             01247000
*                                Functionality level introduced by      01248000
*                                WLM in OS/390 V1R3.         @WLMPSTP*/ 01249000
*   SVDCR_SP530 FIXED(8) CONSTANT(3), /* WLM version number for         01250000
*                                OS/390 V1R3                 @WLMPSTP*/ 01251000
*   SVDCR_LEVEL004 FIXED(8) CONSTANT(4), /*                             01252000
*                                Functionality level introduced by      01253000
*                                WLM in OS/390 V2R4          @WLMPBAT*/ 01254000
*   SVDCR_SP604 FIXED(8) CONSTANT(4), /* WLM version number for         01255000
*                                OS/390 V2R4                 @WLMPBAT*/ 01256000
*   SVDCR_LEVEL005 FIXED(8) CONSTANT(5), /*                             01257000
*                                Functionality level introduced by      01258000
*                                WLM in OS/390 V2R5          @WLMPSDC*/ 01259000
*   SVDCR_SP605 FIXED(8) CONSTANT(5), /* WLM version number for         01260000
*                                OS/390 V2R5                 @WLMPSDC*/ 01261000
*   SVDCR_LEVEL006 FIXED(8) CONSTANT(6), /*                             01262000
*                                Functionality level introduced by      01263000
*                                WLM in OS/390 V2R6          @WLMPSDC*/ 01264000
*   SVDCR_SP606 FIXED(8) CONSTANT(6), /* WLM version number for         01265000
*                                OS/390 V2R6                 @WLMPSDC*/ 01266000
*   SVDCR_LEVEL007 FIXED(8) CONSTANT(7), /*                             01267000
*                                Functionality level introduced by      01268000
*                                WLM in OS/390 V2R7          @WLMPMQS*/ 01269000
*   SVDCR_SP607 FIXED(8) CONSTANT(7), /* WLM version number for         01270000
*                                OS/390 V2R7                 @WLMPMQS*/ 01271000
*   SVDCR_LEVEL008 FIXED(8) CONSTANT(8), /*                             01272000
*                                Functionality level reserved for       01273000
*                                WLM OS/390 V2R7             @WLMPGMY*/ 01274000
*   SVDCR_SP608 FIXED(8) CONSTANT(8), /* WLM version number for         01275000
*                                OS/390 V2R7                 @WLMPGMY*/ 01276000
*   SVDCR_LEVEL009 FIXED(8) CONSTANT(9), /*                             01277000
*                                Functionality level reserved for       01278000
*                                WLM OS/390 V2R8             @WLMPGMY*/ 01279000
*   SVDCR_RESERVED_R08 FIXED(8) CONSTANT(9), /*                         01280000
*                                WLM version number reserved for        01281000
*                                OS/390 V2R8                 @WLMPGMY*/ 01282000
*   SVDCR_LEVEL010 FIXED(8) CONSTANT(10), /*                            01283000
*                                Functionality level reserved for       01284000
*                                WLM OS/390 V2R9             @WLMPGMY*/ 01285000
*   SVDCR_RESERVED_R09 FIXED(8) CONSTANT(10), /*                        01286000
*                                WLM version number reserved for        01287000
*                                OS/390 V2R9                 @WLMPGMY*/ 01288000
*   SVDCR_LEVEL011 FIXED(8) CONSTANT(11), /*                            01289000
*                                Functionality level introduced by      01290000
*                                WLM in OS/390 V2R10         @WLMPGMY*/ 01291000
*   SVDCR_SP703 FIXED(8) CONSTANT(11), /* WLM version number for        01292000
*                                OS/390 V2R10                @WLMPGMY*/ 01293000
*   SVDCR_LEVEL012 FIXED(8) CONSTANT(12), /*                            01294000
*                                Functionality level reserved for       01295000
*                                WLM in OS/390 V2R11         @WLMPLNX*/ 01296000
*   SVDCR_RESERVED_R11 FIXED(8) CONSTANT(12), /*                        01297000
*                                WLM version number reserved for        01298000
*                                OS/390 V2R11                @WLMPLNX*/ 01299000
*   SVDCR_LEVEL013 FIXED(8) CONSTANT(13), /*                            01300000
*                                Functionality level introduced by      01301000
*                                WLM in OS/390 V2R12         @WLMPLNX*/ 01302000
*   SVDCR_SP705 FIXED(8) CONSTANT(13), /* WLM version number for        01303000
*                                OS/390 V2R12                @WLMPLNX*/ 01304000
*   SVDCR_LEVEL014 FIXED(8) CONSTANT(14), /*                            01305000
*                                Functionality level reserved for       01306000
*                                WLM z/OS V1R3               @WLMPESC*/ 01307000
*   SVDCR_RESERVED_R13 FIXED(8) CONSTANT(14), /*                        01308000
*                                WLM version number reserved for        01309000
*                                z/OS V1R3                   @WLMPESC*/ 01310000
*   SVDCR_LEVEL015 FIXED(8) CONSTANT(15), /*                            01311000
*                                Functionality level reserved for       01312000
*                                WLM z/OS V1R4               @WLMPESC*/ 01313000
*   SVDCR_RESERVED_R14 FIXED(8) CONSTANT(15), /*                        01314000
*                                WLM version number reserved for        01315000
*                                z/OS V1R4                   @WLMPESC*/ 01316000
*   SVDCR_LEVEL016 FIXED(8) CONSTANT(16), /*                            01317000
*                                Functionality level reserved for       01318000
*                                WLM z/OS V1R5               @WLMPESC*/ 01319000
*   SVDCR_RESERVED_R15 FIXED(8) CONSTANT(16), /*                        01320000
*                                WLM version number reserved for        01321000
*                                z/OS V1R5                   @WLMPESC*/ 01322000
*   SVDCR_LEVEL017 FIXED(8) CONSTANT(17), /*                            01323000
*                                Functionality level reserved for       01324000
*                                WLM z/OS V1R6               @WLMPEEG*/ 01325000
*   SVDCR_RESERVED_R16 FIXED(8) CONSTANT(17), /*                        01326000
*                                WLM version number reserved for        01327000
*                                z/OS V1R6                   @WLMPEEG*/ 01328000
*   SVDCR_LEVEL018 FIXED(8) CONSTANT(18), /*                            01329000
*                                Functionality level reserved for       01330000
*                                WLM z/OS V1R7               @WLMPEEG*/ 01331000
*   SVDCR_RESERVED_R17 FIXED(8) CONSTANT(18), /*                        01332000
*                                WLM version number reserved for        01333000
*                                z/OS V1R7                   @WLMPEEG*/ 01334000
*   SVDCR_LEVEL019 FIXED(8) CONSTANT(19), /*                            01335000
*                                Functionality level introduced with    01336000
*                                WLM z/OS V1R8               @WLMPEEG*/ 01337000
*   SVDCR_RESERVED_R19 FIXED(8) CONSTANT(20), /*                        01338000
*                                WLM version number reserved for        01339000
*                                z/OS V1R8                   @LEWLTMA*/ 01340000
*   SVDCR_LEVEL021 FIXED(8) CONSTANT(21), /*                            01341000
*                                Functionality level introduced with    01342000
*                                WLM z/OS V1R10              @LEWLTMA*/ 01343000
*   SVDCR_RESERVED_R21 FIXED(8) CONSTANT(22), /*                        01344000
*                                WLM version number reserved for        01345000
*                                z/OS V1R10                  @LEWMSMA*/ 01346000
*   SVDCR_LEVEL023 FIXED(8) CONSTANT(23), /*                            01347000
*                                Functionality level introduced with    01348000
*                                WLM z/OS V1R11              @LEXTRCA*/ 01349000
*   SVDCR_RESERVED_R23 FIXED(8) CONSTANT(24), /*                        01350000
*                                WLM version number reserved for        01351000
*                                z/OS V1R11 APARs etc        @LEWMSMA*/ 01352000
*   SVDCR_LEVEL025 FIXED(8) CONSTANT(25), /*                            01353000
*                                Functionality level introduced with    01354000
*                                WLM z/OS V1R12              @ME17808*/ 01355000
*   SVDCR_RESERVED_R25 FIXED(8) CONSTANT(26), /*                        01356000
*                                WLM version number reserved for        01357000
*                                z/OS V1R12 APARs etc        @ME17808*/ 01358000
*   SVDCR_LEVEL029 FIXED(8) CONSTANT(29), /*                            01359000
*                                Functionality level introduced with    01360000
*                                WLM z/OS V2R1. There was no new        01361000
*                                functionality level for z/OS V1R13,    01362000
*                                therefore, level 27 and 28 is left     01363000
*                                free                        @LSPMGRA*/ 01364000
*   SVDCR_RESERVED_R29 FIXED(8) CONSTANT(30), /*                        01365000
*                                WLM version number reserved for        01366000
*                                z/OS V2R1 APARs etc         @LSPMGRA*/ 01367000
*   SVDCR_LEVEL030 FIXED(8) CONSTANT(30), /* WLM version number for     01368000
*                                Special Reporting           @OA47042*/ 01369000
*   SVDCR_LEVEL031 FIXED(8) CONSTANT(31), /* WLM version number for     01370000
*                                Specialty Engines Containment          01371000
*                                                            @OA50845*/ 01372000
*   SVDCR_LEVEL032 FIXED(8) CONSTANT(32), /* WLM version number for     01373000
*                                Workload billing groups     @LWBGRPA*/ 01374000
*   SVDCR_LEVEL035 FIXED(8) CONSTANT(35), /*                            01375000
*                                Functionality level introduced with    01376000
*                                WLM z/OS V2R3               @LRESPTA*/ 01377000
*   SVDCR_LEVEL038 FIXED(8) CONSTANT(38), /*                            01378000
*                                Functionality level introduced for     01379000
*                                System Recovery Boost stage 3          01380000
*                                                            @LBOOS3A*/ 01381000
*   SVDCR_SP709 FIXED(8) CONSTANT(17), /*                               01382000
*                                WLM version number introduced with     01383000
*                                WLM z/OS V1R6               @WLMPESC*/ 01384000
*   SVDCR_SP730 FIXED(8) CONSTANT(19), /*                               01385000
*                                WLM version number introduced with     01386000
*                                z/OS V1R8                   @WLMPEEG*/ 01387000
*   SVDCR_SP750 FIXED(8) CONSTANT(21), /*                               01388000
*                                WLM version number introduced with     01389000
*                                z/OS V1R10                  @LEWLTMA*/ 01390000
*   SVDCR_SP760 FIXED(8) CONSTANT(23), /*                               01391000
*                                WLM version number introduced with     01392000
*                                z/OS V1R11                  @LEWMSMA*/ 01393000
*   SVDCR_SP770 FIXED(8) CONSTANT(25), /*                               01394000
*                                WLM version number introduced with     01395000
*                                z/OS V1R12                  @ME17808*/ 01396000
*   SVDCR_SP790 FIXED(8) CONSTANT(29), /*                               01397000
*                                WLM version number introduced with     01398000
*                                z/OS V2R1                   @LSPMGRA*/ 01399000
*   SVDCR_SP7B0 FIXED(8) CONSTANT(35), /*                               01400000
*                                WLM version number introduced with     01401000
*                                z/OS V2R3                   @LRESPTA*/ 01402000
*   SVDCR_CURRENT_VER FIXED(8) CONSTANT(SVDCR_LEVEL038), /*             01403000
*                                Current version level used when        01404000
*                                checking functionality within WLM      01405000
*                                product                     @LBOOS3C*/ 01406000
*   SVDCR_NLEVEL FIXED(16) CONSTANT(4); /* SVDCR deepest level of       01407000
*                                      nesting allowed               */ 01408000
*   DECLARE                                                             01409000
*     SVDCR_SECTION FIXED(8) CONSTANT(25); /* IWMSVDCR.77: Symbolic     01410000
*                                      constant              @CASECNV*/ 01411000
*   DECLARE                                                             01412000
*     SVDCR_HDR_SECTION FIXED(8) CONSTANT(26); /* IWMSVDCR.68:          01413000
*                                      Symbolic constant     @CASECNV*/ 01414000
*   DECLARE                                                             01415000
*     SVDCR_SST_SECTION FIXED(8) CONSTANT(27); /* IWMSVDCR.1245:        01416000
*                                      Symbolic constant     @CASECNV*/ 01417000
*   DECLARE                                                             01418000
*     SVDCR_RUL_SECTION FIXED(8) CONSTANT(28); /* IWMSVDCR.1016:        01419000
*                                      Symbolic constant     @CASECNV*/ 01420000
*   DECLARE                                                             01421000
*     SVDCR_GRP_SECTION FIXED(8) CONSTANT(29); /* IWMSVDCR.880:         01422000
*                                      Symbolic constant     @CASECNV*/ 01423000
*   DECLARE                                                             01424000
*     SVDCR_GVS_SECTION FIXED(8) CONSTANT(30); /* IWMSVDCR.889:         01425000
*                                      Symbolic constant     @CASECNV*/ 01426000
*   DECLARE                                                             01427000
*     SVDCR_EXT_SECTION FIXED(8) CONSTANT(31); /* IWMSVDCR.313:         01428000
*                                      Symbolic constant     @CASECNV*/ 01429000
*   DECLARE                                                             01430000
*     SVDCR_CONTEXT_RSN FIXED(8) CONSTANT(1); /* IWMSVDCR.322:          01431000
*                                      Contextual problem    @CASECNV*/ 01432000
*   DECLARE                                                             01433000
*     SVDCR_ENTRY_RSN FIXED(8) CONSTANT(2); /* IWMSVDCR.331: Entry      01434000
*                                      problem               @CASECNV*/ 01435000
*/* End of PL/X Source                                               */ 01436000
* %IF IWMSVDCR_LIST = 'NO' !                                            01437000
*    ZCBPRINT = 'NO' %THEN                                              01438000
* %DO;                                                                  01439000
*   @LIST POP NOECHO;                                                   01440000
* %END;                                                                 01441000
* %END;                                                                 01442000
