*                                                                       00001000
* %DCL IWMSET_INCLUDED CHAR EXT;                                        00002000
* %DEACTIVATE IWMSET_INCLUDED;                                          00003000
* %IF IWMSET_INCLUDED = '' %THEN                                        00004000
* %DO;                                                                  00005000
*%/* Start of PL/X PreProlog Code */;                                   00006000
*                                                                       00007000
*%/* End of PL/X PreProlog Code */;                                     00008000
*/* Macro made bi-lingual on 20048. CBGEN compile date 20027         */ 00009000
*% /*                                                                   00010000
         MACRO                                                          00011000
         IWMSET &DSECT=YES,&LIST=YES,&TITLE=YES,&SETHDR=YES,           *00012000
               &SETSE=COND,&SETSR=COND,&SETRE=COND,&SETSYS=COND,       *00013000
               &SETSYH=COND,&SETSES=COND,&SETRES=COND                   00014000
         GBLC  &IWMSET_INCLUDED                                         00015000
         GBLC  &ZCBPRINT                                                00016000
&IWMSET_INCLUDED SETC 'YES'                                             00017000
         AIF   ('&LIST' EQ 'NONE').P0                                   00018000
         AIF   ('&TITLE' EQ 'NO').P5                                    00019000
 TITLE   'IWMSET  - WLM Scheduling Environments Table          '        00020000
.P5      ANOP                                                           00021000
**/ IWMSET_1:;                                                          00022000
*/* START OF SPECIFICATIONS **************************************** */ 00023000
*/*                                                                  */ 00024000
*/*01* PROPRIETARY STATEMENT=                                        */ 00025000
*/*                                                                  */ 00026000
*/*          LICENSED MATERIALS - PROPERTY OF IBM                    */ 00027000
*/*          5650-ZOS COPYRIGHT IBM CORP. 1997, 2015                 */ 00028000
*/*                                                                  */ 00029000
*/*01* EXTERNAL CLASSIFICATION:                                      */ 00030000
*/*02* GUPI: BASE                                                    */ 00031000
*/*02* DMTI: FIELDS SET_SES_FLAG2                                    */ 00032000
*/*                 SET_RES_FLAG1                                    */ 00033000
*/*01* END OF EXTERNAL CLASSIFICATION:                               */ 00034000
*/*                                                                  */ 00035000
*/*01* STATUS = HBB7709                                              */ 00036000
*/*                                                                  */ 00037000
*/**** END_OF_PROPRIETARY_STATEMENT ******************************** */ 00038000
*/*                                                                  */ 00039000
*/*01* Descriptive Name:  WLM Scheduling Environments Table          */ 00040000
*/*                                                                  */ 00041000
*/*02*  Acronym:  SET                                                */ 00042000
*/*                                                                  */ 00043000
*/*01* Macro Name:  IWMSET                                           */ 00044000
*/*                                                                  */ 00045000
*/*01* DSECT Name: SET                                               */ 00046000
*/*                SETSE                                             */ 00047000
*/*                SETSR                                             */ 00048000
*/*                SETRE                                             */ 00049000
*/*                SETSYS                                            */ 00050000
*/*                SETSYH                                            */ 00051000
*/*                SETSES                                            */ 00052000
*/*                SETRES                                            */ 00053000
*/*                                                                  */ 00054000
*/*01* Component:   Workload Manager (SCWLM)                         */ 00055000
*/*                                                                  */ 00056000
*/*01* Eye-Catcher:  IWMSET                                          */ 00057000
*/*02*  Offset:      0                                               */ 00058000
*/*02*  Length:      8                                               */ 00059000
*/*                                                                  */ 00060000
*/*01* Storage Attributes:                                           */ 00061000
*/*02*  Subpool:    Any                                              */ 00062000
*/*02*  Key:        Any                                              */ 00063000
*/*02*  Residency:  Anywhere                                         */ 00064000
*/*                                                                  */ 00065000
*/*01* Size:  Determined at run time                                 */ 00066000
*/*                                                                  */ 00067000
*/*01* Created by:  Caller of the IWMSEQRY service                   */ 00068000
*/*                                                                  */ 00069000
*/*01* Pointed to by: ANSAREA parameter of the IWMSEQRY service      */ 00070000
*/*                                                                  */ 00071000
*/*01* Serialization:  None                                          */ 00072000
*/*                                                                  */ 00073000
*/*01* Function: Describes scheduling environments, resources,       */ 00074000
*/*              and their status on each system in a sysplex.       */ 00075000
*/*                                                                  */ 00076000
*/*01* Method of Access:                                             */ 00077000
*/*                                                                  */ 00078000
*/*02*  ASM:                                                         */ 00079000
*/*          IWMSET                                                  */ 00080000
*/*                                                                  */ 00081000
*/*02*  PL/X:                                                        */ 00082000
*/*                                                                  */ 00083000
*/*          %INCLUDE SYSLIB(IWMSET)                                 */ 00084000
*/*                                                                  */ 00085000
*/*          The scheduling environment table consists of a          */ 00086000
*/*          definition area and one or more system status areas.    */ 00087000
*/*                                                                  */ 00088000
*/*          The definition area consists of a header and            */ 00089000
*/*          additional sections.  A USING on SETHDR establishes     */ 00090000
*/*          addressability to the header.  Subsequent USINGs        */ 00091000
*/*          must be done to establish addressability to the         */ 00092000
*/*          additional sections (DSECTs) as follows:                */ 00093000
*/*                                                                  */ 00094000
*/*          DSECT    BASE ADDRESS                                   */ 00095000
*/*          -----    ------------                                   */ 00096000
*/*          SETSE    A(SETHDR) + SET_OFFSET_SE                      */ 00097000
*/*          SETSR    A(SETHDR) + SET_OFFSET_SR                      */ 00098000
*/*          SETRE    A(SETHDR) + SET_OFFSET_RE                      */ 00099000
*/*          SETSYS   A(SETHDR) + SET_OFFSET_SYS                     */ 00100000
*/*                                                                  */ 00101000
*/*          The SETSYS section contains the offsets and 31bit       */ 00102000
*/*          addresses to the system status areas (SETSYH). @PJK0044 */ 00103000
*/*                                                                  */ 00104000
*/*          DSECT    BASE ADDRESS                                   */ 00105000
*/*          -----    ------------                                   */ 00106000
*/*          SETSYH   A(SETHDR) + SET_OFFSET_SYS+SET_SYS_OFFSET_SYH  */ 00107000
*/*                                                         @PJK0044 */ 00108000
*/*          Each system status area consists of a header and        */ 00109000
*/*          additional sections.  A USING on SETSYH establishes     */ 00110000
*/*          addressability to the header.  Subsequent USINGs        */ 00111000
*/*          must be done to establish addressability to the         */ 00112000
*/*          additional sections (DSECTs) as follows:                */ 00113000
*/*          as follows:                                             */ 00114000
*/*                                                                  */ 00115000
*/*          DSECT    BASE ADDRESS                                   */ 00116000
*/*          -----    ------------                                   */ 00117000
*/*          SETSES   A(SETSYH) + SET_OFFSET_SES                     */ 00118000
*/*          SETRES   A(SETSYH) + SET_OFFSET_RES                     */ 00119000
*/*                                                                  */ 00120000
*/*          Subsequent elements of a section can be found           */ 00121000
*/*          by adding the size of one element as indicated          */ 00122000
*/*          in the appropriate header.                              */ 00123000
*/*                                                                  */ 00124000
*/*----------------------------------------------------------------- */ 00125000
*/*                                                                  */ 00126000
*/*01* Change Activity:                                              */ 00127000
*/*                                                                  */ 00128000
*/*    $L0=WLMCSTP JBB6604  961225 PDB9DB: WLMRES Dave Bostjancic    */ 00129000
*/*                                        Scheduling environments   */ 00130000
*/*                                                                  */ 00131000
*/*    PJK0044     HBB7709  020610 3241DW: Dieter Wellerdiek         */ 00132000
*/*                                        Offset introduced in      */ 00133000
*/*                                        SETSYS to the SETSYH      */ 00134000
*/*                                        section                   */ 00135000
*/*                                                                  */ 00136000
*/*    $CPYRIGHT   HBB77A0  130909 3241BH  BILL HEISSER              */ 00137000
*/*                                    REMOVE 'RESTRICTED MATERIAL"  */ 00138000
*/*                                                                  */ 00139000
*/*  END OF SPECIFICATIONS ***************************************** */ 00140000
*% /*                                                                   00141000
.P0      ANOP                                                           00142000
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 00143000
         AIF   ('&LIST' EQ 'YES').P2                                    00144000
.P1      ANOP                                                           00145000
         PUSH  PRINT                                                    00146000
         PRINT OFF                                                      00147000
.P2      ANOP                                                           00148000
         AIF   ('&SETHDR' EQ 'NO').L0002                                00149000
         AIF   ('&DSECT' EQ 'YES').L0003                                00150000
         AIF   ('&SETHDR' NE 'YES').L0002                               00151000
.L0003   ANOP                                                           00152000
*                                                                       00153000
*    *****************************************************************  00154000
*    *                                                               *  00155000
*    * IWMSET.708: SET header                                        *  00156000
*    *                                                               *  00157000
*    *****************************************************************  00158000
*                                                                       00159000
*                                                                       00160000
         AIF   ('&DSECT' EQ 'YES').L0004                                00161000
SETHDR   DS    0F                                                       00162000
         AGO   .L0005                                                   00163000
.L0004   ANOP                                                           00164000
SETHDR   DSECT                                                          00165000
.L0005   ANOP                                                           00166000
SET_HDR_EYECATCHER DS CL8 IWMSET.29: Eye catcher                        00167000
SET_HDR_WLM_VERSION_NUMBER DS X IWMSET.41: Version number of SET        00168000
SET_HDR_RESERVED1 DS X   IWMSET.1180: Reserved                          00169000
SET_HDR_SIZE_OF_HEADER DS H IWMSET.75: Size of this header section      00170000
SET_HDR_SIZE_OF_WHOLE_SET DS F IWMSET.63: Size of the whole scheduling *00171000
                         environment table, not including any system   *00172000
                         status areas                                   00173000
SET_HDR_TOD_VALUE DS BL8 IWMSET.67: Time/date (STCK format) that the   *00174000
                         service definition was installed. The value   *00175000
                         matches field SVPOLTDI in IWMSVPOL.            00176000
SET_HDR_SIZE_OF_A_SYS_STATUS_AREA DS F IWMSET.54: Size of each system  *00177000
                         status area                                    00178000
SET_HDR_RESERVED DS F    IWMSET.176: Reserved                           00179000
         ORG   SET_HDR_RESERVED+32                                      00180000
SET_HDR_OFFSETS DS CL40  IWMSET.61: SET section offsets area            00181000
         ORG   SET_HDR_OFFSETS                                          00182000
SET_HDR_SE_SECTION DS CL8 IWMSET.48: Scheduling environment section     00183000
         ORG   SET_HDR_SE_SECTION                                       00184000
SET_OFFSET_SE DS F       IWMSET.38: Offset of scheduling environment   *00185000
                         section (SETSE)                                00186000
SET_NUMBER_SE DS H       IWMSET.892: Number of scheduling environment  *00187000
                         entries                                        00188000
SET_SIZE_SE DS H         IWMSET.898: Size of a scheduling environment  *00189000
                         entry                                          00190000
SET_HDR_SR_SECTION DS CL8 IWMSET.904: Scheduling environment-          *00191000
                         /resource relationships section                00192000
         ORG   SET_HDR_SR_SECTION                                       00193000
SET_OFFSET_SR DS F       IWMSET.907: Offset of scheduling environment- *00194000
                         /resource relationship section (SETSR)         00195000
SET_NUMBER_SR DS H       IWMSET.913: Number of scheduling environment- *00196000
                         /resource relationship entries                 00197000
SET_SIZE_SR DS H         IWMSET.919: Size of a scheduling environment- *00198000
                         /resource relationship entry                   00199000
SET_HDR_RE_SECTION DS CL8 IWMSET.925: Resource section                  00200000
         ORG   SET_HDR_RE_SECTION                                       00201000
SET_OFFSET_RE DS F       IWMSET.928: Offset of resource section        *00202000
                         (SETRE)                                        00203000
SET_NUMBER_RE DS H       IWMSET.934: Number of resource entries         00204000
SET_SIZE_RE DS H         IWMSET.940: Size of a resource entry           00205000
SET_HDR_SYS_SECTION DS CL8 IWMSET.947: System section                   00206000
         ORG   SET_HDR_SYS_SECTION                                      00207000
SET_OFFSET_SYS DS F      IWMSET.950: Offset of system section (SETSYS)  00208000
SET_NUMBER_SYS DS H      IWMSET.956: Number of system entries           00209000
SET_SIZE_SYS DS H        IWMSET.962: Size of a system entry             00210000
SET_HDR_RESERVED_SECTION DS CL8 IWMSET.969: Reserved slots              00211000
         ORG   SET_HDR_RESERVED_SECTION                                 00212000
SET_OFFSET_RESERVED DS F IWMSET.972: Reserved offset                    00213000
SET_NUMBER_RESERVED DS H IWMSET.978: Reserved number                    00214000
SET_SIZE_RESERVED DS H   IWMSET.984: Reserved size                      00215000
SETHDR_LEN EQU *-SETHDR                                                 00216000
.L0002   ANOP                                                           00217000
         AIF   ('&SETSE' EQ 'NO').L0006                                 00218000
         AIF   ('&DSECT' EQ 'YES').L0007                                00219000
         AIF   ('&SETSE' NE 'YES').L0006                                00220000
.L0007   ANOP                                                           00221000
*                                                                       00222000
*    *****************************************************************  00223000
*    *                                                               *  00224000
*    * IWMSET.1212: SET SE - Scheduling environment entry            *  00225000
*    *                                                               *  00226000
*    *****************************************************************  00227000
*                                                                       00228000
*                                                                       00229000
         AIF   ('&DSECT' EQ 'YES').L0008                                00230000
SETSE    DS    0F                                                       00231000
         AGO   .L0009                                                   00232000
.L0008   ANOP                                                           00233000
SETSE    DSECT                                                          00234000
.L0009   ANOP                                                           00235000
SET_SE_DEFINITION DS CL56 IWMSET.332: SE definition                     00236000
         ORG   SET_SE_DEFINITION                                        00237000
SET_SE_SCHENV_NAME DS CL16 IWMSET.336: Scheduling environment name      00238000
SET_SE_DESCRIPTION DS CL32 IWMSET.288: Scheduling environment          *00239000
                         description                                    00240000
SET_SE_RESERVED_DEFINITION DS CL8 IWMSET.354: Reserved                  00241000
SET_SE_OFFSETS DS CL16   IWMSET.365: SE offsets                         00242000
         ORG   SET_SE_OFFSETS                                           00243000
SET_SE_SR_OFFSET DS F    IWMSET.372: Offset of the first scheduling    *00244000
                         environment- /resource relationship entry for *00245000
                         this scheduling environment from the          *00246000
                         beginning of the SET                           00247000
SET_SE_SR_COUNT DS F     IWMSET.378: Number of scheduling environment- *00248000
                         /resource relationship entries for this       *00249000
                         scheduling environment                         00250000
SET_SE_OFFSETS_RESERVED DS F IWMSET.1143: SE reserved offsets           00251000
         ORG   SETSE+72                                                 00252000
SETSE_LEN EQU  *-SETSE                                                  00253000
.L0006   ANOP                                                           00254000
         AIF   ('&SETSR' EQ 'NO').L000A                                 00255000
         AIF   ('&DSECT' EQ 'YES').L000B                                00256000
         AIF   ('&SETSR' NE 'YES').L000A                                00257000
.L000B   ANOP                                                           00258000
*                                                                       00259000
*    *****************************************************************  00260000
*    *                                                               *  00261000
*    * IWMSET.723: SET SR - Scheduling environment/resource          *  00262000
*    * relationship entry                                            *  00263000
*    *                                                               *  00264000
*    *****************************************************************  00265000
*                                                                       00266000
*                                                                       00267000
         AIF   ('&DSECT' EQ 'YES').L000C                                00268000
SETSR    DS    0F                                                       00269000
         AGO   .L000D                                                   00270000
.L000C   ANOP                                                           00271000
SETSR    DSECT                                                          00272000
.L000D   ANOP                                                           00273000
SET_SR_DEFINITION DS CL20 IWMSET.401: Definition section                00274000
         ORG   SET_SR_DEFINITION                                        00275000
SET_SR_SE_INDEX DS F     IWMSET.807: Index of the scheduling           *00276000
                         environment entry within the SET SE section    00277000
SET_SR_SE_OFFSET DS F    IWMSET.396: Offset of the scheduling          *00278000
                         environment entry from the beginning of the   *00279000
                         SET                                            00280000
SET_SR_FLAG1 DS B        IWMSET.313: Flags                              00281000
*  Bit definitions:                                                     00282000
SET_SR_LAST_ONE_FOR_SE EQU X'80' IWMSET.319: Indicates this is the     *00283000
                         last SR entry for a scheduling environment     00284000
*                                                                       00285000
*      ***************************************************************  00286000
*      *                                                             *  00287000
*      * IWMSET.1382: The SET_SR_RESOURCE_STATE and SET_RES_STATE    *  00288000
*      * fields are checked for being equal during                   *  00289000
*      * WLMSET.recalibation process. If these fields are found      *  00290000
*      * different then we know we have the SR desired state not     *  00291000
*      * matched (therefore unavailable).                            *  00292000
*      *                                                             *  00293000
*      ***************************************************************  00294000
*                                                                       00295000
*                                                                       00296000
*                                                                       00297000
SET_SR_RESOURCE_STATE DS X IWMSET.840: Required state of the resource  *00298000
                         for the scheduling environment to be          *00299000
                         available                                      00300000
SET_SR_RESERVED_DEFINITION1 DS CL1 IWMSET.408: SR section reserved      00301000
         ORG   SET_SR_RESERVED_DEFINITION1+2                            00302000
SET_SR_RESERVED_DEFINITION2 DS CL8 IWMSET.1240: Reserved                00303000
SET_SR_OFFSETS DS CL16   IWMSET.427: SR offsets section                 00304000
         ORG   SET_SR_OFFSETS                                           00305000
SET_SR_RE_INDEX DS F     IWMSET.885: Index of the resource entry       *00306000
                         within the SETRE section                       00307000
SET_SR_RE_OFFSET DS F    IWMSET.435: Offset of the resource entry from *00308000
                         the beginning of the SET                       00309000
SET_SR_OFFSETS_RESERVED DS F IWMSET.442: SR reserved offsets            00310000
         ORG   SETSR+36                                                 00311000
SETSR_LEN EQU  *-SETSR                                                  00312000
.L000A   ANOP                                                           00313000
         AIF   ('&SETRE' EQ 'NO').L000E                                 00314000
         AIF   ('&DSECT' EQ 'YES').L000F                                00315000
         AIF   ('&SETRE' NE 'YES').L000E                                00316000
.L000F   ANOP                                                           00317000
*                                                                       00318000
*    *****************************************************************  00319000
*    *                                                               *  00320000
*    * IWMSET.1072: SET RE - Resource entry                          *  00321000
*    *                                                               *  00322000
*    *****************************************************************  00323000
*                                                                       00324000
*                                                                       00325000
         AIF   ('&DSECT' EQ 'YES').L0010                                00326000
SETRE    DS    0X                                                       00327000
         AGO   .L0011                                                   00328000
.L0010   ANOP                                                           00329000
SETRE    DSECT                                                          00330000
.L0011   ANOP                                                           00331000
SET_RE_DEFINITION DS CL56 IWMSET.476: RE definition                     00332000
         ORG   SET_RE_DEFINITION                                        00333000
SET_RE_RESOURCE_NAME DS CL16 IWMSET.484: Resource name                  00334000
SET_RE_RESOURCE_DESCRIPTION DS CL32 IWMSET.490: Resource description    00335000
SET_RE_RESERVED_DEFINITION DS CL8 IWMSET.502: Reserved                  00336000
SETRE_LEN EQU  *-SETRE                                                  00337000
.L000E   ANOP                                                           00338000
         AIF   ('&SETSYS' EQ 'NO').L0012                                00339000
         AIF   ('&DSECT' EQ 'YES').L0013                                00340000
         AIF   ('&SETSYS' NE 'YES').L0012                               00341000
.L0013   ANOP                                                           00342000
*                                                                       00343000
*    *****************************************************************  00344000
*    *                                                               *  00345000
*    * IWMSET.800: SET SYS - System entry                            *  00346000
*    *                                                               *  00347000
*    *****************************************************************  00348000
*                                                                       00349000
*                                                                       00350000
         AIF   ('&DSECT' EQ 'YES').L0014                                00351000
SETSYS   DS    0F                                                       00352000
         AGO   .L0015                                                   00353000
.L0014   ANOP                                                           00354000
SETSYS   DSECT                                                          00355000
.L0015   ANOP                                                           00356000
*                                                                       00357000
*      ***************************************************************  00358000
*      *                                                             *  00359000
*      * IWMSET.1155: The first entry in the systems section of the  *  00360000
*      * SET represents the current systems information. Subsequent  *  00361000
*      * entries from the first entry are created whenever we get    *  00362000
*      * topology information from those systems.                    *  00363000
*      *                                                             *  00364000
*      ***************************************************************  00365000
*                                                                       00366000
*                                                                       00367000
*                                                                       00368000
SET_SYS_DEFINITION DS CL12 IWMSET.536: SYS definition                   00369000
         ORG   SET_SYS_DEFINITION                                       00370000
SET_SYS_NAME DS CL8      IWMSET.544: System name. If this field        *00371000
                         contains binary zeroes, this is an unused     *00372000
                         entry that contains no status information.     00373000
SET_SYS_RESERVED_DEFINITION DS CL4 IWMSET.550: Reserved                 00374000
SET_SYS_OFFSET_SYH DS F  IWMSET.568: Offset to the system status       *00375000
                         header (SETSYH) for this system, if there is  *00376000
                         a system name in the SET_SYS_NAME field.      *00377000
                         Internal information: This field is only      *00378000
                         maintained in the IWMSEQRY (IWMS4QRY)         *00379000
                         service. WLM intern we should continue touse  *00380000
                         the SET_SYS_STATUS_PTR instead.                00381000
SET_SYS_STATUS_PTR DS A  IWMSET.1230: Address of the system status     *00382000
                         header (SETSYH) for this system, if there is  *00383000
                         a system name in the SET_SYS_NAME field        00384000
SETSYS_LEN EQU *-SETSYS                                                 00385000
.L0012   ANOP                                                           00386000
         AIF   ('&SETSYH' EQ 'NO').L0016                                00387000
         AIF   ('&DSECT' EQ 'YES').L0017                                00388000
         AIF   ('&SETSYH' NE 'YES').L0016                               00389000
.L0017   ANOP                                                           00390000
*                                                                       00391000
*    *****************************************************************  00392000
*    *                                                               *  00393000
*    * IWMSET.804: SET SYS HDR - System status header                *  00394000
*    *                                                               *  00395000
*    *****************************************************************  00396000
*                                                                       00397000
*                                                                       00398000
         AIF   ('&DSECT' EQ 'YES').L0018                                00399000
SETSYH   DS    0F                                                       00400000
         AGO   .L0019                                                   00401000
.L0018   ANOP                                                           00402000
SETSYH   DSECT                                                          00403000
.L0019   ANOP                                                           00404000
*                                                                       00405000
*      ***************************************************************  00406000
*      *                                                             *  00407000
*      * IWMSET.184: This section is used in the                     *  00408000
*      * SYSPLEX_TOPOLOGY_REQUEST data (includes a SERB prefix) that *  00409000
*      * is sent to other systems in the sysplex. Since this section *  00410000
*      * is used in the data sent to other systems one cannot add    *  00411000
*      * fields in the middle of this structure. One must add the    *  00412000
*      * fields at the end for the next release because the structure*  00413000
*      * must remain downwardly compatible.                          *  00414000
*      *                                                             *  00415000
*      ***************************************************************  00416000
*                                                                       00417000
*                                                                       00418000
*                                                                       00419000
SET_SYS_HDR_EYECATCHER DS CL8 IWMSET.846: Eye catcher                   00420000
SET_SYS_HDR_CONTROL DS CL32 IWMSET.611: System status header control   *00421000
                         information                                    00422000
         ORG   SET_SYS_HDR_CONTROL                                      00423000
SET_SYS_HDR_TOD_VALUE DS BL8 IWMSET.234: Time stamp of when the        *00424000
                         service number definition was installed. This *00425000
                         is a copy of the SET_HDR_TOD_VALUE             00426000
*                                                                       00427000
*      ***************************************************************  00428000
*      *                                                             *  00429000
*      * IWMSET.777: INTERNAL COMMENTS: We use the                   *  00430000
*      * SET_SYS_HDR_MODIFIED as part of action and topology         *  00431000
*      * processing so that another system can determine if a request*  00432000
*      * is old or not. When another system gets an action or        *  00433000
*      * topology request if this value is older than that system's  *  00434000
*      * current value then the request is ignored. See the WLM SE   *  00435000
*      * action and topology processor for details on how this field *  00436000
*      * is used.                                                    *  00437000
*      *                                                             *  00438000
*      ***************************************************************  00439000
*                                                                       00440000
*                                                                       00441000
*                                                                       00442000
SET_SYS_HDR_MODIFIED DS BL8 IWMSET.1165: A time stamp for the most     *00443000
                         recent modification to status information in  *00444000
                         a SETSES or SETRES entry                       00445000
SET_SYS_HDR_WLM_VERSION_NUMBER DS X IWMSET.318: Version number of      *00446000
                         system status header                           00447000
SET_SYS_HDR_CONTROL_RESERVED DS X IWMSET.1171: Reserved                 00448000
SET_SYS_HDR_SIZE_OF_HEADER DS H IWMSET.242: Size of the system status  *00449000
                         header                                         00450000
SET_SYS_HDR_WHOLE_SIZE DS F IWMSET.292: Size of the system status area *00451000
                         including this header, all SETSES entries and *00452000
                         all SETRES entries                             00453000
SET_SYS_HDR_CONTROL_RESERVED2 DS F IWMSET.619: Reserved                 00454000
         ORG   SET_SYS_HDR_CONTROL+32                                   00455000
SET_SYS_HDR_OFFSETS_AREA DS CL24 IWMSET.629: System status header      *00456000
                         offsets area                                   00457000
         ORG   SET_SYS_HDR_OFFSETS_AREA                                 00458000
SET_SYS_HDR_SES_SECTION DS CL8 IWMSET.637: Scheduling environment      *00459000
                         status section                                 00460000
         ORG   SET_SYS_HDR_SES_SECTION                                  00461000
SET_OFFSET_SES DS F      IWMSET.640: Offset of the scheduling          *00462000
                         environment status section (SETSES)            00463000
SET_NUMBER_SES DS H      IWMSET.646: Number of scheduling environment  *00464000
                         status entries                                 00465000
SET_SIZE_SES DS H        IWMSET.652: Size of a scheduling environment  *00466000
                         status entry                                   00467000
SET_SYS_HDR_RES_SECTION DS CL8 IWMSET.658: Resource status section      00468000
         ORG   SET_SYS_HDR_RES_SECTION                                  00469000
SET_OFFSET_RES DS F      IWMSET.661: Offset of the resource status     *00470000
                         entries (SETRES)                               00471000
SET_NUMBER_RES DS H      IWMSET.667: Number of resource status entries  00472000
SET_SIZE_RES DS H        IWMSET.673: Size of a resource status entry    00473000
SET_SYS_HDR_RESERVED_SECTION DS CL8 IWMSET.680: Reserved slots          00474000
         ORG   SET_SYS_HDR_RESERVED_SECTION                             00475000
SET_OFFSET_RESERVED1 DS F IWMSET.683: Reserved offset                   00476000
SET_NUMBER_RESERVED1 DS H IWMSET.689: Reserved number                   00477000
SET_SIZE_RESERVED1 DS H  IWMSET.695: Reserved size                      00478000
SET_SYS_HDR_RESERVED DS F IWMSET.1044: Reserved                         00479000
         ORG   SETSYH+80                                                00480000
SETSYH_LEN EQU *-SETSYH                                                 00481000
.L0016   ANOP                                                           00482000
         AIF   ('&SETSES' EQ 'NO').L001A                                00483000
         AIF   ('&DSECT' EQ 'YES').L001B                                00484000
         AIF   ('&SETSES' NE 'YES').L001A                               00485000
.L001B   ANOP                                                           00486000
*                                                                       00487000
*    *****************************************************************  00488000
*    *                                                               *  00489000
*    * IWMSET.870: SET SES - Scheduling environment system status    *  00490000
*    *                                                               *  00491000
*    *****************************************************************  00492000
*                                                                       00493000
*                                                                       00494000
         AIF   ('&DSECT' EQ 'YES').L001C                                00495000
SETSES   DS    0F                                                       00496000
         AGO   .L001D                                                   00497000
.L001C   ANOP                                                           00498000
SETSES   DSECT                                                          00499000
.L001D   ANOP                                                           00500000
*                                                                       00501000
*      ***************************************************************  00502000
*      *                                                             *  00503000
*      * IWMSET.1117: This section is used in the                    *  00504000
*      * SYSPLEX_TOPOLOGY_REQUEST data (includes a SERB prefix) that *  00505000
*      * is sent to other systems in the sysplex. Since this section *  00506000
*      * is used in the data sent to other systems one cannot add    *  00507000
*      * fields in the middle of this structure. One must add the    *  00508000
*      * fields at the end for the next release because the structure*  00509000
*      * must remain downwardly compatible.                          *  00510000
*      *                                                             *  00511000
*      ***************************************************************  00512000
*                                                                       00513000
*                                                                       00514000
*                                                                       00515000
SET_SES_DEFINITION DS CL4 IWMSET.745: SES definition                    00516000
         ORG   SET_SES_DEFINITION                                       00517000
SET_SES_SE_INDEX DS F    IWMSET.753: Index of the scheduling           *00518000
                         environment entry within the SETSE section of *00519000
                         the definition area. SETSES entries           *00520000
                         correspond positionally to SETSE entries (for *00521000
                         example the third SETSES entry corresponds to *00522000
                         the third SETSE entry). The index is here     *00523000
                         primarily as a debugging aid, such as to      *00524000
                         detect an overlay.                             00525000
SET_SES_STATUS DS CL12   IWMSET.1241: SES status                        00526000
         ORG   SET_SES_STATUS                                           00527000
SET_SES_FLAG1 DS B       IWMSET.759: Flag 1                             00528000
*  Bit definitions:                                                     00529000
SET_SES_AVAILABLE EQU X'80' IWMSET.765: Indicates the scheduling       *00530000
                         environment is available                       00531000
SET_SES_FLAG2 DS B       IWMSET.350: Flag 2                             00532000
*                                                                       00533000
* ********************************************************************  00534000
* * IWMSET.498:                                                      *  00535000
* *                                                                  *  00536000
* *                                                                  *  00537000
* * A scheduling environment can exist in one of two states.  It is  *  00538000
* * either available or NOT available.  The following explains:      *  00539000
* *                                                                  *  00540000
* * - available represents a condition where all the resources for   *  00541000
* *   a scheduling environment have there desired state met          *  00542000
* *                                                                  *  00543000
* * - NOT available represents a condition where one or more         *  00544000
* *   resources for a scheduling environment DO NOT have there       *  00545000
* *   desired state met                                              *  00546000
* *                                                                  *  00547000
* * Now a system can have a scheduling environment move between the  *  00548000
* * available and NOT available condition causing work to be able    *  00549000
* * to run or NOT run.  The SET_RES_REQUIRES_ENF or                  *  00550000
* * SET_RES_REQUIRES_REC_ENF is set during a change in the           *  00551000
* * SET_SES_AVAILABLE status (from on to off or vice versa) then we  *  00552000
* * must notify other subsystems about the change.                   *  00553000
* *                                                                  *  00554000
* * This allows the other systems to recalibrate any data or masks   *  00555000
* * that they may have made with the older status.  For example, if  *  00556000
* * JES2 created a resource affinity mask and the scheduling         *  00557000
* * environment was NOT available then the job will not be run.      *  00558000
* * However, if the situations changed where the scheduling          *  00559000
* * environment became available (SET_SES_AVAILABLE on) then we      *  00560000
* * would notify JES2 (IWMS4ACP finds SET_SES_REQUIRED_ENF on) and   *  00561000
* * this would allow JES2 to recalibrate jobs that use the           *  00562000
* * scheduling environment that changed.                             *  00563000
* *                                                                  *  00564000
* * Now why have the SET_RES_REQUIRES_REC_ENF.  This indicator       *  00565000
* * differs from SET_RES_REQUIRES_ENF because we set it during       *  00566000
* * recovery processing.  Normally things should be in sync while    *  00567000
* * we do action processing.  However, if RESYNC processing or       *  00568000
* * TOPOLOGY processing finds information out of sync the            *  00569000
* * SET_RES_REQUIRES_REC_ENF is set which tells the subsystem that   *  00570000
* * they have to recalibrate no matter what.                         *  00571000
* *                                                                  *  00572000
* ********************************************************************  00573000
*                                                                       00574000
*                                                                       00575000
*                                                                       00576000
*  Bit definitions:                                                     00577000
SET_SES_REQUIRES_ENF EQU X'80' IWMSET.1270: The scheduling environment *00578000
                         has had its status changed (either            *00579000
                         SET_SES_AVAILABLE was set or reset) and we    *00580000
                         must notify any users interested in           *00581000
                         scheduling environments via ENF 57             00582000
SET_SES_REQUIRES_REC_ENF EQU X'40' IWMSET.730: The scheduling          *00583000
                         environment has had its status changed.       *00584000
                         Similar to SET_SES_REQ- UIRES_ENF but set in  *00585000
                         WLM recovery paths.                            00586000
SET_SES_RESERVED DS BL2  IWMSET.771: Reserved                           00587000
SET_SES_RESERVED_DEFINITION DS CL8 IWMSET.780: Reserved                 00588000
SETSES_LEN EQU *-SETSES                                                 00589000
.L001A   ANOP                                                           00590000
         AIF   ('&SETRES' EQ 'NO').L001E                                00591000
         AIF   ('&DSECT' EQ 'YES').L001F                                00592000
         AIF   ('&SETRES' NE 'YES').L001E                               00593000
.L001F   ANOP                                                           00594000
*                                                                       00595000
*    *****************************************************************  00596000
*    *                                                               *  00597000
*    * IWMSET.883: SET RES - Resource system status                  *  00598000
*    *                                                               *  00599000
*    *****************************************************************  00600000
*                                                                       00601000
*                                                                       00602000
         AIF   ('&DSECT' EQ 'YES').L0020                                00603000
SETRES   DS    0F                                                       00604000
         AGO   .L0021                                                   00605000
.L0020   ANOP                                                           00606000
SETRES   DSECT                                                          00607000
.L0021   ANOP                                                           00608000
*                                                                       00609000
*      ***************************************************************  00610000
*      *                                                             *  00611000
*      * IWMSET.1130: This section is used in the                    *  00612000
*      * SYSPLEX_TOPOLOGY_REQUEST data (includes a SERB prefix) that *  00613000
*      * is sent to other systems in the sysplex. Since this section *  00614000
*      * is used in the data sent to other systems one cannot add    *  00615000
*      * fields in the middle of this structure. One must add the    *  00616000
*      * fields at the end for the next release because the structure*  00617000
*      * must remain downwardly compatible.                          *  00618000
*      *                                                             *  00619000
*      ***************************************************************  00620000
*                                                                       00621000
*                                                                       00622000
*                                                                       00623000
SET_RES_DEFINITION DS CL4 IWMSET.815: RES definition                    00624000
         ORG   SET_RES_DEFINITION                                       00625000
SET_RES_RE_INDEX DS F    IWMSET.823: Index of the resource entry       *00626000
                         within the SETRE section of the definition    *00627000
                         area. SETRES entries correspond positionally  *00628000
                         to SETRE entries (for example the fourth      *00629000
                         SETRES entry corresponds to the fourth SETRE  *00630000
                         entry). The index is here primarily as a      *00631000
                         debugging aid, such as to detect an overlay.   00632000
SET_RES_STATUS DS CL12   IWMSET.415: RES status                         00633000
*                                                                       00634000
*      ***************************************************************  00635000
*      *                                                             *  00636000
*      * IWMSET.1438: The SET_RES_STATE and SET_SR_RESOURCE_STATE    *  00637000
*      * fields are checked for being equal during                   *  00638000
*      * WLMSET.recalibation process. If these fields are found      *  00639000
*      * different then we know we have the SR desired state not     *  00640000
*      * matched (therefore unavailable).                            *  00641000
*      *                                                             *  00642000
*      ***************************************************************  00643000
*                                                                       00644000
*                                                                       00645000
*                                                                       00646000
         ORG   SET_RES_STATUS                                           00647000
SET_RES_STATE DS X       IWMSET.829: Current state of the resource      00648000
SET_RES_FLAG1 DS B       IWMSET.853: Flag 1                             00649000
*  Bit definitions:                                                     00650000
SET_RES_MODIFICATION_IN_PROGRESS EQU X'80' IWMSET.1351: Indicates that *00651000
                         a F WLM,RESOURCE or IWMSESET request is in    *00652000
                         progress                                       00653000
SET_RES_RESERVED DS BL2  IWMSET.1005: Reserved                          00654000
SET_RES_RESERVED_DEFINITION DS CL8 IWMSET.862: Reserved                 00655000
*                                                                       00656000
*    *****************************************************************  00657000
*    *                                                               *  00658000
*    * IWMSET.102: SET eyecatcher - 'IWMSET'                         *  00659000
*    *                                                               *  00660000
*    *****************************************************************  00661000
*                                                                       00662000
*                                                                       00663000
IWMSET_LEVEL004 EQU 4                                                   00664000
*                                                                       00665000
*    *****************************************************************  00666000
*    *                                                               *  00667000
*    * IWMSET.120: WLM JBB6604 version                               *  00668000
*    *                                                               *  00669000
*    *****************************************************************  00670000
*                                                                       00671000
*                                                                       00672000
IWMSET_VER604 EQU 4                                                     00673000
*                                                                       00674000
*    *****************************************************************  00675000
*    *                                                               *  00676000
*    * IWMSET.129: Current version level used when checking          *  00677000
*    * functionality within WLM product                              *  00678000
*    *                                                               *  00679000
*    *****************************************************************  00680000
*                                                                       00681000
*                                                                       00682000
IWMSET_CURRENT_VER EQU 4                                                00683000
*                                                                       00684000
*    *****************************************************************  00685000
*    *                                                               *  00686000
*    * IWMSET.601: SET_SR_RESOURCE_STATE that indicates resource is  *  00687000
*    * desired to be ON                                              *  00688000
*    *                                                               *  00689000
*    *****************************************************************  00690000
*                                                                       00691000
*                                                                       00692000
SET_SR_ON EQU  4                                                        00693000
*                                                                       00694000
*    *****************************************************************  00695000
*    *                                                               *  00696000
*    * IWMSET.1394: SET_RES_STATE that indicates resource is ON      *  00697000
*    *                                                               *  00698000
*    *****************************************************************  00699000
*                                                                       00700000
*                                                                       00701000
SET_RES_ON EQU 4                                                        00702000
*                                                                       00703000
*    *****************************************************************  00704000
*    *                                                               *  00705000
*    * IWMSET.1371: SET_SR_RESOURCE_STATE that indicates resource is *  00706000
*    * desired to be OFF                                             *  00707000
*    *                                                               *  00708000
*    *****************************************************************  00709000
*                                                                       00710000
*                                                                       00711000
SET_SR_OFF EQU 8                                                        00712000
*                                                                       00713000
*    *****************************************************************  00714000
*    *                                                               *  00715000
*    * IWMSET.1403: SET_RES_STATE that indicates resource is OFF     *  00716000
*    *                                                               *  00717000
*    *****************************************************************  00718000
*                                                                       00719000
*                                                                       00720000
SET_RES_OFF EQU 8                                                       00721000
*                                                                       00722000
*    *****************************************************************  00723000
*    *                                                               *  00724000
*    * IWMSET.1390: SET_SR_RESOURCE_STATE that is reserved           *  00725000
*    *                                                               *  00726000
*    *****************************************************************  00727000
*                                                                       00728000
*                                                                       00729000
SET_SR_RESERVED EQU 12                                                  00730000
*                                                                       00731000
*    *****************************************************************  00732000
*    *                                                               *  00733000
*    * IWMSET.1357: SET_RES_STATE that indicates resource is RESET   *  00734000
*    *                                                               *  00735000
*    *****************************************************************  00736000
*                                                                       00737000
*                                                                       00738000
SET_RES_RESET EQU 12                                                    00739000
SETRES_LEN EQU *-SETRES                                                 00740000
.L001E   ANOP                                                           00741000
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 00742000
         AIF   ('&LIST' EQ 'YES').P4                                    00743000
.P3      ANOP                                                           00744000
         POP   PRINT                                                    00745000
.P4      ANOP                                                           00746000
.P_EXIT  ANOP                                                           00747000
         MEND                                                           00748000
**/ IWMSET_2:;                                                          00749000
* %IWMSET_INCLUDED = 'YES';                                             00750000
* %DCL ZCBPRINT CHAR EXT;                                               00751000
* %DEACTIVATE ZCBPRINT;                                                 00752000
* %DCL IWMSET_LIST CHAR EXT;                                            00753000
* %DEACTIVATE IWMSET_LIST;                                              00754000
* %IF IWMSET_LIST = 'NO' !                                              00755000
*    ZCBPRINT = 'NO' %THEN                                              00756000
* %DO;                                                                  00757000
*   @LIST PUSH NOECHO;                                                  00758000
*   @LIST NOASSEMBLE NOECHO;                                            00759000
*   @LIST OFF C NOECHO;                                                 00760000
* %END;                                                                 00761000
*/* Start of PL/X Source                                             */ 00762000
*                                                                       00763000
*   /*****************************************************************/ 00764000
*   /*                                                               */ 00765000
*   /* IWMSET.708: SET header                                        */ 00766000
*   /*                                                               */ 00767000
*   /*****************************************************************/ 00768000
*                                                                       00769000
*   DECLARE                                                             00770000
*     1    SETHDR   BASED(*) BDY(WORD),                                 00771000
*      2    SET_HDR_EYECATCHER CHAR(8), /* IWMSET.29: Eye catcher    */ 00772000
*      2    SET_HDR_WLM_VERSION_NUMBER FIXED(8), /* IWMSET.41:          00773000
*                                      Version number of SET         */ 00774000
*      2    SET_HDR_RESERVED1 FIXED(8), /* IWMSET.1180: Reserved     */ 00775000
*      2    SET_HDR_SIZE_OF_HEADER FIXED(16), /* IWMSET.75: Size of     00776000
*                                      this header section           */ 00777000
*      2    SET_HDR_SIZE_OF_WHOLE_SET FIXED(32), /* IWMSET.63: Size     00778000
*                                      of the whole scheduling          00779000
*                                      environment table, not           00780000
*                                      including any system status      00781000
*                                      areas                         */ 00782000
*      2    SET_HDR_TOD_VALUE BIT(64), /* IWMSET.67: Time/date (STCK    00783000
*                                      format) that the service         00784000
*                                      definition was installed. The    00785000
*                                      value matches field SVPOLTDI     00786000
*                                      in IWMSVPOL.                  */ 00787000
*      2    SET_HDR_SIZE_OF_A_SYS_STATUS_AREA /* IWMSET.54: Size of     00788000
*                                      each system status area       */ 00789000
*               FIXED(32),                                              00790000
*      2    SET_HDR_RESERVED(8) FIXED(32), /* IWMSET.176: Reserved   */ 00791000
*      2    SET_HDR_OFFSETS,        /* IWMSET.61: SET section offsets   00792000
*                                      area                          */ 00793000
*       3    SET_HDR_SE_SECTION,    /* IWMSET.48: Scheduling            00794000
*                                      environment section           */ 00795000
*        4    SET_OFFSET_SE FIXED(32), /* IWMSET.38: Offset of          00796000
*                                      scheduling environment section   00797000
*                                      (SETSE)                       */ 00798000
*        4    SET_NUMBER_SE FIXED(16), /* IWMSET.892: Number of         00799000
*                                      scheduling environment entries*/ 00800000
*        4    SET_SIZE_SE FIXED(16), /* IWMSET.898: Size of a           00801000
*                                      scheduling environment entry  */ 00802000
*       3    SET_HDR_SR_SECTION,    /* IWMSET.904: Scheduling           00803000
*                                      environment- /resource           00804000
*                                      relationships section         */ 00805000
*        4    SET_OFFSET_SR FIXED(32), /* IWMSET.907: Offset of         00806000
*                                      scheduling environment-          00807000
*                                      /resource relationship section   00808000
*                                      (SETSR)                       */ 00809000
*        4    SET_NUMBER_SR FIXED(16), /* IWMSET.913: Number of         00810000
*                                      scheduling environment-          00811000
*                                      /resource relationship entries*/ 00812000
*        4    SET_SIZE_SR FIXED(16), /* IWMSET.919: Size of a           00813000
*                                      scheduling environment-          00814000
*                                      /resource relationship entry  */ 00815000
*       3    SET_HDR_RE_SECTION,    /* IWMSET.925: Resource section  */ 00816000
*        4    SET_OFFSET_RE FIXED(32), /* IWMSET.928: Offset of         00817000
*                                      resource section (SETRE)      */ 00818000
*        4    SET_NUMBER_RE FIXED(16), /* IWMSET.934: Number of         00819000
*                                      resource entries              */ 00820000
*        4    SET_SIZE_RE FIXED(16), /* IWMSET.940: Size of a           00821000
*                                      resource entry                */ 00822000
*       3    SET_HDR_SYS_SECTION,   /* IWMSET.947: System section    */ 00823000
*        4    SET_OFFSET_SYS FIXED(32), /* IWMSET.950: Offset of        00824000
*                                      system section (SETSYS)       */ 00825000
*        4    SET_NUMBER_SYS FIXED(16), /* IWMSET.956: Number of        00826000
*                                      system entries                */ 00827000
*        4    SET_SIZE_SYS FIXED(16), /* IWMSET.962: Size of a system   00828000
*                                      entry                         */ 00829000
*       3    SET_HDR_RESERVED_SECTION, /* IWMSET.969: Reserved slots */ 00830000
*        4    SET_OFFSET_RESERVED FIXED(32), /* IWMSET.972: Reserved    00831000
*                                      offset                        */ 00832000
*        4    SET_NUMBER_RESERVED FIXED(16), /* IWMSET.978: Reserved    00833000
*                                      number                        */ 00834000
*        4    SET_SIZE_RESERVED FIXED(16); /* IWMSET.984: Reserved      00835000
*                                      size                          */ 00836000
*                                                                       00837000
*   /*****************************************************************/ 00838000
*   /*                                                               */ 00839000
*   /* IWMSET.1212: SET SE - Scheduling environment entry            */ 00840000
*   /*                                                               */ 00841000
*   /*****************************************************************/ 00842000
*                                                                       00843000
*   DECLARE                                                             00844000
*     1    SETSE    BASED(*) BDY(WORD),                                 00845000
*      2    SET_SE_DEFINITION,      /* IWMSET.332: SE definition     */ 00846000
*       3    SET_SE_SCHENV_NAME CHAR(16), /* IWMSET.336: Scheduling     00847000
*                                      environment name              */ 00848000
*       3    SET_SE_DESCRIPTION CHAR(32), /* IWMSET.288: Scheduling     00849000
*                                      environment description       */ 00850000
*       3    SET_SE_RESERVED_DEFINITION CHAR(8), /* IWMSET.354:         00851000
*                                      Reserved                      */ 00852000
*      2    SET_SE_OFFSETS,         /* IWMSET.365: SE offsets        */ 00853000
*       3    SET_SE_SR_OFFSET FIXED(31), /* IWMSET.372: Offset of the   00854000
*                                      first scheduling environment-    00855000
*                                      /resource relationship entry     00856000
*                                      for this scheduling              00857000
*                                      environment from the beginning   00858000
*                                      of the SET                    */ 00859000
*       3    SET_SE_SR_COUNT FIXED(31), /* IWMSET.378: Number of        00860000
*                                      scheduling environment-          00861000
*                                      /resource relationship entries   00862000
*                                      for this scheduling              00863000
*                                      environment                   */ 00864000
*       3    SET_SE_OFFSETS_RESERVED(2) FIXED(31); /* IWMSET.1143: SE   00865000
*                                      reserved offsets              */ 00866000
*                                                                       00867000
*   /*****************************************************************/ 00868000
*   /*                                                               */ 00869000
*   /* IWMSET.723: SET SR - Scheduling environment/resource          */ 00870000
*   /* relationship entry                                            */ 00871000
*   /*                                                               */ 00872000
*   /*****************************************************************/ 00873000
*                                                                       00874000
*   DECLARE                                                             00875000
*     1    SETSR    BASED(*) BDY(WORD),                                 00876000
*      2    SET_SR_DEFINITION,      /* IWMSET.401: Definition section*/ 00877000
*       3    SET_SR_SE_INDEX FIXED(31), /* IWMSET.807: Index of the     00878000
*                                      scheduling environment entry     00879000
*                                      within the SET SE section     */ 00880000
*       3    SET_SR_SE_OFFSET FIXED(31), /* IWMSET.396: Offset of the   00881000
*                                      scheduling environment entry     00882000
*                                      from the beginning of the SET */ 00883000
*       3    SET_SR_FLAG1 BIT(8) BDY(BYTE), /* IWMSET.313: Flags     */ 00884000
*        4    SET_SR_LAST_ONE_FOR_SE BIT(1), /* IWMSET.319: Indicates   00885000
*                                      this is the last SR entry for    00886000
*                                      a scheduling environment      */ 00887000
*                                                                       00888000
*     /***************************************************************/ 00889000
*     /*                                                             */ 00890000
*     /* IWMSET.1382: The SET_SR_RESOURCE_STATE and SET_RES_STATE    */ 00891000
*     /* fields are checked for being equal during                   */ 00892000
*     /* WLMSET.recalibation process. If these fields are found      */ 00893000
*     /* different then we know we have the SR desired state not     */ 00894000
*     /* matched (therefore unavailable).                            */ 00895000
*     /*                                                             */ 00896000
*     /***************************************************************/ 00897000
*                                                                       00898000
*@SPACE;                                                                00899000
*       3    SET_SR_RESOURCE_STATE FIXED(8), /* IWMSET.840: Required    00900000
*                                      state of the resource for the    00901000
*                                      scheduling environment to be     00902000
*                                      available                     */ 00903000
*       3    SET_SR_RESERVED_DEFINITION1(2) CHAR(1), /* IWMSET.408:     00904000
*                                      SR section reserved           */ 00905000
*       3    SET_SR_RESERVED_DEFINITION2 CHAR(8), /* IWMSET.1240:       00906000
*                                      Reserved                      */ 00907000
*      2    SET_SR_OFFSETS,         /* IWMSET.427: SR offsets section*/ 00908000
*       3    SET_SR_RE_INDEX FIXED(31), /* IWMSET.885: Index of the     00909000
*                                      resource entry within the        00910000
*                                      SETRE section                 */ 00911000
*       3    SET_SR_RE_OFFSET FIXED(31), /* IWMSET.435: Offset of the   00912000
*                                      resource entry from the          00913000
*                                      beginning of the SET          */ 00914000
*       3    SET_SR_OFFSETS_RESERVED(2) FIXED(31); /* IWMSET.442: SR    00915000
*                                      reserved offsets              */ 00916000
*                                                                       00917000
*   /*****************************************************************/ 00918000
*   /*                                                               */ 00919000
*   /* IWMSET.1072: SET RE - Resource entry                          */ 00920000
*   /*                                                               */ 00921000
*   /*****************************************************************/ 00922000
*                                                                       00923000
*   DECLARE                                                             00924000
*     1    SETRE    BASED(*) BDY(BYTE),                                 00925000
*      2    SET_RE_DEFINITION,      /* IWMSET.476: RE definition     */ 00926000
*       3    SET_RE_RESOURCE_NAME CHAR(16), /* IWMSET.484: Resource     00927000
*                                      name                          */ 00928000
*       3    SET_RE_RESOURCE_DESCRIPTION CHAR(32), /* IWMSET.490:       00929000
*                                      Resource description          */ 00930000
*       3    SET_RE_RESERVED_DEFINITION CHAR(8); /* IWMSET.502:         00931000
*                                      Reserved                      */ 00932000
*                                                                       00933000
*   /*****************************************************************/ 00934000
*   /*                                                               */ 00935000
*   /* IWMSET.800: SET SYS - System entry                            */ 00936000
*   /*                                                               */ 00937000
*   /*****************************************************************/ 00938000
*                                                                       00939000
*   DECLARE                                                             00940000
*     1    SETSYS   BASED(*) BDY(WORD),                                 00941000
*                                                                       00942000
*     /***************************************************************/ 00943000
*     /*                                                             */ 00944000
*     /* IWMSET.1155: The first entry in the systems section of the  */ 00945000
*     /* SET represents the current systems information. Subsequent  */ 00946000
*     /* entries from the first entry are created whenever we get    */ 00947000
*     /* topology information from those systems.                    */ 00948000
*     /*                                                             */ 00949000
*     /***************************************************************/ 00950000
*                                                                       00951000
*@SPACE;                                                                00952000
*      2    SET_SYS_DEFINITION,     /* IWMSET.536: SYS definition    */ 00953000
*       3    SET_SYS_NAME CHAR(8),  /* IWMSET.544: System name. If      00954000
*                                      this field contains binary       00955000
*                                      zeroes, this is an unused        00956000
*                                      entry that contains no status    00957000
*                                      information.                  */ 00958000
*       3    SET_SYS_RESERVED_DEFINITION CHAR(4), /* IWMSET.550:        00959000
*                                      Reserved              @PJK0044*/ 00960000
*      2    SET_SYS_OFFSET_SYH FIXED(32), /* IWMSET.568: Offset to      00961000
*                                      the system status header         00962000
*                                      (SETSYH) for this system, if     00963000
*                                      there is a system name in the    00964000
*                                      SET_SYS_NAME field.   @PJK0044   00965000
*                                      Internal information: This       00966000
*                                      field is only maintained in      00967000
*                                      the IWMSEQRY (IWMS4QRY)          00968000
*                                      service. WLM intern we should    00969000
*                                      continue touse the               00970000
*                                      SET_SYS_STATUS_PTR instead.      00971000
*                                                            @PJK0044*/ 00972000
*      2    SET_SYS_STATUS_PTR POINTER(31); /* IWMSET.1230: Address     00973000
*                                      of the system status header      00974000
*                                      (SETSYH) for this system, if     00975000
*                                      there is a system name in the    00976000
*                                      SET_SYS_NAME field            */ 00977000
*                                                                       00978000
*   /*****************************************************************/ 00979000
*   /*                                                               */ 00980000
*   /* IWMSET.804: SET SYS HDR - System status header                */ 00981000
*   /*                                                               */ 00982000
*   /*****************************************************************/ 00983000
*                                                                       00984000
*   DECLARE                                                             00985000
*     1    SETSYH   BASED(*) BDY(WORD),                                 00986000
*                                                                       00987000
*     /***************************************************************/ 00988000
*     /*                                                             */ 00989000
*     /* IWMSET.184: This section is used in the                     */ 00990000
*     /* SYSPLEX_TOPOLOGY_REQUEST data (includes a SERB prefix) that */ 00991000
*     /* is sent to other systems in the sysplex. Since this section */ 00992000
*     /* is used in the data sent to other systems one cannot add    */ 00993000
*     /* fields in the middle of this structure. One must add the    */ 00994000
*     /* fields at the end for the next release because the structure*/ 00995000
*     /* must remain downwardly compatible.                          */ 00996000
*     /*                                                             */ 00997000
*     /***************************************************************/ 00998000
*                                                                       00999000
*@SPACE;                                                                01000000
*      2    SET_SYS_HDR_EYECATCHER CHAR(8), /* IWMSET.846: Eye          01001000
*                                      catcher                       */ 01002000
*      2    SET_SYS_HDR_CONTROL,    /* IWMSET.611: System status        01003000
*                                      header control information    */ 01004000
*       3    SET_SYS_HDR_TOD_VALUE BIT(64), /* IWMSET.234: Time stamp   01005000
*                                      of when the service number       01006000
*                                      definition was installed. This   01007000
*                                      is a copy of the                 01008000
*                                      SET_HDR_TOD_VALUE             */ 01009000
*                                                                       01010000
*     /***************************************************************/ 01011000
*     /*                                                             */ 01012000
*     /* IWMSET.777: INTERNAL COMMENTS: We use the                   */ 01013000
*     /* SET_SYS_HDR_MODIFIED as part of action and topology         */ 01014000
*     /* processing so that another system can determine if a request*/ 01015000
*     /* is old or not. When another system gets an action or        */ 01016000
*     /* topology request if this value is older than that system's  */ 01017000
*     /* current value then the request is ignored. See the WLM SE   */ 01018000
*     /* action and topology processor for details on how this field */ 01019000
*     /* is used.                                                    */ 01020000
*     /*                                                             */ 01021000
*     /***************************************************************/ 01022000
*                                                                       01023000
*@SPACE;                                                                01024000
*       3    SET_SYS_HDR_MODIFIED BIT(64), /* IWMSET.1165: A time       01025000
*                                      stamp for the most recent        01026000
*                                      modification to status           01027000
*                                      information in a SETSES or       01028000
*                                      SETRES entry                  */ 01029000
*       3    SET_SYS_HDR_WLM_VERSION_NUMBER FIXED(8), /* IWMSET.318:    01030000
*                                      Version number of system         01031000
*                                      status header                 */ 01032000
*       3    SET_SYS_HDR_CONTROL_RESERVED FIXED(8), /* IWMSET.1171:     01033000
*                                      Reserved                      */ 01034000
*       3    SET_SYS_HDR_SIZE_OF_HEADER FIXED(16), /* IWMSET.242:       01035000
*                                      Size of the system status        01036000
*                                      header                        */ 01037000
*       3    SET_SYS_HDR_WHOLE_SIZE FIXED(32), /* IWMSET.292: Size of   01038000
*                                      the system status area           01039000
*                                      including this header, all       01040000
*                                      SETSES entries and all SETRES    01041000
*                                      entries                       */ 01042000
*       3    SET_SYS_HDR_CONTROL_RESERVED2(2) /* IWMSET.619: Reserved*/ 01043000
*                FIXED(32),                                             01044000
*      2    SET_SYS_HDR_OFFSETS_AREA, /* IWMSET.629: System status      01045000
*                                      header offsets area           */ 01046000
*       3    SET_SYS_HDR_SES_SECTION, /* IWMSET.637: Scheduling         01047000
*                                      environment status section    */ 01048000
*        4    SET_OFFSET_SES FIXED(32), /* IWMSET.640: Offset of the    01049000
*                                      scheduling environment status    01050000
*                                      section (SETSES)              */ 01051000
*        4    SET_NUMBER_SES FIXED(16), /* IWMSET.646: Number of        01052000
*                                      scheduling environment status    01053000
*                                      entries                       */ 01054000
*        4    SET_SIZE_SES FIXED(16), /* IWMSET.652: Size of a          01055000
*                                      scheduling environment status    01056000
*                                      entry                         */ 01057000
*       3    SET_SYS_HDR_RES_SECTION, /* IWMSET.658: Resource status    01058000
*                                      section                       */ 01059000
*        4    SET_OFFSET_RES FIXED(32), /* IWMSET.661: Offset of the    01060000
*                                      resource status entries          01061000
*                                      (SETRES)                      */ 01062000
*        4    SET_NUMBER_RES FIXED(16), /* IWMSET.667: Number of        01063000
*                                      resource status entries       */ 01064000
*        4    SET_SIZE_RES FIXED(16), /* IWMSET.673: Size of a          01065000
*                                      resource status entry         */ 01066000
*       3    SET_SYS_HDR_RESERVED_SECTION, /* IWMSET.680: Reserved      01067000
*                                      slots                         */ 01068000
*        4    SET_OFFSET_RESERVED1 FIXED(32), /* IWMSET.683: Reserved   01069000
*                                      offset                        */ 01070000
*        4    SET_NUMBER_RESERVED1 FIXED(16), /* IWMSET.689: Reserved   01071000
*                                      number                        */ 01072000
*        4    SET_SIZE_RESERVED1 FIXED(16), /* IWMSET.695: Reserved     01073000
*                                      size                          */ 01074000
*      2    SET_SYS_HDR_RESERVED(4) FIXED(32); /* IWMSET.1044:          01075000
*                                      Reserved                      */ 01076000
*                                                                       01077000
*   /*****************************************************************/ 01078000
*   /*                                                               */ 01079000
*   /* IWMSET.870: SET SES - Scheduling environment system status    */ 01080000
*   /*                                                               */ 01081000
*   /*****************************************************************/ 01082000
*                                                                       01083000
*   DECLARE                                                             01084000
*     1    SETSES   BASED(*) BDY(WORD),                                 01085000
*                                                                       01086000
*     /***************************************************************/ 01087000
*     /*                                                             */ 01088000
*     /* IWMSET.1117: This section is used in the                    */ 01089000
*     /* SYSPLEX_TOPOLOGY_REQUEST data (includes a SERB prefix) that */ 01090000
*     /* is sent to other systems in the sysplex. Since this section */ 01091000
*     /* is used in the data sent to other systems one cannot add    */ 01092000
*     /* fields in the middle of this structure. One must add the    */ 01093000
*     /* fields at the end for the next release because the structure*/ 01094000
*     /* must remain downwardly compatible.                          */ 01095000
*     /*                                                             */ 01096000
*     /***************************************************************/ 01097000
*                                                                       01098000
*@SPACE;                                                                01099000
*      2    SET_SES_DEFINITION,     /* IWMSET.745: SES definition    */ 01100000
*       3    SET_SES_SE_INDEX FIXED(31), /* IWMSET.753: Index of the    01101000
*                                      scheduling environment entry     01102000
*                                      within the SETSE section of      01103000
*                                      the definition area. SETSES      01104000
*                                      entries correspond               01105000
*                                      positionally to SETSE entries    01106000
*                                      (for example the third SETSES    01107000
*                                      entry corresponds to the third   01108000
*                                      SETSE entry). The index is       01109000
*                                      here primarily as a debugging    01110000
*                                      aid, such as to detect an        01111000
*                                      overlay.                      */ 01112000
*      2    SET_SES_STATUS,         /* IWMSET.1241: SES status       */ 01113000
*       3    SET_SES_FLAG1 BIT(8) BDY(BYTE), /* IWMSET.759: Flag 1   */ 01114000
*        4    SET_SES_AVAILABLE BIT(1), /* IWMSET.765: Indicates the    01115000
*                                      scheduling environment is        01116000
*                                      available                     */ 01117000
*       3    SET_SES_FLAG2 BIT(8) BDY(BYTE), /* IWMSET.350: Flag 2   */ 01118000
*                                                                       01119000
*/********************************************************************/ 01120000
*/* IWMSET.498:                                                      */ 01121000
*/*                                                                  */ 01122000
*/*                                                                  */ 01123000
*/* A scheduling environment can exist in one of two states.  It is  */ 01124000
*/* either available or NOT available.  The following explains:      */ 01125000
*/*                                                                  */ 01126000
*/* - available represents a condition where all the resources for   */ 01127000
*/*   a scheduling environment have there desired state met          */ 01128000
*/*                                                                  */ 01129000
*/* - NOT available represents a condition where one or more         */ 01130000
*/*   resources for a scheduling environment DO NOT have there       */ 01131000
*/*   desired state met                                              */ 01132000
*/*                                                                  */ 01133000
*/* Now a system can have a scheduling environment move between the  */ 01134000
*/* available and NOT available condition causing work to be able    */ 01135000
*/* to run or NOT run.  The SET_RES_REQUIRES_ENF or                  */ 01136000
*/* SET_RES_REQUIRES_REC_ENF is set during a change in the           */ 01137000
*/* SET_SES_AVAILABLE status (from on to off or vice versa) then we  */ 01138000
*/* must notify other subsystems about the change.                   */ 01139000
*/*                                                                  */ 01140000
*/* This allows the other systems to recalibrate any data or masks   */ 01141000
*/* that they may have made with the older status.  For example, if  */ 01142000
*/* JES2 created a resource affinity mask and the scheduling         */ 01143000
*/* environment was NOT available then the job will not be run.      */ 01144000
*/* However, if the situations changed where the scheduling          */ 01145000
*/* environment became available (SET_SES_AVAILABLE on) then we      */ 01146000
*/* would notify JES2 (IWMS4ACP finds SET_SES_REQUIRED_ENF on) and   */ 01147000
*/* this would allow JES2 to recalibrate jobs that use the           */ 01148000
*/* scheduling environment that changed.                             */ 01149000
*/*                                                                  */ 01150000
*/* Now why have the SET_RES_REQUIRES_REC_ENF.  This indicator       */ 01151000
*/* differs from SET_RES_REQUIRES_ENF because we set it during       */ 01152000
*/* recovery processing.  Normally things should be in sync while    */ 01153000
*/* we do action processing.  However, if RESYNC processing or       */ 01154000
*/* TOPOLOGY processing finds information out of sync the            */ 01155000
*/* SET_RES_REQUIRES_REC_ENF is set which tells the subsystem that   */ 01156000
*/* they have to recalibrate no matter what.                         */ 01157000
*/*                                                                  */ 01158000
*/********************************************************************/ 01159000
*                                                                       01160000
*@SPACE;                                                                01161000
*        4    SET_SES_REQUIRES_ENF BIT(1), /* IWMSET.1270: The          01162000
*                                      scheduling environment has had   01163000
*                                      its status changed (either       01164000
*                                      SET_SES_AVAILABLE was set or     01165000
*                                      reset) and we must notify any    01166000
*                                      users interested in scheduling   01167000
*                                      environments via ENF 57       */ 01168000
*        4    SET_SES_REQUIRES_REC_ENF BIT(1), /* IWMSET.730: The       01169000
*                                      scheduling environment has had   01170000
*                                      its status changed. Similar to   01171000
*                                      SET_SES_REQ- UIRES_ENF but set   01172000
*                                      in WLM recovery paths.        */ 01173000
*       3    SET_SES_RESERVED BIT(16), /* IWMSET.771: Reserved       */ 01174000
*       3    SET_SES_RESERVED_DEFINITION CHAR(8); /* IWMSET.780:        01175000
*                                      Reserved                      */ 01176000
*                                                                       01177000
*   /*****************************************************************/ 01178000
*   /*                                                               */ 01179000
*   /* IWMSET.883: SET RES - Resource system status                  */ 01180000
*   /*                                                               */ 01181000
*   /*****************************************************************/ 01182000
*                                                                       01183000
*   DECLARE                                                             01184000
*     1    SETRES   BASED(*) BDY(WORD),                                 01185000
*                                                                       01186000
*     /***************************************************************/ 01187000
*     /*                                                             */ 01188000
*     /* IWMSET.1130: This section is used in the                    */ 01189000
*     /* SYSPLEX_TOPOLOGY_REQUEST data (includes a SERB prefix) that */ 01190000
*     /* is sent to other systems in the sysplex. Since this section */ 01191000
*     /* is used in the data sent to other systems one cannot add    */ 01192000
*     /* fields in the middle of this structure. One must add the    */ 01193000
*     /* fields at the end for the next release because the structure*/ 01194000
*     /* must remain downwardly compatible.                          */ 01195000
*     /*                                                             */ 01196000
*     /***************************************************************/ 01197000
*                                                                       01198000
*@SPACE;                                                                01199000
*      2    SET_RES_DEFINITION,     /* IWMSET.815: RES definition    */ 01200000
*       3    SET_RES_RE_INDEX FIXED(31), /* IWMSET.823: Index of the    01201000
*                                      resource entry within the        01202000
*                                      SETRE section of the             01203000
*                                      definition area. SETRES          01204000
*                                      entries correspond               01205000
*                                      positionally to SETRE entries    01206000
*                                      (for example the fourth SETRES   01207000
*                                      entry corresponds to the         01208000
*                                      fourth SETRE entry). The index   01209000
*                                      is here primarily as a           01210000
*                                      debugging aid, such as to        01211000
*                                      detect an overlay.            */ 01212000
*      2    SET_RES_STATUS,         /* IWMSET.415: RES status        */ 01213000
*                                                                       01214000
*     /***************************************************************/ 01215000
*     /*                                                             */ 01216000
*     /* IWMSET.1438: The SET_RES_STATE and SET_SR_RESOURCE_STATE    */ 01217000
*     /* fields are checked for being equal during                   */ 01218000
*     /* WLMSET.recalibation process. If these fields are found      */ 01219000
*     /* different then we know we have the SR desired state not     */ 01220000
*     /* matched (therefore unavailable).                            */ 01221000
*     /*                                                             */ 01222000
*     /***************************************************************/ 01223000
*                                                                       01224000
*@SPACE;                                                                01225000
*       3    SET_RES_STATE FIXED(8), /* IWMSET.829: Current state of    01226000
*                                      the resource                  */ 01227000
*       3    SET_RES_FLAG1 BIT(8) BDY(BYTE), /* IWMSET.853: Flag 1   */ 01228000
*        4    SET_RES_MODIFICATION_IN_PROGRESS BIT(1), /*               01229000
*                                      IWMSET.1351: Indicates that a    01230000
*                                      F WLM,RESOURCE or IWMSESET       01231000
*                                      request is in progress        */ 01232000
*       3    SET_RES_RESERVED BIT(16), /* IWMSET.1005: Reserved      */ 01233000
*       3    SET_RES_RESERVED_DEFINITION CHAR(8); /* IWMSET.862:        01234000
*                                      Reserved                      */ 01235000
*                                                                       01236000
*   /*****************************************************************/ 01237000
*   /*                                                               */ 01238000
*   /* IWMSET.102: SET eyecatcher - 'IWMSET'                         */ 01239000
*   /*                                                               */ 01240000
*   /*****************************************************************/ 01241000
*                                                                       01242000
*   DECLARE                                                             01243000
*     IWMSET_ID CHAR(8) CONSTANT('IWMSET  ');                           01244000
*                                                                       01245000
*   /*****************************************************************/ 01246000
*   /*                                                               */ 01247000
*   /* IWMSET.852: SET system status eyecatcher                      */ 01248000
*   /*                                                               */ 01249000
*   /*****************************************************************/ 01250000
*                                                                       01251000
*   DECLARE                                                             01252000
*     IWMSET_SYS_ID CHAR(8) CONSTANT('IWMSETSY');                       01253000
*                                                                       01254000
*   /*****************************************************************/ 01255000
*   /*                                                               */ 01256000
*   /* IWMSET.111: Functionality level introduced by WLM in JBB6604  */ 01257000
*   /*                                                               */ 01258000
*   /*****************************************************************/ 01259000
*                                                                       01260000
*   DECLARE                                                             01261000
*     IWMSET_LEVEL004 FIXED(8) CONSTANT(4);                             01262000
*                                                                       01263000
*   /*****************************************************************/ 01264000
*   /*                                                               */ 01265000
*   /* IWMSET.120: WLM JBB6604 version                               */ 01266000
*   /*                                                               */ 01267000
*   /*****************************************************************/ 01268000
*                                                                       01269000
*   DECLARE                                                             01270000
*     IWMSET_VER604 FIXED(8) CONSTANT(4);                               01271000
*                                                                       01272000
*   /*****************************************************************/ 01273000
*   /*                                                               */ 01274000
*   /* IWMSET.129: Current version level used when checking          */ 01275000
*   /* functionality within WLM product                              */ 01276000
*   /*                                                               */ 01277000
*   /*****************************************************************/ 01278000
*                                                                       01279000
*   DECLARE                                                             01280000
*     IWMSET_CURRENT_VER FIXED(8) CONSTANT(4);                          01281000
*                                                                       01282000
*   /*****************************************************************/ 01283000
*   /*                                                               */ 01284000
*   /* IWMSET.601: SET_SR_RESOURCE_STATE that indicates resource is  */ 01285000
*   /* desired to be ON                                              */ 01286000
*   /*                                                               */ 01287000
*   /*****************************************************************/ 01288000
*                                                                       01289000
*   DECLARE                                                             01290000
*     SET_SR_ON FIXED(8) CONSTANT(4);                                   01291000
*                                                                       01292000
*   /*****************************************************************/ 01293000
*   /*                                                               */ 01294000
*   /* IWMSET.1394: SET_RES_STATE that indicates resource is ON      */ 01295000
*   /*                                                               */ 01296000
*   /*****************************************************************/ 01297000
*                                                                       01298000
*   DECLARE                                                             01299000
*     SET_RES_ON FIXED(8) CONSTANT(4);                                  01300000
*                                                                       01301000
*   /*****************************************************************/ 01302000
*   /*                                                               */ 01303000
*   /* IWMSET.1371: SET_SR_RESOURCE_STATE that indicates resource is */ 01304000
*   /* desired to be OFF                                             */ 01305000
*   /*                                                               */ 01306000
*   /*****************************************************************/ 01307000
*                                                                       01308000
*   DECLARE                                                             01309000
*     SET_SR_OFF FIXED(8) CONSTANT(8);                                  01310000
*                                                                       01311000
*   /*****************************************************************/ 01312000
*   /*                                                               */ 01313000
*   /* IWMSET.1403: SET_RES_STATE that indicates resource is OFF     */ 01314000
*   /*                                                               */ 01315000
*   /*****************************************************************/ 01316000
*                                                                       01317000
*   DECLARE                                                             01318000
*     SET_RES_OFF FIXED(8) CONSTANT(8);                                 01319000
*                                                                       01320000
*   /*****************************************************************/ 01321000
*   /*                                                               */ 01322000
*   /* IWMSET.1390: SET_SR_RESOURCE_STATE that is reserved           */ 01323000
*   /*                                                               */ 01324000
*   /*****************************************************************/ 01325000
*                                                                       01326000
*   DECLARE                                                             01327000
*     SET_SR_RESERVED FIXED(8) CONSTANT(12);                            01328000
*                                                                       01329000
*   /*****************************************************************/ 01330000
*   /*                                                               */ 01331000
*   /* IWMSET.1357: SET_RES_STATE that indicates resource is RESET   */ 01332000
*   /*                                                               */ 01333000
*   /*****************************************************************/ 01334000
*                                                                       01335000
*   DECLARE                                                             01336000
*     SET_RES_RESET FIXED(8) CONSTANT(12);                              01337000
*                                                                       01338000
*   /*****************************************************************/ 01339000
*   /*                                                               */ 01340000
*   /* IWMSET.1221: CBGEN control statements                         */ 01341000
*   /*                                                               */ 01342000
*   /*****************************************************************/ 01343000
*                                                                       01344000
*@LOGIC;                                                                01345000
*#PRAGMA TOOL=CBGEN.                                                    01346000
*#DELETE.IWMSET_ID                                                      01347000
*#DELETE.IWMSET_SYS_ID                                                  01348000
*#EPRAGMA.                                                              01349000
*@ENDLOGIC;                                                             01350000
*/* End of PL/X Source                                               */ 01351000
* %IF IWMSET_LIST = 'NO' !                                              01352000
*    ZCBPRINT = 'NO' %THEN                                              01353000
* %DO;                                                                  01354000
*   @LIST POP NOECHO;                                                   01355000
* %END;                                                                 01356000
* %END;                                                                 01357000
