*                                                                       00001000
* %DCL IWMSVPOL_INCLUDED CHAR EXT;                                      00002000
* %DEACTIVATE IWMSVPOL_INCLUDED;                                        00003000
* %IF IWMSVPOL_INCLUDED = '' %THEN                                      00004000
* %DO;                                                                  00005000
*/* Macro made bi-lingual on 22122. CBGEN compile date 21138         */ 00006000
*% /*                                                                   00007000
         MACRO                                                          00008000
         IWMSVPOL &DSECT=YES,&LIST=YES,&TITLE=YES,&SVPOLHD=YES,        *00009000
               &SVPOLSP=COND,&SVPOLWD=COND,&SVPOLCD=COND,&SVPOLPD=COND,*00010000
               &SVPOLRG=COND,&SVPOLRD=COND,&SVPOLMS=COND,&SVPOLSN=COND  00011000
         GBLC  &IWMSVPOL_INCLUDED                                       00012000
         GBLC  &ZCBPRINT                                                00013000
&IWMSVPOL_INCLUDED SETC 'YES'                                           00014000
         AIF   ('&LIST' EQ 'NONE').P0                                   00015000
         AIF   ('&TITLE' EQ 'NO').P5                                    00016000
 TITLE   'IWMSVPOL  - IWMPQRY Answer Area                         '     00017000
.P5      ANOP                                                           00018000
**/ ;                                                                   00019000
*/***START OF SPECIFICATIONS******************************************/ 00020000
*/*                                                                  */ 00021000
*/*01* Proprietary statement:                                        */ 00022000
*/*                                                                  */ 00023000
*/*      LICENSED MATERIALS - PROPERTY OF IBM                        */ 00024000
*/*      5650-ZOS COPYRIGHT IBM CORP. 1993, 2022                     */ 00025000
*/*                                                                  */ 00026000
*/*                                                                  */ 00027000
*/*01* External classification: GUPI                                 */ 00028000
*/*01* End of External classification                                */ 00029000
*/*                                                                  */ 00030000
*/*01* Status: HBB77D0                                               */ 00031000
*/*                                                                  */ 00032000
*/*01* Descriptive Name: IWMPQRY Answer Area                         */ 00033000
*/*                                                                  */ 00034000
*/*02*  Acronym: SVPOL                                               */ 00035000
*/*                                                                  */ 00036000
*/*01* CASE conversion:  This macro also exists as CASE part and is  */ 00037000
*/*                      used there during CASE gen.                 */ 00038000
*/*                      Though policy management has been           */ 00039000
*/*                      converted to PLX, this part is still        */ 00040000
*/*                      needed in CASE because it is referenced     */ 00041000
*/*                      outside policy management.                  */ 00042000
*/*                      Maintenance should be done in the PLX       */ 00043000
*/*                      part only. Only in the unlikely case that   */ 00044000
*/*                      extensions to the SVPOL are also required   */ 00045000
*/*                      outside policy management, they need to     */ 00046000
*/*                      be added in CASE likewise           @CCNV7A0*/ 00047000
*/*                                                                  */ 00048000
*/*01* Macro Name: IWMSVPOL                                          */ 00049000
*/*                                                                  */ 00050000
*/*01* DSECT Name: SVPOLHD                                           */ 00051000
*/*                SVPOLSP                                       @T1A*/ 00052000
*/*                SVPOLWD                                       @T1A*/ 00053000
*/*                SVPOLCD                                       @T1A*/ 00054000
*/*                SVPOLPD                                       @T1A*/ 00055000
*/*                SVPOLRG                                       @T1A*/ 00056000
*/*                SVPOLRD                                       @T1A*/ 00057000
*/*                SVPOLMS                                    @LEWMSM*/ 00058000
*/*                SVPOLSN                                    @LEWMSM*/ 00059000
*/*                                                                  */ 00060000
*/*01* Component: Workload Manager (SCWLM)                           */ 00061000
*/*                                                                  */ 00062000
*/*01* Eye-Catcher: SVPO                                             */ 00063000
*/*02*  Offset: 0                                                    */ 00064000
*/*02*  Length: CHAR(4)                                              */ 00065000
*/*                                                                  */ 00066000
*/*01* Storage Attributes:                                           */ 00067000
*/*02*  Subpool: Any                                                 */ 00068000
*/*02*  Key: 0                                                       */ 00069000
*/*02*  Residency: Above 16M line                                    */ 00070000
*/*                                                                  */ 00071000
*/*01* Size: Determined at run time                                  */ 00072000
*/*            SVPOLHD -- X'0050' bytes                              */ 00073000
*/*            SVPOLSP -- X'018C' bytes                              */ 00074000
*/*            SVPOLWD -- X'006C' bytes                              */ 00075000
*/*            SVPOLCD -- X'0090' bytes                              */ 00076000
*/*            SVPOLPD -- X'0014' bytes                              */ 00077000
*/*            SVPOLRG -- X'00A8' bytes                              */ 00078000
*/*            SVPOLRD -- X'0038' bytes                              */ 00079000
*/*            SVPOLMS -- X'01F8' bytes                              */ 00080000
*/*            SVPOLSN -- X'0008' bytes                              */ 00081000
*/*                                                                  */ 00082000
*/*01* Created by: IWMPQRY service                                   */ 00083000
*/*                                                                  */ 00084000
*/*01* Pointed to by: IWMPQRY parameter list                         */ 00085000
*/*                                                                  */ 00086000
*/*01* Serialization: None                                           */ 00087000
*/*                                                                  */ 00088000
*/*01* Function: Contains service policy information                 */ 00089000
*/*                                                                  */ 00090000
*/*              All timestamps are local time expressed in  @PQC0795*/ 00091000
*/*              STCK format.                                @PQC0795*/ 00092000
*/*                                                                  */ 00093000
*/*01* Restrictions:                                                 */ 00094000
*/*              None                                                */ 00095000
*/*                                                                  */ 00096000
*/*01* Method of Access:                                             */ 00097000
*/*                                                                  */ 00098000
*/*02*  ASM:                                                         */ 00099000
*/*          Specify: IWMSVPOL                                       */ 00100000
*/*                                                                  */ 00101000
*/*02*  PLX:                                                         */ 00102000
*/*                                                                  */ 00103000
*/*          %INCLUDE SYSLIB(IWMSVPOL)                               */ 00104000
*/*          Using on SVPOLHD gives addressability to the query      */ 00105000
*/*          answer area.                                            */ 00106000
*/*          Subsequent usings must be done to get addressability    */ 00107000
*/*          to the additional sections (DSECTs) as follows:         */ 00108000
*/*          DSECT    USING                                          */ 00109000
*/*          -----    -----                                          */ 00110000
*/*          SVPOLSP  A(SVPOLHD) + SVPOLDPO                          */ 00111000
*/*          SVPOLWD  A(SVPOLHD) + SVPOLDWO   (multiple)             */ 00112000
*/*          SVPOLCD  A(SVPOLHD) + SVPOLDCO   (multiple)             */ 00113000
*/*          SVPOLRG  A(SVPOLHD) + SVPOLDGO   (multiple)             */ 00114000
*/*          SVPOLRD  A(SVPOLHD) + SVPOLDRO   (multiple)             */ 00115000
*/*          SVPOLMS  A(SVPOLHD) + SVPOLEMO                          */ 00116000
*/*          SVPOLSN  A(SVPOLHD) + SVPOLESO   (multiple)             */ 00117000
*/*                                                                  */ 00118000
*/*          In cases where there are multiple elements in a         */ 00119000
*/*          section, subsequent elements can be found by adding     */ 00120000
*/*          the size of one element to the basing.                  */ 00121000
*/*                                                                  */ 00122000
*/*02*  VIA ATTRIBUTE:                                               */ 00123000
*/*                                                                  */ 00124000
*/*          Specify %SVPOLVIA = 'YES'                               */ 00125000
*/*          prior to %INCLUDE statement.                            */ 00126000
*/*          For VIA(0) specify %GLOBALARMODE='YES'                  */ 00127000
*/*                                                                  */ 00128000
*/*01* Notes:                                                        */ 00129000
*/*    The ASSEMBLER section of this macro is automatically  @LEWMSMA*/ 00130000
*/*    generated using CBGEN from the PLX source             @LEWMSMA*/ 00131000
*/*                                                                  */ 00132000
*/*                                                                  */ 00133000
*/*01* Change Activity:                                              */ 00134000
*/*    $L0= WLMI,    HBB5510, 930315,PD00BV: WLM Stage I             */ 00135000
*/*    $T1= PIG5048, HBB5510, 940113,PD00BV: OW01260: CDPI garbage   */ 00136000
*/*    $P1= PIG5510, HBB5510, 940915,PD72DB: OW08866                 */ 00137000
*/*                                          Migration support   @P1A*/ 00138000
*/*    $WLMPSTP,     HBB6603, 950612,PD88DB: Stored SQL procedures   */ 00139000
*/*                                                          @WLMCSTP*/ 00140000
*/*    $PQC1647      HBB6603  960627 PDB9DB: Support option for      */ 00141000
*/*                                          I/O execution delay     */ 00142000
*/*                                          and velocity    @PQC1647*/ 00143000
*/*    $PQC0795      HBB6603  960820 PDB9DB: Time stamps in local    */ 00144000
*/*                                          time            @PQC0795*/ 00145000
*/*    $PQC2520      HBB6603  960917 PDB9DB: Fix defaults    @PQC2520*/ 00146000
*/*    $WLMPBAT      JBB6604  960926 B9HAGD: Classify by priority    */ 00147000
*/*                                                          @WLMPBAT*/ 00148000
*/*    $WLMPACT      JBB6604  961018 B9HADA: Less disruptive policy  */ 00149000
*/*                                          activation.     @WLMPACT*/ 00150000
*/*    $WLMPSDC      HBB6606  970807 B9HAKP: Service Defn comments   */ 00151000
*/*                                                          @WLMPSDC*/ 00152000
*/*    $WLMPMQS      JBB6607  980417 B9HARF: Process Name            */ 00153000
*/*                                                          @WLMPMQS*/ 00154000
*/*    $WLMPTAL      JBB6607  980501 B9HAMS: Dynamic alias tuning    */ 00155000
*/*                                                          @WLMPTAL*/ 00156000
*/*    $OW39854      JBB6607  990914 PDVA:   Victor Alonzo           */ 00157000
*/*                                          Changed comment for     */ 00158000
*/*                                          SVPOLDAM to ON means    */ 00159000
*/*                                          available       @OW39854*/ 00160000
*/*    $WLMPGMY      HBB7703  991027 B9HAPC: Add functionality       */ 00161000
*/*                                          level 11        @WLMPGMY*/ 00162000
*/*    $WLMPGMC      HBB7703  991222 B9HAPC: Patrick Chan            */ 00163000
*/*                                          Add bit for CPU         */ 00164000
*/*                                          critical in Service     */ 00165000
*/*                                          Class           @WLMPGMC*/ 00166000
*/*    $WLMPGMS      HBB7703  000106 B9HAPC: Patrick Chan            */ 00167000
*/*                                          Add bit for Storage     */ 00168000
*/*                                          Protection in Service   */ 00169000
*/*                                          Class           @WLMPGMS*/ 00170000
*/*                                                                  */ 00171000
*/*    $OW43718      HBB7703  000328 PDKM:   Kevin McIlvain          */ 00172000
*/*                                          Added SVPOLSQN as a     */ 00173000
*/*                                          field to the structure  */ 00174000
*/*                                          SVPOLSEQ                */ 00175000
*/*    $OW44749      HBB7703  000616 PDKM:   Kevin McIlvain          */ 00176000
*/*                                          Removed changes added in*/ 00177000
*/*                                          OW43718                 */ 00178000
*/*    $WLMPLNX      HBB7705  001012 B9HAPC: Patrick Chan            */ 00179000
*/*                                          Add LEVEL013 for LINUX  */ 00180000
*/*                                          support.        @WLMPLNX*/ 00181000
*/*    $WLMPLNX      HBB7705  001204 B9HAPC: Patrick Chan            */ 00182000
*/*                                          Add SVPOLSH2 for LINUX  */ 00183000
*/*                                          support.        @WLMPLNX*/ 00184000
*/*    $WLMPESC      HBB7730  050919 3141MG: Matthias Gubitz         */ 00185000
*/*                                          Service class           */ 00186000
*/*                                          correlation     @WLMPESC*/ 00187000
*/*    $WLMPEEG      HBB7730  050505 3241AW: Adrian Wible            */ 00188000
*/*                                          EWLM Process Entitlement*/ 00189000
*/*                                          Groups                  */ 00190000
*/*    $ME06257      HBB7730  060321 3241GB: Georg Bosch             */ 00191000
*/*                                          Change wording for LPAR */ 00192000
*/*                                          share resource groups   */ 00193000
*/*    $LEWLTM       HBB7750  060607 3241MB: Miklos Berenyi          */ 00194000
*/*                                          EWLM E2E Transaction    */ 00195000
*/*                                          Management support      */ 00196000
*/*    $LPOLMP       HBB7750  070827 3241MB: Miklos Berenyi          */ 00197000
*/*                                          XML policy mapping      */ 00198000
*/*    $LEWMSM       HBB7760  080320 3241HB: Helmut Belzner          */ 00199000
*/*                                          EWLM managed server     */ 00200000
*/*                                          integration             */ 00201000
*/*    $ME14587      HBB7760  080923 3241HB: Helmut Belzner          */ 00202000
*/*                                          IRASAMSU/IRAPAGBS:      */ 00203000
*/*                                          S015F/256 when running  */ 00204000
*/*                                          with IA1                */ 00205000
*/*    $ME17808      HBB7770  091126 3241MG: Matthias Gubitz         */ 00206000
*/*                                          Add LEVEL025 for GPMP   */ 00207000
*/*                                          settings                */ 00208000
*/*    $CASECNV      HBB7780  101011 3241HB: Helmut Belzner          */ 00209000
*/*                                          CASE conversion         */ 00210000
*/*                                          Constants of CASE part  */ 00211000
*/*                                          are added to PLX part.  */ 00212000
*/*    $OA30928      HBB7780  101014 3241MG: Matthias Gubitz         */ 00213000
*/*                                          Reword GPMP section     */ 00214000
*/*    $LSPMGR       HBB7790  110307 3241IS: Irene Stahl             */ 00215000
*/*                                          SPM groups              */ 00216000
*/*    $LIOMGT       HBB7790  110705 3241MG: Matthias Gubitz         */ 00217000
*/*                                          I/O priority group      */ 00218000
*/*    $OA41645      HBB7790  130320 3241MG: Matthias Gubitz         */ 00219000
*/*                                          I/O priority group      */ 00220000
*/*    $CCNV7A0      HBB77A0  140110 3241IS: Irene Stahl             */ 00221000
*/*                                          CASE conversion cleanup */ 00222000
*/*    $OA47042      HBB7790  150608 3241IS: Irene Stahl             */ 00223000
*/*                                          Special reporting       */ 00224000
*/*    $LRESPT       HBB77B0  160122 3241MG: Matthias Gubitz         */ 00225000
*/*                                          Shorter response time   */ 00226000
*/*                                          goal                    */ 00227000
*/*    $OA50845      HBB7790  160509 3241IS: Irene Stahl             */ 00228000
*/*                                          Force "Honorpriority"   */ 00229000
*/*                                          to NO for specialty     */ 00230000
*/*                                          processors              */ 00231000
*/*                           160623 3241IS: Memory capping          */ 00232000
*/*    $OA52312      HBB77B0  170110 3241IS: Irene Stahl     @LWBGRP */ 00233000
*/*                                          Workload billing groups */ 00234000
*/*    $LHWCON       HBB77C0  171219 3241IS: Irene Stahl     @LHWCON */ 00235000
*/*                                          zCBP support            */ 00236000
*/*    $LCOEFF       HBB77D0  191203 3241TP: Toni Pohl               */ 00237000
*/*                                          Service Coefficient     */ 00238000
*/*                                          Removal                 */ 00239000
*/*    $LBOOS3       HBB77D0  210111 3241IS: Irene Stahl     @OA60841*/ 00240000
*/*                                          System Recovery Boost   */ 00241000
*/*                                          stage 3                 */ 00242000
*/***END OF SPECIFICATIONS********************************************/ 00243000
*% /*                                                                   00244000
.P0      ANOP                                                           00245000
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 00246000
         AIF   ('&LIST' EQ 'YES').P2                                    00247000
.P1      ANOP                                                           00248000
         PUSH  PRINT                                                    00249000
         PRINT OFF                                                      00250000
.P2      ANOP                                                           00251000
         AIF   ('&SVPOLHD' EQ 'NO').L0002                               00252000
         AIF   ('&DSECT' EQ 'YES').L0003                                00253000
         AIF   ('&SVPOLHD' NE 'YES').L0002                              00254000
.L0003   ANOP                                                           00255000
*                                                                       00256000
*      ***************************************************************  00257000
*      *                                                             *  00258000
*      * Service policy header information                           *  00259000
*      *                                                             *  00260000
*      ***************************************************************  00261000
*                                                                       00262000
*                                                                       00263000
         AIF   ('&DSECT' EQ 'YES').L0004                                00264000
SVPOLHD  DS    0D        IWMPQRY Answer area                            00265000
         AGO   .L0005                                                   00266000
.L0004   ANOP                                                           00267000
SVPOLHD  DSECT           IWMPQRY Answer area                            00268000
.L0005   ANOP                                                           00269000
SVPOLNAM DS    CL4       Eyecatcher - SVPO                              00270000
SVPOLLVL DS    X         Functionality level of the SVPOL. The         *00271000
                         functionality level defines the highest level *00272000
                         of the WLM function that exists in the SVPOL.  00273000
SVPOLWVN DS    X         WLM version number                             00274000
SVPOLDIL DS    H         Length of header section                       00275000
SVPOLDLE DS    F         Total length of the active service policy     *00276000
                         data structure                                 00277000
SVPOLDPO DS    F         Offset to the service policy definition       *00278000
                         section                                        00279000
SVPOLDPL DS    H         Length of the policy entry in the policy      *00280000
                         section                                        00281000
SVPOLRS2 DS    H         Reserved                                       00282000
SVPOLDWO DS    F         Offset to the workload definition section      00283000
SVPOLDWC DS    H         Number of workload entries in the workload    *00284000
                         definition section                             00285000
SVPOLDWL DS    H         Length of each workload entry                  00286000
SVPOLDCO DS    F         Offset to the service class definition        *00287000
                         section                                        00288000
SVPOLDCC DS    H         Number of service class entries in the        *00289000
                         service class definition section               00290000
SVPOLDCL DS    H         Length of each service class definition entry  00291000
SVPOLDZO DS    F         Offset of service class period entries         00292000
SVPOLDZC DS    H         Number of service class periods                00293000
SVPOLDZL DS    H         Length of each service class period entry      00294000
SVPOLDRO DS    F         Offset to the report class definition section  00295000
SVPOLDRC DS    H         Number of report class entries in the report  *00296000
                         class definition section                       00297000
SVPOLDRL DS    H         Length of each report class definition entry   00298000
SVPOLDGO DS    F         Offset to the resource group definition       *00299000
                         section                                        00300000
SVPOLDGC DS    H         Number of resource group entries in the       *00301000
                         resource group definition                      00302000
SVPOLDGL DS    H         Length of each resource group definition      *00303000
                         entry                                          00304000
SVPOLFL1 DS    B         boolean byte flag                              00305000
*  Bit definitions:                                                     00306000
SVPOLSH2 EQU   X'80'     Indicate whether SYSH contain rule, servlce   *00307000
                         class or report class                          00308000
SVPOLEWL EQU   X'40'     Indicate whether policy contains EWLM policy  *00309000
                         element                                        00310000
SVPOLEWM EQU   X'20'     Indicate whether policy contains EWLM managed *00311000
                         server configuration                           00312000
SVPOLEWU EQU   X'10'     Indicator that contained EWLM policy elements *00313000
                         has changed                                    00314000
SVPOLRS3 DS    BL3       Reserved                                       00315000
*                                                                       00316000
*      ***************************************************************  00317000
*      *                                                             *  00318000
*      * The following two triplets were introduced with z/OS V1R11  *  00319000
*      * (LEVEL023). Triplets may not be present and must not be     *  00320000
*      * accessed when SVPOLLVL (functionality level) is less than   *  00321000
*      * 23.                                                            00322000
*      *                                                             *  00323000
*      ***************************************************************  00324000
*                                                                       00325000
*                                                                       00326000
SVPOLEMO DS    F         Offset to Guest platform management provider  *00327000
                         (GPMP) settings                                00328000
SVPOLEMC DS    H         Number of GPMP settings entries                00329000
SVPOLEML DS    H         Length of GPMP settings entry                  00330000
SVPOLESO DS    F         Offset to system names to be excluded from    *00331000
                         GPMP activation                                00332000
SVPOLESC DS    H         Number of system names to be excluded from    *00333000
                         GPMP activation                                00334000
SVPOLESL DS    H         Length of system name to be excluded from     *00335000
                         GPMP activation                                00336000
SVPOLHD_LEN EQU *-SVPOLHD                                               00337000
.L0002   ANOP                                                           00338000
         AIF   ('&SVPOLSP' EQ 'NO').L0006                               00339000
         AIF   ('&DSECT' EQ 'YES').L0007                                00340000
         AIF   ('&SVPOLSP' NE 'YES').L0006                              00341000
.L0007   ANOP                                                           00342000
*                                                                       00343000
*      ***************************************************************  00344000
*      *                                                             *  00345000
*      * Service policy information                                  *  00346000
*      *                                                             *  00347000
*      ***************************************************************  00348000
*                                                                       00349000
*                                                                       00350000
         AIF   ('&DSECT' EQ 'YES').L0008                                00351000
SVPOLSP  DS    0D        Service policy section                         00352000
         AGO   .L0009                                                   00353000
.L0008   ANOP                                                           00354000
SVPOLSP  DSECT           Service policy section                         00355000
.L0009   ANOP                                                           00356000
SVPOLNSP DS    CL8       Service policy name                            00357000
SVPOLDSP DS    CL32      Service policy description                     00358000
SVPOLTPA DS    CL8       Time/date (STCK format) of policy activation   00359000
SVPOLIPU DS    CL8       Userid of the system operator or service      *00360000
                         administrator who activated the service       *00361000
                         policy                                         00362000
SVPOLSNA DS    CL8       Name of the system on which policy activation *00363000
                         was initiated                                  00364000
SVPOLSEQ DS    F         Classification sequence number Removed        *00365000
                         svpolsqn added in OW43718.                     00366000
SVPOLASN DS    F         Activation sequence number                     00367000
SVPOLSVD DS    CL32      SVDEF ID information (next 4 fields) of       *00368000
                         service definition from which this policy was *00369000
                         extracted                                      00370000
         ORG   SVPOLSVD                                                 00371000
SVPOLIDN DS    CL8       Name of the service definition from which the *00372000
                         service policy was extracted                   00373000
SVPOLTDI DS    CL8       Time/date (STCK format) that the service      *00374000
                         definition was installed                       00375000
SVPOLIDU DS    CL8       Userid of the service administrator who       *00376000
                         installed the service definition               00377000
SVPOLIDS DS    CL8       Name of the system on which the service       *00378000
                         definition was installed                       00379000
SVPOLIDD DS    CL32      Description of service definition from which  *00380000
                         the service policy was extracted               00381000
SVPOLCPU DS    F         System pre-set CPU service coefficient        *00382000
                         (CPU=1*10000) - the number by which           *00383000
                         accumulated CPU service units will be         *00384000
                         multiplied (weighted)                          00385000
SVPOLIOC DS    F         System pre-set I/O service coefficient        *00386000
                         (IOC=0)                                        00387000
SVPOLMSO DS    F         System pre-set storage service coefficient    *00388000
                         (MSO=0)                                        00389000
SVPOLSRB DS    F         System pre-set SRB service coefficient        *00390000
                         (SRB=1*10000) - the number by which           *00391000
                         accumulated SRB service units will be         *00392000
                         multiplied (weighted)                          00393000
SVPOLECP DS    CL4       EBCDIC representation of CPU service          *00394000
                         coefficient                                    00395000
SVPOLEIO DS    CL4       EBCDIC representation of I/O service          *00396000
                         coefficient                                    00397000
SVPOLEMS DS    CL8       EBCDIC representation of Storage service      *00398000
                         coefficient                                    00399000
SVPOLESR DS    CL4       EBCDIC representation of SRB service          *00400000
                         coefficient                                    00401000
SVPOLFL2 DS    B         SVDEFFL2                                       00402000
*  Bit definitions:                                                     00403000
SVPOLIOM EQU   X'80'     When set indicates that we should include the *00404000
                         I/O delays in the execution velocity           00405000
SVPOLDAM EQU   X'40'     When set indicates dynamic alias tuning       *00406000
                         available                                      00407000
SVPOLIOE EQU   X'20'     When set indicates I/O priority groups are    *00408000
                         enabled                                        00409000
SVPOLDGM EQU   X'10'     When set indicates that Discretionary Goal    *00410000
                         Management is deactivated                      00411000
SVPOLRS5 DS    CL3       Reserved                                       00412000
SVPOLENM DS    CL64      EWLM Policy Name (EBCDIC)                      00413000
SVPOLEVR DS    CL64      EWLM Policy Version (EBCDIC)                   00414000
SVPOLEPU DS    CL16      EWLM Policy UUID                               00415000
SVPOLEMU DS    CL16      EWLM Mgmt Server UUID                          00416000
SVPOLESQ DS    H         EWLM Policy Seq. Num.                          00417000
SVPOLEPI DS    H         EWLM Policy ID                                 00418000
SVPOLESI DS    H         EWLM Server ID                                 00419000
SVPOLENW DS    H         Number of EWLM Workloads                       00420000
SVPOLENS DS    H         Number of EWLM Service Classes                 00421000
SVPOLENP DS    H         Number of EWLM Service Class Periods           00422000
SVPOLEAT DS    CL8       EWLM policy activation time. Microseconds     *00423000
                         since 1.Jan.1970                               00424000
SVPOLCPG DS    CL40      Codepage used for service definition.          00425000
SVPOLSP_LEN EQU *-SVPOLSP                                               00426000
.L0006   ANOP                                                           00427000
         AIF   ('&SVPOLWD' EQ 'NO').L000A                               00428000
         AIF   ('&DSECT' EQ 'YES').L000B                                00429000
         AIF   ('&SVPOLWD' NE 'YES').L000A                              00430000
.L000B   ANOP                                                           00431000
*                                                                       00432000
*      ***************************************************************  00433000
*      *                                                             *  00434000
*      * Workload information                                        *  00435000
*      *                                                             *  00436000
*      ***************************************************************  00437000
*                                                                       00438000
*                                                                       00439000
         AIF   ('&DSECT' EQ 'YES').L000C                                00440000
SVPOLWD  DS    0X        Workload definition section                    00441000
         AGO   .L000D                                                   00442000
.L000C   ANOP                                                           00443000
SVPOLWD  DSECT           Workload definition section                    00444000
.L000D   ANOP                                                           00445000
SVPOLWNM DS    CL8       Workload name                                  00446000
SVPOLWDE DS    CL32      Workload description                           00447000
SVPOLWEN DS    CL64      EWLM Workload name (EBCDIC)                    00448000
SVPOLWFL DS    B         boolean byte flag                              00449000
*  Bit definitions:                                                     00450000
SVPOLWEW EQU   X'80'     Indicate whether workload is an EWLM workload  00451000
SVPOLWRS DS    BL3       Reserved                                       00452000
SVPOLWD_LEN EQU *-SVPOLWD                                               00453000
.L000A   ANOP                                                           00454000
         AIF   ('&SVPOLCD' EQ 'NO').L000E                               00455000
         AIF   ('&DSECT' EQ 'YES').L000F                                00456000
         AIF   ('&SVPOLCD' NE 'YES').L000E                              00457000
.L000F   ANOP                                                           00458000
*                                                                       00459000
*      ***************************************************************  00460000
*      *                                                             *  00461000
*      * Service class information                                   *  00462000
*      *                                                             *  00463000
*      ***************************************************************  00464000
*                                                                       00465000
*                                                                       00466000
         AIF   ('&DSECT' EQ 'YES').L0010                                00467000
SVPOLCD  DS    0F        Service class definition section               00468000
         AGO   .L0011                                                   00469000
.L0010   ANOP                                                           00470000
SVPOLCD  DSECT           Service class definition section               00471000
.L0011   ANOP                                                           00472000
SVPOLCNM DS    CL8       Service class name                             00473000
SVPOLCDE DS    CL32      Service class description                      00474000
SVPOLCWN DS    CL8       Name of the workload this service class is    *00475000
                         associated with                                00476000
SVPOLCRN DS    CL8       Name of the resource group this service class *00477000
                         is associated with - blanks if no resource    *00478000
                         group association                              00479000
SVPOLCPO DS    F         Offset of service class period entries for    *00480000
                         this service class                             00481000
SVPOLCPN DS    H         Number of service class periods for this      *00482000
                         service class                                  00483000
SVPOLCFL DS    BL2       Class flags                                    00484000
         ORG   SVPOLCFL                                                 00485000
SVPOLCF1 DS    B         Flags byte 1, required for ASM users           00486000
*  Bit definitions:                                                     00487000
SVPOLCDH EQU   X'80'     Indicate class histories should be discarded   00488000
SVPOLCPC EQU   X'40'     Indicator for CPU critical                     00489000
SVPOLSTR EQU   X'20'     Indicator for Storage Protection               00490000
SVPOLTRA EQU   X'10'     Indicator for whether this service class is   *00491000
                         used in any transaction subsystem type         00492000
SVPOLADR EQU   X'08'     Indicator for whether this service class is   *00493000
                         used in any address space subsystem type       00494000
SVPOLENC EQU   X'04'     Indicator for whether this service class is   *00495000
                         used in any enclave subsystem type             00496000
SVPOLSYH EQU   X'02'     Indicator for whether this service class is   *00497000
                         used in non- MVS logical partitions ie. SYSH   00498000
SVPOLIPG EQU   X'01'     Indicator for I/O priority group               00499000
SVPOLCF2 DS    B         Flags byte 2, required for ASM users           00500000
*  Bit definitions:                                                     00501000
SVPOL_INELIGHONORPRIORITY EQU X'80' Service Class Honor Priority       *00502000
                         attribute. When on, specialty engine eligible *00503000
                         work in this service class will not be        *00504000
                         offloaded to CPs for help processing           00505000
         ORG   SVPOLCFL+2                                               00506000
SVPOLCGI DS    F         Resource group index - the index of the       *00507000
                         resource group entry in SVPOL of the resource *00508000
                         group to which this service class belongs      00509000
SVPOLCWI DS    F         Workload index - the index of the workload    *00510000
                         entry in SVPOL of the workload to which this  *00511000
                         service class belongs                          00512000
SVPOLCEN DS    CL64      EWLM Service Class name (EBCDIC)               00513000
         DS    CL2       Reserved                                       00514000
SVPOLCEK DS    H         EWLM Service Class key                         00515000
SVPOLCEF DS    B         boolean byte flag                              00516000
*  Bit definitions:                                                     00517000
SVPOLCEW EQU   X'80'     Indicate whether service class is an EWLM     *00518000
                         workload                                       00519000
SVPOLCRS DS    B         Reserved                                       00520000
SVPOLCSI DS    H         EWLM Server ID                                 00521000
SVPOLCD_LEN EQU *-SVPOLCD                                               00522000
.L000E   ANOP                                                           00523000
         AIF   ('&SVPOLPD' EQ 'NO').L0012                               00524000
         AIF   ('&DSECT' EQ 'YES').L0013                                00525000
         AIF   ('&SVPOLPD' NE 'YES').L0012                              00526000
.L0013   ANOP                                                           00527000
*                                                                       00528000
*      ***************************************************************  00529000
*      *                                                             *  00530000
*      * Service class period information                            *  00531000
*      *                                                             *  00532000
*      ***************************************************************  00533000
*                                                                       00534000
*                                                                       00535000
         AIF   ('&DSECT' EQ 'YES').L0014                                00536000
SVPOLPD  DS    0F        Service class period definition information    00537000
         AGO   .L0015                                                   00538000
.L0014   ANOP                                                           00539000
SVPOLPD  DSECT           Service class period definition information    00540000
.L0015   ANOP                                                           00541000
SVPOLTYP DS    BL4       Goal type indicators - mutually exclusive      00542000
*  Bit definitions:                                                     00543000
SVPOLPRC EQU   X'80'     Percentile response time goal                  00544000
SVPOLAVG EQU   X'40'     Average response time goal                     00545000
SVPOLVEL EQU   X'20'     Velocity goal                                  00546000
SVPOLDSC EQU   X'10'     Discretionary goal                             00547000
SVPOLSTM EQU   X'08'     System goal                                    00548000
SVPOLTFL DS    B         boolean byte flag                              00549000
*  Bit definitions:                                                     00550000
SVPOLTEW EQU   X'80'     Goal derived from EWLM policy                  00551000
SVPOLRTU DS    X         Response time unit indicator indicating the   *00552000
                         units in which SVPOLVAL is expressed. See     *00553000
                         constants SVPOLRT* for values                  00554000
SVPOLPER DS    H         Goal percentile value                          00555000
SVPOLIMP DS    H         Importance level ranging from 1 to 5 where 1  *00556000
                         is most important                              00557000
SVPOLRS8 DS    H         Reserved                                       00558000
SVPOLVAL DS    F         Response time goal or velocity goal. Zero if  *00559000
                         discretionary or system goal or no goal       *00560000
                         defined.                                       00561000
SVPOLDUR DS    F         Service class period duration in service      *00562000
                         units, or zero for last period                 00563000
SVPOLPD_LEN EQU *-SVPOLPD                                               00564000
.L0012   ANOP                                                           00565000
         AIF   ('&SVPOLRG' EQ 'NO').L0016                               00566000
         AIF   ('&DSECT' EQ 'YES').L0017                                00567000
         AIF   ('&SVPOLRG' NE 'YES').L0016                              00568000
.L0017   ANOP                                                           00569000
*                                                                       00570000
*      ***************************************************************  00571000
*      *                                                             *  00572000
*      * Resource group information                                  *  00573000
*      *                                                             *  00574000
*      ***************************************************************  00575000
*                                                                       00576000
*                                                                       00577000
         AIF   ('&DSECT' EQ 'YES').L0018                                00578000
SVPOLRG  DS    0F        Resource group definition section              00579000
         AGO   .L0019                                                   00580000
.L0018   ANOP                                                           00581000
SVPOLRG  DSECT           Resource group definition section              00582000
.L0019   ANOP                                                           00583000
SVPOLGNM DS    CL8       Resource group name                            00584000
SVPOLGDE DS    CL32      Resource group description                     00585000
SVPOLGMN DS    F         If SVPOLMNS = 1, this field contains          *00586000
                         information about the minimum capacity of the *00587000
                         resource group. (a) If all SVPOLGPV / GPC /   *00588000
                         GMS are '0'b, the value in SVPOLGMN is in     *00589000
                         unweighted CPU service units per second. In   *00590000
                         this case the scope of the resource group and *00591000
                         the minimum value is sysplex-wide (b) If      *00592000
                         SVPOLGPV = '1'B the value is in percentage of *00593000
                         the LPAR share. See description of SVPOLGPV   *00594000
                         below. (c) If SVPOLGPC = '1'B the value is in  00595000
*                        percentage of a single CP capacity. See       *00596000
                         descr. of SVPOLGPC below. @ME06257. (d) If    *00597000
                         SVPOLGMS = '1'B the value is in MSU/h. See    *00598000
                         descr. of SVPOLGMS below.                      00599000
SVPOLGMX DS    F         If SVPOLMXS = 1, this field contains          *00600000
                         information about the maximum capacity of the *00601000
                         resource group. (a) If all SVPOLGPV / GPC /   *00602000
                         GMS are '0'b, the value in SVPOLGMX is in     *00603000
                         unweighted CPU service units per second. In   *00604000
                         this case the scope of the resource group and *00605000
                         the maximum value is sysplex-wide. (b) If     *00606000
                         SVPOLGPV = '1'B the value is in percentage of *00607000
                         the LPAR share. See description of SVPOLGPV   *00608000
                         below. (c) If SVPOLGPC = '1'B the value is in  00609000
*                        percentage of a single CP capacity. See       *00610000
                         descr. of SVPOLGPC below. @ME06257. (d) If    *00611000
                         SVPOLGMS = '1'B the value is in MSU/h. See    *00612000
                         descr. of SVPOLGMS below.                      00613000
SVPOLGLT DS    BL4       Policy level Indicators                        00614000
*  Bit definitions:                                                     00615000
SVPOLMXS EQU   X'80'     Maximum capacity was specified                 00616000
SVPOLMNS EQU   X'40'     Minimum capacity was specified                 00617000
SVPOLGSD EQU   X'20'     Internally used only                           00618000
SVPOLGPV EQU   X'10'     The specification of the min (SVPOLGMN) and   *00619000
                         the max(SVPOLGMX) capacity is in percentage   *00620000
                         of the LPAR share rather than in service      *00621000
                         units. The scope of the RG is system-wide     *00622000
                         rather than sysplex-wide                       00623000
SVPOLGPC EQU   X'08'     The specification of the min (SVPOLGMN) and   *00624000
                         the max(SVPOLGMX) capacity is in percentage   *00625000
                         of a single processor (CP) capacity = % of    *00626000
                         RMCTADJC. The scope of the RG is system-wide  *00627000
                         rather than sysplex-wide                       00628000
SVPOLMLS EQU   X'04'     Memory limit was specified                     00629000
SVPOLISP EQU   X'02'     Include Specialty Processor Consumption was   *00630000
                         specified                                      00631000
SVPOLGMS EQU   X'01'     The specification of the min (SVPOLGMN) and   *00632000
                         the max(SVPOLGMX) capacity is in MSU/h. The   *00633000
                         scope of the RG is sysplex-wide                00634000
SVPOL_MEMORYLIMIT DS F   Maximum memory limit in GB                     00635000
SVPOLGL1 DS    BL4       Resource group level indicators                00636000
*  Bit definitions:                                                     00637000
SVPOLTRG EQU   X'80'     This is a Tenant Resource Group                00638000
SVPOLTRG_HWCONTAINER EQU X'40' This is a Tenant Resource Group which   *00639000
                         is enabled for zCBP.                           00640000
         DS    CL4       Reserved to align to DWORD boundary            00641000
SVPOL_TENANTID DS CL8    ID of associated Tenant                        00642000
SVPOL_TENANTNAME DS CL32 Name of associated Tenant                      00643000
SVPOL_TRGSOLUTIONID DS CL64 Solution Id of the Tenant Resource Group    00644000
SVPOLRG_LEN EQU *-SVPOLRG                                               00645000
.L0016   ANOP                                                           00646000
         AIF   ('&SVPOLRD' EQ 'NO').L001A                               00647000
         AIF   ('&DSECT' EQ 'YES').L001B                                00648000
         AIF   ('&SVPOLRD' NE 'YES').L001A                              00649000
.L001B   ANOP                                                           00650000
*                                                                       00651000
*      ***************************************************************  00652000
*      *                                                             *  00653000
*      * Report class information                                    *  00654000
*      *                                                             *  00655000
*      ***************************************************************  00656000
*                                                                       00657000
*                                                                       00658000
         AIF   ('&DSECT' EQ 'YES').L001C                                00659000
SVPOLRD  DS    0F        report class definition section                00660000
         AGO   .L001D                                                   00661000
.L001C   ANOP                                                           00662000
SVPOLRD  DSECT           report class definition section                00663000
.L001D   ANOP                                                           00664000
SVPOLRNM DS    CL8       report class name                              00665000
SVPOLRDE DS    CL32      report class description                       00666000
SVPOLRFL DS    BL4       Indicators                                     00667000
*  Bit definitions:                                                     00668000
SVPOLTRC EQU   X'80'     This is a Tenant Report Class                  00669000
SVPOL_TRG_INDEX DS F     Resource group index - the index of the       *00670000
                         Tenant Resource Group entry in SVPOL to which *00671000
                         this Tenant Report Class belongs. Only set if *00672000
                         this is a Tenant Report Class                  00673000
SVPOL_TRG_NAME DS CL8    Name of associated Tenant Resource Group.     *00674000
                         Only set if this is a Tenant Report Class      00675000
SVPOLRD_LEN EQU *-SVPOLRD                                               00676000
.L001A   ANOP                                                           00677000
         AIF   ('&SVPOLMS' EQ 'NO').L001E                               00678000
         AIF   ('&DSECT' EQ 'YES').L001F                                00679000
         AIF   ('&SVPOLMS' NE 'YES').L001E                              00680000
.L001F   ANOP                                                           00681000
*                                                                       00682000
*      ***************************************************************  00683000
*      *                                                             *  00684000
*      * Guest platform management provider (GPMP) settings          *  00685000
*      *                                                             *  00686000
*      ***************************************************************  00687000
*                                                                       00688000
*                                                                       00689000
         AIF   ('&DSECT' EQ 'YES').L0020                                00690000
SVPOLMS  DS    0D        GPMP settings                                  00691000
         AGO   .L0021                                                   00692000
.L0020   ANOP                                                           00693000
SVPOLMS  DSECT           GPMP settings                                  00694000
.L0021   ANOP                                                           00695000
SVPOLEFL DS    B         Flags                                          00696000
*  Bit definitions:                                                     00697000
SVPOLEAY EQU   X'80'     GPMP should be activated                       00698000
SVPOLALS EQU   X'40'     Reserved                                       00699000
SVPOLALC EQU   X'20'     Reserved                                       00700000
         DS    BL3       Reserved                                       00701000
SVPOLEDP DS    F         Reserved                                       00702000
SVPOLEDN DS    CL256     Reserved                                       00703000
SVPOLSKN DS    CL240     Reserved                                       00704000
SVPOLMS_LEN EQU *-SVPOLMS                                               00705000
.L001E   ANOP                                                           00706000
         AIF   ('&SVPOLSN' EQ 'NO').L0022                               00707000
         AIF   ('&DSECT' EQ 'YES').L0023                                00708000
         AIF   ('&SVPOLSN' NE 'YES').L0022                              00709000
.L0023   ANOP                                                           00710000
*                                                                       00711000
*      ***************************************************************  00712000
*      *                                                             *  00713000
*      * Guest platform management provider (GPMP) settings: Names of*  00714000
*      * systems to be excluded                                      *  00715000
*      *                                                             *  00716000
*      ***************************************************************  00717000
*                                                                       00718000
*                                                                       00719000
         AIF   ('&DSECT' EQ 'YES').L0024                                00720000
SVPOLSN  DS    0X        Names of systems to be excluded                00721000
         AGO   .L0025                                                   00722000
.L0024   ANOP                                                           00723000
SVPOLSN  DSECT           Names of systems to be excluded                00724000
.L0025   ANOP                                                           00725000
SVPOLSYN DS    CL8       Name of host system to be excluded             00726000
*                                                                       00727000
*    *****************************************************************  00728000
*    *                                                               *  00729000
*    * Constants                                                     *  00730000
*    *                                                               *  00731000
*    *****************************************************************  00732000
*                                                                       00733000
*                                                                       00734000
SVPOL_RTU_MS EQU 1       SVPOLRTU value indicating that SVPOLVAL value *00735000
                         is expressed in milliseconds                   00736000
SVPOL_RTU_SECOND EQU 2   SVPOLRTU value indicating that SVPOLVAL value *00737000
                         is expressed in seconds                        00738000
SVPOL_RTU_MINUTE EQU 3   SVPOLRTU value indicating that SVPOLVAL value *00739000
                         is expressed in minutes                        00740000
SVPOL_RTU_HOUR EQU 4     SVPOLRTU value indicating that SVPOLVAL value *00741000
                         is expressed in hours                          00742000
SVPOL_NAME EQU C'SVPO'   'SVPO' acronym                                 00743000
SVPOL_LEVEL001 EQU 1     Functionality level introduced by WLM in      *00744000
                         SP510.                                         00745000
SVPOL_VER510 EQU 1       WLM SP510 version                              00746000
SVPOL_LEVEL002 EQU 2     Functionality level introduced by WLM in      *00747000
                         SP520.                                         00748000
SVPOL_VER520 EQU 2       WLM SP520 version                              00749000
SVPOL_LEVEL003 EQU 3     Functionality level introduced by WLM in      *00750000
                         OS/390 V1R3                                    00751000
SVPOL_VER530 EQU 3       WLM version number for OS/390 V1R3             00752000
SVPOL_LEVEL004 EQU 4     Functionality level introduced by WLM in      *00753000
                         OS/390 V2R4                                    00754000
SVPOL_VER604 EQU 4       WLM version number for OS/390 V2R4             00755000
SVPOL_LEVEL005 EQU 5     Functionality level introduced by WLM in      *00756000
                         OS/390 V2R5                                    00757000
SVPOL_VER605 EQU 5       WLM version number for OS/390 V2R5             00758000
SVPOL_LEVEL006 EQU 6     Functionality level introduced by WLM in      *00759000
                         OS/390 V2R6                                    00760000
SVPOL_VER606 EQU 6       WLM version number for OS/390 V2R6             00761000
SVPOL_LEVEL007 EQU 7     Functionality level introduced by WLM in      *00762000
                         OS/390 V2R7                                    00763000
SVPOL_VER607 EQU 7       WLM version number for OS/390 V2R7             00764000
SVPOL_LEVEL008 EQU 8     Functionality level introduced by WLM in      *00765000
                         OS/390 V2R7                                    00766000
SVPOL_VER608 EQU 8       WLM version number for OS/390 V2R7             00767000
SVPOL_LEVEL009 EQU 9     Functionality level reserved for WLM in       *00768000
                         OS/390 V2R8                                    00769000
SVPOL_RESERVED_R08 EQU 9 WLM version number reservice for WLM in       *00770000
                         OS/390 V2R8                                    00771000
SVPOL_LEVEL010 EQU 10    Functionality level reserved for WLM in       *00772000
                         OS/390 V2R9                                    00773000
SVPOL_RESERVED_R09 EQU 10 WLM version number reserved for WLM in       *00774000
                         OS/390 V2R9                                    00775000
SVPOL_LEVEL011 EQU 11    Functionality level introduced by WLM in      *00776000
                         OS/390 V2R10                                   00777000
SVPOL_VER703 EQU 11      WLM version number for OS/390 V2R10            00778000
SVPOL_LEVEL012 EQU 12    Functionality level reserved for WLM in       *00779000
                         OS/390 V2R11                                   00780000
SVPOL_RESERVED_R11 EQU 12 WLM version number reserved for WLM in       *00781000
                         OS/390 V2R11                                   00782000
SVPOL_LEVEL013 EQU 13    Functionality level introduced by WLM in      *00783000
                         OS/390 V2R12                                   00784000
SVPOL_VER705 EQU 13      WLM version number for OS/390 V2R12            00785000
SVPOL_LEVEL014 EQU 14    Functionality level reserved for WLM in z/OS  *00786000
                         V1R3                                           00787000
SVPOL_RESERVED_R13 EQU 14 WLM version number for z/OS V1R3              00788000
SVPOL_LEVEL015 EQU 15    Functionality level reserved for WLM in z/OS  *00789000
                         V1R4                                           00790000
SVPOL_RESERVED_R14 EQU 15 WLM version number for z/OS V1R4              00791000
SVPOL_LEVEL016 EQU 16    Functionality level reserved for WLM in z/OS  *00792000
                         V1R5                                           00793000
SVPOL_RESERVED_R15 EQU 16 WLM version number for z/OS V1R5              00794000
SVPOL_LEVEL017 EQU 17    Functionality level introduced in WLM for     *00795000
                         z/OS V1R6                                      00796000
SVPOL_VER709 EQU 17      WLM version number for z/OS V1R6               00797000
SVPOL_RESERVED_R16 EQU 17 WLM version number reserved for WLM in z/OS  *00798000
                         V1R6                                           00799000
SVPOL_LEVEL018 EQU 18    Functionality level reserved for WLM in z/OS  *00800000
                         V1R7                                           00801000
SVPOL_RESERVED_R17 EQU 18 WLM version number reserved for WLM in z/OS  *00802000
                         V1R7                                           00803000
SVPOL_LEVEL019 EQU 19    Functionality level introduced by WLM in z/OS *00804000
                         R8                                             00805000
SVPOL_VER730 EQU 19      WLM version number for z/OS R8                 00806000
SVPOL_LEVEL020 EQU 20    Functionality level reserved for WLM in z/OS  *00807000
                         V1R8                                           00808000
SVPOL_RESERVED_R18 EQU 20 WLM version number reserved for WLM in z/OS  *00809000
                         V1R8                                           00810000
SVPOL_LEVEL021 EQU 21    Functionality level introduced by WLM in z/OS *00811000
                         V1R10                                          00812000
SVPOL_VER750 EQU 21      WLM version number for z/OS V1R10              00813000
SVPOL_LEVEL022 EQU 22    Functionality level reserved for WLM in z/OS  *00814000
                         V1R10                                          00815000
SVPOL_RESERVED_R110 EQU 22 WLM version number reserved for WLM in z/OS *00816000
                         V1R10                                          00817000
SVPOL_LEVEL023 EQU 23    Functionality level introduced by WLM in z/OS *00818000
                         V1R11                                          00819000
SVPOL_VER760 EQU 23      WLM version number for z/OS V1R10              00820000
SVPOL_LEVEL025 EQU 25    Functionality level introduced by WLM in z/OS *00821000
                         V1R12                                          00822000
SVPOL_VER770 EQU 25      WLM version number for z/OS V1R12              00823000
SVPOL_LEVEL029 EQU 29    Functionality level introduced by WLM in z/OS *00824000
                         V2R1                                           00825000
SVPOL_VER790 EQU 29      WLM version number for z/OS V2R1               00826000
SVPOL_LEVEL030 EQU 30    Functionality level introduced for Special    *00827000
                         Reporting                                      00828000
SVPOL_LEVEL031 EQU 31    Functionality level introduced for Specialty  *00829000
                         Engines Containment                            00830000
SVPOL_LEVEL032 EQU 32    Functionality level introduced for Workload   *00831000
                         billing groups                                 00832000
SVPOL_VER7B0 EQU 35      WLM version number for z/OS V2R3               00833000
SVPOL_LEVEL035 EQU 35    Functionality level introduced by WLM in z/OS *00834000
                         V2R3                                           00835000
SVPOL_LEVEL038 EQU 38    Functionality level introduced for System     *00836000
                         Recovery Boost stage 3                         00837000
SVPOL_CURRENT_VER EQU 38 Current functionality level used checking     *00838000
                         functionality within WLM product               00839000
SVPOL_SECTION EQU 0      IWMSVPOL.698: symbolic constant                00840000
SVPOL_HDR_SECTION EQU 1  IWMSVPOL.791: symbolic constant                00841000
SVPOL_SP_SECTION EQU 2   IWMSVPOL.109: symbolic constant                00842000
SVPOL_WD_SECTION EQU 3   IWMSVPOL.115: symbolic constant                00843000
SVPOL_CD_SECTION EQU 4   IWMSVPOL.554: symbolic constant                00844000
SVPOL_PD_SECTION EQU 5   IWMSVPOL.734: symbolic constant                00845000
SVPOL_RG_SECTION EQU 6   IWMSVPOL.740: symbolic constant                00846000
SVPOL_RD_SECTION EQU 7   IWMSVPOL.746: symbolic constant                00847000
SVPOL_MS_SECTION EQU 8   IWMSVPOL.1440: symbolic constant               00848000
SVPOL_SN_SECTION EQU 9   IWMSVPOL.1265: symbolic constant               00849000
SVPOL_ID EQU   C'SVPO'   IWMSVPOL.489: symbolic constant                00850000
SVPOLSN_LEN EQU *-SVPOLSN                                               00851000
.L0022   ANOP                                                           00852000
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 00853000
         AIF   ('&LIST' EQ 'YES').P4                                    00854000
.P3      ANOP                                                           00855000
         POP   PRINT                                                    00856000
.P4      ANOP                                                           00857000
.P_EXIT  ANOP                                                           00858000
         MEND                                                           00859000
**/ ;                                                                   00860000
* %IWMSVPOL_INCLUDED = 'YES';                                           00861000
* %DCL ZCBPRINT CHAR EXT;                                               00862000
* %DEACTIVATE ZCBPRINT;                                                 00863000
* %DCL IWMSVPOL_LIST CHAR EXT;                                          00864000
* %DEACTIVATE IWMSVPOL_LIST;                                            00865000
* %IF IWMSVPOL_LIST = 'NO' !                                            00866000
*    ZCBPRINT = 'NO' %THEN                                              00867000
* %DO;                                                                  00868000
*   @LIST PUSH NOECHO;                                                  00869000
*   @LIST NOASSEMBLE NOECHO;                                            00870000
*   @LIST OFF C NOECHO;                                                 00871000
* %END;                                                                 00872000
*/* Start of PL/X Source                                             */ 00873000
*                                                                       00874000
*   %IF SVPOLVIA = 'YES'            /* Specified SVPOLVIA=YES        */ 00875000
*     %THEN %SVPOLVIA = 'VIA';      /* Cause mapping to be VIA       */ 00876000
*     %ELSE %SVPOLVIA = '';         /* Otherwise do not use VIA      */ 00877000
*   DECLARE                                                             00878000
*                                                                       00879000
*     /***************************************************************/ 00880000
*     /*                                                             */ 00881000
*     /* Service policy header information                           */ 00882000
*     /*                                                             */ 00883000
*     /***************************************************************/ 00884000
*                                                                       00885000
*     1    SVPOLHD  SVPOLVIA BASED BDY(DWORD), /* IWMPQRY Answer area*/ 00886000
*           3    SVPOLNAM CHAR(4),   /* Eyecatcher - SVPO            */ 00887000
*           3    SVPOLLVL FIXED(8),  /* Functionality level of the      00888000
*                                       SVPOL. The functionality level  00889000
*                                       defines the highest level of    00890000
*                                       the WLM function that exists    00891000
*                                       in the SVPOL.            @P1A*/ 00892000
*           3    SVPOLWVN FIXED(8),  /* WLM version number       @P1C*/ 00893000
*           3    SVPOLDIL FIXED(16), /* Length of header section     */ 00894000
*           3    SVPOLDLE FIXED(32), /* Total length of the active      00895000
*                                      service policy data structure */ 00896000
*           3    SVPOLDPO FIXED(32), /* Offset to the service policy    00897000
*                                       definition section           */ 00898000
*           3    SVPOLDPL FIXED(16), /* Length of the policy entry in   00899000
*                                       the policy section           */ 00900000
*           3    SVPOLRS2 FIXED(16), /* Reserved                     */ 00901000
*           3    SVPOLDWO FIXED(32), /* Offset to the workload          00902000
*                                       definition section           */ 00903000
*           3    SVPOLDWC FIXED(16), /* Number of workload entries in   00904000
*                                       the workload definition         00905000
*                                       section                      */ 00906000
*           3    SVPOLDWL FIXED(16), /* Length of each workload entry*/ 00907000
*           3    SVPOLDCO FIXED(32), /* Offset to the service class     00908000
*                                       definition section           */ 00909000
*           3    SVPOLDCC FIXED(16), /* Number of service class         00910000
*                                       entries in the service class    00911000
*                                       definition section           */ 00912000
*           3    SVPOLDCL FIXED(16), /* Length of each service class    00913000
*                                       definition entry             */ 00914000
*           3    SVPOLDZO FIXED(32), /* Offset of service class         00915000
*                                       period entries               */ 00916000
*           3    SVPOLDZC FIXED(16), /* Number of service class         00917000
*                                       periods                      */ 00918000
*           3    SVPOLDZL FIXED(16), /* Length of each service class    00919000
*                                       period entry                 */ 00920000
*           3    SVPOLDRO FIXED(32), /* Offset to the report class      00921000
*                                       definition section           */ 00922000
*           3    SVPOLDRC FIXED(16), /* Number of report class          00923000
*                                       entries in the report class     00924000
*                                       definition section           */ 00925000
*           3    SVPOLDRL FIXED(16), /* Length of each report class     00926000
*                                       definition entry             */ 00927000
*           3    SVPOLDGO FIXED(32), /* Offset to the resource group    00928000
*                                       definition section           */ 00929000
*           3    SVPOLDGC FIXED(16), /* Number of resource group        00930000
*                                       entries in the resource group   00931000
*                                       definition                   */ 00932000
*           3    SVPOLDGL FIXED(16), /* Length of each resource group   00933000
*                                       definition entry             */ 00934000
*           3    SVPOLFL1 BIT(8),    /* boolean byte flag    @WLMPLNX*/ 00935000
*             5    SVPOLSH2 BIT(1),  /* Indicate whether SYSH contain   00936000
*                                       rule, servlce class or report   00937000
*                                       class                @WLMPLNX*/ 00938000
*             5    SVPOLEWL BIT(1),  /* Indicate whether policy         00939000
*                                       contains EWLM policy element    00940000
*                                                            @LEWLTM */ 00941000
*             5    SVPOLEWM BIT(1),  /* Indicate whether policy         00942000
*                                       contains EWLM managed server    00943000
*                                       configuration        @LEWMSMA*/ 00944000
*             5    SVPOLEWU BIT(1),  /* Indicator that contained EWLM   00945000
*                                       policy elements has changed     00946000
*                                                            @ME14587*/ 00947000
*           3    SVPOLRS3 BIT(24),   /* Reserved             @WLMPLNX*/ 00948000
*                                                                       00949000
*           /*********************************************************/ 00950000
*           /* The following two triplets were introduced with       */ 00951000
*           /* z/OS V1R11 (LEVEL023). Triplets may not be present    */ 00952000
*           /* and must not be accessed when SVPOLLVL (functionality */ 00953000
*           /* level) is less than 23.                       @ME17808*/ 00954000
*           /*********************************************************/ 00955000
*           3    SVPOLEMO FIXED(32), /* Offset to Guest platform        00956000
*                                       management provider (GPMP)      00957000
*                                       settings             @OA30928*/ 00958000
*           3    SVPOLEMC FIXED(16), /* Number of GPMP settings         00959000
*                                       entries              @ME17808*/ 00960000
*           3    SVPOLEML FIXED(16), /* Length of GPMP settings         00961000
*                                       entry                @ME17808*/ 00962000
*           3    SVPOLESO FIXED(32), /* Offset to system names          00963000
*                                       to be excluded from GPMP        00964000
*                                       activation           @ME17808*/ 00965000
*           3    SVPOLESC FIXED(16), /* Number of system names          00966000
*                                       to be excluded from GPMP        00967000
*                                       activation           @ME17808*/ 00968000
*           3    SVPOLESL FIXED(16), /* Length of system name           00969000
*                                       to be excluded from GPMP        00970000
*                                       activation           @ME17808*/ 00971000
*                                                                       00972000
*     /***************************************************************/ 00973000
*     /*                                                             */ 00974000
*     /* Service policy information                                  */ 00975000
*     /*                                                             */ 00976000
*     /***************************************************************/ 00977000
*                                                                       00978000
*     1    SVPOLSP  SVPOLVIA BASED BDY(DWORD), /* Service policy        00979000
*                                      section                       */ 00980000
*           3    SVPOLNSP CHAR(8),  /* Service policy name           */ 00981000
*           3    SVPOLDSP CHAR(32), /* Service policy description    */ 00982000
*           3    SVPOLTPA CHAR(8) BDY(DWORD), /* Time/date (STCK        00983000
*                                      format) of policy activation  */ 00984000
*           3    SVPOLIPU CHAR(8),  /* Userid of the system operator    00985000
*                                      or service administrator who     00986000
*                                      activated the service policy  */ 00987000
*           3    SVPOLSNA CHAR(8),  /* Name of the system on which      00988000
*                                      policy activation was            00989000
*                                      initiated                     */ 00990000
*           3    SVPOLSEQ FIXED(32),/* Classification sequence number   00991000
*                                      Removed svpolsqn added in        00992000
*                                      OW43718.              @OW44749*/ 00993000
*           3    SVPOLASN FIXED(32) ABNORMAL, /* Activation             00994000
*                                      sequence number               */ 00995000
*           3    SVPOLSVD,          /* SVDEF ID information (next 4     00996000
*                                      fields) of service definition    00997000
*                                      from which this policy was       00998000
*                                      extracted                     */ 00999000
*             5    SVPOLIDN CHAR(8) BDY(DWORD), /* Name of the service  01000000
*                                      definition from which the        01001000
*                                      service policy was extracted  */ 01002000
*             5    SVPOLTDI CHAR(8), /* Time/date (STCK format) that    01003000
*                                      the service definition was       01004000
*                                      installed                     */ 01005000
*             5    SVPOLIDU CHAR(8), /* Userid of the service           01006000
*                                      administrator who installed      01007000
*                                      the service definition        */ 01008000
*             5    SVPOLIDS CHAR(8), /* Name of the system on which     01009000
*                                      the service definition was       01010000
*                                      installed                     */ 01011000
*           3    SVPOLIDD CHAR(32), /* Description of service           01012000
*                                      definition from which the        01013000
*                                      service policy was extracted  */ 01014000
*           3    SVPOLCPU FIXED(32),/* System pre-set CPU service       01015000
*                                      coefficient (CPU=1*10000) -      01016000
*                                      the number by which accumulated  01017000
*                                      CPU service units will be        01018000
*                                      multiplied (weighted) @LCOEFFC*/ 01019000
*           3    SVPOLIOC FIXED(32),/* System pre-set I/O service       01020000
*                                      coefficient (IOC=0)   @LCOEFFC*/ 01021000
*           3    SVPOLMSO FIXED(32),/* System pre-set storage service   01022000
*                                      coefficient (MSO=0)   @LCOEFFC*/ 01023000
*           3    SVPOLSRB FIXED(32),/* System pre-set SRB service       01024000
*                                      coefficient (SRB=1*10000) -      01025000
*                                      the number by which accumulated  01026000
*                                      SRB service units will be        01027000
*                                      multiplied (weighted) @LCOEFFC*/ 01028000
*           3    SVPOLECP CHAR(4),  /* EBCDIC representation of CPU     01029000
*                                      service coefficient           */ 01030000
*           3    SVPOLEIO CHAR(4),  /* EBCDIC representation of I/O     01031000
*                                      service coefficient           */ 01032000
*           3    SVPOLEMS CHAR(8),  /* EBCDIC representation of         01033000
*                                      Storage service coefficient   */ 01034000
*           3    SVPOLESR CHAR(4),  /* EBCDIC representation of SRB     01035000
*                                      service coefficient           */ 01036000
*           3    SVPOLFL2 BIT(8),   /* SVDEFFL2              @PQC1647*/ 01037000
*             5    SVPOLIOM BIT(1), /* When set indicates that we       01038000
*                                      should include the I/O           01039000
*                                      delays in the execution          01040000
*                                      velocity              @PQC2520*/ 01041000
*             5    SVPOLDAM BIT(1), /* When set indicates dynamic       01042000
*                                      alias tuning available           01043000
*                                                            @OW39854*/ 01044000
*             5    SVPOLIOE BIT(1), /* When set indicates I/O priority  01045000
*                                      groups are enabled    @OA41645*/ 01046000
*             5    SVPOLDGM BIT(1), /* When set indicates that          01047000
*                                      Discretionary Goal Management    01048000
*                                      is deactivated        @LWBGRPA*/ 01049000
*           3    SVPOLRS5 CHAR(3),  /* Reserved              @PQC1647*/ 01050000
*           3    SVPOLENM CHAR(64), /* EWLM Policy Name (EBCDIC)        01051000
*                                                            @LEWLTM */ 01052000
*           3    SVPOLEVR CHAR(64), /* EWLM Policy Version (EBCDIC)     01053000
*                                                            @LEWLTM */ 01054000
*           3    SVPOLEPU CHAR(16), /* EWLM Policy UUID                 01055000
*                                                            @LEWLTM */ 01056000
*           3    SVPOLEMU CHAR(16), /* EWLM Mgmt Server UUID            01057000
*                                                            @LEWLTM */ 01058000
*           3    SVPOLESQ FIXED(15),/* EWLM Policy Seq. Num. @LEWLTM */ 01059000
*           3    SVPOLEPI FIXED(15),/* EWLM Policy ID        @LEWLTM */ 01060000
*           3    SVPOLESI FIXED(15),/* EWLM Server ID        @LEWLTM */ 01061000
*           3    SVPOLENW FIXED(15),/* Number of EWLM Workloads         01062000
*                                                            @LEWLTM */ 01063000
*           3    SVPOLENS FIXED(15),/* Number of EWLM Service Classes   01064000
*                                                            @LEWLTM */ 01065000
*           3    SVPOLENP FIXED(15),/* Number of EWLM Service Class     01066000
*                                      Periods               @LEWLTM */ 01067000
*           3    SVPOLEAT CHAR (08),/* EWLM policy activation time.     01068000
*                                      Microseconds since 1.Jan.1970    01069000
*                                                            @LEWLTM */ 01070000
*           3    SVPOLCPG CHAR (40),/* Codepage used for service        01071000
*                                      definition.           @LPOLMP */ 01072000
*                                                                       01073000
*     /***************************************************************/ 01074000
*     /*                                                             */ 01075000
*     /* Workload information                                        */ 01076000
*     /*                                                             */ 01077000
*     /***************************************************************/ 01078000
*                                                                       01079000
*     1    SVPOLWD  SVPOLVIA BASED, /* Workload definition section   */ 01080000
*           3    SVPOLWNM CHAR(8),  /* Workload name                 */ 01081000
*           3    SVPOLWDE CHAR(32), /* Workload description          */ 01082000
*           3    SVPOLWEN CHAR(64), /* EWLM Workload name (EBCDIC)      01083000
*                                                            @LEWLTM */ 01084000
*           3    SVPOLWFL BIT(8),   /* boolean byte flag     @LEWLTM */ 01085000
*             5    SVPOLWEW BIT(1), /* Indicate whether workload is     01086000
*                                      an EWLM workload      @LEWLTM */ 01087000
*           3    SVPOLWRS BIT(24),  /* Reserved              @LEWLTM */ 01088000
*                                                                       01089000
*     /***************************************************************/ 01090000
*     /*                                                             */ 01091000
*     /* Service class information                                   */ 01092000
*     /*                                                             */ 01093000
*     /***************************************************************/ 01094000
*                                                                       01095000
*     1    SVPOLCD  SVPOLVIA BASED, /* Service class definition         01096000
*                                      section                       */ 01097000
*           3    SVPOLCNM CHAR(8),  /* Service class name            */ 01098000
*           3    SVPOLCDE CHAR(32), /* Service class description     */ 01099000
*           3    SVPOLCWN CHAR(8),  /* Name of the workload this        01100000
*                                      service class is associated      01101000
*                                      with                          */ 01102000
*           3    SVPOLCRN CHAR(8),  /* Name of the resource group       01103000
*                                      this service class is            01104000
*                                      associated with - blanks if no   01105000
*                                      resource group association    */ 01106000
*           3    SVPOLCPO FIXED(32), /* Offset of service class         01107000
*                                      period entries for this          01108000
*                                      service class                 */ 01109000
*           3    SVPOLCPN FIXED(16), /* Number of service class         01110000
*                                      periods for this service class*/ 01111000
*           3    SVPOLCFL BIT(16),   /* Class flags          @WLMPACT*/ 01112000
*             5    SVPOLCF1 BIT(8),  /* Flags byte 1, required for      01113000
*                                       ASM users            @OA50845*/ 01114000
*               7  SVPOLCDH BIT(1),  /* Indicate class histories should 01115000
*                                       be discarded         @WLMPACT*/ 01116000
*               7  SVPOLCPC BIT(1),  /* Indicator for CPU critical      01117000
*                                                            @WLMPGMC*/ 01118000
*               7  SVPOLSTR BIT(1),  /* Indicator for Storage           01119000
*                                       Protection           @WLMPGMS*/ 01120000
*               7  SVPOLTRA BIT(1),  /* Indicator for whether this      01121000
*                                       service class is used in any    01122000
*                                       transaction subsystem type      01123000
*                                                            @WLMPGMS*/ 01124000
*               7  SVPOLADR BIT(1),  /* Indicator for whether this      01125000
*                                       service class is used in any    01126000
*                                       address space subsystem type    01127000
*                                                            @WLMPGMS*/ 01128000
*               7  SVPOLENC BIT(1),  /* Indicator for whether this      01129000
*                                       service class is used in any    01130000
*                                       enclave subsystem type          01131000
*                                                            @WLMPGMS*/ 01132000
*               7  SVPOLSYH BIT(1),  /* Indicator for whether this      01133000
*                                       service class is used in non-   01134000
*                                       MVS logical partitions ie. SYSH 01135000
*                                                            @WLMPLNX*/ 01136000
*               7  SVPOLIPG BIT(1),  /* Indicator for I/O priority      01137000
*                                       group                @LIOMGTA*/ 01138000
*             5    SVPOLCF2 BIT(8),  /* Flags byte 2, required for      01139000
*                                       ASM users            @OA50845*/ 01140000
*               7  SVPOL_InEligHonorPriority BIT(1),                 /* 01141000
*                                       Service Class Honor Priority    01142000
*                                       attribute. When on, specialty   01143000
*                                       engine eligible work in this    01144000
*                                       service class will not be       01145000
*                                       offloaded to CPs for help       01146000
*                                       processing           @OA50845*/ 01147000
*           3    SVPOLCGI FIXED(32), /* Resource group index - the      01148000
*                                      index of the resource group      01149000
*                                      entry in SVPOL of the resource   01150000
*                                      group to which this service      01151000
*                                      class belongs                 */ 01152000
*           3    SVPOLCWI FIXED(32), /* Workload index - the index of   01153000
*                                      the workload entry in SVPOL of   01154000
*                                      the workload to which this       01155000
*                                      service class belongs         */ 01156000
*           3    SVPOLCEN CHAR(64),  /* EWLM Service Class name         01157000
*                                       (EBCDIC)             @LEWLTM */ 01158000
*           3    *        CHAR (02), /* Reserved             @LEWLTM */ 01159000
*           3    SVPOLCEK FIXED(15), /* EWLM Service Class key          01160000
*                                                            @LEWLTM */ 01161000
*           3    SVPOLCEF BIT(8),    /* boolean byte flag    @LEWLTM */ 01162000
*             5    SVPOLCEW BIT(1),  /* Indicate whether service class  01163000
*                                       is an EWLM workload  @LEWLTM */ 01164000
*           3    SVPOLCRS BIT(8),    /* Reserved             @LEWLTM */ 01165000
*           3    SVPOLCSI FIXED(15), /* EWLM Server ID       @LEWLTM */ 01166000
*                                                                       01167000
*     /***************************************************************/ 01168000
*     /*                                                             */ 01169000
*     /* Service class period information                            */ 01170000
*     /*                                                             */ 01171000
*     /***************************************************************/ 01172000
*                                                                       01173000
*     1    SVPOLPD  SVPOLVIA BASED, /* Service class period             01174000
*                                      definition information        */ 01175000
*           3    SVPOLTYP BIT(32),  /* Goal type indicators -           01176000
*                                      mutually exclusive            */ 01177000
*             5    SVPOLPRC BIT(1), /* Percentile response time goal */ 01178000
*             5    SVPOLAVG BIT(1), /* Average response time goal    */ 01179000
*             5    SVPOLVEL BIT(1), /* Velocity goal                 */ 01180000
*             5    SVPOLDSC BIT(1), /* Discretionary goal            */ 01181000
*             5    SVPOLSTM BIT(1), /* System goal                   */ 01182000
*           3    SVPOLTFL BIT(8),   /* boolean byte flag     @LEWLTM */ 01183000
*             5    SVPOLTEW BIT(1), /* Goal derived from EWLM policy    01184000
*                                                            @LEWLTM */ 01185000
*           3    SVPOLRTU FIXED(8), /* Response time unit indicator     01186000
*                                      indicating the units in which    01187000
*                                      SVPOLVAL is expressed. See       01188000
*                                      constants SVPOLRT* for values */ 01189000
*           3    SVPOLPER FIXED(16), /* Goal percentile value        */ 01190000
*           3    SVPOLIMP FIXED(16), /* Importance level ranging from   01191000
*                                      1 to 5 where 1 is most           01192000
*                                      important                     */ 01193000
*           3    SVPOLRS8 FIXED(16), /* Reserved                     */ 01194000
*           3    SVPOLVAL FIXED(32), /* Response time goal or           01195000
*                                      velocity goal. Zero if           01196000
*                                      discretionary or system goal     01197000
*                                      or no goal defined.           */ 01198000
*           3    SVPOLDUR FIXED(32), /* Service class period duration   01199000
*                                      in service units, or zero for    01200000
*                                      last period                   */ 01201000
*                                                                       01202000
*     /***************************************************************/ 01203000
*     /*                                                             */ 01204000
*     /* Resource group information                                  */ 01205000
*     /*                                                             */ 01206000
*     /***************************************************************/ 01207000
*                                                                       01208000
*     1    SVPOLRG  SVPOLVIA BASED, /* Resource group definition        01209000
*                                      section                       */ 01210000
*           3    SVPOLGNM CHAR(8),  /* Resource group name           */ 01211000
*           3    SVPOLGDE CHAR(32), /* Resource group description    */ 01212000
*           3    SVPOLGMN FIXED(32),/* If SVPOLMNS = 1, this field      01213000
*                                      contains information about       01214000
*                                      the minimum capacity of the      01215000
*                                      resource group.                  01216000
*                                      (a) If all SVPOLGPV / GPC / GMS  01217000
*                                      are '0'b, the value in SVPOLGMN  01218000
*                                      is in unweighted CPU service     01219000
*                                      units per second.                01220000
*                                      In this case the scope of the    01221000
*                                      resource group and the minimum   01222000
*                                      value is sysplex-wide            01223000
*                                      (b) If SVPOLGPV = '1'B the       01224000
*                                      value is in percentage of the    01225000
*                                      LPAR share. See description      01226000
*                                      of SVPOLGPV below.               01227000
*                                      (c) If SVPOLGPC = '1'B the       01228000
*                                      value is in percentage of a      01229000
*                                      single CP capacity. See descr.   01230000
*                                      of SVPOLGPC below.    @ME06257.  01231000
*                                      (d) If SVPOLGMS = '1'B the       01232000
*                                      value is in MSU/h. See descr.    01233000
*                                      of SVPOLGMS below.    @LWBGRPC*/ 01234000
*           3    SVPOLGMX FIXED(32),/* If SVPOLMXS = 1, this field      01235000
*                                      contains information about       01236000
*                                      the maximum capacity of the      01237000
*                                      resource group.                  01238000
*                                      (a) If all SVPOLGPV / GPC / GMS  01239000
*                                      are '0'b, the value in SVPOLGMX  01240000
*                                      is in unweighted CPU service     01241000
*                                      units per second.                01242000
*                                      In this case the scope of the    01243000
*                                      resource group and the maximum   01244000
*                                      value is sysplex-wide.           01245000
*                                      (b) If SVPOLGPV = '1'B the       01246000
*                                      value is in percentage of the    01247000
*                                      LPAR share. See description      01248000
*                                      of SVPOLGPV below.               01249000
*                                      (c) If SVPOLGPC = '1'B the       01250000
*                                      value is in percentage of a      01251000
*                                      single CP capacity. See descr.   01252000
*                                      of SVPOLGPC below.    @ME06257.  01253000
*                                      (d) If SVPOLGMS = '1'B the       01254000
*                                      value is in MSU/h. See descr.    01255000
*                                      of SVPOLGMS below.    @LWBGRPC*/ 01256000
*           3    SVPOLGLT BIT(32),  /* Policy level Indicators          01257000
*                                                            @LWBGRPC*/ 01258000
*             5    SVPOLMXS BIT(1), /* Maximum capacity was             01259000
*                                      specified                     */ 01260000
*             5    SVPOLMNS BIT(1), /* Minimum capacity was             01261000
*                                      specified                     */ 01262000
*             5    SVPOLGSD BIT(1), /* Internally used only             01263000
*                                                            @WLMCACT*/ 01264000
*             5    SVPOLGPV BIT(1), /* The specification of the min     01265000
*                                      (SVPOLGMN) and the max(SVPOLGMX) 01266000
*                                      capacity is in percentage of     01267000
*                                      the LPAR share rather than       01268000
*                                      in service units. The scope of   01269000
*                                      the RG is system-wide rather     01270000
*                                      than sysplex-wide     @ME06257*/ 01271000
*             5    SVPOLGPC BIT(1), /* The specification of the min     01272000
*                                      (SVPOLGMN) and the max(SVPOLGMX) 01273000
*                                      capacity is in percentage of     01274000
*                                      a single processor (CP) capacity 01275000
*                                      = % of RMCTADJC. The scope of    01276000
*                                      the RG is system-wide rather     01277000
*                                      than sysplex-wide     @WLMPEEG*/ 01278000
*             5    SVPOLMLS BIT(1), /* Memory limit was specified       01279000
*                                                            @OA50845*/ 01280000
*             5    SVPOLISP BIT(1), /* Include Specialty Processor      01281000
*                                      Consumption was specified        01282000
*                                                            @LWBGRPA*/ 01283000
*             5    SVPOLGMS BIT(1), /* The specification of the min     01284000
*                                      (SVPOLGMN) and the max(SVPOLGMX) 01285000
*                                      capacity is in MSU/h. The scope  01286000
*                                      of the RG is sysplex-wide        01287000
*                                                            @LWBGRPA*/ 01288000
*           3    SVPOL_MemoryLimit FIXED(32), /* Maximum memory limit   01289000
*                                       in GB                @OA50845*/ 01290000
*           3    SVPOLGL1 BIT(32),  /* Resource group level             01291000
*                                      indicators            @LWBGRPA*/ 01292000
*             5    SVPOLTRG BIT(1), /* This is a Tenant Resource Group  01293000
*                                                            @LWBGRPA*/ 01294000
*             5    SVPOLTRG_HWContainer BIT(1), /* This is a Tenant     01295000
*                                      Resource Group which is          01296000
*                                      enabled for zCBP.     @LHWCONA*/ 01297000
*           3    *        CHAR(4),  /* Reserved to align to DWORD       01298000
*                                      boundary              @LWBGRPA*/ 01299000
*           3    SVPOL_TenantID CHAR(8), /* ID of associated Tenant     01300000
*                                                            @LWBGRPA*/ 01301000
*           3    SVPOL_TenantName CHAR(32), /* Name of associated       01302000
*                                      Tenant                @LWBGRPA*/ 01303000
*           3    SVPOL_TRGSolutionId CHAR(64), /* Solution Id of the    01304000
*                                      Tenant Resource Group @LWBGRPA*/ 01305000
*                                                                       01306000
*     /***************************************************************/ 01307000
*     /*                                                             */ 01308000
*     /* Report class information                                    */ 01309000
*     /*                                                             */ 01310000
*     /***************************************************************/ 01311000
*                                                                       01312000
*     1    SVPOLRD  SVPOLVIA BASED, /* report class definition          01313000
*                                      section                       */ 01314000
*           3    SVPOLRNM CHAR(8),  /* report class name             */ 01315000
*           3    SVPOLRDE CHAR(32), /* report class description      */ 01316000
*           3    SVPOLRFL BIT(32),  /* Indicators            @LWBGRPA*/ 01317000
*             5    SVPOLTRC BIT(1), /* This is a Tenant Report Class    01318000
*                                                            @LWBGRPA*/ 01319000
*           3    SVPOL_TRG_Index FIXED(32), /* Resource group index -   01320000
*                                      the index of the Tenant          01321000
*                                      Resource Group entry in SVPOL    01322000
*                                      to which this Tenant Report      01323000
*                                      Class belongs. Only set if       01324000
*                                      this is a Tenant Report Class    01325000
*                                                            @LWBGRPA*/ 01326000
*           3    SVPOL_TRG_Name CHAR(8), /* Name of associated Tenant   01327000
*                                      Resource Group. Only set if      01328000
*                                      this is a Tenant Report Class    01329000
*                                                            @LWBGRPA*/ 01330000
*                                                                       01331000
*     /***************************************************************/ 01332000
*     /*                                                             */ 01333000
*     /* Guest platform management provider (GPMP) settings          */ 01334000
*     /*                                                             */ 01335000
*     /***************************************************************/ 01336000
*                                                                       01337000
*     1    SVPOLMS  SVPOLVIA BASED, /* GPMP settings         @OA30928*/ 01338000
*           3 SVPOLEFL BIT(8),      /* Flags                 @LEWMSMA*/ 01339000
*             5 SVPOLEAY BIT(1),    /* GPMP should be activated         01340000
*                                                            @ME17808*/ 01341000
*             5 SVPOLALS BIT(1),    /* Reserved              @ME17808*/ 01342000
*             5 SVPOLALC BIT(1),    /* Reserved              @ME17808*/ 01343000
*           3 *        BIT(24),     /* Reserved              @LEWMSMA*/ 01344000
*           3 SVPOLEDP FIXED(32),   /* Reserved              @ME17808*/ 01345000
*           3 SVPOLEDN CHAR(256),   /* Reserved              @ME17808*/ 01346000
*           3 SVPOLSKN CHAR(240),   /* Reserved              @ME17808*/ 01347000
*           3 *        CHAR(0) BDY(DWORD), /*                @LEWMSMA*/ 01348000
*     /***************************************************************/ 01349000
*     /*                                                             */ 01350000
*     /* Guest platform management provider (GPMP) settings:         */ 01351000
*     /* Names of systems to be excluded                             */ 01352000
*     /*                                                             */ 01353000
*     /***************************************************************/ 01354000
*                                                                       01355000
*     1    SVPOLSN  SVPOLVIA BASED, /* Names of systems to be excluded  01356000
*                                                            @LEWMSMA*/ 01357000
*           3 SVPOLSYN CHAR(8);     /* Name of host system to be        01358000
*                                      excluded              @LEWMSMA*/ 01359000
*                                                                       01360000
*   /*****************************************************************/ 01361000
*   /*                                                               */ 01362000
*   /* Constants                                                     */ 01363000
*   /*                                                               */ 01364000
*   /*****************************************************************/ 01365000
*                                                                       01366000
*   DECLARE                                                             01367000
*     SVPOL_RTU_MS FIXED(8) CONSTANT(1), /* SVPOLRTU value indicating   01368000
*                                      that SVPOLVAL value is           01369000
*                                      expressed in milliseconds     */ 01370000
*     SVPOL_RTU_SECOND FIXED(8) CONSTANT(2), /* SVPOLRTU value          01371000
*                                      indicating that SVPOLVAL value   01372000
*                                      is expressed in seconds       */ 01373000
*     SVPOL_RTU_MINUTE FIXED(8) CONSTANT(3), /* SVPOLRTU value          01374000
*                                      indicating that SVPOLVAL value   01375000
*                                      is expressed in minutes       */ 01376000
*     SVPOL_RTU_HOUR FIXED(8) CONSTANT(4), /* SVPOLRTU value            01377000
*                                      indicating that SVPOLVAL value   01378000
*                                      is expressed in hours         */ 01379000
*                                                                       01380000
*     SVPOL_NAME CHAR(4) CONSTANT('SVPO'), /* 'SVPO' acronym         */ 01381000
*     SVPOL_LEVEL001 FIXED(8) CONSTANT(1), /*                           01382000
*                                  Functionality level introduced by    01383000
*                                  WLM in SP510.                 @P1C*/ 01384000
*     SVPOL_VER510 FIXED(8) CONSTANT(1), /*                             01385000
*                                  WLM SP510 version             @P1C*/ 01386000
*     SVPOL_LEVEL002 FIXED(8) CONSTANT(2), /*                           01387000
*                                  Functionality level introduced by    01388000
*                                  WLM in SP520.                 @P1C*/ 01389000
*     SVPOL_VER520 FIXED(8) CONSTANT(2), /*                             01390000
*                                  WLM SP520 version             @P1C*/ 01391000
*     SVPOL_LEVEL003 FIXED(8) CONSTANT(3), /*                           01392000
*                                  Functionality level introduced by    01393000
*                                  WLM in OS/390 V1R3        @WLMCSTP*/ 01394000
*     SVPOL_VER530 FIXED(8) CONSTANT(3), /*                             01395000
*                                  WLM version number for OS/390 V1R3   01396000
*                                                            @WLMCSTP*/ 01397000
*     SVPOL_LEVEL004 FIXED(8) CONSTANT(4), /*                           01398000
*                                  Functionality level introduced by    01399000
*                                  WLM in OS/390 V2R4        @WLMPBAT*/ 01400000
*     SVPOL_VER604 FIXED(8) CONSTANT(4), /*                             01401000
*                                  WLM version number for OS/390 V2R4   01402000
*                                                            @WLMPBAT*/ 01403000
*     SVPOL_LEVEL005 FIXED(8) CONSTANT(5), /*                           01404000
*                                  Functionality level introduced by    01405000
*                                  WLM in OS/390 V2R5        @WLMPSDC*/ 01406000
*     SVPOL_VER605 FIXED(8) CONSTANT(5), /*                             01407000
*                                  WLM version number for OS/390 V2R5   01408000
*                                                            @WLMPSDC*/ 01409000
*     SVPOL_LEVEL006 FIXED(8) CONSTANT(6), /*                           01410000
*                                  Functionality level introduced by    01411000
*                                  WLM in OS/390 V2R6        @WLMPSDC*/ 01412000
*     SVPOL_VER606 FIXED(8) CONSTANT(6), /*                             01413000
*                                  WLM version number for OS/390 V2R6   01414000
*                                                            @WLMPSDC*/ 01415000
*     SVPOL_LEVEL007 FIXED(8) CONSTANT(7), /*                           01416000
*                                  Functionality level introduced by    01417000
*                                  WLM in OS/390 V2R7        @WLMPMQS*/ 01418000
*     SVPOL_VER607 FIXED(8) CONSTANT(7), /*                             01419000
*                                  WLM version number for OS/390 V2R7   01420000
*                                                            @WLMPMQS*/ 01421000
*     SVPOL_LEVEL008 FIXED(8) CONSTANT(8), /*                           01422000
*                                  Functionality level introduced by    01423000
*                                  WLM in OS/390 V2R7        @WLMPTAL*/ 01424000
*     SVPOL_VER608 FIXED(8) CONSTANT(8), /*                             01425000
*                                  WLM version number for OS/390 V2R7   01426000
*                                                            @WLMPTAL*/ 01427000
*     SVPOL_LEVEL009 FIXED(8) CONSTANT(9), /*                           01428000
*                                  Functionality level reserved for     01429000
*                                  WLM in OS/390 V2R8        @WLMPLNX*/ 01430000
*     SVPOL_RESERVED_R08 FIXED(8) CONSTANT(9), /*                       01431000
*                                  WLM version number reservice for     01432000
*                                  WLM in OS/390 V2R8        @WLMPLNX*/ 01433000
*     SVPOL_LEVEL010 FIXED(8) CONSTANT(10), /*                          01434000
*                                  Functionality level reserved for     01435000
*                                  WLM in OS/390 V2R9        @WLMPLNX*/ 01436000
*     SVPOL_RESERVED_R09 FIXED(8) CONSTANT(10), /*                      01437000
*                                  WLM version number reserved for      01438000
*                                  WLM in OS/390 V2R9        @WLMPLNX*/ 01439000
*     SVPOL_LEVEL011 FIXED(8) CONSTANT(11), /*                          01440000
*                                  Functionality level introduced by    01441000
*                                  WLM in OS/390 V2R10       @WLMPGMY*/ 01442000
*     SVPOL_VER703 FIXED(8) CONSTANT(11), /*                            01443000
*                                  WLM version number for OS/390 V2R10  01444000
*                                                            @WLMPGMY*/ 01445000
*     SVPOL_LEVEL012 FIXED(8) CONSTANT(12), /*                          01446000
*                                  Functionality level reserved for     01447000
*                                  WLM in OS/390 V2R11       @WLMPLNX*/ 01448000
*     SVPOL_RESERVED_R11 FIXED(8) CONSTANT(12), /*                      01449000
*                                  WLM version number reserved for      01450000
*                                  WLM in OS/390 V2R11       @WLMPLNX*/ 01451000
*     SVPOL_LEVEL013 FIXED(8) CONSTANT(13), /*                          01452000
*                                  Functionality level introduced by    01453000
*                                  WLM in OS/390 V2R12       @WLMPLNX*/ 01454000
*     SVPOL_VER705 FIXED(8) CONSTANT(13), /*                            01455000
*                                  WLM version number for OS/390 V2R12  01456000
*                                                            @WLMPLNX*/ 01457000
*     SVPOL_LEVEL014 FIXED(8) CONSTANT(14), /*                          01458000
*                                  Functionality level reserved for     01459000
*                                  WLM in z/OS V1R3          @WLMPESC*/ 01460000
*     SVPOL_RESERVED_R13 FIXED(8) CONSTANT(14), /*                      01461000
*                                  WLM version number for z/OS V1R3     01462000
*                                                            @WLMPESC*/ 01463000
*     SVPOL_LEVEL015 FIXED(8) CONSTANT(15), /*                          01464000
*                                  Functionality level reserved for     01465000
*                                  WLM in z/OS V1R4          @WLMPESC*/ 01466000
*     SVPOL_RESERVED_R14 FIXED(8) CONSTANT(15), /*                      01467000
*                                  WLM version number for z/OS V1R4     01468000
*                                                            @WLMPESC*/ 01469000
*     SVPOL_LEVEL016 FIXED(8) CONSTANT(16), /*                          01470000
*                                  Functionality level reserved for     01471000
*                                  WLM in z/OS V1R5          @WLMPESC*/ 01472000
*     SVPOL_RESERVED_R15 FIXED(8) CONSTANT(16), /*                      01473000
*                                  WLM version number for z/OS V1R5     01474000
*                                                            @WLMPESC*/ 01475000
*     SVPOL_LEVEL017 FIXED(8) CONSTANT(17), /*                          01476000
*                                  Functionality level introduced       01477000
*                                  in WLM for z/OS V1R6      @WLMPESC*/ 01478000
*     SVPOL_VER709 FIXED(8) CONSTANT(17), /*                            01479000
*                                  WLM version number for z/OS V1R6     01480000
*                                                            @WLMPESC*/ 01481000
*     SVPOL_RESERVED_R16 FIXED(8) CONSTANT(17), /*                      01482000
*                                  WLM version number reserved for      01483000
*                                  WLM in z/OS V1R6          @WLMPEEG*/ 01484000
*     SVPOL_LEVEL018 FIXED(8) CONSTANT(18), /*                          01485000
*                                  Functionality level reserved for     01486000
*                                  WLM in z/OS V1R7          @WLMPEEG*/ 01487000
*     SVPOL_RESERVED_R17 FIXED(8) CONSTANT(18), /*                      01488000
*                                  WLM version number reserved for      01489000
*                                  WLM in z/OS V1R7          @WLMPEEG*/ 01490000
*     SVPOL_LEVEL019 FIXED(8) CONSTANT(19), /*                          01491000
*                                  Functionality level introduced by    01492000
*                                  WLM in z/OS R8            @WLMPEEG*/ 01493000
*     SVPOL_VER730 FIXED(8) CONSTANT(19), /*                            01494000
*                                  WLM version number for z/OS R8       01495000
*                                                            @WLMPEEG*/ 01496000
*     SVPOL_LEVEL020 FIXED(8) CONSTANT(20), /*                          01497000
*                                  Functionality level reserved for     01498000
*                                  WLM in z/OS V1R8          @LEWLTM */ 01499000
*     SVPOL_RESERVED_R18 FIXED(8) CONSTANT(20), /*                      01500000
*                                  WLM version number reserved for      01501000
*                                  WLM in z/OS V1R8          @LEWLTM */ 01502000
*     SVPOL_LEVEL021 FIXED(8) CONSTANT(21), /*                          01503000
*                                  Functionality level introduced by    01504000
*                                  WLM in z/OS V1R10         @LEWLTM */ 01505000
*     SVPOL_VER750 FIXED(8) CONSTANT(21), /*                            01506000
*                                  WLM version number for z/OS V1R10    01507000
*                                                            @LEWLTM */ 01508000
*     SVPOL_LEVEL022 FIXED(8) CONSTANT(22), /*                          01509000
*                                  Functionality level reserved for     01510000
*                                  WLM in z/OS V1R10         @LEWMSMA*/ 01511000
*     SVPOL_RESERVED_R110 FIXED(8) CONSTANT(22), /*                     01512000
*                                  WLM version number reserved for      01513000
*                                  WLM in z/OS V1R10         @LEWMSMA*/ 01514000
*     SVPOL_LEVEL023 FIXED(8) CONSTANT(23), /*                          01515000
*                                  Functionality level introduced by    01516000
*                                  WLM in z/OS V1R11         @LEWMSMA*/ 01517000
*     SVPOL_VER760 FIXED(8) CONSTANT(23), /*                            01518000
*                                  WLM version number for z/OS V1R10    01519000
*                                                            @LEWMSMA*/ 01520000
*     SVPOL_LEVEL025 FIXED(8) CONSTANT(25), /*                          01521000
*                                  Functionality level introduced by    01522000
*                                  WLM in z/OS V1R12         @ME17808*/ 01523000
*     SVPOL_VER770 FIXED(8) CONSTANT(25), /*                            01524000
*                                  WLM version number for z/OS V1R12    01525000
*                                                            @ME17808*/ 01526000
*     SVPOL_LEVEL029 FIXED(8) CONSTANT(29), /*                          01527000
*                                  Functionality level introduced by    01528000
*                                  WLM in z/OS V2R1          @LSPMGRA*/ 01529000
*     SVPOL_VER790 FIXED(8) CONSTANT(29), /*                            01530000
*                                  WLM version number for z/OS V2R1     01531000
*                                                            @LSPMGRA*/ 01532000
*     SVPOL_LEVEL030 FIXED(8) CONSTANT(30), /*                          01533000
*                                  Functionality level introduced for   01534000
*                                  Special Reporting         @OA47042*/ 01535000
*     SVPOL_LEVEL031 FIXED(8) CONSTANT(31), /*                          01536000
*                                  Functionality level introduced for   01537000
*                                  Specialty Engines Containment        01538000
*                                                            @OA50845*/ 01539000
*     SVPOL_LEVEL032 FIXED(8) CONSTANT(32), /*                          01540000
*                                  Functionality level introduced for   01541000
*                                  Workload billing groups   @LWBGRPA*/ 01542000
*     SVPOL_VER7B0 FIXED(8) CONSTANT(35), /*                            01543000
*                                  WLM version number for z/OS V2R3     01544000
*                                                            @LRESPTA*/ 01545000
*     SVPOL_LEVEL035 FIXED(8) CONSTANT(35), /*                          01546000
*                                  Functionality level introduced by    01547000
*                                  WLM in z/OS V2R3          @LRESPTA*/ 01548000
*     SVPOL_LEVEL038 FIXED(8) CONSTANT(38), /*                          01549000
*                                  Functionality level introduced for   01550000
*                                  System Recovery Boost stage 3        01551000
*                                                            @LBOOS3A*/ 01552000
*     SVPOL_CURRENT_VER FIXED(8) CONSTANT(SVPOL_LEVEL038); /*           01553000
*                                  Current functionality level used     01554000
*                                  checking functionality within WLM    01555000
*                                  product                   @LBOOS3C*/ 01556000
*   DECLARE                                                             01557000
*     SVPOL_SECTION FIXED(8) CONSTANT(0); /* IWMSVPOL.698: symbolic     01558000
*                                      constant              @CASECNV*/ 01559000
*   DECLARE                                                             01560000
*     SVPOL_HDR_SECTION FIXED(8) CONSTANT(1); /* IWMSVPOL.791:          01561000
*                                      symbolic constant     @CASECNV*/ 01562000
*   DECLARE                                                             01563000
*     SVPOL_SP_SECTION FIXED(8) CONSTANT(2); /* IWMSVPOL.109:           01564000
*                                      symbolic constant     @CASECNV*/ 01565000
*   DECLARE                                                             01566000
*     SVPOL_WD_SECTION FIXED(8) CONSTANT(3); /* IWMSVPOL.115:           01567000
*                                      symbolic constant     @CASECNV*/ 01568000
*   DECLARE                                                             01569000
*     SVPOL_CD_SECTION FIXED(8) CONSTANT(4); /* IWMSVPOL.554:           01570000
*                                      symbolic constant     @CASECNV*/ 01571000
*   DECLARE                                                             01572000
*     SVPOL_PD_SECTION FIXED(8) CONSTANT(5); /* IWMSVPOL.734:           01573000
*                                      symbolic constant     @CASECNV*/ 01574000
*   DECLARE                                                             01575000
*     SVPOL_RG_SECTION FIXED(8) CONSTANT(6); /* IWMSVPOL.740:           01576000
*                                      symbolic constant     @CASECNV*/ 01577000
*   DECLARE                                                             01578000
*     SVPOL_RD_SECTION FIXED(8) CONSTANT(7); /* IWMSVPOL.746:           01579000
*                                      symbolic constant     @CASECNV*/ 01580000
*   DECLARE                                                             01581000
*     SVPOL_MS_SECTION FIXED(8) CONSTANT(8); /* IWMSVPOL.1440:          01582000
*                                      symbolic constant     @CASECNV*/ 01583000
*   DECLARE                                                             01584000
*     SVPOL_SN_SECTION FIXED(8) CONSTANT(9); /* IWMSVPOL.1265:          01585000
*                                      symbolic constant     @CASECNV*/ 01586000
*   DECLARE                                                             01587000
*     SVPOL_ID CHAR(4) CONSTANT('SVPO');     /* IWMSVPOL.489:           01588000
*                                      symbolic constant     @CASECNV*/ 01589000
*/* End of PL/X Source                                               */ 01590000
* %IF IWMSVPOL_LIST = 'NO' !                                            01591000
*    ZCBPRINT = 'NO' %THEN                                              01592000
* %DO;                                                                  01593000
*   @LIST POP NOECHO;                                                   01594000
* %END;                                                                 01595000
* %END;                                                                 01596000
