*                                                                       00001000
* %DCL IWMSMF90_INCLUDED CHAR EXT;                                      00002000
* %DEACTIVATE IWMSMF90_INCLUDED;                                        00003000
* %IF IWMSMF90_INCLUDED = '' %THEN                                      00004000
* %DO;                                                                  00005000
*/* Macro made bi-lingual on 19322. CBGEN compile date 19044         */ 00006000
*% /*                                                                   00007000
         MACRO                                                          00008000
         IWMSMF90 &DSECT=YES,&LIST=YES,&TITLE=YES,&SMF90T23=YES,       *00009000
               &SMF90T24=COND,&SMF90T25=COND,&SMF90T30=COND,           *00010000
               &SMF90T32=COND                                           00011000
         GBLC  &IWMSMF90_INCLUDED                                       00012000
         GBLC  &ZCBPRINT                                                00013000
&IWMSMF90_INCLUDED SETC 'YES'                                           00014000
         AIF   ('&LIST' EQ 'NONE').P0                                   00015000
         AIF   ('&TITLE' EQ 'NO').P5                                    00016000
 TITLE   'IWMSMF90  - WLM SMF Type 90, Subtype 23, 24, 25, 30 and '     00017000
.P5      ANOP                                                           00018000
**/ IWMSMF90_1:;                                                        00019000
*/***START OF SPECIFICATIONS******************************************/ 00020000
*/*                                                                  */ 00021000
*/*01* Proprietary statement:                                        */ 00022000
*/*                                                                  */ 00023000
*/*      Licensed Materials - Property of IBM                        */ 00024000
*/*      5650-ZOS Copyright IBM Corp. 1993, 2021                     */ 00025000
*/*                                                                  */ 00026000
*/*01* External classification: GUPI                                 */ 00027000
*/*01* End of External classification                                */ 00028000
*/*                                                                  */ 00029000
*/*01* Status: HBB77D0                                      @CBGMETA8*/ 00030000
*/*                                                                  */ 00031000
*/*01* Descriptive Name: WLM SMF Type 90, Subtype 23, 24, 25, 30 and */ 00032000
*/*                      32 record mappings                  @WLMPRES*/ 00033000
*/*                                                                  */ 00034000
*/*02*  Acronym: SMF90                                               */ 00035000
*/*                                                                  */ 00036000
*/*01* Macro Name: IWMSMF90                                          */ 00037000
*/*                                                                  */ 00038000
*/*01* DSECT Name: SMF90RCD                                          */ 00039000
*/*                                                                  */ 00040000
*/*01* Component: Workload Manager (SCWLM)                           */ 00041000
*/*                                                                  */ 00042000
*/*01* Eye-Catcher:                                                  */ 00043000
*/*02*  Offset: 0                                                    */ 00044000
*/*02*  Length: CHAR(4)                                              */ 00045000
*/*                                                                  */ 00046000
*/*01* Storage Attributes:                                           */ 00047000
*/*02*  Subpool: Any                                                 */ 00048000
*/*02*  Key: 0                                                       */ 00049000
*/*02*  Residency: Above 16M line                                    */ 00050000
*/*                                                                  */ 00051000
*/*01* Size: Determined at run time                                  */ 00052000
*/*                                                                  */ 00053000
*/*01* Created by: Caller                                            */ 00054000
*/*                                                                  */ 00055000
*/*01* Pointed to by: R1 and AR1                                     */ 00056000
*/*                                                                  */ 00057000
*/*01* Serialization: None                                           */ 00058000
*/*                                                                  */ 00059000
*/*01* Function: Contains WLM SMF Type 90 Subtype 23, 24, 25, 30 and */ 00060000
*/*              32 record mappings                          @WLMPRES*/ 00061000
*/*                                                                  */ 00062000
*/*  SMF record Type 90 Subtype 23 - WLM Service Definition Install  */ 00063000
*/*  A System Status SMF record will be generated each time that     */ 00064000
*/*  the WLM Service Definition is installed in the WLM couple       */ 00065000
*/*  dataset.  The Subtype 23 indicates the potential mismatch       */ 00066000
*/*  between the current contents of the WLM service definition      */ 00067000
*/*  and the active service policy.                                  */ 00068000
*/*                                                                  */ 00069000
*/*  SMF record Type 90 Subtype 24 - WLM Service Policy Activation   */ 00070000
*/*  A System Status SMF record will be generated each time that     */ 00071000
*/*  an MVS Workload Management service policy is activated.         */ 00072000
*/*  The Subtype 24 provides the unique identification of the        */ 00073000
*/*  service policy being activated, combined with the unique        */ 00074000
*/*  identification of the service definition from which the         */ 00075000
*/*  service policy was extracted.                                   */ 00076000
*/*                                                                  */ 00077000
*/*  SMF record Type 90 Subtype 25 - Workload Management Mode Change */ 00078000
*/*  A System Status SMF record will be generated each time that     */ 00079000
*/*  an MVS Workload Management mode transition occurs.              */ 00080000
*/*  The Subtype 25 indicates the direction of the transition,       */ 00081000
*/*  describing the service policy that is being activated           */ 00082000
*/*  (compatibility mode to goal mode transition) or that was        */ 00083000
*/*  previously active (goal mode to compatibility mode).            */ 00084000
*/*                                                                  */ 00085000
*/*  SMF record Type 90 Subtype 30 - RESET operator command complete.*/ 00086000
*/*  This record will be generated whenever a RESET operator command */ 00087000
*/*  or an enclave RESET via IWMERES-service completes successfully. */ 00088000
*/*  For an address space, the record identifies the job that was    */ 00089000
*/*  reset, the operator that initiated the command, and the change  */ 00090000
*/*  that was requested.                                             */ 00091000
*/*  For an enclave, the record identifies the name of the owner     */ 00092000
*/*  address space, the user and application that initiated the      */ 00093000
*/*  request, and the change that was requested.             @WLMPECR*/ 00094000
*/*                                                                  */ 00095000
*/*  SMF record Type 90 Subtype 32 - WLM Scheduling Environment      */ 00096000
*/*  change.                                                         */ 00097000
*/*  A System Status SMF record will be generated each time that     */ 00098000
*/*  an MVS Workload Management service policy is activated from     */ 00099000
*/*  a unique Service Definition.  The Subtype 32 provides the       */ 00100000
*/*  unique identification of the Service Policy Scheduling          */ 00101000
*/*  Environment(s).                                         @WLMPRES*/ 00102000
*/*                                                                  */ 00103000
*/*01* Restrictions:                                                 */ 00104000
*/*              None                                                */ 00105000
*/*                                                                  */ 00106000
*/*01* Method of Access:                                             */ 00107000
*/*                                                                  */ 00108000
*/*02*  ASM:                                                         */ 00109000
*/*          Specify: IWMSMF90                                       */ 00110000
*/*                                                                  */ 00111000
*/*02*  PLX:                                                         */ 00112000
*/*                                                                  */ 00113000
*/*          %INCLUDE SYSLIB(IWMSMF90)                               */ 00114000
*/*                                                                  */ 00115000
*/*02*  VIA ATTRIBUTE:                                               */ 00116000
*/*                                                                  */ 00117000
*/*          Specify %SVDCRVIA = 'YES'                               */ 00118000
*/*          prior to %INCLUDE statement.                            */ 00119000
*/*          For VIA(0) specify %GLOBALARMODE='YES'                  */ 00120000
*/*                                                                  */ 00121000
*/*01* Change Activity:                                              */ 00122000
*/*    $L0=WLMI    HBB5510  921231 PD88IK: Workload Manager I        */ 00123000
*/*    $D1=DCR0164 HBB5510  930802 PD88IK: Span record support for   */ 00124000
*/*                                        Subtype 24 record     @D1A*/ 00125000
*/*    $P2=PIG5045 HBB5510  940117 PD88DA: OW01260 - Change external */ 00126000
*/*                                        classification to GUPI.   */ 00127000
*/*    $L3=WLMP    HBB6603  950504 PD88SN: WLMENH - Add support for  */ 00128000
*/*                                        Subtype 30 record.        */ 00129000
*/*                                        A subtype 30 record will  */ 00130000
*/*                                        be written upon           */ 00131000
*/*                                        successful completion of  */ 00132000
*/*                                        the RESET (performance    */ 00133000
*/*                                        group or service class)   */ 00134000
*/*                                        command.              @L6A*/ 00135000
*/*    $PQC0795    HBB6603  960820 PDB9DB: Time stamps in local      */ 00136000
*/*                                        time              @PQC0795*/ 00137000
*/*    $WLMPBAT    JBB6604  961101 B9HAGD: Initiator management      */ 00138000
*/*    $WLMPRES    JBB6604  970216 B9HACG: Stephen McGrath           */ 00139000
*/*                                        Scheduling Environments.  */ 00140000
*/*                                        Add subtype 32 record.    */ 00141000
*/*    $PSY0114    JBB6604  970312 PDB9KN: Kin Ng - Add flags for    */ 00142000
*/*                                        reset srvclass and reset  */ 00143000
*/*                                        pgn                       */ 00144000
*/*                                                                  */ 00145000
*/*    $WLMPECR    HBB7706  010215 3241JH: Juergen Holtz             */ 00146000
*/*                                        Enclave Service Class     */ 00147000
*/*                                        Reset                     */ 00148000
*/*                                                                  */ 00149000
*/*    $WI136758   HBB77B0  161012 3241MG: Matthias Gubitz           */ 00150000
*/*                                        Value of SMF90RVN for     */ 00151000
*/*                                        subtype 30 record changed */ 00152000
*/*                                        from binary to EBCDIC     */ 00153000
*/*                                                                  */ 00154000
*/*    $Cversion   HBB77C0  190221 R84APR: Peter Relson              */ 00155000
*/*                                        creating C-version        */ 00156000
*/*                                                                  */ 00157000
*/*    $CBGMETA    HBB77D0  190813 3241BH: Bill Heisser              */ 00158000
*/*                                        convert to CBGEN Metadata */ 00159000
*/*                                                                  */ 00160000
*/***END OF SPECIFICATIONS********************************************/ 00161000
*% /*                                                                   00162000
.P0      ANOP                                                           00163000
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 00164000
         AIF   ('&LIST' EQ 'YES').P2                                    00165000
.P1      ANOP                                                           00166000
         PUSH  PRINT                                                    00167000
         PRINT OFF                                                      00168000
.P2      ANOP                                                           00169000
         AIF   ('&SMF90T23' EQ 'NO').L0002                              00170000
         AIF   ('&DSECT' EQ 'YES').L0003                                00171000
         AIF   ('&SMF90T23' NE 'YES').L0002                             00172000
.L0003   ANOP                                                           00173000
*                                                                       00174000
*    *****************************************************************  00175000
*    *                                                               *  00176000
*    * SMF record Type 90 Subtype 23 - WLM Service Definition Install*  00177000
*    *                                                               *  00178000
*    *****************************************************************  00179000
*                                                                       00180000
*                                                                       00181000
         AIF   ('&DSECT' EQ 'YES').L0004                                00182000
SMF90T23 DS    0X                                                       00183000
         AGO   .L0005                                                   00184000
.L0004   ANOP                                                           00185000
SMF90T23 DSECT                                                          00186000
.L0005   ANOP                                                           00187000
SMF90IDN DS    CL8       Service definition name                        00188000
SMF90TDI DS    CL8       Time/Date (STCK) of installation in local     *00189000
                         time                                           00190000
SMF90IDU DS    CL8       Userid of the service administrator that      *00191000
                         install this service definition                00192000
SMF90IDS DS    CL8       Name of the system on which the service       *00193000
                         definition was installed                       00194000
SMF90T23_LEN EQU *-SMF90T23                                             00195000
.L0002   ANOP                                                           00196000
         AIF   ('&SMF90T24' EQ 'NO').L0006                              00197000
         AIF   ('&DSECT' EQ 'YES').L0007                                00198000
         AIF   ('&SMF90T24' NE 'YES').L0006                             00199000
.L0007   ANOP                                                           00200000
*                                                                       00201000
*    *****************************************************************  00202000
*    *                                                               *  00203000
*    * SMF record Type 90 Subtype 24 - WLM Service Policy Activation *  00204000
*    *                                                               *  00205000
*    *****************************************************************  00206000
*                                                                       00207000
* ********************************************************************  00208000
* *                                                                  *  00209000
* *  To map the WLM policy when SMF9024N = 1, simply base IWMSVPOL   *  00210000
* *  on ADDR(SMF90T24) + LENGTH(SMF9024P)                            *  00211000
* *                                                                  *  00212000
* *  To map the WLM policy when SMF9024N > 1,                        *  00213000
* *  A). Obtain a storage block equal to 32K * SMF9024N.             *  00214000
* *                                                                  *  00215000
* *  B). Read all (SMF9024N) Type 90, subtype 24 records that have   *  00216000
* *      the same unique identifier (SMF9024I).                      *  00217000
* *                                                                  *  00218000
* *  C). From the record with SMF9024S=1, copy the data              *  00219000
* *      beginning at SMF9024A                                       *  00220000
* *      for a copy length of SMF90DLN - LENGTH(SMF9024P)            *  00221000
* *      to the start of the obtained storage.                       *  00222000
* *                                                                  *  00223000
* *  D). From the record with SMF9024S=2, copy the data              *  00224000
* *      beginning at SMF9024A                                       *  00225000
* *      for a copy length of SMF90DLN-LENGTH(SMF9024P)              *  00226000
* *      to the byte in the obtained storage immediately after       *  00227000
* *      the data copied in step C.                                  *  00228000
* *                                                                  *  00229000
* *  E). Continue as above for all records including the one where   *  00230000
* *      SMF9024S=SMF9024N.                                          *  00231000
* *                                                                  *  00232000
* *  F). Use the IWMSVPOL mapping macro to map the obtained storage  *  00233000
* *      with the data merged from the several subtype 24 records.   *  00234000
* *                                                                  *  00235000
* ********************************************************************  00236000
*                                                                       00237000
*                                                                       00238000
         AIF   ('&DSECT' EQ 'YES').L0008                                00239000
SMF90T24 DS    0D                                                       00240000
         AGO   .L0009                                                   00241000
.L0008   ANOP                                                           00242000
SMF90T24 DSECT                                                          00243000
.L0009   ANOP                                                           00244000
SMF9024P DS    CL16      Prefix area to subtype 24 Allows assembling   *00245000
                         several records together to map the entire    *00246000
                         WLM service policy                             00247000
         ORG   SMF9024P                                                 00248000
SMF9024S DS    F         Sequence number. When the service policy is   *00249000
                         larger than will fit in 1 subtype 24 record,  *00250000
                         this field describes the order in which       *00251000
                         individual records must be combined to view   *00252000
                         the entire service policy                      00253000
SMF9024N DS    F         Number of subtype 24 records which must be    *00254000
                         combined to map the policy. When 1 record is  *00255000
                         enough, both SMF9024S and SMF9024N will be 1.  00256000
SMF9024I DS    CL8       Unique id that is used to ensure all "N"      *00257000
                         records of 1 policy can be combined without   *00258000
                         mixing data from 2 rapid VARY policy          *00259000
                         commands.                                      00260000
SMF9024A DS    0C        The active service policy. This area is       *00261000
                         mapped by IWMSVPOL.                            00262000
SMF90T24_LEN EQU *-SMF90T24                                             00263000
.L0006   ANOP                                                           00264000
         AIF   ('&SMF90T25' EQ 'NO').L000A                              00265000
         AIF   ('&DSECT' EQ 'YES').L000B                                00266000
         AIF   ('&SMF90T25' NE 'YES').L000A                             00267000
.L000B   ANOP                                                           00268000
*                                                                       00269000
*    *****************************************************************  00270000
*    *                                                               *  00271000
*    * SMF record Type 90 Subtype 25 - Workload Management Mode      *  00272000
*    * Change                                                        *  00273000
*    *                                                               *  00274000
*    *****************************************************************  00275000
*                                                                       00276000
*                                                                       00277000
         AIF   ('&DSECT' EQ 'YES').L000C                                00278000
SMF90T25 DS    0X                                                       00279000
         AGO   .L000D                                                   00280000
.L000C   ANOP                                                           00281000
SMF90T25 DSECT                                                          00282000
.L000D   ANOP                                                           00283000
SMF90MOD DS    B         Mode transition indicators                     00284000
*  Bit definitions:                                                     00285000
SMF90MGM EQU   X'80'     Goal mode to compatibility mode                00286000
SMF90MCM EQU   X'40'     Compatibility mode to goal mode                00287000
SMF90MRS DS    CL3       Reserved                                       00288000
SMF90MTD DS    CL8       Time/Date (STCK) of mode transition           *00289000
                         initiation                                     00290000
SMF90NSP DS    CL8       Service policy name                            00291000
SMF90TPA DS    CL8       Time/Date (STCK) associated with the initial  *00292000
                         activation of this service policy in local    *00293000
                         time                                           00294000
SMF90IPU DS    CL8       Userid of the system operator or service      *00295000
                         administrator that activated this service     *00296000
                         policy                                         00297000
SMF90SNA DS    CL8       System name (sysname) associated with initial *00298000
                         activation of this service policy              00299000
SMF9025N DS    CL8       Service definition name from which this       *00300000
                         service policy was extracted                   00301000
SMF9025T DS    CL8       Time/Date (STCK) associated with installation *00302000
                         of this service definition in local time       00303000
SMF9025U DS    CL8       Userid of the service administrator who       *00304000
                         installed the service definition               00305000
SMF9025S DS    CL8       Name of the system on which the service       *00306000
                         definition was installed                       00307000
SMF90MOU DS    CL8       Userid of the system operator that initiated  *00308000
                         the mode changed                               00309000
SMF90T25_LEN EQU *-SMF90T25                                             00310000
.L000A   ANOP                                                           00311000
         AIF   ('&SMF90T30' EQ 'NO').L000E                              00312000
         AIF   ('&DSECT' EQ 'YES').L000F                                00313000
         AIF   ('&SMF90T30' NE 'YES').L000E                             00314000
.L000F   ANOP                                                           00315000
*                                                                       00316000
*          SMF record Type 90 Subtype 30 -                              00317000
*          RESET operator command processed.                            00318000
*                                                                       00319000
* ********************************************************************  00320000
* *  SMF record Type 90 Subtype 30 - RESET operator command complete.*  00321000
* *  This record will be generated whenever a RESET operator command *  00322000
* *  or an enclave RESET via IWMERES-service completes successfully. *  00323000
* *  For an address space, the record identifies the job that was    *  00324000
* *  reset, the operator that initiated the command, and the change  *  00325000
* *  that was requested.                                             *  00326000
* *  For an enclave, the record identifies the name of the owner     *  00327000
* *  address space, the user and application that initiated the      *  00328000
* *  request, and the change that was requested.                        00329000
* ********************************************************************  00330000
*                                                                       00331000
*                                                                       00332000
         AIF   ('&DSECT' EQ 'YES').L0010                                00333000
SMF90T30 DS    0F                                                       00334000
         AGO   .L0011                                                   00335000
.L0010   ANOP                                                           00336000
SMF90T30 DSECT                                                          00337000
.L0011   ANOP                                                           00338000
SMF90T30_JOBNAME DS CL8  Name of job that was reset. Blank, if record  *00339000
                         represents an enclave reset request.           00340000
SMF90T30_JOBID DS CL8    JES job id of that job. Blank if no JSAB      *00341000
                         associated with job or if record represents   *00342000
                         an enclave reset request.                      00343000
SMF90T30_ENTRY_TIME DS F Entry time in hundredths of a second since    *00344000
                         midnight. For a job, this is the program      *00345000
                         entry time or zero, if no JSAB is associated  *00346000
                         with the job. For an enclave, this is the     *00347000
                         time the enclave was created.                  00348000
SMF90T30_ENTRY_DATE DS CL4 Entry date in the form 0cyydddF. For a job, *00349000
                         this is the program entry data or zero, if no *00350000
                         JSAB is associated with the job. For an       *00351000
                         enclave this is the date the enclave was      *00352000
                         created.                                       00353000
SMF90T30_OPERATOR DS CL8 Operator ID that issued RESET                  00354000
SMF90T30_FLAGS DS B      Indicators                                     00355000
*  Bit definitions:                                                     00356000
SMF90T30_QUIESCE EQU X'80' QUIESCE operand used                         00357000
SMF90T30_RESUME EQU X'40' RESUME operand used                           00358000
SMF90T30_SRVCLASS EQU X'20' SRVCLASS operand used                       00359000
SMF90T30_PGN EQU X'10'   PGN operand used                               00360000
SMF90T30_ENCLAVESRVCLASS EQU X'08' The enclave service class was reset  00361000
SMF90T30_ENCLAVEQUIESCE EQU X'04' The enclave was qiesced               00362000
SMF90T30_ENCLAVERESUME EQU X'02' The enclave was resumed                00363000
SMF90T30_FLAGS2 DS B     Additional characteristics                     00364000
*  Bit definitions:                                                     00365000
SMF90T30_INDEPENDENTENCLAVE EQU X'80' On = original independent        *00366000
                         enclave                                        00367000
SMF90T30_RSV DS CL2      Reserved.                                      00368000
SMF90T30_OLDSRV DS CL8   Service class name that was associated with   *00369000
                         the job or the enclave before RESET was       *00370000
                         processed. Blank if system was in compat      *00371000
                         mode. OLD and NEW service class are identical *00372000
                         when the RESET QUIESCEd the address space or  *00373000
                         the enclave.                                   00374000
SMF90T30_NEWSRV DS CL8   Service class that was associated with the    *00375000
                         job or the enclave after RESET was processed. *00376000
                         Blank for a system in compat mode. OLD and    *00377000
                         NEW service class are identical when the      *00378000
                         RESET QUIESCEd the address space or the       *00379000
                         enclave.                                       00380000
SMF90T30_OLDPGN DS H     Performance group that was associated with    *00381000
                         the job before RESET was processed. Zero if   *00382000
                         system was in goal mode or if record          *00383000
                         represents an enclave reset request.           00384000
SMF90T30_NEWPGN DS H     Performance group the job was reset into.     *00385000
                         Zero if system was in goal mode or if record  *00386000
                         represents an enclave reset request.           00387000
SMF90T30_ENCLAVEOWNER DS CL8 Name of the address space that owns the   *00388000
                         enclave. Blank, if record represents a job    *00389000
                         reset request.                                 00390000
SMF90T30_CURRENTVERSION EQU C'03'                                       00391000
SMF90T30_LEN EQU *-SMF90T30                                             00392000
.L000E   ANOP                                                           00393000
         AIF   ('&SMF90T32' EQ 'NO').L0012                              00394000
         AIF   ('&DSECT' EQ 'YES').L0013                                00395000
         AIF   ('&SMF90T32' NE 'YES').L0012                             00396000
.L0013   ANOP                                                           00397000
*                                                                       00398000
*          SMF record Type 90 Subtype 32 -                              00399000
*          Scheduling Environment information.                          00400000
*                                                                       00401000
* ********************************************************************  00402000
* *  SMF record Type 90 Subtype 32 - Scheduling Environment          *  00403000
* *  information after a successful Policy change.                      00404000
* ********************************************************************  00405000
* ********************************************************************  00406000
* *                                                                  *  00407000
* *  To map the Scheduling Environment structure when SMF9032N = 1,  *  00408000
* *  simply base IWMSVPSE on ADDR(SMF90T32) + LENGTH(SMF9032P)       *  00409000
* *                                                                  *  00410000
* *  To map the Schduling Environment structure when SMF9032N > 1,   *  00411000
* *                                                                  *  00412000
* *  A). Obtain a storage block equal to 32K * SMF9032N.             *  00413000
* *                                                                  *  00414000
* *  B). Read all (SMF9032N) Type 90, subtype 32 records that have   *  00415000
* *      the same unique identifier (SMF9032I).                      *  00416000
* *                                                                  *  00417000
* *  C). From the record with SMF9032S=1, copy the data              *  00418000
* *      beginning at SMF9032A                                       *  00419000
* *      for a copy length of SMF90DLN - LENGTH(SMF9032P)            *  00420000
* *      to the start of the obtained storage.                       *  00421000
* *                                                                  *  00422000
* *  D). From the record with SMF9032S=2, copy the data              *  00423000
* *      beginning at SMF9032A                                       *  00424000
* *      for a copy length of SMF90DLN-LENGTH(SMF9032P)              *  00425000
* *      to the byte in the obtained storage immediately after       *  00426000
* *      the data copied in step C.                                  *  00427000
* *                                                                  *  00428000
* *  E). Continue as above for all records including the one where   *  00429000
* *      SMF9032S=SMF9032N.                                          *  00430000
* *                                                                  *  00431000
* *  F). Use the IWMSVPSE mapping macro to map the obtained storage  *  00432000
* *      with the data merged from the several subtype 32 records.   *  00433000
* *                                                                  *  00434000
* *                                                                     00435000
* ********************************************************************  00436000
*                                                                       00437000
*                                                                       00438000
         AIF   ('&DSECT' EQ 'YES').L0014                                00439000
SMF90T32 DS    0D                                                       00440000
         AGO   .L0015                                                   00441000
.L0014   ANOP                                                           00442000
SMF90T32 DSECT                                                          00443000
.L0015   ANOP                                                           00444000
SMF9032P DS    CL16      Prefix area to subtype 32 Allows assembling   *00445000
                         several records together to map the entire    *00446000
                         WLM service policy                             00447000
         ORG   SMF9032P                                                 00448000
SMF9032S DS    F         Sequence number. When the Scheduling          *00449000
                         Environment structure is larger than will fit *00450000
                         in 1 subtype 32 record, this field describes  *00451000
                         the order in which individual records must be *00452000
                         combined to view the entire service policy.    00453000
SMF9032N DS    F         Number of subtype 32 records which must be    *00454000
                         combined to map the policy. When 1 record is  *00455000
                         enough, both SMF9032S and SMF9032N will be 1.  00456000
SMF9032I DS    CL8       Unique id that is used to ensure all "N"      *00457000
                         records of 1 policy can be combined without   *00458000
                         mixing data from 2 rapid VARY policy          *00459000
                         commands.                                      00460000
SMF9032A DS    0C        The active service policy. This area is       *00461000
                         mapped by IWMSVPSE.                            00462000
SMF90T32_LEN EQU *-SMF90T32                                             00463000
.L0012   ANOP                                                           00464000
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 00465000
         AIF   ('&LIST' EQ 'YES').P4                                    00466000
.P3      ANOP                                                           00467000
         POP   PRINT                                                    00468000
.P4      ANOP                                                           00469000
.P_EXIT  ANOP                                                           00470000
         MEND                                                           00471000
**/ IWMSMF90_2:;                                                        00472000
* %IWMSMF90_INCLUDED = 'YES';                                           00473000
* %DCL ZCBPRINT CHAR EXT;                                               00474000
* %DEACTIVATE ZCBPRINT;                                                 00475000
* %DCL IWMSMF90_LIST CHAR EXT;                                          00476000
* %DEACTIVATE IWMSMF90_LIST;                                            00477000
* %IF IWMSMF90_LIST = 'NO' !                                            00478000
*    ZCBPRINT = 'NO' %THEN                                              00479000
* %DO;                                                                  00480000
*   @LIST PUSH NOECHO;                                                  00481000
*   @LIST NOASSEMBLE NOECHO;                                            00482000
*   @LIST OFF C NOECHO;                                                 00483000
* %END;                                                                 00484000
*/* Start of PL/X Source                                             */ 00485000
*                                                                       00486000
*       /* SMF record Type 90 Subtype 23 -                              00487000
*          WLM Service Definition Install                            */ 00488000
*                                                                       00489000
* DECLARE                                                               00490000
*   1 SMF90T23 BASED(ADDR(SMFRCD90)+SMF90DOF),                          00491000
*     3 SMF90IDN CHAR(8),           /* Service definition name       */ 00492000
*     3 SMF90TDI CHAR(8),           /* Time/Date (STCK) of installation 00493000
*                                      in local time                 */ 00494000
*     3 SMF90IDU CHAR(8),           /* Userid of the service            00495000
*                                      administrator that install this  00496000
*                                      service definition            */ 00497000
*     3 SMF90IDS CHAR(8);           /* Name of the system on which the  00498000
*                                      service definition was installed 00499000
*                                                                    */ 00500000
*                                                                       00501000
*       /* SMF record Type 90 Subtype 24 -                              00502000
*          WLM Service Policy Activation                             */ 00503000
*                                                                       00504000
*/********************************************************************/ 00505000
*/*                                                                  */ 00506000
*/*  To map the WLM policy when SMF9024N = 1, simply base IWMSVPOL   */ 00507000
*/*  on ADDR(SMF90T24) + LENGTH(SMF9024P)                            */ 00508000
*/*                                                                  */ 00509000
*/*  To map the WLM policy when SMF9024N > 1,                        */ 00510000
*/*  A). Obtain a storage block equal to 32K * SMF9024N.             */ 00511000
*/*                                                                  */ 00512000
*/*  B). Read all (SMF9024N) Type 90, subtype 24 records that have   */ 00513000
*/*      the same unique identifier (SMF9024I).                      */ 00514000
*/*                                                                  */ 00515000
*/*  C). From the record with SMF9024S=1, copy the data              */ 00516000
*/*      beginning at SMF9024A                                       */ 00517000
*/*      for a copy length of SMF90DLN - LENGTH(SMF9024P)            */ 00518000
*/*      to the start of the obtained storage.                       */ 00519000
*/*                                                                  */ 00520000
*/*  D). From the record with SMF9024S=2, copy the data              */ 00521000
*/*      beginning at SMF9024A                                       */ 00522000
*/*      for a copy length of SMF90DLN-LENGTH(SMF9024P)              */ 00523000
*/*      to the byte in the obtained storage immediately after       */ 00524000
*/*      the data copied in step C.                                  */ 00525000
*/*                                                                  */ 00526000
*/*  E). Continue as above for all records including the one where   */ 00527000
*/*      SMF9024S=SMF9024N.                                          */ 00528000
*/*                                                                  */ 00529000
*/*  F). Use the IWMSVPOL mapping macro to map the obtained storage  */ 00530000
*/*      with the data merged from the several subtype 24 records.   */ 00531000
*/*                                                                  */ 00532000
*/********************************************************************/ 00533000
*                                                                       00534000
* DECLARE                                                               00535000
*   1 SMF90T24 BASED(ADDR(SMFRCD90)+SMF90DOF),                          00536000
*     3    SMF9024P BDY(DWORD),     /* Prefix area to subtype 24        00537000
*                                      Allows assembling several        00538000
*                                      records together to map the      00539000
*                                      entire WLM service policy @D1A*/ 00540000
*                                                                       00541000
*       5    SMF9024S FIXED(32),    /* Sequence number. When the        00542000
*                                      service policy is larger than    00543000
*                                      will fit in 1 subtype 24         00544000
*                                      record, this field describes     00545000
*                                      the order in which individual    00546000
*                                      records must be combined to      00547000
*                                      view the entire service policy   00548000
*                                                                @D1A*/ 00549000
*                                                                       00550000
*       5    SMF9024N FIXED(32),    /* Number of subtype 24 records     00551000
*                                      which must be combined to map    00552000
*                                      the policy. When 1 record is     00553000
*                                      enough, both SMF9024S and        00554000
*                                      SMF9024N will be 1.       @D1A*/ 00555000
*                                                                       00556000
*       5    SMF9024I CHAR(8),      /* Unique id that is used to        00557000
*                                      ensure all "N" records of 1      00558000
*                                      policy can be combined without   00559000
*                                      mixing data from 2 rapid VARY    00560000
*                                      policy commands.          @D1A*/ 00561000
*                                                                       00562000
*     3    SMF9024A CHAR(*);        /* The active service policy.       00563000
*                                      This area is mapped by IWMSVPOL. 00564000
*                                                                @D1A*/ 00565000
*                                                                       00566000
*       /* SMF record Type 90 Subtype 25 -                              00567000
*          Workload Management Mode Change                           */ 00568000
*                                                                       00569000
* DECLARE                                                               00570000
*   1 SMF90T25 BASED(ADDR(SMFRCD90)+SMF90DOF),                          00571000
*     3 SMF90MOD BIT(8),            /* Mode transition indicators    */ 00572000
*       5    SMF90MGM BIT(1),       /* Goal mode to compatibility mode  00573000
*                                                                    */ 00574000
*       5    SMF90MCM BIT(1),       /* Compatibility mode to goal mode  00575000
*                                                                    */ 00576000
*       5    *        BIT(6),       /* Reserved                      */ 00577000
*     3 SMF90MRS CHAR(3),           /* Reserved                      */ 00578000
*     3 SMF90MTD CHAR(8),           /* Time/Date (STCK) of mode         00579000
*                                      transition initiation         */ 00580000
*     3 SMF90NSP CHAR(8),           /* Service policy name           */ 00581000
*     3 SMF90TPA CHAR(8),           /* Time/Date (STCK) associated with 00582000
*                                      the initial activation of this   00583000
*                                      service policy in local time  */ 00584000
*     3 SMF90IPU CHAR(8),           /* Userid of the system operator or 00585000
*                                      service administrator that       00586000
*                                      activated this service policy */ 00587000
*     3 SMF90SNA CHAR(8),           /* System name (sysname) associated 00588000
*                                      with initial activation of this  00589000
*                                      service policy                */ 00590000
*     3 SMF9025N CHAR(8),           /* Service definition name from     00591000
*                                      which this service policy was    00592000
*                                      extracted                     */ 00593000
*     3 SMF9025T CHAR(8),           /* Time/Date (STCK) associated with 00594000
*                                      installation of this service     00595000
*                                      definition in local time      */ 00596000
*     3 SMF9025U CHAR(8),           /* Userid of the service            00597000
*                                      administrator who installed      00598000
*                                      the service definition        */ 00599000
*     3 SMF9025S CHAR(8),           /* Name of the system on which the  00600000
*                                      service definition was installed 00601000
*                                                                    */ 00602000
*     3 SMF90MOU CHAR(8);           /* Userid of the system operator    00603000
*                                      that initiated the mode changed  00604000
*                                                                    */ 00605000
*                                                                       00606000
*/*        SMF record Type 90 Subtype 30 -                           */ 00607000
*/*        RESET operator command processed.                         */ 00608000
*/*                                                                  */ 00609000
*/********************************************************************/ 00610000
*/*  SMF record Type 90 Subtype 30 - RESET operator command complete.*/ 00611000
*/*  This record will be generated whenever a RESET operator command */ 00612000
*/*  or an enclave RESET via IWMERES-service completes successfully. */ 00613000
*/*  For an address space, the record identifies the job that was    */ 00614000
*/*  reset, the operator that initiated the command, and the change  */ 00615000
*/*  that was requested.                                             */ 00616000
*/*  For an enclave, the record identifies the name of the owner     */ 00617000
*/*  address space, the user and application that initiated the      */ 00618000
*/*  request, and the change that was requested.             @WLMPECR*/ 00619000
*/********************************************************************/ 00620000
*                                                                       00621000
* DECLARE                                                               00622000
*   1 SMF90T30 BASED(ADDR(SMFRCD90)+SMF90DOF),                          00623000
*                                   /*                               */ 00624000
*     3 SMF90T30_JOBNAME   CHAR(8), /* Name of job that was reset.      00625000
*                                      Blank, if record represents an   00626000
*                                      enclave reset request.@WLMPECR*/ 00627000
*     3 SMF90T30_JOBID     CHAR(8), /* JES job id of that job. Blank    00628000
*                                      if no JSAB associated with job   00629000
*                                      or if record represents an       00630000
*                                      enclave reset request.@WLMPECR*/ 00631000
*                                   /*                               */ 00632000
*     3 SMF90T30_ENTRY_TIME BIN(32),/* Entry time in hundredths of a    00633000
*                                      second since midnight.           00634000
*                                      For a job, this is the program   00635000
*                                      entry time or zero, if no JSAB   00636000
*                                      is associated with the job.      00637000
*                                      For an enclave, this is the      00638000
*                                      time the enclave was created.    00639000
*                                                            @WLMPECR*/ 00640000
*                                   /*                               */ 00641000
*     3 SMF90T30_ENTRY_DATE CHAR(4),/* Entry date in the form 0cyydddF. 00642000
*                                      For a job, this is the program   00643000
*                                      entry data or zero, if no JSAB   00644000
*                                      is associated with the job.      00645000
*                                      For an enclave this is the       00646000
*                                      date the enclave was created.    00647000
*                                                            @WLMPECR*/ 00648000
*                                   /*                               */ 00649000
*     3 SMF90T30_OPERATOR  CHAR(8), /* Operator ID that issued RESET */ 00650000
*                                   /*                           @L3A*/ 00651000
*     3 SMF90T30_FLAGS     BIT(8),  /* Indicators                    */ 00652000
*                                   /*                               */ 00653000
*       5 SMF90T30_QUIESCE BIT(1),  /* QUIESCE operand used  @WLMPBAT*/ 00654000
*       5 SMF90T30_RESUME BIT(1),   /* RESUME  operand used  @WLMPBAT*/ 00655000
*       5 SMF90T30_SRVCLASS BIT(1), /* SRVCLASS operand used @PSY0114*/ 00656000
*       5 SMF90T30_PGN      BIT(1), /* PGN operand used      @PSY0114*/ 00657000
*       5 SMF90T30_EnclaveSrvclass Bit(1), /* The enclave service class 00658000
*                                             was reset      @WLMPECR*/ 00659000
*       5 SMF90T30_EnclaveQuiesce Bit(1),  /* The enclave was qiesced   00660000
*                                                            @WLMPECR*/ 00661000
*       5 SMF90T30_EnclaveResume Bit(1),   /* The enclave was resumed   00662000
*                                                            @WLMPECR*/ 00663000
*     3 SMF90T30_FLAGS2    Bit(8),  /* Additional characteristics       00664000
*                                                            @WLMPECR*/ 00665000
*       5 SMF90T30_IndependentEnclave Bit(1), /* On = original          00666000
*                                      independent enclave   @WLMPECR*/ 00667000
*     3 SMF90T30_RSV       CHAR(2), /* Reserved.             @WLMPECR*/ 00668000
*                                   /*                               */ 00669000
*     3 SMF90T30_OLDSRV    CHAR(8), /* Service class name that was      00670000
*                                      associated with the job or the   00671000
*                                      enclave before RESET was         00672000
*                                      processed.  Blank if system was  00673000
*                                      in compat mode.                  00674000
*                                      OLD and NEW service class are    00675000
*                                      identical when the RESET         00676000
*                                      QUIESCEd the address space or    00677000
*                                      the enclave.          @WLMPECR*/ 00678000
*     3 SMF90T30_NEWSRV    CHAR(8), /* Service class that was           00679000
*                                      associated with the job or the   00680000
*                                      enclave after RESET was          00681000
*                                      processed.  Blank for a system   00682000
*                                      in compat mode.                  00683000
*                                      OLD and NEW service class are    00684000
*                                      identical when the RESET         00685000
*                                      QUIESCEd the address space or    00686000
*                                      the enclave.          @WLMPECR*/ 00687000
*     3 SMF90T30_OLDPGN   FIXED(16),/* Performance group that was       00688000
*                                      associated with the job before   00689000
*                                      RESET was processed.  Zero if    00690000
*                                      system was in goal mode or if    00691000
*                                      record represents an enclave     00692000
*                                      reset request.        @WLMPECR*/ 00693000
*     3 SMF90T30_NEWPGN   FIXED(16),/* Performance group the job was    00694000
*                                      reset into. Zero if system was   00695000
*                                      in goal mode or if record        00696000
*                                      represents an enclave reset      00697000
*                                      request.              @WLMPECR*/ 00698000
*     3 SMF90T30_EnclaveOwner Char(8); /* Name of the address space     00699000
*                                      that owns the enclave. Blank,    00700000
*                                      if record represents a job       00701000
*                                      reset request.        @WLMPECR*/ 00702000
* Declare                                                               00703000
*   SMF90T30_CurrentVersion Char(2) Constant('03'); /*      @WI136758*/ 00704000
*                                                                       00705000
*/*        SMF record Type 90 Subtype 32 -                           */ 00706000
*/*        Scheduling Environment information.               @WLMPRES*/ 00707000
*/*                                                                  */ 00708000
*/********************************************************************/ 00709000
*/*  SMF record Type 90 Subtype 32 - Scheduling Environment          */ 00710000
*/*  information after a successful Policy change.           @WLMPRES*/ 00711000
*/********************************************************************/ 00712000
*                                                                       00713000
*/********************************************************************/ 00714000
*/*                                                                  */ 00715000
*/*  To map the Scheduling Environment structure when SMF9032N = 1,  */ 00716000
*/*  simply base IWMSVPSE on ADDR(SMF90T32) + LENGTH(SMF9032P)       */ 00717000
*/*                                                                  */ 00718000
*/*  To map the Schduling Environment structure when SMF9032N > 1,   */ 00719000
*/*                                                                  */ 00720000
*/*  A). Obtain a storage block equal to 32K * SMF9032N.             */ 00721000
*/*                                                                  */ 00722000
*/*  B). Read all (SMF9032N) Type 90, subtype 32 records that have   */ 00723000
*/*      the same unique identifier (SMF9032I).                      */ 00724000
*/*                                                                  */ 00725000
*/*  C). From the record with SMF9032S=1, copy the data              */ 00726000
*/*      beginning at SMF9032A                                       */ 00727000
*/*      for a copy length of SMF90DLN - LENGTH(SMF9032P)            */ 00728000
*/*      to the start of the obtained storage.                       */ 00729000
*/*                                                                  */ 00730000
*/*  D). From the record with SMF9032S=2, copy the data              */ 00731000
*/*      beginning at SMF9032A                                       */ 00732000
*/*      for a copy length of SMF90DLN-LENGTH(SMF9032P)              */ 00733000
*/*      to the byte in the obtained storage immediately after       */ 00734000
*/*      the data copied in step C.                                  */ 00735000
*/*                                                                  */ 00736000
*/*  E). Continue as above for all records including the one where   */ 00737000
*/*      SMF9032S=SMF9032N.                                          */ 00738000
*/*                                                                  */ 00739000
*/*  F). Use the IWMSVPSE mapping macro to map the obtained storage  */ 00740000
*/*      with the data merged from the several subtype 32 records.   */ 00741000
*/*                                                                  */ 00742000
*/*                                                          @WLMCRES*/ 00743000
*/********************************************************************/ 00744000
*                                                                       00745000
* DECLARE                                                               00746000
*   1 SMF90T32 BASED(ADDR(SMFRCD90)+SMF90DOF),                          00747000
*                                   /*                               */ 00748000
*     3    SMF9032P BDY(DWORD),     /* Prefix area to subtype 32        00749000
*                                      Allows assembling several        00750000
*                                      records together to map the      00751000
*                                      entire WLM service policy        00752000
*                                                            @WLMCRES*/ 00753000
*                                                                       00754000
*       5    SMF9032S FIXED(32),    /* Sequence number. When the        00755000
*                                      Scheduling Environment structure 00756000
*                                      is larger than will fit in 1     00757000
*                                      subtype 32 record, this field    00758000
*                                      describes the order in which     00759000
*                                      individual records must be       00760000
*                                      combined to view the entire      00761000
*                                      service policy.       @WLMCRES*/ 00762000
*                                                                       00763000
*       5    SMF9032N FIXED(32),    /* Number of subtype 32 records     00764000
*                                      which must be combined to map    00765000
*                                      the policy. When 1 record is     00766000
*                                      enough, both SMF9032S and        00767000
*                                      SMF9032N will be 1.   @WLMCRES*/ 00768000
*                                                                       00769000
*       5    SMF9032I CHAR(8),      /* Unique id that is used to        00770000
*                                      ensure all "N" records of 1      00771000
*                                      policy can be combined without   00772000
*                                      mixing data from 2 rapid VARY    00773000
*                                      policy commands.      @WLMCRES*/ 00774000
*                                                                       00775000
*     3    SMF9032A CHAR(*);        /* The active service policy.       00776000
*                                      This area is mapped by IWMSVPSE. 00777000
*                                                            @WLMCRES*/ 00778000
*/* End of PL/X Source                                               */ 00779000
* %IF IWMSMF90_LIST = 'NO' !                                            00780000
*    ZCBPRINT = 'NO' %THEN                                              00781000
* %DO;                                                                  00782000
*   @LIST POP NOECHO;                                                   00783000
* %END;                                                                 00784000
* %END;                                                                 00785000
