*                                                                       00001000
* %DCL IWMWQTAA_INCLUDED CHAR EXT;                                      00002000
* %DEACTIVATE IWMWQTAA_INCLUDED;                                        00003000
* %IF IWMWQTAA_INCLUDED = '' %THEN                                      00004000
* %DO;                                                                  00005000
*/* Macro made bi-lingual on 18319. CBGEN compile date 15295         */ 00006000
*% /*                                                                   00007000
         MACRO                                                          00008000
         IWMWQTAA &DSECT=YES,&LIST=YES,&TITLE=YES,&QTAA=YES,&QTRG=COND  00009000
                 GBLC  &IWMWQTAA_INCLUDED                               00010000
                 GBLC  &ZCBPRINT                                        00011000
&IWMWQTAA_INCLUDED SETC 'YES'                                           00012000
                 AIF   ('&LIST' EQ 'NONE').P0                           00013000
                 AIF   ('&TITLE' EQ 'NO').P5                            00014000
 TITLE           'IWMWQTAA  - IWM4QTNT answer area (QTAA)              *00015000
                  '                                                     00016000
.P5              ANOP                                                   00017000
**/ IWMWQTAA_1:;                                                        00018000
*/** Start of Specifications *****************************************/ 00019000
*/*                                                                  */ 00020000
*/*01* Macro Name:  IWMWQTAA                                         */ 00021000
*/*                                                                  */ 00022000
*/*01* Descriptive Name: IWM4QTNT answer area (QTAA)                 */ 00023000
*/*                                                                  */ 00024000
*/*01* Copyright =                                                   */ 00025000
*/*        Licensed Materials - Property of IBM                      */ 00026000
*/*        5650-ZOS Copyright IBM Corp. 2017, 2019                   */ 00027000
*/*                                                                  */ 00028000
*/*                                                                  */ 00029000
*/*01* STATUS = HBB77C0                                     @WI281486*/ 00030000
*/*                                                                  */ 00031000
*/*01* EXTERNAL CLASSIFICATION: PI                                   */ 00032000
*/*01* END OF EXTERNAL CLASSIFICATION:                               */ 00033000
*/*                                                                  */ 00034000
*/*01* Function:                                                     */ 00035000
*/*                                                                  */ 00036000
*/*        Contains reporting information for tenants resource       */ 00037000
*/*        groups in the WLM service definition.                     */ 00038000
*/*                                                                  */ 00039000
*/*01* DSECT Name:                                                   */ 00040000
*/*        QTAA                                                      */ 00041000
*/*        QTRG                                                      */ 00042000
*/*                                                                  */ 00043000
*/*01* Component:  Workload Manager (SCWLM)                          */ 00044000
*/*                                                                  */ 00045000
*/*01* Eye-Catcher:  IWMWQTAA                                        */ 00046000
*/*02*     Offset:   0                                               */ 00047000
*/*02*     Length:   8                                               */ 00048000
*/*                                                                  */ 00049000
*/*01* Method of Access:                                             */ 00050000
*/*                                                                  */ 00051000
*/*02*  ASM:                                                         */ 00052000
*/*        IWMWQTAA                                                  */ 00053000
*/*                                                                  */ 00054000
*/*02*  PL/X:                                                        */ 00055000
*/*                                                                  */ 00056000
*/*        Declare QTAAPtr                                           */ 00057000
*/*        %INCLUDE SYSLIB(IWMWQTAA)                                 */ 00058000
*/*                                                                  */ 00059000
*/*02*  VIA Attribute:                                               */ 00060000
*/*                                                                  */ 00061000
*/*        Specify %QTAAVIA = 'YES' prior to %INCLUDE statement      */ 00062000
*/*        Declare QTAAALET                                          */ 00063000
*/*        For VIA(0) specify %GLOBALARMODE='YES'                    */ 00064000
*/*                                                                  */ 00065000
*/*01* Size:                                                         */ 00066000
*/*        QTAA        --  32 bytes                                  */ 00067000
*/*        QTRG        -- 192 bytes                         @WI281486*/ 00068000
*/*                                                                  */ 00069000
*/*01* Storage Attributes:                                           */ 00070000
*/*02*  Subpool:     User assigned                                   */ 00071000
*/*02*  Key:         0-15                                            */ 00072000
*/*02*  Residency:   Anywhere                                        */ 00073000
*/*                                                                  */ 00074000
*/*01* Created by:                                                   */ 00075000
*/*        Caller of IWM4QTNT                                        */ 00076000
*/*                                                                  */ 00077000
*/*01* Pointed to by:                                                */ 00078000
*/*        Pointed to by the ANSAREA_ADDR field in the               */ 00079000
*/*        IWM4QTNT parameter list                                   */ 00080000
*/*                                                                  */ 00081000
*/*01* Serialization:  None                                          */ 00082000
*/*                                                                  */ 00083000
*/*                                                                  */ 00084000
*/*01* Change Activity:                                              */ 00085000
*/*                                                                  */ 00086000
*/*    $L0=OA52312 HBB77B0 170110 3241MG: Matthias Gubitz    @LWBGRP */ 00087000
*/*                                       Workload billing groups    */ 00088000
*/*    $WI281486   HBB77C0 181106 3241MG: Matthias Gubitz            */ 00089000
*/*                                       WLM metering for memory    */ 00090000
*/*    $LHWCON     HBB77C0 181107 3241MG: Matthias Gubitz            */ 00091000
*/*                                       zCBP support               */ 00092000
*/*                                                                  */ 00093000
*/** End of Specifications *******************************************/ 00094000
*% /*                                                                   00095000
.P0              ANOP                                                   00096000
                 AIF   ('&ZCBPRINT' EQ 'NO').P1                         00097000
                 AIF   ('&LIST' EQ 'YES').P2                            00098000
.P1              ANOP                                                   00099000
                 PUSH  PRINT                                            00100000
                 PRINT OFF                                              00101000
.P2              ANOP                                                   00102000
                 AIF   ('&QTAA' EQ 'NO').L0002                          00103000
                 AIF   ('&DSECT' EQ 'YES').L0003                        00104000
                 AIF   ('&QTAA' NE 'YES').L0002                         00105000
QTAA             DS    0F          Header of answer area                00106000
                 AGO   .L0004                                           00107000
.L0003           ANOP                                                   00108000
QTAA             DSECT             Header of answer area                00109000
.L0004           ANOP                                                   00110000
QTAA_Acronym     DS    CL8         Acronym IWMWQTAA                     00111000
QTAA_Version     DS    X           Version number                       00112000
QTAA_Rsv1        DS    CL3         Reserved                             00113000
QTAA_Size        DS    F           Total size of QTAA and all of its   *00114000
                                   QTRG parts                           00115000
QTAA_QTRG_Num    DS    H           Total number of QTRG entries         00116000
QTAA_QTRG_Len    DS    H           Length of one QTRG entry             00117000
QTAA_QTRG_Offs   DS    F           Offset from QTAA to first QTRG      *00118000
                                   entry if QTAA_QTRG_Num is greater   *00119000
                                   than zero                            00120000
QTAA_MemSmpCnt   DS    F           Number of times sampling of tenant  *00121000
                                   resource group memory consumption   *00122000
                                   took place since IPL or policy      *00123000
                                   change                               00124000
QTAA_Rsv2        DS    CL4         Reserved                             00125000
.L0002           ANOP                                                   00126000
                 AIF   ('&QTRG' EQ 'NO').L0005                          00127000
                 AIF   ('&DSECT' EQ 'YES').L0006                        00128000
                 AIF   ('&QTRG' NE 'YES').L0005                         00129000
QTRG             DS    0D          Tenant resource group entry          00130000
                 AGO   .L0007                                           00131000
.L0006           ANOP                                                   00132000
QTRG             DSECT             Tenant resource group entry          00133000
.L0007           ANOP                                                   00134000
QTRG_Acronym     DS    CL4         Acronym QTRG                         00135000
QTRG_Name        DS    CL8         Tenant resource group name           00136000
QTRG_Description DS    CL32        Description                          00137000
QTRG_SolutionID  DS    CL64        Solution identifier                  00138000
QTRG_TenantID    DS    CL8         Tenant identifier                    00139000
QTRG_TenantName  DS    CL32        Tenant name                          00140000
QTRG_LACS        DS    F           Tenant resource group's long- term  *00141000
                                   average service on general purpose  *00142000
                                   processors in millions of service   *00143000
                                   units per hour                       00144000
QTRG_SUsCP       DS    FL8         Tenant resource group's total       *00145000
                                   unweighted CP service units since   *00146000
                                   IPL or policy change                 00147000
QTRG_SUs_zCBP    DS    FL8         Tenant resource group's total       *00148000
                                   unweighted zCBP service units since *00149000
                                   IPL or policy change                 00150000
                 ORG   QTRG_SUs_zCBP                                    00151000
QTRG_SUsIFA      DS    FL8         Tenant resource group's total       *00152000
                                   unweighted IFA service units since  *00153000
                                   IPL or policy change                 00154000
QTRG_SUsSUP      DS    FL8         Tenant resource group's total       *00155000
                                   unweighted SUP service units since  *00156000
                                   IPL or policy change                 00157000
QTRG_AccuMemUsg  DS    FL8         Tenant resource group's accumulated *00158000
                                   memory consumption in units of 4K   *00159000
                                   frames since IPL or policy change.  *00160000
                                   Divide by QTAA_MemSmpCnt to get the *00161000
                                   average consumption                  00162000
QTRG_LACS_zCBP   DS    F           Tenant resource group's long- term  *00163000
                                   average service on zCBP processors  *00164000
                                   in millions of service units per    *00165000
                                   hour. Only valid if                 *00166000
                                   QTRG_HwContainer is set              00167000
QTRG_Flags       DS    BL2         Flags                                00168000
*  Bit definitions:                                                     00169000
QTRG_HwContainer EQU   X'80'       Tenant resource group is enabled    *00170000
                                   for zCBP.                            00171000
QTRG_Rsv1        DS    CL2         Reserved                             00172000
QTAA_Acro_0TO3   EQU   C'IWMW'     This is the first 4-byte segment of *00173000
                                   an 8-byte constant.                  00174000
QTAA_Acro_4TO7   EQU   C'QTAA'     This is the second 4-byte segment   *00175000
                                   of an 8-byte constant.               00176000
QTRG_Acro        EQU   C'QTRG'                                          00177000
QTAA_Version1    EQU   1                                                00178000
QTAA_Version2    EQU   2                                                00179000
QTAA_CVersion    EQU   2                                                00180000
.L0005           ANOP                                                   00181000
                 AIF   ('&ZCBPRINT' EQ 'NO').P3                         00182000
                 AIF   ('&LIST' EQ 'YES').P4                            00183000
.P3              ANOP                                                   00184000
                 POP   PRINT                                            00185000
.P4              ANOP                                                   00186000
.P_EXIT          ANOP                                                   00187000
                 MEND                                                   00188000
**/ IWMWQTAA_2:;                                                        00189000
* %IWMWQTAA_INCLUDED = 'YES';                                           00190000
* %DCL ZCBPRINT CHAR EXT;                                               00191000
* %DEACTIVATE ZCBPRINT;                                                 00192000
* %DCL IWMWQTAA_LIST CHAR EXT;                                          00193000
* %DEACTIVATE IWMWQTAA_LIST;                                            00194000
* %IF IWMWQTAA_LIST ^= 'NO' &                                           00195000
*    ZCBPRINT ^= 'NO' %THEN                                             00196000
*   %GOTO IWMWQTAA_3;                                                   00197000
*   @LIST PUSH NOECHO;                                                  00198000
*   @LIST NOASSEMBLE NOECHO;                                            00199000
*   @LIST OFF C NOECHO;                                                 00200000
* %IWMWQTAA_3:;                                                         00201000
*/* Start of PL/X Source                                             */ 00202000
*%IF QTAAVIA = 'YES' %THEN %QTAAVIA = 'Via(QTAAALET)';                  00203000
*%ELSE                                                                  00204000
*  %IF GLOBALARMODE = 'YES' %THEN %QTAAVIA = 'Via(0)';                  00205000
*  %ELSE %QTAAVIA = '';                                                 00206000
*                                                                       00207000
*Declare                                                                00208000
*  1  QTAA QTAAVIA Based(QTAAPtr),  /* Header of answer area         */ 00209000
*   3  QTAA_Acronym     Char(8),    /* Acronym IWMWQTAA              */ 00210000
*   3  QTAA_Version     Fixed(8),   /* Version number                */ 00211000
*   3  QTAA_Rsv1        Char(3),    /* Reserved                      */ 00212000
*   3  QTAA_Size        Fixed(32),  /* Total size of QTAA and all of    00213000
*                                      its QTRG parts                */ 00214000
*   3  QTAA_QTRG_Num    Fixed(16),  /* Total number of QTRG entries  */ 00215000
*   3  QTAA_QTRG_Len    Fixed(16),  /* Length of one QTRG entry      */ 00216000
*   3  QTAA_QTRG_Offs   Fixed(32),  /* Offset from QTAA to first QTRG   00217000
*                                      entry if QTAA_QTRG_Num is        00218000
*                                      greater than zero             */ 00219000
*   3  QTAA_MemSmpCnt   Fixed(32),  /* Number of times sampling of      00220000
*                                      tenant resource group memory     00221000
*                                      consumption took place since     00222000
*                                      IPL or policy change @WI281486*/ 00223000
*   3  QTAA_Rsv2        Char(4);    /* Reserved             @WI281486*/ 00224000
*                                                                       00225000
*%IF IWMWQTAA_NO_ISA ^= 'YES' %THEN %DO;                                00226000
*Declare                                                                00227000
*  QTRG IsA(QTRG_Type) QTAAVIA Based; /* QTRG item                   */ 00228000
*%END;                                                                  00229000
*                                                                       00230000
*Declare                                                                00231000
*  1  QTRG_Type         Type,       /* Tenant resource group entry   */ 00232000
*   3  QTRG_Acronym     Char(4),    /* Acronym QTRG                  */ 00233000
*   3  QTRG_Name        Char(8),    /* Tenant resource group name    */ 00234000
*   3  QTRG_Description Char(32),   /* Description                   */ 00235000
*   3  QTRG_SolutionID  Char(64),   /* Solution identifier           */ 00236000
*   3  QTRG_TenantID    Char(8),    /* Tenant identifier             */ 00237000
*   3  QTRG_TenantName  Char(32),   /* Tenant name                   */ 00238000
*   3  QTRG_LACS        Fixed(32),  /* Tenant resource group's long-    00239000
*                                      term average service on general  00240000
*                                      purpose processors in millions   00241000
*                                      of service units per hour     */ 00242000
*   3  QTRG_SUsCP       Fixed(64),  /* Tenant resource group's total    00243000
*                                      unweighted CP service units      00244000
*                                      since IPL or policy change    */ 00245000
*   3  QTRG_SUs_zCBP    Fixed(64),  /* Tenant resource group's total    00246000
*                                      unweighted zCBP service units    00247000
*                                      since IPL or policy change       00248000
*                                                            @LHWCONA*/ 00249000
*    5  QTRG_SUsIFA     Fixed(64),  /* Tenant resource group's total    00250000
*                                      unweighted IFA service units     00251000
*                                      since IPL or policy change       00252000
*                                                            @LHWCONC*/ 00253000
*   3  QTRG_SUsSUP      Fixed(64),  /* Tenant resource group's total    00254000
*                                      unweighted SUP service units     00255000
*                                      since IPL or policy change    */ 00256000
*   3  QTRG_AccuMemUsg  Fixed(64),  /* Tenant resource group's          00257000
*                                      accumulated memory consumption   00258000
*                                      in units of 4K frames since      00259000
*                                      IPL or policy change. Divide     00260000
*                                      by QTAA_MemSmpCnt to get the     00261000
*                                      average consumption  @WI281486*/ 00262000
*   3  QTRG_LACS_zCBP   Fixed(32),  /* Tenant resource group's long-    00263000
*                                      term average service on zCBP     00264000
*                                      processors in millions of        00265000
*                                      service units per hour. Only     00266000
*                                      valid if QTRG_HwContainer is     00267000
*                                      set                   @LHWCONA*/ 00268000
*   3  QTRG_Flags       Bit(16),    /* Flags                 @LHWCONA*/ 00269000
*    5  QTRG_HwContainer Bit(1),    /* Tenant resource group is         00270000
*                                      enabled for zCBP.     @LHWCONA*/ 00271000
*   3  QTRG_Rsv1        Char(2);    /* Reserved              @LHWCONA*/ 00272000
*                                                                       00273000
*Declare                                                                00274000
*  QTAA_Acro     Char(8)  Constant('IWMWQTAA'),                         00275000
*  QTRG_Acro     Char(4)  Constant('QTRG'),                             00276000
*  QTAA_Version1 Fixed(8) Constant(1),                                  00277000
*  QTAA_Version2 Fixed(8) Constant(2),                   /* @WI281486*/ 00278000
*  QTAA_CVersion Fixed(8) Constant(QTAA_Version2);       /* @WI281486*/ 00279000
*                                                                       00280000
*@LOGIC;                                                                00281000
*#PRAGMA TOOL=CBGEN.                                                    00282000
*#LINE.%IWMWQTAA_NO_ISA = 'YES';                                        00283000
*#LINE.%QTRG_TYPE = 'QTRG';                                             00284000
*#LINE.%INCLUDE SYSLIB(IWMWQTAA);                                       00285000
*#USEORG.                                                               00286000
*#AlignOp.                                                              00287000
*#NotUpper.                                                             00288000
*#NoLen.                                                                00289000
*#EPRAGMA.                                                              00290000
*@ENDLOGIC;                                                             00291000
*/* End of PL/X Source                                               */ 00292000
* %IF IWMWQTAA_LIST ^= 'NO' &                                           00293000
*    ZCBPRINT ^= 'NO' %THEN                                             00294000
*   %GOTO IWMWQTAA_4;                                                   00295000
*   @LIST POP NOECHO;                                                   00296000
* %IWMWQTAA_4:;                                                         00297000
* %END;                                                                 00298000
