*                                                                       00001000
* %DCL IWMWGDD_INCLUDED CHAR EXT;                                       00002000
* %DEACTIVATE IWMWGDD_INCLUDED;                                         00003000
* %IF IWMWGDD_INCLUDED = '' %THEN                                       00004000
* %DO;                                                                  00005000
*/* Macro made bi-lingual on 21209. CBGEN compile date 21138         */ 00006000
*% /*                                                                   00007000
         MACRO                                                          00008000
         IWMWGDD &DSECT=YES,&LIST=YES,&TITLE=YES,&IWMWGDD=YES,         *00009000
               &IWMWGENTS=COND                                          00010000
                      GBLC  &IWMWGDD_INCLUDED                           00011000
                      GBLC  &ZCBPRINT                                   00012000
&IWMWGDD_INCLUDED     SETC  'YES'                                       00013000
                      AIF   ('&LIST' EQ 'NONE').P0                      00014000
                      AIF   ('&TITLE' EQ 'NO').P5                       00015000
 TITLE                'IWMWGDD  - Descriptions Mapping for service IWM4*00016000
               MGDD     '                                               00017000
.P5                   ANOP                                              00018000
**/ ;                                                                   00019000
*/* START OF SPECIFICATIONS ******************************************* 00020000
**                                                                      00021000
**01* PROPRIETARY STATEMENT=                                            00022000
**          Licensed Materials - Property of IBM                        00023000
**          5694-A01 Copyright IBM Corp. 2008                           00024000
**          Status = HBB7750                                            00025000
**                                                                      00026000
**01* EXTERNAL CLASSIFICATION: PI                              @ME10498 00027000
**01* END OF EXTERNAL CLASSIFICATION                                    00028000
**                                                                      00029000
**01* DESCRIPTIVE NAME:  Descriptions Mapping for service IWM4MGDD      00030000
**02*  ACRONYM:  IWMWGDD                                                00031000
**                                                                      00032000
**01* MACRO NAME:  IWMWGDD                                              00033000
**                                                                      00034000
**01* DSECT NAME:                                                       00035000
**     IWMWGDD                                                          00036000
**                                                                      00037000
**01* COMPONENT:  WLM (SCWLM)                                           00038000
**                                                                      00039000
**01* EYE-CATCHER:  IWMWGDD                                             00040000
***02*  Offset: 0                                                       00041000
***02*  Length: CHAR(7)                                                 00042000
**                                                                      00043000
**01* STORAGE ATTRIBUTES:                                               00044000
**02*  Subpool: Any                                                     00045000
**02*  Key: See requirements for macro IWM4WGDD                         00046000
**02*  Residency: Above 16M line                                        00047000
**                                                                      00048000
**01* Size: Determined at run time                             @ME11414 00049000
**            IWMWGDD   -- X'0016' bytes                                00050000
**            IWMWGENTS -- X'0012' bytes                                00051000
**                                                                      00052000
**01* Created by: Caller of IWM4WGDD                                    00053000
**                                                                      00054000
**01* POINTED TO BY: Pointer to descriptions in IWM4WGDD parameter list 00055000
**                                                                      00056000
**01* SERIALIZATION: Responsibility of IWM4WGDD caller                  00057000
**                                                                      00058000
**01* FUNCTION: Maps IWM4WGDD descriptions list                         00059000
**                                                                      00060000
**                                                                      00061000
**01* METHOD OF ACCESS:                                                 00062000
**                                                                      00063000
**02*  ASM:                                                             00064000
**                                                                      00065000
**      IWMWGDD                                                         00066000
**                                                                      00067000
**02*  PLX                                                              00068000
**                                                                      00069000
**      %INCLUDE SYSLIB(IWMWGDD)                                        00070000
**                                                                      00071000
**01*  USAGE NOTES:                                                     00072000
**                                                                      00073000
**01* DEPENDENCIES:  None                                               00074000
**                                                                      00075000
**01* CHANGE ACTIVITY:                                                  00076000
**                                                                      00077000
**   $L0=LPBDEL   HBB7750 070531 3241KHH: K.-H. Holder                  00078000
**                                        add descriptions for generic  00079000
**                                        PB delays                     00080000
**                                                                      00081000
**   $ME10016  HBB7750 070417 3241BH:  Bill Heisser                     00082000
**                                     checker hit - I B M Internal     00083000
**                                                                      00084000
**   $ME10498  HBB7750 070619 3241BH:  Bill Heisser                     00085000
**                                     checker hit for ME10497 -        00086000
**                                     incorrect Ext Class specified    00087000
**                                                                      00088000
**   $ME11414  HBB7750 071002 3241BH:  Bill Heisser                     00089000
**                                     SHOWHDR hit - missing SIZE       00090000
**                                     keyword                          00091000
**                                                                      00092000
** END OF SPECIFICATIONS *********************************************/ 00093000
*% /*                                                                   00094000
.P0                   ANOP                                              00095000
                      AIF   ('&ZCBPRINT' EQ 'NO').P1                    00096000
                      AIF   ('&LIST' EQ 'YES').P2                       00097000
.P1                   ANOP                                              00098000
                      PUSH  PRINT                                       00099000
                      PRINT OFF                                         00100000
.P2                   ANOP                                              00101000
                      AIF   ('&IWMWGDD' EQ 'NO').L0002                  00102000
                      AIF   ('&DSECT' EQ 'YES').L0003                   00103000
                      AIF   ('&IWMWGDD' NE 'YES').L0002                 00104000
.L0003                ANOP                                              00105000
*                                                                       00106000
* ********************************************************************  00107000
* * Mapping for descriptions for generic PB delays                   *  00108000
* ********************************************************************  00109000
*                                                                       00110000
*                                                                       00111000
                      AIF   ('&DSECT' EQ 'YES').L0004                   00112000
IWMWGDD               DS    0D                                          00113000
                      AGO   .L0005                                      00114000
.L0004                ANOP                                              00115000
IWMWGDD               DSECT                                             00116000
.L0005                ANOP                                              00117000
IWMWGEYE              DS    CL8    Eye catcher, must be set by user to *00118000
                                   IWMWGDD_Id_Const                     00119000
IWMWGNXT              DS    A      I B M internal use only, must be    *00120000
                                   set to 0 by user                     00121000
IWMWGVER              DS    X      Version # of this macro, must be    *00122000
                                   set by user to IWMWGDD_Version0      00123000
IWMWGRC               DS    X      Return code that indicates improper *00124000
                                   values in this data area. Is valid  *00125000
                                   only if rc = IwmRetCodeInvocError   *00126000
                                   and rsn code =                      *00127000
                                   IwmRsnCodeBadRequestList for        *00128000
                                   service IWM4MGDD.                    00129000
IWMWGSUB              DS    CL6    Subsystem identification             00130000
                      ORG   IWMWGSUB                                    00131000
IWMWGTYP              DS    CL4    Subsystem type, use the same as was *00132000
                                   used for the creation of PBs, in    *00133000
                                   service IWM4MCRE                     00134000
IWMWGSVER             DS    CL2    Subsystem Version, vv.rr             00135000
                      ORG   IWMWGSVER                                   00136000
IWMWGSVV              DS    X      Version of the subsystem instance   *00137000
                                   that is using this macro             00138000
IWMWGSRR              DS    X      Release of the subsystem instance   *00139000
                                   that is using this macro             00140000
IWMWGNUM              DS    H      Number of definitions in this data  *00141000
                                   area. Must be between 0 and         *00142000
                                   IWMWGDD_Tnum_Max                     00143000
IWMWGDEFS             DS    0C     Data for definitions will follow    *00144000
                                   directly here                        00145000
IWMWGDD_Len           EQU   *-IWMWGDD                                   00146000
.L0002                ANOP                                              00147000
                      AIF   ('&IWMWGENTS' EQ 'NO').L0006                00148000
                      AIF   ('&DSECT' EQ 'YES').L0007                   00149000
                      AIF   ('&IWMWGENTS' NE 'YES').L0006               00150000
IWMWGENTS             DS    0H                                          00151000
                      AGO   .L0008                                      00152000
.L0007                ANOP                                              00153000
IWMWGENTS             DSECT                                             00154000
.L0008                ANOP                                              00155000
IWMWGENT              DS    CL18   One definition entry                 00156000
                      ORG   IWMWGENT                                    00157000
IWMWGTNUM             DS    H      Number of a generic delay, must be  *00158000
                                   between IWMWGDD_Tnum_Min and        *00159000
                                   IWMWGDD_Tnum_Max                     00160000
IWMWGTDSC             DS    CL16   Description for the generic delay   *00161000
                                   state                                00162000
IWMWGDD_Id_Const_0TO3 EQU   C'IWMW' This is the first 4-byte segment   *00163000
                                   of an 8-byte constant.               00164000
IWMWGDD_Id_Const_4TO7 EQU   C'GDD ' This is the second 4-byte segment  *00165000
                                   of an 8-byte constant.               00166000
IWMWGDD_Nxt           EQU   0                                           00167000
IWMWGDD_Version0      EQU   0                                           00168000
IWMWGDD_Tnum_Min      EQU   1                                           00169000
IWMWGDD_Tnum_Max      EQU   15                                          00170000
IWMWGDD_Typ           EQU   C'    '                                     00171000
*                                                                       00172000
*   The following constants define the possible return values in        00173000
*   field IWMWGRC.                                                      00174000
*                                                                       00175000
*                                                                       00176000
IWMWGDD_FailCode_Ok   EQU   0      field IWMWGEYE is not properly set  *00177000
                                   field IWMWGVER is not properly set  *00178000
                                   field IWMWGNXT is not properly set  *00179000
                                   field IWMWGTYP is blank. field      *00180000
                                   IWMWGNUM is not properly set field  *00181000
                                   IWMWGTNUM is not properly set        00182000
IWMWGDD_FailCode_WrongId EQU 1     field IWMWGEYE is not properly set   00183000
IWMWGDD_FailCode_WrongVersion EQU 2 field IWMWGVER is not properly set  00184000
IWMWGDD_FailCode_WrongNxt EQU 3    field IWMWGNXT is not properly set   00185000
IWMWGDD_FailCode_WrongTyp EQU 4    field IWMWGTYP is blank.             00186000
IWMWGDD_FailCode_WrongNum EQU 5    field IWMWGNUM is not properly set   00187000
IWMWGDD_FailCode_WrongTnum EQU 6   field IWMWGTNUM is not properly set  00188000
IWMWGENTS_Len         EQU   *-IWMWGENTS                                 00189000
.L0006                ANOP                                              00190000
                      AIF   ('&ZCBPRINT' EQ 'NO').P3                    00191000
                      AIF   ('&LIST' EQ 'YES').P4                       00192000
.P3                   ANOP                                              00193000
                      POP   PRINT                                       00194000
.P4                   ANOP                                              00195000
.P_EXIT               ANOP                                              00196000
                      MEND                                              00197000
**/ ;                                                                   00198000
* %IWMWGDD_INCLUDED = 'YES';                                            00199000
* %DCL ZCBPRINT CHAR EXT;                                               00200000
* %DEACTIVATE ZCBPRINT;                                                 00201000
* %DCL IWMWGDD_LIST CHAR EXT;                                           00202000
* %DEACTIVATE IWMWGDD_LIST;                                             00203000
* %IF IWMWGDD_LIST = 'NO' !                                             00204000
*    ZCBPRINT = 'NO' %THEN                                              00205000
* %DO;                                                                  00206000
*   @LIST PUSH NOECHO;                                                  00207000
*   @LIST NOASSEMBLE NOECHO;                                            00208000
*   @LIST OFF C NOECHO;                                                 00209000
* %END;                                                                 00210000
*/* Start of PL/X Source                                             */ 00211000
*/********************************************************************/ 00212000
*/* Mapping for descriptions for generic PB delays                   */ 00213000
*/********************************************************************/ 00214000
*Dcl 1 IWMWGDD Based Bdy(DWord),                                        00215000
*      3 IWMWGEYE CHAR(8),      /* Eye catcher, must be set by user to  00216000
*                                  IWMWGDD_Id_Const */                  00217000
*      3 IWMWGNXT Ptr(31),      /* I B M internal use only, must be set 00218000
*                                  to 0 by user              @ME10016*/ 00219000
*      3 IWMWGVER Fixed(8),     /* Version # of this macro, must be set 00220000
*                                  by user to IWMWGDD_Version0 */       00221000
*      3 IWMWGRC Fixed(8),      /* Return code that indicates           00222000
*                                  improper values in this data area.   00223000
*                                  Is valid only if                     00224000
*                                  rc = IwmRetCodeInvocError and        00225000
*                                  rsn code = IwmRsnCodeBadRequestList  00226000
*                                  for service IWM4MGDD. */             00227000
*      3 IWMWGSUB CHAR(6),      /* Subsystem identification */          00228000
*        5 IWMWGTYP CHAR(4),    /* Subsystem type, use the same as was  00229000
*                                  used for the creation of PBs, in     00230000
*                                  service IWM4MCRE */                  00231000
*        5 IWMWGSVER CHAR(2),   /* Subsystem Version, vv.rr */          00232000
*          7 IWMWGSVV Fixed(8), /* Version of the subsystem instance    00233000
*                                  that is using this macro */          00234000
*          7 IWMWGSRR Fixed(8), /* Release of the subsystem instance    00235000
*                                  that is using this macro */          00236000
*      3 IWMWGNUM Fixed(16),    /* Number of definitions in this data   00237000
*                                  area. Must be between 0 and          00238000
*                                  IWMWGDD_Tnum_Max */                  00239000
*      3 IWMWGDEFS CHAR(0);     /* Data for definitions will follow     00240000
*                                  directly here */                     00241000
*                                                                       00242000
*Dcl 1 IWMWGENTS(*) Based(ADDR(IWMWGDEFS)),                             00243000
*      3 IWMWGENT,              /* One definition entry */              00244000
*        5 IWMWGTNUM FIXED(16), /* Number of a generic delay, must be   00245000
*                                  between IWMWGDD_Tnum_Min and         00246000
*                                  IWMWGDD_Tnum_Max */                  00247000
*        5 IWMWGTDSC CHAR(16);  /* Description for the generic delay    00248000
*                                  state */                             00249000
*                                                                       00250000
*Dcl IWMWGDD_Id_Const   Char(8)      Constant('IWMWGDD ');              00251000
*Dcl IWMWGDD_Nxt        Ptr(31)      Constant(0);                       00252000
*Dcl IWMWGDD_Version0   Fixed(8)     Constant(0);                       00253000
*Dcl IWMWGDD_Tnum_Min   Fixed(16)    Constant(1);                       00254000
*Dcl IWMWGDD_Tnum_Max   Fixed(16)    Constant(15);                      00255000
*Dcl IWMWGDD_Typ        Char(4)      Constant('    ');                  00256000
*                                                                       00257000
*/* The following constants define the possible return values in        00258000
*   field IWMWGRC. */                                                   00259000
*                                                                       00260000
*Dcl (IWMWGDD_FailCode_Ok              Constant(0)                      00261000
*    ,IWMWGDD_FailCode_WrongId         Constant(1) /* field IWMWGEYE    00262000
*                                      is not properly set        */    00263000
*    ,IWMWGDD_FailCode_WrongVersion    Constant(2) /* field IWMWGVER    00264000
*                                      is not properly set        */    00265000
*    ,IWMWGDD_FailCode_WrongNxt        Constant(3) /* field IWMWGNXT    00266000
*                                      is not properly set        */    00267000
*    ,IWMWGDD_FailCode_WrongTyp        Constant(4) /* field IWMWGTYP    00268000
*                                      is blank.                  */    00269000
*    ,IWMWGDD_FailCode_WrongNum        Constant(5) /* field IWMWGNUM    00270000
*                                      is not properly set        */    00271000
*    ,IWMWGDD_FailCode_WrongTnum       Constant(6) /* field IWMWGTNUM   00272000
*                                      is not properly set         */   00273000
*    ) Fixed(8);                                                        00274000
*                                                                       00275000
*/********************************************************************/ 00276000
*                                                                       00277000
*/********************************************************************/ 00278000
*@LOGIC;                                                                00279000
*#PRAGMA TOOL=CBGEN.                                                    00280000
*#USEORG.                                                               00281000
*#ALIGNOP.                                                              00282000
*#NOTUPPER.                                                             00283000
*#EPRAGMA.                                                              00284000
*@ENDLOGIC;                                                             00285000
*/* End of PL/X Source                                               */ 00286000
* %IF IWMWGDD_LIST = 'NO' !                                             00287000
*    ZCBPRINT = 'NO' %THEN                                              00288000
* %DO;                                                                  00289000
*   @LIST POP NOECHO;                                                   00290000
* %END;                                                                 00291000
* %END;                                                                 00292000
