*                                                                       00001000
* %DCL IWMWSYSR_INCLUDED CHAR EXT;                                      00002000
* %DEACTIVATE IWMWSYSR_INCLUDED;                                        00003000
* %IF IWMWSYSR_INCLUDED = '' %THEN                                      00004000
* %DO;                                                                  00005000
*/* Macro made bi-lingual on 19322. CBGEN compile date 19044         */ 00006000
*% /*                                                                   00007000
         MACRO                                                          00008000
         IWMWSYSR &DSECT=YES,&LIST=YES,&TITLE=YES,&SYSR=YES,           *00009000
               &SYSR_EXT=COND,&SYSR_EXT_ENTRY_USERDATA=COND,           *00010000
               &SYSR_EXT2_ENTRY_HOST=COND                               00011000
         GBLC  &IWMWSYSR_INCLUDED                                       00012000
         GBLC  &ZCBPRINT                                                00013000
&IWMWSYSR_INCLUDED SETC 'YES'                                           00014000
         AIF   ('&LIST' EQ 'NONE').P0                                   00015000
         AIF   ('&TITLE' EQ 'NO').P5                                    00016000
 TITLE   'IWMWSYSR  - Sysplex Router Response                    '      00017000
.P5      ANOP                                                           00018000
**/ IWMWSYSR_1:;                                                        00019000
*/* START OF SPECIFICATIONS ******************************************/ 00020000
*/**** PROPRIETARY_STATEMENT *****************************************/ 00021000
*/*01* PROPRIETARY STATEMENT=                                        */ 00022000
*/*                                                                  */ 00023000
*/*     LICENSED MATERIALS - PROPERTY OF IBM                         */ 00024000
*/*     5650-ZOS COPYRIGHT IBM CORP. 1994, 2021                      */ 00025000
*/*                                                                  */ 00026000
*/**** END_OF_PROPRIETARY_STATEMENT **********************************/ 00027000
*/*                                                                  */ 00028000
*/*01* EXTERNAL CLASSIFICATION: PI                                   */ 00029000
*/*01* END OF EXTERNAL CLASSIFICATION:                               */ 00030000
*/*                                                                  */ 00031000
*/*01* DESCRIPTIVE NAME:  Sysplex Router Response                    */ 00032000
*/*02*  ACRONYM:  IWMWSYSR                                           */ 00033000
*/*                                                                  */ 00034000
*/*01* MACRO NAME: IWMWSYSR                                          */ 00035000
*/*                                                                  */ 00036000
*/*01* DSECT NAME: SYSR, SYSR_EXT, and SYSR_EXT_ENTRY_USERDATA,      */ 00037000
*/*                SYSR_EXT2_ENTRY_HOST                              */ 00038000
*/*                                                                  */ 00039000
*/*01* COMPONENT:  Workload Manager (SCWLM)                          */ 00040000
*/*                                                                  */ 00041000
*/*01* EYE-CATCHER:  None                                            */ 00042000
*/*02*  OFFSET:  N/A                                                 */ 00043000
*/*02*  LENGTH:  N/A                                                 */ 00044000
*/*                                                                  */ 00045000
*/*01* STORAGE ATTRIBUTES:                                           */ 00046000
*/*02*  SUBPOOL:  User assigned                                      */ 00047000
*/*02*  KEY:  0-15                                                   */ 00048000
*/*02*  RESIDENCY:  Anywhere                                         */ 00049000
*/*02*  MAIN STORAGE:  NO                                            */ 00050000
*/*02*  AUXILIARY STORAGE:  YES                                      */ 00051000
*/*02*  VIRTUAL STORAGE:  YES                                        */ 00052000
*/*02*  DATA SPACE: NO                                               */ 00053000
*/*                                                                  */ 00054000
*/*01* SIZE:  See compiled/assembled listing                         */ 00055000
*/*            SYSR                    -- X'0014' bytes              */ 00056000
*/*            SYSR_EXT                -- X'0018' bytes              */ 00057000
*/*            SYSR_EXT_ENTRY_USERDATA -- X'0040' bytes              */ 00058000
*/*            SYSR_EXT2_ENTRY_HOST    -- X'0040' bytes              */ 00059000
*/*                                                                  */ 00060000
*/*                                                                  */ 00061000
*/*01* CREATED BY: Caller of IWMSRSRS                                */ 00062000
*/*                                                                  */ 00063000
*/*                                                                  */ 00064000
*/*01* POINTED TO BY: IWMSRSRS Parameter List                        */ 00065000
*/*                                                                  */ 00066000
*/*01* SERIALIZATION: None                                           */ 00067000
*/*                                                                  */ 00068000
*/*01* FUNCTION: Holds sysplex router registered LU and weight       */ 00069000
*/*              information.  Returned by IWMSRSRS service.         */ 00070000
*/*                                                                  */ 00071000
*/*01* METHOD OF ACCESS:                                             */ 00072000
*/*     ASM:    IWMWSYSR                                             */ 00073000
*/*     PL/AS:  %INCLUDE(IWMWSYSR)                                   */ 00074000
*/*                                                                  */ 00075000
*/*     Using on SYSR gives addressability to the            @WLMPENH*/ 00076000
*/*     SYSR section.                                        @WLMPENH*/ 00077000
*/*                                                          @WLMPENH*/ 00078000
*/*     Extended sections are only available to callers of   @WLMPENH*/ 00079000
*/*     the IWMSRSRS service when invoked with the extended  @WLMPENH*/ 00080000
*/*     keywords on a system running OS/390 R3 or higher.    @WLMPENH*/ 00081000
*/*     The EXTENDED_DATA returned by the IWMSRSRS service   @WLMPENH*/ 00082000
*/*     includes the header and associated extension data.   @WLMPENH*/ 00083000
*/*     Data associated with entries on MVS images not       @WLMPENH*/ 00084000
*/*     supporting a particular type of data will be set as  @WLMPENH*/ 00085000
*/*     binary zeroes.                                       @WLMPENH*/ 00086000
*/*     Usings must be done to get addressability to these   @WLMPENH*/ 00087000
*/*     extended sections (DSECTs) as follows:               @WLMPENH*/ 00088000
*/*                                                          @WLMPENH*/ 00089000
*/*     DSECT    USING                                       @WLMPENH*/ 00090000
*/*     -----    -----                                       @WLMPENH*/ 00091000
*/*     SYSR_Ext Address of SYSR +                           @WLMPENH*/ 00092000
*/*              Length of a SYSR_INFO entry *               @WLMPENH*/ 00093000
*/*              ENTRY_COUNT(see IWMSRSRS)                   @WLMPENH*/ 00094000
*/*     SYSR_Ext_Entry_UserData                              @WLMPENH*/ 00095000
*/*              Address of SYSR_Ext +                       @WLMPENH*/ 00096000
*/*              SYSR_Ext_Entry_UserData_Offset              @WLMPENH*/ 00097000
*/*     SYSR_Ext2_Entry_Host                                 @WLMPDNS*/ 00098000
*/*              Address of SYSR_Ext +                       @WLMPDNS*/ 00099000
*/*              SYSR_Ext2_Entry_Host_Offset                 @WLMPDNS*/ 00100000
*/*                                                                  */ 00101000
*/*                                                                  */ 00102000
*/*01* STATUS: HBB77D0                                               */ 00103000
*/*                                                                  */ 00104000
*/*01* DELETED BY: Caller of IWMSRSRS                                */ 00105000
*/*                                                                  */ 00106000
*/*01* DEPENDENCIES: None                                            */ 00107000
*/*                                                                  */ 00108000
*/*01* DISTRIBUTION LIBRARY: AMACLIB                                 */ 00109000
*/*                                                                  */ 00110000
*/*01* CHANGE ACTIVITY:                                              */ 00111000
*/*                                                                  */ 00112000
*/*    $MAC(IWMWSYSR),COMP(SCWLM):                                   */ 00113000
*/* $L0=ENCLV   HBB5520, 940410, PD00DD: Sysplex Router              */ 00114000
*/* $P1=PN70439 HBB5520, 940415, PD00CF: Fix prolog, make bilingual  */ 00115000
*/* $WLMPENH    HBB6603, 960220, PD00RK: Add SYSR extension          */ 00116000
*/* $WLMPDNS    JBB6604, 970226, PD00KP: Add Host Name extension     */ 00117000
*/* $PSY0468    JBB6604, 970320, PD00KP: Update DSECT in Prolog      */ 00118000
*/* $LZAAP3A    HBB7740, 060330, 3241NN: Added CPU, ZAAP and ZIIP    */ 00119000
*/*                                      Weights             @LZAAP3A*/ 00120000
*/* $ME07386    HBB7740, 060803, 3241BH: Prop Statememt correction   */ 00121000
*/*                                                          @ME07386*/ 00122000
*/* $LHWCON     HBB77C0, 171020, 3241AK: Anette Kempfert     @LHWCON */ 00123000
*/*                                      zCBP support                */ 00124000
*/* $CBGMETA    HBB77D0  191106  3241BH: Bill Heisser                */ 00125000
*/*                                      convert to CBGEN Metadata   */ 00126000
*/*                                                                  */ 00127000
*/*                                                                  */ 00128000
*/* END OF SPECIFICATIONS ********************************************/ 00129000
*% /*                                                                   00130000
.P0      ANOP                                                           00131000
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 00132000
         AIF   ('&LIST' EQ 'YES').P2                                    00133000
.P1      ANOP                                                           00134000
         PUSH  PRINT                                                    00135000
         PRINT OFF                                                      00136000
.P2      ANOP                                                           00137000
         AIF   ('&SYSR' EQ 'NO').L0002                                  00138000
         AIF   ('&DSECT' EQ 'YES').L0003                                00139000
         AIF   ('&SYSR' NE 'YES').L0002                                 00140000
.L0003   ANOP                                                           00141000
*                                                                       00142000
*    *****************************************************************  00143000
*    *                                                               *  00144000
*    * IWMWSYSR : mapping of SYSR_data                               *  00145000
*    *                                                               *  00146000
*    *****************************************************************  00147000
*                                                                       00148000
*                                                                       00149000
         AIF   ('&DSECT' EQ 'YES').L0004                                00150000
SYSR     DS    0F                                                       00151000
         AGO   .L0005                                                   00152000
.L0004   ANOP                                                           00153000
SYSR     DSECT                                                          00154000
.L0005   ANOP                                                           00155000
SYSR_INFO DS   CL20      Start of response information                  00156000
         ORG   SYSR_INFO                                                00157000
SYSR_NETID DS  CL8       Network id                                     00158000
SYSR_LUNAME DS CL8       Logical Unit Name                              00159000
SYSR_WEIGHT DS X         server Weight                                  00160000
SYSR_CPU_WEIGHT DS X     CPU specific server weight                     00161000
SYSR_ZCBP_WEIGHT DS X    zCBP specific server weight                    00162000
         ORG   SYSR_ZCBP_WEIGHT                                         00163000
SYSR_ZAAP_WEIGHT DS X    zAAP specific server weight                    00164000
SYSR_ZIIP_WEIGHT DS X    zIIP specific server weight                    00165000
SYSR_LEN EQU   *-SYSR                                                   00166000
.L0002   ANOP                                                           00167000
         AIF   ('&SYSR_EXT' EQ 'NO').L0006                              00168000
         AIF   ('&DSECT' EQ 'YES').L0007                                00169000
         AIF   ('&SYSR_EXT' NE 'YES').L0006                             00170000
SYSR_EXT DS    0F                                                       00171000
         AGO   .L0008                                                   00172000
.L0007   ANOP                                                           00173000
SYSR_EXT DSECT                                                          00174000
.L0008   ANOP                                                           00175000
SYSR_EXT_HEADER DS CL24  Start of extension area. Extension header      00176000
         ORG   SYSR_EXT_HEADER                                          00177000
SYSR_EXT_VERSION DS H    Extension area version number                  00178000
SYSR_EXT_SIZE DS H       Size in bytes of the extension area including *00179000
                         header and all entries                         00180000
SYSR_EXT_HEADER_SIZE DS H Size in bytes of extension header             00181000
SYSR_EXT_ENTRY_COUNT DS H Number of extension entries in each data     *00182000
                         area                                           00183000
SYSR_EXT_ENTRY_USERDATA_OFFSET DS H Offset of the userdata section     *00184000
                         from the start of extension area               00185000
SYSR_EXT2_ENTRY_HOST_OFFSET DS H Offset of the host section from the   *00186000
                         start of extension area                        00187000
SYSR_EXT_ENTRY_RSV2_OFFSET DS H Offset of the rsv2 section from the    *00188000
                         start of extension area                        00189000
SYSR_EXT_ENTRY_RSV3_OFFSET DS H Offset of the rsv3 section from the    *00190000
                         start of extension area                        00191000
SYSR_EXT_FLAGS DS B      flags                                          00192000
*  Bit definitions:                                                     00193000
SYSR_EXT_ZCBP EQU X'80'  When bit is on system fields with zCBP and    *00194000
                         zAAP names contain data about zCBP            *00195000
                         processors.                                    00196000
SYSR_EXT_RSV DS CL7      Reserved                                       00197000
SYSR_EXT_ENTRIES DS 0C   Beginning of extension entries                 00198000
SYSR_EXT_LEN EQU *-SYSR_EXT                                             00199000
.L0006   ANOP                                                           00200000
         AIF   ('&SYSR_EXT_ENTRY_USERDATA' EQ 'NO').L0009               00201000
         AIF   ('&DSECT' EQ 'YES').L000A                                00202000
         AIF   ('&SYSR_EXT_ENTRY_USERDATA' NE 'YES').L0009              00203000
SYSR_EXT_ENTRY_USERDATA DS 0F User data entry                           00204000
         AGO   .L000B                                                   00205000
.L000A   ANOP                                                           00206000
SYSR_EXT_ENTRY_USERDATA DSECT   User data entry                         00207000
.L000B   ANOP                                                           00208000
SYSR_EXT_USERDATA DS CL64 User data. The format is undefined to MVS     00209000
SYSR_EXT_ENTRY_USERDATA_LEN EQU *-SYSR_EXT_ENTRY_USERDATA               00210000
.L0009   ANOP                                                           00211000
         AIF   ('&SYSR_EXT2_ENTRY_HOST' EQ 'NO').L000C                  00212000
         AIF   ('&DSECT' EQ 'YES').L000D                                00213000
         AIF   ('&SYSR_EXT2_ENTRY_HOST' NE 'YES').L000C                 00214000
SYSR_EXT2_ENTRY_HOST DS 0F User data entry                              00215000
         AGO   .L000E                                                   00216000
.L000D   ANOP                                                           00217000
SYSR_EXT2_ENTRY_HOST DSECT   User data entry                            00218000
.L000E   ANOP                                                           00219000
SYSR_EXT2_HOST DS CL64   Host Name.                                     00220000
SYSR_EXT_VERSION1 EQU 1  Extension area version 1                       00221000
SYSR_EXT_VERSION2 EQU 2  Extension area version 2                       00222000
SYSR_EXT_CURRENT_VER EQU 2 Extension area current version               00223000
SYSR_EXT2_ENTRY_HOST_LEN EQU *-SYSR_EXT2_ENTRY_HOST                     00224000
.L000C   ANOP                                                           00225000
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 00226000
         AIF   ('&LIST' EQ 'YES').P4                                    00227000
.P3      ANOP                                                           00228000
         POP   PRINT                                                    00229000
.P4      ANOP                                                           00230000
.P_EXIT  ANOP                                                           00231000
         MEND                                                           00232000
**/ IWMWSYSR_2:;                                                        00233000
* %IWMWSYSR_INCLUDED = 'YES';                                           00234000
* %DCL ZCBPRINT CHAR EXT;                                               00235000
* %DEACTIVATE ZCBPRINT;                                                 00236000
* %DCL IWMWSYSR_LIST CHAR EXT;                                          00237000
* %DEACTIVATE IWMWSYSR_LIST;                                            00238000
* %IF IWMWSYSR_LIST = 'NO' !                                            00239000
*    ZCBPRINT = 'NO' %THEN                                              00240000
* %DO;                                                                  00241000
*   @LIST PUSH NOECHO;                                                  00242000
*   @LIST NOASSEMBLE NOECHO;                                            00243000
*   @LIST OFF C NOECHO;                                                 00244000
* %END;                                                                 00245000
*/* Start of PL/X Source                                             */ 00246000
*                                                                       00247000
*   /*****************************************************************/ 00248000
*   /*                                                               */ 00249000
*   /* IWMWSYSR   : mapping of SYSR_data                             */ 00250000
*   /*                                                               */ 00251000
*   /*****************************************************************/ 00252000
*                                                                       00253000
*   DECLARE                                                             00254000
*     1    SYSR     BASED(*) BDY(WORD),                                 00255000
*      2    SYSR_INFO(*),           /* Start of response information */ 00256000
*       3    SYSR_NETID   CHAR(8),  /* Network id */                    00257000
*       3    SYSR_LUNAME  CHAR(8),  /* Logical Unit Name */             00258000
*       3    SYSR_WEIGHT  FIXED(8),  /* server Weight        @LZAAP3C*/ 00259000
*       3    SYSR_CPU_WEIGHT   FIXED(8),  /* CPU specific server weight 00260000
*                                                            @LZAAP3A*/ 00261000
*       3    SYSR_ZCBP_WEIGHT  FIXED(8),  /* zCBP specific server       00262000
*                                            weight          @LHWCONA*/ 00263000
*        4    SYSR_ZAAP_WEIGHT  FIXED(8), /* zAAP specific server       00264000
*                                            weight          @LHWCONC*/ 00265000
*       3    SYSR_ZIIP_WEIGHT  FIXED(8);  /* zIIP specific server       00266000
*                                            weight          @LZAAP3A*/ 00267000
*   DECLARE                                                             00268000
*     1    SYSR_Ext BASED(*) BDY(WORD),                                 00269000
*      2    SYSR_Ext_Header,        /* Start of extension area.         00270000
*                                      Extension header      @WLMPENH*/ 00271000
*       3    SYSR_Ext_Version FIXED(16), /* Extension area version      00272000
*                                      number                @WLMPENH*/ 00273000
*       3    SYSR_Ext_Size   FIXED(16), /* Size in bytes of the         00274000
*                                      extension area including         00275000
*                                      header and all entries           00276000
*                                                            @WLMPENH*/ 00277000
*       3    SYSR_Ext_Header_Size FIXED(16), /* Size in bytes of        00278000
*                                      extension header      @WLMPENH*/ 00279000
*       3    SYSR_Ext_Entry_Count FIXED(16), /* Number of extension     00280000
*                                      entries in each data area        00281000
*                                                            @WLMPENH*/ 00282000
*       3    SYSR_Ext_Entry_UserData_Offset FIXED(16), /* Offset of     00283000
*                                      the userdata section from the    00284000
*                                      start of extension area          00285000
*                                                            @WLMPENH*/ 00286000
*       3    SYSR_Ext2_Entry_Host_Offset FIXED(16), /* Offset of        00287000
*                                      the host section from the        00288000
*                                      start of extension area          00289000
*                                                            @WLMPDNS*/ 00290000
*       3    SYSR_Ext_Entry_Rsv2_Offset FIXED(16), /* Offset of         00291000
*                                      the rsv2 section from the        00292000
*                                      start of extension area          00293000
*                                                            @WLMPENH*/ 00294000
*       3    SYSR_Ext_Entry_Rsv3_Offset FIXED(16), /* Offset of         00295000
*                                      the rsv3 section from the        00296000
*                                      start of extension area          00297000
*                                                            @WLMPENH*/ 00298000
*       3    SYSR_Ext_Flags  Bit(8) , /* flags               @LHWCONA*/ 00299000
*        4   SYSR_Ext_zCBP BIT(1),    /* When bit is on system fields   00300000
*                                        with zCBP and zAAP names       00301000
*                                        contain data about zCBP        00302000
*                                        processors.         @LHWCONA*/ 00303000
*       3    SYSR_Ext_Rsv    CHAR(7), /* Reserved            @LHWCONC*/ 00304000
*      2    SYSR_Ext_Entries CHAR(0) BDY(WORD); /* Beginning of         00305000
*                                      extension entries     @WLMPENH*/ 00306000
*   DECLARE                                                             00307000
*     1    SYSR_Ext_Entry_UserData(*) BDY(WORD)                         00308000
*            BASED(ADDR(SYSR_Ext)+SYSR_Ext_Entry_UserData_Offset), /*   00309000
*                                      User data entry       @WLMPENH*/ 00310000
*       3    SYSR_Ext_UserData CHAR(64); /* User data. The format       00311000
*                                      is undefined to MVS   @WLMPENH*/ 00312000
*   DECLARE                                                             00313000
*     1    SYSR_Ext2_Entry_Host(*) BDY(WORD)                            00314000
*            BASED(ADDR(SYSR_Ext)+SYSR_Ext2_Entry_Host_Offset), /*      00315000
*                                      User data entry       @WLMPDNS*/ 00316000
*       3    SYSR_Ext2_Host CHAR(64); /* Host Name.                     00317000
*                                                            @WLMPDNS*/ 00318000
*   DECLARE                                                             00319000
*     SYSR_Ext_Version1  FIXED(16) CONSTANT(1),/* Extension area        00320000
*                                      version 1             @WLMPENH*/ 00321000
*     SYSR_Ext_Version2  FIXED(16) CONSTANT(2),/* Extension area        00322000
*                                      version 2             @WLMPDNS*/ 00323000
*     SYSR_Ext_Current_Ver  FIXED(16) CONSTANT(SYSR_Ext_Version2); /*   00324000
*                                      Extension area current version   00325000
*                                                            @WLMPDNS*/ 00326000
*                                                                       00327000
*/* End of PL/X Source                                               */ 00328000
* %IF IWMWSYSR_LIST = 'NO' !                                            00329000
*    ZCBPRINT = 'NO' %THEN                                              00330000
* %DO;                                                                  00331000
*   @LIST POP NOECHO;                                                   00332000
* %END;                                                                 00333000
* %END;                                                                 00334000
