*                                                                       00001000
* %DCL IWMWRCAA_INCLUDED CHAR EXT;                                      00002000
* %DEACTIVATE IWMWRCAA_INCLUDED;                                        00003000
* %IF IWMWRCAA_INCLUDED = '' %THEN                                      00004000
* %DO;                                                                  00005000
*/* Macro made bi-lingual on 22069. CBGEN compile date 21138         */ 00006000
*% /*                                                                   00007000
         MACRO                                                          00008000
         IWMWRCAA &DSECT=YES,&LIST=YES,&TITLE=YES,&RCAA=YES,           *00009000
               &RCAABMAP=COND,&RCAAICSS=COND,&RCAE=COND,&RCAESCLS=COND,*00010000
               &RCAEIHDR=COND,&RCAERESC=COND,&RCAERST=COND,            *00011000
               &RCAEDIST=COND,&RCAEDELA=COND,&RCAEEELA=COND,           *00012000
               &RCAAGDD=COND,&RCAAGDDE=COND                             00013000
         GBLC  &IWMWRCAA_INCLUDED                                       00014000
         GBLC  &ZCBPRINT                                                00015000
&IWMWRCAA_INCLUDED SETC 'YES'                                           00016000
         AIF   ('&LIST' EQ 'NONE').P0                                   00017000
         AIF   ('&TITLE' EQ 'NO').P5                                    00018000
 TITLE   'IWMWRCAA  - IWMRCOLL Answer Area                        '     00019000
.P5      ANOP                                                           00020000
**/ ;                                                                   00021000
*/****START OF SPECIFICATIONS*****************************************/ 00022000
*/*                                                                  */ 00023000
*/*01* Proprietary statement:                                        */ 00024000
*/*                                                                  */ 00025000
*/*      LICENSED MATERIALS - PROPERTY OF IBM                        */ 00026000
*/*      5650-ZOS     COPYRIGHT IBM CORP. 1993, 2021                 */ 00027000
*/*                                                                  */ 00028000
*/*01* External classification: PSPI                                 */ 00029000
*/*01* End of External classification                                */ 00030000
*/*                                                                  */ 00031000
*/*01* Status= HBB77D0                                               */ 00032000
*/*                                                                  */ 00033000
*/*01* Descriptive Name: IWMRCOLL Answer Area                        */ 00034000
*/*                                                                  */ 00035000
*/*02*  Acronym: RCAA and RCAE                                       */ 00036000
*/*                                                                  */ 00037000
*/*01* Macro Name: IWMWRCAA                                          */ 00038000
*/*                                                                  */ 00039000
*/*01* DSECT Name: RCAA, RCAE and others                             */ 00040000
*/*                                                                  */ 00041000
*/*01* Component: Workload Manager (SCWLM)                           */ 00042000
*/*                                                                  */ 00043000
*/*01* Eye-Catcher: RCAA and RCAE                                    */ 00044000
*/*02*  Offset: 0                                                    */ 00045000
*/*02*  Length: CHAR(4)                                              */ 00046000
*/*                                                                  */ 00047000
*/*01* Storage Attributes:                                           */ 00048000
*/*02*  Subpool: Any                                                 */ 00049000
*/*02*  Key: 0                                                       */ 00050000
*/*02*  Residency: Above 16M line                                    */ 00051000
*/*                                                                  */ 00052000
*/*01* Size: Determined at run time                                  */ 00053000
*/*            RCAA     -- X'009C' bytes                             */ 00054000
*/*            RCAABMAP -- X'0004' bytes                             */ 00055000
*/*            RCAAICSS -- X'000C' bytes                             */ 00056000
*/*            RCAE     -- X'002C' bytes                             */ 00057000
*/*            RCAESCLS -- X'0008' bytes                             */ 00058000
*/*            RCAEIHDR -- X'004C' bytes                             */ 00059000
*/*            RCAERESC -- X'0164' bytes                             */ 00060000
*/*            RCAERST  -- X'0118' bytes                             */ 00061000
*/*            RCAEDIST -- X'0004' bytes                             */ 00062000
*/*            RCAEDELA -- X'00B8' bytes                             */ 00063000
*/*            RCAEEELA -- X'0158' bytes                             */ 00064000
*/*            RCAAGDD  -- X'000C' bytes                             */ 00065000
*/*            RCAAGDDE -- X'0016' bytes                             */ 00066000
*/*                                                                  */ 00067000
*/*01* Created by: Caller                                            */ 00068000
*/*                                                                  */ 00069000
*/*01* Pointed to by: Pointed to by the ANSAREA_ADDR field in the    */ 00070000
*/*     IWMRCOLL parameter list                                      */ 00071000
*/*                                                                  */ 00072000
*/*01* Serialization: None                                           */ 00073000
*/*                                                                  */ 00074000
*/*01* Function: Contains workload activity reporting information    */ 00075000
*/*                                                                  */ 00076000
*/*01* Restrictions:                                                 */ 00077000
*/*              When used as input to IWMRCOLL:                     */ 00078000
*/*              Storage for answer area must reside in caller's     */ 00079000
*/*              primary or in a dataspace accessible by the current */ 00080000
*/*              unit of work's dispatchable unit access list (DUal) */ 00081000
*/*                                                                  */ 00082000
*/*01* Notes:                                                        */ 00083000
*/*          *  This field may not be reused due to compatibility    */ 00084000
*/*             reasons.                                     @PYN0179*/ 00085000
*/*                                                                  */ 00086000
*/*01* Method of Access:                                             */ 00087000
*/*                                                                  */ 00088000
*/*02*  ASM:                                                         */ 00089000
*/*          Specify: IWMWRCAA                                       */ 00090000
*/*                                                                  */ 00091000
*/*02*  PLX:                                                         */ 00092000
*/*                                                                  */ 00093000
*/*          Declare RCAAPTR                                         */ 00094000
*/*          %INCLUDE SYSLIB(IWMWRCAA)                               */ 00095000
*/*                                                                  */ 00096000
*/*02*  VIA ATTRIBUTE:                                               */ 00097000
*/*                                                                  */ 00098000
*/*          Specify %RCAAVIA = 'YES'                                */ 00099000
*/*          prior to %INCLUDE statement.                            */ 00100000
*/*          Declare RCAAALET.                                       */ 00101000
*/*          For VIA(0) specify %GLOBALARMODE='YES'                  */ 00102000
*/*                                                                  */ 00103000
*/*------------------------------------------------------------------*/ 00104000
*/*                                                                  */ 00105000
*/*01* Change Activity:                                              */ 00106000
*/*                                                                  */ 00107000
*/*    $MAC(IWMWRCAA), COMP(SCWLM): IWMRCOLL Answer Area             */ 00108000
*/*    $L0= WLMI,    HBB5510, 930315 PD88CR: WLM Stage I             */ 00109000
*/*    $P1= PIG3680, HBB5510, 931115 PD88CT: Update comments to      */ 00110000
*/*                                          indicate that response  */ 00111000
*/*                                          data sections may not   */ 00112000
*/*                                          always be present       */ 00113000
*/*    $P2= PIG3908, HBB5510, 931215 PD88CT: OW00691 TRSQ PTM -      */ 00114000
*/*                                          Delete comment line     */ 00115000
*/*                                          continuation characters */ 00116000
*/*                                          that caused ASM errors  */ 00117000
*/*    $P3= PIG5045, HBB5510, 940117 PD88DA: OW01260 - Change        */ 00118000
*/*                                          external classification */ 00119000
*/*                                          to PSPI.                */ 00120000
*/*    $P4= PIG5048, HBB5510, 940125 PD88DA: OW01260 - Clarify       */ 00121000
*/*                                          "pointed to" text.      */ 00122000
*/*    $P5= PIG5137, HBB5510, 940215 PD88CT: OW02199 - Clarify       */ 00123000
*/*                                          "pointed to" text.      */ 00124000
*/*    $P6= PIG5258, HBB5510, 940331 PD88CT: OW02792 - Clarify       */ 00125000
*/*                                          comments for RCAABMAP   */ 00126000
*/*                                          and RCAEPDEL            */ 00127000
*/*    $L1= CAPT2,   HBB5520, 940315 PD88BG: Captured storage        */ 00128000
*/*    OW11082       HBB5520  950206 PD88DA: Update RCAA and RCAE    */ 00129000
*/*                                          version numbers @WA11082*/ 00130000
*/*    $WLMPBPM      HBB6603, 950510 PD88DA: New Workload Reporting  */ 00131000
*/*                                          fields in support of    */ 00132000
*/*                                          HBB6603 line items.     */ 00133000
*/*                                                          @WLMPBPM*/ 00134000
*/*    $WLMPESM      HBB6603, 950510 PD88DA: New Workload Reporting  */ 00135000
*/*                                          fields in support of    */ 00136000
*/*                                          HBB6603 line items.     */ 00137000
*/*                                                          @WLMPESM*/ 00138000
*/*    $WLMPIOP      HBB6603, 950510 PD88DA: New Workload Reporting  */ 00139000
*/*                                          fields in support of    */ 00140000
*/*                                          HBB6603 line items.     */ 00141000
*/*                                                          @WLMPIOP*/ 00142000
*/*    $WLMPASM      HBB6603, 950510 PD88DA: New Workload Reporting  */ 00143000
*/*                                          fields in support of    */ 00144000
*/*                                          HBB6603 line items.     */ 00145000
*/*                                                          @WLMPASM*/ 00146000
*/*    $WLMPENH      HBB6603, 951207 PD88DA: Add new latch waiting   */ 00147000
*/*                                          state to the subsystem  */ 00148000
*/*                                          delay data      @WLMPENH*/ 00149000
*/*                                                                     00150000
*      $DQC0023      HBB6603  960605 PDBB:   John Arwe                  00151000
*                                            Dependent enclaves         00152000
*                                            Break I/O using time into  00153000
*                                            connect and disconnect,    00154000
*                                            resource data length       00155000
*                                            increased to accomodate it 00156000
*      $PQC1647      HBB6603  960627 PDDA:   Tak Chin:  Add RQAAOVEL    00157000
*                                            bit.  On = Pre-HBB6603     00158000
*                                            definition of velocity     00159000
*                                            is being used to manage    00160000
*                                            the system (I/O delay      00161000
*                                            not included in the        00162000
*                                            calculation of velocity)   00163000
*      $PQC2588      HBB6603  960920 PDBZ:   Peter Yocom: Add RCAETOTS  00164000
*                                                                       00165000
*      $WLMPBAT      JBB6604  961202 PDBZ:   Peter Yocom: Add fields    00166000
*                                            new for OS/390 R4          00167000
*      $WLMPBAT      JBB6604  970225 PDBZ:   Peter Yocom: Add           00168000
*                                            RCAETOTDQ                  00169000
*      $PSY0260      JBB6604  970331 PDBZ:   Peter Yocom: Correct       00170000
*                                            comments                   00171000
*      OW26823       JBB6604  970708 PDSN:   Reship to correct SMP      00172000
*                                            error with ow26609 and     00173000
*                                            ow26997                    00174000
*      $WLMPMES      JBB6609  981001 B9HACG: WLMMES - Stephen McGrath   00175000
*                                            Multisystem enclaves       00176000
*      $WLMPCRY      HBB7705  000712 3241JH: Juergen Holtz              00177000
*                                            Crypto Reporting           00178000
*      $WLMPAPC      HBB7705  000918 3241PB: Peter Baeuerle             00179000
*                                            Application Contexts       00180000
*      $WLMPRTD      HBB7705  000920 3241ST: Ralf Streit                00181000
*                                            Support multiple Report    00182000
*                                            Class periods              00183000
*      $PX00970      HBB7705  001205 3241ST: WLMPRTD  - Ralf Streit     00184000
*                                            Data type of report class  00185000
*                                            homogeneous timestamps     00186000
*                                            changed to token           00187000
*      $OW50148      HBB7705  010621 3241ST: WLMPRTD - Ralf Streit      00188000
*                                            RCAEPeriodsWithData is     00189000
*                                            valid in goal mode, only   00190000
*      $WLMPEM2      HBB7707  010924 3241ST: Ralf Streit                00191000
*                                            Enqueue management         00192000
*                                            enhancements - stage 2     00193000
*      $WLMPPBS      HBB7707  011113 3241AB: WLMPPBS - Armin Buechler   00194000
*                                            PB State Reporting Support 00195000
*                                            Additional PB states       00196000
*      $PYN0179      HBB7708  020426 3241ST: Ralf Streit                00197000
*                                            Goal mode, only            00198000
*      $OW54623      HBB7708  020618 3241AB: Armin Buechler             00199000
*                                            Regen ASM Part             00200000
*      $OW55665      HBB7705  020719 3241RV: Robert Vaupel              00201000
*                                            Execution Velocities       00202000
*      $WLMPIFA      HBB7709  031103 1311HS: Horst Sinram               00203000
*                                            IFA Support                00204000
*      $WLMPDBM      HBB7720  040809 3241UH: Ulrich Hild                00205000
*                                            Buffer Pool Management     00206000
*      $WLMPSUP      HBB7730  050928 3241MO: Michael Ostmeyer           00207000
*                                            SUP Support                00208000
*                                                                       00209000
*      $LBLOCK       HBB7740  060704 3241AB: Armin Buechler             00210000
*                                            Add CPU Blocked Workload   00211000
*                                            (former trickle suppport)  00212000
*                                                                       00213000
*      $ME08403      HBB7740  061106 3241BH: Bill Heisser               00214000
*                                            correcting Prop Stmt       00215000
*                                                                       00216000
*      $LENQP3I      HBB7750  060208 3241RS: Ralf Streit                00217000
*                                            WLM Enqueue Management     00218000
*                                            Phase 3                    00219000
*      $OA20045      HBB7750  070508 3241JS: Juergen Schneider          00220000
*                                            zIIPHonorpriority support  00221000
*      $LPBDEL       HBB7750  070531 3241KHH: K.-H. Holder              00222000
*                                             new PB delays,            00223000
*                                             descriptions for generic  00224000
*                                             delay states              00225000
*                                             Also, the assembler part  00226000
*                                             of the mapping was removd 00227000
*                                             since this is CBGEN'd     00228000
*      @ME12250      HBB7750  080102 3241BH: Bill Heisser               00229000
*                                            Copyright checker -        00230000
*                                            wording changed            00231000
*      $ME15316      HBB7770  090204 3241JS: Juergen Schneider          00232000
*                                            support of promotion time  00233000
*                                            for local lock proportion  00234000
*      $LPOWSM       HBB7770  090325 3241JS: Juergen Schneider          00235000
*                                            add CEC and CPU adjustment 00236000
*                                            factors                    00237000
*      $ME18255      HBB7770  100126 3241JS: Juergen Schneider          00238000
*                                            version number not up to   00239000
*                                            date => version number 21  00240000
*      $LRDIST       HBB7780  100211 3241NN: Nicolas Nardelli  @LRDISTA 00241000
*                                            Response time distribution 00242000
*                                            for all goals              00243000
*      $LENHDP       HBB7780  100211 3241AB: Armin Buechler             00244000
*                                            ENQ DP with SUP SRB        00245000
*                                            promotion                  00246000
*      $ME19196      HBB7780  100910 3241NN: Nicolas Nardelli  @ME19196 00247000
*                                            New field RCAEIRCT: count  00248000
*                                            of mid-point changes       00249000
*      $OA34801      HBB7780  101104 3241RS: Ralf Streit                00250000
*                                            Report transaction         00251000
*                                            completions                00252000
*      $LCRTME       HBB7780  110210 3241IS: Irene Stahl                00253000
*                                            CICS Response Time         00254000
*                                            Management Enhancement     00255000
*                                            Disable REPORTCOMPLETIONS  00256000
*      $LSLED2       HBB7790  110415 3241NN: Nicolas Nardelli  @LSLED2A 00257000
*                                            SledRunner - Stage II.     00258000
*                                            New DASD I/O times fields  00259000
*      $OA35428      HBB7780  110418 3241IS: Irene Stahl       @LCRTME  00260000
*                                            CICS Response Time         00261000
*                                            Management Enhancement     00262000
*                                            Remove REPORTCOMPLETIONS   00263000
*      $OA47042      HBB7790  150312 3241IS: Irene Stahl                00264000
*                                            Special reporting          00265000
*      $LRESPT       HBB77B0  150505 3241MG: Matthias Gubitz            00266000
*                                            Shorter response time goal 00267000
*      $WI104168     HBB77B0  160119 3241MG: Matthias Gubitz            00268000
*                                            Drop CAM (CCF) support     00269000
*      $LHWCON       HBB77C0  180110 3241MG: Matthias Gubitz            00270000
*                                            zCBP support               00271000
*      $CBGMETA      HBB77D0  191106 3241BH: Bill Heisser               00272000
*                                            convert to CBGEN Metadata  00273000
*      $LBOOS2       HBB77D0  191210 3241KG: Karin Genther              00274000
*                                            Implicit CPU critical      00275000
*                                            (SRB stage 2)              00276000
*      $LCOEFF       HBB77D0  200417 3241MG: Matthias Gubitz            00277000
*                                            Service coeff removal      00278000
*      $OA61811      HBB77B0  211103 3241AH: Andreas Henicke            00279000
*                                            High Performance           00280000
*                                            Transactions               00281000
*                                                                       00282000
******END OF SPECIFICATIONS*******************************************/ 00283000
*% /*                                                                   00284000
.P0      ANOP                                                           00285000
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 00286000
         AIF   ('&LIST' EQ 'YES').P2                                    00287000
.P1      ANOP                                                           00288000
         PUSH  PRINT                                                    00289000
         PRINT OFF                                                      00290000
.P2      ANOP                                                           00291000
         AIF   ('&RCAA' EQ 'NO').L0002                                  00292000
         AIF   ('&DSECT' EQ 'YES').L0003                                00293000
         AIF   ('&RCAA' NE 'YES').L0002                                 00294000
RCAA     DS    0F        Workload Activity Collection Answer Area       00295000
         AGO   .L0004                                                   00296000
.L0003   ANOP                                                           00297000
RCAA     DSECT           Workload Activity Collection Answer Area       00298000
.L0004   ANOP                                                           00299000
RCAAACRO DS    CL4       Acronym                                        00300000
RCAASIZ  DS    F         Size of RCAA and all of its subordinate parts  00301000
RCAAVERS DS    X         Version                                        00302000
RCAAMODE DS    B         System WLM mode                                00303000
*  Bit definitions:                                                     00304000
RCAAGOAL EQU   X'80'     System is in goal mode                         00305000
RCAACOMP EQU   X'40'     System is in compatibility mode. Never on as  *00306000
                         of z/OS 1.3                                    00307000
RCAAOVEL EQU   X'20'     System is calculating velocity without using  *00308000
                         I/O delays.                                    00309000
RCAAICO  EQU   X'10'     1: IFACrossOver=True                           00310000
RCAAHPO  EQU   X'08'     1: IFAHonorPriority = True                     00311000
RCAAZCBPDS EQU X'04'     1: zCBP processors run at different speed      00312000
RCAAIDS  EQU   X'04'     1: IFA processors run at different speed       00313000
RCAASDS  EQU   X'02'     1: SUP processors run at different speed       00314000
RCAAHPZ  EQU   X'01'     1: SUPHonorPriority = True                     00315000
RCAAOPT  DS    CL2       IEAOPTxx suffix                                00316000
RCAATMI  DS    BL8       Local time reporting was last initialized     *00317000
                         (STCK format)                                  00318000
RCAATMR  DS    BL8       Local time this RCAA data was collected (STCK *00319000
                         format)                                        00320000
RCAAGINF DS    CL32      Goal mode information                          00321000
         ORG   RCAAGINF                                                 00322000
RCAAPNAM DS    CL8       Policy name                                    00323000
RCAAPTM  DS    BL8       Local time policy was activated (STCK format)  00324000
RCAAUID  DS    CL8       Userid of person who activated policy          00325000
RCAAPSYS DS    CL8       System that policy was activated on            00326000
RCAACINF DS    CL24      Reserved - Note *                              00327000
         ORG   RCAACINF                                                 00328000
RCAAIPS  DS    CL2       Reserved - Note *                              00329000
RCAAICS  DS    CL2       Reserved - Note *                              00330000
RCAASCO  DS    CL20      Reserved - Note *                              00331000
         ORG   RCAASCO                                                  00332000
RCAAIPC  DS    CL4       Reserved - Note *                              00333000
RCAAIPI  DS    CL4       Reserved - Note *                              00334000
RCAAIPB  DS    CL4       Reserved - Note *                              00335000
RCAAIPM  DS    CL8       Reserved - Note *                              00336000
RCAANTVL DS    F         Current sample interval (in milliseconds).    *00337000
                         This is the frequency with which WLM samples  *00338000
                         delays reported in the RCAA                    00339000
RCAANTV# DS    F         Total number of times WLM sampling code ran.  *00340000
                         A monitor issuing successive calls to         *00341000
                         IWMRCOLL should not assume that WLM sampling  *00342000
                         code ran at the interval specified by         *00343000
                         RCAANTVL between its calls. This field can be *00344000
                         used to translate sampled state data into     *00345000
                         actual percentages of time.                    00346000
RCAABMPL DS    H         Length of an entry in the response time       *00347000
                         distribution mapping array (RCAABMAP)          00348000
RCAABMP# DS    H         Number of response time distribution buckets   00349000
RCAABMPO DS    F         Offset from RCAA to response time             *00350000
                         distribution mapping array (RCAABMAP)          00351000
RCAASCAL DS    H         Length of one RCAE workload activity entry in *00352000
                         the RCAASCOF array                             00353000
RCAASCA# DS    H         Number of entries in RCAASCOF array. Number   *00354000
                         of service classes returned in IWMSVPOL by    *00355000
                         IWMPQRY                                        00356000
RCAASCOF DS    F         Offset from RCAA to array of RCAE entries     *00357000
                         which represent service classes                00358000
RCAARCAL DS    H         Length of one RCAE workload activity entry in *00359000
                         the RCAARCOF array                             00360000
RCAARCA# DS    H         Number of entries in RCAARCOF array which is  *00361000
                         the number of report classes returned in      *00362000
                         IWMSVPOL by IWMPQRY                            00363000
RCAARCOF DS    F         Offset from RCAA to array of RCAE entries     *00364000
                         which represent report classes                 00365000
RCAACLVL DS    F         Current change level                           00366000
RCAAINTI DS    BL8       Token that represents the time when WLM has   *00367000
                         completed building the RCAA. RCAAINTI must be *00368000
                         used to determine whether a report class      *00369000
                         period is homogeneous or not.                  00370000
RCAANFFZCBP DS F         Normalization factor for zCBP. Multiply zCBP  *00371000
                         times with this value and divide the result   *00372000
                         by 256 to obtain the equivalent time on a CP   00373000
         ORG   RCAANFFZCBP                                              00374000
RCAANFFI DS    F         Normalization factor for IFA                   00375000
RCAANFFS DS    F         Normalization factor for SUP. Multiply SUP    *00376000
                         times with this value and divide the result   *00377000
                         by 256 to obtain the equivalent time on a CP   00378000
RCAAGDDOFF DS  F         Offset from RCAA to RCAAGDD                    00379000
RCAAADJCCPU DS F         CPU adjustment factor                          00380000
RCAAADJCCPUNOM DS F      nominal CPU adjustment factor                  00381000
RCAAADJCCEC DS F         CEC adjustment factor                          00382000
RCAAFLAG DS    B         Flag byte. Only valid if RCAACLVL greater 3    00383000
*  Bit definitions:                                                     00384000
RCAAZCBP EQU   X'80'     1: Fields with both zCBP and IFA names        *00385000
                         contain data about zCBP processors             00386000
         DS    CL3       Reserved                                       00387000
RCAA_LEN EQU   *-RCAA                                                   00388000
.L0002   ANOP                                                           00389000
         AIF   ('&RCAABMAP' EQ 'NO').L0005                              00390000
         AIF   ('&DSECT' EQ 'YES').L0006                                00391000
         AIF   ('&RCAABMAP' NE 'YES').L0005                             00392000
RCAABMAP DS    0F        RCAA response time distribution map array      00393000
         AGO   .L0007                                                   00394000
.L0006   ANOP                                                           00395000
RCAABMAP DSECT           RCAA response time distribution map array      00396000
.L0007   ANOP                                                           00397000
RCAABENT DS    F         Response time distribution bucket mappings.   *00398000
                         Each word defines a maximum % of a goal (ie.  *00399000
                         50, 70, 100, etc.) When used in conjunction   *00400000
                         with an RCAEDENT, a monitor product can show  *00401000
                         the number of transactions that completed in  *00402000
                         a percentage of a goal. The last entry in the *00403000
                         array contains X'FFFFFFFF'. This indicates    *00404000
                         that this bucket includes all transactions    *00405000
                         that completed with longer response times     *00406000
                         than the previous bucket.                      00407000
RCAABMAP_LEN EQU *-RCAABMAP                                             00408000
.L0005   ANOP                                                           00409000
         AIF   ('&RCAAICSS' EQ 'NO').L0008                              00410000
         AIF   ('&DSECT' EQ 'YES').L0009                                00411000
         AIF   ('&RCAAICSS' NE 'YES').L0008                             00412000
RCAAICSS DS    0F        Reserved - Note *                              00413000
         AGO   .L000A                                                   00414000
.L0009   ANOP                                                           00415000
RCAAICSS DSECT           Reserved - Note *                              00416000
.L000A   ANOP                                                           00417000
RCAAICSX DS    F         Reserved - Note *                              00418000
RCAAICSM DS    F         Reserved - Note *                              00419000
RCAAICSL DS    F         Reserved - Note *                              00420000
RCAAICSS_LEN EQU *-RCAAICSS                                             00421000
.L0008   ANOP                                                           00422000
         AIF   ('&RCAE' EQ 'NO').L000B                                  00423000
         AIF   ('&DSECT' EQ 'YES').L000C                                00424000
         AIF   ('&RCAE' NE 'YES').L000B                                 00425000
RCAE     DS    0D        Workload Activity Collection Entry (RCAE).    *00426000
                         Pointed to by RCAASCOF and RCAARCOF which are *00427000
                         within the RCAA. To navigate from one RCAE to *00428000
                         the next RCAE, the program must use the       *00429000
                         length field in RCAASCAL or RCAARCAL           00430000
         AGO   .L000D                                                   00431000
.L000C   ANOP                                                           00432000
RCAE     DSECT           Workload Activity Collection Entry (RCAE).    *00433000
                         Pointed to by RCAASCOF and RCAARCOF which are *00434000
                         within the RCAA. To navigate from one RCAE to *00435000
                         the next RCAE, the program must use the       *00436000
                         length field in RCAASCAL or RCAARCAL           00437000
.L000D   ANOP                                                           00438000
RCAEACRO DS    CL4       Acronym                                        00439000
RCAEVERS DS    X         Version                                        00440000
RCAETYPE DS    B         What this RCAE represents                      00441000
*  Bit definitions:                                                     00442000
RCAEPGN  EQU   X'80'     Reserved - Note *                              00443000
RCAERPGN EQU   X'40'     Reserved - Note *                              00444000
RCAESCL  EQU   X'20'     Service class                                  00445000
RCAERCL  EQU   X'10'     Report class                                   00446000
RCAENIU  EQU   X'08'     Reserved - Note *                              00447000
RCAEHRS1 EQU   X'07'     Reserved                                       00448000
RCAECLX  DS    H         RCAE index. This is the index into the        *00449000
                         service class or report class list returned   *00450000
                         by IWMPQRY                                     00451000
RCAEHRS2 DS    CL2       Reserved                                       00452000
RCAEPER# DS    H         Number of period data entries for this RCAE.   00453000
RCAEPERL DS    F         Length of all of the period data associated   *00454000
                         with this RCAE entry.                          00455000
RCAEPERO DS    F         Offset from RCAE to first period's data        00456000
RCAESCL# DS    H         Number of entries in the RCAESCLS array. That *00457000
                         is, the number of service classes being       *00458000
                         served by one or more address spaces in the   *00459000
                         service class specified by RCAECLX.            00460000
RCAESCLL DS    H         Length of a single entry (RCAESCLS) in the    *00461000
                         server data array.                             00462000
RCAESCLO DS    F         Offset from RCAE to RCAESCLS array. Zero      *00463000
                         indicates there is no server data available   *00464000
                         for this service class                         00465000
RCAECLSC DS    H         Indicating the index of the service class     *00466000
                         that last contributed to this report class.   *00467000
                         Zero for a service class entry.                00468000
RCAEPERIODSWITHDATA DS H For report classes, the highest period number *00469000
                         that was found in use since workload          *00470000
                         reporting was initialized. This number can    *00471000
                         grow over the time up to RCAEPER#. For        *00472000
                         service classes, RcaePeriodsWithData has the  *00473000
                         same value as RCAEPER#.                        00474000
RCAECMCI DS    BL8       Mixed class indication token that represents  *00475000
                         the time when a service class associated with *00476000
                         the report class contributing data to the     *00477000
                         report class last changed. To determine       *00478000
                         whether this report class is heterogeneous,   *00479000
                         this token must be compared with RCAAINTI of  *00480000
                         the previous call to IWMRCOLL. If RCAECMCI is *00481000
                         smaller than RCAAINTI, the report class is    *00482000
                         homogeneous for this collection interval       00483000
RCAEHRS3 DS    CL4       Reserved                                       00484000
RCAE_LEN EQU   *-RCAE                                                   00485000
.L000B   ANOP                                                           00486000
         AIF   ('&RCAESCLS' EQ 'NO').L000E                              00487000
         AIF   ('&DSECT' EQ 'YES').L000F                                00488000
         AIF   ('&RCAESCLS' NE 'YES').L000E                             00489000
RCAESCLS DS    0D        RCAE - An entry in the service classes served *00490000
                         array                                          00491000
         AGO   .L0010                                                   00492000
.L000F   ANOP                                                           00493000
RCAESCLS DSECT           RCAE - An entry in the service classes served *00494000
                         array                                          00495000
.L0010   ANOP                                                           00496000
RCAESCSN DS    H         Index of service class being served            00497000
RCAERS1  DS    CL2       Reserved                                       00498000
RCAESCS# DS    F         Number of times an address space running with *00499000
                         this service class (RCAECLX) served service   *00500000
                         class (RCAESCSN).                              00501000
RCAESCLS_LEN EQU *-RCAESCLS                                             00502000
.L000E   ANOP                                                           00503000
         AIF   ('&RCAEIHDR' EQ 'NO').L0011                              00504000
         AIF   ('&DSECT' EQ 'YES').L0012                                00505000
         AIF   ('&RCAEIHDR' NE 'YES').L0011                             00506000
RCAEIHDR DS    0D        RCAE - period header                           00507000
         AGO   .L0013                                                   00508000
.L0012   ANOP                                                           00509000
RCAEIHDR DSECT           RCAE - period header                           00510000
.L0013   ANOP                                                           00511000
RCAEPERI DS    X         Period number                                  00512000
RCAEIRSV DS    CL1       Reserved                                       00513000
RCAECOMP DS    CL2       Reserved - Note *                              00514000
         ORG   RCAECOMP                                                 00515000
RCAEDMN  DS    X         Reserved - Note *                              00516000
RCAETSGN DS    X         Reserved - Note *                              00517000
RCAEIRLN DS    H         Length of resource data section (RCAERESC)     00518000
RCAEIRS1 DS    CL2       Reserved                                       00519000
RCAEIROF DS    F         Offset from RCAEIHDR to resource data         *00520000
                         (RCAERESC). Zero indicates there is no        *00521000
                         resource data for this period                  00522000
RCAEIPLN DS    H         Length of response time section (RCAERST)      00523000
RCAEIRS2 DS    CL2       Reserved                                       00524000
RCAEIPOF DS    F         Offset from RCAEIHDR to response time data    *00525000
                         (RCAERST). Zero indicates there is no         *00526000
                         response time data available for this period   00527000
RCAEIGLN DS    H         Length of general execution delay section     *00528000
                         (RCAEDELA)                                     00529000
RCAEIRS3 DS    CL2       Reserved                                       00530000
RCAEIGOF DS    F         Offset from RCAEIHDR to general execution     *00531000
                         delay data (RCAEDELA). Zero indicates there   *00532000
                         is no general execution delay data is         *00533000
                         available for this period                      00534000
RCAEID#  DS    H         Number of entries in the response time        *00535000
                         distribution section (RCAEDIST). Zero if      *00536000
                         there is no distribution for this period       00537000
RCAEIDLN DS    H         Length of response time distribution section  *00538000
                         (RCAEDIST)                                     00539000
RCAEIDOF DS    F         Offset from RCAEIHDR to response time         *00540000
                         distribution data (RCAEDIST). This field is   *00541000
                         zero for report classes when there are no     *00542000
                         response time goals specified, or when no     *00543000
                         response time data is available for this      *00544000
                         period                                         00545000
RCAEIS#  DS    H         Number of entries in the subsystem work       *00546000
                         manager delay section (RCAEEELA). Zero if     *00547000
                         there are no subsystem work manager delays    *00548000
                         for this period                                00549000
RCAEISLN DS    H         Length of subsystem work manager delay        *00550000
                         section (RCAEEELA)                             00551000
RCAEISOF DS    F         Offset from RCAEIHDR to subsystem work        *00552000
                         manager delay data (RCAEEELA). Zero indicates *00553000
                         there is no subsystem work manager delay data *00554000
                         for this period                                00555000
RCAEINXP DS    F         Offset from RCAEIHDR to next period's data or *00556000
                         zero if last period                            00557000
RCAEPLSC DS    H         Index of the service class that last          *00558000
                         contributed to this report class. For         *00559000
                         homogeneous report class periods, this        *00560000
                         service class period's goal must be used to   *00561000
                         format the response time distribution for     *00562000
                         ended transactions reported in this report    *00563000
                         class. Zero for a service class entry          00564000
RCAEIRCT DS    H         Total number of times RCAEIMID and RCAEITST   *00565000
                         were changed after last policy activation.    *00566000
                         This counter may wrap over.                    00567000
RCAEPMCI DS    BL8       Mixed class indication token that represents  *00568000
                         the time when RCAEPLSC last changed. To       *00569000
                         determine whether this report class period is *00570000
                         heterogeneous over the reporting interval,    *00571000
                         this token must be compared with RcaaINTI     *00572000
                         from the IWMRCOLL invocation at the start of  *00573000
                         the interval. If RcaePMCI is smaller than     *00574000
                         RcaaINTI, the report class period is          *00575000
                         homogenous for this collection interval        00576000
RCAEITST DS    CL8       Timestamp of the last RCAEIMID change. Binary *00577000
                         zeroes when no RCAEIMID has been defined or   *00578000
                         calculated for this period before.             00579000
RCAEIMID DS    F         Midpoint of response time distribution, in    *00580000
                         milliseconds. Zero when not defined. Equal to *00581000
                         goal if this is a period with response time   *00582000
                         goal.                                          00583000
RCAEIFLG DS    B         Period flags.                                  00584000
*  Bit definitions:                                                     00585000
RCAECCIMP EQU  X'80'     1: Service class period implicitly designated *00586000
                         CPU critical                                   00587000
         DS    CL3       Reserved                                       00588000
RCAEIHDR_LEN EQU *-RCAEIHDR                                             00589000
.L0011   ANOP                                                           00590000
         AIF   ('&RCAERESC' EQ 'NO').L0014                              00591000
         AIF   ('&DSECT' EQ 'YES').L0015                                00592000
         AIF   ('&RCAERESC' NE 'YES').L0014                             00593000
RCAERESC DS    0D        RCAE - resource data                           00594000
         AGO   .L0016                                                   00595000
.L0015   ANOP                                                           00596000
RCAERESC DSECT           RCAE - resource data                           00597000
.L0016   ANOP                                                           00598000
RCAESRV  DS    CL8       Total service units for period                 00599000
         ORG   RCAESRV                                                  00600000
RCAESRV1 DS    F         Total service units for period - word 1        00601000
RCAESRV2 DS    F         Total service units for period - word 2        00602000
RCAECPU  DS    CL8       Total CPU service units                        00603000
         ORG   RCAECPU                                                  00604000
RCAECPU1 DS    F         Total CPU service units - word 1               00605000
RCAECPU2 DS    F         Total CPU service units - word 2               00606000
RCAEIOC  DS    CL8       Total I/O service units                        00607000
         ORG   RCAEIOC                                                  00608000
RCAEIOC1 DS    F         Total I/O service units - word 1               00609000
RCAEIOC2 DS    F         Total I/O service units - word 2               00610000
RCAEMSO  DS    CL8       Total MSO service units                        00611000
         ORG   RCAEMSO                                                  00612000
RCAEMSO1 DS    F         Total MSO service units - word 1               00613000
RCAEMSO2 DS    F         Total MSO service units - word 2               00614000
RCAESRB  DS    CL8       Total SRB service units                        00615000
         ORG   RCAESRB                                                  00616000
RCAESRB1 DS    F         Total SRB service units - word 1               00617000
RCAESRB2 DS    F         Total SRB service units - word 2               00618000
RCAEPIR  DS    CL8       Total page-ins count                           00619000
         ORG   RCAEPIR                                                  00620000
RCAEPIR1 DS    F         Total page-ins count - word 1                  00621000
RCAEPIR2 DS    F         Total page-ins count - word 2                  00622000
RCAEHSP  DS    CL8       Total hiperspace page-ins count - word 2       00623000
         ORG   RCAEHSP                                                  00624000
RCAEHSP1 DS    F         Total hiperspace page-ins count - word 1       00625000
RCAEHSP2 DS    F         Total hiperspace page-ins count - word 2       00626000
RCAEBPIR DS    CL8       Total block page-ins from aux                  00627000
         ORG   RCAEBPIR                                                 00628000
RCAEBPI1 DS    F         Total block page-ins from aux - word 1         00629000
RCAEBPI2 DS    F         Total block page-ins from aux - word 2         00630000
RCAEPIE  DS    CL8       Total page-ins from expanded count             00631000
         ORG   RCAEPIE                                                  00632000
RCAEPIE1 DS    F         Total page-ins from expanded count - word 1    00633000
RCAEPIE2 DS    F         Total page-ins from expanded count - word 2    00634000
RCAEBPIE DS    CL8       Total block page-ins from expanded count       00635000
         ORG   RCAEBPIE                                                 00636000
RCAEBPE1 DS    F         Total block page-ins from expanded count -    *00637000
                         word 1                                         00638000
RCAEBPE2 DS    F         Total block page-ins from expanded count -    *00639000
                         word 2                                         00640000
RCAEBKIA DS    CL8       Total aux blocks paged in                      00641000
         ORG   RCAEBKIA                                                 00642000
RCAEBKA1 DS    F         Total aux blocks paged in - word 1             00643000
RCAEBKA2 DS    F         Total aux blocks paged in - word 2             00644000
RCAEBKIE DS    CL8       Total expanded blocks paged in                 00645000
         ORG   RCAEBKIE                                                 00646000
RCAEBKE1 DS    F         Total expanded blocks paged in - word 1        00647000
RCAEBKE2 DS    F         Total expanded blocks paged in - word 2        00648000
RCAEPRS  DS    CL8       Total page residency time (in 1024            *00649000
                         microsecond units)                             00650000
         ORG   RCAEPRS                                                  00651000
RCAEPRS1 DS    F         Total page residency time - word 1             00652000
RCAEPRS2 DS    F         Total page residency time - word 2             00653000
RCAEERS  DS    CL8       Total expanded page residency time (in 1024   *00654000
                         microsecond units)                             00655000
         ORG   RCAEERS                                                  00656000
RCAEERS1 DS    F         Total expanded page residency time - word 1    00657000
RCAEERS2 DS    F         Total expanded page residency time - word 2    00658000
RCAETRR  DS    CL8       Total in-storage residency time (in 1024      *00659000
                         microsecond units)                             00660000
         ORG   RCAETRR                                                  00661000
RCAETRR1 DS    F         Total in-storage residency time - word 1       00662000
RCAETRR2 DS    F         Total in-storage residency time - word 2       00663000
RCAETAT  DS    CL8       Total transaction active time (in 1024        *00664000
                         microsecond units)                             00665000
         ORG   RCAETAT                                                  00666000
RCAETAT1 DS    F         Total transaction active time - word 1         00667000
RCAETAT2 DS    F         Total transaction active time - word 2         00668000
RCAERCT  DS    F         Total RCT time (in microsecond units)          00669000
RCAEIIT  DS    F         Total I/O interupt time (in microsecond       *00670000
                         units)                                         00671000
RCAEHST  DS    F         Total hiperspace service time (in microsecond *00672000
                         units)                                         00673000
RCAESWC  DS    F         Total swap count                               00674000
RCAECRMS DS    F         Total hiperspace eso read miss count           00675000
RCAESPPI DS    CL8       Total shared page-ins from aux count           00676000
         ORG   RCAESPPI                                                 00677000
RCAESPP1 DS    F         Total shared page-ins from aux count - word 1  00678000
RCAESPP2 DS    F         Total shared page-ins from aux count - word 2  00679000
RCAESPEI DS    CL8       Total shared page-ins from expanded count      00680000
         ORG   RCAESPEI                                                 00681000
RCAESPE1 DS    F         Total shared page-ins from expanded count -   *00682000
                         word 1                                         00683000
RCAESPE2 DS    F         Total shared page-ins from expanded count -   *00684000
                         word 2                                         00685000
RCAESPRS DS    CL8       Total shared page residency time (in 1024     *00686000
                         microsecond units)                             00687000
         ORG   RCAESPRS                                                 00688000
RCAESPRS1 DS   F         Total shared page residency time - word 1      00689000
RCAESPRS2 DS   F         Total shared page residency time - word 2      00690000
RCAEIOCT DS    CL8       Total DASD I/O connect time in 128            *00691000
                         microsecond units                              00692000
         ORG   RCAEIOCT                                                 00693000
RCAEIOCT1 DS   F         - word 1                                       00694000
RCAEIOCT2 DS   F         - word 2                                       00695000
RCAEIOWT DS    CL8       Total DASD I/O wait time (Queue time +        *00696000
                         Pending time in 128 microsecond units) Note:  *00697000
                         Does not include IOS queue time.               00698000
         ORG   RCAEIOWT                                                 00699000
RCAEIOWT1 DS   F         - word 1                                       00700000
RCAEIOWT2 DS   F         - word 2                                       00701000
RCAEIORC DS    F         Total DASD I/O count. This can be used with   *00702000
                         fields RCAEIOCT, RCAEIODT, RCAEIOWT, RCAEIOST *00703000
                         to determine average DASD response time for   *00704000
                         the period                                     00705000
RCAERRS1 DS    CL4       Reserved                                       00706000
RCAEIODT DS    CL8       Total DASD I/O disconnect time in 128         *00707000
                         microsecond units                              00708000
         ORG   RCAEIODT                                                 00709000
RCAEIODT1 DS   F         - word 1                                       00710000
RCAEIODT2 DS   F         - word 2                                       00711000
RCAEIOST DS    CL8       Total DASD IOS queue time in 128 microsecond  *00712000
                         units                                          00713000
         ORG   RCAEIOST                                                 00714000
RCAEIOST1 DS   F         - word 1                                       00715000
RCAEIOST2 DS   F         - word 2                                       00716000
RCAEIOQT DS    CL8       Total DASD I/O control unit queue time in 128 *00717000
                         microsecond units                              00718000
         ORG   RCAEIOQT                                                 00719000
RCAEIOQT1 DS   F         - word 1                                       00720000
RCAEIOQT2 DS   F         - word 2                                       00721000
RCAEIEAT DS    CL8       Independent enclave total transaction active  *00722000
                         time (in 1024 microsecond units) for enclaves *00723000
                         that originated on this system.                00724000
         ORG   RCAEIEAT                                                 00725000
RCAEIEA1 DS    F         - word 1                                       00726000
RCAEIEA2 DS    F         - word 2                                       00727000
RCAEXEAT DS    CL8       Exported enclave total transaction active     *00728000
                         time (in 1024 microsecond units).              00729000
         ORG   RCAEXEAT                                                 00730000
RCAEXEA1 DS    F         - word 1                                       00731000
RCAEXEA2 DS    F         - word 2                                       00732000
RCAEFEAT DS    CL8       Foreign enclave total transaction active time *00733000
                         (in 1024 microsecond units).                   00734000
         ORG   RCAEFEAT                                                 00735000
RCAEFEA1 DS    F         - word 1                                       00736000
RCAEFEA2 DS    F         - word 2                                       00737000
RCAEENQCPUTIMECONSUMED DS CL8 CPU time consumed while dispatching      *00738000
                         priority was temporarily raised because the   *00739000
                         work held a resource that other work needed   *00740000
                         (in 1.024 milliseconds units)                  00741000
         ORG   RCAEENQCPUTIMECONSUMED                                   00742000
RCAEENQCPUTIMECONSUMED1 DS F - word 1                                   00743000
RCAEENQCPUTIMECONSUMED2 DS F - word 2                                   00744000
RCAEZCBPT DS   CL8       Total zCBP service time in microseconds.      *00745000
                         Multiply with RCAANFFzCBP and divide by 256   *00746000
                         to calculate the equivalent time on a CP       00747000
         ORG   RCAEZCBPT                                                00748000
RCAEIFAT DS    CL8       Total IFA service time in microseconds.       *00749000
                         Multiply with RCAANFFI and divide by 256 to   *00750000
                         calculate the equivalent time on a CP          00751000
         ORG   RCAEIFAT                                                 00752000
RCAEIFAT1 DS   F         - word 1                                       00753000
RCAEIFAT2 DS   F         - word 2                                       00754000
RCAEZCBPTONCP DS CL8     Total zCBP time spent on CPs (in              *00755000
                         microseconds)                                  00756000
         ORG   RCAEZCBPTONCP                                            00757000
RCAEIFATONCP DS CL8      Total IFA time spent on CPs (in microseconds)  00758000
         ORG   RCAEIFATONCP                                             00759000
RCAEIFATONCP1 DS F       - word 1                                       00760000
RCAEIFATONCP2 DS F       - word 2                                       00761000
RCAEZCBPSU DS  CL8       Total zCBP service units. Multiply with       *00762000
                         RCAANFFzCBP and divide by 256 to calculate    *00763000
                         the CP equivalent value                        00764000
         ORG   RCAEZCBPSU                                               00765000
RCAEIFASU DS   CL8       Total IFA service units. Multiply with        *00766000
                         RCAANFFI and divide by 256 to calculate the   *00767000
                         CP equivalent value                            00768000
         ORG   RCAEIFASU                                                00769000
RCAEIFASU1 DS  F         - word 1                                       00770000
RCAEIFASU2 DS  F         - word 2                                       00771000
RCAEZCBPSUONCP DS CL8    Total zCBP eligible service units spent on CP  00772000
         ORG   RCAEZCBPSUONCP                                           00773000
RCAEIFASUONCP DS CL8     Total IFA eligible service units spent on CP   00774000
         ORG   RCAEIFASUONCP                                            00775000
RCAEIFASUONCP1 DS F      - word 1                                       00776000
RCAEIFASUONCP2 DS F      - word 2                                       00777000
RCAESUPSU DS   CL8       Total SUP service units. Multiply with        *00778000
                         RCAANFFS and divide by 256 to calculate the   *00779000
                         CP equivalent value                            00780000
         ORG   RCAESUPSU                                                00781000
RCAESUPSU1 DS  F         - word 1                                       00782000
RCAESUPSU2 DS  F         - word 2                                       00783000
RCAESUPSUONCP DS CL8     Total SUP eligible service units spent on CP   00784000
         ORG   RCAESUPSUONCP                                            00785000
RCAESUPSUONCP1 DS F      - word 1                                       00786000
RCAESUPSUONCP2 DS F      - word 2                                       00787000
RCAETIMEATPDP DS CL8     Time at promotion dispatch interval in units  *00788000
                         of 1.024 milliseconds                          00789000
         ORG   RCAETIMEATPDP                                            00790000
RCAETIMEATPDP1 DS F      - word 1                                       00791000
RCAETIMEATPDP2 DS F      - word 2                                       00792000
RCAECRMCPUTIMECONSUMED DS CL8 CPU time consumed while dispatching      *00793000
                         priority was temporarily raised by chronic    *00794000
                         resource contention management because the    *00795000
                         work held a resource that other work needed   *00796000
                         (in 1.024 milliseconds units)                  00797000
         ORG   RCAECRMCPUTIMECONSUMED                                   00798000
RCAECRMCPUTIMECONSUMED1 DS F - word 1                                   00799000
RCAECRMCPUTIMECONSUMED2 DS F - word 2                                   00800000
RCAEHDLOCKPROMOTIONTIMEATPDP DS CL8 CPU time consumed while            *00801000
                         dispatching priority was temporarily raised   *00802000
                         to shorten the lock hold time of a system     *00803000
                         suspend lock (in 1.024 milliseconds units).   *00804000
                         Promotion only in HD=YES mode                  00805000
         ORG   RCAEHDLOCKPROMOTIONTIMEATPDP                             00806000
RCAEHDLOCKPROMOTIONTIMEATPDP1 DS F word 1                               00807000
RCAEHDLOCKPROMOTIONTIMEATPDP2 DS F word 2                               00808000
RCAEVARTIMEATPDP DS CL8  Time at variable promotion dispatching        *00809000
                         priority in units of 1.024 milliseconds        00810000
         ORG   RCAEVARTIMEATPDP                                         00811000
RCAEVARTIMEATPDP1 DS F   - word 1                                       00812000
RCAEVARTIMEATPDP2 DS F   - word 2                                       00813000
RCAEIOTT DS    CL8       Total DASD I/O induced throttle time in 128   *00814000
                         microsecond units                              00815000
         ORG   RCAEIOTT                                                 00816000
RCAEIOTT1 DS   F         - word 1                                       00817000
RCAEIOTT2 DS   F         - word 2                                       00818000
RCAEIONT DS    CL8       Total DASD I/O contention time in 128         *00819000
                         microsecond units                              00820000
         ORG   RCAEIONT                                                 00821000
RCAEIONT1 DS   F         - word 1                                       00822000
RCAEIONT2 DS   F         - word 2                                       00823000
         DS    CL8       Reserved                                       00824000
RCAERESC_LEN EQU *-RCAERESC                                             00825000
.L0014   ANOP                                                           00826000
         AIF   ('&RCAERST' EQ 'NO').L0017                               00827000
         AIF   ('&DSECT' EQ 'YES').L0018                                00828000
         AIF   ('&RCAERST' NE 'YES').L0017                              00829000
RCAERST  DS    0D        RCAE - response time data                      00830000
         AGO   .L0019                                                   00831000
.L0018   ANOP                                                           00832000
RCAERST  DSECT           RCAE - response time data                      00833000
.L0019   ANOP                                                           00834000
RCAERCP  DS    F         Count of transaction completions for this     *00835000
                         period. This field also includes transaction  *00836000
                         completions reported by subsystem work        *00837000
                         managers via the IWMRPT service                00838000
RCAEARCP DS    F         Count of transactions that completed          *00839000
                         abnormally as reported by subsystem work      *00840000
                         managers. This value is not part of RCAERCP   *00841000
                         and should not be used for response time      *00842000
                         calculations.                                  00843000
RCAENCP  DS    F         Count of times an execution phase has         *00844000
                         completed by the subsystem work managers via  *00845000
                         the IWMMNTFY service.                          00846000
RCAEANCP DS    F         Count of transactions that completed their    *00847000
                         execution phase abnormally as reported by     *00848000
                         subsystem work manager. This value is not     *00849000
                         part of RCANCP and should not be used for     *00850000
                         execution response time calculations           00851000
RCAETET  DS    CL8       Total transaction elapsed time (in 1024       *00852000
                         microsecond units)                             00853000
         ORG   RCAETET                                                  00854000
RCAETET1 DS    F         - word 1                                       00855000
RCAETET2 DS    F         - word 2                                       00856000
RCAEXET  DS    CL8       Total transaction execution time (in 1024     *00857000
                         microsecond units)                             00858000
         ORG   RCAEXET                                                  00859000
RCAEXET1 DS    F         - word 1                                       00860000
RCAEXET2 DS    F         - word 2                                       00861000
RCAESTT  DS    CL8       Reserved - Note *                              00862000
         ORG   RCAESTT                                                  00863000
RCAESTT1 DS    F         Reserved - Note *                              00864000
RCAESTT2 DS    F         Reserved - Note *                              00865000
RCAEETS  DS    CL8       Sum of transaction elapsed times squared (in  *00866000
                         1024 microsecond units)                        00867000
         ORG   RCAEETS                                                  00868000
RCAEETS1 DS    F         - word 1                                       00869000
RCAEETS2 DS    F         - word 2                                       00870000
RCAEQDT  DS    CL8       Total queue delay time. For batch jobs this   *00871000
                         is the time jobs spent on the job queue while *00872000
                         eligible to run on some system. In other      *00873000
                         words this is the time jobs spent waiting for *00874000
                         an initiator. For TSO users, this time can be *00875000
                         a portion of the LOGON process. For APPC this *00876000
                         is the time an APPC request spends on an APPC *00877000
                         queue (in 1024 microsecond units)              00878000
         ORG   RCAEQDT                                                  00879000
RCAEQDT1 DS    F         - word 1                                       00880000
RCAEQDT2 DS    F         - word 2                                       00881000
RCAEADT  DS    CL8       Total time batch jobs were ineligible to run  *00882000
                         because a resource the job had affinity to    *00883000
                         was unavailable. Only applies to batch work.  *00884000
                         Zero for other work types (in 1024            *00885000
                         microsecond units)                             00886000
         ORG   RCAEADT                                                  00887000
RCAEADT1 DS    F         - word 1                                       00888000
RCAEADT2 DS    F         - word 2                                       00889000
RCAECVT  DS    CL8       Total time batch jobs spent in JCL            *00890000
                         conversion. Only applies to batch work. Zero  *00891000
                         for other work types (in 1024 microsecond     *00892000
                         units)                                         00893000
         ORG   RCAECVT                                                  00894000
RCAECVT1 DS    F         - word 1                                       00895000
RCAECVT2 DS    F         - word 2                                       00896000
RCAEIQT  DS    CL8       Total time batch jobs spent on job queue      *00897000
                         after JCL conversion while ineligible to run  *00898000
                         on any system for reasons other than resource *00899000
                         affinities. For example, this time can        *00900000
                         include operator hold of a job, delays due to *00901000
                         duplicate job names, delays due to job class  *00902000
                         limits. Only applies to batch work. Zero for  *00903000
                         other work types (in 1024 microsecond units)   00904000
         ORG   RCAEIQT                                                  00905000
RCAEIQT1 DS    F         - word 1                                       00906000
RCAEIQT2 DS    F         - word 2                                       00907000
RCAESPECRPT DS CL24      Special reporting data: 1 = all transactions, *00908000
                         2 = mobile transactions, 3 = categoryA        *00909000
                         transactions, 4 = categoryB transactions. In  *00910000
                         contrast to other data in this answer area,   *00911000
                         these values are not necessarily cumulative.  *00912000
                         Due to re-accounting of trans- action         *00913000
                         processor usage arising from the WLM          *00914000
                         Execution Delay Monitoring services, values   *00915000
                         might decrease from one invocation of         *00916000
                         IWMRCOLL to the other.                         00917000
         ORG   RCAESPECRPT                                              00918000
RCAESPECCP DS  FL8       Transaction service units on standard CP       00919000
         ORG   RCAESPECCP                                               00920000
RCAESPECCP1 DS F         - word 1                                       00921000
RCAESPECCP2 DS F         - word 2                                       00922000
RCAESPECOFFLOAD DS FL8   Transaction service units on offload engines   00923000
         ORG   RCAESPECOFFLOAD                                          00924000
RCAESPECOFFLOAD1 DS F    - word 1                                       00925000
RCAESPECOFFLOAD2 DS F    - word 2                                       00926000
RCAESPECOFFLOADONCP DS FL8 Transaction service units on standard CP    *00927000
                         that were offload eligible                     00928000
         ORG   RCAESPECOFFLOADONCP                                      00929000
RCAESPECOFFLOADONCP1 DS F - word 1                                      00930000
RCAESPECOFFLOADONCP2 DS F - word 2                                      00931000
         ORG   RCAESPECRPT+96                                           00932000
RCAETRANTIME DS FL8      Total transaction elapsed time. Same as       *00933000
                         RCAETET but in microsecond units               00934000
RCAETRANTIMESQ DS CL16   Sum of transaction elapsed times squared.     *00935000
                         Same as RCAEETS but in microsecond units       00936000
         ORG   RCAETRANTIMESQ                                           00937000
RCAETRANTIMESQ1 DS FL8   - doubleword 1                                 00938000
RCAETRANTIMESQ2 DS FL8   - doubleword 2                                 00939000
RCAEEXECTIME DS FL8      Total transaction execution time. Same as     *00940000
                         RCAEXET but in microsecond units               00941000
RCAEQDLYTIME DS FL8      Total queue delay time. Same as RCAEQDT but   *00942000
                         in microsecond units                           00943000
RCAEADLYTIME DS FL8      Total time batch jobs were ineligible to run  *00944000
                         because a resource the job had affinity to    *00945000
                         was unavailable. Same as RCAEADT but in       *00946000
                         microsecond units                              00947000
RCAECONVTIME DS FL8      Total time batch jobs spent in JCL            *00948000
                         conversion. Same as RCAECVT but in            *00949000
                         microsecond units                              00950000
RCAEIQUETIME DS FL8      Total time batch jobs spent on job queue      *00951000
                         after JCL conversion while ineligible to run  *00952000
                         on any system for reasons other than resource *00953000
                         affinities. Same as RCAEIQT but in            *00954000
                         microsecond units                              00955000
RCAESPECRPT_ZCBP DS CL16 Special reporting data for zCBP. Due to       *00956000
                         re-accounting of transaction processor usage  *00957000
                         arising from WLM Execution Delay Monitoring   *00958000
                         services, values might decrease from one      *00959000
                         IWMRCOLL invocation to the other               00960000
         ORG   RCAESPECRPT_ZCBP                                         00961000
RCAESPECZCBP DS FL8      Transaction service units on zCBP processors   00962000
RCAESPECZCBPONCP DS FL8  Transaction service units on standard CP that *00963000
                         were zCBP eligible                             00964000
RCAEENCTRXDATA DS CL24   Transaction data reported by subsystem work   *00965000
                         managers when deleting an enclave. These      *00966000
                         fields are not included in any other RCAERST  *00967000
                         fields                                         00968000
         ORG   RCAEENCTRXDATA                                           00969000
RCAEENCTRXNUM DS F       Number of single subsystem transactions       *00970000
                         processed within enclaves                      00971000
RCAEENCTRXCALLS DS F     Accumulated number of times transaction data  *00972000
                         has been reported by subsystem work managers  *00973000
                         when deleting an enclave                       00974000
RCAEENCTRXEXTIME DS FL8  Total execution time in micro- second units   *00975000
                         of subsystem transactions in RcaeEncTrxNum     00976000
RCAEENCTRXEXTIMESQ DS FL8 Sum of squared execution times in            *00977000
                         microsecond units of subsystem transactions   *00978000
                         in RcaeEncTrxNum                               00979000
RCAERST_LEN EQU *-RCAERST                                               00980000
.L0017   ANOP                                                           00981000
         AIF   ('&RCAEDIST' EQ 'NO').L001A                              00982000
         AIF   ('&DSECT' EQ 'YES').L001B                                00983000
         AIF   ('&RCAEDIST' NE 'YES').L001A                             00984000
RCAEDIST DS    0F        RCAE - response time distribution array        00985000
         AGO   .L001C                                                   00986000
.L001B   ANOP                                                           00987000
RCAEDIST DSECT           RCAE - response time distribution array        00988000
.L001C   ANOP                                                           00989000
RCAEDENT DS    F         An entry in the RCAE response time            *00990000
                         distribution array. Each entry in the array   *00991000
                         contains the number of transactions that      *00992000
                         completed in the time period represented by   *00993000
                         that entry. When used with the response time  *00994000
                         distribution bucket mapping (RCAABMAP),       *00995000
                         monitors can construct a distribution of      *00996000
                         completions verses goals specified.            00997000
RCAEDIST_LEN EQU *-RCAEDIST                                             00998000
.L001A   ANOP                                                           00999000
         AIF   ('&RCAEDELA' EQ 'NO').L001D                              01000000
         AIF   ('&DSECT' EQ 'YES').L001E                                01001000
         AIF   ('&RCAEDELA' NE 'YES').L001D                             01002000
RCAEDELA DS    0D        RCAE - general execution delay data            01003000
         AGO   .L001F                                                   01004000
.L001E   ANOP                                                           01005000
RCAEDELA DSECT           RCAE - general execution delay data            01006000
.L001F   ANOP                                                           01007000
RCAEVELC DS    CL8       Execution velocity data                        01008000
         ORG   RCAEVELC                                                 01009000
RCAECUSE DS    F         CPU using samples                              01010000
RCAETOTD DS    F         Total delay samples used in SRM's execution   *01011000
                         velocity calculation                           01012000
RCAEEDLA DS    CL48      General execution delays included in          *01013000
                         RCAETOTD. Each dispatchable unit of work      *01014000
                         sampled can increase one of the CPU or paging *01015000
                         delay samples                                  01016000
         ORG   RCAEEDLA                                                 01017000
RCAECDEL DS    F         CPU delay. A TCB or SRB is waiting to be      *01018000
                         dispatched (other than the first in-line      *01019000
                         behind sampler) or a TCB is waiting for local *01020000
                         lock.                                          01021000
RCAECCAP DS    F         CPU capping delay. A TCB or SRB is marked     *01022000
                         non-dispatchable because a resource group     *01023000
                         maximum is being enforced. Note that RCAECCAP *01024000
                         is NOT a subset of RCAECDEL                    01025000
RCAESWIN DS    F         Swap-in delay. Swap-in has started, but not   *01026000
                         completed                                      01027000
RCAEDMPL DS    F         MPL delay. Ready, but swap-in has not started  01028000
RCAEAPRV DS    F         Aux page from private                          01029000
RCAEACOM DS    F         Aux page from common                           01030000
RCAEXM   DS    F         Aux page from cross memory                     01031000
RCAEVIO  DS    F         Aux page from vio                              01032000
RCAEHSPC DS    F         Aux page from standard hiperspaces             01033000
RCAECHS  DS    F         Aux page from eso hiperspaces                  01034000
RCAEASPD DS    F         Shared paging from aux delay                   01035000
RCAEDRS1 DS    CL4       Reserved                                       01036000
RCAEUNKN DS    F         Unknown. Dispatchable unit or address space   *01037000
                         is waiting, but none of the above reasons     *01038000
                         apply. These samples are not included in      *01039000
                         RCAETOTD                                       01040000
RCAEIDLE DS    F         Idle. Work is in STIMER wait, TSO terminal    *01041000
                         wait, APPC wait, or is an initiator waiting   *01042000
                         for work. These samples are not included in   *01043000
                         RCAETOTD                                       01044000
RCAEPDEL DS    F         Resource group capping delay. Group maximum   *01045000
                         is being enforced for work in this service    *01046000
                         class. This delay only accounts for address   *01047000
                         spaces in the service class that are          *01048000
                         currently swapped in. These samples are not   *01049000
                         included in RCAETOTD                           01050000
RCAEPQUI DS    F         Quiesce delay. Some work in this service      *01051000
                         class has been reset via the RESET            *01052000
                         xxx,QUIESCE command. These samples are not    *01053000
                         included in RCAETOTD                           01054000
RCAESAC  DS    F         Sampled transaction count. Number of address  *01055000
                         spaces and enclaves that contributed delay    *01056000
                         and using samples to this service class.      *01057000
                         These samples are not included in RCAETOTD     01058000
RCAETOTU DS    F         Total usings. Velocity should be calculated   *01059000
                         as RCAETOTU/(RCAETOTD+RCAETOTU)                01060000
RCAEIOU  DS    F         Total I/O usings. These are included in       *01061000
                         RCAETOTU. Only non-paging DASD I/O can        *01062000
                         contribute to I/O usings                       01063000
RCAEEDL2 DS    CL28      Second set of execution delays included in    *01064000
                         RCAETOTD                                       01065000
         ORG   RCAEEDL2                                                 01066000
RCAEIOD  DS    F         DASD I/O delay samples                         01067000
RCAEQ    DS    F         Queue delay samples. Work is waiting for a    *01068000
                         server                                         01069000
RCAESPRV DS    F         Server private area paging delay samples       01070000
RCAESVIO DS    F         Server space VIO paging delay samples          01071000
RCAESHSP DS    F         Server hiperspace paging delay samples         01072000
RCAESMPL DS    F         Server MPL delay samples                       01073000
RCAESSWI DS    F         Server swap-in delay samples                   01074000
RCAETOTS DS    CL8       Total execution samples. It is the sum of     *01075000
                         RCAETOTU, RCAETOTD, RCAEUNKN, RCAEIDLE. Also  *01076000
                         always includes I/O using/delay samples       *01077000
                         whether or not I/O samples are included in    *01078000
                         RCAETOTU/RCAETOTD                              01079000
         ORG   RCAETOTS                                                 01080000
RCAETOTS1 DS   F         - word 1                                       01081000
RCAETOTS2 DS   F         - word 2                                       01082000
RCAENDIO DS    F         Non-DASD I/O using or delay samples.           01083000
RCAETOTDQ DS   F         Total delay samples always including batch    *01084000
                         queue delay. For service classes that contain *01085000
                         batch jobs that were not run in WLM managed   *01086000
                         initiators the batch queue delay samples are  *01087000
                         derived from the measured batch queue delay   *01088000
                         time. For service classes that contain only   *01089000
                         jobs that ran in WLM managed initiators this  *01090000
                         value is the same as RCEATOTD. RCAETOTDQ can  *01091000
                         be used as a migration aid to determine what  *01092000
                         a batch service class period's velocity will   01093000
*                        be if all its jobs are run in WLM managed     *01094000
                         initators                                      01095000
RCAECRYPTOCAMU DS F      CAM crypto using samples. No longer used       01096000
RCAECRYPTOCAMD DS F      CAM crypto delay samples. No longer used       01097000
RCAECRYPTOAPU DS F       AP crypto using samples. A task was found     *01098000
                         executing on a PCI Cryptographic Coprocessor  *01099000
                         (PCICC).                                       01100000
RCAECRYPTOAPD DS F       AP crypto delay samples. A task was found     *01101000
                         waiting for a PCI Cryptographic Coprocessor   *01102000
                         (PCICC).                                       01103000
RCAEFEATUREQD DS F       Feature queue delay samples. A task or srb    *01104000
                         was found waiting on a processor feature      *01105000
                         queue associated with a CPU. This is a subset *01106000
                         of RCAECDEL. Note, RCAECUSE includes feature  *01107000
                         queue using samples                            01108000
RCAERESOURCECONTENTIONDELAY DS F Contention delay samples. One sample  *01109000
                         is accumulated for each resource held. Only   *01110000
                         resource holders identified via IWMCNTN are   *01111000
                         reported                                       01112000
RCAERESOURCECONTENTIONUSING DS F Contention using samples. One sample  *01113000
                         is accumulated for each resource in use. Only *01114000
                         resource users identified via IWMCNTN are     *01115000
                         reported                                       01116000
RCAEZCBPCU DS  F         zCBP using samples                             01117000
         ORG   RCAEZCBPCU                                               01118000
RCAEIFACU DS   F         IFA using samples                              01119000
RCAEZCBPCUONCP DS F      zCBP on CP using samples                       01120000
         ORG   RCAEZCBPCUONCP                                           01121000
RCAEIFACUONCP DS F       IFA on CP using samples                        01122000
RCAEZCBPDL DS  F         zCBP delay samples                             01123000
         ORG   RCAEZCBPDL                                               01124000
RCAEIFADL DS   F         IFA delay samples                              01125000
RCAESUPCU DS   F         SUP using samples                              01126000
RCAESUPCUONCP DS F       SUP on CP using samples                        01127000
RCAESUPDL DS   F         SUP delay samples                              01128000
RCAERESERVED DS CL4      Reserved                                       01129000
RCAEDELA_LEN EQU *-RCAEDELA                                             01130000
.L001D   ANOP                                                           01131000
         AIF   ('&RCAEEELA' EQ 'NO').L0020                              01132000
         AIF   ('&DSECT' EQ 'YES').L0021                                01133000
         AIF   ('&RCAEEELA' NE 'YES').L0020                             01134000
RCAEEELA DS    0D        RCAE - Subsystem work manager delays           01135000
         AGO   .L0022                                                   01136000
.L0021   ANOP                                                           01137000
RCAEEELA DSECT           RCAE - Subsystem work manager delays           01138000
.L0022   ANOP                                                           01139000
RCAEEENT DS    CL172     An entry in the subsystem work manager delay  *01140000
                         array                                          01141000
         ORG   RCAEEENT                                                 01142000
RCAESTYP DS    CL4       Subsystem type, as used in the classification *01143000
                         rules specified in the WLM administrative     *01144000
                         application. The subsystem's documentation    *01145000
                         should explain the meaning that the product   *01146000
                         attributes to the various states               01147000
RCAEEFLG DS    B         Flags                                          01148000
*  Bit definitions:                                                     01149000
RCAEDBE  EQU   X'80'     Represents states sampled in the begin to end *01150000
                         phase of a transaction                         01151000
RCAEEXEC EQU   X'40'     Represents states sampled in the execution    *01152000
                         phase of a transaction                         01153000
RCAESRS1 EQU   X'3F'     Reserved                                       01154000
RCAESRS2 DS    CL3       Reserved                                       01155000
RCAEESS# DS    F         Total number of transaction states sampled in *01156000
                         the work phase specified by RCAEEFLG           01157000
RCAEACTV DS    F         Total number of active state samples. Active  *01158000
                         indicates that there is a program executing   *01159000
                         on behalf of the work request, from the       *01160000
                         perspective of the work manager. This does    *01161000
                         not mean that the program is active from the  *01162000
                         base control program's perspective             01163000
RCAERDY  DS    F         Total number of ready state samples. Ready    *01164000
                         indicates that there is a program ready to    *01165000
                         execute on behalf of the work request         *01166000
                         described by the monitoring environment, but  *01167000
                         the work manager has given priority to        *01168000
                         another work request                           01169000
RCAEIDL  DS    F         Total number of idle state samples. This      *01170000
                         indicates the number of times the work        *01171000
                         manager see a transaction as idle.             01172000
RCAEWLOK DS    F         Total number of waiting for lock state        *01173000
                         samples.                                       01174000
RCAEWIO  DS    F         Total number of waiting for I/O state         *01175000
                         samples. Waiting for I/O indicates that the   *01176000
                         work manager is waiting for an activity       *01177000
                         related to an I/O request. This may be an     *01178000
                         actual I/O operation or some other function   *01179000
                         associated with the I/O request                01180000
RCAEWCON DS    F         Total number of waiting for conversation      *01181000
                         state samples. Waiting for conversation may   *01182000
                         have been used in conjunction with the WLM    *01183000
                         service IWMMSWCH to identify where the        *01184000
                         recipient of the conversation is located. In  *01185000
                         this case, only the switched state will be    *01186000
                         recorded                                       01187000
RCAEWDST DS    F         Total number of waiting for distributed       *01188000
                         request state samples. Waiting for            *01189000
                         distributed request indicates a high level    *01190000
                         that some function or data must be routed     *01191000
                         prior to resumption of the work request. This *01192000
                         is to be contrasted with waiting for          *01193000
                         conversation, which is a low level view of    *01194000
                         the precise resource that is needed. A        *01195000
                         distributed request could involve waiting on  *01196000
                         a conversation as part of its processing       01197000
RCAEWSL  DS    F         Waiting for a session to be established       *01198000
                         locally, that is, on the current MVS image     01199000
RCAEWSN  DS    F         Waiting for a session to be established       *01200000
                         somewhere in the network                       01201000
RCAEWSS  DS    F         Waiting for a session to be established       *01202000
                         somewhere in the sysplex                       01203000
RCAEWTMR DS    F         Waiting for a timer                            01204000
RCAEWO   DS    F         Waiting for another product                    01205000
RCAEWMSC DS    F         Waiting for unidentified resource, possibly   *01206000
                         among another more specific category, but     *01207000
                         which may not be readily determined            01208000
RCAESSL  DS    F         State representing transactions for which     *01209000
                         there are logical continuations on this MVS   *01210000
                         image. Subsystem work managers might set this *01211000
                         state when they function ship a transaction   *01212000
                         to another component within the same MVS      *01213000
                         image                                          01214000
RCAESSS  DS    F         State representing transactions for which     *01215000
                         there are logical continuations on another    *01216000
                         MVS image in the sysplex. Subsystem work      *01217000
                         managers might set this state when they       *01218000
                         function ship a transaction to another        *01219000
                         component on another MVS image within the     *01220000
                         sysplex                                        01221000
RCAESSN  DS    F         State representing transactions for which     *01222000
                         there are logical continuations somewhere     *01223000
                         within the network. Subsystem work managers   *01224000
                         might set this state when they function ship  *01225000
                         a transaction to another component within the *01226000
                         network                                        01227000
RCAEBPMI DS    F         State representing buffer pool misses that    *01228000
                         resulted in I/O                                01229000
RCAEBPMC DS    F         Reserved                                       01230000
RCAEBPCM DS    F         Reserved                                       01231000
RCAECFMI DS    F         Reserved                                       01232000
RCAEWNL  DS    F         Waiting for new latch                          01233000
RCAEACTA DS    F         Total number of active application state      *01234000
                         samples                                        01235000
RCAEWSSL DS    F         Total number of waiting for SSL thread        *01236000
                         samples                                        01237000
RCAEWRET DS    F         Total number of waiting for regular thread    *01238000
                         samples                                        01239000
RCAEWREW DS    F         Total number of waiting for registration      *01240000
                         worktable samples                              01241000
RCAETYP1 DS    F         Total number of waiting for TYPE 1 samples     01242000
RCAETYP2 DS    F         Total number of waiting for TYPE 2 samples     01243000
RCAETYP3 DS    F         Total number of waiting for TYPE 3 samples     01244000
RCAETYP4 DS    F         Total number of waiting for TYPE 4 samples     01245000
RCAETYP5 DS    F         Total number of waiting for TYPE 5 samples     01246000
RCAETYP6 DS    F         Total number of waiting for TYPE 6 samples     01247000
RCAETYP7 DS    F         Total number of waiting for TYPE 7 samples     01248000
RCAETYP8 DS    F         Total number of waiting for TYPE 8 samples     01249000
RCAETYP9 DS    F         Total number of waiting for TYPE 9 samples     01250000
RCAETY10 DS    F         Total number of waiting for TYPE 10 samples    01251000
RCAETY11 DS    F         Total number of waiting for TYPE 11 samples    01252000
RCAETY12 DS    F         Total number of waiting for TYPE 12 samples    01253000
RCAETY13 DS    F         Total number of waiting for TYPE 13 samples    01254000
RCAETY14 DS    F         Total number of waiting for TYPE 14 samples    01255000
RCAETY15 DS    F         Total number of waiting for TYPE 15 samples    01256000
         ORG   RCAEEELA+344                                             01257000
RCAEEELA_LEN EQU *-RCAEEELA                                             01258000
.L0020   ANOP                                                           01259000
         AIF   ('&RCAAGDD' EQ 'NO').L0023                               01260000
         AIF   ('&DSECT' EQ 'YES').L0024                                01261000
         AIF   ('&RCAAGDD' NE 'YES').L0023                              01262000
RCAAGDD  DS    0F        Class definition for all generic delay state  *01263000
                         descriptions                                   01264000
         AGO   .L0025                                                   01265000
.L0024   ANOP                                                           01266000
RCAAGDD  DSECT           Class definition for all generic delay state  *01267000
                         descriptions                                   01268000
.L0025   ANOP                                                           01269000
RCAAGDDACRO DS CL4       Acronym                                        01270000
RCAAGDDVERS DS X         Version                                        01271000
RCAAGDDRS1 DS  CL1       Reserved                                       01272000
RCAAGDDENTRYL DS H       Length of one entry. Each single entry        *01273000
                         (RCAAGDDE) contains the description for one   *01274000
                         generic delay                                  01275000
RCAAGDDENTRY# DS H       Number of entries (RCAAGDDE)                   01276000
RCAAGDDENTRYO DS H       Offset of the first RCAAGDDE entry from       *01277000
                         beginning of RCAAGDD                           01278000
RCAAGDD_LEN EQU *-RCAAGDD                                               01279000
.L0023   ANOP                                                           01280000
         AIF   ('&RCAAGDDE' EQ 'NO').L0026                              01281000
         AIF   ('&DSECT' EQ 'YES').L0027                                01282000
         AIF   ('&RCAAGDDE' NE 'YES').L0026                             01283000
RCAAGDDE DS    0H        Class definition for one single generic delay *01284000
                         state description. For each combination of    *01285000
                         subsystem and delay state number there is one *01286000
                         entry. The entries for one subsystem are      *01287000
                         ordered by delay state number RcaaEGDDNum in  *01288000
                         ascending order                                01289000
         AGO   .L0028                                                   01290000
.L0027   ANOP                                                           01291000
RCAAGDDE DSECT           Class definition for one single generic delay *01292000
                         state description. For each combination of    *01293000
                         subsystem and delay state number there is one *01294000
                         entry. The entries for one subsystem are      *01295000
                         ordered by delay state number RcaaEGDDNum in  *01296000
                         ascending order                                01297000
.L0028   ANOP                                                           01298000
RCAAEGDDSUB DS CL4       Subsystem type                                 01299000
RCAAEGDDNUM DS H         Delay state number                             01300000
RCAAEGDDDSC DS CL16      Description                                    01301000
RCAANAME EQU   C'RCAA'   'RCAA' ACRONYM                                 01302000
*                                                                       01303000
* ********************************************************************  01304000
* *                                                                  *  01305000
* * The RCAAVRID and RCAEVRID must be changed if new fields are      *  01306000
* * added to any area in the RCAA ouput area (see APAR OW11082).     *  01307000
* * This is to keep vendor products aware of changes to the output   *  01308000
* * area.                                                            *  01309000
* *                                                                     01310000
* ********************************************************************  01311000
*                                                                       01312000
*                                                                       01313000
RCAA_VERSION1 EQU 1      RCAA version 1. 1=HBB5510                      01314000
RCAA_VERSION2 EQU 2      RCAA version 2. 2=HBB5520                      01315000
RCAA_VERSION3 EQU 3      RCAA version 3. 3=HBB6603                      01316000
RCAA_VERSION4 EQU 4      RCAA version 4. 4=JBB6604                      01317000
RCAA_VERSION9 EQU 9      RCAA version 9. 9=JBB6609                      01318000
RCAA_VERSION12 EQU 12    RCAA version 12. 12=HBB7705                    01319000
RCAA_VERSION13 EQU 13    RCAA version 13. 13=OW51848                    01320000
RCAA_VERSION14 EQU 14    RCAA version 14. 14=HBB7707                    01321000
RCAA_VERSION16 EQU 16    RCAA version 16. 16=HBB7709                    01322000
RCAA_VERSION17 EQU 17    RCAA version 17. 17=SUP support                01323000
RCAA_VERSION18 EQU 18    RCAA version 18. 18=HBB7740                    01324000
RCAA_VERSION19 EQU 19    RCAA version 19. 19=HBB7750                    01325000
RCAA_VERSION20 EQU 20    RCAA version 20. 20=HBB7760                    01326000
RCAA_VERSION21 EQU 21    RCAA version 21. 21=HBB7770                    01327000
RCAA_VERSION22 EQU 22    RCAA version 22. 22=HBB7780                    01328000
RCAA_VERSION23 EQU 23    RCAA version 23. 23=HBB7790                    01329000
RCAA_VERSION24 EQU 24    RCAA version 24. 24=HBB77B0                    01330000
RCAA_VERSION25 EQU 25    RCAA version 25. 25=HBB77C0                    01331000
RCAAVRID EQU   25        Current version level                          01332000
RCAA_LEVEL1 EQU 1        RCAA level. 1=Crypto Reporting, Multi period  *01333000
                         report classes, Work manager delays for       *01334000
                         Enclaves                                       01335000
RCAA_LEVEL2 EQU 2        RCAA level. 2=Fields for OA34801, now         *01336000
                         reserved                                       01337000
RCAA_LEVEL3 EQU 3        RCAA level. 3=Fields for OA47042 Special      *01338000
                         reporting                                      01339000
RCAA_LEVEL4 EQU 4        RCAA level. 4=zCBP support                     01340000
RCAA_LEVEL5 EQU 5        RCAA level. 5=High Performance Transactions   *01341000
                         support                                        01342000
RCAALEVL EQU   5         Current level                                  01343000
RCAENAME EQU   C'RCAE'   'RCAE' ACRONYM                                 01344000
RCAE_VERSION1 EQU 1      RCAE version 1. 1=HBB5510                      01345000
RCAE_VERSION2 EQU 2      RCAE version 2. 2=HBB5520                      01346000
RCAE_VERSION3 EQU 3      RCAE version 3. 3=HBB6603                      01347000
RCAE_VERSION4 EQU 4      RCAE version 4. 4=JBB6604                      01348000
RCAE_VERSION9 EQU 9      RCAE version 9. 9=JBB6609                      01349000
RCAE_VERSION12 EQU 12    RCAE version 12. 12=HBB7705                    01350000
RCAE_VERSION13 EQU 13    RCAE version 13. 13=OW51848                    01351000
RCAE_VERSION14 EQU 14    RCAE version 14. 14=HBB7707                    01352000
RCAE_VERSION16 EQU 16    RCAE version 16. 16=HBB7709                    01353000
RCAE_VERSION17 EQU 17    RCAE version 17. 17=SUP support                01354000
RCAE_VERSION18 EQU 18    RCAE version 18. 18=HBB7740                    01355000
RCAE_VERSION19 EQU 19    RCAE version 19. 19=HBB7750                    01356000
RCAE_VERSION20 EQU 20    RCAE version 20. 20=HBB7760                    01357000
RCAE_VERSION21 EQU 21    RCAE version 21. 21=HBB7770                    01358000
RCAE_VERSION22 EQU 22    RCAE version 22. 22=HBB7780                    01359000
RCAE_VERSION23 EQU 23    RCAE version 23. 23=HBB7790                    01360000
RCAE_VERSION24 EQU 24    RCAE version 24. 24=HBB77B0                    01361000
RCAE_VERSION25 EQU 25    RCAE version 25. 25=HBB77C0                    01362000
RCAE_VERSION26 EQU 26    RCAE version 26. 26=HBB77D0                    01363000
RCAEVRID EQU   26        Current version level                          01364000
RCAAGDD_ACRO EQU C'RGDD' 'RGDD' ACRONYM                                 01365000
RCAAGDD_VERSION1 EQU 1   RGDD version 1. 1=HBB7750                      01366000
RCAAGDDE_LEN EQU *-RCAAGDDE                                             01367000
.L0026   ANOP                                                           01368000
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 01369000
         AIF   ('&LIST' EQ 'YES').P4                                    01370000
.P3      ANOP                                                           01371000
         POP   PRINT                                                    01372000
.P4      ANOP                                                           01373000
.P_EXIT  ANOP                                                           01374000
         MEND                                                           01375000
**/ ;                                                                   01376000
* %IWMWRCAA_INCLUDED = 'YES';                                           01377000
* %DCL ZCBPRINT CHAR EXT;                                               01378000
* %DEACTIVATE ZCBPRINT;                                                 01379000
* %DCL IWMWRCAA_LIST CHAR EXT;                                          01380000
* %DEACTIVATE IWMWRCAA_LIST;                                            01381000
* %IF IWMWRCAA_LIST = 'NO' !                                            01382000
*    ZCBPRINT = 'NO' %THEN                                              01383000
* %DO;                                                                  01384000
*   @LIST PUSH NOECHO;                                                  01385000
*   @LIST NOASSEMBLE NOECHO;                                            01386000
*   @LIST OFF C NOECHO;                                                 01387000
* %END;                                                                 01388000
*/* Start of PL/X Source                                             */ 01389000
*/* Start of PL/X Source                                             */ 01390000
* %IF RCAAVIA = 'YES' %THEN          /* Check if RCAA ALET is           01391000
*                                       specified                    */ 01392000
*   %RCAAVIA = 'VIA(RCAAALET)';      /* Set VIA to specified value   */ 01393000
* %ELSE                                                                 01394000
*   %IF GLOBALARMODE = 'YES' %THEN   /* RCAA ALET not specified-check   01395000
*                                       if global default specified  */ 01396000
*     %RCAAVIA = 'VIA(0)';           /* If yes then set global       */ 01397000
*   %ELSE                                                               01398000
*     %RCAAVIA = '';                 /* If no then set to nulls      */ 01399000
*                                                                       01400000
* %IF RCAALOC = '' %THEN %RCAALOC = 'BASED(RCAAPTR)'; /*     @LRESPTA*/ 01401000
*                                                                       01402000
* DECLARE                                                               01403000
*  1 RCAA RCAAVIA RCAALOC,           /* Workload Activity Collection    01404000
*                                       Answer Area          @LRESPTC*/ 01405000
*    3 RCAAACRO CHAR(4),             /* Acronym                      */ 01406000
*    3 RCAASIZ  FIXED(31),           /* Size of RCAA and all of its     01407000
*                                       subordinate parts            */ 01408000
*    3 RCAAVERS FIXED(8),            /* Version                      */ 01409000
*    3 RCAAMODE BIT(8),              /* System WLM mode              */ 01410000
*      5 RCAAGOAL BIT(1),            /* System is in goal mode       */ 01411000
*      5 RCAACOMP BIT(1),            /* System is in compatibility      01412000
*                                       mode. Never on as of z/OS 1.3   01413000
*                                                            @PYN0179*/ 01414000
*      5 RCAAOVEL BIT(1),            /* System is calculating velocity  01415000
*                                       without using I/O delays.       01416000
*                                                            @PSY0260*/ 01417000
*      5 RCAAICO Bit(1),             /* 1: IFACrossOver=True @WLMPIFA*/ 01418000
*      5 RCAAHPO Bit(1),             /* 1: IFAHonorPriority = True      01419000
*                                                            @WLMPIFA*/ 01420000
*      5 RCAAzCBPDS Bit(1),          /* 1: zCBP processors run at       01421000
*                                       different speed      @LHWCONA*/ 01422000
*       7 RCAAIDS Bit(1),            /* 1: IFA processors run at        01423000
*                                       different speed      @LHWCONC*/ 01424000
*      5 RCAASDS Bit(1),             /* 1: SUP processors run at        01425000
*                                       different speed      @WLMPSUP*/ 01426000
*      5 RCAAHPZ Bit(1),             /* 1: SUPHonorPriority = True      01427000
*                                                            @OA20045*/ 01428000
*    3 RCAAOPT  CHAR(2),             /* IEAOPTxx suffix              */ 01429000
*    3 RCAATMI  BIT(64),             /* Local time reporting was last   01430000
*                                       initialized (STCK format)    */ 01431000
*    3 RCAATMR  BIT(64),             /* Local time this RCAA data was   01432000
*                                       collected (STCK format)      */ 01433000
*    3 RCAAGINF CHAR(32),            /* Goal mode information        */ 01434000
*      5 RCAAPNAM CHAR(8),           /* Policy name                  */ 01435000
*      5 RCAAPTM  BIT(64),           /* Local time policy was           01436000
*                                       activated (STCK format)      */ 01437000
*      5 RCAAUID  CHAR(8),           /* Userid of person who activated  01438000
*                                       policy                       */ 01439000
*      5 RCAAPSYS CHAR(8),           /* System that policy was          01440000
*                                       activated on                 */ 01441000
*    3 RCAACINF CHAR(24),            /* Reserved - Note *    @PYN0179*/ 01442000
*      5 RCAAIPS CHAR(2),            /* Reserved - Note *    @PYN0179*/ 01443000
*      5 RCAAICS CHAR(2),            /* Reserved - Note *    @PYN0179*/ 01444000
*      5 RCAASCO  CHAR(20),          /* Reserved - Note *    @PYN0179*/ 01445000
*        7 RCAAIPC  CHAR(4),         /* Reserved - Note *    @PYN0179*/ 01446000
*        7 RCAAIPI  CHAR(4),         /* Reserved - Note *    @PYN0179*/ 01447000
*        7 RCAAIPB  CHAR(4),         /* Reserved - Note *    @PYN0179*/ 01448000
*        7 RCAAIPM  CHAR(8),         /* Reserved - Note *    @PYN0179*/ 01449000
*    3 RCAANTVL FIXED(32),           /* Current sample interval (in     01450000
*                                       milliseconds).  This is the     01451000
*                                       frequency with which WLM        01452000
*                                       samples delays reported in the  01453000
*                                       RCAA                         */ 01454000
*    3 RCAANTV# FIXED(32),           /* Total number of times WLM       01455000
*                                       sampling code ran.  A monitor   01456000
*                                       issuing successive calls to     01457000
*                                       IWMRCOLL should not assume that 01458000
*                                       WLM sampling code ran at the    01459000
*                                       interval specified by RCAANTVL  01460000
*                                       between its calls.  This field  01461000
*                                       can be used to translate        01462000
*                                       sampled state data into actual  01463000
*                                       percentages of time.         */ 01464000
*    3 RCAABMPL FIXED(16),           /* Length of an entry in the       01465000
*                                       response time distribution      01466000
*                                       mapping array (RCAABMAP)     */ 01467000
*    3 RCAABMP# FIXED(16),           /* Number of response time         01468000
*                                       distribution buckets         */ 01469000
*    3 RCAABMPO FIXED(32),           /* Offset from RCAA to response    01470000
*                                       time distribution mapping array 01471000
*                                       (RCAABMAP)                   */ 01472000
*    3 RCAASCAL FIXED(16),           /* Length of one RCAE workload     01473000
*                                       activity entry in the RCAASCOF  01474000
*                                       array                        */ 01475000
*    3 RCAASCA# FIXED(16),           /* Number of entries in RCAASCOF   01476000
*                                       array. Number of service        01477000
*                                       classes returned in             01478000
*                                       IWMSVPOL by IWMPQRY  @PYN0179*/ 01479000
*    3 RCAASCOF FIXED(32),           /* Offset from RCAA to array of    01480000
*                                       RCAE entries which represent    01481000
*                                       service classes      @PYN0179*/ 01482000
*    3 RCAARCAL FIXED(16),           /* Length of one RCAE workload     01483000
*                                       activity entry in the RCAARCOF  01484000
*                                       array                        */ 01485000
*    3 RCAARCA# FIXED(16),           /* Number of entries in RCAARCOF   01486000
*                                       array which is the number of    01487000
*                                       report classes returned in      01488000
*                                       IWMSVPOL by IWMPQRY  @PYN0179*/ 01489000
*    3 RCAARCOF FIXED(32),           /* Offset from RCAA to array of    01490000
*                                       RCAE entries which represent    01491000
*                                       report classes       @PYN0179*/ 01492000
*    3 RCAACLVL FIXED(32),           /* Current change level            01493000
*                                                            @WLMPCRY*/ 01494000
*    3 RCAAINTI BIT(64),             /* Token that represents the time  01495000
*                                       when WLM has completed building 01496000
*                                       the RCAA. RCAAINTI must be      01497000
*                                       used to determine whether a     01498000
*                                       report class period is          01499000
*                                       homogeneous or not.  @PX00970*/ 01500000
*    3 RCAANFFzCBP FIXED(31),        /* Normalization factor for zCBP.  01501000
*                                       Multiply zCBP times with this   01502000
*                                       value and divide the result by  01503000
*                                       256 to obtain the equivalent    01504000
*                                       time on a CP         @LHWCONA*/ 01505000
*     5 RCAANFFI FIXED(31),          /* Normalization factor for IFA    01506000
*                                                            @LHWCONC*/ 01507000
*    3 RCAANFFS FIXED(31),           /* Normalization factor for SUP.   01508000
*                                       Multiply SUP times with this    01509000
*                                       value and divide the result by  01510000
*                                       256 to obtain the equivalent    01511000
*                                       time on a CP         @WLMPSUP*/ 01512000
*    3 RCAAGDDOFF Fixed(32),         /* Offset from RCAA to RCAAGDD     01513000
*                                                            @LPBDELA*/ 01514000
*    3 RCAAADJCCPU Fixed(32),        /* CPU adjustment factor           01515000
*                                                            @LPOWSMA*/ 01516000
*    3 RCAAADJCCPUNOM Fixed(32),     /* nominal CPU adjustment factor   01517000
*                                                            @LPOWSMA*/ 01518000
*    3 RCAAADJCCEC Fixed(32),        /* CEC adjustment factor           01519000
*                                                            @LPOWSMA*/ 01520000
*    3 RCAAFLAG Bit(8),              /* Flag byte. Only valid if        01521000
*                                       RCAACLVL greater 3   @LHWCONA*/ 01522000
*      5 RCAAzCBP Bit(1),            /* 1: Fields with both zCBP and    01523000
*                                       IFA names contain data about    01524000
*                                       zCBP processors      @LHWCONA*/ 01525000
*      5 *        Bit(7),            /* Reserved             @LHWCONA*/ 01526000
*    3 *  Char(3);                   /* Reserved             @LHWCONA*/ 01527000
*                                                                       01528000
* DECLARE                                                               01529000
*  1 RCAABMAP RCAAVIA BASED,         /* RCAA response time distribution 01530000
*                                       map array                    */ 01531000
*    3 RCAABENT FIXED(31);           /* Response time distribution      01532000
*                                       bucket mappings.  Each word     01533000
*                                       defines a maximum % of a goal   01534000
*                                       (ie. 50, 70, 100, etc.)  When   01535000
*                                       used in conjunction with an     01536000
*                                       RCAEDENT, a monitor product     01537000
*                                       can show the number of          01538000
*                                       transactions that completed in  01539000
*                                       a percentage of a goal.  The    01540000
*                                       last entry in the array         01541000
*                                       contains X'FFFFFFFF'.  This     01542000
*                                       indicates that this bucket      01543000
*                                       includes all transactions that  01544000
*                                       completed with longer response  01545000
*                                       times than the previous         01546000
*                                       bucket.                 @P6C */ 01547000
* DECLARE                                                               01548000
*  1 RCAAICSS BASED,                 /* Reserved - Note *    @PYN0179*/ 01549000
*    3 RCAAICSX FIXED(31),           /* Reserved - Note *    @PYN0179*/ 01550000
*    3 RCAAICSM FIXED(31),           /* Reserved - Note *    @PYN0179*/ 01551000
*    3 RCAAICSL FIXED(31);           /* Reserved - Note *    @PYN0179*/ 01552000
* DECLARE                                                               01553000
*   RCAAICX CHAR(*) BASED;           /* Reserved - Note *    @PYN0179*/ 01554000
* DECLARE                                                               01555000
*   RCAAICM CHAR(*) BASED;           /* Reserved - Note *    @PYN0179*/ 01556000
* DECLARE                                                               01557000
*  1 RCAE RCAAVIA BDY(DWORD) BASED,  /* Workload Activity Collection    01558000
*                                       Entry (RCAE).  Pointed to by    01559000
*                                       RCAASCOF and RCAARCOF which     01560000
*                                       are within the RCAA. To         01561000
*                                       navigate from one RCAE to       01562000
*                                       the next RCAE, the program      01563000
*                                       must use the length field in    01564000
*                                       RCAASCAL or RCAARCAL @OA61811*/ 01565000
*    3 RCAEACRO CHAR(4),             /* Acronym                      */ 01566000
*    3 RCAEVERS FIXED(8),            /* Version                      */ 01567000
*    3 RCAETYPE BIT(8),              /* What this RCAE represents    */ 01568000
*      5 RCAEPGN  BIT(1),            /* Reserved - Note *    @PYN0179*/ 01569000
*      5 RCAERPGN BIT(1),            /* Reserved - Note *    @PYN0179*/ 01570000
*      5 RCAESCL  BIT(1),            /* Service class                */ 01571000
*      5 RCAERCL  BIT(1),            /* Report class                 */ 01572000
*      5 RCAENIU  BIT(1),            /* Reserved - Note *    @PYN0179*/ 01573000
*      5 RCAEHRS1 BIT(3),            /* Reserved                     */ 01574000
*    3 RCAECLX  FIXED(16),           /* RCAE index. This is the index   01575000
*                                       into the service class or       01576000
*                                       report class list returned by   01577000
*                                       IWMPQRY              @PYN0179*/ 01578000
*    3 RCAEHRS2 CHAR(2),             /* Reserved                     */ 01579000
*    3 RCAEPER# FIXED(16),           /* Number of period data entries   01580000
*                                       for this RCAE.               */ 01581000
*    3 RCAEPERL FIXED(32),           /* Length of all of the period     01582000
*                                       data associated with this RCAE  01583000
*                                       entry.                       */ 01584000
*    3 RCAEPERO FIXED(32),           /* Offset from RCAE to first       01585000
*                                       period's data        @PYN0179*/ 01586000
*    3 RCAESCL# FIXED(16),           /* Number of entries in the        01587000
*                                       RCAESCLS array. That is, the    01588000
*                                       number of service classes       01589000
*                                       being served by one or more     01590000
*                                       address spaces in the service   01591000
*                                       class specified by RCAECLX.     01592000
*                                                            @PYN0179*/ 01593000
*    3 RCAESCLL FIXED(16),           /* Length of a single entry        01594000
*                                       (RCAESCLS) in the server data   01595000
*                                       array.                   @P6C*/ 01596000
*    3 RCAESCLO FIXED(32),           /* Offset from RCAE to RCAESCLS    01597000
*                                       array. Zero indicates there is  01598000
*                                       no server data available for    01599000
*                                       this service class           */ 01600000
*    3 RCAECLSC FIXED(16),           /* Indicating the index of the     01601000
*                                       service class that last         01602000
*                                       contributed to this report      01603000
*                                       class. Zero for a service       01604000
*                                       class entry.         @WLMPRTD*/ 01605000
*    3 RcaePeriodsWithData FIXED(16),/* For report classes, the highest 01606000
*                                       period number that was found in 01607000
*                                       use since workload reporting    01608000
*                                       was initialized. This number    01609000
*                                       can grow over the time up to    01610000
*                                       RCAEPER#. For service classes,  01611000
*                                       RcaePeriodsWithData has the     01612000
*                                       same value as RCAEPER#.         01613000
*                                                            @OW50148*/ 01614000
*    3 RCAECMCI BIT(64),             /* Mixed class indication token    01615000
*                                       that represents the time when   01616000
*                                       a service class associated with 01617000
*                                       the report class contributing   01618000
*                                       data to the report class last   01619000
*                                       changed.                        01620000
*                                       To determine whether this       01621000
*                                       report class is heterogeneous,  01622000
*                                       this token must be compared     01623000
*                                       with RCAAINTI of the previous   01624000
*                                       call to IWMRCOLL. If RCAECMCI   01625000
*                                       is smaller than RCAAINTI, the   01626000
*                                       report class is homogeneous     01627000
*                                       for this collection interval    01628000
*                                                            @PX00970*/ 01629000
*    3 RCAEHRS3 CHAR(4);             /* Reserved                     */ 01630000
* DECLARE                                                               01631000
*  1 RCAESCLS RCAAVIA BDY(DWORD) BASED,  /* RCAE - An entry in the      01632000
*                                       service classes served array*/  01633000
*    3 RCAESCSN FIXED(16),           /* Index of service class being    01634000
*                                       served                       */ 01635000
*    3 RCAERS1  CHAR(2),             /* Reserved                     */ 01636000
*    3 RCAESCS# FIXED(32);           /* Number of times an address      01637000
*                                       space running with this service 01638000
*                                       class (RCAECLX) served service  01639000
*                                       class (RCAESCSN).            */ 01640000
* DECLARE                                                               01641000
*  1 RCAEIHDR RCAAVIA BDY(DWORD) BASED,  /* RCAE - period header     */ 01642000
*    3 RCAEPERI FIXED(8),            /* Period number                */ 01643000
*    3 RCAEIRSV CHAR(1),             /* Reserved                     */ 01644000
*    3 RCAECOMP,                     /* Reserved - Note *    @PYN0179*/ 01645000
*      5 RCAEDMN  FIXED(8),          /* Reserved - Note *    @PYN0179*/ 01646000
*      5 RCAETSGN FIXED(8),          /* Reserved - Note *    @PYN0179*/ 01647000
*    3 RCAEIRLN FIXED(16),           /* Length of resource data         01648000
*                                       section (RCAERESC)           */ 01649000
*    3 RCAEIRS1 CHAR(2),             /* Reserved                     */ 01650000
*    3 RCAEIROF FIXED(32),           /* Offset from RCAEIHDR to         01651000
*                                       resource data (RCAERESC). Zero  01652000
*                                       indicates there is no resource  01653000
*                                       data for this period         */ 01654000
*    3 RCAEIPLN FIXED(16),           /* Length of response time         01655000
*                                       section (RCAERST)            */ 01656000
*    3 RCAEIRS2 CHAR(2),             /* Reserved                     */ 01657000
*    3 RCAEIPOF FIXED(32),           /* Offset from RCAEIHDR to         01658000
*                                       response time data (RCAERST).   01659000
*                                       Zero indicates there is no      01660000
*                                       response time data available    01661000
*                                       for this period          @P1C*/ 01662000
*    3 RCAEIGLN FIXED(16),           /* Length of general execution     01663000
*                                       delay section (RCAEDELA)     */ 01664000
*    3 RCAEIRS3 CHAR(2),             /* Reserved                     */ 01665000
*    3 RCAEIGOF FIXED(32),           /* Offset from RCAEIHDR to         01666000
*                                       general execution delay data    01667000
*                                       (RCAEDELA). Zero indicates      01668000
*                                       there is no general execution   01669000
*                                       delay data is available for     01670000
*                                       this period                  */ 01671000
*    3 RCAEID#  FIXED(16),           /* Number of entries in the        01672000
*                                       response time distribution      01673000
*                                       section (RCAEDIST). Zero if     01674000
*                                       there is no distribution for    01675000
*                                       this period                  */ 01676000
*    3 RCAEIDLN FIXED(16),           /* Length of response time         01677000
*                                       distribution section            01678000
*                                       (RCAEDIST)                   */ 01679000
*    3 RCAEIDOF FIXED(32),           /* Offset from RCAEIHDR to         01680000
*                                       response time distribution      01681000
*                                       data (RCAEDIST). This field is  01682000
*                                       zero for report classes when    01683000
*                                       there are no response time      01684000
*                                       goals specified, or when no     01685000
*                                       response time data is available 01686000
*                                       for this period      @PYN0179*/ 01687000
*    3 RCAEIS#  FIXED(16),           /* Number of entries in the        01688000
*                                       subsystem work manager delay    01689000
*                                       section (RCAEEELA). Zero if     01690000
*                                       there are no subsystem work     01691000
*                                       manager delays for this         01692000
*                                       period                       */ 01693000
*    3 RCAEISLN FIXED(16),           /* Length of subsystem work        01694000
*                                       manager delay section           01695000
*                                       (RCAEEELA)                   */ 01696000
*    3 RCAEISOF FIXED(32),           /* Offset from RCAEIHDR to         01697000
*                                       subsystem work manager delay    01698000
*                                       data (RCAEEELA). Zero indicates 01699000
*                                       there is no subsystem work      01700000
*                                       manager delay data for this     01701000
*                                       period                       */ 01702000
*    3 RCAEINXP FIXED(32),           /* Offset from RCAEIHDR to next    01703000
*                                       period's data or zero if last   01704000
*                                       period                       */ 01705000
*    3 RCAEPLSC FIXED(16),           /* Index of the service class      01706000
*                                       that last contributed to this   01707000
*                                       report class. For homogeneous   01708000
*                                       report class periods, this      01709000
*                                       service class period's goal     01710000
*                                       must be used to format the      01711000
*                                       response time distribution for  01712000
*                                       ended transactions reported in  01713000
*                                       this report class. Zero for a   01714000
*                                       service class entry  @WLMPRTD*/ 01715000
*    3 RCAEIRCT FIXED(16),           /* Total number of times RCAEIMID  01716000
*                                       and RCAEITST were changed       01717000
*                                       after last policy activation.   01718000
*                                       This counter may wrap over.     01719000
*                                                            @ME19196*/ 01720000
*    3 RCAEPMCI BIT(64),             /* Mixed class indication token    01721000
*                                       that represents the time when   01722000
*                                       RCAEPLSC last changed. To       01723000
*                                       determine whether this report   01724000
*                                       class period is heterogeneous   01725000
*                                       over the reporting interval,    01726000
*                                       this token must be compared     01727000
*                                       with RcaaINTI from the IWMRCOLL 01728000
*                                       invocation at the start of the  01729000
*                                       interval. If RcaePMCI is        01730000
*                                       smaller than RcaaINTI, the      01731000
*                                       report class period is          01732000
*                                       homogenous for this collection  01733000
*                                       interval             @PX00970*/ 01734000
*    3 RCAEITST CHAR(8),             /* Timestamp of the last RCAEIMID  01735000
*                                       change. Binary zeroes when no   01736000
*                                       RCAEIMID has been defined or    01737000
*                                       calculated for this period      01738000
*                                       before.              @LRDISTA*/ 01739000
*    3 RCAEIMID FIXED(31),           /* Midpoint of response time       01740000
*                                       distribution, in milliseconds.  01741000
*                                       Zero when not defined. Equal    01742000
*                                       to goal if this is a period     01743000
*                                       with response time goal.        01744000
*                                                            @LRDISTA*/ 01745000
*    3 RCAEIFLG BIT(8),              /* Period flags.        @LBOOS2C*/ 01746000
*      5 RCAECCImp BIT(1),           /* 1: Service class period         01747000
*                                       implicitly designated           01748000
*                                       CPU critical         @LBOOS2A*/ 01749000
*      5 *         BIT(7),           /* Reserved             @LBOOS2A*/ 01750000
*    3 * CHAR(3);                    /* Reserved             @LBOOS2A*/ 01751000
*                                                                       01752000
* %IF RCAATYPE = 'YES' %THEN %DO;    /*                      @LRESPTA*/ 01753000
* DECLARE                                                               01754000
*  RCAERESC RCAAVIA IsA(RCAERescData) BDY(DWORD) BASED; /*   @LRESPTA*/ 01755000
* DECLARE                                                               01756000
*  1 RCAERescData TYPE,              /* RCAE - resource data @LRESPTA*/ 01757000
* %END;                              /*                      @LRESPTA*/ 01758000
* %ELSE %DO;                         /*                      @LRESPTA*/ 01759000
* DECLARE                                                               01760000
*  1 RCAERESC RCAAVIA BDY(DWORD) BASED,  /* RCAE - resource data        01761000
*                                                            @LCOEFFC*/ 01762000
* %END;                              /*                      @LRESPTA*/ 01763000
*    3 RCAESRV,                      /* Total service units for         01764000
*                                       period                       */ 01765000
*      5 RCAESRV1 FIXED(32),         /* Total service units for period  01766000
*                                       - word 1                     */ 01767000
*      5 RCAESRV2 FIXED(32),         /* Total service units for period  01768000
*                                       - word 2                     */ 01769000
*    3 RCAECPU,                      /* Total CPU service units      */ 01770000
*      5 RCAECPU1 FIXED(32),         /* Total CPU service units         01771000
*                                       - word 1                     */ 01772000
*      5 RCAECPU2 FIXED(32),         /* Total CPU service units         01773000
*                                       - word 2                     */ 01774000
*    3 RCAEIOC,                      /* Total I/O service units      */ 01775000
*      5 RCAEIOC1 FIXED(32),         /* Total I/O service units         01776000
*                                       - word 1                     */ 01777000
*      5 RCAEIOC2 FIXED(32),         /* Total I/O service units         01778000
*                                       - word 2                     */ 01779000
*    3 RCAEMSO,                      /* Total MSO service units      */ 01780000
*      5 RCAEMSO1 FIXED(32),         /* Total MSO service units         01781000
*                                       - word 1                     */ 01782000
*      5 RCAEMSO2 FIXED(32),         /* Total MSO service units         01783000
*                                       - word 2                     */ 01784000
*    3 RCAESRB,                      /* Total SRB service units      */ 01785000
*      5 RCAESRB1 FIXED(32),         /* Total SRB service units         01786000
*                                       - word 1                     */ 01787000
*      5 RCAESRB2 FIXED(32),         /* Total SRB service units         01788000
*                                       - word 2                     */ 01789000
*    3 RCAEPIR,                      /* Total page-ins count         */ 01790000
*      5 RCAEPIR1 FIXED(32),         /* Total page-ins count            01791000
*                                       - word 1                     */ 01792000
*      5 RCAEPIR2 FIXED(32),         /* Total page-ins count            01793000
*                                       - word 2                     */ 01794000
*    3 RCAEHSP,                      /* Total hiperspace page-ins       01795000
*                                       count - word 2               */ 01796000
*      5 RCAEHSP1 FIXED(32),         /* Total hiperspace page-ins count 01797000
*                                       - word 1                     */ 01798000
*      5 RCAEHSP2 FIXED(32),         /* Total hiperspace page-ins count 01799000
*                                       - word 2                     */ 01800000
*    3 RCAEBPIR,                     /* Total block page-ins from       01801000
*                                       aux                          */ 01802000
*      5 RCAEBPI1 FIXED(32),         /* Total block page-ins from aux   01803000
*                                       - word 1                     */ 01804000
*      5 RCAEBPI2 FIXED(32),         /* Total block page-ins from aux   01805000
*                                       - word 2                     */ 01806000
*    3 RCAEPIE,                      /* Total page-ins from expanded    01807000
*                                       count                        */ 01808000
*      5 RCAEPIE1 FIXED(32),         /* Total page-ins from expanded    01809000
*                                       count - word 1               */ 01810000
*      5 RCAEPIE2 FIXED(32),         /* Total page-ins from expanded    01811000
*                                       count - word 2               */ 01812000
*    3 RCAEBPIE,                     /* Total block page-ins from       01813000
*                                       expanded count               */ 01814000
*      5 RCAEBPE1 FIXED(32),         /* Total block page-ins from       01815000
*                                       expanded count - word 1      */ 01816000
*      5 RCAEBPE2 FIXED(32),         /* Total block page-ins from       01817000
*                                       expanded count - word 2      */ 01818000
*    3 RCAEBKIA,                     /* Total aux blocks paged in    */ 01819000
*      5 RCAEBKA1 FIXED(32),         /* Total aux blocks paged in       01820000
*                                       - word 1                     */ 01821000
*      5 RCAEBKA2 FIXED(32),         /* Total aux blocks paged in       01822000
*                                       - word 2                     */ 01823000
*    3 RCAEBKIE,                     /* Total expanded blocks paged     01824000
*                                       in                           */ 01825000
*      5 RCAEBKE1 FIXED(32),         /* Total expanded blocks paged in  01826000
*                                       - word 1                     */ 01827000
*      5 RCAEBKE2 FIXED(32),         /* Total expanded blocks paged in  01828000
*                                       - word 2                     */ 01829000
*    3 RCAEPRS,                      /* Total page residency time (in   01830000
*                                       1024 microsecond units)      */ 01831000
*      5 RCAEPRS1 FIXED(32),         /* Total page residency time       01832000
*                                       - word 1                     */ 01833000
*      5 RCAEPRS2 FIXED(32),         /* Total page residency time       01834000
*                                       - word 2                     */ 01835000
*    3 RCAEERS,                      /* Total expanded page residency   01836000
*                                       time (in 1024 microsecond       01837000
*                                       units)                       */ 01838000
*      5 RCAEERS1 FIXED(32),         /* Total expanded page residency   01839000
*                                       time - word 1                */ 01840000
*      5 RCAEERS2 FIXED(32),         /* Total expanded page residency   01841000
*                                       time - word 2                */ 01842000
*    3 RCAETRR,                      /* Total in-storage residency time 01843000
*                                       (in 1024 microsecond units)  */ 01844000
*      5 RCAETRR1 FIXED(32),         /* Total in-storage residency time 01845000
*                                       - word 1                     */ 01846000
*      5 RCAETRR2 FIXED(32),         /* Total in-storage residency time 01847000
*                                       - word 2                     */ 01848000
*    3 RCAETAT,                      /* Total transaction active time   01849000
*                                       (in 1024 microsecond units)  */ 01850000
*      5 RCAETAT1 FIXED(32),         /* Total transaction active time   01851000
*                                       - word 1                     */ 01852000
*      5 RCAETAT2 FIXED(32),         /* Total transaction active time   01853000
*                                       - word 2                     */ 01854000
*    3 RCAERCT  FIXED(32),           /* Total RCT time (in microsecond  01855000
*                                       units)                       */ 01856000
*    3 RCAEIIT  FIXED(32),           /* Total I/O interupt time (in     01857000
*                                       microsecond units)           */ 01858000
*    3 RCAEHST  FIXED(32),           /* Total hiperspace service time   01859000
*                                       (in microsecond units)       */ 01860000
*    3 RCAESWC  FIXED(32),           /* Total swap count             */ 01861000
*    3 RCAECRMS FIXED(32),           /* Total hiperspace eso read       01862000
*                                       miss count                   */ 01863000
*    3 RCAESPPI,                     /* Total shared page-ins from      01864000
*                                       aux count                @L1A*/ 01865000
*      5 RCAESPP1 FIXED(32),         /* Total shared page-ins from      01866000
*                                       aux count - word 1       @L1A*/ 01867000
*      5 RCAESPP2 FIXED(32),         /* Total shared page-ins from      01868000
*                                       aux count - word 2       @L1A*/ 01869000
*    3 RCAESPEI,                     /* Total shared page-ins from      01870000
*                                       expanded count           @L1A*/ 01871000
*      5 RCAESPE1 FIXED(32),         /* Total shared page-ins from      01872000
*                                       expanded count - word 1  @L1A*/ 01873000
*      5 RCAESPE2 FIXED(32),         /* Total shared page-ins from      01874000
*                                       expanded count - word 2  @L1A*/ 01875000
*    3 RCAESPRS,                     /* Total shared page residency     01876000
*                                       time (in 1024 microsecond       01877000
*                                       units)                   @L1A*/ 01878000
*      5 RCAESPRS1 FIXED(32),        /* Total shared page residency     01879000
*                                       time - word 1            @L1A*/ 01880000
*      5 RCAESPRS2 FIXED(32),        /* Total shared page residency     01881000
*                                       time - word 2            @L1A*/ 01882000
*    3 RCAEIOCT,                     /* Total DASD I/O connect time     01883000
*                                       in 128 microsecond units        01884000
*                                                            @DQC0023*/ 01885000
*      5 RCAEIOCT1 FIXED(32),        /* - word 1             @DQC0023*/ 01886000
*      5 RCAEIOCT2 FIXED(32),        /* - word 2             @DQC0023*/ 01887000
*    3 RCAEIOWT,                     /* Total DASD I/O wait time        01888000
*                                       (Queue time + Pending time      01889000
*                                       in 128 microsecond units)       01890000
*                                       Note: Does not include IOS      01891000
*                                       queue time.          @WLMPIOP*/ 01892000
*      5 RCAEIOWT1 FIXED(32),        /* - word 1             @WLMPIOP*/ 01893000
*      5 RCAEIOWT2 FIXED(32),        /* - word 2             @WLMPIOP*/ 01894000
*    3 RCAEIORC FIXED(32),           /* Total DASD I/O count. This      01895000
*                                       can be used with fields         01896000
*                                       RCAEIOCT, RCAEIODT, RCAEIOWT,   01897000
*                                       RCAEIOST to determine average   01898000
*                                       DASD response time for the      01899000
*                                       period               @WLMPBAT*/ 01900000
*    3 RCAERRS1  CHAR(4),            /* Reserved             @WLMPIOP*/ 01901000
*    3 RCAEIODT,                     /* Total DASD I/O disconnect time  01902000
*                                       in 128 microsecond units        01903000
*                                                            @DQC0023*/ 01904000
*      5 RCAEIODT1 FIXED(32),        /* - word 1             @DQC0023*/ 01905000
*      5 RCAEIODT2 FIXED(32),        /* - word 2             @DQC0023*/ 01906000
*    3 RCAEIOST,                     /* Total DASD IOS queue time       01907000
*                                       in 128 microsecond units        01908000
*                                                            @WLMPBAT*/ 01909000
*      5 RCAEIOST1 FIXED(32),        /* - word 1             @WLMPBAT*/ 01910000
*      5 RCAEIOST2 FIXED(32),        /* - word 2             @WLMPBAT*/ 01911000
*    3 RCAEIOQT,                     /* Total DASD I/O control unit     01912000
*                                       queue time in 128 microsecond   01913000
*                                       units                @LSLED2C*/ 01914000
*      5 RCAEIOQT1 FIXED(32),        /* - word 1             @LSLED2A*/ 01915000
*      5 RCAEIOQT2 FIXED(32),        /* - word 2             @LSLED2A*/ 01916000
*    3 RCAEIEAT,                     /* Independent enclave total       01917000
*                                       transaction active time (in     01918000
*                                       1024 microsecond units) for     01919000
*                                       enclaves that originated on     01920000
*                                       this system.         @WLMPMES*/ 01921000
*      5 RCAEIEA1 FIXED(32),         /* - word 1             @WLMPMES*/ 01922000
*      5 RCAEIEA2 FIXED(32),         /* - word 2             @WLMPMES*/ 01923000
*    3 RCAEXEAT,                     /* Exported enclave total          01924000
*                                       transaction active time         01925000
*                                       (in 1024 microsecond units).    01926000
*                                                            @WLMPMES*/ 01927000
*      5 RCAEXEA1 FIXED(32),         /* - word 1             @WLMPMES*/ 01928000
*      5 RCAEXEA2 FIXED(32),         /* - word 2             @WLMPMES*/ 01929000
*    3 RCAEFEAT,                     /* Foreign enclave total           01930000
*                                       transaction active time         01931000
*                                       (in 1024 microsecond units).    01932000
*                                                            @WLMPMES*/ 01933000
*      5 RCAEFEA1 FIXED(32),         /* - word 1             @WLMPMES*/ 01934000
*      5 RCAEFEA2 FIXED(32),         /* - word 2             @WLMPMES*/ 01935000
*    3 RCAEENQCpuTimeConsumed,       /* CPU time consumed while         01936000
*                                       dispatching priority was        01937000
*                                       temporarily raised because      01938000
*                                       the work held a resource        01939000
*                                       that other work needed          01940000
*                                       (in 1.024 milliseconds units)   01941000
*                                                            @WLMPEM2*/ 01942000
*      5 RCAEENQCpuTimeConsumed1 FIXED(32), /* - word 1      @WLMPEM2*/ 01943000
*      5 RCAEENQCpuTimeConsumed2 FIXED(32), /* - word 2      @WLMPEM2*/ 01944000
*    3 RCAEzCBPT,                    /* Total zCBP service time in      01945000
*                                       microseconds. Multiply with     01946000
*                                       RCAANFFzCBP and divide by 256   01947000
*                                       to calculate the equivalent     01948000
*                                       time on a CP         @LHWCONA*/ 01949000
*      5 RCAEIfaT,                   /* Total IFA service time in       01950000
*                                       microseconds. Multiply with     01951000
*                                       RCAANFFI and divide by 256 to   01952000
*                                       calculate the equivalent time   01953000
*                                       on a CP              @LHWCONC*/ 01954000
*        7 RCAEIfaT1     Fixed(32),  /* - word 1             @LHWCONC*/ 01955000
*        7 RCAEIfaT2     Fixed(32),  /* - word 2             @LHWCONC*/ 01956000
*    3 RCAEzCBPTonCP,                /* Total zCBP time spent on CPs    01957000
*                                       (in microseconds)    @LHWCONA*/ 01958000
*      5 RCAEIfaTonCP,               /* Total IFA time spent on CPs     01959000
*                                       (in microseconds)    @LHWCONC*/ 01960000
*        7 RCAEIfaTonCP1 Fixed(32),  /* - word 1             @LHWCONC*/ 01961000
*        7 RCAEIfaTonCP2 Fixed(32),  /* - word 2             @LHWCONC*/ 01962000
*    3 RCAEzCBPSU,                   /* Total zCBP service units.       01963000
*                                       Multiply with RCAANFFzCBP and   01964000
*                                       divide by 256 to calculate the  01965000
*                                       CP equivalent value  @LHWCONA*/ 01966000
*      5 RCAEIfaSU,                  /* Total IFA service units.        01967000
*                                       Multiply with RCAANFFI and      01968000
*                                       divide by 256 to calculate the  01969000
*                                       CP equivalent value  @LHWCONC*/ 01970000
*        7 RCAEIfaSU1  Fixed(32),    /* - word 1             @LHWCONC*/ 01971000
*        7 RCAEIfaSU2  Fixed(32),    /* - word 2             @LHWCONC*/ 01972000
*    3 RCAEzCBPSUonCP,               /* Total zCBP eligible service     01973000
*                                       units spent on CP    @LHWCONA*/ 01974000
*      5 RCAEIfaSUonCP,              /* Total IFA eligible service      01975000
*                                       units spent on CP    @LHWCONC*/ 01976000
*        7 RCAEIfaSUonCP1 Fixed(32), /* - word 1             @LHWCONC*/ 01977000
*        7 RCAEIfaSUonCP2 Fixed(32), /* - word 2             @LHWCONC*/ 01978000
*    3 RCAESUPSU,                    /* Total SUP service units.        01979000
*                                       Multiply with RCAANFFS and      01980000
*                                       divide by 256 to calculate the  01981000
*                                       CP equivalent value  @WLMPSUP*/ 01982000
*      5 RCAESUPSU1    Fixed(32),    /* - word 1             @WLMPSUP*/ 01983000
*      5 RCAESUPSU2    Fixed(32),    /* - word 2             @WLMPSUP*/ 01984000
*    3 RCAESUPSUonCP,                /* Total SUP eligible service      01985000
*                                       units spent on CP    @WLMPSUP*/ 01986000
*      5 RCAESUPSUonCP1 Fixed(32),   /* - word 1             @WLMPSUP*/ 01987000
*      5 RCAESUPSUonCP2 Fixed(32),   /* - word 2             @WLMPSUP*/ 01988000
*    3 RCAETIMEATPDP,                /* Time at promotion dispatch      01989000
*                                       interval in units of 1.024      01990000
*                                       milliseconds          @LBLOCK*/ 01991000
*      5 RCAETIMEATPDP1 Fixed(32),   /* - word 1              @LBLOCK*/ 01992000
*      5 RCAETIMEATPDP2 Fixed(32),   /* - word 2              @LBLOCK*/ 01993000
*    3 RCAECrmCpuTimeConsumed,       /* CPU time consumed while         01994000
*                                       dispatching priority was        01995000
*                                       temporarily raised by chronic   01996000
*                                       resource contention management  01997000
*                                       because the work held a         01998000
*                                       resource that other work        01999000
*                                       needed (in 1.024 milliseconds   02000000
*                                       units)               @LENQP3I*/ 02001000
*      5 RCAECrmCpuTimeConsumed1 FIXED(32), /* - word 1      @LENQP3I*/ 02002000
*      5 RCAECrmCpuTimeConsumed2 FIXED(32), /* - word 2      @LENQP3I*/ 02003000
*    3 RCAEHdLockPromotionTimeAtPDP, /* CPU time consumed while         02004000
*                                       dispatching priority was        02005000
*                                       temporarily raised to shorten   02006000
*                                       the lock hold time of a system  02007000
*                                       suspend lock (in 1.024          02008000
*                                       milliseconds units). Promotion  02009000
*                                       only in HD=YES mode  @ME15316*/ 02010000
*                                                                       02011000
*      5 RCAEHdLockPromotionTimeAtPDP1 Fixed(32), /*  word 1 @ME15316*/ 02012000
*      5 RCAEHdLockPromotionTimeAtPDP2 Fixed(32), /*  word 2 @ME15316*/ 02013000
*    3 RCAEVarTimeAtPDP,             /* Time at variable promotion      02014000
*                                       dispatching priority            02015000
*                                       in units of 1.024 milliseconds  02016000
*                                                            @OA47042*/ 02017000
*                                                                       02018000
*      5 RCAEVarTimeAtPDP1 Fixed(32),/* - word 1             @LENHDPA*/ 02019000
*      5 RCAEVarTimeAtPDP2 Fixed(32),/* - word 2             @LENHDPA*/ 02020000
*    3 RCAEIOTT,                     /* Total DASD I/O induced throttle 02021000
*                                       time in 128 microsecond units   02022000
*                                                            @LSLED2A*/ 02023000
*      5 RCAEIOTT1 FIXED(32),        /* - word 1             @LSLED2A*/ 02024000
*      5 RCAEIOTT2 FIXED(32),        /* - word 2             @LSLED2A*/ 02025000
*    3 RCAEIONT,                     /* Total DASD I/O contention time  02026000
*                                       in 128 microsecond units        02027000
*                                                            @LSLED2A*/ 02028000
*      5 RCAEIONT1 FIXED(32),        /* - word 1             @LSLED2A*/ 02029000
*      5 RCAEIONT2 FIXED(32),        /* - word 2             @LSLED2A*/ 02030000
*    3 *  CHAR(8);                   /* Reserved             @LENHDPA*/ 02031000
*                                                                       02032000
* %IF RCAATYPE = 'YES' %THEN %DO;    /*                      @LRESPTA*/ 02033000
* DECLARE                                                               02034000
*  RCAERST RCAAVIA IsA(RCAERespTimeData) BDY(DWORD) BASED; /* LRESPTA*/ 02035000
* DECLARE                                                               02036000
*  1 RCAERespTimeData TYPE,          /* RCAE - response time data       02037000
*                                                            @LRESPTA*/ 02038000
* %END;                              /*                      @LRESPTA*/ 02039000
* %ELSE %DO;                         /*                      @LRESPTA*/ 02040000
* DECLARE                                                               02041000
*  1 RCAERST RCAAVIA BDY(DWORD) BASED,  /* RCAE - response time data */ 02042000
* %END;                              /*                      @LRESPTA*/ 02043000
*    3 RCAERCP  FIXED(32),           /* Count of transaction            02044000
*                                       completions for this period.    02045000
*                                       This field also includes        02046000
*                                       transaction completions         02047000
*                                       reported by subsystem work      02048000
*                                       managers via the IWMRPT         02049000
*                                       service              @PYN0179*/ 02050000
*    3 RCAEARCP FIXED(32),           /* Count of transactions that      02051000
*                                       completed abnormally as         02052000
*                                       reported by subsystem work      02053000
*                                       managers.  This value is not    02054000
*                                       part of RCAERCP and should not  02055000
*                                       be used for response time       02056000
*                                       calculations.                */ 02057000
*    3 RCAENCP  FIXED(32),           /* Count of times an execution     02058000
*                                       phase has completed by the      02059000
*                                       subsystem work managers via     02060000
*                                       the IWMMNTFY service.        */ 02061000
*    3 RCAEANCP FIXED(32),           /* Count of transactions that      02062000
*                                       completed their execution       02063000
*                                       phase abnormally as reported    02064000
*                                       by subsystem work manager.      02065000
*                                       This value is not part of       02066000
*                                       RCANCP and should not be used   02067000
*                                       for execution response time     02068000
*                                       calculations                 */ 02069000
*    3 RCAETET,                      /* Total transaction elapsed time  02070000
*                                       (in 1024 microsecond units)  */ 02071000
*      5 RCAETET1 FIXED(32),         /* - word 1                     */ 02072000
*      5 RCAETET2 FIXED(32),         /* - word 2                     */ 02073000
*    3 RCAEXET,                      /* Total transaction execution     02074000
*                                       time (in 1024 microsecond       02075000
*                                       units)               @PYN0179*/ 02076000
*      5 RCAEXET1 FIXED(32),         /* - word 1                     */ 02077000
*      5 RCAEXET2 FIXED(32),         /* - word 2                     */ 02078000
*    3 RCAESTT,                      /* Reserved - Note *    @PYN0179*/ 02079000
*      5 RCAESTT1 FIXED(32),         /* Reserved - Note *    @PYN0179*/ 02080000
*      5 RCAESTT2 FIXED(32),         /* Reserved - Note *    @PYN0179*/ 02081000
*    3 RCAEETS,                      /* Sum of transaction elapsed      02082000
*                                       times squared (in 1024          02083000
*                                       microsecond units)           */ 02084000
*      5 RCAEETS1 FIXED(32),         /* - word 1                     */ 02085000
*      5 RCAEETS2 FIXED(32),         /* - word 2                     */ 02086000
*    3 RCAEQDT,                      /* Total queue delay time. For     02087000
*                                       batch jobs this is the time     02088000
*                                       jobs spent on the job queue     02089000
*                                       while eligible to run on        02090000
*                                       some system. In other words     02091000
*                                       this is the time jobs spent     02092000
*                                       waiting for an initiator.       02093000
*                                       For TSO users, this time can    02094000
*                                       be a portion of the LOGON       02095000
*                                       process. For APPC this is the   02096000
*                                       time an APPC request spends     02097000
*                                       on an APPC queue (in 1024       02098000
*                                       microsecond units)   @WLMPBAT*/ 02099000
*      5 RCAEQDT1 FIXED(32),         /* - word 1             @WLMPBAT*/ 02100000
*      5 RCAEQDT2 FIXED(32),         /* - word 2             @WLMPBAT*/ 02101000
*    3 RCAEADT,                      /* Total time batch jobs were      02102000
*                                       ineligible to run because       02103000
*                                       a resource the job had          02104000
*                                       affinity to was unavailable.    02105000
*                                       Only applies to batch work.     02106000
*                                       Zero for other work types       02107000
*                                       (in 1024 microsecond units)     02108000
*                                                            @WLMPBAT*/ 02109000
*      5 RCAEADT1 FIXED(32),         /* - word 1             @WLMPBAT*/ 02110000
*      5 RCAEADT2 FIXED(32),         /* - word 2             @WLMPBAT*/ 02111000
*    3 RCAECVT,                      /* Total time batch jobs spent in  02112000
*                                       JCL conversion. Only applies    02113000
*                                       to batch work. Zero for other   02114000
*                                       work types (in 1024 microsecond 02115000
*                                       units)               @WLMPBAT*/ 02116000
*      5 RCAECVT1 FIXED(32),         /* - word 1             @WLMPBAT*/ 02117000
*      5 RCAECVT2 FIXED(32),         /* - word 2             @WLMPBAT*/ 02118000
*    3 RCAEIQT,                      /* Total time batch jobs spent     02119000
*                                       on job queue after JCL          02120000
*                                       conversion while ineligible to  02121000
*                                       run on any system for reasons   02122000
*                                       other than resource affinities. 02123000
*                                       For example, this time can      02124000
*                                       include operator hold of a job, 02125000
*                                       delays due to duplicate job     02126000
*                                       names, delays due to job class  02127000
*                                       limits. Only applies to batch   02128000
*                                       work. Zero for other work types 02129000
*                                       (in 1024 microsecond units)     02130000
*                                                            @WLMPBAT*/ 02131000
*      5 RCAEIQT1 FIXED(32),         /* - word 1             @WLMPBAT*/ 02132000
*      5 RCAEIQT2 FIXED(32),         /* - word 2             @WLMPBAT*/ 02133000
*    3 RCAESpecRpt(4),               /* Special reporting data:         02134000
*                                       1 = all transactions,           02135000
*                                       2 = mobile transactions,        02136000
*                                       3 = categoryA transactions,     02137000
*                                       4 = categoryB transactions.     02138000
*                                       In contrast to other data in    02139000
*                                       this answer area, these values  02140000
*                                       are not necessarily cumulative. 02141000
*                                       Due to re-accounting of trans-  02142000
*                                       action processor usage arising  02143000
*                                       from the WLM Execution Delay    02144000
*                                       Monitoring services, values     02145000
*                                       might decrease from one         02146000
*                                       invocation of IWMRCOLL to the   02147000
*                                       other.               @OA47042*/ 02148000
*      5 RCAESpecCP FIXED(64),       /* Transaction service units on    02149000
*                                       standard CP          @OA47042*/ 02150000
*        7 RCAESpecCP1 FIXED(32),    /* - word 1             @OA47042*/ 02151000
*        7 RCAESpecCP2 FIXED(32),    /* - word 2             @OA47042*/ 02152000
*      5 RCAESpecOffload FIXED(64),  /* Transaction service units on    02153000
*                                       offload engines      @OA47042*/ 02154000
*        7 RCAESpecOffload1 FIXED(32), /* - word 1           @OA47042*/ 02155000
*        7 RCAESpecOffload2 FIXED(32), /* - word 2           @OA47042*/ 02156000
*      5 RCAESpecOffloadOnCP FIXED(64), /* Transaction service units    02157000
*                                       on standard CP that were        02158000
*                                       offload eligible     @OA47042*/ 02159000
*        7 RCAESpecOffloadOnCP1 FIXED(32), /* - word 1       @OA47042*/ 02160000
*        7 RCAESpecOffloadOnCP2 FIXED(32), /* - word 2       @OA47042*/ 02161000
*    3 RCAETranTime FIXED(64),       /* Total transaction elapsed       02162000
*                                       time. Same as RCAETET but in    02163000
*                                       microsecond units    @LRESPTA*/ 02164000
*    3 RCAETranTimeSq,               /* Sum of transaction elapsed      02165000
*                                       times squared. Same as RCAEETS  02166000
*                                       but in microsecond units        02167000
*                                                            @LRESPTA*/ 02168000
*      5 RCAETranTimeSq1 FIXED(64),  /* - doubleword 1       @LRESPTA*/ 02169000
*      5 RCAETranTimeSq2 FIXED(64),  /* - doubleword 2       @LRESPTA*/ 02170000
*    3 RCAEExecTime FIXED(64),       /* Total transaction execution     02171000
*                                       time. Same as RCAEXET but in    02172000
*                                       microsecond units    @LRESPTA*/ 02173000
*    3 RCAEQDlyTime FIXED(64),       /* Total queue delay time. Same    02174000
*                                       as RCAEQDT but in microsecond   02175000
*                                       units                @LRESPTA*/ 02176000
*    3 RCAEADlyTime FIXED(64),       /* Total time batch jobs were      02177000
*                                       ineligible to run because a     02178000
*                                       resource the job had affinity   02179000
*                                       to was unavailable. Same as     02180000
*                                       RCAEADT but in microsecond      02181000
*                                       units                @LRESPTA*/ 02182000
*    3 RCAEConvTime FIXED(64),       /* Total time batch jobs spent in  02183000
*                                       JCL conversion. Same as         02184000
*                                       RCAECVT but in microsecond      02185000
*                                       units                @LRESPTA*/ 02186000
*    3 RCAEIQueTime FIXED(64),       /* Total time batch jobs spent on  02187000
*                                       job queue after JCL conversion  02188000
*                                       while ineligible to run on any  02189000
*                                       system for reasons other than   02190000
*                                       resource affinities. Same as    02191000
*                                       RCAEIQT but in microsecond      02192000
*                                       units                @LRESPTA*/ 02193000
*    3 RCAESpecRpt_zCBP,             /* Special reporting data for      02194000
*                                       zCBP. Due to re-accounting of   02195000
*                                       transaction processor usage     02196000
*                                       arising from WLM Execution      02197000
*                                       Delay Monitoring services,      02198000
*                                       values might decrease from      02199000
*                                       one IWMRCOLL invocation to      02200000
*                                       the other            @LHWCONA*/ 02201000
*      5 RCAESpeczCBP FIXED(64),     /* Transaction service units on    02202000
*                                       zCBP processors      @LHWCONA*/ 02203000
*      5 RCAESpeczCBPonCP FIXED(64), /* Transaction service units on    02204000
*                                       standard CP that were zCBP      02205000
*                                       eligible             @LHWCONA*/ 02206000
*    3 RcaeEncTrxData,               /* Transaction data                02207000
*                                       reported by subsystem work      02208000
*                                       managers when deleting an       02209000
*                                       enclave. These fields are not   02210000
*                                       included in any other RCAERST   02211000
*                                       fields               @OA61811*/ 02212000
*      5 RcaeEncTrxNum FIXED(32),    /* Number of single subsystem      02213000
*                                       transactions processed within   02214000
*                                       enclaves             @OA61811*/ 02215000
*      5 RcaeEncTrxCalls FIXED(32),  /* Accumulated number of times     02216000
*                                       transaction data has been       02217000
*                                       reported by subsystem work      02218000
*                                       managers when deleting an       02219000
*                                       enclave              @OA61811*/ 02220000
*      5 RcaeEncTrxExTime FIXED(64), /* Total execution time in micro-  02221000
*                                       second units of subsystem       02222000
*                                       transactions in RcaeEncTrxNum   02223000
*                                                            @OA61811*/ 02224000
*      5 RcaeEncTrxExTimeSq FIXED(64); /* Sum of squared execution      02225000
*                                       times in microsecond units of   02226000
*                                       subsystem transactions in       02227000
*                                       RcaeEncTrxNum        @OA61811*/ 02228000
*                                                                       02229000
* DECLARE                                                               02230000
*   1 RCAEDIST RCAAVIA BASED,        /* RCAE - response time            02231000
*                                       distribution array           */ 02232000
*     3 RCAEDENT FIXED(32);          /* An entry in the RCAE response   02233000
*                                       time distribution array.  Each  02234000
*                                       entry in the array contains     02235000
*                                       the number of transactions that 02236000
*                                       completed in the time period    02237000
*                                       represented by that entry.      02238000
*                                       When used with the response     02239000
*                                       time distribution bucket        02240000
*                                       mapping (RCAABMAP), monitors    02241000
*                                       can construct a distribution    02242000
*                                       of completions verses goals     02243000
*                                       specified.                   */ 02244000
* %IF RCAATYPE = 'YES' %THEN %DO;    /*                      @LRESPTA*/ 02245000
* DECLARE                                                               02246000
*  RCAEDELA RCAAVIA IsA(RCAEDelayData) BDY(DWORD) BASED; /*  @LRESPTA*/ 02247000
* DECLARE                                                               02248000
*  1 RCAEDelayData TYPE,             /* RCAE - general execution        02249000
*                                       delay data           @LRESPTA*/ 02250000
* %END;                              /*                      @LRESPTA*/ 02251000
* %ELSE %DO;                         /*                      @LRESPTA*/ 02252000
* DECLARE                                                               02253000
*   1 RCAEDELA RCAAVIA BDY(DWORD) BASED,  /* RCAE - general execution   02254000
*                                       delay data                   */ 02255000
* %END;                              /*                      @LRESPTA*/ 02256000
*     3 RCAEVELC,                    /* Execution velocity data      */ 02257000
*       5 RCAECUSE FIXED(32),        /* CPU using samples            */ 02258000
*       5 RCAETOTD FIXED(32),        /* Total delay samples used in     02259000
*                                       SRM's execution velocity        02260000
*                                       calculation                  */ 02261000
*     3 RCAEEDLA,                    /* General execution delays        02262000
*                                       included in RCAETOTD.  Each     02263000
*                                       dispatchable unit of work       02264000
*                                       sampled can increase one of the 02265000
*                                       CPU or paging delay samples  */ 02266000
*       5 RCAECDEL FIXED(32),        /* CPU delay. A TCB or SRB is      02267000
*                                       waiting to be dispatched (other 02268000
*                                       than the first in-line behind   02269000
*                                       sampler) or a TCB is waiting    02270000
*                                       for local lock.              */ 02271000
*       5 RCAECCAP FIXED(32),        /* CPU capping delay. A TCB or     02272000
*                                       SRB is marked non-dispatchable  02273000
*                                       because a resource group        02274000
*                                       maximum is being enforced.      02275000
*                                       Note that RCAECCAP is NOT a     02276000
*                                       subset of RCAECDEL   @PYN0179*/ 02277000
*       5 RCAESWIN FIXED(32),        /* Swap-in delay. Swap-in has      02278000
*                                       started, but not completed   */ 02279000
*       5 RCAEDMPL FIXED(32),        /* MPL delay. Ready, but swap-in   02280000
*                                       has not started              */ 02281000
*       5 RCAEAPRV FIXED(32),        /* Aux page from private        */ 02282000
*       5 RCAEACOM FIXED(32),        /* Aux page from common         */ 02283000
*       5 RCAEXM   FIXED(32),        /* Aux page from cross memory   */ 02284000
*       5 RCAEVIO  FIXED(32),        /* Aux page from vio            */ 02285000
*       5 RCAEHSPC FIXED(32),        /* Aux page from standard          02286000
*                                       hiperspaces                  */ 02287000
*       5 RCAECHS  FIXED(32),        /* Aux page from eso hiperspaces   02288000
*                                                            @PYN0179*/ 02289000
*       5 RCAEASPD FIXED(32),        /* Shared paging from aux          02290000
*                                       delay                    @L1A*/ 02291000
*       5 RCAEDRS1 CHAR(4),          /* Reserved                     */ 02292000
*     3 RCAEUNKN FIXED(32),          /* Unknown. Dispatchable unit or   02293000
*                                       address space is waiting, but   02294000
*                                       none of the above reasons       02295000
*                                       apply. These samples are not    02296000
*                                       included in RCAETOTD         */ 02297000
*     3 RCAEIDLE FIXED(32),          /* Idle. Work is in STIMER wait,   02298000
*                                       TSO terminal wait, APPC wait,   02299000
*                                       or is an initiator waiting for  02300000
*                                       work. These samples are not     02301000
*                                       included in RCAETOTD         */ 02302000
*     3 RCAEPDEL FIXED(32),          /* Resource group capping delay.   02303000
*                                       Group maximum is being          02304000
*                                       enforced for work in this       02305000
*                                       service class. This delay only  02306000
*                                       accounts for address spaces in  02307000
*                                       the service class that are      02308000
*                                       currently swapped in. These     02309000
*                                       samples are not included in     02310000
*                                       RCAETOTD             @PYN0179*/ 02311000
*     3 RCAEPQUI FIXED(32),          /* Quiesce delay. Some work in     02312000
*                                       this service class has been     02313000
*                                       reset via the RESET xxx,QUIESCE 02314000
*                                       command. These samples are not  02315000
*                                       included in RCAETOTD @PYN0179*/ 02316000
*     3 RCAESAC  FIXED(32),          /* Sampled transaction count.      02317000
*                                       Number of address spaces and    02318000
*                                       enclaves that contributed       02319000
*                                       delay and using samples to this 02320000
*                                       service class. These samples    02321000
*                                       are not included in RCAETOTD    02322000
*                                                            @PYN0179*/ 02323000
*     3 RCAETOTU FIXED(32),          /* Total usings. Velocity should   02324000
*                                       be calculated as                02325000
*                                       RCAETOTU/(RCAETOTD+RCAETOTU)    02326000
*                                                            @WLMPIOP*/ 02327000
*     3 RCAEIOU  FIXED(32),          /* Total I/O usings. These are     02328000
*                                       included in RCAETOTU. Only      02329000
*                                       non-paging DASD I/O can         02330000
*                                       contribute to I/O usings        02331000
*                                                            @WLMPIOP*/ 02332000
*     3 RCAEEDL2,                    /* Second set of execution delays  02333000
*                                       included in RCAETOTD @WLMPIOP*/ 02334000
*       5 RCAEIOD FIXED(32),         /* DASD I/O delay samples          02335000
*                                                            @WLMPIOP*/ 02336000
*       5 RCAEQ   FIXED(32),         /* Queue delay samples. Work is    02337000
*                                       waiting for a server @WLMPASM*/ 02338000
*       5 RCAESPRV FIXED(32),        /* Server private area paging      02339000
*                                       delay samples        @WLMPESM*/ 02340000
*       5 RCAESVIO FIXED(32),        /* Server space VIO paging         02341000
*                                       delay samples        @WLMPESM*/ 02342000
*       5 RCAESHSP FIXED(32),        /* Server hiperspace paging        02343000
*                                       delay samples        @WLMPESM*/ 02344000
*       5 RCAESMPL FIXED(32),        /* Server MPL delay samples        02345000
*                                                            @WLMPESM*/ 02346000
*       5 RCAESSWI FIXED(32),        /* Server swap-in delay samples    02347000
*                                                            @WLMPESM*/ 02348000
*     3 RCAETOTS,                    /* Total execution samples. It is  02349000
*                                       the sum of RCAETOTU, RCAETOTD,  02350000
*                                       RCAEUNKN, RCAEIDLE. Also        02351000
*                                       always includes I/O using/delay 02352000
*                                       samples whether or not I/O      02353000
*                                       samples are included in         02354000
*                                       RCAETOTU/RCAETOTD    @PQC2588*/ 02355000
*       5 RCAETOTS1 FIXED(32),       /* - word 1             @PQC2588*/ 02356000
*       5 RCAETOTS2 FIXED(32),       /* - word 2             @PQC2588*/ 02357000
*     3 RCAENDIO FIXED(32),          /* Non-DASD I/O using or delay     02358000
*                                       samples.             @WLMPIOP*/ 02359000
*     3 RCAETOTDQ FIXED(32),         /* Total delay samples always      02360000
*                                       including batch queue delay.    02361000
*                                       For service classes that        02362000
*                                       contain batch jobs that were    02363000
*                                       not run in WLM managed          02364000
*                                       initiators the batch queue      02365000
*                                       delay samples are derived       02366000
*                                       from the measured batch queue   02367000
*                                       delay time. For service classes 02368000
*                                       that contain only jobs that ran 02369000
*                                       in WLM managed initiators this  02370000
*                                       value is the same as RCEATOTD.  02371000
*                                       RCAETOTDQ can be used as a      02372000
*                                       migration aid to determine      02373000
*                                       what a batch service class      02374000
*                                       period's velocity will be       02375000
*                                       if all its jobs are run in WLM  02376000
*                                       managed initators    @WLMCBAT*/ 02377000
*     3 RCAECryptoCAMU Fixed(32),    /* CAM crypto using samples.       02378000
*                                       No longer used      @WI104168*/ 02379000
*     3 RCAECryptoCAMD Fixed(32),    /* CAM crypto delay samples.       02380000
*                                       No longer used      @WI104168*/ 02381000
*     3 RCAECryptoAPU Fixed(32),     /* AP crypto using samples. A      02382000
*                                       task was found executing on a   02383000
*                                       PCI Cryptographic Coprocessor   02384000
*                                       (PCICC).             @WLMPCRY*/ 02385000
*     3 RCAECryptoAPD Fixed(32),     /* AP crypto delay samples. A      02386000
*                                       task was found waiting for a    02387000
*                                       PCI Cryptographic Coprocessor   02388000
*                                       (PCICC).             @WLMPCRY*/ 02389000
*     3 RCAEFeatureQD Fixed(32),     /* Feature queue delay samples.    02390000
*                                       A task or srb was found waiting 02391000
*                                       on a processor feature queue    02392000
*                                       associated with a CPU. This     02393000
*                                       is a subset of RCAECDEL.        02394000
*                                       Note, RCAECUSE includes         02395000
*                                       feature queue using samples     02396000
*                                                            @WLMPCRY*/ 02397000
*     3 RCAEResourceContentionDelay Fixed(32), /* Contention delay      02398000
*                                       samples. One sample is          02399000
*                                       accumulated for each resource   02400000
*                                       held. Only resource holders     02401000
*                                       identified via IWMCNTN are      02402000
*                                       reported             @WLMPEM2*/ 02403000
*     3 RCAEResourceContentionUsing Fixed(32), /* Contention using      02404000
*                                       samples. One sample is          02405000
*                                       accumulated for each resource   02406000
*                                       in use. Only resource users     02407000
*                                       identified via IWMCNTN are      02408000
*                                       reported             @WLMPEM2*/ 02409000
*     3 RCAEzCBPCU    Fixed(32),     /* zCBP using samples   @LHWCONA*/ 02410000
*       5 RCAEIfaCU   Fixed(32),     /* IFA using samples    @LHWCONC*/ 02411000
*     3 RCAEzCBPCUonCP Fixed(32),    /* zCBP on CP using samples        02412000
*                                                            @LHWCONA*/ 02413000
*       5 RCAEIfaCUonCP Fixed(32),   /* IFA on CP using samples         02414000
*                                                            @LHWCONC*/ 02415000
*     3 RCAEzCBPDl    Fixed(32),     /* zCBP delay samples   @LHWCONA*/ 02416000
*       5 RCAEIfaDl   Fixed(32),     /* IFA delay samples    @LHWCONC*/ 02417000
*     3 RCAESUPCU     Fixed(32),     /* SUP using samples    @WLMPSUP*/ 02418000
*     3 RCAESUPCUonCP Fixed(32),     /* SUP on CP using samples         02419000
*                                                            @WLMPSUP*/ 02420000
*     3 RCAESUPDl     Fixed(32),     /* SUP delay samples    @WLMPSUP*/ 02421000
*     3 RCAEReserved  Char(4),       /* Reserved             @WLMPSUP*/ 02422000
*     3 *             Char(0);       /* End of RCAEDELA      @WLMPIFA*/ 02423000
*                                                                       02424000
* %IF RCAATYPE = 'YES' %THEN %DO;    /*                      @LRESPTA*/ 02425000
* DECLARE                                                               02426000
*  RCAEEELA RCAAVIA IsA(RCAESubsysData) BDY(DWORD) BASED; /* @LRESPTA*/ 02427000
* DECLARE                                                               02428000
*  1 RCAESubsysData TYPE,            /* RCAE - Subsystem work manager   02429000
*                                       delay data           @LRESPTA*/ 02430000
* %END;                              /*                      @LRESPTA*/ 02431000
* %ELSE %DO;                         /*                      @LRESPTA*/ 02432000
* DECLARE                                                               02433000
*   1 RCAEEELA RCAAVIA BDY(DWORD) BASED,  /* RCAE - Subsystem work      02434000
*                                       manager delays               */ 02435000
* %END;                              /*                      @LRESPTA*/ 02436000
*    3 RCAEEENT (2),                 /* An entry in the subsystem work  02437000
*                                       manager delay array          */ 02438000
*      5 RCAESTYP CHAR(4),           /* Subsystem type, as used in the  02439000
*                                       classification rules specified  02440000
*                                       in the WLM administrative       02441000
*                                       application.  The subsystem's   02442000
*                                       documentation should explain    02443000
*                                       the meaning that the product    02444000
*                                       attributes to the various       02445000
*                                       states                       */ 02446000
*      5 RCAEEFLG BIT(8),            /* Flags                        */ 02447000
*        7 RCAEDBE  BIT(1),          /* Represents states sampled in    02448000
*                                       the begin to end phase of a     02449000
*                                       transaction                  */ 02450000
*        7 RCAEEXEC BIT(1),          /* Represents states sampled in    02451000
*                                       the execution phase of a        02452000
*                                       transaction                  */ 02453000
*        7 RCAESRS1 BIT(6),          /* Reserved                     */ 02454000
*      5 RCAESRS2 CHAR(3),           /* Reserved                     */ 02455000
*      5 RCAEESS# FIXED(32),         /* Total number of transaction     02456000
*                                       states sampled in the work      02457000
*                                       phase specified by RCAEEFLG  */ 02458000
*      5 RCAEACTV FIXED(32),         /* Total number of active state    02459000
*                                       samples.  Active indicates that 02460000
*                                       there is a program executing    02461000
*                                       on behalf of the work request,  02462000
*                                       from the perspective of the     02463000
*                                       work manager.  This does not    02464000
*                                       mean that the program is active 02465000
*                                       from the base control program's 02466000
*                                       perspective                  */ 02467000
*      5 RCAERDY  FIXED(32),         /* Total number of ready state     02468000
*                                       samples.  Ready indicates that  02469000
*                                       there is a program ready to     02470000
*                                       execute on behalf of the work   02471000
*                                       request described by the        02472000
*                                       monitoring environment, but the 02473000
*                                       work manager has given priority 02474000
*                                       to another work request      */ 02475000
*      5 RCAEIDL  FIXED(32),         /* Total number of idle state      02476000
*                                       samples.  This indicates the    02477000
*                                       number of times the work        02478000
*                                       manager see a transaction as    02479000
*                                       idle.                        */ 02480000
*      5 RCAEWLOK FIXED(32),         /* Total number of waiting for     02481000
*                                       lock state samples.          */ 02482000
*      5 RCAEWIO  FIXED(32),         /* Total number of waiting for     02483000
*                                       I/O state samples.  Waiting     02484000
*                                       for I/O indicates that the work 02485000
*                                       manager is waiting for an       02486000
*                                       activity related to an I/O      02487000
*                                       request.  This may be an        02488000
*                                       actual I/O operation or some    02489000
*                                       other function associated with  02490000
*                                       the I/O request              */ 02491000
*      5 RCAEWCON FIXED(32),         /* Total number of waiting for     02492000
*                                       conversation state samples.     02493000
*                                       Waiting for conversation may    02494000
*                                       have been used in conjunction   02495000
*                                       with the WLM service IWMMSWCH   02496000
*                                       to identify where the recipient 02497000
*                                       of the conversation is located. 02498000
*                                       In this case, only the switched 02499000
*                                       state will be recorded       */ 02500000
*      5 RCAEWDST FIXED(32),         /* Total number of waiting for     02501000
*                                       distributed request state       02502000
*                                       samples. Waiting for            02503000
*                                       distributed request indicates a 02504000
*                                       high level that some function   02505000
*                                       or data must be routed prior to 02506000
*                                       resumption of the work request. 02507000
*                                       This is to be contrasted with   02508000
*                                       waiting for conversation, which 02509000
*                                       is a low level view of the      02510000
*                                       precise resource that is        02511000
*                                       needed. A distributed request   02512000
*                                       could involve waiting on a      02513000
*                                       conversation as part of its     02514000
*                                       processing                   */ 02515000
*      5 RCAEWSL  FIXED(32),         /* Waiting for a session to be     02516000
*                                       established locally, that is,   02517000
*                                       on the current MVS image     */ 02518000
*      5 RCAEWSN  FIXED(32),         /* Waiting for a session to be     02519000
*                                       established somewhere in the    02520000
*                                       network                      */ 02521000
*      5 RCAEWSS  FIXED(32),         /* Waiting for a session to be     02522000
*                                       established somewhere in the    02523000
*                                       sysplex                      */ 02524000
*      5 RCAEWTMR FIXED(32),         /* Waiting for a timer          */ 02525000
*      5 RCAEWO   FIXED(32),         /* Waiting for another product  */ 02526000
*      5 RCAEWMSC FIXED(32),         /* Waiting for unidentified        02527000
*                                       resource, possibly among        02528000
*                                       another more specific category, 02529000
*                                       but which may not be readily    02530000
*                                       determined                   */ 02531000
*      5 RCAESSL  FIXED(32),         /* State representing transactions 02532000
*                                       for which there are logical     02533000
*                                       continuations on this MVS       02534000
*                                       image. Subsystem work managers  02535000
*                                       might set this state when they  02536000
*                                       function ship a transaction to  02537000
*                                       another component within the    02538000
*                                       same MVS image               */ 02539000
*      5 RCAESSS  FIXED(32),         /* State representing transactions 02540000
*                                       for which there are logical     02541000
*                                       continuations on another MVS    02542000
*                                       image in the sysplex.           02543000
*                                       Subsystem work managers might   02544000
*                                       set this state when they        02545000
*                                       function ship a transaction to  02546000
*                                       another component on another    02547000
*                                       MVS image within the sysplex */ 02548000
*      5 RCAESSN  FIXED(32),         /* State representing transactions 02549000
*                                       for which there are logical     02550000
*                                       continuations somewhere within  02551000
*                                       the network. Subsystem work     02552000
*                                       managers might set this state   02553000
*                                       when they function ship a       02554000
*                                       transaction to another          02555000
*                                       component within the network */ 02556000
*      5 RCAEBPMI FIXED(32),         /* State representing buffer       02557000
*                                       pool misses that resulted       02558000
*                                       in I/O               @WLMPDBM*/ 02559000
*      5 RCAEBPMC FIXED(32),         /* Reserved             @PQC2588*/ 02560000
*      5 RCAEBPCM FIXED(32),         /* Reserved             @PQC2588*/ 02561000
*      5 RCAECFMI FIXED(32),         /* Reserved             @PQC2588*/ 02562000
*      5 RCAEWNL  FIXED(32),         /* Waiting for new latch           02563000
*                                                            @WLMPENH*/ 02564000
*      5 RCAEACTA FIXED(32),         /* Total number of active          02565000
*                                       application state samples       02566000
*                                                            @WLMPAPC*/ 02567000
*      5 RCAEWSSL FIXED(32),         /* Total number of waiting for     02568000
*                                       SSL thread samples   @WLMPAPC*/ 02569000
*      5 RCAEWRET FIXED(32),         /* Total number of waiting for     02570000
*                                       regular thread samples          02571000
*                                                            @WLMPAPC*/ 02572000
*      5 RCAEWREW FIXED(32),         /* Total number of waiting for     02573000
*                                       registration worktable samples  02574000
*                                                            @WLMPAPC*/ 02575000
*      5 RCAETYP1 FIXED(32),         /* Total number of waiting for     02576000
*                                       TYPE 1 samples       @WLMPPBS*/ 02577000
*      5 RCAETYP2 FIXED(32),         /* Total number of waiting for     02578000
*                                       TYPE 2 samples       @WLMPPBS*/ 02579000
*      5 RCAETYP3 FIXED(32),         /* Total number of waiting for     02580000
*                                       TYPE 3 samples       @WLMPPBS*/ 02581000
*      5 RCAETYP4 FIXED(32),         /* Total number of waiting for     02582000
*                                       TYPE 4 samples       @WLMPPBS*/ 02583000
*      5 RCAETYP5 FIXED(32),         /* Total number of waiting for     02584000
*                                       TYPE 5 samples       @WLMPPBS*/ 02585000
*      5 RCAETYP6 FIXED(32),         /* Total number of waiting for     02586000
*                                       TYPE 6 samples       @WLMPPBS*/ 02587000
*      5 RCAETYP7 FIXED(32),         /* Total number of waiting for     02588000
*                                       TYPE 7 samples       @WLMPPBS*/ 02589000
*      5 RCAETYP8 FIXED(32),         /* Total number of waiting for     02590000
*                                       TYPE 8 samples       @WLMPPBS*/ 02591000
*      5 RCAETYP9 FIXED(32),         /* Total number of waiting for     02592000
*                                       TYPE 9 samples       @WLMPPBS*/ 02593000
*      5 RCAETY10 FIXED(32),         /* Total number of waiting for     02594000
*                                       TYPE 10 samples      @WLMPPBS*/ 02595000
*      5 RCAETY11 FIXED(32),         /* Total number of waiting for     02596000
*                                       TYPE 11 samples      @WLMPPBS*/ 02597000
*      5 RCAETY12 FIXED(32),         /* Total number of waiting for     02598000
*                                       TYPE 12 samples      @WLMPPBS*/ 02599000
*      5 RCAETY13 FIXED(32),         /* Total number of waiting for     02600000
*                                       TYPE 13 samples      @WLMPPBS*/ 02601000
*      5 RCAETY14 FIXED(32),         /* Total number of waiting for     02602000
*                                       TYPE 14 samples      @WLMPPBS*/ 02603000
*      5 RCAETY15 FIXED(32);         /* Total number of waiting for     02604000
*                                       TYPE 15 samples      @WLMPPBS*/ 02605000
*                                                                       02606000
* DECLARE                                                               02607000
*  1 RCAAGDD RCAAVIA BDY(WORD) BASED, /* Class definition for all       02608000
*                                       generic delay state             02609000
*                                       descriptions         @LPBDELA*/ 02610000
*    3 RcaaGDDAcro   CHAR(4),        /* Acronym              @LPBDELA*/ 02611000
*    3 RcaaGDDVers   FIXED(8),       /* Version              @LPBDELA*/ 02612000
*    3 RcaaGDDRs1    CHAR(1),        /* Reserved             @LPBDELA*/ 02613000
*    3 RcaaGDDEntryL FIXED(16),      /* Length of one entry. Each       02614000
*                                       single entry (RCAAGDDE)         02615000
*                                       contains the description for    02616000
*                                       one generic delay    @LPBDELA*/ 02617000
*    3 RcaaGDDEntry# FIXED(16),      /* Number of entries (RCAAGDDE)    02618000
*                                                            @LPBDELA*/ 02619000
*    3 RcaaGDDEntryO FIXED(16);      /* Offset of the first RCAAGDDE    02620000
*                                       entry from beginning of RCAAGDD 02621000
*                                                            @LPBDELA*/ 02622000
* DECLARE                                                               02623000
*  1 RCAAGDDE RCAAVIA BDY(HWORD) BASED, /* Class definition for one     02624000
*                                       single generic delay state      02625000
*                                       description. For each           02626000
*                                       combination of subsystem and    02627000
*                                       delay state number there is     02628000
*                                       one entry. The entries for one  02629000
*                                       subsystem are ordered by delay  02630000
*                                       state number RcaaEGDDNum in     02631000
*                                       ascending order      @LPBDELA*/ 02632000
*    3 RcaaEGDDSub   CHAR(4),        /* Subsystem type       @LPBDELA*/ 02633000
*    3 RcaaEGDDNum   FIXED(16),      /* Delay state number   @LPBDELA*/ 02634000
*    3 RcaaEGDDDsc   CHAR(16);       /* Description          @LPBDELA*/ 02635000
*                                                                       02636000
*                                                                       02637000
*DCL RCAANAME CHAR(4)  CONSTANT('RCAA');   /* 'RCAA' ACRONYM         */ 02638000
*/********************************************************************/ 02639000
*/*                                                                  */ 02640000
*/* The RCAAVRID and RCAEVRID must be changed if new fields are      */ 02641000
*/* added to any area in the RCAA ouput area (see APAR OW11082).     */ 02642000
*/* This is to keep vendor products aware of changes to the output   */ 02643000
*/* area.                                                            */ 02644000
*/*                                                          @WLMPMES*/ 02645000
*/********************************************************************/ 02646000
*DCL RCAA_VERSION1 FIXED(8) CONSTANT(1);   /* RCAA version 1.           02647000
*                                       1=HBB5510                    */ 02648000
*DCL RCAA_VERSION2 FIXED(8) CONSTANT(2);   /* RCAA version 2.           02649000
*                                       2=HBB5520            @WA11082*/ 02650000
*DCL RCAA_VERSION3 FIXED(8) CONSTANT(3);   /* RCAA version 3.           02651000
*                                       3=HBB6603            @WLMPIOP*/ 02652000
*DCL RCAA_VERSION4 FIXED(8) CONSTANT(4);   /* RCAA version 4.           02653000
*                                       4=JBB6604            @WLMPBAT*/ 02654000
*DCL RCAA_VERSION9 FIXED(8) CONSTANT(9);   /* RCAA version 9.           02655000
*                                       9=JBB6609            @WLMPMES*/ 02656000
*DCL RCAA_VERSION12 FIXED(8) CONSTANT(12); /* RCAA version 12.          02657000
*                                       12=HBB7705           @WLMPCRY*/ 02658000
*DCL RCAA_VERSION13 FIXED(8) CONSTANT(13); /* RCAA version 13.          02659000
*                                       13=OW51848           @WLMPPBS*/ 02660000
*DCL RCAA_VERSION14 FIXED(8) CONSTANT(14); /* RCAA version 14.          02661000
*                                       14=HBB7707           @WLMPEM2*/ 02662000
*DCL RCAA_Version16 FIXED(8) CONSTANT(16); /* RCAA version 16.          02663000
*                                       16=HBB7709           @WLMPIFA*/ 02664000
*DCL RCAA_Version17 FIXED(8) CONSTANT(17); /* RCAA version 17.          02665000
*                                       17=SUP support       @WLMPSUP*/ 02666000
*DCL RCAA_Version18 FIXED(8) CONSTANT(18); /* RCAA version 18.          02667000
*                                       18=HBB7740            @LBLOCK*/ 02668000
*DCL RCAA_Version19 FIXED(8) CONSTANT(19); /* RCAA version 19.          02669000
*                                       19=HBB7750           @LENQP3I*/ 02670000
*DCL RCAA_Version20 FIXED(8) CONSTANT(20); /* RCAA version 20.          02671000
*                                       20=HBB7760           @ME15316*/ 02672000
*DCL RCAA_Version21 FIXED(8) CONSTANT(21); /* RCAA version 21.          02673000
*                                       21=HBB7770           @ME18255*/ 02674000
*DCL RCAA_Version22 FIXED(8) CONSTANT(22); /* RCAA version 22.          02675000
*                                       22=HBB7780           @LRDISTA*/ 02676000
*DCL RCAA_Version23 FIXED(8) CONSTANT(23); /* RCAA version 23.          02677000
*                                       23=HBB7790           @LSLED2A*/ 02678000
*DCL RCAA_Version24 FIXED(8) CONSTANT(24); /* RCAA version 24.          02679000
*                                       24=HBB77B0           @LRESPTA*/ 02680000
*DCL RCAA_Version25 FIXED(8) CONSTANT(25); /* RCAA version 25.          02681000
*                                       25=HBB77C0           @LHWCONA*/ 02682000
*DCL RCAAVRID FIXED(8) CONSTANT(RCAA_Version25);  /* Current version    02683000
*                                       level                @LHWCONC*/ 02684000
*DCL RCAA_LEVEL1   FIXED(32) CONSTANT(1);  /* RCAA level.               02685000
*                                       1=Crypto Reporting,             02686000
*                                         Multi period report classes,  02687000
*                                         Work manager delays for       02688000
*                                         Enclaves           @WLMPCRY*/ 02689000
*DCL RCAA_LEVEL2   FIXED(32) CONSTANT(2);  /* RCAA level.               02690000
*                                       2=Fields for OA34801, now       02691000
*                                       reserved             @LCRTMEC*/ 02692000
*DCL RCAA_LEVEL3   FIXED(32) CONSTANT(3);  /* RCAA level.               02693000
*                                       3=Fields for OA47042 Special    02694000
*                                       reporting            @OA47042*/ 02695000
*DCL RCAA_LEVEL4   FIXED(32) CONSTANT(4);  /* RCAA level.               02696000
*                                       4=zCBP support       @LHWCONA*/ 02697000
*DCL RCAA_LEVEL5   FIXED(32) CONSTANT(5);  /* RCAA level.               02698000
*                                       5=High Performance Transactions 02699000
*                                         support            @OA61811*/ 02700000
*DCL RCAALEVL FIXED(32) CONSTANT(RCAA_LEVEL5);    /* Current level      02701000
*                                                            @OA61811*/ 02702000
*DCL RCAENAME CHAR(4)  CONSTANT('RCAE');   /* 'RCAE' ACRONYM         */ 02703000
*DCL RCAE_VERSION1 FIXED(8) CONSTANT(1);   /* RCAE version 1.           02704000
*                                       1=HBB5510                    */ 02705000
*DCL RCAE_VERSION2 FIXED(8) CONSTANT(2);   /* RCAE version 2.           02706000
*                                       2=HBB5520            @WA11082*/ 02707000
*DCL RCAE_VERSION3 FIXED(8) CONSTANT(3);   /* RCAE version 3.           02708000
*                                       3=HBB6603            @WLMPIOP*/ 02709000
*DCL RCAE_VERSION4 FIXED(8) CONSTANT(4);   /* RCAE version 4.           02710000
*                                       4=JBB6604            @WLMPBAT*/ 02711000
*DCL RCAE_VERSION9 FIXED(8) CONSTANT(9);   /* RCAE version 9.           02712000
*                                       9=JBB6609            @WLMPMES*/ 02713000
*DCL RCAE_VERSION12 FIXED(8) CONSTANT(12); /* RCAE version 12.          02714000
*                                       12=HBB7705           @WLMPCRY*/ 02715000
*DCL RCAE_VERSION13 FIXED(8) CONSTANT(13); /* RCAE version 13.          02716000
*                                       13=OW51848           @WLMPPBS*/ 02717000
*DCL RCAE_VERSION14 FIXED(8) CONSTANT(14); /* RCAE version 14.          02718000
*                                       14=HBB7707           @WLMPEM2*/ 02719000
*DCL RCAE_VERSION16 FIXED(8) CONSTANT(16); /* RCAE version 16.          02720000
*                                       16=HBB7709           @WLMPIFA*/ 02721000
*DCL RCAE_VERSION17 FIXED(8) CONSTANT(17); /* RCAE version 17.          02722000
*                                       17=SUP support       @WLMPSUP*/ 02723000
*DCL RCAE_VERSION18 FIXED(8) CONSTANT(18); /* RCAE version 18.          02724000
*                                       18=HBB7740            @LBLOCK*/ 02725000
*DCL RCAE_VERSION19 FIXED(8) CONSTANT(19); /* RCAE version 19.          02726000
*                                       19=HBB7750           @LENQP3I*/ 02727000
*DCL RCAE_VERSION20 FIXED(8) CONSTANT(20); /* RCAE version 20.          02728000
*                                       20=HBB7760           @ME15316*/ 02729000
*DCL RCAE_VERSION21 FIXED(8) CONSTANT(21); /* RCAE version 21.          02730000
*                                       21=HBB7770           @ME18255*/ 02731000
*DCL RCAE_VERSION22 FIXED(8) CONSTANT(22); /* RCAE version 22.          02732000
*                                       22=HBB7780           @LRDISTA*/ 02733000
*DCL RCAE_VERSION23 FIXED(8) CONSTANT(23); /* RCAE version 23.          02734000
*                                       23=HBB7790           @LSLED2A*/ 02735000
*DCL RCAE_VERSION24 FIXED(8) CONSTANT(24); /* RCAE version 24.          02736000
*                                       24=HBB77B0           @LRESPTA*/ 02737000
*DCL RCAE_VERSION25 FIXED(8) CONSTANT(25); /* RCAE version 25.          02738000
*                                       25=HBB77C0           @LHWCONA*/ 02739000
*DCL RCAE_VERSION26 FIXED(8) CONSTANT(26); /* RCAE version 26.          02740000
*                                       26=HBB77D0           @LBOOS2A*/ 02741000
*DCL RCAEVRID FIXED(8) CONSTANT(RCAE_VERSION26);  /* Current version    02742000
*                                       level                @LBOOS2C*/ 02743000
*DCL RCAAGDD_ACRO CHAR(4)  CONSTANT('RGDD');      /* 'RGDD' ACRONYM     02744000
*                                                            @LPBDELA*/ 02745000
*DCL RCAAGDD_VERSION1 FIXED(8) CONSTANT(1);       /* RGDD version 1.    02746000
*                                       1=HBB7750            @LPBDELA*/ 02747000
*/* End of PL/X Source                                               */ 02748000
* %IF IWMWRCAA_LIST = 'NO' !                                            02749000
*    ZCBPRINT = 'NO' %THEN                                              02750000
* %DO;                                                                  02751000
*   @LIST POP NOECHO;                                                   02752000
* %END;                                                                 02753000
* %END;                                                                 02754000
