*                                                                       00001000
* %DCL IWMWSYSI_INCLUDED CHAR EXT;                                      00002000
* %DEACTIVATE IWMWSYSI_INCLUDED;                                        00003000
* %IF IWMWSYSI_INCLUDED = '' %THEN                                      00004000
* %DO;                                                                  00005000
*/* Macro made bi-lingual on 19302. CBGEN compile date 19044         */ 00006000
*% /*                                                                   00007000
         MACRO                                                          00008000
         IWMWSYSI &DSECT=YES,&LIST=YES,&TITLE=YES,&SYSI=YES,           *00009000
               &SYSI_ENTRY=COND,&SYSI_EXT=COND,&SYSI_EXT_ENTRY=COND     00010000
         GBLC  &IWMWSYSI_INCLUDED                                       00011000
         GBLC  &ZCBPRINT                                                00012000
&IWMWSYSI_INCLUDED SETC 'YES'                                           00013000
         AIF   ('&LIST' EQ 'NONE').P0                                   00014000
         AIF   ('&TITLE' EQ 'NO').P5                                    00015000
 TITLE   'IWMWSYSI  - WLM System Capacity Information Area          '   00016000
.P5      ANOP                                                           00017000
**/ IWMWSYSI_1:;                                                        00018000
*/* START OF SPECIFICATIONS ******************************************* 00019000
**                                                                      00020000
**  **PROPRIETARY_STATEMENT******************************************** 00021000
****01* PROPRIETARY STATEMENT=                                        * 00022000
**                                                                    * 00023000
**                                                                    * 00024000
**   LICENSED MATERIALS - PROPERTY OF IBM                             * 00025000
**   5650-ZOS     COPYRIGHT IBM CORP. 1994, 2021                      * 00026000
**                                                                    * 00027000
**   STATUS= HBB77D0                                                  * 00028000
**                                                                    * 00029000
**  **END_OF_PROPRIETARY_STATEMENT************************************* 00030000
**                                                                      00031000
**01* DESCRIPTIVE NAME:  WLM System Capacity Information Area           00032000
**02*  ACRONYM:          SYSI                                           00033000
**                                                                      00034000
**01* MACRO NAME:        IWMWSYSI                                       00035000
**                                                                      00036000
**01* EXTERNAL CLASSIFICATION: PSPI                                     00037000
**01* END OF EXTERNAL CLASSIFICATION:                                   00038000
**                                                                      00039000
**01* DSECT NAME:                                                       00040000
**     SYSI                                                             00041000
**     SYSI_ENTRY                                                       00042000
**                                                                      00043000
**01* COMPONENT:  WLM (SCWLM)                                           00044000
**                                                                      00045000
**01* EYE-CATCHER:  SYSI                                                00046000
**02*  OFFSET: 0                                                        00047000
**02*  LENGTH: 4                                                        00048000
**                                                                      00049000
**01* STORAGE ATTRIBUTES:                                               00050000
**02*  SUBPOOL:   User Assigned                                         00051000
**02*  KEY:       Any                                                   00052000
**02*  RESIDENCY: Anywhere                                              00053000
**                                                                      00054000
**01* SIZE:                                                             00055000
**                SYSI_EXT       -- X'001C' bytes                       00056000
**                SYSI_EXT_ENTRY -- X'006C' bytes                       00057000
**                SYSI           -- X'0018' bytes                       00058000
**                SYSI_ENTRY     -- X'0080' bytes                       00059000
**02*             Total SYSI size =                                     00060000
**                  24  bytes SYSI header  +                            00061000
**                  n   (maximum number of systems) *                   00062000
**                  128 (SYSI_System_Entry_Size)                        00063000
**                                                                      00064000
**01* CREATED BY:                                                       00065000
**      Caller of IWMWSYSQ                                              00066000
**                                                                      00067000
**01* POINTED TO BY:                                                    00068000
**      IWMWSYSQ Parameter List                                         00069000
**                                                                      00070000
**01* SERIALIZATION: None                                               00071000
**                                                                      00072000
**01* FUNCTION:                                                         00073000
**02*  Holds system-specific capacity information, returned             00074000
**     by the IWMWSYSQ service.                                         00075000
**                                                                      00076000
**01* METHOD OF ACCESS:                                                 00077000
**02*  ASM:                                                             00078000
**      Specify: IWMWSYSI                                               00079000
**02*  PL/X:                                                            00080000
**      %INCLUDE SYSLIB(IWMWSYSI)                                       00081000
**      Using on SYSI gives addressability to the SYSI header           00082000
**      section.                                                        00083000
**      Subsequent usings must be done to get addressability            00084000
**      to the additional sections (DSECTs) as follows:                 00085000
**      DSECT               USING                                       00086000
**      -----               -----                                       00087000
**      SYSI_ENTRY          A(SYSI_ENTRIES) to access the first system  00088000
**                          entry in the System_Entries section,        00089000
**                          subsequent entries can be found by adding   00090000
**                          the SYSI_SYSTEM_ENTRY_SIZE (in the SYSI     00091000
**                          header section) to the entry at hand.       00092000
**                                                                      00093000
**01* NOTES:  None                                                      00094000
**                                                                      00095000
**01* DELETED BY:                                                       00096000
**      Caller of IWMWSYSQ                                              00097000
**                                                                      00098000
**01* FREQUENCY:  One per call to IWMWSYSQ                              00099000
**                                                                      00100000
**01* DEPENDENCIES:  None                                               00101000
**                                                                      00102000
**01* DISTRIBUTION LIBRARY:  AMACLIB                                    00103000
**                                                                      00104000
**01* CHANGE ACTIVITY:                                                  00105000
**   $MAC(IWMWSYSI),COMP(SCWLM):                                        00106000
**   $L0=ARM      ,HBB5520,940210,PD05V1: ARM Support                   00107000
**   $WLMPENH     ,HBB6603,960520,PDB9RK: WLMENH - Rich Ko              00108000
**                                        Externalize interface         00109000
**   PDE0333      ,HBB7720,040429,3241MB: OA07346 (DOC)                 00110000
**                                        updated SYSI_CPU_UP comment   00111000
**   $LZAAP3      ,HBB7740,060228,3241AK: Anette Kempfert               00112000
**                                        zAAP support stage 3          00113000
**   $ME08403     ,HBB7740,061106,3241BH: Bill Heisser                  00114000
**                                        correcting Prop Stmt          00115000
**   $OA38867     ,HBB7790,120302,3241AK: Anette Kempfert               00116000
**                                        updated some field            00117000
**                                        descriptions (DOC)            00118000
**   $ME24614     ,HBB7790,121127,3241DW: Dieter Wellerdiek             00119000
**                                        Constrained comment changed   00120000
**                                        CBGEN processing fixed        00121000
**   $LRTCAP      ,HBB77B0,160311,3241AK: Anette Kempfert               00122000
**                                        Routing Enhancements for      00123000
**                                        Soft Capping                  00124000
**   $WI164354    ,HBB77B0,170328,3241AK: Anette Kempfert     @OA52608  00125000
**                                        Routing Enhancements for      00126000
**                                        Soft Capping                  00127000
**   $LHWCON      ,HBB77C0,171020,3241AK: Anette Kempfert     @LHWCON   00128000
**                ,HBB77C0,180117,3241KHH: K.-H. Holder                 00129000
**                                        zCBP                          00130000
**   $LBOOST      ,HBB77D0,190718,3241AK: Anette Kempfert               00131000
**                                        System Recovery Boost         00132000
**                                                                      00133000
**                                                                      00134000
** END OF SPECIFICATIONS *********************************************/ 00135000
*% /*                                                                   00136000
.P0      ANOP                                                           00137000
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 00138000
         AIF   ('&LIST' EQ 'YES').P2                                    00139000
.P1      ANOP                                                           00140000
         PUSH  PRINT                                                    00141000
         PRINT OFF                                                      00142000
.P2      ANOP                                                           00143000
         AIF   ('&SYSI' EQ 'NO').L0002                                  00144000
         AIF   ('&DSECT' EQ 'YES').L0003                                00145000
         AIF   ('&SYSI' NE 'YES').L0002                                 00146000
SYSI     DS    0F        System information area                        00147000
         AGO   .L0004                                                   00148000
.L0003   ANOP                                                           00149000
SYSI     DSECT           System information area                        00150000
.L0004   ANOP                                                           00151000
SYSI_HEADER DS CL24      SYSI header section                            00152000
         ORG   SYSI_HEADER                                              00153000
SYSI_ID  DS    CL4       Acronym                                        00154000
SYSI_VERSION DS X        Version                                        00155000
SYSI_FLAGS DS  CL1       flags                                          00156000
*  Bit definitions:                                                     00157000
SYSI_ZCBP EQU  X'80'     When bit is on system fields with zCBP and    *00158000
                         zAAP names contain data about zCBP            *00159000
                         processors.                                    00160000
SYSI_RSV1 DS   CL2       Reserved                                       00161000
SYSI_HEADER_SIZE DS H    Size in bytes of header section                00162000
SYSI_SYSTEM_ENTRY_SIZE DS H Size in bytes of a system information      *00163000
                         entry (SYSI_Entry)                             00164000
SYSI_MAX_ENTRIES DS H    Maximum number of system entries allowed in   *00165000
                         this SYSI area                                 00166000
SYSI_INUSE_ENTRIES DS H  Number of system entries in use (starting     *00167000
                         with 1st entry)                                00168000
SYSI_CALLERSIMPORTANCE DS H 0 = system or sysstc, 1-5 = wlm importance *00169000
                         from policy 6 = discretionary. Field contains *00170000
                         importance of the home AS when IWMWSYSQ was   *00171000
                         invoked. Field is only valid if capacity data *00172000
                         for the local system is returned in the       *00173000
                         array.                                         00174000
SYSI_EXT_OFFSET DS H     offset of extension data                       00175000
SYSI_RSV3 DS   CL4       Reserved                                       00176000
SYSI_ENTRIES DS 0C       Beginning of system entries                    00177000
SYSI_LEN EQU   *-SYSI                                                   00178000
.L0002   ANOP                                                           00179000
         AIF   ('&SYSI_ENTRY' EQ 'NO').L0005                            00180000
         AIF   ('&DSECT' EQ 'YES').L0006                                00181000
         AIF   ('&SYSI_ENTRY' NE 'YES').L0005                           00182000
SYSI_ENTRY DS  0F        System information entry                       00183000
         AGO   .L0007                                                   00184000
.L0006   ANOP                                                           00185000
SYSI_ENTRY DSECT         System information entry                       00186000
.L0007   ANOP                                                           00187000
SYSI_SYSNAME DS CL8      System name                                    00188000
SYSI_ENTRY_STATUS DS CL4 System entry status                            00189000
*  Bit definitions:                                                     00190000
SYSI_CAPACITY_INFO_UNAVAIL EQU X'80' System capacity information is    *00191000
                         unavailable. This bit is set when the         *00192000
                         IWMWSYSQ service is invoked before WLM can    *00193000
                         collect processor management data from the    *00194000
                         associated system. Caller should wait for a   *00195000
                         few minutes before retry                       00196000
SYSI_RESOURCE_CONSTRAINED EQU X'40' System is resource constrained due *00197000
                         to the presence of one or more of the         *00198000
                         following conditions: 1.                      *00199000
                         Below/fixed+DREF/real storage shortage exists *00200000
                         2. SQA storage shortage exists 3. High Common *00201000
                         shortage exists 4. Aux storage shortage       *00202000
                         exists 5. Excessive aux paging condition      *00203000
                         exists 6. Excessive aux swapping condition    *00204000
                         exists 7. An internal policy reactivation is  *00205000
                         in progress due to an abend.                   00206000
SYSI_CAPACITY_INFO DS CL104 System capacity section                     00207000
         ORG   SYSI_CAPACITY_INFO                                       00208000
SYSI_SU_ENTRY DS CL12    Array of 7 entries. The entries are indexed   *00209000
                         beginning with 1 so that the index matches    *00210000
                         the external Importance Level (1 to 5),       *00211000
                         discretionary (index 6), and unused (index 7) *00212000
                         to which the entry pertains. Each entry       *00213000
                         contains number of CPU service units consumed *00214000
                         on general purpose processors by work at the  *00215000
                         indexed Importance Level, and all lower       *00216000
                         Importance Levels (and unused). The last      *00217000
                         entry (index 7) contains unused service units  00218000
         ORG   SYSI_SU_ENTRY                                            00219000
SYSI_SUM60 DS  F         Number of service units consumed by work      *00220000
                         running on general purpose processors at this *00221000
                         Importance Level, and all lower Importance    *00222000
                         Levels (and unused), summed over the last 60  *00223000
                         seconds (1 minute)                             00224000
SYSI_SUM180 DS F         Number of service units consumed by work      *00225000
                         running on general purpose processors at this *00226000
                         Importance Level, and all lower Importance    *00227000
                         Levels (and unused), summed over the last 180 *00228000
                         seconds (3 minutes)                            00229000
SYSI_SUM600 DS F         Number of service units consumed by work      *00230000
                         running on general purpose processors at this *00231000
                         Importance Level, and all lower Importance    *00232000
                         Levels (and unused), summed over the last 600 *00233000
                         seconds (10 minutes)                           00234000
         ORG   SYSI_SU_ENTRY+84                                         00235000
SYSI_FREE_CSA DS F       Free CSA (below the line) in bytes             00236000
SYSI_FREE_ECSA DS F      Free ECSA in bytes                             00237000
SYSI_CPU_UP DS F         The speed of an individual CP on the system,  *00238000
                         in CPU service units per second, adjusted to  *00239000
                         compensate for MP effects. However, this      *00240000
                         value is not adjusted for possible LPAR       *00241000
                         overhead effects. Note: This field may be     *00242000
                         zero if the MVS release is prior to version   *00243000
                         HBB6603                                        00244000
SYSI_ONLINE_CPU_COUNT DS H Total number of online CPUs, including      *00245000
                         zIIPs and zAAPs. Note: This field may be zero *00246000
                         if the MVS release is prior to version        *00247000
                         HBB6603                                        00248000
SYSI_CAPACITY_RSV DS CL6 Reserved                                       00249000
SYSI_TIME_TO_CAP DS H    Estimated remaining time (in seconds) before  *00250000
                         the image will be capped                       00251000
SYSI_TIME_TO_CAP_GROUP DS H Estimated remaining time (in seconds)      *00252000
                         before the group will be capped                00253000
SYSI_BOOSTINFO DS B      same as RMCTZ_BoostInfo                        00254000
SYSI_ENTRY_RSV DS CL7    Reserved                                       00255000
SYSI_ENTRY_LEN EQU *-SYSI_ENTRY                                         00256000
.L0005   ANOP                                                           00257000
         AIF   ('&SYSI_EXT' EQ 'NO').L0008                              00258000
         AIF   ('&DSECT' EQ 'YES').L0009                                00259000
         AIF   ('&SYSI_EXT' NE 'YES').L0008                             00260000
SYSI_EXT DS    0F        SYSI extension                                 00261000
         AGO   .L000A                                                   00262000
.L0009   ANOP                                                           00263000
SYSI_EXT DSECT           SYSI extension                                 00264000
.L000A   ANOP                                                           00265000
SYSI_EXT_HEADER DS CL28  header information                             00266000
         ORG   SYSI_EXT_HEADER                                          00267000
SYSI_EXT_ID DS CL8       Acronym SYSI_EXT                               00268000
SYSI_EXT_VER DS X        Version                                        00269000
SYSI_EXT_RSV1 DS CL3     Reserved                                       00270000
SYSI_EXT_HEADER_SIZE DS H Size in bytes of this header section          00271000
SYSI_EXT_ENTRY_SIZE DS H Size in bytes of an extension entry            00272000
SYSI_EXT_RSV2 DS CL12    Reserved                                       00273000
SYSI_EXT_ENTRIES DS 0C   Beginning of the ext entries                   00274000
SYSI_EXT_LEN EQU *-SYSI_EXT                                             00275000
.L0008   ANOP                                                           00276000
         AIF   ('&SYSI_EXT_ENTRY' EQ 'NO').L000B                        00277000
         AIF   ('&DSECT' EQ 'YES').L000C                                00278000
         AIF   ('&SYSI_EXT_ENTRY' NE 'YES').L000B                       00279000
SYSI_EXT_ENTRY DS 0F     SYSI extension entry                           00280000
         AGO   .L000D                                                   00281000
.L000C   ANOP                                                           00282000
SYSI_EXT_ENTRY DSECT     SYSI extension entry                           00283000
.L000D   ANOP                                                           00284000
SYSI_EXT_FLAGS DS CL1    System entry status                            00285000
SYSI_EXT_RSV3 DS CL3     reserved                                       00286000
SYSI_EXT_PROC_INFO DS CL104 Processor capacity section 4 entries for   *00287000
                         the individual processor types: index 1:      *00288000
                         general purpose processors index 2: zAAPs or  *00289000
                         zCBPs (depending on flag SYSI_zCBP) index 3:  *00290000
                         zIIPs index 4: reserved for future use         00291000
         ORG   SYSI_EXT_PROC_INFO                                       00292000
SYSI_EXT_SU_ENTRY DS CL12 Array of 8 entries. The entries are indexed  *00293000
                         with an origin of 0 so that the index matches *00294000
                         the external Importance Level (1 to 5),       *00295000
                         discretionary (index 6) and unused (index 7)  *00296000
                         to which the entry pertains. Index 0 holds    *00297000
                         the total capacity Each entry contains the    *00298000
                         number of CPU service units consumed by work  *00299000
                         at the indexed Importance Level, and all      *00300000
                         lower Importance Levels (and unused). The     *00301000
                         last entry (index 7) contains unused service   00302000
*                        units                                          00303000
         ORG   SYSI_EXT_SU_ENTRY                                        00304000
SYSI_EXT_SUM60 DS F      Number of service units consumed by work at   *00305000
                         this Importance Level, and all lower          *00306000
                         Importance Levels (and unused), summed over   *00307000
                         the last 60 seconds (1 minute)                 00308000
SYSI_EXT_SUM180 DS F     Number of service units consumed by work at   *00309000
                         this Importance Level, and all lower          *00310000
                         Importance Levels (and unused), summed over   *00311000
                         the last 180 seconds (3 minutes)               00312000
SYSI_EXT_SUM600 DS F     Number of service units consumed by work at   *00313000
                         this Importance Level, and all lower          *00314000
                         Importance Levels (and unused), summed over   *00315000
                         the last 600 seconds (10 minutes)              00316000
         ORG   SYSI_EXT_SU_ENTRY+96                                     00317000
SYSI_EXT_ONLINE_PRO_COUNT DS H Number of online processors of that     *00318000
                         type                                           00319000
SYSI_EXT_PROC_FLAGS DS CL1 Flags                                        00320000
*  Bit definitions:                                                     00321000
SYSI_EXT_PROC_ENTRY_UNAVAIL EQU X'80' Information is unavailable for   *00322000
                         this processor type. This bit is set for zAAP *00323000
                         and zIIP Index when the system is running zOS *00324000
                         R1.8 or older                                  00325000
SYSI_EXT_RSV_FLAGS EQU X'7F' Reserved flags for future use              00326000
SYSI_EXT_PROC_RSV DS CL1 Reserved                                       00327000
SYSI_EXT_PRO_NORMALIZATION DS F Normalization factor for this          *00328000
                         processor type. Multiply procssor time by     *00329000
                         this value and divide by 256 to get the       *00330000
                         equivalent time on a CP. Set to 256 for       *00331000
                         regular CP                                     00332000
SYSI_ID_CONST EQU C'SYSI'                                               00333000
SYSI_VERSION1 EQU 1                                                     00334000
SYSI_VERSION2 EQU 2      OW41245                                        00335000
SYSI_VERSION3 EQU 3      LZAAP3A                                        00336000
SYSI_HEADERLEN EQU 24                                                   00337000
SYSI_SYSTEM_ENTRYLEN EQU 128                                            00338000
SYSI_CURRENT_VER EQU 3                                                  00339000
SYSI_MAX_#SYSTEMS EQU 32 Maximum number of systems allowed              00340000
SYSI_MAX_LEN EQU 17588   Maximum SYSI size for the current release,    *00341000
                         may change from release to release             00342000
SYSI_CPU_INDEX EQU 1                                                    00343000
SYSI_ZAAP_INDEX EQU 2                                                   00344000
SYSI_ZCBP_INDEX EQU 2                                                   00345000
SYSI_ZIIP_INDEX EQU 3    index for SYSI_Processor_Info                  00346000
SYSI_EXT_ID_CONST_0TO3 EQU C'SYSI' This is the first 4-byte segment of *00347000
                         an 8-byte constant.                            00348000
SYSI_EXT_ID_CONST_4TO7 EQU C'_EXT' This is the second 4-byte segment   *00349000
                         of an 8-byte constant.                         00350000
SYSI_EXT_VER1 EQU 1                                                     00351000
SYSI_EXT_CURR_VER EQU 1                                                 00352000
SYSI_EXT_ENTRY_LEN EQU *-SYSI_EXT_ENTRY                                 00353000
.L000B   ANOP                                                           00354000
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 00355000
         AIF   ('&LIST' EQ 'YES').P4                                    00356000
.P3      ANOP                                                           00357000
         POP   PRINT                                                    00358000
.P4      ANOP                                                           00359000
.P_EXIT  ANOP                                                           00360000
         MEND                                                           00361000
**/ IWMWSYSI_2:;                                                        00362000
* %IWMWSYSI_INCLUDED = 'YES';                                           00363000
* %DCL ZCBPRINT CHAR EXT;                                               00364000
* %DEACTIVATE ZCBPRINT;                                                 00365000
* %DCL IWMWSYSI_LIST CHAR EXT;                                          00366000
* %DEACTIVATE IWMWSYSI_LIST;                                            00367000
* %IF IWMWSYSI_LIST = 'NO' !                                            00368000
*    ZCBPRINT = 'NO' %THEN                                              00369000
* %DO;                                                                  00370000
*   @LIST PUSH NOECHO;                                                  00371000
*   @LIST NOASSEMBLE NOECHO;                                            00372000
*   @LIST OFF C NOECHO;                                                 00373000
* %END;                                                                 00374000
*/* Start of PL/X Source                                             */ 00375000
*                                                                       00376000
*   DECLARE                                                             00377000
*     1  SYSI     BASED(*)  BDY(WORD), /* System information area    */ 00378000
*      2   SYSI_Header,             /* SYSI header section   @WLMPENH*/ 00379000
*       3  SYSI_Id  CHAR(4),        /* Acronym                       */ 00380000
*       3  SYSI_Version FIXED(8),   /* Version                       */ 00381000
*       3  SYSI_flags CHAR(1),      /* flags                 @LHWCONA*/ 00382000
*        4  SYSI_zCBP BIT(1),       /* When bit is on system fields     00383000
*                                      with zCBP and zAAP names contain 00384000
*                                      data about zCBP processors.      00385000
*                                                            @LHWCONA*/ 00386000
*       3  SYSI_Rsv1 CHAR(2),       /* Reserved              @LHWCONC*/ 00387000
*       3  SYSI_Header_Size FIXED(16), /* Size in bytes of header       00388000
*                                      section               @WLMPENH*/ 00389000
*       3  SYSI_System_Entry_Size FIXED(16), /* Size in bytes of        00390000
*                                      a system information entry       00391000
*                                      (SYSI_Entry)          @WLMPENH*/ 00392000
*       3  SYSI_Max_Entries FIXED(16), /* Maximum number of system      00393000
*                                      entries allowed in this SYSI     00394000
*                                      area                  @WLMPENH*/ 00395000
*       3  SYSI_InUse_Entries FIXED(16), /* Number of system entries in 00396000
*                                      use (starting with 1st entry)    00397000
*                                                            @WLMPENH*/ 00398000
*       3  SYSI_Callersimportance FIXED(16), /*                         00399000
*                                      0   = system or sysstc,          00400000
*                                      1-5 = wlm importance from policy 00401000
*                                      6   = discretionary.             00402000
*                                      Field contains importance of the 00403000
*                                      home AS when IWMWSYSQ was        00404000
*                                      invoked. Field is only valid if  00405000
*                                      capacity data for the local      00406000
*                                      system is returned in the array. 00407000
*                                                            @OW41245*/ 00408000
*       3  SYSI_EXT_offset FIXED(16),  /* offset of extension data      00409000
*                                                            @LZAAP3A*/ 00410000
*       3  SYSI_Rsv3 CHAR(4),       /* Reserved              @LZAAP3A*/ 00411000
*      2   SYSI_Entries CHAR(0) BDY(WORD); /* Beginning of system       00412000
*                                      entries               @WLMPENH*/ 00413000
*                                                                       00414000
*   DECLARE                                                             00415000
*     1  SYSI_Entry  BASED(*) BDY(WORD), /* System information          00416000
*                                      entry                 @WLMPENH*/ 00417000
*      2   SYSI_Sysname CHAR(8),    /* System name                   */ 00418000
*      2   SYSI_Entry_Status CHAR(4), /* System entry status @WLMPENH*/ 00419000
*        3  SYSI_Capacity_Info_Unavail BIT(1), /* System capacity       00420000
*                                      information is unavailable. This 00421000
*                                      bit is set when the IWMWSYSQ     00422000
*                                      service is invoked before WLM    00423000
*                                      can collect processor management 00424000
*                                      data from the associated system. 00425000
*                                      Caller should wait for a few     00426000
*                                      minutes before retry  @WLMPENH*/ 00427000
*        3  SYSI_Resource_Constrained BIT(1), /* System is resource     00428000
*                                      constrained due to the           00429000
*                                      presence of one or more of the   00430000
*                                      following conditions:            00431000
*                                      1. Below/fixed+DREF/real storage 00432000
*                                         shortage exists               00433000
*                                      2. SQA storage shortage exists   00434000
*                                      3. High Common shortage exists   00435000
*                                      4. Aux storage shortage exists   00436000
*                                      5. Excessive aux paging          00437000
*                                         condition exists              00438000
*                                      6. Excessive aux swapping        00439000
*                                         condition exists              00440000
*                                      7. An internal policy            00441000
*                                         reactivation is in progress   00442000
*                                         due to an abend. @ME24614C*/  00443000
*      2   SYSI_Capacity_Info,      /* System capacity section          00444000
*                                                            @WLMPENH*/ 00445000
*       3  SYSI_SU_Entry(1:7),      /* Array of 7 entries.              00446000
*                                      The entries are indexed          00447000
*                                      beginning with 1 so that         00448000
*                                      the index matches the external   00449000
*                                      Importance Level (1 to 5),       00450000
*                                      discretionary (index 6),         00451000
*                                      and unused (index 7)             00452000
*                                      to which the entry pertains.     00453000
*                                      Each entry contains number of    00454000
*                                      CPU service units consumed on    00455000
*                                      general purpose processors by    00456000
*                                      work at the indexed Importance   00457000
*                                      Level, and all lower Importance  00458000
*                                      Levels (and unused). The last    00459000
*                                      entry (index 7) contains         00460000
*                                      unused service units  @OA38867*/ 00461000
*        5 SYSI_Sum60 FIXED(32),    /* Number of service units          00462000
*                                      consumed by work running on      00463000
*                                      general purpose processors at    00464000
*                                      this Importance Level, and all   00465000
*                                      lower Importance Levels (and     00466000
*                                      unused), summed over the last    00467000
*                                      60 seconds (1 minute) @OA38867*/ 00468000
*        5 SYSI_Sum180 FIXED(32),   /* Number of service units          00469000
*                                      consumed by work running on      00470000
*                                      general purpose processors at    00471000
*                                      this Importance Level, and all   00472000
*                                      lower Importance Levels (and     00473000
*                                      unused), summed over the last    00474000
*                                      180 seconds (3 minutes)          00475000
*                                                            @OA38867*/ 00476000
*        5 SYSI_Sum600 FIXED(32),   /* Number of service units          00477000
*                                      consumed by work running on      00478000
*                                      general purpose processors at    00479000
*                                      this Importance Level, and all   00480000
*                                      lower Importance Levels (and     00481000
*                                      unused), summed over the last    00482000
*                                      600 seconds (10 minutes)         00483000
*                                                            @OA38867*/ 00484000
*       3  SYSI_Free_CSA FIXED(32), /* Free CSA (below the line)        00485000
*                                      in bytes                      */ 00486000
*       3  SYSI_Free_ECSA FIXED(32), /* Free ECSA in bytes           */ 00487000
*       3  SYSI_CPU_UP   FIXED(32), /* The speed of an individual CP    00488000
*                                      on the system, in CPU service    00489000
*                                      units per second, adjusted to    00490000
*                                      compensate for MP effects.       00491000
*                                      However, this value is not       00492000
*                                      adjusted for possible LPAR       00493000
*                                      overhead effects.                00494000
*                                      Note: This field may be zero     00495000
*                                      if the MVS release is prior to   00496000
*                                      version HBB6603       @PDE0333*/ 00497000
*       3  SYSI_Online_CPU_Count FIXED(16), /* Total number of online   00498000
*                                      CPUs, including zIIPs and zAAPs. 00499000
*                                      Note: This field may be zero     00500000
*                                      if the MVS release is prior to   00501000
*                                      version HBB6603       @OA38867*/ 00502000
*       3  SYSI_Capacity_Rsv CHAR(6),  /* Reserved           @WLMPENH*/ 00503000
*                                                                       00504000
*      2 SYSI_Time_To_Cap FIXED(16),   /* Estimated remaining time      00505000
*                                      (in seconds) before the image    00506000
*                                      will be capped       @WI164354*/ 00507000
*      2 SYSI_Time_To_Cap_Group FIXED(16), /* Estimated remaining time  00508000
*                                      (in seconds) before the group    00509000
*                                      will be capped       @WI164354*/ 00510000
*      2 SYSI_BoostInfo Bit(8),        /* same as RMCTZ_BoostInfo       00511000
*                                                            @LBOOSTA*/ 00512000
*      2 SYSI_Entry_Rsv CHAR(7);    /* Reserved              @LBOOSTC*/ 00513000
*                                                                       00514000
*                                                                       00515000
*   DECLARE                                                             00516000
*     1  SYSI_EXT BASED(*) BDY(WORD), /* SYSI                           00517000
*                                      extension             @LZAAP3A*/ 00518000
*      2   SYSI_EXT_Header,         /* header information    @LZAAP3A*/ 00519000
*       3  SYSI_EXT_Id CHAR(8),     /* Acronym SYSI_EXT      @LZAAP3A*/ 00520000
*       3  SYSI_EXT_Ver FIXED(8),   /* Version               @LZAAP3A*/ 00521000
*       3  SYSI_EXT_Rsv1 CHAR(3),   /* Reserved              @LZAAP3A*/ 00522000
*       3  SYSI_EXT_Header_Size FIXED(16), /* Size in bytes of this     00523000
*                                      header section        @LZAAP3A*/ 00524000
*       3  SYSI_EXT_Entry_Size FIXED(16), /* Size in bytes of an        00525000
*                                      extension entry       @LZAAP3A*/ 00526000
*       3  SYSI_EXT_Rsv2 CHAR(12),  /* Reserved              @LZAAP3A*/ 00527000
*      2   SYSI_EXT_Entries CHAR(0) BDY(WORD); /* Beginning of the ext  00528000
*                                      entries               @LZAAP3A*/ 00529000
*                                                                       00530000
*   DECLARE                                                             00531000
*     1  SYSI_EXT_Entry(*) BDY(WORD)                                    00532000
*          BASED(ADDR(SYSI_Ext)+SYSI_Ext_Header_Size),   /*             00533000
*                                        SYSI extension entry           00534000
*                                                            @LZAAP3A*/ 00535000
*      2 SYSI_EXT_Flags    CHAR(1), /* System entry status   @LZAAP3A*/ 00536000
*      2 SYSI_EXT_Rsv3  CHAR(3),    /* reserved              @LZAAP3A*/ 00537000
*      2 SYSI_EXT_Proc_Info(1:4),   /* Processor capacity section       00538000
*                                      4 entries for the individual     00539000
*                                      processor types:                 00540000
*                                      index 1: general purpose         00541000
*                                               processors              00542000
*                                      index 2: zAAPs or zCBPs          00543000
*                                               (depending on flag      00544000
*                                               SYSI_zCBP)              00545000
*                                      index 3: zIIPs                   00546000
*                                      index 4: reserved for future     00547000
*                                               use          @LHWCONC*/ 00548000
*       3  SYSI_EXT_SU_Entry(0:7),  /* Array of 8 entries.              00549000
*                                      The entries are indexed          00550000
*                                      with an origin of 0 so that      00551000
*                                      the index matches the external   00552000
*                                      Importance Level (1 to 5),       00553000
*                                      discretionary (index 6) and      00554000
*                                      unused (index 7) to which        00555000
*                                      the entry pertains.              00556000
*                                      Index 0 holds the total capacity 00557000
*                                      Each entry contains the number   00558000
*                                      of CPU service units consumed by 00559000
*                                      work at the indexed Importance   00560000
*                                      Level, and all lower Importance  00561000
*                                      Levels (and unused). The last    00562000
*                                      entry (index 7) contains         00563000
*                                      unused service units  @LZAAP3A*/ 00564000
*        5 SYSI_EXT_Sum60 FIXED(32), /* Number of service units         00565000
*                                      consumed by work at this         00566000
*                                      Importance Level, and all        00567000
*                                      lower Importance Levels (and     00568000
*                                      unused), summed over the last    00569000
*                                      60 seconds (1 minute) @LZAAP3A*/ 00570000
*        5 SYSI_EXT_Sum180 FIXED(32), /* Number of service units        00571000
*                                      consumed by work at this         00572000
*                                      Importance Level, and all        00573000
*                                      lower Importance Levels (and     00574000
*                                      unused), summed over the last    00575000
*                                      180 seconds (3 minutes)          00576000
*                                                            @LZAAP3A*/ 00577000
*        5 SYSI_EXT_Sum600 FIXED(32), /* Number of service units        00578000
*                                      consumed by work at this         00579000
*                                      Importance Level, and all        00580000
*                                      lower Importance Levels (and     00581000
*                                      unused), summed over the last    00582000
*                                      600 seconds (10 minutes)         00583000
*                                                            @LZAAP3A*/ 00584000
*       3  SYSI_EXT_Online_Pro_Count FIXED(16), /* Number of online     00585000
*                                      processors of that type          00586000
*                                                            @LZAAP3A*/ 00587000
*       3  SYSI_EXT_Proc_Flags CHAR(1),     /* Flags         @LZAAP3A*/ 00588000
*        5  SYSI_EXT_Proc_Entry_Unavail BIT(1), /* Information is       00589000
*                                      unavailable for this processor   00590000
*                                      type. This bit is set for zAAP   00591000
*                                      and zIIP Index when the system   00592000
*                                      is running zOS R1.8 or older     00593000
*                                                            @LZAAP3A*/ 00594000
*        5  SYSI_EXT_RSV_FLAGS BIT(7), /* Reserved flags for future use 00595000
*                                                            @LZAAP3A*/ 00596000
*       3  SYSI_EXT_Proc_Rsv CHAR(1),  /* Reserved           @LZAAP3A*/ 00597000
*       3  SYSI_EXT_Pro_Normalization FIXED(32); /* Normalization       00598000
*                                      factor for this processor type.  00599000
*                                      Multiply procssor time by this   00600000
*                                      value and divide by 256 to get   00601000
*                                      the equivalent time on a CP.     00602000
*                                      Set to 256 for regular CP        00603000
*                                                            @LZAAP3A*/ 00604000
*                                                                       00605000
*                                                                       00606000
*%IF Iwmwsysi_NoLIKE ^= 'YES' %THEN                                     00607000
*%DO;                                                                   00608000
*   DCL 1 SYSI_Array(1:*) Defined(SYSI_Entries) Bdy(Word)               00609000
*         Like(SYSI_Entry);                               /* @WLMPENH*/ 00610000
*%END;                                                                  00611000
*                                                                       00612000
*   DECLARE                                                             00613000
*     SYSI_ID_CONST CHAR(4) CONSTANT('SYSI'),                           00614000
*     SYSI_VERSION1 FIXED(8) CONSTANT(1),                               00615000
*     SYSI_VERSION2 FIXED(8) CONSTANT(2),  /*OW41245*/                  00616000
*     SYSI_VERSION3 FIXED(8) CONSTANT(3),  /*LZAAP3A*/                  00617000
*     SYSI_HeaderLen FIXED(16) Constant(LENGTH(SYSI_Header)), /*        00618000
*                                                            @WLMPENH*/ 00619000
*     SYSI_System_EntryLen FIXED(16) Constant(LENGTH(SYSI_Entry)); /*   00620000
*                                                            @WLMPENH*/ 00621000
*                                                                       00622000
*   DECLARE                                                             00623000
*     SYSI_Current_Ver FIXED(8) CONSTANT(SYSI_VERSION3);   /*@LZAAP3C*/ 00624000
*                                                                       00625000
*   DECLARE                                                             00626000
*     SYSI_Max_#systems FIXED(16) CONSTANT(32); /* Maximum number of    00627000
*                                      systems allowed       @WLMPENH*/ 00628000
*   DECLARE                                                             00629000
*     SYSI_Max_Len FIXED(32) CONSTANT(SYSI_HeaderLen +                  00630000
*                                     length(SYSI_EXT_Header) +         00631000
*                                     (SYSI_System_EntryLen +           00632000
*                                      length(SYSI_EXT_Entry)) *        00633000
*                                     SYSI_Max_#systems); /* Maximum    00634000
*                                      SYSI size for the current        00635000
*                                      release, may change from release 00636000
*                                      to release            @LZAAP3C*/ 00637000
*   DECLARE                                                             00638000
*     SYSI_CPU_INDEX  FIXED(8) CONSTANT(1),                             00639000
*     SYSI_ZAAP_INDEX FIXED(8) CONSTANT(2),                             00640000
*     SYSI_ZCBP_INDEX FIXED(8) CONSTANT(2),                ] @LHWCONA   00641000
*     SYSI_ZIIP_INDEX FIXED(8) CONSTANT(3); /* index for                00642000
*                                      SYSI_Processor_Info   @LZAAP3A*/ 00643000
*                                                                       00644000
*   DECLARE                                                             00645000
*     SYSI_EXT_ID_CONST CHAR(8) CONSTANT('SYSI_EXT'),      /*@LZAAP3A*/ 00646000
*     SYSI_EXT_VER1 FIXED(8) CONSTANT(1),                  /*@LZAAP3A*/ 00647000
*     SYSI_EXT_curr_Ver FIXED(8) CONSTANT(SYSI_EXT_VER1);  /*@LZAAP3A*/ 00648000
*                                                                       00649000
*                                                                       00650000
*@LOGIC;                                                                00651000
*#PRAGMA TOOL=CBGEN.                                                    00652000
*#LINE.%Iwmwsysi_NoLIKE = 'YES';                                        00653000
*#LINE.%INCLUDE SYSLIB(IWMWSYSI);                                       00654000
*#USEORG.                                                               00655000
*#EPRAGMA.                                                              00656000
*@ENDLOGIC;                                                             00657000
*/* End of PL/X Source                                               */ 00658000
* %IF IWMWSYSI_LIST = 'NO' !                                            00659000
*    ZCBPRINT = 'NO' %THEN                                              00660000
* %DO;                                                                  00661000
*   @LIST POP NOECHO;                                                   00662000
* %END;                                                                 00663000
* %END;                                                                 00664000
