*                                                                       00001000
* %DCL IXCYMQAA_INCLUDED CHAR EXT;                                      00002000
* %DEACTIVATE IXCYMQAA_INCLUDED;                                        00003000
* %IF IXCYMQAA_INCLUDED = '' %THEN                                      00004000
* %DO;                                                                  00005000
*/* Macro made bi-lingual on 18014. CBGEN compile date 15295         */ 00006000
*% /*                                                                   00007000
         MACRO                                                          00008000
         IXCYMQAA &DSECT=YES,&LIST=YES,&TITLE=YES,&MQAHDR=YES,         *00009000
               &MQAENTRY=COND,&MQATARGONLYENTRY=COND,                  *00010000
               &MQATARGRESPENTRY=COND,&MQATARGRESPENTRY1=COND           00011000
         GBLC  &IXCYMQAA_INCLUDED                                       00012000
         GBLC  &ZCBPRINT                                                00013000
&IXCYMQAA_INCLUDED SETC 'YES'                                           00014000
         AIF   ('&LIST' EQ 'NONE').P0                                   00015000
         AIF   ('&TITLE' EQ 'NO').P5                                    00016000
 TITLE   'IXCYMQAA  - Message Control Query Answer Area               '*00017000
                                                                        00018000
.P5      ANOP                                                           00019000
**/ IXCYMQAA_1:;                                                        00020000
*/* START OF SPECIFICATIONS ******************************************* 00021000
*                                                                       00022000
*01* PROPRIETARY STATEMENT =                                            00023000
*                                                                       00024000
*    Licensed Materials - Property of IBM                               00025000
*    5694-A01                                                           00026000
*    COPYRIGHT IBM CORP. 1996, 2011                                     00027000
*                                                                       00028000
*    US Government Users Restricted Rights - Use, duplication or        00029000
*    disclosure restricted by GSA ADP Schedule Contract with            00030000
*    IBM Corp.                                                          00031000
*                                                                       00032000
*01* STATUS = HBB7780                                                   00033000
*                                                                       00034000
*01* END OF PROPRIETARY STATEMENT                                       00035000
*01* EXTERNAL CLASSIFICATION: GUPI                                      00036000
*01* END OF EXTERNAL CLASSIFICATION:                                    00037000
*                                                                       00038000
*01* DESCRIPTIVE NAME: Message Control Query Answer Area                00039000
*02*  ACRONYM:  MQAA                                                    00040000
*                                                                       00041000
*01* MACRO NAME: IXCYMQAA                                               00042000
*                                                                       00043000
*01* DSECT NAME:                                                        00044000
*     MqaHdr                                                            00045000
*     MqaEntry                                                          00046000
*     MqaTargOnlyEntry                                                  00047000
*     MqaTargRespEntry                                                  00048000
*                                                                       00049000
*01* COMPONENT:  Cross System Coupling Facility (SCXCF)                 00050000
*                                                                       00051000
*01* EYE-CATCHER:  NONE                                                 00052000
*02*  OFFSET:  N/A                                                      00053000
*02*  LENGTH:  N/A                                                      00054000
*                                                                       00055000
*01* STORAGE ATTRIBUTES:                                                00056000
*02*  SUBPOOL: User-supplied                                            00057000
*02*  KEY: User-supplied                                                00058000
*02*  RESIDENCY: User-supplied                                          00059000
*                                                                       00060000
*01* SIZE: Variable                                                     00061000
*            MQATARGRESPENTRY1 -- X'0058' bytes                         00062000
*            MQAHDR            -- X'0010' bytes                         00063000
*            MQAENTRY          -- X'0010' bytes                         00064000
*            MQATARGONLYENTRY  -- X'0010' bytes                         00065000
*            MQATARGRESPENTRY  -- X'0014' bytes                         00066000
*                                                                       00067000
*                                                                       00068000
*01* CREATED BY: IXCS1MSC                                               00069000
*                                                                       00070000
*01* POINTED TO BY: ANSAREA_ADDR field in IXCMSGC parameter list        00071000
*                                                                       00072000
*01* SERIALIZATION:                                                     00073000
*     None required                                                     00074000
*                                                                       00075000
*01* FUNCTION:                                                          00076000
*02*  Maps information returned by the XCF Message-Control Service      00077000
*     (IXCMSGC) for REQUEST(QUERYMSG).                                  00078000
*                                                                       00079000
*                                                                       00080000
*01* METHOD OF ACCESS:                                                  00081000
*                                                                       00082000
*02*  ASM:        IXCYMQAA                                              00083000
*         DSECT=YES!NO  -- Request DSECT definition                     00084000
*         MqaHdr=YES!NO!COND -- Request Header record mapping           00085000
*                                    USING on MQAHDR                    00086000
*         MqaEntry =YES!NO!COND -- Request record mapping               00087000
*                                    USING on MQAEntry                  00088000
*         MqaTargOnlyEntry =YES!NO!COND -- Request record mapping       00089000
*                                    USING on MqaTargOnlyEntry          00090000
*         MqaTargRespEntry =YES!NO!COND -- Request record mapping       00091000
*                                    USING on MqaTargRespEntry          00092000
*                                                                       00093000
*     Default:                                                          00094000
*         DSECT=YES,MQAHDR=YES,MQAENTRY=COND,                           00095000
*                MQATARGONLYENTRY=COND,MQATARGRESPENTRY=COND            00096000
*                                                                       00097000
*02*  PL/AS: %INCLUDE SYSLIB(IXCYMQAA)                                  00098000
*                                                                       00099000
*01* DELETED BY: User                                                   00100000
*                                                                       00101000
*01* FREQUENCY: Created for response to IXCMSGC request QUERY           00102000
*                                                                       00103000
*01* DEPENDENCIES: None.                                                00104000
*                                                                       00105000
*01* NOTES:                                                             00106000
*                                                                       00107000
*      - To ensure compatibility with additional data provided in the   00108000
*        future, never hardcode the length of any of the records        00109000
*        defined by this mapping when iterating through the tables      00110000
*        and arrays that are returned by the IXCMSGC query service.     00111000
*        All such offsets and lengths are subject to change in the      00112000
*        future, and will be reflected in the data that is returned.    00113000
*        Always use the lengths and offsets that are returned in        00114000
*        records.                                                       00115000
*                                                                       00116000
*                                                                       00117000
*01* DISTRIBUTION LIBRARY:  AMACLIB                                     00118000
*                                                                       00119000
*01* CHANGE ACTIVITY:                                                   00120000
*   $L0= XCFBC   HBB6603 950417 PD00DT: XCFBC Initial Release           00121000
*   $P1= PQC1514 HBB6603 960630 PD00CJ: Make MqaModMsgCntl and          00122000
*                                       MqaMidCntl consistent           00123000
*   $D1= DCR0028 HBB6603 960815 PD00CJ: Remove USAGE support            00124000
*   $P2= PQC2136 HBB6603 950906 PD00CJ: Added DiscardPending flags      00125000
*   $L1=LSD      HBB6608 980901 PD00BJ: Add async_msgaccess             00126000
*   $L2=XCFSRVR  HBB7780 100604 PD0JES: Level 1 support                 00127000
*   $L3=XCFSRVR  HBB7780 100604 PD0JES: XCF Client/Server               00128000
*   $P3=ME20745  HBB7780 110114 PD00C9: Fix copyright                   00129000
*                                                                       00130000
* END OF SPECIFICATIONS *********************************************/  00131000
*% /*                                                                   00132000
.P0      ANOP                                                           00133000
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 00134000
         AIF   ('&LIST' EQ 'YES').P2                                    00135000
.P1      ANOP                                                           00136000
         PUSH  PRINT                                                    00137000
         PRINT OFF                                                      00138000
.P2      ANOP                                                           00139000
         AIF   ('&MQAHDR' EQ 'NO').L0002                                00140000
         AIF   ('&DSECT' EQ 'YES').L0003                                00141000
         AIF   ('&MQAHDR' NE 'YES').L0002                               00142000
.L0003   ANOP                                                           00143000
*                                                                       00144000
* ********************************************************************  00145000
* *                                                                  *  00146000
* *                            Header                                *  00147000
* *                                                                  *  00148000
* ********************************************************************  00149000
*                                                                       00150000
*                                                                       00151000
         AIF   ('&DSECT' EQ 'YES').L0004                                00152000
MQAHDR   DS    0F        Header record returned on all queries.         00153000
         AGO   .L0005                                                   00154000
.L0004   ANOP                                                           00155000
MQAHDR   DSECT           Header record returned on all queries.         00156000
.L0005   ANOP                                                           00157000
MQAHDRLEN DS   F         Length in bytes of MqaHeader                   00158000
MQAHDRTLEN DS  F         Total length in bytes of data area needed to  *00159000
                         contain all the requested information This    *00160000
                         length includes the header as well as the     *00161000
                         entries that WERE returned on this call.       00162000
MQAHDR#ENTRIES DS F      Number of complete entries of all kinds that  *00163000
                         were returned on this call (does not include  *00164000
                         the header).                                   00165000
MQAHDRENTOFFSET DS F     Offset from MqaHeader at which first entry is *00166000
                         located.                                       00167000
MQAHDR_LEN EQU *-MQAHDR                                                 00168000
.L0002   ANOP                                                           00169000
         AIF   ('&MQAENTRY' EQ 'NO').L0006                              00170000
         AIF   ('&DSECT' EQ 'YES').L0007                                00171000
         AIF   ('&MQAENTRY' NE 'YES').L0006                             00172000
.L0007   ANOP                                                           00173000
*                                                                       00174000
* ********************************************************************  00175000
* *                                                                  *  00176000
* *                        Entries                                   *  00177000
* *                                                                  *  00178000
* *                                                                  *  00179000
* *  First entry is located as follows:                              *  00180000
* *     Entryptr = addr(MqaHeader) + MqaHdrEntOffset                 *  00181000
* *                                                                  *  00182000
* *  Subsequent entry is located as follows:                         *  00183000
* *     Entryptr = Entryptr + Entryptr-> MqaEntLen                   *  00184000
* *                                                                  *  00185000
* *                                                                  *  00186000
* * DO NOT HARD CODE THE LENGTH OF THE RECORDS.  USE THE LENGTH AND  *  00187000
* * OFFSETS PROVIDED IN EACH RECORD (to ensure compatibility with    *  00188000
* * additional data provided in the future).                         *  00189000
* *                                                                  *  00190000
* ********************************************************************  00191000
*                                                                       00192000
*                                                                       00193000
         AIF   ('&DSECT' EQ 'YES').L0008                                00194000
MQAENTRY DS    0F        Data record                                    00195000
         AGO   .L0009                                                   00196000
.L0008   ANOP                                                           00197000
MQAENTRY DSECT           Data record                                    00198000
.L0009   ANOP                                                           00199000
MQAENTTYPE DS  X         Type of data described in this entry.          00200000
         DS    CL3       Reserved                                       00201000
MQAENTLEN DS   F         Number of bytes in this entry. Use this value *00202000
                         when iterating through records. DO NOT hard   *00203000
                         code length of the records.                    00204000
         DS    CL8       Reserved                                       00205000
MQAENTDATA DS  0C        Variable content of the record. Use           *00206000
                         MqaEntType to determine which of the mappings *00207000
                         below is applicable.                           00208000
*                                                                       00209000
*    *****************************************************************  00210000
*    *                                                               *  00211000
*    * MQAA Entry Types                                              *  00212000
*    *                                                               *  00213000
*    *****************************************************************  00214000
*                                                                       00215000
*                                                                       00216000
MQAKTYPEMOS EQU X'01'    Message-out Summary                            00217000
MQAKTYPEMIS EQU X'02'    Message-in Summary                             00218000
MQAKTYPEMOD EQU X'03'    Message-out Detail                             00219000
MQAKTYPEMID EQU X'04'    Message-in Detail                              00220000
*                                                                       00221000
*    *****************************************************************  00222000
*    *                                                               *  00223000
*    * MQAALEVELs supported by the system. NOTE: Each DATATYPE may   *  00224000
*    * support different MQAALEVEL. Check the MQAKMaxLevel constants *  00225000
*    * for the MQAALEVEL supported by a specific DATATYPE. ***********  00226000
*      *************************************************                00227000
*                                                                       00228000
*    *****************************************************************  00229000
*                                                                       00230000
*                                                                       00231000
MQAKLEVEL001 EQU 1       MQAALEVEL 1                                    00232000
MQAKLEVELMAX EQU 1       MQAALEVEL max supported, subject to change as *00233000
                         new levels are supported                       00234000
*                                                                       00235000
*    *****************************************************************  00236000
*    *                                                               *  00237000
*    * Constants defining highest MQAALEVEL supported by the         *  00238000
*    * indicated DATATYPE. *******************************************  00239000
*      *****************                                                00240000
*                                                                       00241000
*    *****************************************************************  00242000
*                                                                       00243000
*                                                                       00244000
MQAKMAXLEVEL_MSGOUT EQU 1 DATATYPE=MSGOUT                               00245000
MQAKMAXLEVEL_MSGIN EQU 1 DATATYPE=MSGIN                                 00246000
MQAKMAXLEVEL_DETAIL EQU 1 DATATYPE=DETAIL                               00247000
MQAENTRY_LEN EQU *-MQAENTRY                                             00248000
*                                                                       00249000
*    *****************************************************************  00250000
*    *                                                               *  00251000
*    * Message Out Summary                                           *  00252000
*    *                                                               *  00253000
*    *****************************************************************  00254000
*                                                                       00255000
*                                                                       00256000
         ORG   MQAENTDATA                                               00257000
MQAMSGOUTSUMMARY DS 0X                                                  00258000
MQAMOSTOKEN DS CL16      Token used to identify this message to the    *00259000
                         message-control service (IXCMSGC).             00260000
MQAMOSUSERDATA DS BL8    User data associated with the message.        *00261000
                         Contains a copy of the data specified for the *00262000
                         USERDATA keyword when the message-out service *00263000
                         (IXCMSGO) was invoked to send the message or  *00264000
                         as modified by the message control service    *00265000
                         (IXCMSGC) when message was saved or           *00266000
                         completed.                                     00267000
MQAMOSFLAGS DS 0BL4                                                     00268000
MQAMOSFLAGS0 DS 0B                                                      00269000
MQAMOSBROADCAST EQU X'80' Indicates that the sender specified          *00270000
                         SENDTO(GROUP) on the IXCMSGO invocation.       00271000
MQAMOSGETRESPONSE EQU X'40' Indicates whether the sender of this       *00272000
                         message requested XCF management of           *00273000
                         responses.                                     00274000
MQAMOSISARESPONSE EQU X'20' Indicates whether this message is a        *00275000
                         response being managed by XCF.                 00276000
MQAMOSSENDPENDING EQU X'10' Desired send(s) not initiated by the       *00277000
                         message-out service.                           00278000
MQAMOSRESPPENDING EQU X'08' Expected response(s) not received.          00279000
MQAMOSCOMPLETED EQU X'04' Indicates whether message considered to be   *00280000
                         complete. Note that this flag is not mutually *00281000
                         exclusive with the Send/RespPending flags     *00282000
                         since completion may have been forced or the  *00283000
                         message may have timed out.                    00284000
MQAMOSTIMEDOUT EQU X'02' '1'B if the message did not complete within   *00285000
                         the time-out period.                           00286000
MQAMOSCANCELLED EQU X'01' '1'B if the message did not complete before  *00287000
                         the message-out request was cancelled.         00288000
         ORG   MQAMOSFLAGS0+1                                           00289000
MQAMOSFLAGS1 DS 0B                                                      00290000
MQAMOSNOTIFYBYEXIT EQU X'80' Sender requested notification by Exit     *00291000
                         when complete.                                 00292000
MQAMOSDISCARDPENDING EQU X'40' Indicates that the message was marked   *00293000
                         for discard but the discard has not yet       *00294000
                         completed.                                     00295000
MQAMOSSUCCESSFUL EQU X'20' Indicates whether the request completed     *00296000
                         successfully where no sends were rejected and *00297000
                         all responses were received for broadcast get *00298000
                         response requests or no sends were rejected   *00299000
                         for broadcast noresponse requests              00300000
MQAMOSSAVED EQU X'10'    Message was saved.                             00301000
MQAMOSASYNCMSGACCESS EQU X'08' Indicates whether XCF accessed user     *00302000
                         storage describing/containing the message     *00303000
                         from a unit of work asynchronous to the       *00304000
                         IXCMSGO/IXCMSGOX service routines.             00305000
         ORG   MQAMOSFLAGS1+1                                           00306000
MQAMOSFLAGS2 DS B                                                       00307000
MQAMOSFLAGS3 DS B                                                       00308000
MQAMSGOUTSUMMARY_LEN EQU *-MQAMSGOUTSUMMARY                             00309000
         ORG   MQAENTDATA                                               00310000
MQAMSGOUTSUMMARY1 DS 0X                                                 00311000
         DS    CL28      Mapped by MqaMsgOutSummary                     00312000
MQAMOS1_MSGTAG DS CL64   User defined message tag associated with the  *00313000
                         message. Contains a copy of the data          *00314000
                         specified for the MSGTAG keyword when the     *00315000
                         message control service (IXCMSGC) was invoked *00316000
                         to save the message. Valid when MQAALEVEL >   *00317000
                         0.                                             00318000
MQAMOS1_TRACETHREAD DS F XCF trace thread associated with message       00319000
         DS    CL28      reserved                                       00320000
MQAMSGOUTSUMMARY1_LEN EQU *-MQAMSGOUTSUMMARY1                           00321000
         ORG   ,                                                        00322000
*                                                                       00323000
*    *****************************************************************  00324000
*    *                                                               *  00325000
*    * Message In Summary                                            *  00326000
*    *                                                               *  00327000
*    *****************************************************************  00328000
*                                                                       00329000
*                                                                       00330000
         ORG   MQAENTDATA                                               00331000
MQAMSGINSUMMARY DS 0X                                                   00332000
MQAMISTOKEN DS CL16      Token used to identify this message to the    *00333000
                         message-control service (IXCMSGC).             00334000
MQAMISUSERDATA DS CL8    User data associated with the message. This   *00335000
                         is the data specified for the USERDATA        *00336000
                         keyword when the IXCMSGC service was invoked  *00337000
                         to save the message.                           00338000
MQAMISSOURCE DS CL8      Member token of the member that sent this     *00339000
                         message.                                       00340000
         DS    X         Reserved.                                      00341000
MQAMISFLAGS DS 0BL3      Flags describing characteristics of the       *00342000
                         message or its delivery.                       00343000
MQAMISDISCARDPENDING EQU X'80' Indicates that the Msg was saved by the *00344000
                         IXCMSGC service and was later discarded but   *00345000
                         the discard has not yet completed              00346000
MQAMISNEEDSRESPONSE EQU X'40' Indicates whether the sender requested   *00347000
                         that XCF manage the gathering of a response   *00348000
                         to this message: '1'B if XCF is managing the  *00349000
                         response, '0'B if not. If so, send a response *00350000
                         using the IXCMSGO service, specifying         *00351000
                         ORIGINATOR for the SENDTO keyword and         *00352000
                         supplying a RESPONSEID equal to the value     *00353000
                         provided in the MqaMidResponseID field below. *00354000
                         Note that this flag reflects a specification  *00355000
                         made by the sender when the message was        00356000
*                        originally sent, and cannot be used to        *00357000
                         determine whether the desired response was    *00358000
                         sent or received.                              00359000
MQAMISISARESPONSE EQU X'20' Indicates whether this message is a        *00360000
                         response that is being managed by XCF: '1'B   *00361000
                         if it is an XCF managed response, '0'B if     *00362000
                         not.                                           00363000
MQAMISDELIVERED EQU X'10' '1'B if some portion of the message was      *00364000
                         delivered by message-in service, '0'B if none *00365000
                         of the message was delivered                   00366000
MQAMISSAVED EQU X'08'    '1'B if the message was saved with the        *00367000
                         message control SAVEMSG service.               00368000
         DS    BL.019    Reserved.                                      00369000
         ORG   MQAMISFLAGS+3                                            00370000
MQAMSGINSUMMARY_LEN EQU *-MQAMSGINSUMMARY                               00371000
         ORG   MQAENTDATA                                               00372000
MQAMSGINSUMMARY1 DS 0X                                                  00373000
         DS    CL36      Mapped by MqaMsgInSummary                      00374000
MQAMIS1_MSGTAG DS CL64   User defined message tag associated with the  *00375000
                         message. Contains a copy of the data          *00376000
                         specified for the MSGTAG keyword when the     *00377000
                         message control service (IXCMSGC) was invoked *00378000
                         to save the message. Valid when MQAALEVEL >   *00379000
                         0.                                             00380000
MQAMIS1_TRACETHREAD DS F XCF trace thread associated with message       00381000
         DS    CL28      reserved                                       00382000
MQAMSGINSUMMARY1_LEN EQU *-MQAMSGINSUMMARY1                             00383000
         ORG   ,                                                        00384000
*                                                                       00385000
*    *****************************************************************  00386000
*    *                                                               *  00387000
*    * Message In Detail                                             *  00388000
*    *                                                               *  00389000
*    *****************************************************************  00390000
*                                                                       00391000
*                                                                       00392000
         ORG   MQAENTDATA                                               00393000
MQAMSGINDETAIL DS 0X                                                    00394000
MQAMIDTOKEN DS CL16      Token used to identify this message to the    *00395000
                         message-control service (IXCMSGC).             00396000
MQAMIDUSERDATA DS CL8    User data associated with the message. This   *00397000
                         is the data specified for the USERDATA        *00398000
                         keyword when the IXCMSGC service was invoked  *00399000
                         to save the message.                           00400000
MQAMIDMLEN DS  F         Total number of bytes of message data         *00401000
                         available (remaining) for delivery via the    *00402000
                         message-in service.                            00403000
MQAMIDSOURCE DS CL8      Member token of the member that sent this     *00404000
                         message.                                       00405000
MQAMIDMSGCNTL DS CL32    MSGCNTL value from originator of the signal    00406000
         DS    X         Reserved.                                      00407000
MQAMIDFLAGS DS 0BL3      Flags describing characteristics of the       *00408000
                         message or its delivery.                       00409000
MQAMIDDISCARDPENDING EQU X'80' Indicates that the Msg was saved by the *00410000
                         IXCMSGC service and was later discarded but   *00411000
                         the discard has not yet completed              00412000
MQAMIDNEEDSRESPONSE EQU X'40' Indicates whether the sender requested   *00413000
                         that XCF manage the gathering of a response   *00414000
                         to this message: '1'B if XCF is managing the  *00415000
                         response, '0'B if not. If so, send a response *00416000
                         using the IXCMSGO service, specifying         *00417000
                         ORIGINATOR for the SENDTO keyword and         *00418000
                         supplying a RESPONSEID equal to the value     *00419000
                         provided in the MqaMidResponseID field below. *00420000
                         Note that this flag reflects a specification  *00421000
                         made by the sender when the message was        00422000
*                        originally sent, and cannot be used to        *00423000
                         determine whether the desired response was    *00424000
                         sent or received.                              00425000
MQAMIDISARESPONSE EQU X'20' Indicates whether this message is a        *00426000
                         response that is being managed by XCF: '1'B   *00427000
                         if it is an XCF managed response, '0'B if     *00428000
                         not.                                           00429000
MQAMIDDELIVERED EQU X'10' '1'B if some portion of the message was      *00430000
                         delivered by message-in service, '0'B if none *00431000
                         of the message was delivered                   00432000
MQAMIDSAVED EQU X'08'    '1'B if the message was saved with the        *00433000
                         message control SAVEMSG service.               00434000
         DS    BL.019    Reserved.                                      00435000
         ORG   MQAMIDFLAGS+3                                            00436000
MQAMIDRESPONSEID DS CL24 Message Response ID. Valid when the           *00437000
                         MqaMidNeedsResponse flag is '1'B, otherwise   *00438000
                         undefined. Specify this value for the         *00439000
                         RESPONSEID keyword when invoking the          *00440000
                         message-out service (IXCMSGO) to reply to     *00441000
                         this message.                                  00442000
MQAMSGINDETAIL_LEN EQU *-MQAMSGINDETAIL                                 00443000
         ORG   MQAENTDATA                                               00444000
MQAMSGINDETAIL1 DS 0X                                                   00445000
         DS    CL96      Mapped by MqaMsgInDetail                       00446000
MQAMID1_MSGTAG DS CL64   User defined message tag associated with the  *00447000
                         message. Contains a copy of the data          *00448000
                         specified for the MSGTAG keyword when the     *00449000
                         message control service (IXCMSGC) was invoked *00450000
                         to save the message. Valid when MQAALEVEL >   *00451000
                         0.                                             00452000
MQAMID1_TRACETHREAD DS F XCF trace thread associated with message       00453000
         DS    CL28      reserved                                       00454000
MQAMSGINDETAIL1_LEN EQU *-MQAMSGINDETAIL1                               00455000
         ORG   ,                                                        00456000
*                                                                       00457000
*                                                                       00458000
* ********************************************************************  00459000
* *                                                                  *  00460000
* *                        Message Out Detail                        *  00461000
* *                                                                  *  00462000
* *                                                                  *  00463000
* *  This record has variable length.  It is designed so that        *  00464000
* *  the user can set up a pointer to a table of target/response     *  00465000
* *  entries.  The entire table is contained within this one record. *  00466000
* *                                                                  *  00467000
* *  First target/response entry is found as follows:                *  00468000
* *    TblEntryptr = addr(MqaEntry) + MqaModTblOffset                *  00469000
* *                                                                  *  00470000
* *  Subsequent entries are located as follows:                      *  00471000
* *    TblEntryptr = TblEntryptr + MqaModEntLen                      *  00472000
* *                                                                  *  00473000
* ********************************************************************  00474000
*                                                                       00475000
*                                                                       00476000
         ORG   MQAENTDATA                                               00477000
MQAMSGOUTDETAIL DS 0X                                                   00478000
MQAMODTOKEN DS CL16      Token used to identify this message and any   *00479000
                         associated responses to other XCF services    *00480000
                         (such as IXCMSGC).                             00481000
MQAMODUSERDATA DS BL8    User data associated with the message.        *00482000
                         Contains a copy of the data specified for the *00483000
                         USERDATA keyword when the message-out service *00484000
                         (IXCMSGO) was invoked to send the message or  *00485000
                         as modified by the message control service    *00486000
                         (IXCMSGC) when message was saved or           *00487000
                         completed.                                     00488000
MQAMODFLAGS DS 0BL4      Flags describing characteristics of the       *00489000
                         message                                        00490000
MQAMODFLAGS0 DS 0B                                                      00491000
MQAMODBROADCAST EQU X'80' Indicates that the sender specified          *00492000
                         SENDTO(GROUP) on the IXCMSGO invocation.       00493000
MQAMODGETRESPONSE EQU X'40' Indicates whether the sender of this       *00494000
                         message requested XCF management of           *00495000
                         responses.                                     00496000
MQAMODISARESPONSE EQU X'20' Indicates whether this message is a        *00497000
                         response being managed by XCF.                 00498000
MQAMODSENDPENDING EQU X'10' Desired send(s) not initiated by the       *00499000
                         message-out service.                           00500000
MQAMODRESPPENDING EQU X'08' Expected response(s) not received.          00501000
MQAMODCOMPLETED EQU X'04' Indicates whether message considered to be   *00502000
                         complete. Note that this flag is not mutually *00503000
                         exclusive with the Send/RespPending flags     *00504000
                         since completion may have been forced or the  *00505000
                         message may have timed out.                    00506000
MQAMODTIMEDOUT EQU X'02' '1'B if the message did not complete within   *00507000
                         the time-out period.                           00508000
MQAMODCANCELLED EQU X'01' '1'B if the message did not complete before  *00509000
                         the message-out request was cancelled.         00510000
         ORG   MQAMODFLAGS0+1                                           00511000
MQAMODFLAGS1 DS 0B                                                      00512000
MQAMODNOTIFYBYEXIT EQU X'80' Sender requested notifcation by exit when *00513000
                         complete                                       00514000
MQAMODDISCARDPENDING EQU X'40' Indicates that the message was marked   *00515000
                         for discard but the discard has not yet       *00516000
                         completed.                                     00517000
MQAMODSUCCESSFUL EQU X'20' Indicates whether the request completed     *00518000
                         successfully where no sends were rejected and *00519000
                         all responses were received for broadcast get *00520000
                         response requests or no sends were rejected   *00521000
                         for broadcast noresponse requests              00522000
MQAMODSAVED EQU X'10'    Message was saved.                             00523000
MQAMODASYNCMSGACCESS EQU X'08' Indicates whether XCF accessed user     *00524000
                         storage describing/containing the message     *00525000
                         from a unit of work asynchronous to the       *00526000
                         IXCMSGO/IXCMSGOX service routines.             00527000
         ORG   MQAMODFLAGS1+1                                           00528000
MQAMODFLAGS2 DS B                                                       00529000
MQAMODFLAGS3 DS B                                                       00530000
MQAMODMLEN DS  F         Number of bytes of message data for           *00531000
                         message-out request                            00532000
MQAMODSOURCE DS BL8      Member token of the sending member.            00533000
MQAMODMSGCNTL DS CL32    Message control data from the message out     *00534000
                         request                                        00535000
MQAMOD#TARGETS DS F      Number of targets for message (including      *00536000
                         skipped targets).                              00537000
         DS    F         Reserved.                                      00538000
MQAMODTBLOFFSET DS F     Offset of table containing target/response    *00539000
                         information for this message. Offset is from  *00540000
                         the start of the MqaEntry that contains the   *00541000
                         MqaMsgoutDetail record. Entries in the table  *00542000
                         are mapped by one of the following:           *00543000
                         MqaTargOnlyEntry MqaTargRespEntry Use         *00544000
                         MqaModEntType to determine which mapping      *00545000
                         should be used.                                00546000
         DS    CL1       Reserved                                       00547000
MQAMODENTTYPE DS X       Code that identifies which mapping to use for *00548000
                         the entries in the table of target/response   *00549000
                         data                                           00550000
MQAMODENTLEN DS H        Length in bytes of an individual entry in the *00551000
                         table containing target/response information. *00552000
                         Use this value when iterating through         *00553000
                         records. DO NOT hard code length of the       *00554000
                         records.                                       00555000
MQAMSGOUTDETAIL_LEN EQU *-MQAMSGOUTDETAIL                               00556000
         ORG   MQAENTDATA                                               00557000
MQAMSGOUTDETAIL1 DS 0X                                                  00558000
         DS    CL88      Mapped by MqaMsgOutDetail                      00559000
MQAMOD1_MSGTAG DS CL64   User defined message tag associated with the  *00560000
                         message. Contains a copy of the data          *00561000
                         specified for the MSGTAG keyword when the     *00562000
                         message control service (IXCMSGC) was invoked *00563000
                         to save the message. Valid when MQAALEVEL >   *00564000
                         0.                                             00565000
MQAMOD1_TRACETHREAD DS F XCF trace thread associated with message       00566000
         DS    CL28      reserved                                       00567000
MQAMODKENTTYPETARGONLY EQU 1 Use MqaTargOnlyEntry                       00568000
MQAMODKENTTYPETARGRESP EQU 2 Use MqaTargRespEntry                       00569000
MQAMSGOUTDETAIL1_LEN EQU *-MQAMSGOUTDETAIL1                             00570000
         ORG   ,                                                        00571000
.L0006   ANOP                                                           00572000
         AIF   ('&MQATARGONLYENTRY' EQ 'NO').L000A                      00573000
         AIF   ('&DSECT' EQ 'YES').L000B                                00574000
         AIF   ('&MQATARGONLYENTRY' NE 'YES').L000A                     00575000
.L000B   ANOP                                                           00576000
*                                                                       00577000
* ********************************************************************  00578000
* *                                                                  *  00579000
* *                   Target/Response Table Entries                  *  00580000
* *                                                                  *  00581000
* *                                                                  *  00582000
* *  Assuming addressability is established to the MqaEntry that is  *  00583000
* *  a MqaMsgoDetail record.  Then the first target/response table   *  00584000
* *  entry is located as follows:                                    *  00585000
* *     TblEntryptr = addr(MqaEntry) + MqaModTblOffset               *  00586000
* *                                                                  *  00587000
* *  Subsequent target/response table entry is located as follows:   *  00588000
* *     TblEntryptr = TblEntryptr + MqaModEntLen                        00589000
* *                                                                  *  00590000
* *                                                                  *  00591000
* * DO NOT HARD CODE THE LENGTH OF THE RECORDS.  USE THE LENGTH AND  *  00592000
* * OFFSETS PROVIDED IN EACH RECORD (to ensure compatibility with    *  00593000
* * additional data provided in the future).                         *  00594000
* *                                                                  *  00595000
* ********************************************************************  00596000
*                                                                       00597000
*                                                                       00598000
         AIF   ('&DSECT' EQ 'YES').L000C                                00599000
MQATARGONLYENTRY DS 0F   Entry to describe result of send to one       *00600000
                         particular target member.                      00601000
         AGO   .L000D                                                   00602000
.L000C   ANOP                                                           00603000
MQATARGONLYENTRY DSECT   Entry to describe result of send to one       *00604000
                         particular target member.                      00605000
.L000D   ANOP                                                           00606000
MQATOTARGET DS BL8       Target member token.                           00607000
MQATOSENDSTATUS DS 0BL4  Status of the message send                     00608000
MQATOSENDFLAGS DS 0BL2                                                  00609000
MQATOSENDINITIATED EQU X'80' '1'B if XCF initiated the send to this    *00610000
                         target member. It is not necessarily the case *00611000
                         that the initiated send was successful.        00612000
MQATOSENDSKIPPED EQU X'40' '1'B if target member token is hexadecimal  *00613000
                         zero, indicating that sender wanted to skip   *00614000
                         an entry in a message-out target table.        00615000
MQATOSENDPENDING EQU X'20' '1'B if the send to this target member is   *00616000
                         pending. XCF has not initiated the send. The  *00617000
                         message is eligible to be sent.                00618000
MQATOSENDREJECTED EQU X'10' '1'B if the send to this target member is  *00619000
                         rejected. The message is not eligible to be   *00620000
                         sent.                                          00621000
MQATOSENDASYNCMSGACCESS EQU X'08' '1'B if an AsyncMsgAccess send to    *00622000
                         this target member was started                 00623000
         DS    BL.011    Reserved.                                      00624000
         ORG   MQATOSENDFLAGS+2                                         00625000
         DS    X         Reserved.                                      00626000
MQATOSENDRETCODE DS X    Return code from message-out service          *00627000
                         (IXCMSGO) with respect to the send to this    *00628000
                         particular target.                             00629000
MQATOSENDRSNCODE DS F    Valid if MqaToSendRetcode is nonzero. If so,  *00630000
                         contains failing reason code from message-out *00631000
                         service.                                       00632000
MQATARGONLYENTRY_LEN EQU *-MQATARGONLYENTRY                             00633000
.L000A   ANOP                                                           00634000
         AIF   ('&MQATARGRESPENTRY' EQ 'NO').L000E                      00635000
         AIF   ('&DSECT' EQ 'YES').L000F                                00636000
         AIF   ('&MQATARGRESPENTRY' NE 'YES').L000E                     00637000
MQATARGRESPENTRY DS 0F   Entry to describe result of send to and       *00638000
                         response from one target member.               00639000
         AGO   .L0010                                                   00640000
.L000F   ANOP                                                           00641000
MQATARGRESPENTRY DSECT   Entry to describe result of send to and       *00642000
                         response from one target member.               00643000
.L0010   ANOP                                                           00644000
MQATRTARGET DS BL8       Target member token.                           00645000
MQATRSENDSTATUS DS 0BL4  Status of the message send                     00646000
MQATRSENDFLAGS DS 0BL2                                                  00647000
MQATRSENDINITIATED EQU X'80' '1'B if XCF initiated the send to this    *00648000
                         target member It is not necessarily the case  *00649000
                         that the initiated send was successful.        00650000
MQATRSENDSKIPPED EQU X'40' '1'B if target member token is hexadecimal  *00651000
                         zero, indicating that sender wanted to skip   *00652000
                         an entry in a message-out target table.        00653000
MQATRSENDPENDING EQU X'20' '1'B if the send to this target member is   *00654000
                         pending. XCF has not initiated the send. The  *00655000
                         message is still eligible to be sent.          00656000
MQATRSENDREJECTED EQU X'10' '1'B if the send to this target member is  *00657000
                         rejected. The message is not eligible to be   *00658000
                         sent.                                          00659000
MQATRSENDASYNCMSGACCESS EQU X'08' '1'B if an AsyncMsgAccess send to    *00660000
                         this target member was started                 00661000
         DS    BL.011    Reserved.                                      00662000
         ORG   MQATRSENDFLAGS+2                                         00663000
         DS    X         Reserved.                                      00664000
MQATRSENDRETCODE DS X    Return code from message-out service          *00665000
                         (IXCMSGO) with respect to the send to this    *00666000
                         particular target.                             00667000
MQATRSENDRSNCODE DS F    Valid if MqaToSendRetcode is nonzero. If so,  *00668000
                         contains failing reason code from message-out *00669000
                         service.                                       00670000
MQATRRESPSTATUS DS 0BL4  Status of response message                     00671000
MQATRRESPFLAGS DS 0BL2   Status of response.                            00672000
MQATRRESPEXPECTED EQU X'80' '1'B if XCF expected the target member to  *00673000
                         respond, '0'B if not.                          00674000
MQATRRESPRECEIVED EQU X'40' '1'B if a response was received by XCF,    *00675000
                         '0'B if not.                                   00676000
MQATRRESPAVAILABLE EQU X'20' '1'B if the associated response is        *00677000
                         available, '0'B if not. If the response was   *00678000
                         received but the associated response is not   *00679000
                         available, the response was delivered, saved, *00680000
                         or discarded.                                  00681000
MQATRRESPDELIVERED EQU X'10' '1'B if some portion of the response was  *00682000
                         delivered by message-in service, '0'B if none *00683000
                         of the response was delivered                  00684000
MQATRRESPSAVED EQU X'08' '1'B if the response was saved with the       *00685000
                         message control SAVEMSG service.               00686000
MQATRRESPDISCARDED EQU X'04' '1'B if the response was discarded with   *00687000
                         the message control DISCARDMSG service.        00688000
         DS    BL.010    Reserved.                                      00689000
         ORG   MQATRRESPFLAGS+2                                         00690000
         DS    X         Reserved.                                      00691000
MQATRRESPCODE DS X       Code to explain why XCF believes the response *00692000
                         was not received. See MnplKRespCode constants *00693000
                         defined in IXCYMNPL macro. Valid when         *00694000
                         MqaTrRespReceived is '0'B.                     00695000
MQATARGRESPENTRY_LEN EQU *-MQATARGRESPENTRY                             00696000
.L000E   ANOP                                                           00697000
         AIF   ('&MQATARGRESPENTRY1' EQ 'NO').L0011                     00698000
         AIF   ('&DSECT' EQ 'YES').L0012                                00699000
         AIF   ('&MQATARGRESPENTRY1' NE 'YES').L0011                    00700000
MQATARGRESPENTRY1 DS 0F  Target response entry for MQAA level 1         00701000
         AGO   .L0013                                                   00702000
.L0012   ANOP                                                           00703000
MQATARGRESPENTRY1 DSECT   Target response entry for MQAA level 1        00704000
.L0013   ANOP                                                           00705000
         DS    CL20      Mapped by MqaTargRespEntry                     00706000
MQATR1_RESPMLEN DS F     Total number of bytes of response message     *00707000
                         data available (remaining) for delivery via   *00708000
                         the message-in service. Valid when            *00709000
                         MqaTrRespAvailable is '1'B and MQAALEVEL > 0.  00710000
MQATR1_RESPSRCE DS BL8   Member token of originator of the response.   *00711000
                         Valid when MqaTrRespAvailable is '1'B and     *00712000
                         MQAALEVEL > 0.                                 00713000
MQATR1_RESPCNTL DS CL32  MSGCNTL value from originator of the          *00714000
                         response. Valid when MqaTrRespAvailable is    *00715000
                         '1'B and MQAALEVEL > 0.                        00716000
         DS    CL24      reserved                                       00717000
MQATARGRESPENTRY1_LEN EQU *-MQATARGRESPENTRY1                           00718000
.L0011   ANOP                                                           00719000
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 00720000
         AIF   ('&LIST' EQ 'YES').P4                                    00721000
.P3      ANOP                                                           00722000
         POP   PRINT                                                    00723000
.P4      ANOP                                                           00724000
.P_EXIT  ANOP                                                           00725000
         MEND                                                           00726000
**/ IXCYMQAA_2:;                                                        00727000
* %IXCYMQAA_INCLUDED = 'YES';                                           00728000
* %DCL ZCBPRINT CHAR EXT;                                               00729000
* %DEACTIVATE ZCBPRINT;                                                 00730000
* %DCL IXCYMQAA_LIST CHAR EXT;                                          00731000
* %DEACTIVATE IXCYMQAA_LIST;                                            00732000
* %IF IXCYMQAA_LIST ^= 'NO' &                                           00733000
*    ZCBPRINT ^= 'NO' %THEN                                             00734000
*   %GOTO IXCYMQAA_3;                                                   00735000
*   @LIST PUSH NOECHO;                                                  00736000
*   @LIST NOASSEMBLE NOECHO;                                            00737000
*   @LIST OFF C NOECHO;                                                 00738000
* %IXCYMQAA_3:;                                                         00739000
*/* Start of PL/X Source                                             */ 00740000
*                                                                       00741000
*  %IF IXCYMQAA_ALET = '' %THEN                                         00742000
*     %IXCYMQAA_ALET = '0';                                             00743000
*  %IXCYMQAA_VIA = '';                                                  00744000
*  %IF IXCYMQAA_ALET ^= '0' %THEN                                       00745000
*     %IXCYMQAA_VIA = 'VIA(IXCYMQAA_ALET)';                             00746000
*                                                                       00747000
*/********************************************************************/ 00748000
*/*                                                                  */ 00749000
*/*                            Header                                */ 00750000
*/*                                                                  */ 00751000
*/********************************************************************/ 00752000
*                                                                       00753000
*   DECLARE                                                             00754000
*     1    MqaHdr  BASED IXCYMQAA_VIA, /* Header record returned on     00755000
*                                      all queries.                  */ 00756000
*       3    MqaHdrLen   FIXED(32), /* Length in bytes of MqaHeader  */ 00757000
*       3    MqaHdrTlen FIXED(32),  /* Total length in bytes of         00758000
*                                      data area needed to contain      00759000
*                                      all the requested information    00760000
*                                      This length includes the header  00761000
*                                      as well as the entries that      00762000
*                                      WERE returned on this call.   */ 00763000
*       3    MqaHdr#Entries FIXED(32), /* Number of complete entries    00764000
*                                      of all kinds that were returned  00765000
*                                      on this call (does not include   00766000
*                                      the header).                  */ 00767000
*       3    MqaHdrEntOffset FIXED(32); /* Offset from MqaHeader at     00768000
*                                      which first entry is located. */ 00769000
*                                                                       00770000
*/********************************************************************/ 00771000
*/*                                                                  */ 00772000
*/*                        Entries                                   */ 00773000
*/*                                                                  */ 00774000
*/*                                                                  */ 00775000
*/*  First entry is located as follows:                              */ 00776000
*/*     Entryptr = addr(MqaHeader) + MqaHdrEntOffset                 */ 00777000
*/*                                                                  */ 00778000
*/*  Subsequent entry is located as follows:                         */ 00779000
*/*     Entryptr = Entryptr + Entryptr-> MqaEntLen                   */ 00780000
*/*                                                                  */ 00781000
*/*                                                                  */ 00782000
*/* DO NOT HARD CODE THE LENGTH OF THE RECORDS.  USE THE LENGTH AND  */ 00783000
*/* OFFSETS PROVIDED IN EACH RECORD (to ensure compatibility with    */ 00784000
*/* additional data provided in the future).                         */ 00785000
*/*                                                                  */ 00786000
*/********************************************************************/ 00787000
*                                                                       00788000
* DCL 1 MqaEntry based IXCYMQAA_VIA, /* Data record                  */ 00789000
*      3 MqaEntType fixed(8),       /* Type of data described in this   00790000
*                                      entry.                        */ 00791000
*      3 *           char(3),       /* Reserved                      */ 00792000
*      3 MqaEntLen fixed unsigned, /*  Number of bytes in this entry.   00793000
*                                      Use this value when iterating    00794000
*                                      through records.  DO NOT hard    00795000
*                                      code length of the records.   */ 00796000
*      3 *           char(8),       /* Reserved                      */ 00797000
*      3 MqaEntData char(*);        /* Variable content of the record.  00798000
*                                      Use MqaEntType to determine      00799000
*                                      which of the mappings below is   00800000
*                                      applicable.                   */ 00801000
*                                                                       00802000
*                                                                       00803000
*   /*****************************************************************/ 00804000
*   /*                                                               */ 00805000
*   /*       MQAA Entry Types                                        */ 00806000
*   /*                                                               */ 00807000
*   /*****************************************************************/ 00808000
*                                                                       00809000
*   DECLARE                                                             00810000
*     MQAKTypeMOS    BIT(8) CONSTANT('01'X), /* Message-out Summary  */ 00811000
*     MQAKTypeMIS    BIT(8) CONSTANT('02'X), /* Message-in Summary   */ 00812000
*     MQAKTypeMOD    BIT(8) CONSTANT('03'X), /* Message-out Detail   */ 00813000
*     MQAKTypeMID    BIT(8) CONSTANT('04'X); /* Message-in Detail       00814000
*                                                                @D1C*/ 00815000
*                                                                       00816000
*   /*****************************************************************/ 00817000
*   /*                                                               */ 00818000
*   /*       MQAALEVELs supported by the system.                     */ 00819000
*   /*                                                               */ 00820000
*   /*       NOTE: Each DATATYPE may support different MQAALEVEL.    */ 00821000
*   /*             Check the MQAKMaxLevel constants for the          */ 00822000
*   /*             MQAALEVEL supported by a specific DATATYPE.       */ 00823000
*   /*                                                               */ 00824000
*   /************************************************************@L2A*/ 00825000
*                                                                       00826000
*   DECLARE                                                             00827000
*     MQAKLevel001 CONSTANT(1),     /* MQAALEVEL 1               @L3A*/ 00828000
*     MQAKLevelMax CONSTANT(1);     /* MQAALEVEL max supported,         00829000
*                                      subject to change as new levels  00830000
*                                      are supported             @L3A*/ 00831000
*                                                                       00832000
*   /*****************************************************************/ 00833000
*   /*                                                               */ 00834000
*   /*       Constants defining highest MQAALEVEL supported by       */ 00835000
*   /*       the indicated DATATYPE.                                 */ 00836000
*   /*                                                               */ 00837000
*   /************************************************************@L2A*/ 00838000
*                                                                       00839000
*   DECLARE                                                             00840000
*     MQAKMaxLevel_MsgOut CONSTANT(1), /* DATATYPE=MSGOUT        @L2A*/ 00841000
*     MQAKMaxLevel_MsgIn  CONSTANT(1), /* DATATYPE=MSGIN         @L2A*/ 00842000
*     MQAKMaxLevel_Detail CONSTANT(1); /* DATATYPE=DETAIL        @L2A*/ 00843000
*                                                                       00844000
*   /*****************************************************************/ 00845000
*   /*                                                               */ 00846000
*   /*                     Message Out Summary                       */ 00847000
*   /*                                                               */ 00848000
*   /*****************************************************************/ 00849000
*                                                                       00850000
*   DECLARE                                                             00851000
*     1    MqaMsgOutSummary defined(MqaEntry.MqaEntData), /* Message    00852000
*                                      Out Summary entry           */   00853000
*       3    MqaMosToken CHAR(16), /* Token used to identify this       00854000
*                                      message to the message-control   00855000
*                                      service (IXCMSGC). */            00856000
*       3    MqaMosUserData bit(64), /* User data associated with the   00857000
*                                      message.  Contains a copy of the 00858000
*                                      data specified for the USERDATA  00859000
*                                      keyword when the message-out     00860000
*                                      service (IXCMSGO) was invoked to 00861000
*                                      send the message or as modified  00862000
*                                      by the message control service   00863000
*                                      (IXCMSGC) when message was       00864000
*                                      saved or completed.           */ 00865000
*       3 MqaMosFlags   bit(32),                                        00866000
*         5 MqaMosFlags0   bit(8),                                      00867000
*          7 MqaMosBroadcast BIT(1), /* Indicates that the sender       00868000
*                                      specified SENDTO(GROUP) on the   00869000
*                                      IXCMSGO invocation.           */ 00870000
*          7 MqaMosGetResponse bit(1), /* Indicates whether the sender  00871000
*                                      of this message requested        00872000
*                                      XCF management of responses.  */ 00873000
*          7 MqaMosIsaResponse bit(1), /* Indicates whether this        00874000
*                                      message is a response being      00875000
*                                      managed by XCF.               */ 00876000
*          7 MqaMosSendPending BIT(1), /* Desired send(s) not           00877000
*                                      initiated by the message-out     00878000
*                                      service.                      */ 00879000
*          7 MqaMosRespPending BIT(1), /* Expected response(s) not      00880000
*                                      received.                     */ 00881000
*          7 MqaMosCompleted bit(1), /* Indicates whether message       00882000
*                                      considered to be complete.       00883000
*                                      Note that this flag is not       00884000
*                                      mutually exclusive with the      00885000
*                                      Send/RespPending flags since     00886000
*                                      completion may have been forced  00887000
*                                      or the message may have timed    00888000
*                                      out.                          */ 00889000
*          7 MqaMosTimedOut    bit(1), /* '1'B if the message did not   00890000
*                                      complete within the time-out     00891000
*                                      period.                       */ 00892000
*          7 MqaMosCancelled bit(1), /* '1'B if the message did not     00893000
*                                      complete before the message-out  00894000
*                                      request was cancelled.        */ 00895000
*         5 MqaMosFlags1   bit(8),                                      00896000
*          7 MqaMosNotifyByExit BIT(1), /* Sender requested             00897000
*                                      notification                     00898000
*                                      by Exit when complete.        */ 00899000
*          7 MqaMosDiscardPending Bit(1),/* Indicates that the          00900000
*                                       message was marked for discard  00901000
*                                       but the discard has not yet     00902000
*                                       completed.               @P2A*/ 00903000
*          7 MqaMosSuccessful BIT(1), /* Indicates whether the request  00904000
*                                       completed successfully where no 00905000
*                                       sends were rejected and all     00906000
*                                       responses were received for     00907000
*                                       broadcast get response requests 00908000
*                                       or no sends were rejected for   00909000
*                                       broadcast noresponse requests   00910000
*                                                                    */ 00911000
*          7 MqaMosSaved BIT(1),     /* Message was saved.           */ 00912000
*          7 MqaMosAsyncMsgAccess BIT(1), /* Indicates whether XCF      00913000
*                                      accessed user storage            00914000
*                                      describing/containing            00915000
*                                      the message from a unit          00916000
*                                      of work asynchronous to the      00917000
*                                      IXCMSGO/IXCMSGOX                 00918000
*                                      service routines.         @L3C*/ 00919000
*         5 MqaMosFlags2   bit(8),                                      00920000
*         5 MqaMosFlags3   bit(8),                                      00921000
*       3 * char(0);                /* End of entry                  */ 00922000
*                                                                       00923000
* DECLARE                                                               00924000
*     1    MqaMsgOutSummary1 defined(MqaEntry.MqaEntData), /* Message   00925000
*                                      Out Summary entry for            00926000
*                                      MQAA level 1              @L2A*/ 00927000
*       3 * char(Length(MqaMsgOutSummary)), /* Mapped by                00928000
*                                      MqaMsgOutSummary          @L2A*/ 00929000
*       3 MqaMos1_MsgTag char(64),  /* User defined message tag         00930000
*                                      associated with the message.     00931000
*                                      Contains a copy of the data      00932000
*                                      specified for the MSGTAG keyword 00933000
*                                      when the message control service 00934000
*                                      (IXCMSGC) was invoked to save    00935000
*                                      the message.                     00936000
*                                      Valid when MQAALEVEL > 0. @L2A*/ 00937000
*       3 MqaMos1_TraceThread fixed(32), /* XCF trace thread            00938000
*                                      associated with message   @L2A*/ 00939000
*       3 * CHAR(28),               /* reserved                  @L2A*/ 00940000
*       3 * char(0);                /*                           @L2A*/ 00941000
*                                                                       00942000
*   /*****************************************************************/ 00943000
*   /*                                                               */ 00944000
*   /*                     Message In Summary                        */ 00945000
*   /*                                                               */ 00946000
*   /*****************************************************************/ 00947000
*                                                                       00948000
*   DECLARE                                                             00949000
*     1    MqaMsgInSummary defined(MqaEntry.MqaEntData), /* Message In  00950000
*                                      Summary entry                 */ 00951000
*       3    MqaMisToken CHAR(16), /* Token used to identify this       00952000
*                                      message to the message-control   00953000
*                                      service (IXCMSGC). */            00954000
*       3    MqaMisUserData CHAR(8), /* User data associated with the   00955000
*                                      message.  This is the data       00956000
*                                      specified for the USERDATA       00957000
*                                      keyword when the IXCMSGC service 00958000
*                                      was invoked to save the          00959000
*                                      message.                      */ 00960000
*       3    MqaMisSource char(8),  /* Member token of the member       00961000
*                                      that sent this message.       */ 00962000
*       3    *          FIXED(8),   /* Reserved.                     */ 00963000
*                                                                       00964000
*       3    MqaMisFlags BIT(24),                                       00965000
*                                   /* Flags describing characteristics 00966000
*                                      of the message or its            00967000
*                                      delivery.                     */ 00968000
*         5 MqaMisDiscardPending BIT(1),/* Indicates that the Msg was   00969000
*                                          saved by the IXCMSGC service 00970000
*                                          and was later discarded but  00971000
*                                          the discard has not yet      00972000
*                                          completed @P2A*/             00973000
*         5 MqaMisNeedsResponse BIT(1),                                 00974000
*                                   /* Indicates whether the sender     00975000
*                                      requested that XCF manage the    00976000
*                                      gathering of a response to this  00977000
*                                      message:  '1'B if XCF is         00978000
*                                      managing the response, '0'B if   00979000
*                                      not.  If so, send a response     00980000
*                                      using the IXCMSGO service,       00981000
*                                      specifying ORIGINATOR for the    00982000
*                                      SENDTO keyword and supplying a   00983000
*                                      RESPONSEID equal to the value    00984000
*                                      provided in the MqaMidResponseID 00985000
*                                      field below.                     00986000
*                                                                       00987000
*                                      Note that this flag reflects a   00988000
*                                      specification made by the sender 00989000
*                                      when the message was originally  00990000
*                                      sent, and cannot be used to      00991000
*                                      determine whether the desired    00992000
*                                      response was sent or received.   00993000
*                                                                    */ 00994000
*         5 MqaMisIsaResponse BIT(1),                                   00995000
*                                   /* Indicates whether this message   00996000
*                                      is a response that is being      00997000
*                                      managed by XCF: '1'B if it is an 00998000
*                                      XCF managed response, '0'B if    00999000
*                                      not.                         */  01000000
*         5 MqaMisDelivered bit(1),   /* '1'B if some portion of        01001000
*                                      the message was delivered by     01002000
*                                      message-in service, '0'B if none 01003000
*                                      of the message was delivered  */ 01004000
*         5 MqaMisSaved bit(1),       /* '1'B if the message was        01005000
*                                      saved with the message control   01006000
*                                      SAVEMSG service.              */ 01007000
*         5 * BIT(19),              /* Reserved.                     */ 01008000
*       3 * char(0);                /* End of entry                  */ 01009000
*                                                                       01010000
* DECLARE                                                               01011000
*     1    MqaMsgInSummary1 defined(MqaEntry.MqaEntData), /* Message    01012000
*                                      In Summary entry for             01013000
*                                      MQAA level 1              @L2A*/ 01014000
*       3 * char(Length(MqaMsgInSummary)), /* Mapped by                 01015000
*                                      MqaMsgInSummary           @L2A*/ 01016000
*       3 MqaMis1_MsgTag char(64),  /* User defined message tag         01017000
*                                      associated with the message.     01018000
*                                      Contains a copy of the data      01019000
*                                      specified for the MSGTAG keyword 01020000
*                                      when the message control service 01021000
*                                      (IXCMSGC) was invoked to save    01022000
*                                      the message.                     01023000
*                                      Valid when MQAALEVEL > 0. @L2A*/ 01024000
*       3 MqaMis1_TraceThread fixed(32), /* XCF trace thread            01025000
*                                      associated with message   @L2A*/ 01026000
*       3 * CHAR(28),               /* reserved                  @L2A*/ 01027000
*       3 * char(0);                /*                           @L2A*/ 01028000
*                                                                       01029000
*   /*****************************************************************/ 01030000
*   /*                                                               */ 01031000
*   /*                     Message In Detail                         */ 01032000
*   /*                                                               */ 01033000
*   /*****************************************************************/ 01034000
*                                                                       01035000
*   DECLARE                                                             01036000
*     1    MqaMsgInDetail defined(MqaEntry.MqaEntData), /* Message In   01037000
*                                      Detail entry                  */ 01038000
*       3    MqaMidToken CHAR(16),  /* Token used to identify this      01039000
*                                      message to the message-control   01040000
*                                      service (IXCMSGC). */            01041000
*       3    MqaMidUserData CHAR(8), /* User data associated with the   01042000
*                                      message.  This is the data       01043000
*                                      specified for the USERDATA       01044000
*                                      keyword when the IXCMSGC service 01045000
*                                      was invoked to save the          01046000
*                                      message.                      */ 01047000
*       3    MqaMidMlen fixed(32),  /* Total number of bytes of message 01048000
*                                      data available (remaining) for   01049000
*                                      delivery via the message-in      01050000
*                                      service.                      */ 01051000
*       3    MqaMidSource char(8),  /* Member token of the member       01052000
*                                      that sent this message.       */ 01053000
*       3    MqaMidMsgCntl CHAR(32), /* MSGCNTL value from originator   01054000
*                                      of the signal             @P1C*/ 01055000
*       3    *          FIXED(8),   /* Reserved.                     */ 01056000
*                                                                       01057000
*       3    MqaMidFlags BIT(24),                                       01058000
*                                   /* Flags describing characteristics 01059000
*                                      of the message or its            01060000
*                                      delivery.                     */ 01061000
*         5 MqaMidDiscardPending BIT(1),/* Indicates that the Msg was   01062000
*                                          saved by the IXCMSGC service 01063000
*                                          and was later discarded but  01064000
*                                          the discard has not yet      01065000
*                                          completed @P2A*/             01066000
*         5 MqaMidNeedsResponse BIT(1),                                 01067000
*                                   /* Indicates whether the sender     01068000
*                                      requested that XCF manage the    01069000
*                                      gathering of a response to this  01070000
*                                      message:  '1'B if XCF is         01071000
*                                      managing the response, '0'B if   01072000
*                                      not.  If so, send a response     01073000
*                                      using the IXCMSGO service,       01074000
*                                      specifying ORIGINATOR for the    01075000
*                                      SENDTO keyword and supplying a   01076000
*                                      RESPONSEID equal to the value    01077000
*                                      provided in the MqaMidResponseID 01078000
*                                      field below.                     01079000
*                                                                       01080000
*                                      Note that this flag reflects a   01081000
*                                      specification made by the sender 01082000
*                                      when the message was originally  01083000
*                                      sent, and cannot be used to      01084000
*                                      determine whether the desired    01085000
*                                      response was sent or received.   01086000
*                                                                    */ 01087000
*         5 MqaMidIsaResponse BIT(1),                                   01088000
*                                   /* Indicates whether this message   01089000
*                                      is a response that is being      01090000
*                                      managed by XCF: '1'B if it is an 01091000
*                                      XCF managed response, '0'B if    01092000
*                                      not.                         */  01093000
*         5 MqaMidDelivered bit(1),   /* '1'B if some portion of        01094000
*                                      the message was delivered by     01095000
*                                      message-in service, '0'B if none 01096000
*                                      of the message was delivered  */ 01097000
*         5 MqaMidSaved bit(1),       /* '1'B if the message was        01098000
*                                      saved with the message control   01099000
*                                      SAVEMSG service.              */ 01100000
*         5 * BIT(19),              /* Reserved.                     */ 01101000
*       3 MqaMidResponseID CHAR(24),                                    01102000
*                                   /* Message Response ID.  Valid when 01103000
*                                      the MqaMidNeedsResponse flag is  01104000
*                                      '1'B, otherwise undefined.       01105000
*                                      Specify this value for the       01106000
*                                      RESPONSEID keyword when invoking 01107000
*                                      the message-out service          01108000
*                                      (IXCMSGO) to reply to this       01109000
*                                      message.                      */ 01110000
*       3 * char(0);                /* End of entry                  */ 01111000
*                                                                       01112000
*   DECLARE                                                             01113000
*     1    MqaMsgInDetail1 defined(MqaEntry.MqaEntData), /* Message     01114000
*                                      In Detail entry for              01115000
*                                      MQAA level 1              @L2A*/ 01116000
*       3 * char(Length(MqaMsgInDetail)), /* Mapped by                  01117000
*                                      MqaMsgInDetail            @L2A*/ 01118000
*       3 MqaMid1_MsgTag char(64),  /* User defined message tag         01119000
*                                      associated with the message.     01120000
*                                      Contains a copy of the data      01121000
*                                      specified for the MSGTAG keyword 01122000
*                                      when the message control service 01123000
*                                      (IXCMSGC) was invoked to save    01124000
*                                      the message.                     01125000
*                                      Valid when MQAALEVEL > 0. @L2A*/ 01126000
*       3 MqaMid1_TraceThread fixed(32), /* XCF trace thread            01127000
*                                      associated with message   @L2A*/ 01128000
*       3 * CHAR(28),               /* reserved                  @L2A*/ 01129000
*       3 * char(0);                /*                           @L2A*/ 01130000
*                                                                       01131000
*                                                                       01132000
*  /*                                                          56@D1D*/ 01133000
*                                                                       01134000
*/********************************************************************/ 01135000
*/*                                                                  */ 01136000
*/*                        Message Out Detail                        */ 01137000
*/*                                                                  */ 01138000
*/*                                                                  */ 01139000
*/*  This record has variable length.  It is designed so that        */ 01140000
*/*  the user can set up a pointer to a table of target/response     */ 01141000
*/*  entries.  The entire table is contained within this one record. */ 01142000
*/*                                                                  */ 01143000
*/*  First target/response entry is found as follows:                */ 01144000
*/*    TblEntryptr = addr(MqaEntry) + MqaModTblOffset                */ 01145000
*/*                                                                  */ 01146000
*/*  Subsequent entries are located as follows:                      */ 01147000
*/*    TblEntryptr = TblEntryptr + MqaModEntLen                      */ 01148000
*/*                                                                  */ 01149000
*/********************************************************************/ 01150000
*                                                                       01151000
*   DECLARE                                                             01152000
*     1 MqaMsgOutDetail defined(MqaEntry.MqaEntData), /* Message Out    01153000
*                                      Detail entry                  */ 01154000
*       3 MqaModToken CHAR(16),     /* Token used to identify           01155000
*                                      this message and any associated  01156000
*                                      responses to other XCF           01157000
*                                      services (such as IXCMSGC).   */ 01158000
*       3 MqaModUserData bit(64),   /* User data associated with the    01159000
*                                      message.  Contains a copy of the 01160000
*                                      data specified for the USERDATA  01161000
*                                      keyword when the message-out     01162000
*                                      service (IXCMSGO) was invoked to 01163000
*                                      send the message or as modified  01164000
*                                      by the message control service   01165000
*                                      (IXCMSGC) when message was       01166000
*                                      saved or completed.           */ 01167000
*       3 MqaModFlags bit(32),      /* Flags describing characteristics 01168000
*                                      of the message                */ 01169000
*        5 MqaModFlags0 bit(8),                                         01170000
*         7 MqaModBroadcast BIT(1), /* Indicates that the sender        01171000
*                                      specified SENDTO(GROUP) on the   01172000
*                                      IXCMSGO invocation.           */ 01173000
*         7 MqaModGetResponse bit(1), /* Indicates whether the sender   01174000
*                                      of this message requested        01175000
*                                      XCF management of responses.  */ 01176000
*         7 MqaModIsaResponse bit(1), /* Indicates whether this         01177000
*                                      message is a response being      01178000
*                                      managed by XCF.               */ 01179000
*         7 MqaModSendPending BIT(1), /* Desired send(s) not            01180000
*                                      initiated by the message-out     01181000
*                                      service.                      */ 01182000
*         7 MqaModRespPending BIT(1), /* Expected response(s) not       01183000
*                                      received.                     */ 01184000
*         7 MqaModCompleted bit(1), /* Indicates whether message        01185000
*                                      considered to be complete.       01186000
*                                      Note that this flag is not       01187000
*                                      mutually exclusive with the      01188000
*                                      Send/RespPending flags since     01189000
*                                      completion may have been forced  01190000
*                                      or the message may have timed    01191000
*                                      out.                          */ 01192000
*         7 MqaModTimedOut    bit(1), /* '1'B if the message did not    01193000
*                                      complete within the time-out     01194000
*                                      period.                       */ 01195000
*         7 MqaModCancelled bit(1), /* '1'B if the message did not      01196000
*                                      complete before the message-out  01197000
*                                      request was cancelled.        */ 01198000
*        5 MqaModFlags1 bit(8),                                         01199000
*         7 MqaModNotifyByExit BIT(1), /* Sender requested notifcation  01200000
*                                      by exit when complete         */ 01201000
*         7 MqaModDiscardPending Bit(1),/* Indicates that the           01202000
*                                       message was marked for discard  01203000
*                                       but the discard has not yet     01204000
*                                       completed.               @P2A*/ 01205000
*         7 MqaModSuccessful BIT(1), /* Indicates whether the request   01206000
*                                       completed successfully where no 01207000
*                                       sends were rejected and all     01208000
*                                       responses were received for     01209000
*                                       broadcast get response requests 01210000
*                                       or no sends were rejected for   01211000
*                                       broadcast noresponse requests   01212000
*                                                                    */ 01213000
*         7 MqaModSaved BIT(1),     /* Message was saved.            */ 01214000
*         7 MqaModAsyncMsgAccess BIT(1), /* Indicates whether XCF       01215000
*                                      accessed user storage            01216000
*                                      describing/containing            01217000
*                                      the message from a unit          01218000
*                                      of work asynchronous to the      01219000
*                                      IXCMSGO/IXCMSGOX                 01220000
*                                      service routines.         @L3C*/ 01221000
*        5 MqaModFlags2 bit(8),                                         01222000
*        5 MqaModFlags3 bit(8),                                         01223000
*       3 MqaModMLen fixed unsigned, /* Number of bytes of message      01224000
*                                      data for message-out request  */ 01225000
*       3 MqaModSource bit(64),     /* Member token of the sending      01226000
*                                      member.                       */ 01227000
*       3 MqaModMsgcntl CHAR(32),   /* Message control data from the    01228000
*                                      message out request           */ 01229000
*       3 MqaMod#Targets fixed unsigned, /* Number of targets for       01230000
*                                      message (including skipped       01231000
*                                      targets).                     */ 01232000
*       3 *              fixed(32), /* Reserved.                     */ 01233000
*       3 MqaModTblOffset fixed(31), /* Offset of table containing      01234000
*                                      target/response information for  01235000
*                                      this message.  Offset is from    01236000
*                                      the start of the MqaEntry that   01237000
*                                      contains the MqaMsgoutDetail     01238000
*                                      record.  Entries in the table    01239000
*                                      are mapped by one of the         01240000
*                                      following:                       01241000
*                                        MqaTargOnlyEntry               01242000
*                                        MqaTargRespEntry               01243000
*                                      Use MqaModEntType to             01244000
*                                      determine which mapping should   01245000
*                                      be used.                      */ 01246000
*       3 * char(1),                /* Reserved                      */ 01247000
*       3 MqaModEntType fixed(8),   /* Code that identifies which       01248000
*                                      mapping to use for the entries   01249000
*                                      in the table of target/response  01250000
*                                      data                          */ 01251000
*       3 MqaModEntLen fixed(16),   /* Length in bytes of an            01252000
*                                      individual entry in the table    01253000
*                                      containing target/response       01254000
*                                      information.                     01255000
*                                      Use this value when iterating    01256000
*                                      through records.  DO NOT hard    01257000
*                                      code length of the records.   */ 01258000
*       3 * char(0);                /*                               */ 01259000
*                                                                       01260000
*   DECLARE                                                             01261000
*     1 MqaMsgOutDetail1 defined(MqaEntry.MqaEntData), /* Message       01262000
*                                      Out Detail entry for             01263000
*                                      MQAA level 1              @L2A*/ 01264000
*       3 * char(Length(MqaMsgOutDetail)), /* Mapped by                 01265000
*                                      MqaMsgOutDetail           @L2A*/ 01266000
*       3 MqaMod1_MsgTag char(64),  /* User defined message tag         01267000
*                                      associated with the message.     01268000
*                                      Contains a copy of the data      01269000
*                                      specified for the MSGTAG keyword 01270000
*                                      when the message control service 01271000
*                                      (IXCMSGC) was invoked to save    01272000
*                                      the message.                     01273000
*                                      Valid when MQAALEVEL > 0. @L2A*/ 01274000
*       3 MqaMod1_TraceThread fixed(32), /* XCF trace thread            01275000
*                                      associated with message   @L2A*/ 01276000
*       3 * CHAR(28),               /* reserved                  @L2A*/ 01277000
*       3 * char(0);                /*                           @L2A*/ 01278000
*                                                                       01279000
* Declare                            /* Values for MqaModEntType     */ 01280000
*   MqaModKEntTypeTargOnly constant(1), /* Use MqaTargOnlyEntry      */ 01281000
*   MqaModKEntTypeTargResp constant(2); /* Use MqaTargRespEntry      */ 01282000
*                                                                       01283000
*/********************************************************************/ 01284000
*/*                                                                  */ 01285000
*/*                   Target/Response Table Entries                  */ 01286000
*/*                                                                  */ 01287000
*/*                                                                  */ 01288000
*/*  Assuming addressability is established to the MqaEntry that is  */ 01289000
*/*  a MqaMsgoDetail record.  Then the first target/response table   */ 01290000
*/*  entry is located as follows:                                    */ 01291000
*/*     TblEntryptr = addr(MqaEntry) + MqaModTblOffset               */ 01292000
*/*                                                                  */ 01293000
*/*  Subsequent target/response table entry is located as follows:   */ 01294000
*/*     TblEntryptr = TblEntryptr + MqaModEntLen                 @L2C*/ 01295000
*/*                                                                  */ 01296000
*/*                                                                  */ 01297000
*/* DO NOT HARD CODE THE LENGTH OF THE RECORDS.  USE THE LENGTH AND  */ 01298000
*/* OFFSETS PROVIDED IN EACH RECORD (to ensure compatibility with    */ 01299000
*/* additional data provided in the future).                         */ 01300000
*/*                                                                  */ 01301000
*/********************************************************************/ 01302000
*                                                                       01303000
*   DECLARE                                                             01304000
*     1 MqaTargOnlyEntry based IXCYMQAA_VIA,  /* Entry                  01305000
*                                      to describe result of send       01306000
*                                      to one particular target         01307000
*                                      member.                       */ 01308000
*       3 MqaToTarget bit(64),      /* Target member token.          */ 01309000
*       3 MqaToSendStatus bit(32),  /* Status of the message send    */ 01310000
*         5 MqaToSendFlags bit(16),                                     01311000
*           7 MqaToSendInitiated bit(1), /* '1'B if XCF initiated the   01312000
*                                      send to this target member.      01313000
*                                      It is not necessarily the case   01314000
*                                      that the initiated send was      01315000
*                                      successful.                   */ 01316000
*           7 MqaToSendSkipped    bit(1), /* '1'B if target member      01317000
*                                      token is hexadecimal zero,       01318000
*                                      indicating that sender wanted to 01319000
*                                      skip an entry in a message-out   01320000
*                                      target table.                 */ 01321000
*           7 MqaToSendPending    bit(1), /* '1'B if the send to this   01322000
*                                      target member is pending.        01323000
*                                      XCF has not initiated the send.  01324000
*                                      The message is eligible          01325000
*                                      to be sent.                   */ 01326000
*           7 MqaToSendRejected   bit(1), /* '1'B if the send to this   01327000
*                                      target member is rejected.       01328000
*                                      The message is not eligible      01329000
*                                      to be sent.                   */ 01330000
*           7 MqaToSendAsyncMsgAccess bit(1), /* '1'B if an             01331000
*                                      AsyncMsgAccess send to this      01332000
*                                      target member was started @L1A*/ 01333000
*           7 * bit(11),            /* Reserved.                 @L1C*/ 01334000
*         5 * fixed(8),             /* Reserved.                     */ 01335000
*         5 MqaToSendRetcode fixed(8), /* Return code from message-out  01336000
*                                      service (IXCMSGO) with respect   01337000
*                                      to the send to this particular   01338000
*                                      target.                       */ 01339000
*       3 MqaToSendRsncode fixed(32), /* Valid if MqaToSendRetcode is   01340000
*                                      nonzero.                         01341000
*                                      If so, contains failing          01342000
*                                      reason code from message-out     01343000
*                                      service.                      */ 01344000
*       3 * char(0);                /*                               */ 01345000
*                                                                       01346000
* DECLARE                                                               01347000
*     1 MqaTargRespEntry based IXCYMQAA_VIA,  /* Entry                  01348000
*                                      to describe result of send       01349000
*                                      to and response from one target  01350000
*                                      member.                       */ 01351000
*       3 MqaTrTarget bit(64),      /* Target member token.          */ 01352000
*       3 MqaTrSendStatus bit(32),  /* Status of the message send    */ 01353000
*         5 MqaTrSendFlags bit(16),                                     01354000
*           7 MqaTrSendInitiated bit(1), /* '1'B if XCF initiated the   01355000
*                                      send to this target member       01356000
*                                      It is not necessarily the case   01357000
*                                      that the initiated send was      01358000
*                                      successful.                   */ 01359000
*           7 MqaTrSendSkipped    bit(1), /* '1'B if target member      01360000
*                                      token is hexadecimal zero,       01361000
*                                      indicating that sender wanted to 01362000
*                                      skip an entry in a message-out   01363000
*                                      target table.                 */ 01364000
*           7 MqaTrSendPending    bit(1), /* '1'B if the send to this   01365000
*                                      target member is pending.        01366000
*                                      XCF has not initiated the send.  01367000
*                                      The message is still eligible    01368000
*                                      to be sent.                   */ 01369000
*           7 MqaTrSendRejected   bit(1), /* '1'B if the send to this   01370000
*                                      target member is rejected.       01371000
*                                      The message is not eligible      01372000
*                                      to be sent.                   */ 01373000
*           7 MqaTrSendAsyncMsgAccess bit(1), /* '1'B if an             01374000
*                                      AsyncMsgAccess send to this      01375000
*                                      target member was started @L1A*/ 01376000
*           7 * bit(11),            /* Reserved.                 @L1C*/ 01377000
*         5 * fixed(8),             /* Reserved.                     */ 01378000
*         5 MqaTrSendRetcode fixed(8), /* Return code from message-out  01379000
*                                      service (IXCMSGO) with respect   01380000
*                                      to the send to this particular   01381000
*                                      target.                       */ 01382000
*       3 MqaTrSendRsncode fixed(32), /* Valid if MqaToSendRetcode is   01383000
*                                      nonzero.                         01384000
*                                      If so, contains failing          01385000
*                                      reason code from message-out     01386000
*                                      service.                      */ 01387000
*       3 MqaTrRespStatus bit(32),  /* Status of response message    */ 01388000
*         5 MqaTrRespFlags bit(16), /* Status of response.           */ 01389000
*           7 MqaTrRespExpected bit(1), /* '1'B if XCF expected         01390000
*                                      the target member to respond,    01391000
*                                      '0'B if not.                  */ 01392000
*           7 MqaTrRespReceived bit(1), /* '1'B if a response was       01393000
*                                      received by XCF, '0'B if not. */ 01394000
*           7 MqaTrRespAvailable bit(1), /* '1'B if the associated      01395000
*                                      response is available, '0'B if   01396000
*                                      not.  If the response was        01397000
*                                      received but the associated      01398000
*                                      response is not available, the   01399000
*                                      response was delivered, saved,   01400000
*                                      or discarded.                 */ 01401000
*           7 MqaTrRespDelivered bit(1), /* '1'B if some portion of     01402000
*                                      the response was delivered by    01403000
*                                      message-in service, '0'B if none 01404000
*                                      of the response was delivered */ 01405000
*           7 MqaTrRespSaved bit(1), /* '1'B if the response was        01406000
*                                      saved with the message control   01407000
*                                      SAVEMSG service.              */ 01408000
*           7 MqaTrRespDiscarded bit(1), /* '1'B if the response was    01409000
*                                      discarded with the message       01410000
*                                      control DISCARDMSG service.   */ 01411000
*           7 * bit(10),            /* Reserved.                     */ 01412000
*         5 * fixed(8),             /* Reserved.                     */ 01413000
*         5 MqaTrRespCode fixed(8), /* Code to explain why XCF          01414000
*                                      believes                         01415000
*                                      the response was not received.   01416000
*                                      See MnplKRespCode constants      01417000
*                                      defined in IXCYMNPL macro.       01418000
*                                      Valid when MqaTrRespReceived     01419000
*                                      is '0'B.                  @L2C*/ 01420000
*       3 * char(0);                /*                               */ 01421000
*                                                                       01422000
* DECLARE                                                               01423000
*     1 MqaTargRespEntry1 based IXCYMQAA_VIA,  /* Target response       01424000
*                                      entry for MQAA level 1    @L2A*/ 01425000
*       3 * char(Length(MqaTargRespEntry)), /* Mapped by                01426000
*                                      MqaTargRespEntry          @L2A*/ 01427000
*       3 MqaTr1_RespMLen fixed(32), /* Total number of bytes of        01428000
*                                      response message data available  01429000
*                                      (remaining) for delivery via     01430000
*                                      the message-in service.          01431000
*                                      Valid when MqaTrRespAvailable    01432000
*                                      is '1'B and MQAALEVEL > 0.       01433000
*                                                                @L2A*/ 01434000
*       3 MqaTr1_RespSRCE BIT(64),  /* Member token of originator of    01435000
*                                      the response.                    01436000
*                                      Valid when MqaTrRespAvailable    01437000
*                                      is '1'B and MQAALEVEL > 0.       01438000
*                                                                @L2A*/ 01439000
*       3 MqaTr1_RespCNTL CHAR(32), /* MSGCNTL value from originator of 01440000
*                                      the response.                    01441000
*                                      Valid when MqaTrRespAvailable    01442000
*                                      is '1'B and MQAALEVEL > 0.       01443000
*                                                                @L2A*/ 01444000
*       3 * CHAR(24),               /* reserved                  @L2A*/ 01445000
*       3 * char(0);                /*                           @L2A*/ 01446000
*                                                                       01447000
*/* End of PL/X Source                                               */ 01448000
* %IF IXCYMQAA_LIST ^= 'NO' &                                           01449000
*    ZCBPRINT ^= 'NO' %THEN                                             01450000
*   %GOTO IXCYMQAA_4;                                                   01451000
*   @LIST POP NOECHO;                                                   01452000
* %IXCYMQAA_4:;                                                         01453000
* %END;                                                                 01454000
