*                                                                       00001000
* %DCL IXCYGEPL_INCLUDED CHAR EXT;                                      00002000
* %DEACTIVATE IXCYGEPL_INCLUDED;                                        00003000
* %IF IXCYGEPL_INCLUDED = '' %THEN                                      00004000
* %DO;                                                                  00005000
*/* Macro made bi-lingual on 18014. CBGEN compile date 15295         */ 00006000
*% /*                                                                   00007000
         MACRO                                                          00008000
         IXCYGEPL &DSECT=YES,&LIST=YES,&TITLE=YES,&GEPL=YES,           *00009000
               &GEPL1=COND                                              00010000
         GBLC  &IXCYGEPL_INCLUDED                                       00011000
         GBLC  &ZCBPRINT                                                00012000
&IXCYGEPL_INCLUDED SETC 'YES'                                           00013000
         AIF   ('&LIST' EQ 'NONE').P0                                   00014000
         AIF   ('&TITLE' EQ 'NO').P5                                    00015000
 TITLE   'IXCYGEPL  - Group Exit Parameter List                      '  00016000
.P5      ANOP                                                           00017000
**/ IXCYGEPL_1:;                                                        00018000
*/* START OF SPECIFICATIONS ******************************************  00019000
*                                                                       00020000
*01* PROPRIETARY STATEMENT =                                            00021000
*                                                                       00022000
*    LICENSED MATERIALS - PROPERTY OF IBM                               00023000
*    5650-ZOS COPYRIGHT IBM CORP. 1990, 2013                            00024000
*                                                                       00025000
*  STATUS = HBB7790                                                     00026000
*                                                                       00027000
*01* END OF PROPRIETARY STATEMENT                                       00028000
*                                                                       00029000
*01* EXTERNAL CLASSIFICATION: GUPI                                      00030000
*01* END OF EXTERNAL CLASSIFICATION:                                    00031000
*                                                                       00032000
*01* DESCRIPTIVE NAME:  Group Exit Parameter List                       00033000
*02*  ACRONYM:  GEPL                                                    00034000
*                                                                       00035000
*01* MACRO NAME:  IXCYGEPL                                              00036000
*                                                                       00037000
*01* DSECT NAME:                                                        00038000
*     GEPL                                                              00039000
*     GEPL1                                                             00040000
*                                                                       00041000
*01* COMPONENT:  Cross System Coupling Facility (SCXCF)                 00042000
*                                                                       00043000
*01* EYE-CATCHER:  NONE                                                 00044000
*                                                                       00045000
*01* STORAGE ATTRIBUTES:                                                00046000
*02*  SUBPOOL:  245                                                     00047000
*02*  KEY:  0                                                           00048000
*02*  RESIDENCY:  Above the 16 megabyte line.                           00049000
*                                                                       00050000
*01* SIZE:  As below + 32 bytes for user state field               @L1C 00051000
*            GEPL  -- X'00DC' bytes                                     00052000
*            GEPL1 -- X'00EC' bytes                                     00053000
*                                                                       00054000
*01* CREATED BY:                                                        00055000
*     IXCGNTSK                                                          00056000
*                                                                       00057000
*01* POINTED TO BY:                                                     00058000
*     R1 on entry to the group exit                                     00059000
*                                                                       00060000
*01* SERIALIZATION:                                                     00061000
*     None required                                                     00062000
*                                                                       00063000
*01* FUNCTION:                                                          00064000
*02* Maps the parameters passed to the group exit                       00065000
*                                                                       00066000
*01* METHOD OF ACCESS:                                                  00067000
*02*  ASM:                                                              00068000
*      IXCYGEPL USING on GEPL                                           00069000
*02*  PL/AS:                                                            00070000
*      %INCLUDE SYSLIB(IXCYGEPL)                                        00071000
*                                                                       00072000
*01* DELETED BY:  IXCGNGNE                                              00073000
*                                                                       00074000
*01* FREQUENCY:  One is created each time for any given member exit     00075000
*                                                                       00076000
*01* DEPENDENCIES:  None                                                00077000
*                                                                       00078000
*01* DISTRIBUTION LIBRARY:  AMACLIB                                     00079000
*                                                                       00080000
*01* CHANGE ACTIVITY:                                                   00081000
*   $L0=COUPLXGP,HBB4410,870630,PDXB: Group Exit parameter list         00082000
*   $D1=DCR0066 ,HBB4410,880825,PDCJ: Added SUBMONREMOVED event         00083000
*   $P1=PEO1112 ,HBB4410,881010,PDCJ: A member's monitor FDI is         00084000
*                                     presented on ustate events.       00085000
*   $D2=DCR0090 ,HBB4410,881010,PDCJ: Removed the SUBNDISPMISS event    00086000
*   $P2=PEO2271 ,HBB4410,891023,PDT8: Warn user that group events       00087000
*                                     are presented in logic order      00088000
*   $P3=PEO2815 ,HBB4410,891127,PDEO: Warn user that the member token   00089000
*                                     is cleared for non member state   00090000
*                                     events                            00091000
*   $P4=PEO3097 ,HBB4410,890115,PDEO: Change GEPLGLBL field from dsect  00092000
*                                     to double boundary alignment      00093000
*                                     DS 0D in assembler def            00094000
*   $P5=PEO3192 ,HBB4410,890315,PDEO: Add GEPLMONR, GEPLMISR, GEPLMISD  00095000
*                                     GEPLMEME bits.                    00096000
*   $D3=DCR0333 ,HBB4410,900305,PDEO: Remove event types GEMPAUSE,      00097000
*                                     GEMRUN, GEMSUMRP, GEMSUMDP events 00098000
*                                     GEPLTTIM field removed            00099000
*   $P6=PEO4127, HBB4410,900505,PDEO: Add GEPLSECC bit                  00100000
*   $01=OW14220, HBB5510,950927,PDCJ: Added GEPLCleanupIntValid         00101000
*                                     and GEPLCleanupInt                00102000
*   $L1=ATSSTAR ,HBB7705,010327,PD00BJ: Add GEPL1                       00103000
*                                     (Shipped as OW51103)              00104000
*   $P7=ME13315  HBB7760 080418 PD00BJ: Add PL/X constants to preserve  00105000
*                                       assembler names not generated   00106000
*                                       by CBGEN for mapping lengths    00107000
*   $P8=ME14069  HBB7760 080722 PD0CLC: Copyright                       00108000
*   $P9=ME14854  HBB7760 081024 PD0CLC: Convert to type cbg             00109000
*   $02=OA32868  HBB7770 100503 PD0CLC: IXCYGEPL not in HBB7770         00110000
*      =ME24726  HBB7790 120911 PD0JES: Fixed prolog                    00111000
*      =ME25892  HBB7790 130228 PD0JES: Fix copyright                   00112000
*                                                                       00113000
* END OF SPECIFICATIONS *********************************************/  00114000
*% /*                                                                   00115000
.P0      ANOP                                                           00116000
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 00117000
         AIF   ('&LIST' EQ 'YES').P2                                    00118000
.P1      ANOP                                                           00119000
         PUSH  PRINT                                                    00120000
         PRINT OFF                                                      00121000
.P2      ANOP                                                           00122000
         AIF   ('&GEPL' EQ 'NO').L0002                                  00123000
         AIF   ('&DSECT' EQ 'YES').L0003                                00124000
         AIF   ('&GEPL' NE 'YES').L0002                                 00125000
GEPL     DS    0F        Group exit parameter list                      00126000
         AGO   .L0004                                                   00127000
.L0003   ANOP                                                           00128000
GEPL     DSECT           Group exit parameter list                      00129000
.L0004   ANOP                                                           00130000
GEPLGLBL DS    0CL88     Global GN control block parameters             00131000
GEPLMDAT DS    BL8       Member data value provided via the IXCJOIN    *00132000
                         which established the group exit               00133000
GEPLFLGS DS    0CL4                                                     00134000
GEPLTYPE DS    X         Note: Member events are presented in a logic  *00135000
                         order (ie. a user state field change may be   *00136000
                         seen before a member state change such as a   *00137000
                         JOIN). 1 member status change (i.e. IXCJOIN   *00138000
                         etc.) 2 user state field change, Note that a  *00139000
                         subsystem failure detection interval          *00140000
                         modification could also have occurred. 4      *00141000
                         Reserved 6 Reserved 7 member status update    *00142000
                         missing reported by subsystem's status exit 8 *00143000
                         member status update missing detected by       00144000
*                        subsystem monitor DIE 9 member status update  *00145000
                         no longer missing 10 Reserved 11 system       *00146000
                         reported active 12 system update missing 13   *00147000
                         system update resumed 14 system reported      *00148000
                         going 15 system reported gone 16 system       *00149000
                         detected missing 17 system detected gone 18   *00150000
                         system failure detection interval updated 19  *00151000
                         Reserved 20 Reserved 21 subsystem failure     *00152000
                         detection interval updated. Note that a user  *00153000
                         state modification could also have occurred.   00154000
*                        22 system in partitioning (THIS SYSTEM). 23   *00155000
                         monitoring removed for this member             00156000
GEPLOLDS DS    X         Member state before action in type field      *00157000
                         X'00' not defined, X'02' created, X'03'       *00158000
                         active, X'04' quiesced, X'05' failed           00159000
GEPLNEWS DS    X         Member state after action in type field X'00' *00160000
                         not defined, X'02' created, X'03' active,     *00161000
                         X'04' quiesced, X'05' failed                   00162000
GEPLFLG2 DS    0B                                                       00163000
GEPLMEME EQU   X'80'     Bit is ON if event is a Member related event  *00164000
                         (ie. JOIN), OFF if system-related event ie    *00165000
                         System reported active                         00166000
GEPLMONR EQU   X'40'     Bit is ON if monitoring is removed for this   *00167000
                         member                                         00168000
GEPLMISR EQU   X'20'     Member status update missing was reported by  *00169000
                         the members status exit                        00170000
GEPLMISD EQU   X'10'     Member status update missing assumed by the   *00171000
                         status monitoring because the members status  *00172000
                         exit did not execute in time or terminated    *00173000
                         abnormally                                     00174000
GEPLSECC EQU   X'08'     Bit is ON if this is the second time the exit *00175000
                         is called for the same event. (ie. The exit   *00176000
                         abended the first time it was called for this *00177000
                         event before recovery was established          00178000
GEPLCLEANUPINTVALID EQU X'04' Indicates whether GEPLCLEANUPINT is      *00179000
                         valid or not. On, indicates that it is valid  *00180000
                         and off indicates that it isn't valid.         00181000
         ORG   GEPLFLGS+4                                               00182000
GEPLGNAM DS    CL8       Group Name                                     00183000
GEPLMNAM DS    CL16      Member Name                                    00184000
GEPLMTOK DS    BL8       Member token                                   00185000
*                                                                       00186000
*      ***************************************************************  00187000
*      *                                                             *  00188000
*      * Note: The Member Token, Group name, and Member fields are   *  00189000
*      * set to 0 for events which are not member-related (i.e.      *  00190000
*      * GESYSACT, GESYSFDI, etc.)                                      00191000
*      *                                                             *  00192000
*      ***************************************************************  00193000
*                                                                       00194000
*                                                                       00195000
GEPLSYS  DS    CL8       System name where member last/currently       *00196000
                         active                                         00197000
GEPLETIM DS    BL8       Time event occurred in STCK format             00198000
GEPLINTV DS    F         Monitoring interval (system/subsystem) in     *00199000
                         hundredths of seconds. For system events      *00200000
                         contains the system FDI, for member events    *00201000
                         contains the subsystem FDI                     00202000
GEPLUDAT DS    BL4       User data field. -Contains the value passed   *00203000
                         back by the status exit in R0 the last time   *00204000
                         the exit reported status update missing or    *00205000
                         resumed                                        00206000
GEPLUSLN DS    F         Actual length of user state field              00207000
GEPLSID  DS    0F        System token associated with system on which  *00208000
                         member was last active                         00209000
GEPLSNUM DS    X         System slot number                             00210000
         DS    FL3       Reserved                                       00211000
GEPLCLEANUPINT DS F      Contains the current system (as defined by    *00212000
                         GEPLSID) cleanup interval. The interval is    *00213000
                         specified in seconds and can change           *00214000
                         dynamically. The GEPLCLEANUPINTVALID bit      *00215000
                         indicates whether the value could be provided *00216000
                         or not.                                        00217000
         DS    CL8       Reserved                                       00218000
GEPLUSOF DS    F         Offset from GEPL of 32-byte user state field. *00219000
                         NOTE: It is possible that XCF can not         *00220000
                         determine a member's user state. This occurs  *00221000
                         when a member leaves on a system that has     *00222000
                         been partitioned out of the sysplex and the   *00223000
                         signal containing the event is lost due to    *00224000
                         the system's failure. In this case, XCF sets  *00225000
                         the user state field to 32-bytes of X'FF'. It *00226000
                         should also be noted that a user can set a    *00227000
                         user state to this value. As a result, it is   00228000
*                        recommended that this value not be used by    *00229000
                         the user as a user state.                      00230000
GEPLHSTY DS    0CL128    History Data                                   00231000
GEPLHIST DS    0CL16     Eight sets of fields containing the event     *00232000
                         time and expected duration of the last eight  *00233000
                         events which affected the member in GEPLMNAM, *00234000
                         in LIFO order                                  00235000
GEPLHTIM DS    BL8       Time event occurred in STCK format             00236000
GEPLHTTM DS    F         Time event is expected to last, in units of   *00237000
                         hundredths of seconds, subsystem monitoring   *00238000
                         only, optional                                 00239000
GEPLHFLG DS    BL4       Flags corresponding to GEPLFLGS, for prior    *00240000
                         events                                         00241000
         ORG   GEPL+220                                                 00242000
GEPL_LEN EQU   *-GEPL                                                   00243000
.L0002   ANOP                                                           00244000
         AIF   ('&GEPL1' EQ 'NO').L0005                                 00245000
         AIF   ('&DSECT' EQ 'YES').L0006                                00246000
         AIF   ('&GEPL1' NE 'YES').L0005                                00247000
.L0006   ANOP                                                           00248000
*                                                                       00249000
*    *****************************************************************  00250000
*    *                                                               *  00251000
*    * At a minimum, the group exit is passed the data defined by the*  00252000
*    * GEPL mapping. Depending on the release/service level of XCF,  *  00253000
*    * the group exit may be passed an extended version of the GEPL. *  00254000
*    * If the group exit is not known to be running on a release that*  00255000
*    * supports these extended versions (eg HBB7705), the contents of*  00256000
*    * GEPLUSOF can be checked to determine whether an extended GEPL *  00257000
*    * was passed. If GEPLUSOF = GEPL_kOnlyBase, only the data       *  00258000
*    * defined by the GEPL mapping was passed. If GEPLUSOF ^=        *  00259000
*    * GEPL_kOnlyBase, an extended GEPL that includes the data       *  00260000
*    * defined by GEPL1 was passed.                                     00261000
*    *                                                               *  00262000
*    *****************************************************************  00263000
*                                                                       00264000
*                                                                       00265000
         AIF   ('&DSECT' EQ 'YES').L0007                                00266000
GEPL1    DS    0F        CAUTION: GEPL1 may not exist. Check GEPLUSOF  *00267000
                         before using the GEPL1.                        00268000
         AGO   .L0008                                                   00269000
.L0007   ANOP                                                           00270000
GEPL1    DSECT           CAUTION: GEPL1 may not exist. Check GEPLUSOF  *00271000
                         before using the GEPL1.                        00272000
.L0008   ANOP                                                           00273000
         DS    CL220     Mapped by GEPL                                 00274000
GEPL1_VERSION DS X       Version number of GEPL                         00275000
         DS    CL7       Reserved                                       00276000
GEPL1_TARGETMEMTOKEN DS BL8 Member token of the member whose group     *00277000
                         exit is being driven.                          00278000
GEPL_KONLYBASE EQU 220   Compare this value to GEPLUSOF to determine   *00279000
                         whether the GEPL1 is available for use by the *00280000
                         group exit.                                    00281000
GEPL_KVERSION1 EQU 1     Version 1 of GEPL.                             00282000
GEPLLEN  EQU   220       Preserve defining of this name in the         *00283000
                         assembler (for compatibility with previous    *00284000
                         releases).                                     00285000
*                                                                       00286000
* *****************************************************************  *  00287000
* * Declaration of constants for use in group exits  -  (GEPLTYPE)   *  00288000
* *****************************************************************  *  00289000
*                                                                       00290000
*                                                                       00291000
GEMSTATE EQU   1         Member state event                             00292000
GEUSTATE EQU   2         User state event 4 - Reserved 6 - Reserved     00293000
GEMSUMSE EQU   7         Member status update missing reported by      *00294000
                         status exit                                    00295000
GEMSUMDI EQU   8         Member status update missing detected by      *00296000
                         subsysmon DIE                                  00297000
GEMNOSUM EQU   9         Member status update not missing 10 -         *00298000
                         reserved                                       00299000
GESYSACT EQU   11        SYSTEM reported active                         00300000
GESYSSUM EQU   12        SYSTEM update missing                          00301000
GESYSSUR EQU   13        SYSTEM update resume                           00302000
GESYSGO  EQU   14        SYSTEM reported going                          00303000
GESYSGON EQU   15        SYSTEM reported gone                           00304000
GESYSDM  EQU   16        SYSTEM detected missing                        00305000
GESYSDG  EQU   17        SYSTEM detected gone                           00306000
GESYSFDI EQU   18        SYSTEM failure detection interval updated 19  *00307000
                         - Reserved 20 - Reserved                       00308000
GESUBFDI EQU   21        Subsystem failure detection interval updated   00309000
GESYSPRT EQU   22        System in partitioning                         00310000
GEMONREM EQU   23        Monitoring removed                             00311000
*                                                                       00312000
* *****************************************************************  *  00313000
* * Declaration of constants for use in group exits                  *  00314000
* *       GEPLOLDS & GEPLNEWS                                        *  00315000
* *****************************************************************  *  00316000
*                                                                       00317000
*                                                                       00318000
GENOTDEF EQU   0         Member not defined                             00319000
GECREATE EQU   2         Member created                                 00320000
GEACTIVE EQU   3         Member active                                  00321000
GEQUIESC EQU   4         Member quiesced                                00322000
GEFAILED EQU   5         Member failed                                  00323000
GEPL1_LEN EQU  *-GEPL1                                                  00324000
.L0005   ANOP                                                           00325000
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 00326000
         AIF   ('&LIST' EQ 'YES').P4                                    00327000
.P3      ANOP                                                           00328000
         POP   PRINT                                                    00329000
.P4      ANOP                                                           00330000
.P_EXIT  ANOP                                                           00331000
         MEND                                                           00332000
**/ IXCYGEPL_2:;                                                        00333000
* %IXCYGEPL_INCLUDED = 'YES';                                           00334000
* %DCL ZCBPRINT CHAR EXT;                                               00335000
* %DEACTIVATE ZCBPRINT;                                                 00336000
* %DCL IXCYGEPL_LIST CHAR EXT;                                          00337000
* %DEACTIVATE IXCYGEPL_LIST;                                            00338000
* %IF IXCYGEPL_LIST ^= 'NO' &                                           00339000
*    ZCBPRINT ^= 'NO' %THEN                                             00340000
*   %GOTO IXCYGEPL_3;                                                   00341000
*   @LIST PUSH NOECHO;                                                  00342000
*   @LIST NOASSEMBLE NOECHO;                                            00343000
*   @LIST OFF C NOECHO;                                                 00344000
* %IXCYGEPL_3:;                                                         00345000
*/* Start of PL/X Source                                             */ 00346000
*DCL 1 GEPL BASED BDY(WORD), /* Group exit parameter list            */ 00347000
*     2 GEPLGLBL,            /* Global GN control block parameters   */ 00348000
*      3 GEPLMDAT BIT(64), /* Member data value provided via the        00349000
*                           IXCJOIN which established the group exit */ 00350000
*      3 GEPLFLGS,                                                      00351000
*        4 GEPLTYPE FIXED(8), /*                                        00352000
*                     Note: Member events are presented in a logic      00353000
*                           order (ie. a user state field change may    00354000
*                           be seen before a member state change such   00355000
*                           as a JOIN).                       @P2A      00356000
*                  1  member status change (i.e. IXCJOIN etc.)          00357000
*                  2  user state field change,                          00358000
*                     Note that a subsystem failure detection interval  00359000
*                     modification could also have occurred.            00360000
*                  4  Reserved                               @D3D       00361000
*                  6  Reserved                               @D6D       00362000
*                  7  member status update missing reported by          00363000
*                     subsystem's status exit                           00364000
*                  8  member status update missing detected by          00365000
*                     subsystem monitor DIE                             00366000
*                  9  member status update no longer missing            00367000
*                 10  Reserved                               @D1C       00368000
*                 11  system reported active                            00369000
*                 12  system update missing                             00370000
*                 13  system update resumed                             00371000
*                 14  system reported going                             00372000
*                 15  system reported gone                              00373000
*                 16  system detected missing                           00374000
*                 17  system detected gone                              00375000
*                 18  system failure detection interval updated         00376000
*                 19  Reserved                               @D3D       00377000
*                 20  Reserved                               @D3D       00378000
*                 21  subsystem failure detection interval updated.     00379000
*                     Note that a user state modification could also    00380000
*                     have occurred.                                    00381000
*                 22  system in partitioning (THIS SYSTEM).             00382000
*                 23  monitoring removed for this member         @D1A*/ 00383000
*        4 GEPLOLDS FIXED(8), /* Member state before action in          00384000
*                                type field                             00385000
*                         X'00' not defined,                            00386000
*                         X'02' created,                                00387000
*                         X'03' active,                                 00388000
*                         X'04' quiesced,                               00389000
*                         X'05' failed */                               00390000
*        4 GEPLNEWS FIXED(8),       /* Member state after action in     00391000
*                                      type field                       00392000
*                         X'00' not defined,                            00393000
*                         X'02' created,                                00394000
*                         X'03' active,                                 00395000
*                         X'04' quiesced,                               00396000
*                         X'05' failed */                               00397000
*        4 GEPLFLG2  BIT(8),                      /* @P5A*/             00398000
*           5 GEPLMEME  BIT(1),   /* Bit is ON if event is a Member     00399000
*                                    related event (ie. JOIN), OFF      00400000
*                                    if system-related event            00401000
*                                    ie System reported active @P5A*/   00402000
*           5 GEPLMONR  BIT(1),   /* Bit is ON if monitoring is         00403000
*                                    removed for this member @P5A*/     00404000
*           5 GEPLMISR  BIT(1),   /* Member status update missing       00405000
*                                    was reported by the members        00406000
*                                    status exit             @P5A*/     00407000
*           5 GEPLMISD  BIT(1),   /* Member status update missing       00408000
*                                 assumed by the status monitoring      00409000
*                                 because the members status exit       00410000
*                                 did not execute in time or            00411000
*                                 terminated abnormally  @P5A*/         00412000
*           5 GEPLSECC  BIT(1),   /* Bit is ON if this is the second    00413000
*                                 time the exit is called for the same  00414000
*                                 event. (ie. The exit abended the      00415000
*                                 first time it was called for this     00416000
*                                 event before recovery was established 00417000
*                                                             @P6C*/    00418000
*           5 GEPLCLEANUPINTVALID BIT(1), /*                            00419000
*                                 Indicates whether GEPLCLEANUPINT      00420000
*                                 is valid or not. On, indicates that   00421000
*                                 it is valid and off indicates that    00422000
*                                 it isn't valid.            @O1A*/     00423000
*           5 *         BIT(2),   /* Reserved   @P6C @O1C*/             00424000
*      3 GEPLGNAM CHAR(8), /* Group Name  */                            00425000
*      3 GEPLMNAM CHAR(16), /* Member Name */                           00426000
*      3 GEPLMTOK BIT(64),  /* Member token */                          00427000
*                 /* Note: The Member Token, Group name, and Member     00428000
*                          fields are set to 0 for events which are     00429000
*                          not member-related (i.e. GESYSACT,           00430000
*                          GESYSFDI, etc.)   @P3A*/                     00431000
*      3 GEPLSYS CHAR(8),   /* System name where member last/currently  00432000
*                              active */                                00433000
*      3 GEPLETIM BIT(64),  /* Time event occurred in STCK format */    00434000
*      3 GEPLINTV FIXED(32),  /* Monitoring interval (system/subsystem) 00435000
*                                in hundredths of seconds. For system   00436000
*                                events contains the system FDI, for    00437000
*                                member events contains the subsystem   00438000
*                                FDI */                                 00439000
*      3 GEPLUDAT BIT(32),   /* User data field.                        00440000
*                              -Contains the value passed back by       00441000
*                               the status exit in R0 the last time     00442000
*                               the exit reported status update         00443000
*                               missing or resumed                  */  00444000
*      3 GEPLUSLN FIXED(32), /* Actual length of user state field   */  00445000
*      3 GEPLSID  FIXED(32), /* System token associated with system     00446000
*                               on which member was last active     */  00447000
*       4 GEPLSNUM FIXED(8), /* System slot number                  */  00448000
*       4 *        FIXED(24),/* Reserved                            */  00449000
*      3 GEPLCLEANUPINT FIXED(32), /* Contains the current system       00450000
*                   (as defined by GEPLSID) cleanup interval.  The      00451000
*                   interval is specified in seconds and can change     00452000
*                   dynamically.  The GEPLCLEANUPINTVALID bit           00453000
*                   indicates whether the value could be provided       00454000
*                   or not.                                     @O1A*/  00455000
*      3 *         CHAR(8),  /* Reserved                        @O1C*/  00456000
*     2 GEPLUSOF FIXED(32),         /* Offset from GEPL of 32-byte user 00457000
*                                      state field.                     00458000
*               NOTE: It is possible that XCF can not determine a       00459000
*               member's user state. This occurs when a member leaves   00460000
*               on a system that has been partitioned out of the        00461000
*               sysplex                                                 00462000
*               and the signal containing the event is lost due to      00463000
*               the system's failure. In this case, XCF sets the        00464000
*               user state field to 32-bytes of X'FF'. It should also   00465000
*               be noted that a user can set a user state to this       00466000
*               value.                                                  00467000
*               As a result, it is recommended that this value not      00468000
*               be used by the user as a user state.             @L1C*/ 00469000
*     2 GEPLHSTY CHAR(128) BDY(WORD),  /* History Data */               00470000
*      3 GEPLHIST(8) CHAR(16) BDY(WORD), /*                             00471000
*                         Eight sets of fields containing the event     00472000
*                            time and expected duration of the last     00473000
*                            eight events which affected                00474000
*                            the member in GEPLMNAM, in LIFO order  */  00475000
*        4 GEPLHTIM BIT(64), /* Time event occurred in STCK format */   00476000
*        4 GEPLHTTM FIXED(32), /* Time event is expected to last,       00477000
*                      in units of hundredths of seconds, subsystem     00478000
*                      monitoring only, optional */                     00479000
*        4 GEPLHFLG BIT(32); /* Flags corresponding to GEPLFLGS,        00480000
*                               for prior events                   */   00481000
*                                                                       00482000
*DCL GEPLUSTA CHAR(32) BASED;  /* User State Field -- ADDR(GEPL)        00483000
*                               + GEPLUSOF. Length in GEPLUSLN.         00484000
*                               Maximum length is 32.              */   00485000
*                                                                       00486000
*    /* At a minimum, the group exit is passed the data defined by the  00487000
*       GEPL mapping.  Depending on the release/service level of XCF,   00488000
*       the group exit may be passed an extended version of the GEPL.   00489000
*       If the group exit is not known to be running on a release that  00490000
*       supports these extended versions (eg HBB7705), the contents of  00491000
*       GEPLUSOF can be checked to determine whether an extended GEPL   00492000
*       was passed.  If GEPLUSOF = GEPL_kOnlyBase, only the data        00493000
*       defined by the GEPL mapping was passed.  If GEPLUSOF ^=         00494000
*       GEPL_kOnlyBase, an extended GEPL that includes the data defined 00495000
*       by GEPL1 was passed.                                     @L1A*/ 00496000
*                                                                       00497000
*DCL 1 GEPL1 BDY(WORD) BASED,       /* CAUTION: GEPL1 may not exist.    00498000
*                                      Check GEPLUSOF before using the  00499000
*                                      GEPL1.                    @L1A*/ 00500000
*      3 * CHAR( Length(GEPL) ),    /* Mapped by GEPL            @L1A*/ 00501000
*      3 GEPL1_Version fixed(8),    /* Version number of GEPL    @L1A*/ 00502000
*      3 * CHAR(7),                 /* Reserved                  @L1A*/ 00503000
*      3 GEPL1_TargetMemToken bit(64), /* Member token of the member    00504000
*                                      whose group exit is being        00505000
*                                      driven.                   @L1A*/ 00506000
*      3 * char(0);                 /*                           @L1A*/ 00507000
*                                                                       00508000
*DCL GEPL_kOnlyBase fixed constant(220); /* Compare this value to       00509000
*                                      GEPLUSOF to determine whether    00510000
*                                      the GEPL1 is available for use   00511000
*                                      by the group exit.        @L1A*/ 00512000
*Dcl GEPL_kVersion1 fixed constant(1); /* Version 1 of GEPL.     @L1A*/ 00513000
*                                                                       00514000
*DCL GEPLLEN constant( Length(GEPL) ); /* Preserve defining of this     00515000
*                                      name in the assembler (for       00516000
*                                      compatibility with previous      00517000
*                                      releases).                @P7A*/ 00518000
*                                                                       00519000
*/******************************************************************/   00520000
*/* Declaration of constants for use in group exits  -  (GEPLTYPE) */   00521000
*/******************************************************************/   00522000
*DCL  GEMSTATE  FIXED(8) CONSTANT(1), /* Member state event          */ 00523000
*     GEUSTATE  FIXED(8) CONSTANT(2), /* User state event            */ 00524000
*                                     /* 4  - Reserved           @D3D*/ 00525000
*                                     /* 6  - Reserved           @D3D*/ 00526000
*     GEMSUMSE  FIXED(8) CONSTANT(7), /* Member status update missing   00527000
*                                        reported by status exit     */ 00528000
*     GEMSUMDI  FIXED(8) CONSTANT(8), /* Member status update missing   00529000
*                                        detected by subsysmon DIE   */ 00530000
*     GEMNOSUM  FIXED(8) CONSTANT(9), /* Member status update           00531000
*                                                        not missing */ 00532000
*                                     /* 10 - reserved           @D2C*/ 00533000
*     GESYSACT  FIXED(8) CONSTANT(11),/* SYSTEM reported active      */ 00534000
*     GESYSSUM  FIXED(8) CONSTANT(12),/* SYSTEM update missing       */ 00535000
*     GESYSSUR  FIXED(8) CONSTANT(13),/* SYSTEM update resume        */ 00536000
*     GESYSGO   FIXED(8) CONSTANT(14),/* SYSTEM reported going       */ 00537000
*     GESYSGON  FIXED(8) CONSTANT(15),/* SYSTEM reported gone        */ 00538000
*     GESYSDM   FIXED(8) CONSTANT(16),/* SYSTEM detected missing     */ 00539000
*     GESYSDG   FIXED(8) CONSTANT(17),/* SYSTEM detected gone        */ 00540000
*     GESYSFDI  FIXED(8) CONSTANT(18),/* SYSTEM failure detection       00541000
*                                                  interval updated  */ 00542000
*                                     /* 19 - Reserved           @D3D*/ 00543000
*                                     /* 20 - Reserved           @D3D*/ 00544000
*     GESUBFDI  FIXED(8) CONSTANT(21),/* Subsystem failure detection    00545000
*                                        interval updated            */ 00546000
*     GESYSPRT  FIXED(8) CONSTANT(22),/* System in partitioning      */ 00547000
*     GEMONREM  FIXED(8) CONSTANT(23);/* Monitoring removed     @D1A */ 00548000
*                                                                       00549000
*/******************************************************************/   00550000
*/* Declaration of constants for use in group exits                */   00551000
*/*       GEPLOLDS & GEPLNEWS                                      */   00552000
*/******************************************************************/   00553000
*DCL  GENOTDEF FIXED(8) CONSTANT(0), /* Member not defined           */ 00554000
*     GECREATE FIXED(8) CONSTANT(2), /* Member created               */ 00555000
*     GEACTIVE FIXED(8) CONSTANT(3), /* Member active                */ 00556000
*     GEQUIESC FIXED(8) CONSTANT(4), /* Member quiesced              */ 00557000
*     GEFAILED FIXED(8) CONSTANT(5); /* Member failed                */ 00558000
*/* End of PL/X Source                                               */ 00559000
* %IF IXCYGEPL_LIST ^= 'NO' &                                           00560000
*    ZCBPRINT ^= 'NO' %THEN                                             00561000
*   %GOTO IXCYGEPL_4;                                                   00562000
*   @LIST POP NOECHO;                                                   00563000
* %IXCYGEPL_4:;                                                         00564000
* %END;                                                                 00565000
