*                                                                       00001000
* %DCL IXCYAMDA_INCLUDED CHAR EXT;                                      00002000
* %DEACTIVATE IXCYAMDA_INCLUDED;                                        00003000
* %IF IXCYAMDA_INCLUDED = '' %THEN                                      00004000
* %DO;                                                                  00005000
*/* Macro made bi-lingual on 18339. CBGEN compile date 15295         */ 00006000
*% /*                                                                   00007000
         MACRO                                                          00008000
         IXCYAMDA &DSECT=YES,&LIST=YES,&TITLE=YES,&AMDAREA=YES,        *00009000
               &AMDAGFD=COND,&AMDAGFO=COND,&AMDADR=COND,&AMDGLI=COND,  *00010000
               &AMDPATH=COND,&AMDPATH1=COND,&AMDPATH2=COND,            *00011000
               &AMDMPEND=COND,&AMDSYS=COND,&AMDSYS1=COND,&AMDSD=COND,  *00012000
               &AMDMEM=COND,&AMDMEMDI=COND,&AMDMEMDI1=COND,            *00013000
               &AMCTCHDD=COND,&AMSTRHDD=COND,&AMLSTHDD=COND             00014000
         GBLC  &IXCYAMDA_INCLUDED                                       00015000
         GBLC  &ZCBPRINT                                                00016000
&IXCYAMDA_INCLUDED SETC 'YES'                                           00017000
         AIF   ('&LIST' EQ 'NONE').P0                                   00018000
         AIF   ('&TITLE' EQ 'NO').P5                                    00019000
 TITLE   'IXCYAMDA  - XCF Accounting and Measurement Data Area       '  00020000
.P5      ANOP                                                           00021000
**/ IXCYAMDA_1:;                                                        00022000
*/* START OF SPECIFICATIONS ******************************************* 00023000
*                                                                       00024000
*01* PROPRIETARY STATEMENT =                                            00025000
*                                                                       00026000
*    Licensed Materials - Property of IBM                               00027000
*    5650-ZOS COPYRIGHT IBM CORP. 1999, 2018                            00028000
*                                                                       00029000
*    US Government Users Restricted Rights - Use, duplication or        00030000
*    disclosure restricted by GSA ADP Schedule Contract with            00031000
*    IBM Corp.                                                          00032000
*                                                                       00033000
*01* STATUS = HBB77C0                                                   00034000
*                                                                       00035000
*01* END OF PROPRIETARY STATEMENT                                       00036000
*                                                                       00037000
*01* EXTERNAL CLASSIFICATION: GUPI                                      00038000
*01* END OF EXTERNAL CLASSIFICATION:                                    00039000
*                                                                       00040000
*01* DESCRIPTIVE NAME:  XCF Accounting and Measurement Data Area        00041000
*02*  ACRONYM:  AMDA                                                    00042000
*                                                                       00043000
*01* MACRO NAME:  IXCYAMDA                                              00044000
*                                                                       00045000
*01* DSECT NAME:                                                        00046000
*     AMDAREA                                                           00047000
*     AMDPATH                                                           00048000
*     AMDMPEND                                                          00049000
*     AMDSYS                                                            00050000
*     AMDSD                                                             00051000
*                                                                       00052000
*01* COMPONENT:  Cross System Coupling Facility (SCXCF)                 00053000
*                                                                       00054000
*01* EYE-CATCHER:  NONE                                                 00055000
*                                                                       00056000
*01* STORAGE ATTRIBUTES:                                                00057000
*02*  SUBPOOL:  User-supplied                                           00058000
*02*  KEY:  Key User-supplied                                           00059000
*02*  RESIDENCY:  User-supplied                                         00060000
*                                                                       00061000
*01* SIZE:  Variable                                                    00062000
*                AMDPATH2  -- X'01AC' bytes                             00063000
*                AMDMEMDI1 -- X'0054' bytes                             00064000
*                AMDAGFD   -- X'006C' bytes                             00065000
*                AMDAGFO   -- X'0020' bytes                             00066000
*                AMDADR    -- X'0004' bytes                             00067000
*                AMDGLI    -- X'000C' bytes                             00068000
*                AMDPATH1  -- X'00BC' bytes                             00069000
*                AMDSYS1   -- X'0080' bytes                             00070000
*                AMDMEM    -- X'014C' bytes                             00071000
*                AMDMEMDI  -- X'0040' bytes                             00072000
*                AMDAREA   -- X'0040' bytes                             00073000
*                AMDPATH   -- X'0078' bytes                             00074000
*                AMDMPEND  -- X'004C' bytes                             00075000
*                AMDSYS    -- X'004C' bytes                             00076000
*                AMDSD     -- X'0030' bytes                             00077000
*                AMCTCHDD  -- X'0020' bytes                             00078000
*                AMSTRHDD  -- X'0020' bytes                             00079000
*                AMLSTHDD  -- X'0020' bytes                             00080000
*                                                                       00081000
****                                                                    00082000
*   Note that AMCTCHDD, AMSTRHDD, and AMLSTHDD map storage contained    00083000
*   within the AMDPATH and AMDMPEND data records.                       00084000
*                                                                       00085000
*                                                                       00086000
*01* CREATED BY:                                                        00087000
*     IXCA1MG                                                           00088000
*                                                                       00089000
*01* POINTED TO BY:                                                     00090000
*     DATAAREA_ADDR field in MG parameter list                          00091000
*                                                                       00092000
*01* SERIALIZATION:                                                     00093000
*     None required                                                     00094000
*                                                                       00095000
*01* FUNCTION:                                                          00096000
*02* IXCYAMDA maps the data returned by the                             00097000
*      XCF Measurement Gatherer Service (IXCMG).                        00098000
*                                                                       00099000
*01* METHOD OF ACCESS:                                                  00100000
*02*  ASM: IXCYAMDA                                                     00101000
*02*  PL/AS:                                                            00102000
*          DSECT=YES!NO  -- Request DSECT definition                    00103000
*          AREA=YES!NO --   Request AMDAREA record mapping              00104000
*                           USING on AMDAREA                            00105000
*          PATH=YES!NO --   Request path record mapping                 00106000
*                           USING on AMDPATH                            00107000
*          MPEND=YES!NO --  Request message pending record map          00108000
*                           USING on AMDMPEND                           00109000
*          SYSTEM=YES!NO -- Request system record mapping               00110000
*                           USING on AMDSYS                             00111000
*          SRCDST=YES!NO  -- Request source/dest record mapping         00112000
*                            USING on AMDSD                             00113000
*     Default: DSECT=YES,AREA=YES,PATH=YES,MPEND=YES,SYSTEM=YES,        00114000
*                        SRCDST=YES                                     00115000
*                                                                       00116000
*01* DELETED BY:  User                                                  00117000
*                                                                       00118000
*01* FREQUENCY:  Created for response to MG                             00119000
*                                                                       00120000
*01* DEPENDENCIES:  None.                                               00121000
*                                                                       00122000
*01* DISTRIBUTION LIBRARY:  AMACLIB                                     00123000
*                                                                       00124000
*01* CHANGE ACTIVITY:                                                   00125000
*   $L0=COUPLXAM,HBB4410,880308,PDXB: CROSS-SYSTEM COUPLING FACILITY    00126000
*   $D1=DCR0074 ,HBB4410,880725,PDBJ: Add System Name to MPEND, SD      00127000
*   $L1=TCLASS  ,HBB4410,881212,PDBJ: Transport Classes                 00128000
*   $D2=DCR129  ,HBB4410,890417,PDBJ: Add reset indicator AMDSYSGRS     00129000
*   $P1=PEO3840 ,HBB4410,900930,PDBJ: Missing comment delimiter         00130000
*                                     Fix for OY37303                   00131000
*   $01=OY42409 ,HBB4410,901203,PD00BJ: Serial CTC IPL Window           00132000
*   $P2=PKB2255 ,HBB4430,920617,PDEG: Maxmsg customer value display.    00133000
*   $P3=PKB2764 ,HBB4430,920617,PD00BJ: Clarify comments.               00134000
*   $L2=SYSLKTAM,HBB5510,910301,PD00BJ: XES Signalling                  00135000
*   $L3=SYSLKTAM,HBB5510,910901,PD00BJ: XES Signalling                  00136000
*   $L4=SYSLKTAM,HBB5510,930325,PD00BJ: XES Signalling                  00137000
*   $L5=SYSLKTRB,HBB5510,930725,PD00BJ: Additional path states          00138000
*   $L6=XCFBC   ,HBB6603,950707,PD00BJ: Add AMDMEM record               00139000
*   $P4=PQC1215 ,HBB6603,960516,PD002T: Fix prolog problem for showhdr  00140000
*   $D3=DQC028  ,JBB6603,960815,PD00DT: Delete MsgUseSummary record     00141000
*   $02=OW38138 ,HBB6603,990527,PD00BJ: Add I/O timing info             00142000
*   $03=OW37621 ,HBB6606,001215,PD00BJ: Add AMDMEM, AMDALEVEL 1 data    00143000
*   $04=OA09194 ,HBB7707,050615,PD00BJ: Add AMDMEM_TodWhenCollected     00144000
*   $05=OA09194 ,HBB7707,051015,PD00BJ: Add AMDMEM_SympathySickness     00145000
*                                       and AMDMEMDI_SympathySickness   00146000
*   $06=OA09194 ,HBB7707,051101,PD00BJ: Add member termination info     00147000
*                                       Add                             00148000
*   $P5=ME08517  HBB7740 061120 PD00BN: Correct copyright statement     00149000
*   $L7=CRITHB   HBB7770 090210 PD0JES: Critical member support         00150000
*   $P6=ME17197  HBB7770 090928 PD0JES: Add AMDMEM_Has*Exit             00151000
*   $P7=ME17678 ,HBB7770,091109,PD0JES: Cleanup unused constants        00152000
*   $L8=TCSIMP   HBB77A0 130830 PD00C9: Message Isolation.              00153000
*                                       New AMDMEMDI1 record            00154000
*   $L9=TCSIMP   HBB77A0 140124 PD002F: Message Isolation messages      00155000
*   $P8=ME27749 ,HBB77A0,141015,PD00BJ: Enhance MISO awareness          00156000
*   $LA=TCSIMP   HBB77A0 141208 PD00BJ: Use MemIsoSeq# not TsStopSeq#   00157000
*   $07=OA47985  HBB77A0 150606 PD00BJ: TRSQ.  MISO impact counts.      00158000
*   $LB=ETCLASS  HBB77C0 180801 PD0NDM: AMDALEVEL3 support for PATH     00159000
*                                       Add AMDALEVEL4 support          00160000
*   $LC=ETCLASS  HBB77C0 181003 PD0NDM: Hot path for AMDALEVEL4         00161000
*   $LD=ETCLASS  HBB77C0 181024 PD0NDM: External path utilization       00162000
*                                                                       00163000
* END OF SPECIFICATIONS *********************************************/  00164000
*% /*                                                                   00165000
.P0      ANOP                                                           00166000
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 00167000
         AIF   ('&LIST' EQ 'YES').P2                                    00168000
.P1      ANOP                                                           00169000
         PUSH  PRINT                                                    00170000
         PRINT OFF                                                      00171000
.P2      ANOP                                                           00172000
*                                                                       00173000
*    IXCMG     Supported AMDALEVELS                                     00174000
*                                                                       00175000
*                                                                       00176000
AMDALEVEL000 EQU 0       AMDALEVEL 0                                    00177000
AMDALEVEL001 EQU 1       AMDALEVEL 1                                    00178000
AMDALEVEL002 EQU 2       AMDALEVEL 2                                    00179000
AMDALEVEL003 EQU 3       AMDALEVEL 3                                    00180000
AMDALEVEL004 EQU 4       AMDALEVEL 4                                    00181000
AMDALEVELMAX EQU 4       AMDALEVEL max supported, subject to change as *00182000
                         new levels are supported                       00183000
AMDALEVEL_PATH EQU 4                                                    00184000
AMDALEVEL_MSGPEND EQU 0                                                 00185000
AMDALEVEL_SYSTEM EQU 1                                                  00186000
AMDALEVEL_SRCDST EQU 0                                                  00187000
AMDALEVEL_MEMBER EQU 3                                                  00188000
         AIF   ('&AMDAREA' EQ 'NO').L0002                               00189000
         AIF   ('&DSECT' EQ 'YES').L0003                                00190000
         AIF   ('&AMDAREA' NE 'YES').L0002                              00191000
.L0003   ANOP                                                           00192000
*                                                                       00193000
* ********************************************************************  00194000
* *                                                                  *  00195000
* *        Header returned in DATAAREA for IXCMG requests that       *  00196000
* *          default to GATHERFROM=LOCAL                             *  00197000
* *                                                                  *  00198000
* ********************************************************************  00199000
*                                                                       00200000
*                                                                       00201000
         AIF   ('&DSECT' EQ 'YES').L0004                                00202000
AMDAREA  DS    0F        Data area for IXCMG requests that return      *00203000
                         measurement data records.                      00204000
         AGO   .L0005                                                   00205000
.L0004   ANOP                                                           00206000
AMDAREA  DSECT           Data area for IXCMG requests that return      *00207000
                         measurement data records.                      00208000
.L0005   ANOP                                                           00209000
AMDATLEN DS    F         Total length of output data area needed to    *00210000
                         contain all the requested information. This   *00211000
                         length includes the area for the records that *00212000
                         were returned on this call.                    00213000
AMDA#PTH DS    F         Number of path entries                         00214000
AMDALPTH DS    F         Length of path data                            00215000
AMDAOPTH DS    F         Offset to path entries                         00216000
AMDA#MPE DS    F         Number of pending message entries              00217000
AMDALMPE DS    F         Length of pending message data                 00218000
AMDAOMPE DS    F         Offset to pending message entries              00219000
AMDA#SYS DS    F         Number of system entries                       00220000
AMDALSYS DS    F         Length of system data                          00221000
AMDAOSYS DS    F         Offset to system entries                       00222000
AMDA#SD  DS    F         Number of source/destination entries.          00223000
AMDALSD  DS    F         Length of source/destination data entries      00224000
AMDAOSD  DS    F         Offset to source/destination entries.          00225000
AMDA#MUS DS    F         Number of member message use summary entries   00226000
AMDALMUS DS    F         Length of member message space summary        *00227000
                         entries                                        00228000
AMDAOMUS DS    F         Offset to member message use summary entries   00229000
AMDAREA_LEN EQU *-AMDAREA                                               00230000
.L0002   ANOP                                                           00231000
         AIF   ('&AMDAGFD' EQ 'NO').L0006                               00232000
         AIF   ('&DSECT' EQ 'YES').L0007                                00233000
         AIF   ('&AMDAGFD' NE 'YES').L0006                              00234000
.L0007   ANOP                                                           00235000
*                                                                       00236000
* ********************************************************************  00237000
* *                                                                  *  00238000
* *      Header returned in DATAAREA for IXCMG requests that:        *  00239000
* *        - Specify GATHERFROM=LOCAL                                *  00240000
* *        - Specify GATHERFROM=TOKEN                                *  00241000
* *                                                                  *  00242000
* ********************************************************************  00243000
*                                                                       00244000
*                                                                       00245000
         AIF   ('&DSECT' EQ 'YES').L0008                                00246000
AMDAGFD  DS    0F        Header for data area returned by explicit     *00247000
                         GATHERFROM=LOCAL or GATHERFROM=TOKEN           00248000
         AGO   .L0009                                                   00249000
.L0008   ANOP                                                           00250000
AMDAGFD  DSECT           Header for data area returned by explicit     *00251000
                         GATHERFROM=LOCAL or GATHERFROM=TOKEN           00252000
.L0009   ANOP                                                           00253000
         DS    CL64      This area is mapped by AMDAREA as usual.       00254000
AMDAGFD_VERSION DS X     Version of AMDAGFD header                      00255000
         DS    CL1       Reserved                                       00256000
AMDAGFD_LENGTH DS H      Length of AMDAGFD header                       00257000
AMDAGFD_RETCODE DS F     IXCMG return code for the data collection      00258000
AMDAGFD_RSNCODE DS F     IXCMG reason code for the data collection      00259000
AMDAGFD_SYSTOKEN DS F    XCF System ID of system that collected the    *00260000
                         data                                           00261000
AMDAGFD_SYSNAME DS CL8   Name of system that collected the data         00262000
AMDAGFD_TOD DS CL8       TOD when data gathering started. Hex zero if  *00263000
                         not started or not known.                      00264000
         DS    CL3                                                      00265000
AMDAGFD_AMDALEVEL DS X   AMDALEVEL requested                            00266000
AMDAGFD_OGLI_REPORTED DS F Offset relative to AMDAGFD to locate the    *00267000
                         Gatherer Level Info record describing the     *00268000
                         AMDALEVEL of the returned data records. Zero  *00269000
                         if record not provided.                        00270000
AMDAGFD_OGLI_SUPPORTED DS F Offset relative to AMDAGFD to locate the   *00271000
                         Gatherer Level Info record describing the     *00272000
                         maximum AMDALEVEL supported by the gathering  *00273000
                         system for each type of data record. Zero if  *00274000
                         record not provided.                           00275000
AMDAGFD_LEN EQU *-AMDAGFD                                               00276000
.L0006   ANOP                                                           00277000
         AIF   ('&AMDAGFO' EQ 'NO').L000A                               00278000
         AIF   ('&DSECT' EQ 'YES').L000B                                00279000
         AIF   ('&AMDAGFO' NE 'YES').L000A                              00280000
.L000B   ANOP                                                           00281000
*                                                                       00282000
* ********************************************************************  00283000
* *                                                                  *  00284000
* *      Header returned in DATAAREA for IXCMG requests that code    *  00285000
* *                       GATHERFROM=OTHER                           *  00286000
* *                                                                  *  00287000
* ********************************************************************  00288000
*                                                                       00289000
*                                                                       00290000
         AIF   ('&DSECT' EQ 'YES').L000C                                00291000
AMDAGFO  DS    0F        Data area for IXCMG GATHERFROM=OTHER request   00292000
         AGO   .L000D                                                   00293000
.L000C   ANOP                                                           00294000
AMDAGFO  DSECT           Data area for IXCMG GATHERFROM=OTHER request   00295000
.L000D   ANOP                                                           00296000
AMDAGFO_VERSION DS X     Version of this header                         00297000
         DS    CL1       reserved                                       00298000
AMDAGFO_LENGTH DS H      Length of this header                          00299000
AMDAGFO_RETCODE DS F     IXCMG return code for the asynchronous        *00300000
                         request.                                       00301000
AMDAGFO_RSNCODE DS F     IXCMG reason code for the asynchronous        *00302000
                         request.                                       00303000
AMDAGFO_MAXPLISTVER DS X Max IXCMG PLISTVER supported by target        *00304000
                         system. Valid for use if nonzero.              00305000
AMDAGFO_MAXAMDALEVEL DS X Max IXCMG AMDALEVEL supported by target      *00306000
                         system. Valid for use if nonzero.              00307000
         DS    CL2       reserved                                       00308000
AMDAGFO_REQTOKEN DS CL16 If request accepted, contains a token that    *00309000
                         represents the request. Otherwise zero.        00310000
AMDAGFO_LEN EQU *-AMDAGFO                                               00311000
.L000A   ANOP                                                           00312000
         AIF   ('&AMDADR' EQ 'NO').L000E                                00313000
         AIF   ('&DSECT' EQ 'YES').L000F                                00314000
         AIF   ('&AMDADR' NE 'YES').L000E                               00315000
AMDADR   DS    0H        Mapping of first word common to all data      *00316000
                         records                                        00317000
         AGO   .L0010                                                   00318000
.L000F   ANOP                                                           00319000
AMDADR   DSECT           Mapping of first word common to all data      *00320000
                         records                                        00321000
.L0010   ANOP                                                           00322000
AMDADR_TYPE DS X         Type of data record                            00323000
AMDADR_VERSION DS X      Version of data record                         00324000
AMDADR_LENGTH DS H       Length in bytes of record                      00325000
AMDADR_CONTENT DS 0C     Type specific content starts at this offset    00326000
AMDA_KTYPE_PATH EQU 1    AMDPATH                                        00327000
AMDA_KTYPE_MPEND EQU 2   AMDMPEND                                       00328000
AMDA_KTYPE_SYS EQU 4     AMDSYS                                         00329000
AMDA_KTYPE_SD EQU 8      AMDSD                                          00330000
AMDA_KTYPE_MEM EQU 16    AMDMEM                                         00331000
*                                                                       00332000
*   All new TYPE constants must be a multiple of 32 for compatibility   00333000
*   with AMDPATH, AMDMPEND, AMDSYS, AMDSD, AMDMEM which use a flag in   00334000
*   the low order 5 bits of TYPE byte to identify the record.           00335000
*                                                                       00336000
*                                                                       00337000
AMDA_KTYPE_GLI EQU 32    AMDGLI                                         00338000
AMDA_KVERSION0 EQU 0                                                    00339000
AMDADR_LEN EQU *-AMDADR                                                 00340000
.L000E   ANOP                                                           00341000
         AIF   ('&AMDGLI' EQ 'NO').L0011                                00342000
         AIF   ('&DSECT' EQ 'YES').L0012                                00343000
         AIF   ('&AMDGLI' NE 'YES').L0011                               00344000
.L0012   ANOP                                                           00345000
*                                                                       00346000
* ********************************************************************  00347000
* *                                                                  *  00348000
* *                         GLI Record                               *  00349000
* *                                                                  *  00350000
* ********************************************************************  00351000
*                                                                       00352000
*                                                                       00353000
         AIF   ('&DSECT' EQ 'YES').L0013                                00354000
AMDGLI   DS    0H        Record containing information about           *00355000
                         AMDALEVELs for specific types of data records  00356000
         AGO   .L0014                                                   00357000
.L0013   ANOP                                                           00358000
AMDGLI   DSECT           Record containing information about           *00359000
                         AMDALEVELs for specific types of data records  00360000
.L0014   ANOP                                                           00361000
AMDGLI_TYPE DS X         =AMDA_kType_GLI                                00362000
AMDGLI_VERSION DS X      Version of this record                         00363000
AMDGLI_RECLEN DS H       Length of this record                          00364000
AMDGLI_LEVEL_PATH DS X   for AMDPATH                                    00365000
AMDGLI_LEVEL_MSGPEND DS X for AMDMPEND                                  00366000
AMDGLI_LEVEL_SYSTEM DS X for AMDSYS                                     00367000
AMDGLI_LEVEL_SRCDST DS X for AMDSD                                      00368000
AMDGLI_LEVEL_MEMBER DS X for AMDMEM                                     00369000
         DS    CL3       reserved                                       00370000
AMDGLI_LEN EQU *-AMDGLI                                                 00371000
.L0011   ANOP                                                           00372000
         AIF   ('&AMDPATH' EQ 'NO').L0015                               00373000
         AIF   ('&DSECT' EQ 'YES').L0016                                00374000
         AIF   ('&AMDPATH' NE 'YES').L0015                              00375000
.L0016   ANOP                                                           00376000
*                                                                       00377000
* ********************************************************************  00378000
* *                                                                  *  00379000
* *               Data Record(s) for IXCMG TYPE=PATH                 *  00380000
* *                                                                  *  00381000
* ********************************************************************  00382000
*                                                                       00383000
*                                                                       00384000
         AIF   ('&DSECT' EQ 'YES').L0017                                00385000
AMDPATH  DS    0F        Path activity entry, placed in the data area  *00386000
                         first if requested                             00387000
         AGO   .L0018                                                   00388000
.L0017   ANOP                                                           00389000
AMDPATH  DSECT           Path activity entry, placed in the data area  *00390000
                         first if requested                             00391000
.L0018   ANOP                                                           00392000
AMDPTYPE DS    0B        Indication of type of data                     00393000
AMDPTYPP EQU   X'01'     Indicates path data                            00394000
         ORG   AMDPTYPE+1                                               00395000
         DS    B         Reserved and set to 0                          00396000
AMDPLENT DS    H         Length of a path entry                         00397000
AMDPNAME DS    CL8       System name                                    00398000
AMDPDEV  DS    CL4       Device number in EBCDIC of CTC device for     *00399000
                         signalling path. Blanks if not CTC device.     00400000
AMDPDIR  DS    0X        Direction of path                              00401000
AMDPINB  EQU   X'80'     Inbound path                                   00402000
AMDPOUTB EQU   X'40'     Outbound path                                  00403000
         ORG   AMDPDIR+1                                                00404000
         DS    CL3       Reserved and set to 0                          00405000
AMDPONME DS    CL8       Name of system on other end if known,         *00406000
                         otherwise blanks.                              00407000
AMDPODEV DS    CL4       Device number in EBCDIC on the other end if   *00408000
                         known, otherwise blanks.                       00409000
AMDPFLAG DS    0CL4      Flags                                          00410000
AMDPSTAT DS    0X        Path status                                    00411000
AMDPSTRT EQU   X'80'     Starting                                       00412000
AMDPREST EQU   X'40'     Restarting                                     00413000
AMDPWORK EQU   X'20'     Working                                        00414000
AMDPSTOP EQU   X'10'     Stopping                                       00415000
AMDPLINK EQU   X'08'     Waiting for completion of initial protocol    *00416000
                         used to establish communication link.          00417000
AMDPNOP  EQU   X'04'     Not operational. Path defined to XCF but not  *00418000
                         usable until hardware and/or definition       *00419000
                         problems are resolved                          00420000
AMDPFAIL EQU   X'02'     Stop failed.                                   00421000
AMDPRBLD EQU   X'01'     Rebuilding                                     00422000
         ORG   AMDPSTAT+1                                               00423000
AMDPSTA2 DS    0X        More path status flags                         00424000
AMDPQSCG EQU   X'80'     Quiescing                                      00425000
AMDPQSCD EQU   X'40'     Quiesced                                       00426000
AMDP_NOTVIABLE EQU X'20' ON if path is effectively quiesced. For       *00427000
                         example, no buffer conditions on the inbound  *00428000
                         side.                                          00429000
AMDP_SS_MONITOR EQU X'10' ON if path appears to have the potential to  *00430000
                         be causing sympathy sickness.                  00431000
AMDP_SS_IMPACT EQU X'08' ON if path is contributing to sympathy        *00432000
                         sickness condition.                            00433000
AMDP_STALLED EQU X'04'   ON if I/O transfer does not seem to be making *00434000
                         progress.                                      00435000
         ORG   AMDPSTA2+1                                               00436000
         DS    CL2       Reserved and set to 0                          00437000
AMDPMRET DS    F         Path retry limit                               00438000
AMDP#RET DS    F         Current path retry count                       00439000
AMDP#RST DS    F         Cumulative number of restarts                  00440000
AMDPMXMS DS    F         Path maximum message limit. This value is the *00441000
                         customer specified value for the number of 1K *00442000
                         byte blocks of message buffer space           *00443000
                         associated with this signalling path. For an  *00444000
                         inbound path, this is the maximum amount of   *00445000
                         buffer space that can be used by the path.    *00446000
                         For an outbound path, this is the amount of   *00447000
                         buffer space contributed by this path to the  *00448000
                         total buffer space available for sending      *00449000
                         messages to the system on the other end using  00450000
*                        the transport class to which this path is     *00451000
                         assigned.                                      00452000
AMDP#SIG DS    F         For an outbound (inbound) path, the total     *00453000
                         number of signals sent (received) over the    *00454000
                         path. N/A for structure summary (Hardware     *00455000
                         type 2)                                        00456000
AMDP#ACT DS    0F        For an outbound path, the current number of   *00457000
                         signals pending transfer on the path. N/A for *00458000
                         structure summary (Hardware type 2)            00459000
AMDP#IBR DS    F         For an inbound path, the total number of      *00460000
                         times a request for a new message buffer was  *00461000
                         refused due to the maximum message limit for  *00462000
                         the path. N/A for structure summary (Hardware *00463000
                         type 2)                                        00464000
AMDP#SUS DS    F         For an outbound path, the total number of     *00465000
                         signal requests satisfied by this path while  *00466000
                         not busy. For an inbound path, reserved and   *00467000
                         set to 0. N/A for structure summary (Hardware *00468000
                         type 2)                                        00469000
AMDP#APP DS    0F        For an outbound path, the total number of     *00470000
                         signal requests satisfied by this path while  *00471000
                         busy. N/A for structure summary (Hardware     *00472000
                         type 2)                                        00473000
AMDPIOXT DS    F         For an inbound path, the average I/O transfer *00474000
                         time, expressed in microseconds, for the most *00475000
                         recently received signals. Zero if not        *00476000
                         available (no recent signals or sending       *00477000
                         system does not provide the necessary data).  *00478000
                         'FFFFFFFF'x if overflow (implies average      *00479000
                         exceeds approximately 35 minutes). N/A for    *00480000
                         structure summary (Hardware type 2)            00481000
AMDP#USE DS    F         Count of the current number of 1K byte blocks *00482000
                         of message buffer space in use by this        *00483000
                         signalling path. N/A for structure summary    *00484000
                         (Hardware type 2)                              00485000
AMDPMGRS DS    F         Measurement Gatherer Reset Data indicator,    *00486000
                         changes when counts for this path entry have  *00487000
                         been reset. Use this token to determine       *00488000
                         whether or not the data collected from two    *00489000
                         different invocations of the IXCMG service    *00490000
                         are comparable. If the token is the same for  *00491000
                         both sets of data, it makes sense to compare  *00492000
                         the data. If the token is different, the two  *00493000
                         sets of data are not comparable since they    *00494000
                         refer to two different instances of the        00495000
*                        indicated signalling path.                     00496000
AMDPTCN  DS    CL8       Transport Class Name. For an outbound path,   *00497000
                         the class to which the path is assigned. For  *00498000
                         an inbound path, blanks if AMDALEVEL<=1. For  *00499000
                         AMDALEVEL>1, the class to which the outbound  *00500000
                         side of the path is assigned, blanks if not   *00501000
                         known.                                         00502000
AMDPPHDT DS    F         Type of hardware being used as the transport  *00503000
                         mechanism for the signalling path. See        *00504000
                         AMHDTxxx constants.                            00505000
AMDPPHDD DS    CL32      Path hardware descriptor. See AMxxxHDD        *00506000
                         mappings below.                                00507000
AMDPATH_LEN EQU *-AMDPATH                                               00508000
.L0015   ANOP                                                           00509000
         AIF   ('&AMDPATH1' EQ 'NO').L0019                              00510000
         AIF   ('&DSECT' EQ 'YES').L001A                                00511000
         AIF   ('&AMDPATH1' NE 'YES').L0019                             00512000
AMDPATH1 DS    0F        Path activity entry, returned when            *00513000
                         AMDALEVEL>0 specified on IXCMG.                00514000
         AGO   .L001B                                                   00515000
.L001A   ANOP                                                           00516000
AMDPATH1 DSECT           Path activity entry, returned when            *00517000
                         AMDALEVEL>0 specified on IXCMG.                00518000
.L001B   ANOP                                                           00519000
         DS    CL120     Mapped by AMDPATH                              00520000
AMDPATH1_BUFFLEN DS F    Maximum number of bytes of message data that  *00521000
                         will fit into the signal buffers that are     *00522000
                         currently used by the signalling path. Zero   *00523000
                         if signal buffers are not relevant to the     *00524000
                         path. N/A for structure summary (Hardware     *00525000
                         type 2)                                        00526000
AMDPATH1_TRANSFERRATE DS F For an outbound path, transfer rate value   *00527000
                         expressed in microseconds, that was last      *00528000
                         reported by the inbound side of the path.     *00529000
                         Zero if not available (no recent signals or   *00530000
                         sending system does not provide the necessary *00531000
                         data or path is not relevant for signal       *00532000
                         transfers). 'FFFFFFFF'x if overflow (implies  *00533000
                         average exceeds approximately 35 minutes).    *00534000
                         N/A for inbound paths. N/A for structure      *00535000
                         summary (Hardware type 2)                      00536000
AMDPATH1_#PENDINGDELIVERY DS F For an inbound path, the number of      *00537000
                         signal buffers currently engaged in some      *00538000
                         phase of delivering a message that was        *00539000
                         received over the path. N/A for outbound      *00540000
                         paths. N/A for structure summary (Hardware    *00541000
                         type 2)                                        00542000
AMDPATH1_SIGNAL# DS F    For an outbound path, the signal number       *00543000
                         assigned to the most recent signal queued for *00544000
                         transfer over the path (contrast with         *00545000
                         AMDP#SIG which includes only user signals).   *00546000
                         For an inbound path, the signal number of the *00547000
                         signal that was most recently received. These *00548000
                         numbers are not necessarily ever increasing.  *00549000
                         N/A for structure summary (Hardware type 2)    00550000
         DS    CL52      Reserved for future use                        00551000
AMDPATH1_LEN EQU *-AMDPATH1                                             00552000
.L0019   ANOP                                                           00553000
         AIF   ('&AMDPATH2' EQ 'NO').L001C                              00554000
         AIF   ('&DSECT' EQ 'YES').L001D                                00555000
         AIF   ('&AMDPATH2' NE 'YES').L001C                             00556000
AMDPATH2 DS    0D        Path activity entry, returned when            *00557000
                         AMDALEVEL=4 specified on IXCMG.                00558000
         AGO   .L001E                                                   00559000
.L001D   ANOP                                                           00560000
AMDPATH2 DSECT           Path activity entry, returned when            *00561000
                         AMDALEVEL=4 specified on IXCMG.                00562000
.L001E   ANOP                                                           00563000
         DS    CL188     Mapped by AMDPATH1                             00564000
         DS    CL4       Reserved for alignment                         00565000
AMDPATH2_NOINBUFTIMESUM DS FL8 Total time (in microseconds) the path   *00566000
                         had a no-inbound buffer impact condition       00567000
AMDPATH2_NOINBUFTIMESSQ DS FL8 Sum of squared microseconds for each    *00568000
                         no-inbound-buffer impact conditions            00569000
AMDPATH2_NOINBUFTIME# DS F The count of no-inbound-buffer impact       *00570000
                         conditions                                     00571000
         DS    CL84      Reserved for furture use                       00572000
*                                                                       00573000
*      ***************************************************************  00574000
*      *                                                             *  00575000
*      * Path usage statistics array. This array describes the       *  00576000
*      * utilization of the path. Each entry in the array describes  *  00577000
*      * utilization as a percentage of the maximum capacity. Any    *  00578000
*      * remaining time not described by this array can be considered*  00579000
*      * time the path was not utilized at all (i.e. 0% utilized).   *  00580000
*      *                                                                00581000
*      *                                                             *  00582000
*      ***************************************************************  00583000
*                                                                       00584000
*                                                                       00585000
AMDPATH2_USAGESTATS DS 0CL32                                            00586000
AMDPATH2_USETIMESUM DS FL8 Total time (in microseconds) path was in    *00587000
                         use at the indicated percent utilization       00588000
AMDPATH2_USETIMESSQ DS FL8 Sum of squared microseconds path was in use *00589000
                         at the indicated utilization                   00590000
AMDPATH2_USETIME# DS F   Count of times the path was in use at the     *00591000
                         indicated percent utilization                  00592000
AMDPATH2_USESIGCNT DS F  Total number of signals sent for this usage   *00593000
                         entry                                          00594000
AMDPATH2_USEPERCENT DS F Percent utilization this entry represents     *00595000
                         (e.g. 25, 50, etc)                             00596000
         DS    CL4       Reserved for future use                        00597000
         ORG   AMDPATH2_USAGESTATS+128                                  00598000
         DS    CL4       Reserved for alignment                         00599000
AMDPATH2_LEN EQU *-AMDPATH2                                             00600000
.L001C   ANOP                                                           00601000
         AIF   ('&AMDMPEND' EQ 'NO').L001F                              00602000
         AIF   ('&DSECT' EQ 'YES').L0020                                00603000
         AIF   ('&AMDMPEND' NE 'YES').L001F                             00604000
.L0020   ANOP                                                           00605000
*                                                                       00606000
* ********************************************************************  00607000
* *                                                                  *  00608000
* *               Data Record for IXCMG TYPE=MSGPEND                 *  00609000
* *                                                                  *  00610000
* ********************************************************************  00611000
*                                                                       00612000
*                                                                       00613000
         AIF   ('&DSECT' EQ 'YES').L0021                                00614000
AMDMPEND DS    0F        Pending messages entry                         00615000
         AGO   .L0022                                                   00616000
.L0021   ANOP                                                           00617000
AMDMPEND DSECT           Pending messages entry                         00618000
.L0022   ANOP                                                           00619000
AMDMTYPE DS    0B        Indication of type of data                     00620000
AMDMTYPM EQU   X'02'     Indicates pending message data                 00621000
         ORG   AMDMTYPE+1                                               00622000
         DS    B         Reserved and set to 0                          00623000
AMDMLENT DS    H         Length of a pending message entry              00624000
AMDMDEVN DS    CL4       Device number (EBCDIC) of CTC device for      *00625000
                         signalling path on which message is pending.  *00626000
                         Blanks if not associated with any signalling  *00627000
                         path or not a CTC device.                      00628000
AMDMTOKN DS    BL8       Member token of message sender                 00629000
AMDMASID DS    H         ASID of member sending message                 00630000
AMDMHOME DS    H         Home ASID that initiated message out request   00631000
AMDMTSNM DS    CL8       Name of system that is target of message       00632000
AMDMMSGL DS    F         Length of message which is pending             00633000
AMDMTCN  DS    CL8       Name of transport class selected for          *00634000
                         transferring the message, blanks if class not *00635000
                         yet selected.                                  00636000
AMDMPHDT DS    F         Type of hardware being used as the transport  *00637000
                         mechanism for the signalling path. Indicates  *00638000
                         not applicable if the message is not          *00639000
                         currently pending transfer over a particular  *00640000
                         signalling path.                               00641000
AMDMPHDD DS    CL32      Path hardware descriptor. Not applicable if   *00642000
                         message is not currently pending transfer     *00643000
                         over a particular signalling path. See        *00644000
                         AMxxxHDD mappings below.                       00645000
AMDMPEND_LEN EQU *-AMDMPEND                                             00646000
.L001F   ANOP                                                           00647000
         AIF   ('&AMDSYS' EQ 'NO').L0023                                00648000
         AIF   ('&DSECT' EQ 'YES').L0024                                00649000
         AIF   ('&AMDSYS' NE 'YES').L0023                               00650000
.L0024   ANOP                                                           00651000
*                                                                       00652000
* ********************************************************************  00653000
* *                                                                  *  00654000
* *               Data Record(s) for IXCMG TYPE=SYSTEM               *  00655000
* *                                                                  *  00656000
* ********************************************************************  00657000
*                                                                       00658000
*                                                                       00659000
         AIF   ('&DSECT' EQ 'YES').L0025                                00660000
AMDSYS   DS    0F        System entry. There are two or more system    *00661000
                         entries per remote system (1 inbound entry    *00662000
                         plus 1 outbound entry per transport class).   *00663000
                         One entry per transport class for the local   *00664000
                         system.                                        00665000
         AGO   .L0026                                                   00666000
.L0025   ANOP                                                           00667000
AMDSYS   DSECT           System entry. There are two or more system    *00668000
                         entries per remote system (1 inbound entry    *00669000
                         plus 1 outbound entry per transport class).   *00670000
                         One entry per transport class for the local   *00671000
                         system.                                        00672000
.L0026   ANOP                                                           00673000
AMDSYTYP DS    0B        Indication of type of data                     00674000
AMDSYTYE EQU   X'04'     Indicates system data                          00675000
         ORG   AMDSYTYP+1                                               00676000
         DS    B         Reserved and set to 0                          00677000
AMDSYLEN DS    H         Length of system entry                         00678000
AMDSYNME DS    CL8       System name, blanks if not known               00679000
AMDSYDIR DS    0X        Direction                                      00680000
AMDSYIN  EQU   X'80'     Inbound                                        00681000
AMDSYOUT EQU   X'40'     Outbound                                       00682000
AMDSYLCL EQU   X'20'     Local                                          00683000
         ORG   AMDSYDIR+1                                               00684000
         DS    CL3       Reserved and set to 0                          00685000
AMDSYPTH DS    F         Current number of paths in service. If local  *00686000
                         entry, set to 0. If outbound entry, count is  *00687000
                         for indicated transport class.                 00688000
AMDSYBSY DS    F         Total number of times a no buffer condition   *00689000
                         occurred. Subject to wrapping. If local or    *00690000
                         outbound entry, count is for indicated        *00691000
                         transport class.                               00692000
AMDSYNOP DS    F         Total number of times a no path condition     *00693000
                         occurred. Subject to wrapping. If local       *00694000
                         entry, set to 0. If outbound entry, count is  *00695000
                         for indicated transport class.                 00696000
AMDSYMXB DS    F         Current maximum number of 1K byte blocks of   *00697000
                         message buffer space permitted for system. If *00698000
                         local or outbound entry, count is for         *00699000
                         indicated transport class.                     00700000
AMDSYUSE DS    F         Current number of 1K byte blocks of message   *00701000
                         buffer space in use on system. If local or    *00702000
                         outbound system entry, count is for indicated *00703000
                         transport class.                               00704000
AMDSYNUM DS    F         System Token. Changes when all counts for the *00705000
                         system named by AMDSYNME have been reset. Use *00706000
                         this token to determine whether or not the    *00707000
                         data collected from two different invocations *00708000
                         of the IXCMG service are comparable. If the   *00709000
                         token is the same for both sets of data, it   *00710000
                         makes sense to compare the data. If the token *00711000
                         is different, the two sets of data are not    *00712000
                         comparable since they refer to two different  *00713000
                         instances of the named system.                 00714000
AMDSYBIG DS    F         Total number of messages sent whose length    *00715000
                         exceeded the buffer size that supports the    *00716000
                         defined transport class length. Zero if       *00717000
                         inbound entry. Subject to wrapping.            00718000
AMDSYFIT DS    F         Total number of messages sent whose length    *00719000
                         fit the buffer size that supports the defined *00720000
                         transport class length. Zero if inbound       *00721000
                         entry. Subject to wrapping.                    00722000
AMDSYSML DS    F         Total number of messages sent whose length    *00723000
                         was smaller than buffer size that supports    *00724000
                         the defined transport class length. Zero if   *00725000
                         inbound entry. Subject to wrapping.            00726000
AMDSYOVR DS    F         Total number of messages sent whose length    *00727000
                         exceeded the buffer size for which the        *00728000
                         signalling service was optimized. Zero if     *00729000
                         inbound entry. Subject to wrapping.            00730000
AMDSYTCL DS    F         Length of longest message that fits the       *00731000
                         buffer size that supports the defined         *00732000
                         transport class length. Zero if inbound       *00733000
                         entry.                                         00734000
AMDSYTCN DS    CL8       Transport Class Name to which the data        *00735000
                         applies. Blanks if inbound entry.              00736000
AMDSYGRS DS    F         Measurement Gatherer Reset Data indicator,    *00737000
                         changes when counts for the transport class   *00738000
                         named by AMDSYTCN have been reset. Note that  *00739000
                         if AMDSYNUM field has changed, then counts    *00740000
                         have been reset even though AMDSYGRS may not  *00741000
                         have changed. Zero if inbound entry. Use this *00742000
                         token to determine whether or not the data    *00743000
                         collected from two different invocations of   *00744000
                         the IXCMG service are comparable. If the      *00745000
                         token is the same for both sets of data, it    00746000
*                        makes sense to compare the data. If the token *00747000
                         is different, the two sets of data are not    *00748000
                         comparable since they refer to two different  *00749000
                         instances of the indicated transport class    *00750000
                         definition                                     00751000
AMDSYSMX DS    F         Customer defined maxmsg value. Default number *00752000
                         of 1K byte blocks of message buffer space. If *00753000
                         local or outbound entry, count is for         *00754000
                         transport class. This value can be modified   *00755000
                         via SETXCF command.                            00756000
AMDSYS_LEN EQU *-AMDSYS                                                 00757000
.L0023   ANOP                                                           00758000
         AIF   ('&AMDSYS1' EQ 'NO').L0027                               00759000
         AIF   ('&DSECT' EQ 'YES').L0028                                00760000
         AIF   ('&AMDSYS1' NE 'YES').L0027                              00761000
AMDSYS1  DS    0F        System entry. This is the mapping to use for  *00762000
                         system data when the IXCMG service is invoked *00763000
                         with AMDALEVEL >= 1. NOTE: These records are  *00764000
                         variable length. AMDSYLEN *must* be used to   *00765000
                         increment to the next AMDSYS1 entry.           00766000
         AGO   .L0029                                                   00767000
.L0028   ANOP                                                           00768000
AMDSYS1  DSECT           System entry. This is the mapping to use for  *00769000
                         system data when the IXCMG service is invoked *00770000
                         with AMDALEVEL >= 1. NOTE: These records are  *00771000
                         variable length. AMDSYLEN *must* be used to   *00772000
                         increment to the next AMDSYS1 entry.           00773000
.L0029   ANOP                                                           00774000
AMDSYS1F DS    0CL112                                                   00775000
         DS    CL76      This area is mapped by AMDSYS as usual.        00776000
         DS    CL32      Reserved.                                      00777000
AMDSYS1_#MSGSIZES DS F   Number of entries in the AMDSYS1_MsgSizes     *00778000
                         array. Could be zero.                          00779000
AMDSYS1V DS    0C                                                       00780000
AMDSYS1_MSGSIZES DS 0CL16 Array of msg size data                        00781000
AMDSYS1_BUFFLEN DS F     maximum number of bytes of message data that  *00782000
                         fit in the message buffer                      00783000
AMDSYS1_SIGNALCNT DS F   Number of signals that could have used a      *00784000
                         signal buffer of the indicated size. Subject  *00785000
                         to wrapping.                                   00786000
         DS    CL8       Reserved.                                      00787000
AMDSYS1_LEN EQU *-AMDSYS1                                               00788000
.L0027   ANOP                                                           00789000
         AIF   ('&AMDSD' EQ 'NO').L002A                                 00790000
         AIF   ('&DSECT' EQ 'YES').L002B                                00791000
         AIF   ('&AMDSD' NE 'YES').L002A                                00792000
.L002B   ANOP                                                           00793000
*                                                                       00794000
* ********************************************************************  00795000
* *                                                                  *  00796000
* *                Data Record for IXCMG TYPE=SRCDST                 *  00797000
* *                                                                  *  00798000
* ********************************************************************  00799000
*                                                                       00800000
*                                                                       00801000
         AIF   ('&DSECT' EQ 'YES').L002C                                00802000
AMDSD    DS    0F        Source/destination entry, one per member.      00803000
         AGO   .L002D                                                   00804000
.L002C   ANOP                                                           00805000
AMDSD    DSECT           Source/destination entry, one per member.      00806000
.L002D   ANOP                                                           00807000
AMDSTYPE DS    0B        Indication of type of data                     00808000
AMDSTYPS EQU   X'08'     Indicates source/destination data              00809000
         ORG   AMDSTYPE+1                                               00810000
         DS    B         Reserved and set to 0                          00811000
AMDSLENT DS    H         Length of a source/destination entry           00812000
AMDSGRP  DS    CL8       Eight byte group name                          00813000
AMDSMEM  DS    CL16      Member name                                    00814000
AMDSSCNT DS    F         Total number of signals sent by the member     00815000
AMDSRCNT DS    F         Total number of signals received by the       *00816000
                         member                                         00817000
AMDSMGRS DS    F         Measurement Gatherer Reset Data indicator,    *00818000
                         changes when counts for this member entry     *00819000
                         have been reset. Use this token to determine  *00820000
                         whether or not the data collected from two    *00821000
                         different invocations of the IXCMG service    *00822000
                         are comparable. If the token is the same for  *00823000
                         both sets of data, it makes sense to compare  *00824000
                         the data. If the token is different, the two  *00825000
                         sets of data are not comparable since they    *00826000
                         refer to two different instances of the        00827000
*                        indicated member.                              00828000
AMDSSNAM DS    CL8       Name of system on which member resides         00829000
AMDSD_LEN EQU  *-AMDSD                                                  00830000
.L002A   ANOP                                                           00831000
         AIF   ('&AMDMEM' EQ 'NO').L002E                                00832000
         AIF   ('&DSECT' EQ 'YES').L002F                                00833000
         AIF   ('&AMDMEM' NE 'YES').L002E                               00834000
.L002F   ANOP                                                           00835000
*                                                                       00836000
* ********************************************************************  00837000
* *                                                                  *  00838000
* *               Data Record(s) for IXCMG TYPE=MEMBER               *  00839000
* *                                                                  *  00840000
* ********************************************************************  00841000
*                                                                       00842000
*                                                                       00843000
         AIF   ('&DSECT' EQ 'YES').L0030                                00844000
AMDMEM   DS    0F        Member data entry                              00845000
         AGO   .L0031                                                   00846000
.L0030   ANOP                                                           00847000
AMDMEM   DSECT           Member data entry                              00848000
.L0031   ANOP                                                           00849000
AMDMEM_HDR DS  0CL268                                                   00850000
AMDMEM_TYPE DS 0B        Indicates type of data                         00851000
AMDMEM_TYPEMEM EQU X'10' Indicates member data                          00852000
         ORG   AMDMEM_TYPE+1                                            00853000
         DS    B         Reserved and set to 0                          00854000
AMDMEM_LENGTH DS H       Number of bytes of data returned in this      *00855000
                         entry. CAUTION: records are variable length   *00856000
                         since a variable number of AMDMEMDI data      *00857000
                         items may be returned.                         00858000
AMDMEM_GROUPNAME DS CL8  XCF group name                                 00859000
AMDMEM_MEMBERNAME DS CL16 XCF Member name                               00860000
AMDMEM_JOBNAME DS CL8    Member's jobname                               00861000
AMDMEM_SYSNAME DS CL8    Name of system on which member resides         00862000
AMDMEM_MEMBERTOKEN DS BL8 XCF member token for the indicated member.   *00863000
                         Use this token to determine whether or not    *00864000
                         the data collected from two different         *00865000
                         invocations of the IXCMG service are          *00866000
                         comparable. If the token is the same for both *00867000
                         sets of data, it makes sense to compare the   *00868000
                         data. If the token is different, the two sets *00869000
                         of data are not comparable since they refer   *00870000
                         to two different instances of the indicated   *00871000
                         member.                                        00872000
AMDMEM_SYSTOKEN DS F     XCF system token for the system where the     *00873000
                         member resides.                                00874000
AMDMEM_EXITSDEFINED DS 0B User exits supplied at join time.             00875000
AMDMEM_HASMSGEXIT EQU X'08' ON if the member supplied a MSGEXIT        *00876000
                         routine when it invoked IXCJOIN to join its   *00877000
                         group. The member is capable of receiving     *00878000
                         messages. Valid for AMDALEVEL > 1.             00879000
AMDMEM_HASGRPEXIT EQU X'04' ON if the member supplied a GRPEXIT        *00880000
                         routine when it invoked IXCJOIN to join its   *00881000
                         group. The member is capable of receiving     *00882000
                         notifications about changes in the            *00883000
                         operational states of other members in the    *00884000
                         group or systems in the sysplex. Valid for    *00885000
                         AMDALEVEL > 1.                                 00886000
AMDMEM_HASNOTIFYEXIT EQU X'02' ON if the member supplied a NOTIFYEXIT  *00887000
                         routine when it invoked IXCJOIN to join its   *00888000
                         group. The member is capable of receiving     *00889000
                         message notifications. Valid for AMDALEVEL >  *00890000
                         1.                                             00891000
AMDMEM_HASSTATEXIT EQU X'01' ON if the member supplied a STATEXIT      *00892000
                         routine when it invoked IXCJOIN to join its   *00893000
                         group. This allows XCF to monitor the         *00894000
                         member's status. Valid for AMDALEVEL > 1.      00895000
         ORG   AMDMEM_EXITSDEFINED+1                                    00896000
         DS    CL1       reserved                                       00897000
AMDMEM_ASID DS H         Member's address space                         00898000
AMDMEM_MSGOACCEPTED DS F Cumulative count of messages accepted for     *00899000
                         delivery by the IXCMSGO service. Subject to   *00900000
                         wrapping.                                      00901000
AMDMEM_MSGONOBUFFER DS F Total number of messages rejected by the      *00902000
                         IXCMSGO service for lack of a message buffer. *00903000
                         Subject to wrapping.                           00904000
AMDMEM_MSGIRECEIVED DS F Cumulative count of messages that were to be  *00905000
                         delivered to the member. Includes both local  *00906000
                         and remote messages. Subject to wrapping.      00907000
AMDMEM_MSGICURRWORKITEMS DS F The number of signal work items          *00908000
                         currently queued for processing. Usually a    *00909000
                         work item represents a message that is to be  *00910000
                         delivered, but they could include internal    *00911000
                         XCF work that needs to be performed.           00912000
AMDMEM_MSGITRANSFERS DS F Cumulative count of remote signals that were *00913000
                         received on behalf of the member. Subject to  *00914000
                         wrapping.                                      00915000
AMDMEM_MSGOTRANSFERTIME DS F For inbound remote signals, the average   *00916000
                         message transfer time, expressed in           *00917000
                         microseconds, for the most recently received  *00918000
                         signals. Zero if not available (no recent     *00919000
                         signals or sending system does not provide    *00920000
                         the necessary data). 'FFFFFFFF'x if overflow  *00921000
                         (implies average exceeds approximately 35     *00922000
                         minutes). Message transfer is measured from   *00923000
                         the time that XCF accepts delivery of the     *00924000
                         message on the sending system to the time      00925000
*                        that (each signal for the) message arrives on *00926000
                         the target system and can be                  *00927000
                         scheduled/queued/collected for delivery to    *00928000
                         the target member.                             00929000
AMDMEM_GRPXRECEIVED DS F Cumulative count of group events that were to *00930000
                         be delivered to the member. Subject to        *00931000
                         wrapping.                                      00932000
AMDMEM_GRPXCURRWORKITEMS DS F The number of group work items currently *00933000
                         queued for processing.                         00934000
AMDMEM_TODWHENCOLLECTED DS CL8 TOD when started data gathering. Valid  *00935000
                         for AMDALEVEL > 0.                             00936000
AMDMEM_FLAGS DS 0CL2                                                    00937000
AMDMEM_FLAGS1 DS 0CL1    first byte of flags                            00938000
AMDMEM_STALLED EQU X'80' ON if the member is considered stalled. Valid *00939000
                         for AMDALEVEL > 0.                             00940000
AMDMEM_SYMPATHYSICKNESS EQU X'40' ON if member appears to be           *00941000
                         contributing to sympathy sickness in the      *00942000
                         sysplex. Valid for AMDALEVEL > 0.              00943000
AMDMEM_DEACTIVATING EQU X'20' ON if active member being deactivated.   *00944000
                         Member exit routines will not be driven.      *00945000
                         Valid for AMDALEVEL > 0.                       00946000
AMDMEM_SS_TERMINATING EQU X'10' ON if member termination was initiated *00947000
                         by SFM in an attempt to relieve sympathy      *00948000
                         sickness. Valid for AMDALEVEL > 0.             00949000
AMDMEM_MEMSTALLENABLED EQU X'08' ON if XCF is to terminate the member  *00950000
                         that appears to be causing sympathy sickness. *00951000
                         Valid for AMDALEVEL > 1.                       00952000
AMDMEM_CONFIRMEDSUM EQU X'04' ON if the member is in a status update   *00953000
                         missing condition confirmed by its status     *00954000
                         exit. Valid for AMDALEVEL > 1.                 00955000
AMDMEM_CONFIRMEDIMPAIRED EQU X'02' ON if the member is considered      *00956000
                         impaired because its status exit continuously *00957000
                         reports bad status. Valid for AMDALEVEL > 1.   00958000
AMDMEM_DEEMEDIMPAIRED EQU X'01' ON if the member is considered         *00959000
                         impaired because all of its exits are         *00960000
                         stalled. Valid for AMDALEVEL > 1.              00961000
         ORG   AMDMEM_FLAGS1+1                                          00962000
AMDMEM_FLAGS2 DS 0CL1    second byte of flags                           00963000
AMDMEM_MESSAGEISOLATED EQU X'80' ON if the member is                   *00964000
                         "message isolated". If so, XCF will reject or *00965000
                         delay msgout requests targeted to this        *00966000
                         member. Valid for AMDALEVEL > 2.               00967000
AMDMEM_IMPACTFULMISO EQU X'40' ON if the message isolation of this     *00968000
                         member appears to be impacting msgout         *00969000
                         requests targeted to this member (XCF has     *00970000
                         rejected or delayed messages). Due to various *00971000
                         latencies, the senders could continue to be   *00972000
                         impacted even after the subject member is no  *00973000
                         longer isolated. Similarly, it might appear   *00974000
                         that senders are still being impacted even    *00975000
                         after they have recognized that the subject   *00976000
                         member is no longer isolated. Valid for        00977000
*                        AMDALEVEL > 2.                                 00978000
AMDMEM_IMPACTEDBYMISO EQU X'20' ON if subject member currently appears *00979000
                         to be impacted by one or more members who     *00980000
                         currently appear to be "message isolated".    *00981000
                         Implies one or more messages sent by the      *00982000
                         subject member to the isolated member(s) have *00983000
                         been delayed and/or rejected. Valid for       *00984000
                         AMDALEVEL > 2.                                 00985000
         ORG   AMDMEM_FLAGS+2                                           00986000
         DS    CL2       Reserved                                       00987000
AMDMEM_MSGICURRWIIOBUFF DS F Number of currently queued work items     *00988000
                         consuming an XCF signal buffer. Valid for     *00989000
                         AMDALEVEL > 0.                                 00990000
AMDMEM_MSGICURRWIDRBUFF DS F Number of currently queued work items     *00991000
                         consuming a DREF XCF buffer. Valid for        *00992000
                         AMDALEVEL > 0.                                 00993000
AMDMEM_MSGICURRWIPGBUFF DS F Number of currently queued work items     *00994000
                         consuming a pageable XCF buffer. Valid for    *00995000
                         AMDALEVEL > 0.                                 00996000
AMDMEM_MSTCURRMSGOSENDPEND DS F Number of managed msgout requests      *00997000
                         currently in pending state because a send has *00998000
                         not completed. Valid for AMDALEVEL > 0.        00999000
AMDMEM_MSTCURRMSGORESPPEND DS F Number of managed msgout requests      *01000000
                         currently in pending state because an         *01001000
                         expected response has not been received (no   *01002000
                         sends pending). Valid for AMDALEVEL > 0.       01003000
AMDMEM_MSTCURRMSGOCOMPLETED DS F Number of managed msgout requests     *01004000
                         currently in completed state. Valid for       *01005000
                         AMDALEVEL > 0.                                 01006000
AMDMEM_MSTCURRMSGOSAVED DS F Number of managed msgout requests         *01007000
                         currently in saved state. Valid for AMDALEVEL *01008000
                         > 0.                                           01009000
AMDMEM_MSTCURRMSGISAVED DS F Number of managed msgin requests          *01010000
                         currently in saved state. Valid for AMDALEVEL *01011000
                         > 0.                                           01012000
AMDMEM_MSGICURRWICRITMSG DS F Number of currently queued critical      *01013000
                         messages. Valid for AMDALEVEL > 1.             01014000
AMDMEM_MEMBERFUNCTION DS CL24 Member FUNCTION as specified on IXCJOIN. *01015000
                         Valid for AMDALEVEL > 1.                       01016000
AMDMEM_TODWHENJOINED DS CL8 TOD when member became active. Valid for   *01017000
                         AMDALEVEL > 1.                                 01018000
AMDMEM_MEMSTALLTIME DS H SFM MEMSTALLTIME value used to determine how  *01019000
                         many seconds the system will allow the        *01020000
                         sympathy sickness condition to persist before *01021000
                         it terminates the member. Valid for AMDALEVEL *01022000
                         > 1.                                           01023000
AMDMEM_TODWHENSTATUSCHANGED DS CL8 TOD when a member status change was *01024000
                         detected or confirmed by the status monitor.  *01025000
                         Valid if member requested status monitoring   *01026000
                         and AMDALEVEL > 1.                             01027000
AMDMEM_TODWHENSTATUSCHECKED DS CL8 TOD when the member status monitor  *01028000
                         last checked the member status. Valid if      *01029000
                         member requested status monitoring and        *01030000
                         AMDALEVEL > 1.                                 01031000
         DS    CL58      Reserved                                       01032000
AMDMEM_MSGODELAYEDFORMISO DS F Total number of msgout requests from    *01033000
                         the subject member that were delayed due to   *01034000
                         message isolation of the target member.       *01035000
                         Subject to wrap. Valid for AMDALEVEL > 2.      01036000
AMDMEM_MSGOREJECTEDFORMISO DS F Total number of msgout requests from   *01037000
                         the subject member that were rejected due to  *01038000
                         message isolation of the target member.       *01039000
                         Subject to wrap. Valid for AMDALEVEL > 2.      01040000
AMDMEM_#VMDI DS F        Number of variable length member data items   *01041000
                         (AMDMEMDI1) returned for this member data     *01042000
                         entry. Valid for AMDALEVEL > 2                 01043000
AMDMEM_OVMDI DS F        Offset relative to AMDMEM to locate variable  *01044000
                         length member data items (AMDMEMDI1). Valid   *01045000
                         for AMDALEVEL > 2                              01046000
AMDMEM_#DATAITEMS DS F   Number of data items in the following array    01047000
AMDMEM_DATAITEMS DS CL64 Array of data items. Each entry is mapped by  *01048000
                         AMDMEMDI.                                      01049000
AMDMEM_LEN EQU *-AMDMEM                                                 01050000
.L002E   ANOP                                                           01051000
         AIF   ('&AMDMEMDI' EQ 'NO').L0032                              01052000
         AIF   ('&DSECT' EQ 'YES').L0033                                01053000
         AIF   ('&AMDMEMDI' NE 'YES').L0032                             01054000
AMDMEMDI DS    0F        Member data item                               01055000
         AGO   .L0034                                                   01056000
.L0033   ANOP                                                           01057000
AMDMEMDI DSECT           Member data item                               01058000
.L0034   ANOP                                                           01059000
AMDMEMDI_HDR DS 0CL4                                                    01060000
AMDMEMDI_DATATYPE DS X   Indicates the format of AMDMEMDI_Data. Your   *01061000
                         program should skip data items whose type it  *01062000
                         does not recognize. New data types may be     *01063000
                         added at any time.                             01064000
AMDMEMDI_SUBJECT DS X    Subject of the data item                       01065000
AMDMEMDI_FLAGS DS 0B                                                    01066000
AMDMEMDI_STALLED EQU X'80' ON if data item could be related to a hang  *01067000
                         condition.                                     01068000
         ORG   AMDMEMDI_FLAGS+1                                         01069000
         DS    CL1       Reserved                                       01070000
AMDMEMDI_DATA DS 0CL60                                                  01071000
         ORG   AMDMEMDI_DATA                                            01072000
AMDMEMDI_EXITROUTINES DS 0CL60 DataType 001: exits                      01073000
AMDMEMDIXR_TOKEN DS A    exit routine token                             01074000
AMDMEMDIXR_FUNCTIONCODE DS CL2 EBCDIC eyecatcher to indicate function  *01075000
                         to be performed.                               01076000
         DS    CL2       Reserved                                       01077000
AMDMEMDIXR_TODWHENCALLED DS CL8 TOD when exit was called. Hex zero if  *01078000
                         exit not yet called.                           01079000
AMDMEMDIXR_TODWHENRETURNED DS CL8 TOD when exit returned. Hex zero if  *01080000
                         exit not yet returned.                         01081000
AMDMEMDIXR_PROCESSSTAGE DS F If exit not yet returned, identifies      *01082000
                         current stage of processing.                   01083000
         DS    CL32      reserved                                       01084000
         ORG   AMDMEMDI_DATA                                            01085000
AMDMEMDI_WORKITEM DS 0CL60 DataType 002: work items                     01086000
AMDMEMDIWI_TOKEN DS A    work item token                                01087000
AMDMEMDIWI_FUNCTIONCODE DS CL2 EBCDIC eyecatcher to indicate function  *01088000
                         to be performed.                               01089000
         DS    CL2       Reserved                                       01090000
AMDMEMDIWI_TODWHENCREATED DS CL8 TOD when work item was created.        01091000
AMDMEMDIWI_ITEM# DS F    work item number                               01092000
         DS    CL40      reserved                                       01093000
         ORG   AMDMEMDI_DATA                                            01094000
AMDMEMDI_MSGSIZES DS 0CL40 DataType 003: msg sizes                      01095000
AMDMEMDIMS_BUFFLEN DS F  maximum number of bytes of message data that  *01096000
                         fit in the message buffer                      01097000
AMDMEMDIMS_MSGOREMOTESENT DS F Number of remote signals sent that      *01098000
                         could have used a signal buffer of this size. *01099000
                         Subject to wrapping.                           01100000
AMDMEMDIMS_MSGOLOCALSENT DS F Number of local signals sent that could  *01101000
                         have used a signal buffer of this size.       *01102000
                         Subject to wrapping.                           01103000
         DS    CL28      reserved                                       01104000
         ORG   AMDMEMDI_DATA                                            01105000
AMDMEMDI_SYMPATHYSICKNESS DS 0CL60 DataType 004: sympathy sickness     *01106000
                         impact. Valid for AMDALEVEL > 0.               01107000
AMDMEMDISS_SYSTEMS DS BL32 Set of systems that appear to be suffering  *01108000
                         from sympathy sickness for which the subject  *01109000
                         member is at least partially responsible. The *01110000
                         i'th bit is ON if the system whose XCF system *01111000
                         slot number is "i" is being impacted.          01112000
AMDMEMDISS_#IMPACTEDBUFFERS DS F Number of I/O Buffers in use by the   *01113000
                         stalled member that could be contributing to  *01114000
                         the sympathy sickness problem.                 01115000
         DS    CL24      reserved                                       01116000
         ORG   AMDMEMDI_DATA                                            01117000
AMDMEMDI_MESSAGETABLE DS 0CL60 DataType 005: message table. Valid for  *01118000
                         AMDALEVEL > 1.                                 01119000
AMDMEMDIMT_CURRSENDPEND DS F Number of requests currently in pending   *01120000
                         state because a send has not completed.        01121000
AMDMEMDIMT_CURRRESPPEND DS F Number of requests currently in pending   *01122000
                         state because an expected response has not    *01123000
                         been received.                                 01124000
AMDMEMDIMT_CURRCOMPLETED DS F Number of requests currently in          *01125000
                         completed state.                               01126000
AMDMEMDIMT_CURRMSGOSAVED DS F Number of message out requests currently *01127000
                         in saved state.                                01128000
AMDMEMDIMT_CURRMSGISAVED DS F Number of message in requests currently  *01129000
                         in saved state.                                01130000
         DS    CL40      reserved                                       01131000
AMDMEMDI_LEN EQU *-AMDMEMDI                                             01132000
.L0032   ANOP                                                           01133000
         AIF   ('&AMDMEMDI1' EQ 'NO').L0035                             01134000
         AIF   ('&DSECT' EQ 'YES').L0036                                01135000
         AIF   ('&AMDMEMDI1' NE 'YES').L0035                            01136000
AMDMEMDI1 DS   0F        Additional member data items. Valid for       *01137000
                         AMDALEVEL > 2                                  01138000
         AGO   .L0037                                                   01139000
.L0036   ANOP                                                           01140000
AMDMEMDI1 DSECT          Additional member data items. Valid for       *01141000
                         AMDALEVEL > 2                                  01142000
.L0037   ANOP                                                           01143000
AMDMEMDI1_HDR DS 0CL8    Same as AMDMEMDI_HDR plus additional          *01144000
                         information                                    01145000
AMDMEMDI1_DATATYPE DS X  Indicates the format of AMDMEMDI1_Data. Your  *01146000
                         program should skip data items whose type it  *01147000
                         does not recognize. New data types may be     *01148000
                         added at any time.                             01149000
AMDMEMDI1_SUBJECT DS X   Subject of the data item                       01150000
AMDMEMDI1_FLAGS DS 0B                                                   01151000
AMDMEMDI1_STALLED EQU X'80' ON if data item could be related to a hang *01152000
                         condition.                                     01153000
         ORG   AMDMEMDI1_FLAGS+1                                        01154000
         DS    CL1       Reserved                                       01155000
AMDMEMDI1_LENGTH DS H    Number of bytes of data returned in this DI1  *01156000
                         entry. CAUTION: records are variable length.  *01157000
                         Number of bytes of data returned vary based   *01158000
                         on AMDMEMDI1_DataType                          01159000
         DS    CL2       Reserved                                       01160000
AMDMEMDI1_DATA DS 0CL76                                                 01161000
         ORG   AMDMEMDI1_DATA                                           01162000
AMDMEMDI1_MSGISOLATED DS 0CL76 DataType 006: member message isolation. *01163000
                         Valid for AMDALEVEL > 2.                       01164000
AMDMEMDIMI_STARTISOLETOD DS CL16 Extended TOD indicating when the most *01165000
                         recent message isolation window for this      *01166000
                         member started. Zero if never isolated.        01167000
AMDMEMDIMI_ENDISOLETOD DS CL16 Extended TOD indicating when a message  *01168000
                         isolation window for this member most         *01169000
                         recently ended. If this ETOD is greater than  *01170000
                         the above StartIsolETOD, the window is        *01171000
                         closed. If less, the window is open. Zero if  *01172000
                         window never closed (or a window was never    *01173000
                         started).                                      01174000
AMDMEMDIMI_MEMISOSEQ# DS F Member specific sequence number that        *01175000
                         identifies the most recent instance of a      *01176000
                         message isolation window.                      01177000
AMDMEMDIMI_SYSTEMSIMPACTEDBYMISO DS BL32 Set of systems that have had  *01178000
                         message-out send requests rejected or delayed *01179000
                         due to the member being message isolated. The *01180000
                         i'th bit is ON if the system whose XCF system *01181000
                         slot number is "i" is being impacted.          01182000
AMDMEMDIMI_SYSISOSEQ# DS F System specific sequence number that        *01183000
                         identifies the most recent instance of a      *01184000
                         message isolation window for the system that  *01185000
                         hosts the member.                              01186000
AMDMEMDIMI_#MISO DS F    The number of times the member has been       *01187000
                         "message isolated".                            01188000
         ORG   AMDMEMDI1_DATA                                           01189000
AMDMEMDI1_SYSTEMIMPACTED DS 0CL76 DataType 007: Sending systems        *01190000
                         impacted by member message isolation. Valid   *01191000
                         for AMDALEVEL > 2.                             01192000
AMDMEMDISI_SYSID DS F    XCF System ID of system on which impacted     *01193000
                         member(s) reside                               01194000
AMDMEMDISI_SYSNAME DS CL8 Name of a system that has had sending of     *01195000
                         signals to the member rejected or delayed due *01196000
                         to a message isolation condition               01197000
AMDMEMDISI_STARTIMPACTETOD DS CL16 ETOD when a message isolation       *01198000
                         window for a member started impacting a       *01199000
                         sending system. This is the ETOD when the     *01200000
                         first send to the member was impacted.         01201000
AMDMEMDISI_ENDIMPACTETOD DS CL16 ETOD when a message isolation window  *01202000
                         for a member impacting a sending system       *01203000
                         ended. This is the ETOD when the impacted     *01204000
                         system received a resume signal indicating    *01205000
                         message traffic to the member can be resumed. *01206000
                         If null, then this means that the impact is   *01207000
                         still active as far as the sending system is  *01208000
                         concerned                                      01209000
AMDMEMDISI_WHENCOLLECTETOD DS CL16 ETOD when the impact data was       *01210000
                         collected on the impacted system               01211000
AMDMEMDISI_#SENDSREJECTED DS F number of send requests rejected on the *01212000
                         impacted system beginning at the              *01213000
                         StartImpactETOD and ending at the             *01214000
                         EndImpactETOD                                  01215000
AMDMEMDISI_#SENDSDELAYED DS F number of send requests delayed on the   *01216000
                         impacted system beginning at the              *01217000
                         StartImpactETOD and ending at the             *01218000
                         EndImpactETOD                                  01219000
AMDMEMDISI_TOT#SENDSREJECTED DS F cumulative number of send requests   *01220000
                         rejected on the impacted system. This can     *01221000
                         span multiple isolation windows.               01222000
AMDMEMDISI_TOT#SENDSDELAYED DS F cumulative number of send requests    *01223000
                         delayed on the impacted system. This can span *01224000
                         multiple isolation windows.                    01225000
AMDMEMDI_XRDATATYPE EQU 1 exit routine                                  01226000
AMDMEMDI_WIDATATYPE EQU 2 work item                                     01227000
AMDMEMDI_MSDATATYPE EQU 3 message sizes                                 01228000
AMDMEMDI_SSDATATYPE EQU 4 sympathy sickness                             01229000
AMDMEMDI_MTDATATYPE EQU 5 message table                                 01230000
AMDMEMDI_MIDATATYPE EQU 6 message isolation                             01231000
AMDMEMDI_SIDATATYPE EQU 7 system impacted                               01232000
AMDMEMDI_NOSUBJECT EQU 0 global subject                                 01233000
AMDMEMDI_GPSUBJECT EQU 1 group services                                 01234000
AMDMEMDI_SISUBJECT EQU 2 signalling services                            01235000
AMDMEMDI_CMSUBJECT EQU 3 critical messages                              01236000
AMDMEMDI_SMSUBJECT EQU 4 status monitor                                 01237000
AMDMEMDI_KNOSTAGE EQU 0  no stage identified                            01238000
AMDMEMDI_KPENDINGSTAGE EQU 1 Processing is pending. For example, SRB   *01239000
                         scheduled but not yet run.                     01240000
AMDMEMDI_KSETUPSTAGE EQU 2 Doing setup work to prepare to do the       *01241000
                         desired processing.                            01242000
AMDMEMDI_KRUNNINGSTAGE EQU 3 In midst of doing the desired processing.  01243000
AMDMEMDI_KFAILEDSTAGE EQU 4 The exit has failed                         01244000
AMDMEMDI_KDEACTIVATEDSTAGE EQU 5 The exit routine has been deactivated *01245000
                         due to errors                                  01246000
*                                                                       01247000
* ********************************************************************* 01248000
**                                                                   ** 01249000
**             Constants for Hardware Descriptor Types               ** 01250000
**                                                                   ** 01251000
****************************************************************        01252000
*                                                                       01253000
*                                                                       01254000
AMHDTNA  EQU   0         Hardware type not applicable, ignore hardware *01255000
                         descriptor data.                               01256000
AMHDTCTC EQU   1         CTC device.                                    01257000
AMHDTSTR EQU   2         CF Structure (summary)                         01258000
AMHDTLST EQU   3         A list within a CF structure                   01259000
AMDMEMDI1_LEN EQU *-AMDMEMDI1                                           01260000
.L0035   ANOP                                                           01261000
         AIF   ('&AMCTCHDD' EQ 'NO').L0038                              01262000
         AIF   ('&DSECT' EQ 'YES').L0039                                01263000
         AIF   ('&AMCTCHDD' NE 'YES').L0038                             01264000
.L0039   ANOP                                                           01265000
*                                                                       01266000
* ********************************************************************* 01267000
**                                                                   ** 01268000
**               Mappings for Hardware Descriptor Data               ** 01269000
**                                                                   ** 01270000
****************************************************************        01271000
*                                                                       01272000
*                                                                       01273000
         AIF   ('&DSECT' EQ 'YES').L003A                                01274000
AMCTCHDD DS    0F        Path hardware descriptor for CTC devices.      01275000
         AGO   .L003B                                                   01276000
.L003A   ANOP                                                           01277000
AMCTCHDD DSECT           Path hardware descriptor for CTC devices.      01278000
.L003B   ANOP                                                           01279000
AMCTCDEV DS    CL4       Device number (EBCDIC)                         01280000
         DS    CL28      Unused, set to zero.                           01281000
AMCTCHDD_LEN EQU *-AMCTCHDD                                             01282000
.L0038   ANOP                                                           01283000
         AIF   ('&AMSTRHDD' EQ 'NO').L003C                              01284000
         AIF   ('&DSECT' EQ 'YES').L003D                                01285000
         AIF   ('&AMSTRHDD' NE 'YES').L003C                             01286000
AMSTRHDD DS    0F        Path hardware descriptor for a CF List        *01287000
                         structure.                                     01288000
         AGO   .L003E                                                   01289000
.L003D   ANOP                                                           01290000
AMSTRHDD DSECT           Path hardware descriptor for a CF List        *01291000
                         structure.                                     01292000
.L003E   ANOP                                                           01293000
AMSTRNAM DS    CL16      Structure name (EBCDIC)                        01294000
AMSTR#AV DS    F         Number of lists that remain available for use *01295000
                         (either as PATHIN or PATHOUT). Zero if list   *01296000
                         structure is considered inoperative.           01297000
AMSTR#OD DS    F         Number of other systems connected to this     *01298000
                         structure that desire to establish signalling *01299000
                         paths in the opposite direction. This system  *01300000
                         is not included in the count. The count is    *01301000
                         zero if the list structure is considered      *01302000
                         inoperative.                                   01303000
AMSTR#LP DS    F         Number of list signalling paths started by    *01304000
                         this system in the indicated direction for    *01305000
                         this list structure. The count includes       *01306000
                         inoperative list paths.                        01307000
         DS    CL4       Unused, set to zero.                           01308000
AMSTRHDD_LEN EQU *-AMSTRHDD                                             01309000
.L003C   ANOP                                                           01310000
         AIF   ('&AMLSTHDD' EQ 'NO').L003F                              01311000
         AIF   ('&DSECT' EQ 'YES').L0040                                01312000
         AIF   ('&AMLSTHDD' NE 'YES').L003F                             01313000
AMLSTHDD DS    0F        Path hardware descriptor for a particular     *01314000
                         list within a CF List structure                01315000
         AGO   .L0041                                                   01316000
.L0040   ANOP                                                           01317000
AMLSTHDD DSECT           Path hardware descriptor for a particular     *01318000
                         list within a CF List structure                01319000
.L0041   ANOP                                                           01320000
AMLSTSTR DS    CL16      Structure name (EBCDIC)                        01321000
AMLSTNUM DS    F         List number                                    01322000
         DS    CL12      Unused, set to zero.                           01323000
AMLSTHDD_LEN EQU *-AMLSTHDD                                             01324000
.L003F   ANOP                                                           01325000
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 01326000
         AIF   ('&LIST' EQ 'YES').P4                                    01327000
.P3      ANOP                                                           01328000
         POP   PRINT                                                    01329000
.P4      ANOP                                                           01330000
.P_EXIT  ANOP                                                           01331000
         MEND                                                           01332000
**/ IXCYAMDA_2:;                                                        01333000
* %IXCYAMDA_INCLUDED = 'YES';                                           01334000
* %DCL ZCBPRINT CHAR EXT;                                               01335000
* %DEACTIVATE ZCBPRINT;                                                 01336000
* %DCL IXCYAMDA_LIST CHAR EXT;                                          01337000
* %DEACTIVATE IXCYAMDA_LIST;                                            01338000
* %IF IXCYAMDA_LIST ^= 'NO' &                                           01339000
*    ZCBPRINT ^= 'NO' %THEN                                             01340000
*   %GOTO IXCYAMDA_3;                                                   01341000
*   @LIST PUSH NOECHO;                                                  01342000
*   @LIST NOASSEMBLE NOECHO;                                            01343000
*   @LIST OFF C NOECHO;                                                 01344000
* %IXCYAMDA_3:;                                                         01345000
*/* Start of PL/X Source                                             */ 01346000
* %IF AMDA_ALET = '' %THEN                                              01347000
*   %AMDA_ALET = '0';                                                   01348000
* %AMDA_VIA='';                                                         01349000
* %IF AMDA_ALET^='0' %THEN                                              01350000
*  %AMDA_VIA='VIA(AMDA_ALET)';                                          01351000
*                                                                       01352000
*                                                                       01353000
* /* IXCMG     Supported AMDALEVELS                              @02A*/ 01354000
* Declare                           /* supported by system       @02A*/ 01355000
*    AmdaLevel000 constant(0),      /* AMDALEVEL 0               @02A*/ 01356000
*    AmdaLevel001 constant(1),      /* AMDALEVEL 1               @02A*/ 01357000
*    AmdaLevel002 constant(2),      /* AMDALEVEL 2               @06A*/ 01358000
*    AmdaLevel003 constant(3),      /* AMDALEVEL 3               @L8A*/ 01359000
*    AmdaLevel004 constant(4),      /* AMDALEVEL 4               @LBA*/ 01360000
*    AmdaLevelMax constant(4);      /* AMDALEVEL max supported,         01361000
*                                      subject to change as new levels  01362000
*                                      are supported             @LBC*/ 01363000
*                                                                       01364000
* Declare                           /* Highest AMDALEVEL supported by   01365000
*                                      indicated data type       @02A*/ 01366000
*    AmdaLevel_PATH    constant(AmdaLevel004), /*                @LBC*/ 01367000
*    AmdaLevel_MSGPEND constant(AmdaLevel000), /*                @02A*/ 01368000
*    AmdaLevel_SYSTEM  constant(AmdaLevel001), /*                @02A*/ 01369000
*    AmdaLevel_SRCDST  constant(AmdaLevel000), /*                @02A*/ 01370000
*    AmdaLevel_MEMBER  constant(AmdaLevel003); /*                @L8C*/ 01371000
*                                                                       01372000
*/********************************************************************/ 01373000
*/*                                                                  */ 01374000
*/*        Header returned in DATAAREA for IXCMG requests that       */ 01375000
*/*          default to GATHERFROM=LOCAL                             */ 01376000
*/*                                                                  */ 01377000
*/********************************************************************/ 01378000
*                                                                       01379000
*   DECLARE                                                             01380000
*     1    AMDAREA BASED AMDA_VIA,  /* Data area for IXCMG requests     01381000
*                                      that return measurement data     01382000
*                                      records.                      */ 01383000
*      2    AMDATLEN FIXED(32),     /* Total length of output data area 01384000
*                                      needed to contain all the        01385000
*                                      requested information.  This     01386000
*                                      length includes the area for     01387000
*                                      the records that were returned   01388000
*                                      on this call.                 */ 01389000
*      2    AMDA#PTH FIXED(32),     /* Number of path entries        */ 01390000
*      2    AMDALPTH FIXED(32),     /* Length of path data           */ 01391000
*      2    AMDAOPTH FIXED(32),     /* Offset to path entries        */ 01392000
*                                                                       01393000
*      2    AMDA#MPE FIXED(32),     /* Number of pending message        01394000
*                                      entries                       */ 01395000
*      2    AMDALMPE FIXED(32),     /* Length of pending message        01396000
*                                      data                          */ 01397000
*      2    AMDAOMPE FIXED(32),     /* Offset to pending message        01398000
*                                      entries                       */ 01399000
*                                                                       01400000
*      2    AMDA#SYS FIXED(32),     /* Number of system entries      */ 01401000
*      2    AMDALSYS FIXED(32),     /* Length of system data         */ 01402000
*      2    AMDAOSYS FIXED(32),     /* Offset to system entries      */ 01403000
*                                                                       01404000
*      2    AMDA#SD  FIXED(32),     /* Number of source/destination     01405000
*                                      entries.                      */ 01406000
*      2    AMDALSD  FIXED(32),     /* Length of source/destination     01407000
*                                      data entries                  */ 01408000
*      2    AMDAOSD  FIXED(32),     /* Offset to source/destination     01409000
*                                      entries.                      */ 01410000
*                                                                       01411000
*      2    AMDA#MUS FIXED(32),     /* Number of member message use     01412000
*                                      summary entries           @L6A*/ 01413000
*      2    AMDALMUS FIXED(32),     /* Length of member message space   01414000
*                                      summary entries           @L6A*/ 01415000
*      2    AMDAOMUS FIXED(32);     /* Offset to member message use     01416000
*                                      summary entries           @L6A*/ 01417000
*                                                                       01418000
*/********************************************************************/ 01419000
*/*                                                                  */ 01420000
*/*      Header returned in DATAAREA for IXCMG requests that:        */ 01421000
*/*        - Specify GATHERFROM=LOCAL                                */ 01422000
*/*        - Specify GATHERFROM=TOKEN                                */ 01423000
*/*                                                                  */ 01424000
*/********************************************************************/ 01425000
*                                                                       01426000
*   DECLARE                                                             01427000
*     1 AMDAGFD BASED AMDA_VIA,     /* Header for data area returned    01428000
*                                      by explicit GATHERFROM=LOCAL     01429000
*                                      or GATHERFROM=TOKEN           */ 01430000
*       3 * char(length(AMDAREA)),  /* This area is mapped by AMDAREA   01431000
*                                      as usual.                 @04A*/ 01432000
*       3 AMDAGFD_Version fixed(8), /* Version of AMDAGFD header @04A*/ 01433000
*       3 * char(1),                /* Reserved                  @04A*/ 01434000
*       3 AMDAGFD_Length fixed(16), /* Length of AMDAGFD header  @04A*/ 01435000
*                                                                       01436000
*       3 AMDAGFD_Retcode fixed,    /* IXCMG return code for the data   01437000
*                                      collection                @04A*/ 01438000
*       3 AMDAGFD_Rsncode fixed,    /* IXCMG reason code for the data   01439000
*                                      collection                @04A*/ 01440000
*       3 AMDAGFD_SysToken fixed(32), /* XCF System ID of system that   01441000
*                                      collected the data        @04A*/ 01442000
*       3 AMDAGFD_SysName char(8),  /* Name of system that collected    01443000
*                                      the data                  @04A*/ 01444000
*       3 AMDAGFD_TOD char(8),      /* TOD when data gathering started. 01445000
*                                      Hex zero if not started or not   01446000
*                                      known.                    @04A*/ 01447000
*       3 * char(3),                /*                           @04A*/ 01448000
*       3 AMDAGFD_AmdaLevel fixed(8), /* AMDALEVEL requested     @04A*/ 01449000
*       3 AMDAGFD_OGLI_Reported fixed(32), /* Offset relative to        01450000
*                                      AMDAGFD to locate the Gatherer   01451000
*                                      Level Info record describing the 01452000
*                                      AMDALEVEL of the returned data   01453000
*                                      records.  Zero if record not     01454000
*                                      provided.                 @04A*/ 01455000
*       3 AMDAGFD_OGLI_Supported fixed(32), /* Offset relative to       01456000
*                                      AMDAGFD to locate the Gatherer   01457000
*                                      Level Info record describing the 01458000
*                                      maximum AMDALEVEL supported by   01459000
*                                      the gathering system for each    01460000
*                                      type of data record.  Zero if    01461000
*                                      record not provided.      @04A*/ 01462000
*       3 * char(0);                                                    01463000
*                                                                       01464000
*/********************************************************************/ 01465000
*/*                                                                  */ 01466000
*/*      Header returned in DATAAREA for IXCMG requests that code    */ 01467000
*/*                       GATHERFROM=OTHER                           */ 01468000
*/*                                                                  */ 01469000
*/********************************************************************/ 01470000
*                                                                       01471000
*   DECLARE                                                             01472000
*     1 AMDAGFO BASED AMDA_VIA,     /* Data area for IXCMG              01473000
*                                      GATHERFROM=OTHER request  @04A*/ 01474000
*       3 AMDAGFO_Version fixed(8), /* Version of this header    @04A*/ 01475000
*       3 * char(1),                /* reserved                  @04A*/ 01476000
*       3 AMDAGFO_Length fixed(16), /* Length of this header     @04A*/ 01477000
*                                                                       01478000
*       3 AMDAGFO_Retcode fixed,    /* IXCMG return code for the        01479000
*                                      asynchronous request.     @04A*/ 01480000
*       3 AMDAGFO_Rsncode fixed,    /* IXCMG reason code for the        01481000
*                                      asynchronous request.     @04A*/ 01482000
*       3 AMDAGFO_MaxPlistVer fixed(8), /* Max IXCMG PLISTVER supported 01483000
*                                      by target system.  Valid         01484000
*                                      for use if nonzero.       @04A*/ 01485000
*       3 AMDAGFO_MaxAmdaLevel fixed(8), /* Max IXCMG AMDALEVEL         01486000
*                                      supported by target system.      01487000
*                                      Valid for use if nonzero. @04A*/ 01488000
*       3 * char(2),                /* reserved                  @04A*/ 01489000
*                                                                       01490000
*       3 AMDAGFO_REQTOKEN CHAR(16), /* If request accepted, contains   01491000
*                                      a token that represents the      01492000
*                                      request.  Otherwise zero. @04A*/ 01493000
*       3 * char(0);                /*                           @04A*/ 01494000
*                                                                       01495000
*   DECLARE                                                             01496000
*     1 AMDADR BASED AMDA_VIA,      /* Mapping of first word common     01497000
*                                      to all data records       @04A*/ 01498000
*       3 AMDADR_TYPE fixed(8),     /* Type of data record       @04A*/ 01499000
*       3 AMDADR_Version fixed(8),  /* Version of data record    @04A*/ 01500000
*       3 AMDADR_Length fixed(16),  /* Length in bytes of record @04A*/ 01501000
*       3 AMDADR_Content char(0);   /* Type specific content starts at  01502000
*                                      this offset               @04A*/ 01503000
*                                                                       01504000
*   Declare                         /* AMDADR_TYPE values        @04A*/ 01505000
*     AMDA_kType_PATH    fixed(8) constant( 1), /* AMDPATH       @04A*/ 01506000
*     AMDA_kType_MPEND   fixed(8) constant( 2), /* AMDMPEND      @04A*/ 01507000
*     AMDA_kType_SYS     fixed(8) constant( 4), /* AMDSYS        @04A*/ 01508000
*     AMDA_kType_SD      fixed(8) constant( 8), /* AMDSD         @04A*/ 01509000
*     AMDA_kType_MEM     fixed(8) constant(16), /* AMDMEM        @04A*/ 01510000
*/* All new TYPE constants must be a multiple of 32 for compatibility   01511000
*   with AMDPATH, AMDMPEND, AMDSYS, AMDSD, AMDMEM which use a flag in   01512000
*   the low order 5 bits of TYPE byte to identify the record.    @04A*/ 01513000
*     AMDA_kType_GLI     fixed(8) constant( 1*32); /* AMDGLI     @04A*/ 01514000
*                                                                       01515000
*   Declare                         /* Version constants for records    01516000
*                                      and headers that have version */ 01517000
*     AMDA_kVersion0 fixed(8) constant(0); /*                    @04A*/ 01518000
*                                                                       01519000
*                                                                       01520000
*/********************************************************************/ 01521000
*/*                                                                  */ 01522000
*/*                         GLI Record                               */ 01523000
*/*                                                                  */ 01524000
*/********************************************************************/ 01525000
*                                                                       01526000
*   DECLARE                                                             01527000
*     1 AMDGLI BASED AMDA_VIA,     /* Record containing information     01528000
*                                      about AMDALEVELs for specific    01529000
*                                      types of data records     @04A*/ 01530000
*       3 AMDGLI_TYPE fixed(8),     /* =AMDA_kType_GLI           @04A*/ 01531000
*       3 AMDGLI_Version fixed(8),  /* Version of this record    @04A*/ 01532000
*       3 AMDGLI_RecLen fixed(16),  /* Length of this record     @04A*/ 01533000
*                                                                       01534000
*       3 AMDGLI_Level_PATH fixed(8), /* for AMDPATH             @04A*/ 01535000
*       3 AMDGLI_Level_MSGPEND fixed(8), /* for AMDMPEND         @04A*/ 01536000
*       3 AMDGLI_Level_SYSTEM fixed(8), /* for AMDSYS            @04A*/ 01537000
*       3 AMDGLI_Level_SRCDST fixed(8), /* for AMDSD             @04A*/ 01538000
*       3 AMDGLI_Level_MEMBER fixed(8), /* for AMDMEM            @04A*/ 01539000
*       3 * char(3),                /* reserved                  @04A*/ 01540000
*       3 * char(0);                /*                           @04A*/ 01541000
*                                                                       01542000
*                                                                       01543000
*/********************************************************************/ 01544000
*/*                                                                  */ 01545000
*/*               Data Record(s) for IXCMG TYPE=PATH                 */ 01546000
*/*                                                                  */ 01547000
*/********************************************************************/ 01548000
*                                                                       01549000
*   DECLARE                                                             01550000
*     1    AMDPATH  BASED AMDA_VIA, /* Path activity entry, placed in   01551000
*                                      the data area first if           01552000
*                                      requested                     */ 01553000
*      3    AMDPTYPE BIT(8),        /* Indication of type of data    */ 01554000
*        5    *        BIT(7),      /* Reserved and set to 0         */ 01555000
*        5    AMDPTYPP BIT(1),      /* Indicates path data           */ 01556000
*      3    *        BIT(8),        /* Reserved and set to 0         */ 01557000
*      3    AMDPLENT FIXED(16),     /* Length of a path entry        */ 01558000
*                                                                       01559000
*      3    AMDPNAME CHAR(8),       /* System name                   */ 01560000
*      3    AMDPDEV  CHAR(4),       /* Device number in EBCDIC of CTC   01561000
*                                      device for signalling path.      01562000
*                                      Blanks if not CTC device. @L2C*/ 01563000
*      3    AMDPDIR  FIXED(8),      /* Direction of path             */ 01564000
*       5     AMDPINB  BIT(1),      /* Inbound path                  */ 01565000
*       5     AMDPOUTB BIT(1),      /* Outbound path                 */ 01566000
*       5     *        BIT(6),      /* Reserved and set to 0         */ 01567000
*      3    *        CHAR(3),       /* Reserved and set to 0         */ 01568000
*      3    AMDPONME CHAR(8),       /* Name of system on other end      01569000
*                                      if known, otherwise blanks.   */ 01570000
*      3    AMDPODEV CHAR(4),       /* Device number in EBCDIC on the   01571000
*                                      other end if known, otherwise    01572000
*                                      blanks.                       */ 01573000
*      3    AMDPFLAG CHAR(4),       /* Flags                     @L5A*/ 01574000
*      4    AMDPSTAT FIXED(8),      /* Path status               @L5C*/ 01575000
*       5     AMDPSTRT BIT(1),      /* Starting                      */ 01576000
*       5     AMDPREST BIT(1),      /* Restarting                    */ 01577000
*       5     AMDPWORK BIT(1),      /* Working                       */ 01578000
*       5     AMDPSTOP BIT(1),      /* Stopping                      */ 01579000
*       5     AMDPLINK BIT(1),      /* Waiting for completion of        01580000
*                                      initial protocol used to         01581000
*                                      establish communication link. */ 01582000
*       5     AMDPNOP  BIT(1),      /*                                  01583000
*                        Not operational.  Path defined to XCF but not  01584000
*                          usable until hardware and/or definition      01585000
*                          problems are resolved                 @01A*/ 01586000
*       5     AMDPFAIL BIT(1),      /* Stop failed.              @L2A*/ 01587000
*       5     AMDPRBLD BIT(1),      /* Rebuilding                @L5C*/ 01588000
*                                                                       01589000
*      4    AMDPSTA2 FIXED(8),      /* More path status flags    @L5A*/ 01590000
*       5     AMDPQSCG BIT(1),      /* Quiescing                 @L5A*/ 01591000
*       5     AMDPQSCD BIT(1),      /* Quiesced                  @L5A*/ 01592000
*       5     AMDP_NotViable BIT(1), /* ON if path is effectively       01593000
*                                      quiesced. For example, no buffer 01594000
*                                      conditions on the inbound side.  01595000
*                                                                @06A*/ 01596000
*       5     AMDP_SS_Monitor BIT(1), /* ON if path appears to have     01597000
*                                      the potential to be causing      01598000
*                                      sympathy sickness.        @06A*/ 01599000
*       5     AMDP_SS_Impact BIT(1), /* ON if path is contributing to   01600000
*                                      sympathy sickness condition.     01601000
*                                                                @06A*/ 01602000
*       5     AMDP_Stalled BIT(1),  /* ON if I/O transfer does not seem 01603000
*                                      to be making progress.    @06A*/ 01604000
*       5     *        BIT(2),      /* Reserved and set to 0     @06C*/ 01605000
*      4    *        CHAR(2),       /* Reserved and set to 0     @L5C*/ 01606000
*      3    AMDPMRET FIXED(32),     /* Path retry limit              */ 01607000
*      3    AMDP#RET FIXED(32),     /* Current path retry count      */ 01608000
*      3    AMDP#RST FIXED(32),     /* Cumulative number of restarts */ 01609000
*      3    AMDPMXMS FIXED(32),     /*                                  01610000
*                        Path maximum message limit.  This value is     01611000
*                          the customer specified value for the number  01612000
*                          of 1K byte blocks of message buffer space    01613000
*                          associated with this signalling path.  For   01614000
*                          an inbound path, this is the maximum amount  01615000
*                          of buffer space that can be used by the      01616000
*                          path.  For an outbound path, this is the     01617000
*                          amount of buffer space contributed by this   01618000
*                          path to the total buffer space available for 01619000
*                          sending messages to the system on the other  01620000
*                          end using the transport class to which       01621000
*                          this path is assigned.                @P3C*/ 01622000
*      3    AMDP#SIG FIXED(32),     /* For an outbound (inbound) path,  01623000
*                                      the total number of signals      01624000
*                                      sent (received) over the path.   01625000
*                                      N/A for structure summary        01626000
*                                      (Hardware type 2)         @L3C*/ 01627000
*      3    AMDP#ACT FIXED(32),     /* For an outbound path, the        01628000
*                                      current number                   01629000
*                                      of signals pending transfer on   01630000
*                                      the path.                        01631000
*                                      N/A for structure summary        01632000
*                                      (Hardware type 2)         @L3C*/ 01633000
*       5     AMDP#IBR FIXED(32),   /* For an inbound path, the         01634000
*                                      total number                     01635000
*                                      of times a request for a new     01636000
*                                      message buffer was refused due   01637000
*                                      to the maximum message limit for 01638000
*                                      the path.                        01639000
*                                      N/A for structure summary        01640000
*                                      (Hardware type 2)         @L3C*/ 01641000
*      3    AMDP#SUS FIXED(32),     /* For an outbound path, the        01642000
*                                      total number                     01643000
*                                      of signal requests satisfied     01644000
*                                      by this path while not busy.     01645000
*                                      For an inbound path, reserved    01646000
*                                      and set to 0.                    01647000
*                                      N/A for structure summary        01648000
*                                      (Hardware type 2)         @L3C*/ 01649000
*      3    AMDP#APP FIXED(32),     /* For an outbound path, the        01650000
*                                      total number                     01651000
*                                      of signal requests satisfied     01652000
*                                      by this path while busy.         01653000
*                                      N/A for structure summary        01654000
*                                      (Hardware type 2)         @02C*/ 01655000
*        5    AMDPIOXT FIXED(32),   /* For an inbound path, the average 01656000
*                                      I/O transfer time, expressed in  01657000
*                                      microseconds, for the most       01658000
*                                      recently received signals.  Zero 01659000
*                                      if not available (no recent      01660000
*                                      signals or sending system does   01661000
*                                      not provide the necessary data). 01662000
*                                      'FFFFFFFF'x if overflow (implies 01663000
*                                      average exceeds approximately 35 01664000
*                                      minutes).                        01665000
*                                      N/A for structure summary        01666000
*                                      (Hardware type 2)         @02A*/ 01667000
*      3    AMDP#USE FIXED(32),     /* Count of the current number of   01668000
*                                      1K byte blocks of                01669000
*                                      message buffer space in use by   01670000
*                                      this signalling path.            01671000
*                                      N/A for structure summary        01672000
*                                      (Hardware type 2)         @L3C*/ 01673000
*      3    AMDPMGRS FIXED(32),     /* Measurement Gatherer Reset Data  01674000
*                                      indicator, changes when counts   01675000
*                                      for this path entry have been    01676000
*                                      reset.                           01677000
*                          Use this token to determine whether or not   01678000
*                          the data collected from two different        01679000
*                          invocations of the IXCMG service are         01680000
*                          comparable.  If the token is the same for    01681000
*                          both sets of data, it makes sense to compare 01682000
*                          the data.  If the token is different, the    01683000
*                          two sets of data are not comparable since    01684000
*                          they refer to two different instances of the 01685000
*                          indicated signalling path.           @P3C*/  01686000
*      3    AMDPTCN  CHAR(8),       /* Transport Class Name.            01687000
*                          For an outbound path, the class to which     01688000
*                          the path is assigned.                        01689000
*                          For an inbound path, blanks if AMDALEVEL<=1. 01690000
*                          For AMDALEVEL>1, the class to which the      01691000
*                          outbound side of the path is assigned,       01692000
*                          blanks if not known.                  @06C*/ 01693000
*      3    AMDPPHDT FIXED(32),    /* Type of hardware being used as    01694000
*                                     the transport mechanism for the   01695000
*                                     signalling path.  See AMHDTxxx    01696000
*                                     constants.                 @L2A*/ 01697000
*      3    AMDPPHDD CHAR(32) BDY(WORD);  /* Path hardware              01698000
*                                      descriptor.   See AMxxxHDD       01699000
*                                      mappings below.           @L2A*/ 01700000
*   DECLARE                                                             01701000
*     1    AMDPATH1 BASED AMDA_VIA, /* Path activity entry, returned    01702000
*                                      when AMDALEVEL>0 specified on    01703000
*                                      IXCMG.                    @03A*/ 01704000
*       3 * CHAR( LENGTH( AMDPATH ) ), /* Mapped by AMDPATH      @03A*/ 01705000
*       3 AMDPATH1_BuffLen fixed,   /* Maximum number of bytes of       01706000
*                                      message data that will fit into  01707000
*                                      the signal buffers that are      01708000
*                                      currently used by the signalling 01709000
*                                      path.  Zero if signal buffers    01710000
*                                      are not relevant to the path.    01711000
*                                      N/A for structure summary        01712000
*                                      (Hardware type 2)         @03A*/ 01713000
*       3 AMDPATH1_TransferRate fixed, /* For an outbound path,         01714000
*                                      transfer rate value expressed in 01715000
*                                      microseconds, that was last      01716000
*                                      reported by the inbound side of  01717000
*                                      the path.  Zero if not available 01718000
*                                      (no recent signals or sending    01719000
*                                      system does not provide the      01720000
*                                      necessary data or path is not    01721000
*                                      relevant for signal transfers).  01722000
*                                      'FFFFFFFF'x if overflow (implies 01723000
*                                      average exceeds approximately 35 01724000
*                                      minutes).                        01725000
*                                                                       01726000
*                                      N/A for inbound paths.           01727000
*                                      N/A for structure summary        01728000
*                                      (Hardware type 2)         @03A*/ 01729000
*       3 AMDPATH1_#PendingDelivery fixed, /* For an inbound path,      01730000
*                                      the number of signal buffers     01731000
*                                      currently engaged in some phase  01732000
*                                      of delivering a message that     01733000
*                                      was received over the path.      01734000
*                                                                       01735000
*                                      N/A for outbound paths.          01736000
*                                      N/A for structure summary        01737000
*                                      (Hardware type 2)         @03A*/ 01738000
*       3 AMDPATH1_Signal# fixed(32), /* For an outbound path, the      01739000
*                                      signal number assigned to the    01740000
*                                      most recent signal queued for    01741000
*                                      transfer over the path (contrast 01742000
*                                      with AMDP#SIG which includes     01743000
*                                      only user signals).              01744000
*                                      For an inbound path, the signal  01745000
*                                      number of the signal that was    01746000
*                                      most recently received.          01747000
*                                      These numbers are not            01748000
*                                      necessarily ever increasing.     01749000
*                                      N/A for structure summary        01750000
*                                      (Hardware type 2)         @03A*/ 01751000
*       3 * CHAR(52);               /* Reserved for future use   @03A*/ 01752000
*                                                                       01753000
*   DECLARE                                                             01754000
*     1    AMDPATH2 BASED AMDA_VIA, /* Path activity entry, returned    01755000
*                                      when AMDALEVEL=4 specified on    01756000
*                                      IXCMG.                    @LBA*/ 01757000
*       3 * CHAR( LENGTH( AMDPATH1 ) ), /* Mapped by AMDPATH1    @LBA*/ 01758000
*                                                                       01759000
*       3 * CHAR(4),                /* Reserved for alignment    @LBA*/ 01760000
*                                                                       01761000
*       3 AMDPATH2_NoInBufTimeSum fixed(64), /* Total time (in          01762000
*                                               microseconds) the path  01763000
*                                               had a no-inbound buffer 01764000
*                                               impact condition @LBA*/ 01765000
*       3 AMDPATH2_NoInBufTimeSsq fixed(64), /* Sum of squared          01766000
*                                               microseconds for each   01767000
*                                               no-inbound-buffer       01768000
*                                               impact conditions       01769000
*                                                                @LBA*/ 01770000
*       3 AMDPATH2_NoInBufTime# fixed(32), /* The count of              01771000
*                                             no-inbound-buffer impact  01772000
*                                             conditions         @LBA*/ 01773000
*       3 * CHAR(84),               /* Reserved for furture use  @LDC*/ 01774000
*                                                                       01775000
*       /* Path usage statistics array. This array describes the        01776000
*          utilization of the path. Each entry in the array             01777000
*          describes utilization as a percentage of the maximum         01778000
*          capacity. Any remaining time not described by this           01779000
*          array can be considered time the path was not                01780000
*          utilized at all (i.e. 0% utilized).                   @LDA*/ 01781000
*       3 AMDPATH2_UsageStats(4),   /*                           @LDA*/ 01782000
*                                                                       01783000
*         5 AMDPATH2_UseTimeSum fixed(64), /* Total time (in            01784000
*                                             microseconds) path was in 01785000
*                                             use at the indicated      01786000
*                                             percent utilization       01787000
*                                                                @LDA*/ 01788000
*         5 AMDPATH2_UseTimeSsq fixed(64), /* Sum of squared            01789000
*                                             microseconds path was in  01790000
*                                             use at the indicated      01791000
*                                             utilization        @LDA*/ 01792000
*         5 AMDPATH2_UseTime#   fixed(32), /* Count of times the path   01793000
*                                             was in use at the         01794000
*                                             indicated percent         01795000
*                                             utilization        @LDA*/ 01796000
*         5 AMDPATH2_UseSigCnt fixed(32), /* Total number of signals    01797000
*                                             sent for this usage entry 01798000
*                                                                @LDA*/ 01799000
*         5 AMDPATH2_UsePercent fixed(32), /* Percent utilization       01800000
*                                             this entry represents     01801000
*                                             (e.g. 25, 50, etc) @LDA*/ 01802000
*         5 * CHAR(4),              /* Reserved for future use   @LDA*/ 01803000
*                                                                       01804000
*       3 * CHAR(4);                /* Reserved for alignment    @LDA*/ 01805000
*                                                                       01806000
*/********************************************************************/ 01807000
*/*                                                                  */ 01808000
*/*               Data Record for IXCMG TYPE=MSGPEND                 */ 01809000
*/*                                                                  */ 01810000
*/********************************************************************/ 01811000
*                                                                       01812000
*   DECLARE                                                             01813000
*     1    AMDMPEND BASED AMDA_VIA, /* Pending messages entry        */ 01814000
*       3   AMDMTYPE BIT(8),        /* Indication of type of data    */ 01815000
*        5   *        BIT(6),       /* Reserved and set to 0         */ 01816000
*        5   AMDMTYPM BIT(1),       /* Indicates pending message data*/ 01817000
*        5   *        BIT(1),       /* Reserved and set to 0         */ 01818000
*       3    *        BIT(8),       /* Reserved and set to 0         */ 01819000
*       3   AMDMLENT FIXED(16),     /* Length of a pending message      01820000
*                                      entry                         */ 01821000
*       3    AMDMDEVN CHAR(4),      /* Device number (EBCDIC) of CTC    01822000
*                                      device for signalling path       01823000
*                                      on which message is pending.     01824000
*                                      Blanks if not associated         01825000
*                                      with any signalling path or not  01826000
*                                      a CTC device.             @L2C*/ 01827000
*       3    AMDMTOKN BIT(64),      /* Member token of message sender*/ 01828000
*       3    AMDMASID FIXED(15),    /* ASID of member sending message*/ 01829000
*       3    AMDMHOME FIXED(15),    /* Home ASID that initiated         01830000
*                                      message out request           */ 01831000
*       3    AMDMTSNM CHAR(8),      /* Name of system that is target    01832000
*                                      of message               @D1A */ 01833000
*       3    AMDMMSGL FIXED(32),    /*                                  01834000
*                     Length of message which is pending        @L1A */ 01835000
*       3    AMDMTCN  CHAR(8),      /*                                  01836000
*                       Name of transport class selected for            01837000
*                       transferring the message, blanks if class not   01838000
*                       yet selected.                            @L2C*/ 01839000
*       3    AMDMPHDT FIXED(32),    /* Type of hardware being used as   01840000
*                                      the transport mechanism for the  01841000
*                                      signalling path.  Indicates      01842000
*                                      not applicable if the message    01843000
*                                      is not currently pending         01844000
*                                      transfer over a particular       01845000
*                                      signalling path.          @L3C*/ 01846000
*       3    AMDMPHDD CHAR(32) BDY(WORD);     /* Path hardware          01847000
*                                      descriptor.   Not applicable if  01848000
*                                      message is not currently pending 01849000
*                                      transfer over a particular       01850000
*                                      signalling path.  See AMxxxHDD   01851000
*                                      mappings below.           @L3C*/ 01852000
*                                                                       01853000
*/********************************************************************/ 01854000
*/*                                                                  */ 01855000
*/*               Data Record(s) for IXCMG TYPE=SYSTEM               */ 01856000
*/*                                                                  */ 01857000
*/********************************************************************/ 01858000
*                                                                       01859000
*   DECLARE                                                             01860000
*     1    AMDSYS   BASED AMDA_VIA, /* System entry.  There are         01861000
*                                      two or more system entries per   01862000
*                                      remote system (1 inbound entry   01863000
*                                      plus 1 outbound entry per        01864000
*                                      transport class).                01865000
*                                      One entry per transport class    01866000
*                                      for the local system.    @L1C */ 01867000
*      3    AMDSYTYP BIT(8),        /* Indication of type of data    */ 01868000
*       5    *        BIT(5),       /* Reserved and set to 0         */ 01869000
*       5    AMDSYTYE BIT(1),       /* Indicates system data         */ 01870000
*       5    *        BIT(2),       /* Reserved and set to 0         */ 01871000
*      3    *        BIT(8),        /* Reserved and set to 0         */ 01872000
*                                                                       01873000
*      3    AMDSYLEN FIXED(16),     /* Length of system entry        */ 01874000
*      3    AMDSYNME CHAR(8),       /* System name, blanks if not       01875000
*                                      known                         */ 01876000
*      3    AMDSYDIR FIXED(8),      /* Direction                     */ 01877000
*         5    AMDSYIN  BIT(1),     /* Inbound                       */ 01878000
*         5    AMDSYOUT BIT(1),     /* Outbound                      */ 01879000
*         5    AMDSYLCL BIT(1),     /* Local                         */ 01880000
*         5    *        BIT(5),     /* Reserved and set to 0         */ 01881000
*      3    *        CHAR(3),       /* Reserved and set to 0         */ 01882000
*      3    AMDSYPTH FIXED(32),     /*                                  01883000
*                        Current number of paths in service.            01884000
*                          If local entry, set to 0.                    01885000
*                          If outbound entry, count                     01886000
*                          is for indicated transport class.     @L1C*/ 01887000
*      3    AMDSYBSY FIXED(32),     /*                                  01888000
*                        Total number of times a no buffer condition    01889000
*                          occurred.  Subject to wrapping.              01890000
*                          If local or outbound entry, count            01891000
*                          is for indicated transport class.    @L1C*/  01892000
*      3    AMDSYNOP FIXED(32),     /*                                  01893000
*                        Total number of times a no path condition      01894000
*                          occurred.  Subject to wrapping.              01895000
*                          If local entry, set to 0.                    01896000
*                          If outbound entry, count                     01897000
*                          is for indicated transport class.    @L1C*/  01898000
*      3    AMDSYMXB FIXED(32),     /*                                  01899000
*                        Current maximum number of 1K byte blocks of    01900000
*                          message buffer space permitted for system.   01901000
*                          If local or outbound entry, count            01902000
*                          is for indicated transport class.    @L1C*/  01903000
*      3    AMDSYUSE FIXED(32),     /*                                  01904000
*                        Current number of 1K byte blocks of            01905000
*                          message buffer space in use on system.       01906000
*                          If local or outbound system entry, count     01907000
*                          is for indicated transport class.    @L1C*/  01908000
*      3    AMDSYNUM FIXED(32),     /* System Token.                    01909000
*                          Changes when all counts for the system       01910000
*                          named by AMDSYNME have been reset.           01911000
*                          Use this token to determine whether or not   01912000
*                          the data collected from two different        01913000
*                          invocations of the IXCMG service are         01914000
*                          comparable.  If the token is the same for    01915000
*                          both sets of data, it makes sense to compare 01916000
*                          the data.  If the token is different, the    01917000
*                          two sets of data are not comparable since    01918000
*                          they refer to two different instances of the 01919000
*                          named system.                        @P3C*/  01920000
*      3    AMDSYBIG FIXED(32),     /*                                  01921000
*                        Total number of messages sent whose length     01922000
*                          exceeded the buffer size that supports       01923000
*                          the defined transport class length.          01924000
*                          Zero if inbound entry.                       01925000
*                          Subject to wrapping.                 @L1A*/  01926000
*      3    AMDSYFIT FIXED(32),     /*                                  01927000
*                        Total number of messages sent whose length     01928000
*                          fit the buffer size that supports            01929000
*                          the defined transport class length.          01930000
*                          Zero if inbound entry.                       01931000
*                          Subject to wrapping.                 @L1A*/  01932000
*      3    AMDSYSML FIXED(32),     /*                                  01933000
*                        Total number of messages sent whose length     01934000
*                          was smaller than buffer size that supports   01935000
*                          the defined transport class length.          01936000
*                          Zero if inbound entry.                       01937000
*                          Subject to wrapping.                 @L1A*/  01938000
*      3    AMDSYOVR FIXED(32),     /*                                  01939000
*                        Total number of messages sent whose length     01940000
*                          exceeded the buffer size for which the       01941000
*                          signalling service was optimized.            01942000
*                          Zero if inbound entry.                       01943000
*                          Subject to wrapping.                 @L1A*/  01944000
*      3    AMDSYTCL FIXED(32),     /*                                  01945000
*                        Length of longest message that fits the        01946000
*                          buffer size that supports                    01947000
*                          the defined transport class length.          01948000
*                          Zero if inbound entry.               @L1A*/  01949000
*      3    AMDSYTCN CHAR(8),       /*                                  01950000
*                        Transport Class Name to which the data         01951000
*                          applies.  Blanks if inbound entry.           01952000
*                                                               @D2C*/  01953000
*      3    AMDSYGRS FIXED(32), /*                                      01954000
*                        Measurement Gatherer Reset Data indicator,     01955000
*                          changes when counts for the transport        01956000
*                          class named by AMDSYTCN have been reset.     01957000
*                          Note that if AMDSYNUM field has changed,     01958000
*                          then counts have been reset even though      01959000
*                          AMDSYGRS may not have changed.               01960000
*                          Zero if inbound entry.                       01961000
*                          Use this token to determine whether or not   01962000
*                          the data collected from two different        01963000
*                          invocations of the IXCMG service are         01964000
*                          comparable.  If the token is the same for    01965000
*                          both sets of data, it makes sense to compare 01966000
*                          the data.  If the token is different, the    01967000
*                          two sets of data are not comparable since    01968000
*                          they refer to two different instances of the 01969000
*                          indicated transport class definition @P3C*/  01970000
*      3    AMDSYSMX FIXED(32);     /* Customer defined maxmsg value.   01971000
*                                     Default number of 1K byte blocks  01972000
*                                     of message buffer space. If local 01973000
*                                     or outbound entry, count is for   01974000
*                                     transport class. This value can   01975000
*                                     be modified via SETXCF command.   01976000
*                                                                @P2A*/ 01977000
*                                                                       01978000
*   DECLARE                                                             01979000
*     1    AMDSYS1  BASED AMDA_VIA, /* System entry.  This is the       01980000
*                                      mapping to use for system data   01981000
*                                      when the IXCMG service is        01982000
*                                      invoked with AMDALEVEL >= 1.     01983000
*                                      NOTE: These records are variable 01984000
*                                      length.  AMDSYLEN *must* be used 01985000
*                                      to increment to the next AMDSYS1 01986000
*                                      entry.                    @03A*/ 01987000
*     2 AMDSYS1F BDY(WORD),         /*                           @03A*/ 01988000
*      3 * CHAR( length(AMDSYS) ),  /* This area is mapped by AMDSYS    01989000
*                                      as usual.                 @03A*/ 01990000
*      3 * CHAR(32),                /* Reserved.                 @03A*/ 01991000
*      3 AMDSYS1_#MsgSizes fixed,   /* Number of entries in the         01992000
*                                      AMDSYS1_MsgSizes array.          01993000
*                                      Could be zero.            @03A*/ 01994000
*     2 AMDSYS1V BDY(WORD),         /*                           @03A*/ 01995000
*      3 AMDSYS1_MsgSizes(*),       /* Array of msg size data    @03A*/ 01996000
*        5 AMDSYS1_BuffLen fixed,   /* maximum number of                01997000
*                                      bytes of message data that fit   01998000
*                                      in the message buffer     @03A*/ 01999000
*        5 AMDSYS1_SignalCnt fixed(32), /* Number of signals that could 02000000
*                                      have used a signal buffer of     02001000
*                                      the indicated size.              02002000
*                                      Subject to wrapping.      @03A*/ 02003000
*        5 * char(8);               /* Reserved.                 @03A*/ 02004000
*                                                                       02005000
*                                                                       02006000
*/********************************************************************/ 02007000
*/*                                                                  */ 02008000
*/*                Data Record for IXCMG TYPE=SRCDST                 */ 02009000
*/*                                                                  */ 02010000
*/********************************************************************/ 02011000
*                                                                       02012000
*   DECLARE                                                             02013000
*     1    AMDSD    BASED AMDA_VIA, /* Source/destination entry,        02014000
*                                      one per member.           @P1C*/ 02015000
*      3    AMDSTYPE BIT(8),        /* Indication of type of data    */ 02016000
*       5    *        BIT(4),       /* Reserved and set to 0         */ 02017000
*       5    AMDSTYPS BIT(1),       /* Indicates source/destination     02018000
*                                      data                          */ 02019000
*       5    *        BIT(3),       /* Reserved and set to 0         */ 02020000
*      3    *        BIT(8),        /* Reserved and set to 0         */ 02021000
*      3    AMDSLENT FIXED(16),     /* Length of a source/destination   02022000
*                                      entry                         */ 02023000
*      3    AMDSGRP  CHAR(8),       /* Eight byte group name         */ 02024000
*      3    AMDSMEM  CHAR(16),      /* Member name                   */ 02025000
*      3    AMDSSCNT  FIXED(32),     /* Total number of signals         02026000
*                                      sent by the member            */ 02027000
*      3    AMDSRCNT  FIXED(32),     /* Total number of signals         02028000
*                                      received by the member        */ 02029000
*      3    AMDSMGRS FIXED(32),     /* Measurement Gatherer Reset Data  02030000
*                                      indicator, changes when counts   02031000
*                                      for this member entry have been  02032000
*                                      reset.                           02033000
*                          Use this token to determine whether or not   02034000
*                          the data collected from two different        02035000
*                          invocations of the IXCMG service are         02036000
*                          comparable.  If the token is the same for    02037000
*                          both sets of data, it makes sense to compare 02038000
*                          the data.  If the token is different, the    02039000
*                          two sets of data are not comparable since    02040000
*                          they refer to two different instances of the 02041000
*                          indicated member.                    @P3C*/  02042000
*      3    AMDSSNAM CHAR(8);       /* Name of system on which member   02043000
*                                      resides                  @D1A */ 02044000
*                                                                       02045000
*                                   /*                           @D3D*/ 02046000
*/********************************************************************/ 02047000
*/*                                                                  */ 02048000
*/*               Data Record(s) for IXCMG TYPE=MEMBER               */ 02049000
*/*                                                                  */ 02050000
*/********************************************************************/ 02051000
*                                                                       02052000
*   DECLARE                                                             02053000
*   1 AMDMEM    BASED AMDA_VIA, /* Member data entry        @03A*/      02054000
*     2 AMDMEM_HDR,                 /*                           @03A*/ 02055000
*      3    AMDMEM_TYPE BIT(8),     /* Indicates type of data    @03A*/ 02056000
*       5    *        BIT(3),       /* Reserved and set to 0     @03A*/ 02057000
*       5    AMDMEM_TypeMem BIT(1), /* Indicates member data     @03A*/ 02058000
*       5    *        BIT(4),       /* Reserved and set to 0     @03A*/ 02059000
*      3    *        BIT(8),        /* Reserved and set to 0     @03A*/ 02060000
*      3    AMDMEM_Length FIXED(16), /* Number of bytes of data         02061000
*                                      returned in this entry.          02062000
*                                      CAUTION: records are variable    02063000
*                                      length since a variable number   02064000
*                                      of AMDMEMDI data items may be    02065000
*                                      returned.                 @03A*/ 02066000
*      3    AMDMEM_GroupName CHAR(8), /* XCF group name          @03A*/ 02067000
*      3    AMDMEM_MemberName CHAR(16), /* XCF Member name       @03A*/ 02068000
*      3    AMDMEM_JobName char(8), /* Member's jobname          @03A*/ 02069000
*      3    AMDMEM_Sysname char(8), /* Name of system on which member   02070000
*                                      resides                   @03A*/ 02071000
*      3    AMDMEM_MemberToken BIT(64),  /* XCF member token for the    02072000
*                                      indicated member.                02073000
*                          Use this token to determine whether or not   02074000
*                          the data collected from two different        02075000
*                          invocations of the IXCMG service are         02076000
*                          comparable.  If the token is the same for    02077000
*                          both sets of data, it makes sense to compare 02078000
*                          the data.  If the token is different, the    02079000
*                          two sets of data are not comparable since    02080000
*                          they refer to two different instances of the 02081000
*                          indicated member.                     @03A*/ 02082000
*      3    AMDMEM_SysToken FIXED(32), /* XCF system token for the      02083000
*                                      system where the member          02084000
*                                      resides.                  @03A*/ 02085000
*      3   AMDMEM_ExitsDefined bit(8), /* User exits supplied at join   02086000
*                                      time.                     @P6A*/ 02087000
*        5  * bit(4),               /* Reserved                  @P6A*/ 02088000
*        5  AMDMEM_HasMsgExit bit,  /* ON if the member supplied a      02089000
*                                      MSGEXIT routine when it invoked  02090000
*                                      IXCJOIN to join its group.       02091000
*                                      The member is capable of         02092000
*                                      receiving messages.              02093000
*                                      Valid for AMDALEVEL > 1.  @P6A*/ 02094000
*        5  AMDMEM_HasGrpExit bit,  /* ON if the member supplied a      02095000
*                                      GRPEXIT routine when it invoked  02096000
*                                      IXCJOIN to join its group.       02097000
*                                      The member is capable of         02098000
*                                      receiving notifications about    02099000
*                                      changes in the operational       02100000
*                                      states of other members in the   02101000
*                                      group or systems in the sysplex. 02102000
*                                      Valid for AMDALEVEL > 1.  @P6A*/ 02103000
*        5  AMDMEM_HasNotifyExit bit, /* ON if the member supplied a    02104000
*                                      NOTIFYEXIT routine when it       02105000
*                                      invoked IXCJOIN to join its      02106000
*                                      group. The member is capable of  02107000
*                                      receiving message notifications. 02108000
*                                      Valid for AMDALEVEL > 1.  @P6A*/ 02109000
*        5  AMDMEM_HasStatExit bit, /* ON if the member supplied a      02110000
*                                      STATEXIT routine when it invoked 02111000
*                                      IXCJOIN to join its group.       02112000
*                                      This allows XCF to monitor       02113000
*                                      the member's status.             02114000
*                                      Valid for AMDALEVEL > 1.  @P6A*/ 02115000
*      3    * CHAR(1),              /* reserved                  @P6C*/ 02116000
*      3    AMDMEM_ASID fixed(16),  /* Member's address space    @03A*/ 02117000
*                                                                       02118000
*      3    AMDMEM_MsgoAccepted FIXED(32), /* Cumulative count of       02119000
*                                      messages accepted for delivery   02120000
*                                      by the IXCMSGO service.  Subject 02121000
*                                      to wrapping.              @03A*/ 02122000
*      3    AMDMEM_MsgoNoBuffer FIXED(32), /* Total number of messages  02123000
*                                      rejected by the IXCMSGO service  02124000
*                                      for lack of a message buffer.    02125000
*                                      Subject to wrapping.      @03A*/ 02126000
*                                                                       02127000
*      3    AMDMEM_MsgiReceived FIXED(32), /* Cumulative count of       02128000
*                                      messages that were to be         02129000
*                                      delivered to the member.         02130000
*                                      Includes both local and remote   02131000
*                                      messages.                        02132000
*                                      Subject to wrapping.      @03A*/ 02133000
*      3    AMDMEM_MsgiCurrWorkItems FIXED(32), /* The number of signal 02134000
*                                      work items currently queued for  02135000
*                                      processing.  Usually a work item 02136000
*                                      represents a message that is to  02137000
*                                      be delivered, but they could     02138000
*                                      include internal XCF work that   02139000
*                                      needs to be performed.    @03A*/ 02140000
*      3    AMDMEM_MsgiTransfers FIXED(32), /* Cumulative count of      02141000
*                                      remote signals that were         02142000
*                                      received on behalf of the        02143000
*                                      member.                          02144000
*                                      Subject to wrapping.      @03A*/ 02145000
*      3    AMDMEM_MsgoTransferTime FIXED(32), /* For inbound remote    02146000
*                                      signals, the average message     02147000
*                                      transfer time, expressed in      02148000
*                                      microseconds, for the most       02149000
*                                      recently received signals.  Zero 02150000
*                                      if not available (no recent      02151000
*                                      signals or sending system does   02152000
*                                      not provide the necessary data). 02153000
*                                      'FFFFFFFF'x if overflow (implies 02154000
*                                      average exceeds approximately 35 02155000
*                                      minutes).                        02156000
*                                                                       02157000
*                                      Message transfer is measured     02158000
*                                      from the time that XCF accepts   02159000
*                                      delivery of the message on the   02160000
*                                      sending system to the time that  02161000
*                                      (each signal for the) message    02162000
*                                      arrives on the target system and 02163000
*                                      can be                           02164000
*                                      scheduled/queued/collected for   02165000
*                                      delivery to the target member.   02166000
*                                                                @03A*/ 02167000
*      3    AMDMEM_GrpxReceived FIXED(32), /* Cumulative count of group 02168000
*                                      events that were to be delivered 02169000
*                                      to the member.  Subject to       02170000
*                                      wrapping.                 @03A*/ 02171000
*      3    AMDMEM_GrpxCurrWorkItems FIXED(32), /* The number of group  02172000
*                                      work items currently queued for  02173000
*                                      processing.               @03A*/ 02174000
*      3    AMDMEM_TodWhenCollected char(8), /* TOD when started data   02175000
*                                      gathering.  Valid for AMDALEVEL  02176000
*                                      > 0.                      @04A*/ 02177000
*      3   AMDMEM_FLAGS char(2),    /*                           @L8C*/ 02178000
*       4  AMDMEM_FLAGS1 char(1),   /* first byte of flags       @L8A*/ 02179000
*        5  AMDMEM_Stalled bit,     /* ON if the member is considered   02180000
*                                      stalled.  Valid for AMDALEVEL    02181000
*                                      > 0.                      @04A*/ 02182000
*        5  AMDMEM_SympathySickness bit, /* ON if member appears to     02183000
*                                      be contributing to sympathy      02184000
*                                      sickness in the sysplex.         02185000
*                                      Valid for AMDALEVEL > 0.  @05A*/ 02186000
*        5  AMDMEM_Deactivating bit, /* ON if active member being       02187000
*                                      deactivated.  Member exit        02188000
*                                      routines will not be driven.     02189000
*                                      Valid for AMDALEVEL > 0.  @06A*/ 02190000
*        5  AMDMEM_SS_Terminating bit, /* ON if member termination was  02191000
*                                      initiated by SFM in an attempt   02192000
*                                      to relieve sympathy sickness.    02193000
*                                      Valid for AMDALEVEL > 0.  @06A*/ 02194000
*        5  AMDMEM_MemStallEnabled bit, /* ON if XCF is to terminate    02195000
*                                      the member that appears to be    02196000
*                                      causing sympathy sickness.       02197000
*                                      Valid for AMDALEVEL > 1.  @L7A*/ 02198000
*        5  AMDMEM_ConfirmedSum bit, /* ON if the member is in a status 02199000
*                                      update missing condition         02200000
*                                      confirmed by its status exit.    02201000
*                                      Valid for AMDALEVEL > 1.  @L7A*/ 02202000
*        5  AMDMEM_ConfirmedImpaired bit, /* ON if the member is        02203000
*                                      considered impaired because its  02204000
*                                      status exit continuously reports 02205000
*                                      bad status.                      02206000
*                                      Valid for AMDALEVEL > 1.  @L7A*/ 02207000
*        5  AMDMEM_DeemedImpaired bit, /* ON if the member is           02208000
*                                      considered impaired because all  02209000
*                                      of its exits are stalled.        02210000
*                                      Valid for AMDALEVEL > 1.  @L7A*/ 02211000
*       4  AMDMEM_FLAGS2 char(1),   /* second byte of flags      @L8A*/ 02212000
*        5  AMDMEM_MessageIsolated bit, /* ON if the member is "message 02213000
*                                      isolated".  If so, XCF will      02214000
*                                      reject or delay msgout requests  02215000
*                                      targeted to this member.         02216000
*                                      Valid for AMDALEVEL > 2.  @P8C*/ 02217000
*        5  AMDMEM_ImpactfulMISO bit, /* ON if the message isolation    02218000
*                                      of this member appears to be     02219000
*                                      impacting msgout requests        02220000
*                                      targeted to this member (XCF has 02221000
*                                      rejected or delayed messages).   02222000
*                                      Due to various                   02223000
*                                      latencies, the senders could     02224000
*                                      continue to be impacted even     02225000
*                                      after the subject member is no   02226000
*                                      longer isolated.  Similarly, it  02227000
*                                      might appear that senders are    02228000
*                                      still being impacted even after  02229000
*                                      they have recognized that the    02230000
*                                      subject member is no longer      02231000
*                                      isolated.                        02232000
*                                      Valid for AMDALEVEL > 2.  @P8C*/ 02233000
*        5  AMDMEM_ImpactedByMiso bit, /* ON if subject member          02234000
*                                      currently appears to be          02235000
*                                      impacted by one or more members  02236000
*                                      who currently appear to be       02237000
*                                      "message isolated".  Implies     02238000
*                                      one or more messages sent by     02239000
*                                      the subject member to the        02240000
*                                      isolated member(s) have been     02241000
*                                      delayed and/or rejected.  Valid  02242000
*                                      for AMDALEVEL > 2.  @P8A*/       02243000
*        5  * bit(5),               /* Reserved                  @P8C*/ 02244000
*      3   * char(2),               /* Reserved                  @L8C*/ 02245000
*      3    AMDMEM_MsgiCurrWiIoBuff  FIXED(32), /* Number of currently  02246000
*                                      queued work items consuming an   02247000
*                                      XCF signal buffer.               02248000
*                                      Valid for AMDALEVEL > 0.  @05A*/ 02249000
*      3    AMDMEM_MsgiCurrWiDrBuff  FIXED(32), /* Number of currently  02250000
*                                      queued work items consuming a    02251000
*                                      DREF XCF buffer.                 02252000
*                                      Valid for AMDALEVEL > 0.  @05A*/ 02253000
*      3    AMDMEM_MsgiCurrWiPgBuff  FIXED(32), /* Number of currently  02254000
*                                      queued work items consuming a    02255000
*                                      pageable XCF buffer.             02256000
*                                      Valid for AMDALEVEL > 0.  @05A*/ 02257000
*      3    AMDMEM_MstCurrMsgoSendPend FIXED(32), /* Number of managed  02258000
*                                      msgout requests currently in     02259000
*                                      pending state because a send     02260000
*                                      has not completed.               02261000
*                                      Valid for AMDALEVEL > 0.  @05A*/ 02262000
*      3    AMDMEM_MstCurrMsgoRespPend FIXED(32), /* Number of managed  02263000
*                                      msgout requests currently in     02264000
*                                      pending state because an         02265000
*                                      expected response has not been   02266000
*                                      received (no sends pending).     02267000
*                                      Valid for AMDALEVEL > 0.  @05A*/ 02268000
*      3    AMDMEM_MstCurrMsgoCompleted FIXED(32), /* Number of managed 02269000
*                                      msgout requests currently in     02270000
*                                      completed state.                 02271000
*                                      Valid for AMDALEVEL > 0.  @05A*/ 02272000
*      3    AMDMEM_MstCurrMsgoSaved FIXED(32), /* Number of managed     02273000
*                                      msgout requests currently in     02274000
*                                      saved state.                     02275000
*                                      Valid for AMDALEVEL > 0.  @05A*/ 02276000
*      3    AMDMEM_MstCurrMsgiSaved FIXED(32), /* Number of managed     02277000
*                                      msgin requests currently in      02278000
*                                      saved state.                     02279000
*                                      Valid for AMDALEVEL > 0.  @05A*/ 02280000
*      3    AMDMEM_MsgiCurrWiCritMsg FIXED(32), /* Number of currently  02281000
*                                      queued critical messages.        02282000
*                                      Valid for AMDALEVEL > 1.  @L7A*/ 02283000
*      3    AMDMEM_MemberFunction CHAR(24), /* Member FUNCTION as       02284000
*                                      specified on IXCJOIN.            02285000
*                                      Valid for AMDALEVEL > 1.  @L7A*/ 02286000
*      3    AMDMEM_TodWhenJoined CHAR(8), /* TOD when member became     02287000
*                                      active.                          02288000
*                                      Valid for AMDALEVEL > 1.  @L7A*/ 02289000
*      3    AMDMEM_MemStallTime FIXED(16), /* SFM MEMSTALLTIME value    02290000
*                                      used to determine how many       02291000
*                                      seconds the system will allow    02292000
*                                      the sympathy sickness condition  02293000
*                                      to persist before it terminates  02294000
*                                      the member.                      02295000
*                                      Valid for AMDALEVEL > 1.  @L7A*/ 02296000
*      3    AMDMEM_TodWhenStatusChanged Char(8), /* TOD when a member   02297000
*                                      status change was detected or    02298000
*                                      confirmed by the status monitor. 02299000
*                                      Valid if member requested status 02300000
*                                      monitoring and AMDALEVEL > 1.    02301000
*                                                                @L7A*/ 02302000
*      3    AMDMEM_TodWhenStatusChecked Char(8), /* TOD when the        02303000
*                                      member status monitor last       02304000
*                                      checked the member status.       02305000
*                                      Valid if member requested status 02306000
*                                      monitoring and AMDALEVEL > 1.    02307000
*                                                                @L7A*/ 02308000
*      3   * CHAR(58),              /* Reserved                  @P8C*/ 02309000
*                                                                       02310000
*      3   AMDMEM_MsgoDelayedForMISO fixed(32), /* Total number of      02311000
*                                      msgout requests from the         02312000
*                                      subject member that were         02313000
*                                      delayed due to message           02314000
*                                      isolation of the target member.  02315000
*                                      Subject to wrap.                 02316000
*                                      Valid for AMDALEVEL > 2.  @07C*/ 02317000
*      3   AMDMEM_MsgoRejectedForMISO fixed(32), /* Total number of     02318000
*                                      msgout requests from the         02319000
*                                      subject member that were         02320000
*                                      rejected due to message          02321000
*                                      isolation of the target member.  02322000
*                                      Subject to wrap.                 02323000
*                                      Valid for AMDALEVEL > 2.  @07C*/ 02324000
*                                                                       02325000
*      3   AMDMEM_#VMDI FIXED(32),  /* Number of variable length        02326000
*                                      member data items (AMDMEMDI1)    02327000
*                                      returned for this member data    02328000
*                                      entry.  Valid for                02329000
*                                      AMDALEVEL > 2             @L8A*/ 02330000
*      3   AMDMEM_OVMDI FIXED(32),  /* Offset relative to AMDMEM to     02331000
*                                      locate variable length member    02332000
*                                      data items (AMDMEMDI1).  Valid   02333000
*                                      for AMDALEVEL > 2         @L8A*/ 02334000
*      3   AMDMEM_#DataItems fixed, /* Number of data items             02335000
*                                      in the following array    @03A*/ 02336000
*     2   AMDMEM_DataItems(*) char(length(AMDMEMDI)); /* Array of data  02337000
*                                      items.  Each entry is mapped by  02338000
*                                      AMDMEMDI.                 @03A*/ 02339000
*                                                                       02340000
*   DECLARE                                                             02341000
*     1 AMDMEMDI    BASED AMDA_VIA, /* Member data item          @03A*/ 02342000
*      2 AMDMEMDI_HDR,                                                  02343000
*       3 AMDMEMDI_DataType fixed(8), /* Indicates the format of        02344000
*                                      AMDMEMDI_Data.  Your program     02345000
*                                      should skip data items whose     02346000
*                                      type it does not recognize.      02347000
*                                      New data types may be added at   02348000
*                                      any time.                 @03A*/ 02349000
*       3 AMDMEMDI_Subject fixed(8), /* Subject of the data item @03A*/ 02350000
*       3 AMDMEMDI_Flags bit(8),    /*                           @03A*/ 02351000
*          5 AMDMEMDI_Stalled bit,  /* ON if data item could be related 02352000
*                                      to a hang condition.      @03A*/ 02353000
*          5 * bit(7),              /* Reserved                  @03A*/ 02354000
*       3 * CHAR(1),                /* Reserved                  @03A*/ 02355000
*                                                                       02356000
*      2 AMDMEMDI_Data UNION CHAR(60) BDY(WORD), /*              @03A*/ 02357000
*                                                                       02358000
*        3 AMDMEMDI_ExitRoutines,   /* DataType 001: exits       @03A*/ 02359000
*          5 AMDMEMDIxr_Token ptr,  /* exit routine token        @03A*/ 02360000
*          5 AMDMEMDIxr_FunctionCode CHAR(2), /* EBCDIC eyecatcher      02361000
*                                      to indicate function to be       02362000
*                                      performed.                @03A*/ 02363000
*          5 * CHAR(2),             /* Reserved                  @03A*/ 02364000
*          5 AMDMEMDIxr_TodWhenCalled char(8), /* TOD when exit was     02365000
*                                      called.  Hex zero if exit not    02366000
*                                      yet called.               @03A*/ 02367000
*          5 AMDMEMDIxr_TodWhenReturned char(8), /* TOD when exit       02368000
*                                      returned.  Hex zero if exit not  02369000
*                                      yet returned.             @03A*/ 02370000
*          5 AMDMEMDIxr_ProcessStage fixed, /* If exit not yet          02371000
*                                      returned, identifies current     02372000
*                                      stage of processing.      @03A*/ 02373000
*          5 * CHAR(8 * 4),         /* reserved                  @03A*/ 02374000
*                                                                       02375000
*        3 AMDMEMDI_WorkItem,       /* DataType 002: work items  @03A*/ 02376000
*          5 AMDMEMDIwi_Token ptr,  /* work item token           @03A*/ 02377000
*          5 AMDMEMDIwi_FunctionCode CHAR(2), /* EBCDIC eyecatcher      02378000
*                                      to indicate function to be       02379000
*                                      performed.                @03A*/ 02380000
*          5 * CHAR(2),             /* Reserved                  @03A*/ 02381000
*          5 AMDMEMDIwi_TodWhenCreated char(8), /* TOD when work item   02382000
*                                      was created.              @03A*/ 02383000
*          5 AMDMEMDIwi_Item# fixed(32), /* work item number     @03A*/ 02384000
*          5 * CHAR(10* 4),         /* reserved                  @03A*/ 02385000
*                                                                       02386000
*        3 AMDMEMDI_MsgSizes,       /* DataType 003: msg sizes   @03A*/ 02387000
*         5 AMDMEMDIms_BuffLen fixed, /* maximum number of              02388000
*                                      bytes of message data that fit   02389000
*                                      in the message buffer     @03A*/ 02390000
*         5 AMDMEMDIms_MsgoRemoteSent fixed, /* Number of remote        02391000
*                                      signals sent that could have     02392000
*                                      used a signal buffer of this     02393000
*                                      size.                            02394000
*                                      Subject to wrapping.      @03A*/ 02395000
*         5 AMDMEMDIms_MsgoLocalSent fixed, /* Number of local          02396000
*                                      signals sent that could have     02397000
*                                      used a signal buffer of this     02398000
*                                      size.                            02399000
*                                      Subject to wrapping.      @03A*/ 02400000
*          5 * CHAR( 7* 4),         /* reserved                  @03A*/ 02401000
*                                                                       02402000
*        3 AMDMEMDI_SympathySickness, /* DataType 004: sympathy         02403000
*                                      sickness impact.  Valid          02404000
*                                      for AMDALEVEL > 0.        @05A*/ 02405000
*         5 AMDMEMDIss_Systems bit(256), /* Set of systems that appear  02406000
*                                      to be suffering from sympathy    02407000
*                                      sickness for which the subject   02408000
*                                      member is at least partially     02409000
*                                      responsible.  The i'th bit is    02410000
*                                      ON if the system whose XCF       02411000
*                                      system slot number is "i" is     02412000
*                                      being impacted.           @05A*/ 02413000
*         5 AMDMEMDIss_#ImpactedBuffers fixed(32), /* Number of         02414000
*                                      I/O Buffers in use by the        02415000
*                                      stalled member that could be     02416000
*                                      contributing to the sympathy     02417000
*                                      sickness problem.         @05A*/ 02418000
*         5 * CHAR( 6* 4),          /* reserved                  @05A*/ 02419000
*        3 AMDMEMDI_MessageTable,   /* DataType 005: message table.     02420000
*                                      Valid for AMDALEVEL > 1.  @L7A*/ 02421000
*         5 AMDMEMDImt_CurrSendPend Fixed(32), /* Number of requests    02422000
*                                      currently in pending state       02423000
*                                      because a send has not           02424000
*                                      completed.                @L7A*/ 02425000
*         5 AMDMEMDImt_CurrRespPend Fixed(32), /* Number of requests    02426000
*                                      currently in pending state       02427000
*                                      because an expected response has 02428000
*                                      not been received.        @L7A*/ 02429000
*         5 AMDMEMDImt_CurrCompleted Fixed(32), /* Number of requests   02430000
*                                      currently in completed state.    02431000
*                                                                @L7A*/ 02432000
*         5 AMDMEMDImt_CurrMsgoSaved Fixed(32), /* Number of message    02433000
*                                      out requests currently in saved  02434000
*                                      state.                    @L7A*/ 02435000
*         5 AMDMEMDImt_CurrMsgiSaved Fixed(32), /* Number of message    02436000
*                                      in requests currently in saved   02437000
*                                      state.                    @L7A*/ 02438000
*         5 * CHAR(10* 4),          /* reserved                  @L7A*/ 02439000
*      2 * CHAR(0);                 /*                           @03A*/ 02440000
*                                                                       02441000
*   DECLARE                                                             02442000
*     1 AMDMEMDI1   BASED AMDA_VIA, /* Additional member data items.    02443000
*                                      Valid for AMDALEVEL > 2   @L8A*/ 02444000
*      2 AMDMEMDI1_HDR,             /* Same as AMDMEMDI_HDR plus        02445000
*                                      additional information    @L8A*/ 02446000
*        3 AMDMEMDI1_DataType Fixed(8), /* Indicates the format of      02447000
*                                      AMDMEMDI1_Data. Your program     02448000
*                                      should skip data items whose     02449000
*                                      type it does not recognize.      02450000
*                                      New data types may be added at   02451000
*                                      any time.                 @L8A*/ 02452000
*        3 AMDMEMDI1_Subject Fixed(8), /* Subject of the                02453000
*                                      data item                 @L8A*/ 02454000
*        3 AMDMEMDI1_Flags Bit(8), /*                            @L8A*/ 02455000
*          5 AMDMEMDI1_Stalled Bit, /* ON if data item could be related 02456000
*                                      to a hang condition.      @L8A*/ 02457000
*          5 * Bit(7),             /* Reserved                   @L8A*/ 02458000
*        3 * Char(1),              /* Reserved                   @L8A*/ 02459000
*        3 AMDMEMDI1_Length Fixed(16), /* Number of bytes of data       02460000
*                                       returned in this DI1 entry.     02461000
*                                       CAUTION: records are variable   02462000
*                                       length. Number of bytes of      02463000
*                                       data returned vary based on     02464000
*                                       AMDMEMDI1_DataType       @L8A*/ 02465000
*        3 * CHAR(2),              /* Reserved                   @L8A*/ 02466000
*                                                                       02467000
*      2 AMDMEMDI1_Data UNION BDY(WORD),                                02468000
*        3 AMDMEMDI1_MsgIsolated,   /* DataType 006: member message     02469000
*                                      isolation.  Valid                02470000
*                                      for AMDALEVEL > 2.        @L8A*/ 02471000
*          5 AMDMEMDImi_StartIsolETOD Char(16), /* Extended TOD         02472000
*                                      indicating when the most recent  02473000
*                                      message isolation window for     02474000
*                                      this member started.  Zero       02475000
*                                      if never isolated.        @P8C*/ 02476000
*          5 AMDMEMDImi_EndIsolETOD Char(16), /* Extended TOD           02477000
*                                      indicating when a message        02478000
*                                      isolation window for this member 02479000
*                                      most recently ended.  If this    02480000
*                                      ETOD is greater than the above   02481000
*                                      StartIsolETOD, the window is     02482000
*                                      closed.  If less, the window     02483000
*                                      is open.  Zero if window never   02484000
*                                      closed (or a window was never    02485000
*                                      started).                 @P8C*/ 02486000
*          5 AMDMEMDImi_MemIsoSeq#  Fixed(32), /*                       02487000
*                                      Member specific sequence         02488000
*                                      number that identifies the most  02489000
*                                      recent instance of a message     02490000
*                                      isolation window.         @LAC*/ 02491000
*          5 AMDMEMDImi_SystemsImpactedByMiso Bit(256), /* Set of       02492000
*                                      systems that have had            02493000
*                                      message-out send requests        02494000
*                                      rejected or delayed due to the   02495000
*                                      member being message isolated.   02496000
*                                      The i'th bit is ON if the        02497000
*                                      system whose XCF system slot     02498000
*                                      number is "i" is being           02499000
*                                      impacted.                 @P8C*/ 02500000
*          5 AMDMEMDImi_SysIsoSeq#  Fixed(32), /* System specific       02501000
*                                      sequence number that identifies  02502000
*                                      the most recent instance of      02503000
*                                      a message isolation window       02504000
*                                      for the system that hosts the    02505000
*                                      member.                   @P8C*/ 02506000
*          5 AMDMEMDImi_#MISO  Fixed(32), /*  The number of times the   02507000
*                                      member has been "message         02508000
*                                      isolated".                @L9A*/ 02509000
*        3 AMDMEMDI1_SystemImpacted, /* DataType 007: Sending systems   02510000
*                                       impacted by member message      02511000
*                                       isolation.  Valid               02512000
*                                       for AMDALEVEL > 2.       @L8A*/ 02513000
*          5 AMDMEMDIsi_SYSID Fixed(32), /* XCF System ID of system on  02514000
*                                           which impacted member(s)    02515000
*                                           reside               @L8A*/ 02516000
*          5 AMDMEMDIsi_Sysname Char(8), /* Name of a system that has   02517000
*                                           had sending of signals      02518000
*                                           to the member rejected or   02519000
*                                           delayed due to a message    02520000
*                                           isolation condition  @L8A*/ 02521000
*          5 AMDMEMDIsi_StartImpactETOD Char(16), /* ETOD when a        02522000
*                                           message isolation           02523000
*                                           window for a member         02524000
*                                           started impacting a         02525000
*                                           sending system. This is     02526000
*                                           the ETOD when the first     02527000
*                                           send to the member was      02528000
*                                           impacted.            @L8A*/ 02529000
*          5 AMDMEMDIsi_EndImpactETOD Char(16),  /* ETOD when a message 02530000
*                                            isolation window for a     02531000
*                                            member impacting a sending 02532000
*                                            system ended. This is the  02533000
*                                            ETOD when the impacted     02534000
*                                            system received a resume   02535000
*                                            signal indicating message  02536000
*                                            traffic to the member can  02537000
*                                            be resumed.                02538000
*                                            If null, then this means   02539000
*                                            that the impact is still   02540000
*                                            active as far as the       02541000
*                                            sending system is          02542000
*                                            concerned           @L8A*/ 02543000
*          5 AMDMEMDIsi_WhenCollectETOD Char(16),  /* ETOD when the     02544000
*                                            impact data was collected  02545000
*                                            on the impacted            02546000
*                                            system              @L8A*/ 02547000
*          5 AMDMEMDIsi_#sendsRejected Fixed(32),  /* number of send    02548000
*                                            requests rejected on the   02549000
*                                            impacted system beginning  02550000
*                                            at the StartImpactETOD and 02551000
*                                            ending at the              02552000
*                                            EndImpactETOD       @L8A*/ 02553000
*          5 AMDMEMDIsi_#sendsDelayed  Fixed(32),  /* number of send    02554000
*                                            requests delayed on the    02555000
*                                            impacted system beginning  02556000
*                                            at the StartImpactETOD and 02557000
*                                            ending at the              02558000
*                                            EndImpactETOD       @L8A*/ 02559000
*          5 AMDMEMDIsi_Tot#sendsRejected Fixed(32),  /* cumulative     02560000
*                                            number of send requests    02561000
*                                            rejected on the impacted   02562000
*                                            system. This can span      02563000
*                                            multiple isolation         02564000
*                                            windows.            @L9A*/ 02565000
*          5 AMDMEMDIsi_Tot#sendsDelayed  Fixed(32),  /* cumulative     02566000
*                                            number of send requests    02567000
*                                            delayed on the impacted    02568000
*                                            system. This can span      02569000
*                                            multiple isolation         02570000
*                                            windows.            @L9A*/ 02571000
*      2 * CHAR(0);                 /*                           @L8A*/ 02572000
*                                                                       02573000
*   DECLARE                       /* AMDMEMDI_DataType constants @03A*/ 02574000
*     AMDMEMDI_xrDataType constant(1), /* exit routine           @03A*/ 02575000
*     AMDMEMDI_wiDataType constant(2), /* work item              @03A*/ 02576000
*     AMDMEMDI_msDataType constant(3), /* message sizes          @03A*/ 02577000
*     AMDMEMDI_ssDataType constant(4), /* sympathy sickness      @L7C*/ 02578000
*     AMDMEMDI_mtDataType constant(5), /* message table          @P7C*/ 02579000
*     AMDMEMDI_miDataType constant(6), /* message isolation      @L8A*/ 02580000
*     AMDMEMDI_siDataType constant(7); /* system impacted        @L8A*/ 02581000
*                                      /*                        @P7D*/ 02582000
*                                                                       02583000
*   DECLARE                        /* AMDMEMDI_Subject constants @03A*/ 02584000
*     AMDMEMDI_noSubject constant(0), /* global subject          @03A*/ 02585000
*     AMDMEMDI_gpSubject constant(1), /* group services          @03A*/ 02586000
*     AMDMEMDI_siSubject constant(2), /* signalling services     @L7C*/ 02587000
*     AMDMEMDI_cmSubject constant(3), /* critical messages       @L7A*/ 02588000
*                                     /*                         @P7D*/ 02589000
*     AMDMEMDI_smSubject constant(4); /* status monitor          @P7C*/ 02590000
*                                                                       02591000
*   DECLARE                        /* AMDMEMDIxr_ProcessStage           02592000
*                                     constants                  @03A*/ 02593000
*     AMDMEMDI_kNoStage      constant(0), /* no stage identified @03A*/ 02594000
*     AMDMEMDI_kPendingStage constant(1), /* Processing is pending.     02595000
*                                      For example, SRB scheduled but   02596000
*                                      not yet run.              @03A*/ 02597000
*     AMDMEMDI_kSetupStage   constant(2), /* Doing setup work to        02598000
*                                      prepare to do the desired        02599000
*                                      processing.               @03A*/ 02600000
*     AMDMEMDI_kRunningStage constant(3), /* In midst of doing the      02601000
*                                      desired processing.       @L7C*/ 02602000
*                                                                       02603000
*     AMDMEMDI_kFailedStage constant(4), /* The exit has failed  @L7A*/ 02604000
*     AMDMEMDI_kDeactivatedStage constant(5); /* The exit routine has   02605000
*                                      been deactivated due to errors   02606000
*                                                                @L7A*/ 02607000
*                                                                       02608000
*/********************************************************************* 02609000
**                                                                   ** 02610000
**             Constants for Hardware Descriptor Types               ** 02611000
**                                                                   ** 02612000
**************************************************************** @L2A*/ 02613000
*   DECLARE                                                             02614000
*     AMHDTNA  CONSTANT(0),        /* Hardware type not applicable,     02615000
*                                     ignore hardware descriptor        02616000
*                                     data.                      @L3A*/ 02617000
*     AMHDTCTC CONSTANT(1),        /* CTC device.                @L3C*/ 02618000
*     AMHDTSTR CONSTANT(2),        /* CF Structure (summary)     @L2A*/ 02619000
*     AMHDTLST CONSTANT(3);        /* A list within a CF structure      02620000
*                                                                @L2A*/ 02621000
*                                                                       02622000
*/********************************************************************* 02623000
**                                                                   ** 02624000
**               Mappings for Hardware Descriptor Data               ** 02625000
**                                                                   ** 02626000
**************************************************************** @L2A*/ 02627000
*   DECLARE                                                             02628000
*     1    AMCTCHDD BASED AMDA_VIA CHAR(32) BDY(WORD), /* Path hardware 02629000
*                                    descriptor for                     02630000
*                                    CTC devices.                @L2A*/ 02631000
*      3    AMCTCDEV CHAR(4),      /* Device number (EBCDIC)     @L2A*/ 02632000
*      3    *        CHAR(28);     /* Unused, set to zero.       @L2A*/ 02633000
*                                                                       02634000
*   DECLARE                                                             02635000
*     1    AMSTRHDD BASED AMDA_VIA CHAR(32) BDY(WORD), /* Path hardware 02636000
*                                    descriptor for a CF List           02637000
*                                    structure.                  @L2A*/ 02638000
*      3    AMSTRNAM CHAR(16),     /* Structure name (EBCDIC)    @L2A*/ 02639000
*      3    AMSTR#AV FIXED(32),    /* Number of lists that              02640000
*                                     remain available for use (either  02641000
*                                     as PATHIN or PATHOUT).  Zero if   02642000
*                                     list structure is considered      02643000
*                                      inoperative.              @L4C*/ 02644000
*      3    AMSTR#OD FIXED(32),    /*                                   02645000
*                        Number of other systems connected to this      02646000
*                        structure that desire to establish signalling  02647000
*                        paths in the opposite direction.  This system  02648000
*                        is not included in the count.  The count is    02649000
*                        zero if the list structure is considered       02650000
*                        inoperative.                                   02651000
*                                                                @L4C*/ 02652000
*      3    AMSTR#LP FIXED(32),    /*                                   02653000
*                           Number of list signalling paths started by  02654000
*                           this system in the indicated direction for  02655000
*                           this list structure.  The count includes    02656000
*                           inoperative list paths.                     02657000
*                                                                @L4C*/ 02658000
*      3    *        CHAR( 4);      /* Unused, set to zero.      @L3C*/ 02659000
*                                                                       02660000
*   DECLARE                                                             02661000
*     1    AMLSTHDD BASED AMDA_VIA CHAR(32) BDY(WORD), /* Path hardware 02662000
*                                    descriptor for a particular list   02663000
*                                    within a CF List structure @L2A*/  02664000
*      3    AMLSTSTR  CHAR(16),    /* Structure name (EBCDIC)    @L2A*/ 02665000
*      3    AMLSTNUM  Fixed(32),   /* List number                @L2A*/ 02666000
*      3    *        CHAR(12);     /* Unused, set to zero.       @L2A*/ 02667000
*/* End of PL/X Source                                               */ 02668000
* %IF IXCYAMDA_LIST ^= 'NO' &                                           02669000
*    ZCBPRINT ^= 'NO' %THEN                                             02670000
*   %GOTO IXCYAMDA_4;                                                   02671000
*   @LIST POP NOECHO;                                                   02672000
* %IXCYAMDA_4:;                                                         02673000
* %END;                                                                 02674000
