*                                                                       00001000
* %DCL IXGENF_INCLUDED CHAR EXT;                                        00002000
* %DEACTIVATE IXGENF_INCLUDED;                                          00003000
* %IF IXGENF_INCLUDED = '' %THEN                                        00004000
* %DO;                                                                  00005000
*/* Macro made bi-lingual on 05091. CBGEN compile date 05056         */ 00006000
*% /*                                                                   00007000
         MACRO                                                          00008000
         IXGENF &DSECT=YES,&LIST=YES,&TITLE=YES,&IXGENF=YES             00009000
         GBLC  &IXGENF_INCLUDED                                         00010000
         GBLC  &ZCBPRINT                                                00011000
&IXGENF_INCLUDED SETC 'YES'                                             00012000
         AIF   ('&LIST' EQ 'NONE').P0                                   00013000
         AIF   ('&TITLE' EQ 'NO').P5                                    00014000
 TITLE   'IXGENF  - Event Notification Facility Signal Parameter List  *00015000
               '                                                        00016000
.P5      ANOP                                                           00017000
**/ IXGENF_1:;                                                          00018000
*/*START OF SPECIFICATIONS ******************************************** 00019000
*                                                                       00020000
* ACRONYM: IXGENF                                                       00021000
*                                                                       00022000
* MACRO-NAME: IXGENF                                                    00023000
*                                                                       00024000
* DESCRIPTIVE-NAME: Event Notification Facility Signal Parameter List   00025000
*                                                                       00026000
**/                                                                     00027000
*/*01* PROPRIETARY STATEMENT=                                        */ 00028000
*/***PROPRIETARY_STATEMENT********************************************/ 00029000
*/*                                                                  */ 00030000
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00031000
*/* 5650-ZOS                                                         */ 00033000
*/* COPYRIGHT IBM CORP. 1994, 2019                                   */ 00034300
*/*                                                                  */ 00035000
*/* STATUS = HBB77A0                                                 */ 00036308
*/*                                                                  */ 00037000
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 00038000
*/*                                                                     00039000
*                                                                       00040000
* FUNCTION: Mapping of parameter list passed to ENF listening           00041000
*           routine to communicate MVS System Logger                    00042000
*           event information.                                          00043000
*                                                                       00044000
*                                                                       00045000
*01* DSECT NAME:  IXGENF                                                00046000
*                                                                       00047000
*01* COMPONENT: System Logger (SCLOG)                                   00048000
*                                                                       00049000
*01* EYE CATCHER: ENF                                                   00050000
*02*   OFFSET:    0                                                     00051000
*02*   LENGTH:    4 bytes                                               00052000
*                                                                       00053000
*01* STORAGE ATTRIBUTES:                                                00054000
*02*   SUBPOOL:                                                         00055000
*02*   KEY: 0                                                           00056000
*02*   ALLOCATION-METHOD:  STORAGE OBTAIN                               00057000
*02*   FREQUENCY: Once per ENF signal issued                            00058000
*                                                                       00059000
*01* SIZE:                                                              00060000
*        IXGENF                 -- total of two sections:          @LBC 00061000
*          IxgenfCommon            -- X'003C' (60 dec) bytes       @LBA 00062000
*          IxgenfUnion1            -- max of following:            @LBA 00063000
*      this  IxgenfResMgrDisabled     -- X'0046' (70 dec) bytes    @LBA 00064000
*        or  IxgenfInventoryDefUpdate -- X'00E0' (224 dec) bytes   @LBA 00065000
*        or  IxgenfInventoryDelete    -- X'0032' (50 dec) bytes    @LBA 00066000
*        or  IxgenfConnDiscInfo       -- X'0074' (116 dec) bytes   @LBA 00067000
*        or  IxgenfWrOffLoadInfo      -- X'002A' (42 dec) bytes    @LBA 00068000
*        or  IxgenfLogStreamNames     -- X'001A' (26 dec) bytes    @LBA 00069000
*                                        times value in field      @LBA 00070000
*                                        IxgenfLogStreamCount      @LBA 00071000
*                                                                       00072000
*01* CREATED BY: System Logger modules issuing an ?ENFREQ               00073000
*                ACTION(SIGNAL) macro to send the ENF 48 signal         00074000
*                to the registered listeners of ENF 48.                 00075000
*                                                                       00076000
*01* DELETED BY: ENF, once all ENF listen exits on the system have      00077000
*                been driven                                            00078000
*                                                                       00079000
*01* POINTED TO BY: On entry to the ENF listen exit, register 1 points  00080000
*                   to a word which contains the address of the         00081000
*                   IXGENF data area                                    00082000
*                                                                       00083000
*01* SERIALIZATION:  Serialized by the ENF component                    00084000
*                                                                       00085000
*01* EXTERNAL CLASSIFICATION: GUPI                                      00086000
*01* END OF EXTERNAL CLASSIFICATION:                                    00087000
*                                                                       00088000
*01* METHOD OF ACCESS:                                                  00089000
*                                                                       00090000
*    PLAS: %INCLUDE SYSLIB(IXGENF)                                      00091000
*    ASM:  IXGENF USING on IXGENF                                       00092000
*                                                                       00093000
*    Changes to the mapping of this macro should be documented          00094000
*    in "Conversion Notebook for MVS/ESA - System Product Version x"    00095000
*    so that all registered listeners of ENF Signal 48 are made         00096000
*    aware that programs using this mapping macro should                00097000
*    be reassembled to pick up the latest changes.                      00098000
*                                                                       00099000
*                                                                       00100000
* DEPENDENCIES:  Must be freed by the ENF component when all ENF        00101000
*                listen exits have been driven.                         00102000
*                                                                       00103000
*                                                                       00104000
*01* DISTRIBUTION LIBRARY:  AMACLIB                                     00105000
*                                                                       00106000
* CHANGE-ACTIVITY:                                                      00107000
*                                                                       00108000
*   $L0=LOGR HBB5520 931202  PDC9: System Logger                        00109000
*   $L2=LOGR HBB5520 940310  PDC9: Add IxgenfVolatilityStateChange,     00110000
*                                  IxgenfVolatilityState and            00111000
*                                  IxgenfSystemLoggerNotAvailForIPL     00112000
*   $L3=LOGR HBB5520 940414  PDC9: Driver 8                             00113000
*   $L4=LOGR HBB5520 940602  PDC9: Driver 9                             00114000
*                                 - Add IxgenfLossOfData                00115000
*                                 - Complete re-alignment of events     00116000
*                                   and detailed information associated 00117000
*                                   with each event                     00118000
*   $L5=LOGR HBB5520 940728  PDC9: Driver 10                            00119000
*                                 - SHOWHDR compatability               00120000
*                                 - Add IxgenfXESrecommendaction        00121000
*                                   reason and IxgenfLossofConnectivity 00122000
*                                   specific information                00123000
*                                 - Rename IxgEnfStructureNotFull to    00124000
*                                   IxgEnfLogstreamStorageAvailable     00125000
*   $L6=LOGR HBB5520 940908  PDC9: Driver 10 ASAP                       00126000
*                                 - Add IxgenfComponentError reason     00127000
*                                   indicator                           00128000
*   $L7=LOGR HBB5520 940912  PDC9: Driver 11                            00129000
*                                 - Add IxgenfLogstreamDisconnected     00130000
*                                   specific information indicator      00131000
*   $Q1=PN71616 HBB5520 941031  PDC9: Staging Dataset Support           00132000
*                                 - Delete IxgenfVolatilityStateChange  00133000
*                                   and IxgenfVolatilityState           00134000
*                                 - Add IxgEnfStagingDsStorageAvailable 00135000
*   $01=OW11809 HBB5520 950321  PDC9: Structure Resource Change Support 00136000
*                                 - Add IxgenfStrResourceChange         00137000
*                                                   (TRSQ PTM PN72377)  00138000
*   $L8=RSR  HBB6603 960119  PDXD: Remote Site Recovery                 00139000
*   $L9=LOGR4   JBB6604 960930  PDDZ:  DASD Only Log Streams       @L9A 00140000
*   $LA=CFDUP   HBB7705 000926  PDJL:  CF Auto-duplexing support   @LAA 00141000
*   $P1=PX00841 HBB7705 001109  PDJL:  Match var names in ASM&PLX  @P1A 00142000
*   $P2=PX00909 HBB7705 001117  PDDZ:  corrupted file in clear     @P2A 00143000
*   $LB=LSDYN   HBB7706 010628  PDDZ:  Pending updates             @LBA 00144000
*   $P3=PYM0328 HBB7706 010709  PDDZ:  Stg_Duplex pending updates  @P3A 00145000
*   $LC=XRCLOG  HBB7720 040116  PDDZ:  XRC+ Ixglogr=NoStart and         00146000
*                                           duplexmode(drxrc)      @LCA 00147000
*   $LD=FDISC   HBB7720 040813  PDNJ:  Force Disconnect/Delete Support  00148000
*                                                                  @LDA 00149000
*   $LE=FDISC   HBB7720 040901  PDNJ:  Force Disconnect/Delete Support  00150000
*                                                                  @LEA 00151000
*   $LF=FDISC   HBB7720 041020  PDDZ:  correct logstream name source    00152000
*   $LG=LOGSEP  HBB7730 050401  PD00A8: Separation Support              00153000
*   $P4=ME10027 HBB7750 070518  PDDZ:  prolog cleanup              @P4A 00153100
*   $02=OA38747 HBB7780 120828  PDDZ: Logger ZAI support           @02A 00153200
*   $03=OA53111 HBB77A0 170629  PDDZ: ZAI TPNAME - stack affinity  @03A 00153300
*   $04=OA54815 HBB77A0 181207 PDDZ: single-system LOGRZ/LOGRY CDS @04A 00153408
*                                                                       00153500
*END OF SPECIFICATIONS ***********************************************/ 00155000
*% /*                                                                   00156000
.P0      ANOP                                                           00157000
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 00158000
         AIF   ('&LIST' EQ 'YES').P2                                    00159000
.P1      ANOP                                                           00160000
         PUSH  PRINT                                                    00161000
         PRINT OFF                                                      00162000
.P2      ANOP                                                           00163000
         AIF   ('&IXGENF' EQ 'NO').L0002                                00164000
         AIF   ('&DSECT' EQ 'YES').L0003                                00165000
         AIF   ('&IXGENF' NE 'YES').L0002                               00166000
IXGENF   DS    0D        LOGR Event Notification Parameter List         00167000
         AGO   .L0004                                                   00168000
.L0003   ANOP                                                           00169000
IXGENF   DSECT           LOGR Event Notification Parameter List         00170000
.L0004   ANOP                                                           00171000
IXGENFCOMMON DS 0CL60                                                   00172000
IXGENFACRONYM DS CL4     Eyecatcher C'ENF '                             00173000
IXGENFCOMPONENT DS CL5   Component Acronym                              00174000
IXGENFUSECDSTYPE  DS B   CDS data type indication                  @04A 00175008
IXGENFUSECDSTYPEISSET EQU X'80'  when on, means one of the following    00176004
*                                      CDS data type flags is set on    00176103
*                                     when off, means sysplex scope     00176204
*                                      LOGR CDS type expected for use   00176307
*                                      on the system originating        00176402
*                                      the ENF signal              @04A 00176508
IXGENFUSECDSTYPELOGR  EQU X'40'     (valid only when                    00176601
*                                    IxgenfUseCdsTypeIsSet in on,       00176701
*                                    otherwise undefined)               00176801
*                                  when on, means sysplex scope         00176904
*                                      LOGR CDS type expected for use   00177007
*                                      on the system originating        00177101
*                                      the ENF signal              @04A 00177208
IXGENFUSECDSTYPELOGRY EQU X'20'     (valid only when                    00177301
*                                    IxgenfUseCdsTypeIsSet in on,       00177401
*                                    otherwise undefined)               00177501
*                                  when on, means single-system         00177604
*                                      scope LOGRY CDS type expected    00177701
*                                      for use on system originating    00177801
*                                      the ENF signal              @04A 00177908
IXGENFUSECDSTYPELOGRZ EQU X'10'     (valid only when                    00178201
*                                    IxgenfUseCdsTypeIsSet in on,       00178301
*                                    otherwise undefined)               00178401
*                                  when on, means single-system         00178504
*                                      scope LOGRZ CDS type expected    00178601
*                                      for use on system originating    00178701
*                                      the ENF signal              @04A 00178808
         DS    CL2       Unused                                    @04C 00179108
IXGENFEVENTS DS 0BL4     Event Flags                                    00179201
IXGENFEVENTSBYTE0 DS 0B                                                 00179301
IXGENFSYSTEMLOGGERAVAIL EQU X'80' MVS System Logger Services           *00179401
                         available.                                     00179501
IXGENFSYSTEMLOGGERNOTAVAILFORIPL EQU X'40' MVS System Logger Services  *00180000
                         are not available for the duration of this    *00181000
                         IPL. A Re-IPL of the system is necessary to   *00182000
                         activate MVS System Logger Services. See      *00183000
                         IxgenfEventReasons for the reasons why Logger *00184000
                         is not available for this IPL.                 00185000
IXGENFLOGSTREAMSAVAILABLE EQU X'20' Logstream resources mapped to the  *00186000
                         structure named in IxgenfStrname are          *00187000
                         available for use. See IxgenfEventReasons for *00188000
                         the specific reason logstream resources for   *00189000
                         the affected logstreams are available.         00190000
IXGENFLOGSTREAMSNOTAVAILABLE EQU X'10' Logstream resources mapped to   *00191000
                         the structure named in IxgenfStrname are not  *00192000
                         available for use. See IxgenfEventReasons for *00193000
                         the specific reason logstream resources for   *00194000
                         the affected logstreams are not available.     00195000
IXGENFLOGSTREAMRESOURCECHANGE EQU X'08' A change in the state of the   *00196000
                         resources allocated to the logstreams listed  *00197000
                         has occurred.                                  00198000
IXGENFSYSTEMLOGGERRESOURCECHG EQU X'04' A change in the state of       *00199000
                         resources that the System Logger has interest *00200000
                         in has occurred (i.e. coupling facility       *00201000
                         resource change)                               00202000
IXGENFLOGSTREAMCONNDISC EQU X'02' A connection to or a disconnection   *00203000
                         from a log has been successful in the sysplex  00204000
         ORG   IXGENFEVENTSBYTE0+1                                      00205000
IXGENFEVENTSBYTE1 DS 0B                                                 00206000
IXGENFLOGSTREAMDEFUPDATE EQU X'80' Either a log stream has been        *00207000
                         defined or its defintion has been updated      00208000
IXGENFLOGSTREAMDELETE EQU X'40' Log stream definition deleted from     *00209000
                         Logger inventory                               00210000
IXGENFLOGSTREAMOFFLOADCOMPLETE EQU X'20' A writer offload event for    *00211000
                         the log stream has completed                   00212000
IXGENFRMDISABLED EQU X'10' The resource manager associated with the    *00213000
                         log stream has been disabled because it       *00214000
                         abended and did not recover                    00215000
IXGENFZAILOCCHG  EQU X'08' System logger parameter options change      *00216000
                         occurred for ZAI SERVER, TPNAME               *00217000
                         and/or PORT values.                           *00218000
                         Refer to IXGQUERY REQUEST=ZAILOCINFO and      *00219000
                         IXGQZBUF mapping for details.             @03C 00220000
         ORG   IXGENFEVENTSBYTE1+1                                      00220100
IXGENFEVENTSBYTE2 DS B                                                  00220200
IXGENFEVENTSBYTE3 DS B                                                  00220300
IXGENFEVENTREASONS DS 0BL4 Specific reasons that the events are being  *00220400
                         reported for.                                  00220500
IXGENFEVENTREASONSBYTE0 DS 0B                                           00221000
IXGENFSTRREBUILDSTART EQU X'80' Structure Rebuild processing for a log *00222000
                         stream has begun. Programs connected to an    *00223000
                         affected log stream are expected to cease     *00224000
                         invoking MVS System Logger functions. If any  *00225000
                         functions are invoked against an affected log *00226000
                         stream, they are rejected. This reason is     *00227000
                         valid for event IxgenfLogstreamsNotAvailable   00228000
IXGENFSTRREBUILDCOMPLETE EQU X'40' Structure Rebuild processing for a  *00229000
                         log stream has completed. Programs may resume *00230000
                         invoking MVS System Logger functions This     *00231000
                         reason is valid for event                     *00232000
                         IxgenfLogstreamsAvailable.                     00233000
IXGENFSTRREBUILDFAILED EQU X'20' Structure Rebuild processing has      *00234000
                         failed. Connections to the structure named in *00235000
                         IxgenfStrName from this system are in a       *00236000
                         failed state. Requests for the affected log   *00237000
                         stream(s) are rejected. This reason is valid  *00238000
                         for event IxgenfLogstreamsNotAvailable         00239000
IXGENFSTAGINGDSSTORAGEAVAILABLE EQU X'10' Reclamation of staging data  *00240000
                         set space has completed. Staging data set     *00241000
                         space is now available for use by the subject *00242000
                         logstream. This reason is valid for event     *00243000
                         IxgenfLogstreamsAvailable.                     00244000
IXGENFLOGSTREAMSTORAGEAVAILABLE EQU X'08' Migration of logstream data  *00245000
                         to DASD to reach the low threshold value of   *00246000
                         the current logstream storage consumption     *00247000
                         limit has completed. Coupling facility        *00248000
                         storage is now available for use by the       *00249000
                         subject logstream. This reason is valid for   *00250000
                         event IxgenfLogstreamsAvailable.               00251000
IXGENFLOSSOFDATA EQU X'04' A loss of data condition may exist for the  *00252000
                         affected logstream(s). This reason is valid   *00253000
                         for event IxgenfLogstreamResourceChange.       00254000
IXGENFCFRESOURCECHANGE EQU X'02' A change in the state of coupling     *00255000
                         facility resources has occurred and reported  *00256000
                         by ENF 35. When the resource change is        *00257000
                         related to a specific coupling facility       *00258000
                         structure, IxgenfStrName will contain the     *00259000
                         name of the structure that was affected by    *00260000
                         the resource change. This reason is valid for *00261000
                         event IxgenfSystemLoggerResourceChg.           00262000
IXGENFXESRECOMMENDACTION EQU X'01' A XES Recommend Action event was    *00263000
                         received by the MVS System Logger Structure   *00264000
                         Event Exit instructing System Logger to       *00265000
                         discontinue use (disconnect from) of the      *00266000
                         structure named in IxgenfStrName. The XES     *00267000
                         recommended action is based on installation   *00268000
                         specified SFM and CFRM policy values.         *00269000
                         Connections to the affected logstream(s) have *00270000
                         been terminated by System Logger. This reason *00271000
                         is valid for event                             00272000
*                        IxgenfLogstreamsNotAvailable.                  00273000
         ORG   IXGENFEVENTREASONSBYTE0+1                                00274000
IXGENFEVENTREASONSBYTE1 DS 0B                                           00275000
IXGENFCOMPONENTERROR EQU X'80' A system logger component error has     *00276000
                         occurred. The System Logger had to            *00277000
                         discontinue use (disconnect from) of the      *00278000
                         structure named in IxgenfStrName. Connections *00279000
                         to the affected logstream(s) have been        *00280000
                         terminated by System Logger. This reason is   *00281000
                         valid for event IxgenfLogstreamsNotAvailable.  00282000
IXGENFSTRRESOURCECHANGE EQU X'40' Resources in the structure named in  *00283000
                         IxgenfStrName have become available. Requests *00284000
                         that were rejected due to a structure         *00285000
                         resource shortage or structure full condition *00286000
                         should be attempted again.                     00287000
IXGENFREQLOGRESNOTAVAIL EQU X'20' Logger required resources are not    *00288000
                         available (e.g. staging dataset could not be  *00289000
                         allocated)                                     00290000
IXGENFLOGGERNOTAVAILXCFLOCAL EQU X'10' PLEXCFG=XCFLOCAL, not in        *00291000
                         sysplex mode. This reason is valid for event  *00292000
                         IxgenfSystemLo ggerNotAvailForIPL.             00293000
IXGENFLOGGERNOTAVAILNOSTART EQU X'08' IXGLOGR=NOSTART on LOGR subsys   *00294000
                         specification. This reason is valid for event *00295000
                         IxgenfSystemLo ggerNotAvailForIPL.             00296000
IXGENFSETLOGRFORCEDISCONNECT EQU X'04' Force Disconnect operation has  *00297000
                         been completed. This reason is only valid for *00298000
                         event IxgenfLogstreamsNotAvailable.            00299000
IXGENFSYSTEMLEVELDISC EQU X'02' The disconnect event is for a system   *00300000
                         level. It signals that the last disconnect    *00301000
                         for a log stream on this system has been      *00302000
                         completed.                                     00303000
IXGENFSETLOGRFORCEDELETE EQU X'01' Force Delete operation has          *00304000
                         completed. The logstream referred             *00305000
                         to by IxgenfInventoryDelLogStreamName         *00306000
                         has been deleted from the                     *00307000
                         LOGR Couple Data Set as a result of the       *00308000
                         command request. This reason is only valid    *00309000
                         for event IxgenfLogStreamDelete.          @LFC 00309100
         ORG   IXGENFEVENTREASONSBYTE1+1                                00310000
IXGENFEVENTREASONSBYTE2 DS B                                            00311000
IXGENFEVENTREASONSBYTE3 DS B                                            00312000
IXGENFEVENTSPECIFICINFO DS 0BL4 Event Specific Information that        *00313000
                         provides additional information about the     *00314000
                         reported event and the reason that the event  *00315000
                         is reported.                                   00316000
IXGENFEVENTSPECIFICINFOBYTE0 DS 0B                                      00317000
IXGENFSTRREBUILDFAILLOSSCONN EQU X'80' This bit is only valid when     *00318000
                         IxgenfStrRebuildFailed is ON. Structure       *00319000
                         Rebuild processing has failed. A loss of      *00320000
                         connectivity to the structure named in        *00321000
                         IxgenfStrname has left this system with no    *00322000
                         coupling facility resources allocated to the  *00323000
                         affected log stream(s).                        00324000
IXGENFSTRREBUILDFAILSTRFAIL EQU X'40' This bit is only valid when      *00325000
                         IxgenfStrRebuildFailed is ON. Structure       *00326000
                         Rebuild processing has failed. A structure    *00327000
                         failure to the structure named in             *00328000
                         IxgenfStrname has left this system with no    *00329000
                         coupling facility resources allocated to the  *00330000
                         affected log stream(s).                        00331000
IXGENFSTRREBUILDCFDUPLEX EQU X'20' On = CF Auto-duplex rebuild is in   *00332000
                         progress                                       00333000
IXGENFLOSSOFCONNECTIVITY EQU X'10' This bit is only valid when         *00334000
                         IxgenfXESrecommendaction is ON. The XES       *00335000
                         Recommend Action event was initiated due to a *00336000
                         loss of connectivity between the coupling     *00337000
                         facility structure named in IxgenfStrName and *00338000
                         the system that the ENF Listener exit that    *00339000
                         receives this parameter list is executing on.  00340000
IXGENFLOGSTREAMDISCONNECTED EQU X'08' This bit is only valid when      *00341000
                         IxgenfXESrecommendaction is ON,               *00342000
                         IxgenfComponentError is ON, or                *00343000
                         IxgSetLogrForceDisconnect is ON. Connections  *00344000
                         to the affected logstream(s) have been        *00345000
                         terminated by System Logger. The streamtoken  *00346000
                         that uniquely defined the connection has been *00347000
                         invalidated. All connectors should clean up   *00348000
                         information related to the invalidated        *00349000
                         streamtoken.                                   00350000
IXGENFSTGALLOCERR EQU X'04' Staging Data set could not be allocated     00351000
         ORG   IXGENFEVENTSPECIFICINFOBYTE0+1                           00352000
IXGENFEVENTSPECIFICINFOBYTE1 DS B                                       00353000
IXGENFEVENTSPECIFICINFOBYTE2 DS B                                       00354000
IXGENFEVENTSPECIFICINFOBYTE3 DS B                                       00355000
IXGENFSTRNAME DS CL16    Structure name that is the subject of the     *00356000
                         event being signalled (not provided if the    *00357000
                         event is not structure related).               00358000
IXGENFLOGSTREAMCOUNT DS F Number of log streams that are connected to  *00359000
                         the structure and affected by the reported    *00360000
                         event                                          00361000
         DS    CL16      Unused - Available                             00362000
IXGENFUNION1 DS 0C                                                      00363000
         ORG   IXGENFUNION1                                             00364000
IXGENFRESMGRDISABLED DS 0CL70 Resource Manager exit has been disabled   00365000
IXGENFRESMGRGMTTIMESTAMP DS BL8 Time stamp                              00366000
IXGENFRESMGRLOGSTREAMNAME DS CL26 log stream name                       00367000
IXGENFRESMGRNAME DS CL8  Resource Manager associated with this log     *00368000
                         stream.                                        00369000
IXGENFRESMGRDATA DS CL8  Resource Manager Data.                         00370000
IXGENFRESMGRLSDESCRIPTION DS CL16 Description associated with the log  *00371000
                         stream                                         00372000
IXGENFRESMGRABENDCODE DS CL4 Copy of SDWAABCC if an sdwa was available *00373000
                         when the resource manager was disabled else   *00374000
                         binary zeroes                                  00375000
         ORG   IXGENFUNION1                                             00376000
IXGENFINVENTORYDEFUPDATE DS 0CL224 Log stream define or update section  00377000
IXGENFINVENTORYDEFUPDATE1 DS 0CL148 Original portion of define update  *00378000
                         section                                        00379000
IXGENFINVENTORYGMTTIMESTAMP DS BL8 Time stamp                           00380000
IXGENFINVENTORYSYSNAME DS CL8 System name on which the define or       *00381000
                         update occurred                                00382000
IXGENFINVENTORYLOGSTREAMNAME DS CL26 Log stream name                    00383000
IXGENFINVENTORYLOGSTREAMDEFTIME DS BL8 Set to binary zeroes for log    *00384000
                         streams defined or changed prior to OS390R3.  *00385000
                         For log streams defined when OS390R3 is       *00386000
                         installed, this field contains the define     *00387000
                         time. For log streams defined before OS390R3  *00388000
                         and updated after OS390R3 is installed, this  *00389000
                         field contains the time of first update.       00390000
IXGENFINVENTORYRESMGRNAME DS CL8 Resource Manager associated with this *00391000
                         log stream. If binary zeroes, no resource mgr *00392000
                         is associated with this log stream             00393000
IXGENFINVENTORYSTRUCTNAME DS CL16 CF structure name to which the log   *00394000
                         stream maps                                    00395000
IXGENFINVENTORYFLAGS DS 0BL2 Flags                                      00396000
IXGENFINVENTORYFLAGS0 DS 0B Flags byte 0                                00397000
IXGENFINVENTORYDEFINEREQ EQU X'80' If set, request is to define a log  *00398000
                         stream                                         00399000
IXGENFINVENTORYUPDATEREQ EQU X'40' If set, request is to update the    *00400000
                         log stream definition                          00401000
IXGENFINVENTORYSTGDUPLEXYES EQU X'20' If set, STG_DUPLEX=YES in        *00402000
                         effect. Refer to Duplexmode flags             *00403000
                         IxgenfInventoryStgModeCond and                *00404000
                         IxgenfInventoryStgModeDRXRC                    00405000
IXGENFINVENTORYSTGMODECOND EQU X'10' If set, DuplexMode=Cond in        *00406000
                         effect. If set off, then when                 *00407000
                         IxgenfInventoryStgModeDRXRC is also off, then *00408000
                         DuplexMode=Uncond.                             00409000
IXGENFINVENTORYMODELYES EQU X'08' If set, this is a log stream model   *00410000
                         definition                                     00411000
IXGENFINVENTORYDASDONLYYES EQU X'04' If set, this is a DASD only log   *00412000
                         stream definition                              00413000
IXGENFINVENTORYLOGGERDUPLEXCOND EQU X'02' If set, LOGGERDUPLEX=COND is *00414000
                         in effect                                      00415000
IXGENFINVENTORYEXT1 EQU X'01' If set, IxgenfInventoryExt1Area section  *00416000
                         is provided in the Enf area                    00417000
         ORG   IXGENFINVENTORYFLAGS0+1                                  00418000
IXGENFINVENTORYFLAGS1 DS 0B Flags byte 1                                00419000
IXGENFINVENTORYAUTODELETE EQU X'80' If set, AutoDelete(Yes)             00420000
IXGENFINVENTORYOFFRECALL EQU X'40' If set, OffloadRecall(Yes)           00421000
IXGENFINVENTORYSTGMODEDRXRC EQU X'20' If set, DuplexMode=DRXRC in      *00422000
                         effect. Also see flag                         *00423000
                         IxgenfInventoryStgModeCond                     00424000
         ORG   IXGENFINVENTORYFLAGS+2                                   00427000
IXGENFINVENTORYSTGDATACLAS DS CL8 Data class for staging data sets      00428000
IXGENFINVENTORYSTGMGMTCLAS DS CL8 Mgmt class for staging data sets      00429000
IXGENFINVENTORYSTGSTORCLAS DS CL8 Storage class for staging data sets   00430000
IXGENFINVENTORYLSDATACLAS DS CL8 Data class for log stream data sets    00431000
IXGENFINVENTORYLSMGMTCLAS DS CL8 Mgmt class for log stream data sets    00432000
IXGENFINVENTORYLSSTORCLAS DS CL8 Storage class for log stream data     *00433000
                         sets                                           00434000
IXGENFINVENTORYLOWOFFLOAD DS F Low offload threshold                    00435000
IXGENFINVENTORYHIGHOFFLOAD DS F High offload threshold                  00436000
IXGENFINVENTORYLSDESCRIPTION DS CL16 Logstream description              00437000
IXGENFINVENTORYEXT1AREA DS 0CL76 This area included in the Enf         *00438000
                         parameter area when IxgenfInventoryExt1 is on  00439000
IXGENFINVENTORYPENDUPDFLAGS DS 0BL8 These flags indicate that the      *00440000
                         associated field is in a "Pending Update"     *00441000
                         state and not yet commited.                    00442000
IXGENFINVENTORYPENDUPDFLAGS0 DS 0B Flags 0                              00443000
IXGENFINVENTORYRETPDPENDUPD EQU X'80'                                   00444000
IXGENFINVENTORYAUTODELETEPENDUPD EQU X'40'                              00445000
IXGENFINVENTORYOFFLOADRECALLPENDUPD EQU X'20'                           00446000
IXGENFINVENTORYLSSIZEPENDUPD EQU X'10'                                  00447000
IXGENFINVENTORYLSDATACLASPENDUPD EQU X'08'                              00448000
IXGENFINVENTORYLSMGMTCLASPENDUPD EQU X'04'                              00449000
IXGENFINVENTORYLSSTORCLASPENDUPD EQU X'02'                              00450000
IXGENFINVENTORYLOWOFFLOADPENDUPD EQU X'01'                              00451000
         ORG   IXGENFINVENTORYPENDUPDFLAGS0+1                           00452000
IXGENFINVENTORYPENDUPDFLAGS1 DS 0B Flags 1                              00453000
IXGENFINVENTORYHIGHOFFLOADPENDUPD EQU X'80'                             00454000
IXGENFINVENTORYSTGSIZEPENDUPD EQU X'40'                                 00455000
IXGENFINVENTORYSTGDATACLASPENDUPD EQU X'20'                             00456000
IXGENFINVENTORYSTGMGMTCLASPENDUPD EQU X'10'                             00457000
IXGENFINVENTORYSTGSTORCLASPENDUPD EQU X'08'                             00458000
IXGENFINVENTORYMAXBUFSIZEPENDUPD EQU X'04'                              00459000
IXGENFINVENTORYLOGGERDUPLEXPENDUPD EQU X'02'                            00460000
IXGENFINVENTORYSTGDUPLEXYESPENDUPD EQU X'01'                            00461000
         ORG   IXGENFINVENTORYPENDUPDFLAGS1+1                           00462000
IXGENFINVENTORYPENDUPDFLAGS2 DS 0B Flags 2                              00463000
IXGENFINVENTORYDUPLEXMODECONDPENDUPD EQU X'80'                          00464000
IXGENFINVENTORYDUPLEXMODEDRXRCPENDUPD EQU X'40'                         00465000
         ORG   IXGENFINVENTORYPENDUPDFLAGS2+1                           00467000
         DS    BL5                                                      00468000
IXGENFINVENTORYLSSIZE DS F LS_Size                                      00469000
IXGENFINVENTORYSTGSIZE DS F Stg_Size                                    00470000
IXGENFINVENTORYMAXBUFSIZE DS F MaxBufSize                               00471000
IXGENFINVENTORYFW1 DS 0F full word                                      00472000
         DS    B         Reserved                                       00473000
IXGENFINVENTORYRETPD DS FL3 Retention period                            00474000
IXGENFINVENTORYEHLQ DS CL33 Ehlq/Hlq                                    00475000
IXGENFINVENTORYGROUP DS CL8 Group                                       00476000
IXGENFINVENTORYRSVD DS CL11 Reserved                                    00477000
         ORG   IXGENFUNION1                                             00478000
IXGENFINVENTORYDELETE DS 0CL50 Log stream delete from inventory         00479000
IXGENFINVENTORYDELGMTTIMESTAMP DS BL8 Time stamp                        00480000
IXGENFINVENTORYDELSYSNAME DS CL8 System name on which the log stream   *00481000
                         delete occurred                                00482000
IXGENFINVENTORYDELLOGSTREAMNAME DS CL26 Log stream name                 00483000
IXGENFINVENTORYDELRESMGRNAME DS CL8 Resource Manager Name               00484000
         ORG   IXGENFUNION1                                             00485000
IXGENFCONNDISCINFO DS 0CL118 Successful connect to or disconnect from  *00486000
                         a log stream                                   00487000
IXGENFCONNDISCSYSNAME DS CL8 System name on which the connect or       *00488000
                         disconnect occurred                            00489000
IXGENFCONNDISCGMTTIMESTAMP DS BL8 Time stamp Set for both connect and  *00490000
                         disconnect events                              00491000
IXGENFCONNDISCLOGSTREAMNAME DS CL26 log stream name. Set for both      *00492000
                         connect and disconnect events                  00493000
IXGENFCONNDISCLOGSTREAMDEFTIME DS BL8 Set to binary zeroes for log     *00494000
                         streams defined or changed prior to OS390R3.  *00495000
                         For log streams defined when OS390R3 is       *00496000
                         installed, this field contains the define     *00497000
                         time. For log streams defined before OS390R3  *00498000
                         and updated after OS390R3 is installed, this  *00499000
                         field contains the time of first update.       00500000
IXGENFCONNDISCLOGSTREAMSTRVER DS 0BL8 Logical structure Version number *00501000
                         of the CF structure associated with this log  *00502000
                         stream. Set for both ConnSuccess and          *00503000
                         DisconnSuccess events                          00504000
IXGENFCONNDISCLOGSTREAMINSVER DS BL8 Alternate name for DASD only log  *00505000
                         stream. STCK value when the log stream        *00506000
                         staging data set was allocated                 00507000
IXGENFCONNDISCRESMGRNAME DS CL8 Resource Manager associated with this  *00508000
                         log stream. If binary zeroes, no RM is        *00509000
                         associated with the log stream. This is the   *00510000
                         resource manager name specified on the log    *00511000
                         stream's inventory record. To check if the    *00512000
                         resource manager is connected, check field    *00513000
                         IxgenfConnDiscResMgr- -Connected. Set for     *00514000
                         both connect and disconnect events             00515000
IXGENFCONNDISCRESMGRDATA DS CL8 Resource Manager Data. Contains valid  *00516000
                         data only if IxgenfConnDiscResMgr- -Connected *00517000
                         is set. Set for both connect and disconnect   *00518000
                         events                                         00519000
IXGENFCONNDISCRESMGREVENTS DS 0B Monitored events. Contains valid data *00520000
                         only if IxgenfConnDiscResMgr- -Connected is   *00521000
                         set                                            00522000
IXGENFCONNDISCLBWRITES EQU X'80' If set, the resource manager is       *00523000
                         monitoring log block write events              00524000
IXGENFCONNDISCLBDELETES EQU X'40' If set, the resource manager is      *00525000
                         monitoring log block delete events             00526000
         ORG   IXGENFCONNDISCRESMGREVENTS+1                             00527000
IXGENFCONNDISCFLAGS DS 0B Additional flags                              00528000
IXGENFCONNDISCAUTHREAD EQU X'80' If set then AUTH=READ specified on    *00529000
                         the connect request. Set for successful       *00530000
                         connect requests.                              00531000
IXGENFCONNDISCAUTHWRITE EQU X'40' If set then AUTH=WRITE specified on  *00532000
                         the connect request. Set for successful       *00533000
                         connect requests                               00534000
IXGENFCONNDISCRESMGRMANAGED EQU X'20' If set, RMNAME keuword specified *00535000
                         on log stream definition                       00536000
IXGENFCONNDISCRESMGRCONNECTED EQU X'10' If set, resource manager is    *00537000
                         connected to the log stream. Valid for both   *00538000
                         connect and disconnect events                  00539000
IXGENFCONNDISCCONNECT EQU X'08' If set, this parmlist represents a     *00540000
                         connect request                                00541000
IXGENFCONNDISCDISCONNECT EQU X'04' If set, this parmlist represents a  *00542000
                         disconnect request                             00543000
IXGENFCONNDISCUSINGPHYSSTR EQU X'02' On = using physical structure      00544000
IXGENFCONNDISCUSINGPHYSSTR2 EQU X'01' On = using second physical       *00545000
                         structure                                      00546000
         ORG   IXGENFCONNDISCFLAGS+1                                    00547000
IXGENFCONNDISCNUMOFREADS DS F Number of read connections to this log   *00548000
                         stream. Set for both connect and disconnect   *00549000
                         events                                         00550000
IXGENFCONNDISCNUMOFWRITES DS F Number of write connections to this log *00551000
                         stream. Set for both connect and disconnect   *00552000
                         events                                         00553000
IXGENFCONNDISCLSDESCRIPTION DS CL16 LS Description data specified when *00554000
                         the log stream was defined or its definition  *00555000
                         updated in inventory                           00556000
IXGENFCONNDISCLOGSTREAMPHYSSTRSVERS DS 0CL16 Version numbers of        *00557000
                         physical structures                            00558000
IXGENFCONNDISCLOGSTREAMPHYSSTRVER DS 0CL8 Physical structure version   *00559000
                         number of the CF structure associated with    *00560000
                         this log stream. Set for both ConnSuccess and *00561000
                         DisconnSuccess events                          00562000
IXGENFCONNDISCLOGSTREAMPHYSINSVER DS CL8 Alternate name for DASD only  *00563000
                         log stream. STCK value when the log stream    *00564000
                         staging data set was allocated                 00565000
IXGENFCONNDISCLOGSTREAMPHYSSTR2VER DS CL8 Second physical structure    *00566000
                         version number of the CF structure associated *00567000
                         with this log stream. Set for both            *00568000
                         ConnSuccess and DisconnSuccess events          00569000
IXGENFCONNDISCDISCONNINFO DS 0CL2 Last disconnect from the log stream  *00570000
                         on this system info.                           00571000
IXGENFCONNDISCCOUNT DS H The number of connections to this log stream  *00572000
                         in the sysplex. Set only when                 *00573000
                         IxgenfSystemLevelDisc is on.                   00574000
         ORG   IXGENFUNION1                                             00575000
IXGENFWROFFLOADINFO DS 0CL42 Writer Offload has completed from Logger  *00576000
                         inventory                                      00577000
IXGENFWROFFLOADGMTTIMESTAMP DS BL8 Time stamp                           00578000
IXGENFWROFFLOADLOGSTREAMNAME DS CL26 log stream name                    00579000
IXGENFWROFFLOADSAFEIMPORTPOINT DS CL8 Highest log block id, that is no *00580000
                         longer in the coupling facility                00581000
         ORG   IXGENFUNION1                                             00582000
IXGENFLOGSTREAMNAMES DS CL26 Name(s) of log streams that are connected *00583000
                         to the structure and affected by the reported *00584000
                         event                                          00585000
IXGENFEYECATCHER EQU C'ENF '                                            00586000
IXGENF_LEN EQU *-IXGENF                                                 00587000
.L0002   ANOP                                                           00588000
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 00589000
         AIF   ('&LIST' EQ 'YES').P4                                    00590000
.P3      ANOP                                                           00591000
         POP   PRINT                                                    00592000
.P4      ANOP                                                           00593000
.P_EXIT  ANOP                                                           00594000
         MEND                                                           00595000
**/ IXGENF_2:;                                                          00596000
* %IXGENF_INCLUDED = 'YES';                                             00597000
* %DCL ZCBPRINT CHAR EXT;                                               00598000
* %DEACTIVATE ZCBPRINT;                                                 00599000
* %DCL IXGENF_LIST CHAR EXT;                                            00600000
* %DEACTIVATE IXGENF_LIST;                                              00601000
* %IF IXGENF_LIST ^= 'NO' &                                             00602000
*    ZCBPRINT ^= 'NO' %THEN                                             00603000
*   %GOTO IXGENF_3;                                                     00604000
*   @LIST PUSH NOECHO;                                                  00605000
*   @LIST NOASSEMBLE NOECHO;                                            00606000
*   @LIST OFF C NOECHO;                                                 00607000
* %IXGENF_3:;                                                           00608000
*/* Start of PL/X Source                                             */ 00609000
*                                                                       00610000
*   DECLARE                                                             00611000
*     1    IXGENF BDY(DWORD) BASED,       /* LOGR Event Notification    00612000
*                                            Parameter List          */ 00613000
*                                                                       00614000
*      3   IxgenfCommon,                                                00615000
*       5    IxgenfAcronym CHAR(4),       /* Eyecatcher C'ENF '      */ 00616000
*       5    IxgenfComponent CHAR(5),     /* Component Acronym       */ 00617000
*       5    IxgenfCDStype  Bit(8),  ] CDS data type indication    @04A 00618008
*          7  IxgenfUseCdsTypeIsSet  Bit(1),  /*                        00619001
*                                     when on, means one of the         00620004
*                                      following CDS data type flags    00621001
*                                      is set on                        00621103
*                                     when off, means sysplex scope     00621204
*                                      LOGR CDS type expected for use   00621307
*                                      on the system originating        00621402
*                                      the ENF signal            @04A*/ 00621508
*          7  IxgenfUseCdsTypeLOGR   Bit(1),  /* (valid only when       00621601
*                                      IxgenfUseCdsTypeIsSet in on,     00621701
*                                      otherwise undefined)             00621801
*                                     when on, means sysplex scope      00621904
*                                      LOGR CDS type expected for use   00622007
*                                      on the system originating        00622101
*                                      the ENF signal            @04A*/ 00622208
*          7  IxgenfUseCdsTypeLOGRY  Bit(1),  /* (valid only when       00622301
*                                      IxgenfUseCdsTypeIsSet in on,     00622401
*                                      otherwise undefined)             00622501
*                                     when on, means single-system      00622604
*                                      scope LOGRY CDS type expected    00622701
*                                      for use on system originating    00622801
*                                      the ENF signal            @04A*/ 00622908
*          7  IxgenfUseCdsTypeLOGRZ  Bit(1),  /* (valid only when       00623201
*                                      IxgenfUseCdsTypeIsSet in on,     00623301
*                                      otherwise undefined)             00623401
*                                     when on, means single-system      00623504
*                                      scope LOGRZ CDS type expected    00623601
*                                      for use on system originating    00623701
*                                      the ENF signal            @04A*/ 00623808
*       5    * CHAR(2),                   /* Unused              @04C*/ 00624108
*       5    IxgenfEvents BIT(32),        /* Event Flags             */ 00624200
*                                                                       00624300
*          7   IxgenfEventsByte0      Bit(8),                 /* @L3A*/ 00624400
*                                                                       00624500
*            9  IxgenfSystemLoggerAvail  Bit(1),                        00624600
*                                         /* MVS System Logger          00624700
*                                            Services available.     */ 00625000
*                                                                       00626000
*            9  IxgenfSystemLoggerNotAvailForIPL Bit(1),                00627000
*                                         /* MVS System Logger Services 00628000
*                                            are not available for the  00629000
*                                            duration of this IPL. A    00630000
*                                            Re-IPL of the system is    00631000
*                                            necessary to activate      00632000
*                                            MVS System Logger          00633000
*                                            Services.                  00634000
*                                            See IxgenfEventReasons     00635000
*                                            for the reasons why Logger 00636000
*                                            is not available for       00637000
*                                            this IPL.           @LCC*/ 00638000
*                                                                       00639000
*            9  IxgenfLogstreamsAvailable        Bit(1),                00640000
*                                         /* Logstream resources mapped 00641000
*                                            to the structure named in  00642000
*                                            IxgenfStrname are          00643000
*                                            available for use. See     00644000
*                                            IxgenfEventReasons         00645000
*                                            for the specific reason    00646000
*                                            logstream resources for    00647000
*                                            the affected logstreams    00648000
*                                            are available.      @L4A*/ 00649000
*                                                                       00650000
*            9  IxgenfLogstreamsNotAvailable     Bit(1),                00651000
*                                         /* Logstream resources mapped 00652000
*                                            to the structure named in  00653000
*                                            IxgenfStrname are not      00654000
*                                            available for use. See     00655000
*                                            IxgenfEventReasons         00656000
*                                            for the specific reason    00657000
*                                            logstream resources for    00658000
*                                            the affected logstreams    00659000
*                                            are not available.  @L4A*/ 00660000
*                                                                       00661000
*            9  IxgenfLogstreamResourceChange    Bit(1),                00662000
*                                         /* A change in the state of   00663000
*                                            the resources allocated    00664000
*                                            to the logstreams listed   00665000
*                                            has occurred.       @L4A*/ 00666000
*                                                                       00667000
*            9  IxgenfSystemLoggerResourceChg    Bit(1),                00668000
*                                         /* A change in the state of   00669000
*                                            resources that the System  00670000
*                                            Logger has interest in has 00671000
*                                            occurred (i.e. coupling    00672000
*                                            facility resource change)  00673000
*                                                                @L4A*/ 00674000
*            9  IxgenfLogStreamConnDisc BIT(1), /* A connection to or a 00675000
*                                            disconnection from a log   00676000
*                                            has been successful in     00677000
*                                            the sysplex         @L7A*/ 00678000
*          7   IxgenfEventsByte1      Bit(8),                 /* @L3A*/ 00679000
*            9 IxgenfLogStreamDefUpdate BIT(1), /* Either a log stream  00680000
*                                            has been defined or its    00681000
*                                            defintion has been         00682000
*                                            updated             @L7A*/ 00683000
*            9 IxgenfLogStreamDelete BIT(1), /* Log stream definition   00684000
*                                            deleted from Logger        00685000
*                                            inventory           @L7A*/ 00686000
*            9 IxgenfLogStreamOffloadComplete BIT(1), /* A writer       00687000
*                                            offload event for the      00688000
*                                            log stream has completed   00689000
*                                                                @L8A*/ 00690000
*            9 IxgenfRMDisabled BIT(1),      /* The resource manager    00691000
*                                            associated with the log    00692000
*                                            stream has been disabled   00693000
*                                            because it abended and     00694000
*                                            did not recover     @L8A*/ 00695000
*            9 IxgenfZAILocChg Bit(1),   /*  System logger parameter    00696000
*                                            options change occurred    00697000
*                                            for ZAI SERVER, TPNAME     00698000
*                                            and/or PORT values.        00699000
*                                            Refer to                   00700000
*                                            IXGQUERY                   00710000
*                                            REQUEST=ZAILOCINFO and     00720000
*                                            IXGQZBUF mapping for       00730000
*                                            details.            @03C*/ 00740000
*          7   IxgenfEventsByte2      Bit(8),                 /* @L3A*/ 00750000
*                                                                       00750100
*          7   IxgenfEventsByte3      Bit(8),                 /* @L3A*/ 00750200
*                                                                       00750300
*       5    IxgenfEventReasons    BIT(32),                             00750400
*                                        /* Specific reasons that the   00750500
*                                           events are being reported   00750600
*                                           for.                 @L4C*/ 00750700
*                                                                       00750800
*          7   IxgenfEventReasonsByte0 Bit(8),                /* @L4C*/ 00750900
*                                                                       00751000
*            9  IxgenfStrRebuildStart    Bit(1),                        00751100
*                                    /* Structure Rebuild processing    00751200
*                                       for a log stream has begun.     00751300
*                                       Programs connected to an        00751400
*                                       affected log stream are         00751500
*                                       expected to cease invoking MVS  00751600
*                                       System Logger functions.  If    00751700
*                                       any functions are invoked       00751800
*                                       against an affected log         00751900
*                                       stream, they are rejected.      00752000
*                                       This reason is valid for event  00752100
*                                       IxgenfLogstreamsNotAvailable    00752200
*                                                                @L4C*/ 00752300
*                                                                       00752400
*                                                                       00752500
*            9  IxgenfStrRebuildComplete Bit(1),                        00752600
*                                    /* Structure Rebuild processing    00752700
*                                       for a log stream has completed. 00752800
*                                       Programs may resume invoking    00752900
*                                       MVS System Logger functions     00753000
*                                       This reason is valid for event  00753100
*                                       IxgenfLogstreamsAvailable.      00753200
*                                                                @L4C*/ 00753300
*                                                                       00753400
*                                                                       00753500
*            9  IxgenfStrRebuildFailed   Bit(1),                        00753600
*                                    /* Structure Rebuild processing    00753700
*                                       has failed. Connections to the  00753800
*                                       structure named in              00753900
*                                       IxgenfStrName from this system  00754000
*                                       are in a failed state. Requests 00754100
*                                       for the affected log stream(s)  00754200
*                                       are rejected.  This reason is   00754300
*                                       valid for event                 00754400
*                                       IxgenfLogstreamsNotAvailable    00754500
*                                                                @L4C*/ 00754600
*                                                                       00754700
*            9  IxgenfStagingDsStorageAvailable  BIT(1),                00754800
*                                    /* Reclamation of staging data set 00754900
*                                       space has completed. Staging    00755000
*                                       data set space is now available 00755100
*                                       for use by the subject          00755200
*                                       logstream.  This reason is      00755300
*                                       valid for event                 00755400
*                                       IxgenfLogstreamsAvailable.      00755500
*                                                                @Q1A*/ 00755600
*                                                                       00755700
*            9  IxgenfLogstreamStorageAvailable  BIT(1),                00755800
*                                    /* Migration of logstream data to  00755900
*                                       DASD to reach the low           00756000
*                                       threshold value of the current  00757000
*                                       logstream storage consumption   00758000
*                                       limit has completed. Coupling   00759000
*                                       facility storage is now         00760000
*                                       available for use by the        00761000
*                                       subject logstream.  This reason 00762000
*                                       is valid for event              00763000
*                                       IxgenfLogstreamsAvailable.      00764000
*                                                                @L5C*/ 00765000
*                                                                       00766000
*            9  IxgenfLossOfData         Bit(1),                        00767000
*                                    /* A loss of data condition        00768000
*                                       may exist for the affected      00769000
*                                       logstream(s).  This reason is   00770000
*                                       valid for event                 00771000
*                                       IxgenfLogstreamResourceChange.  00772000
*                                                                @L4A*/ 00773000
*            9  IxgenfCfResourceChange           Bit(1),                00774000
*                                    /* A change in the state of        00775000
*                                       coupling facility resources     00776000
*                                       has occurred and reported by    00777000
*                                       ENF 35.  When the resource      00778000
*                                       change is related to a          00779000
*                                       specific coupling facility      00780000
*                                       structure, IxgenfStrName will   00781000
*                                       contain the name of the         00782000
*                                       structure that was affected by  00783000
*                                       the resource change. This       00784000
*                                       reason is valid for event       00785000
*                                       IxgenfSystemLoggerResourceChg.  00786000
*                                                                @L4A*/ 00787000
*            9  IxgenfXESrecommendaction         Bit(1),                00788000
*                                    /* A XES Recommend Action event    00789000
*                                       was received by the MVS System  00790000
*                                       Logger Structure Event Exit     00791000
*                                       instructing System Logger       00792000
*                                       to discontinue use (disconnect  00793000
*                                       from) of the structure named    00794000
*                                       in IxgenfStrName. The XES       00795000
*                                       recommended action is based     00796000
*                                       on installation specified SFM   00797000
*                                       and CFRM policy values.         00798000
*                                       Connections to the affected     00799000
*                                       logstream(s) have been          00800000
*                                       terminated by System Logger.    00801000
*                                       This reason is valid for event  00802000
*                                       IxgenfLogstreamsNotAvailable.   00803000
*                                                                @L5A*/ 00804000
*                                                                       00805000
*          7   IxgenfEventReasonsByte1 Bit(8),                /* @L4C*/ 00806000
*                                                                       00807000
*            9  IxgenfComponentError  Bit(1),                           00808000
*                                    /* A system logger component       00809000
*                                       error has occurred.             00810000
*                                       The System Logger had           00811000
*                                       to discontinue use (disconnect  00812000
*                                       from) of the structure named    00813000
*                                       in IxgenfStrName.               00814000
*                                       Connections to the affected     00815000
*                                       logstream(s) have been          00816000
*                                       terminated by System Logger.    00817000
*                                       This reason is valid for event  00818000
*                                       IxgenfLogstreamsNotAvailable.   00819000
*                                                                @L6A*/ 00820000
*            9  IxgenfStrResourceChange           Bit(1),               00821000
*                                    /* Resources in the structure      00822000
*                                       named in IxgenfStrName have     00823000
*                                       become available. Requests      00824000
*                                       that were rejected due to       00825000
*                                       a structure resource shortage   00826000
*                                       or structure full condition     00827000
*                                       should be attempted again.      00828000
*                                                                @01A*/ 00829000
*            9  IxgenfReqLogResNotAvail          Bit(1),         ] @L9A 00830000
*                                    /* Logger required resources are   00831000
*                                       not available (e.g. staging     00832000
*                                       dataset could not be allocated) 00833000
*                                                                    */ 00834000
*            9  IxgenfLoggerNotAvailXcfLocal     Bit(1),         ] @LCA 00835000
*                                    /* PLEXCFG=XCFLOCAL, not in        00836000
*                                       sysplex mode.                   00837000
*                                       This reason is valid for event  00838000
*                                   IxgenfSystemLoggerNotAvailForIPL.   00839000
*                                                                @LCA*/ 00840000
*            9  IxgenfLoggerNotAvailNoStart      Bit(1),         ] @LCA 00841000
*                                    /* IXGLOGR=NOSTART on LOGR subsys  00842000
*                                       specification.                  00843000
*                                       This reason is valid for event  00844000
*                                   IxgenfSystemLoggerNotAvailForIPL.   00845000
*                                                                @LCA*/ 00846000
*            9  IxgenfSetLogrForceDisconnect Bit(1), /* Force           00847000
*                                       Disconnect operation has been   00848000
*                                       completed. This reason is only  00849000
*                                       valid for event                 00850000
*                                       IxgenfLogstreamsNotAvailable.   00851000
*                                                                @LDA*/ 00852000
*            9 IxgenfSystemLevelDisc Bit(1),                            00853000
*                                    /* The disconnect event is for     00854000
*                                       a system level.  It signals     00855000
*                                       that the last disconnect for a  00856000
*                                       log stream on this system has   00857000
*                                       been completed.          @LDA*/ 00858000
*            9  IxgenfSetLogrForceDelete Bit(1), /* Force Delete        00859000
*                                       operation has completed.        00860000
*                                       The logstream referred to by    00861000
*                                       IxgenfInventoryDelLogStreamName 00862000
*                                       has been deleted from the       00863000
*                                       LOGR Couple Data Set as a       00864000
*                                       result of the command request.  00865000
*                                       This reason is only valid for   00866000
*                                       event IxgenfLogStreamDelete.    00867000
*                                                                @LFC*/ 00868000
*                                                                       00869000
*          7   IxgenfEventReasonsByte2 Bit(8),                /* @L4C*/ 00870000
*                                                                       00871000
*          7   IxgenfEventReasonsByte3 Bit(8),                /* @L4C*/ 00872000
*                                                                       00873000
*       5    IxgenfEventSpecificInfo   BIT(32),                         00874000
*                                    /* Event Specific Information that 00875000
*                                       provides additional information 00876000
*                                       about the reported event and    00877000
*                                       the reason that the event is    00878000
*                                       reported.                @L4A*/ 00879000
*                                                                       00880000
*                                                                       00881000
*          7   IxgenfEventSpecificInfoByte0 Bit(8),           /* @L4A*/ 00882000
*                                                                       00883000
*            9  IxgenfStrRebuildFailLossConn Bit(1),                    00884000
*                                    /* This bit is only valid when     00885000
*                                       IxgenfStrRebuildFailed is ON.   00886000
*                                       Structure Rebuild processing    00887000
*                                       has failed. A loss of           00888000
*                                       connectivity to the structure   00889000
*                                       named in IxgenfStrname has left 00890000
*                                       this system with no coupling    00891000
*                                       facility resources allocated to 00892000
*                                       the affected log stream(s).     00893000
*                                                                @L4M*/ 00894000
*                                                                       00895000
*            9  IxgenfStrRebuildFailStrFail Bit(1),                     00896000
*                                    /* This bit is only valid when     00897000
*                                       IxgenfStrRebuildFailed is       00898000
*                                       ON. Structure Rebuild           00899000
*                                       processing has failed.          00900000
*                                       A structure failure to the      00901000
*                                       structure named in              00902000
*                                       IxgenfStrname has left this     00903000
*                                       system with no coupling         00904000
*                                       facility resources allocated to 00905000
*                                       the affected log stream(s).     00906000
*                                                                @L4M*/ 00907000
*            9  IxgenfStrRebuildCFDuplex Bit(1), /* On =                00908000
*                                       CF Auto-duplex rebuild          00909000
*                                       is in progress           @LAC*/ 00910000
*                                                                       00911000
*            9  IxgenfLossOfConnectivity Bit(1),                        00912000
*                                    /* This bit is only valid when     00913000
*                                       IxgenfXESrecommendaction is ON. 00914000
*                                       The XES Recommend Action event  00915000
*                                       was initiated due to a loss     00916000
*                                       of connectivity between the     00917000
*                                       coupling facility structure     00918000
*                                       named in IxgenfStrName and the  00919000
*                                       system that the ENF Listener    00920000
*                                       exit that receives this         00921000
*                                       parameter list is executing on. 00922000
*                                                                @L5A*/ 00923000
*                                                                       00924000
*            9  IxgenfLogstreamDisconnected Bit(1),                     00925000
*                                    /* This bit is only valid when     00926000
*                                       IxgenfXESrecommendaction is ON, 00927000
*                                       IxgenfComponentError is ON, or  00928000
*                                      IxgSetLogrForceDisconnect is ON. 00929000
*                                       Connections to the affected     00930000
*                                       logstream(s) have been          00931000
*                                       terminated by System Logger.    00932000
*                                       The streamtoken that uniquely   00933000
*                                       defined the connection has been 00934000
*                                       invalidated. All connectors     00935000
*                                       should clean up information     00936000
*                                       related to the invalidated      00937000
*                                       streamtoken.             @LDC*/ 00938000
*            9  IxgenfStgAllocErr           Bit(1), ] @L9A              00939000
*                                    /* Staging Data set could not be   00940000
*                                       allocated                    */ 00941000
*                                                                       00942000
*                                                                       00943000
*          7   IxgenfEventSpecificInfoByte1 Bit(8),           /* @L4A*/ 00944000
*                                                                       00945000
*          7   IxgenfEventSpecificInfoByte2 Bit(8),           /* @L4A*/ 00946000
*                                                                       00947000
*          7   IxgenfEventSpecificInfoByte3 Bit(8),           /* @L4A*/ 00948000
*                                                                       00949000
*       5    IxgenfStrname CHAR(16),      /* Structure name that is     00950000
*                                            the subject of the event   00951000
*                                            being signalled (not       00952000
*                                            provided if the event      00953000
*                                            is not structure           00954000
*                                            related).               */ 00955000
*                                                                       00956000
*                                                                       00957000
*       5    IxgenfLogStreamCount Fixed(32),                            00958000
*                                         /* Number of log streams that 00959000
*                                            are connected to the       00960000
*                                            structure and affected by  00961000
*                                            the reported event      */ 00962000
*       5    *                    CHAR(16),                             00963000
*                                         /* Unused - Available      */ 00964000
*      3    IxgenfUnion1 UNION,           /*                    @L8A */ 00965000
*            5 IxgenfResMgrDisabled                                     00966000
*                  bdy(word),        /* Resource Manager exit has been  00967000
*                                       disabled                 @LBC*/ 00968000
*                7 IxgenfResMgrGMTTimeStamp BIT(64), /* Time stamp      00969000
*                                                               @L8A */ 00970000
*                7 IxgenfResMgrLogStreamName                            00971000
*                   CHAR(LENGTH(IxgenfLogStreamNames)), /* log stream   00972000
*                                             name              @L8A */ 00973000
*                7 IxgenfResMgrName CHAR(8),/* Resource Manager         00974000
*                                             associated with this log  00975000
*                                             stream.           @L8A */ 00976000
*                7 IxgenfResMgrData CHAR(8), /* Resource                00977000
*                                             Manager Data.     @L8A */ 00978000
*                7 IxgenfResMgrLSDescription  CHAR(16), /* Description  00979000
*                                            associated with the log    00980000
*                                            stream             @L8A */ 00981000
*                7 IxgenfResMgrAbendCode CHAR(4),/* Copy of SDWAABCC    00982000
*                                            if an sdwa was available   00983000
*                                            when the resource manager  00984000
*                                            was disabled else          00985000
*                                            binary zeroes      @L8A */ 00986000
*            5 IxgenfInventoryDefUpdate                                 00987000
*                  bdy(word),             /* Log stream define or       00988000
*                                            update section      @LBC*/ 00989000
*             6 IxgenfInventoryDefUpdate1                               00990000
*                  bdy(word),             /* Original portion of define 00991000
*                                            update section      @LBA*/ 00992000
*              7  IxgenfInventoryGMTTimeStamp BIT(64), /* Time          00993000
*                                            stamp              @L8A */ 00994000
*              7  IxgenfInventorySysName CHAR(8), /* System name on     00995000
*                                        which the define or update     00996000
*                                        occurred               @L8A */ 00997000
*              7  IxgenfInventoryLogStreamName                          00998000
*                  CHAR(LENGTH(IxgenfLogStreamNames)), /* Log stream    00999000
*                                            name               @L8A */ 01000000
*              7  IxgenfInventoryLogStreamDefTime BIT(64), /* Set to    01001000
*                                            binary zeroes for log      01002000
*                                            streams defined or         01003000
*                                            changed prior to OS390R3.  01004000
*                                            For log streams defined    01005000
*                                            when OS390R3 is installed, 01006000
*                                            this field contains the    01007000
*                                            define time. For log       01008000
*                                            streams defined before     01009000
*                                            OS390R3 and updated after  01010000
*                                            OS390R3 is installed, this 01011000
*                                            field contains the time of 01012000
*                                            first update.              01013000
*                                                               @L8A */ 01014000
*              7  IxgenfInventoryResMgrName CHAR(8), /* Resource        01015000
*                                            Manager associated with    01016000
*                                            this log stream. If binary 01017000
*                                            zeroes, no resource mgr    01018000
*                                            is associated with this    01019000
*                                            log stream         @L8A */ 01020000
*              7  IxgenfInventoryStructName CHAR(16), /* CF structure   01021000
*                                            name to which the log      01022000
*                                            stream maps        @L8A */ 01023000
*              7  IxgenfInventoryFlags BIT(16), /* Flags        @L8A */ 01024000
*               8 IxgenfInventoryFlags0 BIT(8), /* Flags byte 0  @LBA*/ 01025000
*                 9 IxgenfInventoryDefineReq BIT(1), /* If set, request 01026000
*                                            is to define a log stream  01027000
*                                                               @L8A */ 01028000
*                 9 IxgenfInventoryUpdateReq BIT(1), /* If set, request 01029000
*                                            is to update the log       01030000
*                                            stream definition  @L8A */ 01031000
*                 9 IxgenfInventoryStgDuplexYes BIT(1), /* If set,      01032000
*                                            STG_DUPLEX=YES in          01033000
*                                            effect.  Refer to          01034000
*                                            Duplexmode flags           01035000
*                                    IxgenfInventoryStgModeCond and     01036000
*                                    IxgenfInventoryStgModeDRXRC @LCC*/ 01037000
*                 9 IxgenfInventoryStgModeCond BIT(1), /* If set,       01038000
*                                            DuplexMode=Cond in         01039000
*                                            effect.  If set off, then  01040000
*                                            when                       01041000
*                                    IxgenfInventoryStgModeDRXRC        01042000
*                                            is also off, then          01043000
*                                            DuplexMode=Uncond.  @LCC*/ 01044000
*                 9 IxgenfInventoryModelYes BIT(1), /* If set, this is  01045000
*                                            a log stream model         01046000
*                                            definition         @L8A */ 01047000
*                 9 IxgenfInventoryDasdOnlyYes BIT(1), /* If set,       01048000
*                                            this is a DASD only log    01049000
*                                            stream definition  @L9A */ 01050000
*                 9 IxgenfInventoryLoggerDuplexCond BIT(1), /* If set,  01051000
*                                            LOGGERDUPLEX=COND is       01052000
*                                            in effect          @LAA */ 01053000
*                 9 IxgenfInventoryExt1     BIT(1), /* If set,          01054000
*                                    IxgenfInventoryExt1Area section    01055000
*                                    is provided in the Enf area @LBA*/ 01056000
*               8 IxgenfInventoryFlags1 BIT(8), /* Flags byte 1  @LBA*/ 01057000
*                 9 IxgenfInventoryAutoDelete bit(1), /* If set,        01058000
*                                    AutoDelete(Yes)             @LBA*/ 01059000
*                 9 IxgenfInventoryOffRecall  bit(1), /* If set,        01060000
*                                    OffloadRecall(Yes)          @LBA*/ 01061000
*                 9 IxgenfInventoryStgModeDRXRC BIT(1), /* If set,      01062000
*                                            DuplexMode=DRXRC in        01063000
*                                            effect.  Also see flag     01064000
*                                    IxgenfInventoryStgModeCond  @LCA*/ 01065000
*                 9 * BIT(5),                /* Reserved         @LCC*/ 01068000
*              7  IxgenfInventoryStGDataClas CHAR(8), /* Data class     01069000
*                                            for staging data sets      01070000
*                                                               @L8A */ 01071000
*              7  IxgenfInventoryStGMgmtClas CHAR(8), /* Mgmt class     01072000
*                                            for staging data sets      01073000
*                                                               @L8A */ 01074000
*              7  IxgenfInventoryStGStorClas CHAR(8), /* Storage class  01075000
*                                            for staging data sets      01076000
*                                                               @L8A */ 01077000
*              7  IxgenfInventoryLSDataClas CHAR(8), /* Data class      01078000
*                                            for log stream data sets   01079000
*                                                               @L8A */ 01080000
*              7  IxgenfInventoryLsMgmtClas CHAR(8), /* Mgmt class      01081000
*                                            for log stream data sets   01082000
*                                                               @L8A */ 01083000
*              7  IxgenfInventoryLsStorClas CHAR(8), /* Storage class   01084000
*                                            for log stream data sets   01085000
*                                                               @L8A */ 01086000
*              7  IxgenfInventoryLowOffload FIXED(31), /* Low offload   01087000
*                                            threshold          @L8A */ 01088000
*              7  IxgenfInventoryHighOffload FIXED(31), /* High offload 01089000
*                                            threshold          @L8A */ 01090000
*              7  IxgenfInventoryLSDescription CHAR(16), /* Logstream   01091000
*                                            description        @L8A */ 01092000
*             6 IxgenfInventoryExt1Area char(76) bdy(word), /* This     01093000
*                                    area included in the Enf parameter 01094000
*                                    area when IxgenfInventoryExt1      01095000
*                                    is on                       @LBA*/ 01096000
*                9 IxgenfInventoryPendUpdFlags   bit(64), /* These      01097000
*                                    flags indicate that the associated 01098000
*                                    field is in a "Pending Update"     01099000
*                                    state and not yet commited. @LBA*/ 01100000
*                10 IxgenfInventoryPendUpdFlags0 bit(8), ] Flags 0 @LBA 01101000
*                 11 IxgenfInventoryRetpdPendUpd        bit(1), ]  @LBA 01102000
*                 11 IxgenfInventoryAutoDeletePendUpd   bit(1), ]  @LBA 01103000
*                 11 IxgenfInventoryOffloadRecallPendUpd bit(1),]  @LBA 01104000
*                 11 IxgenfInventoryLsSizePendUpd       bit(1), ]  @LBA 01105000
*                 11 IxgenfInventoryLsDataclasPendUpd   bit(1), ]  @LBA 01106000
*                 11 IxgenfInventoryLsMgmtclasPendUpd   bit(1), ]  @LBA 01107000
*                 11 IxgenfInventoryLsStorclasPendUpd   bit(1), ]  @LBA 01108000
*                 11 IxgenfInventoryLowOffloadPendUpd   bit(1), ]  @LBA 01109000
*                10 IxgenfInventoryPendUpdFlags1 bit(8), ] Flags 1 @LBA 01110000
*                 11 IxgenfInventoryHighOffloadPendUpd  bit(1), ]  @LBA 01111000
*                 11 IxgenfInventoryStgSizePendUpd      bit(1), ]  @LBA 01112000
*                 11 IxgenfInventoryStgDataclasPendUpd  bit(1), ]  @LBA 01113000
*                 11 IxgenfInventoryStgMgmtclasPendUpd  bit(1), ]  @LBA 01114000
*                 11 IxgenfInventoryStgStorclasPendUpd  bit(1), ]  @LBA 01115000
*                 11 IxgenfInventoryMaxBufSizePendUpd   bit(1), ]  @LBA 01116000
*                 11 IxgenfInventoryLoggerDuplexPendUpd bit(1), ]  @LBA 01117000
*                 11 IxgenfInventoryStgDuplexYesPendUpd  bit(1),]  @P3C 01118000
*                10 IxgenfInventoryPendUpdFlags2 bit(8), ] Flags 2 @P3A 01119000
*                 11 IxgenfInventoryDuplexModeCondPendUpd bit(1),] @P3A 01120000
*                 11 IxgenfInventoryDuplexModeDrxrcPendUpd bit(1),]@LCA 01121000
*                 11 *                                  bit(6), ]  @LCC 01123000
*                10 *                            bit(40),       ]  @P3C 01124000
*                9 IxgenfInventoryLsSize  fixed(31), ] LS_Size     @LBA 01125000
*                9 IxgenfInventoryStgSize fixed(31), ] Stg_Size    @LBA 01126000
*                9 IxgenfInventoryMaxBufSize fixed(31),]MaxBufSize @LBA 01127000
*                9 IxgenfInventoryFW1       fixed(31), ] full word @LBA 01128000
*                 11 *                      bit(8),    ] Reserved  @LBA 01129000
*                 11 IxgenfInventoryRetpd   fixed(24), /* Retention     01130000
*                                            period              @LBA*/ 01131000
*                9 IxgenfInventoryEhlq    char(33),  ] Ehlq/Hlq    @LBA 01132000
*                9 IxgenfInventoryGroup   Char(8),   ] Group       @LGA 01133000
*                9 IxgenfInventoryRsvd    char(11),  ] Reserved    @LGC 01134000
*            5 IxgenfInventoryDelete                                    01135000
*                  bdy(word),             /* Log stream delete from     01136000
*                                            inventory           @LBC*/ 01137000
*                7 IxgenfInventoryDelGMTTimeStamp BIT(64),              01138000
*                                         /* Time stamp         @L8A */ 01139000
*                7 IxgenfInventoryDelSysName CHAR(8), /* System name on 01140000
*                                        which the log stream delete    01141000
*                                        occurred               @L8A */ 01142000
*                7 IxgenfInventoryDelLogStreamName                      01143000
*                   CHAR(LENGTH(IxgenfLogStreamNames)), /* Log stream   01144000
*                                                          name @L8A */ 01145000
*                7 IxgenfInventoryDelResMgrName CHAR(8), /* Resource    01146000
*                                            Manager Name       @L8A */ 01147000
*            5   IxgenfConnDiscInfo                                     01148000
*                  bdy(word),          /* Successful connect to or      01149000
*                                        disconnect from a log          01150000
*                                        stream                  @LBC*/ 01151000
*                7 IxgenfConnDiscSysName CHAR(8), /* System name on     01152000
*                                       which the connect or disconnect 01153000
*                                        occurred               @L8A */ 01154000
*                7 IxgenfConnDiscGMTTimeStamp BIT(64), /* Time stamp    01155000
*                                             Set for both connect and  01156000
*                                             disconnect events @L8A */ 01157000
*                7 IxgenfConnDiscLogStreamName                          01158000
*                   CHAR(LENGTH(IxgenfLogStreamNames)), /* log stream   01159000
*                                             name. Set for both        01160000
*                                             connect and disconnect    01161000
*                                             events            @L8A */ 01162000
*                7 IxgenfConnDiscLogStreamDefTime BIT(64), /* Set to    01163000
*                                           binary zeroes for log       01164000
*                                           streams defined or          01165000
*                                           changed prior to OS390R3.   01166000
*                                           For log streams defined     01167000
*                                           when OS390R3 is installed,  01168000
*                                           this field contains the     01169000
*                                           define time. For log        01170000
*                                           streams defined before      01171000
*                                           OS390R3 and updated after   01172000
*                                           OS390R3 is installed, this  01173000
*                                           field contains the time of  01174000
*                                           first update.               01175000
*                                                              @L8A */  01176000
*                                                                       01177000
*                                                                       01178000
*                                                                       01179000
*                                                                       01180000
*                                                                       01181000
*                                                                       01182000
*                7 IxgenfConnDiscLogStreamStrVer BIT(64),               01183000
*                                          /* Logical structure         01184000
*                                             Version number of the     01185000
*                                             CF structure associated   01186000
*                                             with this log stream. Set 01187000
*                                             for both ConnSuccess and  01188000
*                                             DisconnSuccess events     01189000
*                                                               @LAC */ 01190000
*                                                                       01191000
*                  9 IxgenfConnDiscLogStreamInsVer BIT(64),             01192000
*                                          /* Alternate name for DASD   01193000
*                                             only log stream.  STCK    01194000
*                                             value when the log stream 01195000
*                                             staging data set was      01196000
*                                             allocated         @L9A */ 01197000
*                7 IxgenfConnDiscResMgrName CHAR(8),/* Resource Manager 01198000
*                                             associated with this log  01199000
*                                             stream. If binary zeroes, 01200000
*                                             no RM is associated with  01201000
*                                             the log stream. This is   01202000
*                                             the resource manager name 01203000
*                                             specified on the log      01204000
*                                             stream's inventory        01205000
*                                             record. To check if the   01206000
*                                             resource manager is       01207000
*                                             connected, check field    01208000
*                                             IxgenfConnDiscResMgr-     01209000
*                                             -Connected. Set for both  01210000
*                                             connect and disconnect    01211000
*                                             events            @L8A */ 01212000
*                                                                       01213000
*                                                                       01214000
*                7 IxgenfConnDiscResMgrData CHAR(8), /* Resource        01215000
*                                             Manager Data. Contains    01216000
*                                             valid data only if        01217000
*                                             IxgenfConnDiscResMgr-     01218000
*                                             -Connected is set. Set    01219000
*                                             for both connect and      01220000
*                                             disconnect events @L8A */ 01221000
*                7 IxgenfConnDiscResMgrEvents BIT(8), /* Monitored      01222000
*                                             events. Contains          01223000
*                                             valid data only if        01224000
*                                             IxgenfConnDiscResMgr-     01225000
*                                             -Connected is set @L8A */ 01226000
*                  9 IxgenfConnDiscLBWrites BIT(1), /* If set, the      01227000
*                                             resource manager is       01228000
*                                             monitoring log block      01229000
*                                             write events      @L8A */ 01230000
*                  9 IxgenfConnDiscLBDeletes BIT(1), /* If set, the     01231000
*                                             resource manager is       01232000
*                                             monitoring log block      01233000
*                                             delete events     @L8A */ 01234000
*                7 IxgenfConnDiscFlags BIT(8), /* Additional            01235000
*                                             flags             @L8A */ 01236000
*                  9 IxgenfConnDiscAuthRead BIT(1), /* If set then      01237000
*                                             AUTH=READ specified on    01238000
*                                             the connect request. Set  01239000
*                                             for successful connect    01240000
*                                             requests.         @L8A */ 01241000
*                  9 IxgenfConnDiscAuthWrite BIT(1), /* If set then     01242000
*                                             AUTH=WRITE specified on   01243000
*                                             the connect request. Set  01244000
*                                             for successful connect    01245000
*                                             requests          @L8A */ 01246000
*                  9 IxgenfConnDiscResMgrManaged bit(1), /* If set,     01247000
*                                             RMNAME keuword specified  01248000
*                                             on log stream definition  01249000
*                                                               @L8A */ 01250000
*                  9 IxgenfConnDiscResMgrConnected bit(1), /* If set,   01251000
*                                             resource manager is       01252000
*                                             connected to the log      01253000
*                                             stream. Valid for both    01254000
*                                             connect and disconnect    01255000
*                                             events            @L8A */ 01256000
*                  9 IxgenfConnDiscConnect bit(1), /* If set, this      01257000
*                                             parmlist represents a     01258000
*                                             connect request   @L8A */ 01259000
*                  9 IxgenfConnDiscDisConnect bit(1),                   01260000
*                                             /* If set, this           01261000
*                                             parmlist represents a     01262000
*                                             disconnect request        01263000
*                                                               @L8A */ 01264000
*                  9 IxgenfConnDiscUsingPhysStr BIT(1), /* On = using   01265000
*                                             physical structure @LAA*/ 01266000
*                  9 IxgenfConnDiscUsingPhysStr2 BIT(1), /* On = using  01267000
*                                      second physical structure @LAA*/ 01268000
*                                                                       01269000
*                7 IxgenfConnDiscNumOfReads FIXED(31), /* Number of     01270000
*                                                read connections to    01271000
*                                                this log stream. Set   01272000
*                                                for both connect and   01273000
*                                                disconnect events      01274000
*                                                               @L8A */ 01275000
*                7 IxgenfConnDiscNumOfWrites FIXED(31), /* Number of    01276000
*                                                write connections to   01277000
*                                                this log stream. Set   01278000
*                                                for both connect and   01279000
*                                                disconnect events      01280000
*                                                               @L8A */ 01281000
*                7 IxgenfConnDiscLSDescription CHAR(16),                01282000
*                                             /* LS Description data    01283000
*                                                specified when the     01284000
*                                                log stream was         01285000
*                                                defined or its         01286000
*                                                definition updated in  01287000
*                                                inventory      @L8A */ 01288000
*                                                                       01289000
*                7 IxgenfConnDiscLogStreamPhysStrsVers CHAR(16), /*     01290000
*                                            Version numbers of         01291000
*                                            physical structures @LAA*/ 01292000
*                  9 IxgenfConnDiscLogStreamPhysStrVer CHAR(8),         01293000
*                                          /* Physical structure        01294000
*                                             version number of the     01295000
*                                             CF structure associated   01296000
*                                             with this log stream. Set 01297000
*                                             for both ConnSuccess and  01298000
*                                             DisconnSuccess events     01299000
*                                                               @LAA */ 01300000
*                    11 IxgenfConnDiscLogStreamPhysInsVer CHAR(8),      01301000
*                                          /* Alternate name for DASD   01302000
*                                             only log stream.  STCK    01303000
*                                             value when the log stream 01304000
*                                             staging data set was      01305000
*                                             allocated         @LAA */ 01306000
*                                                                       01307000
*                  9 IxgenfConnDiscLogStreamPhysStr2Ver CHAR(8),        01308000
*                                          /* Second physical structure 01309000
*                                             version number of the     01310000
*                                             CF structure associated   01311000
*                                             with this log stream. Set 01312000
*                                             for both ConnSuccess and  01313000
*                                             DisconnSuccess events     01314000
*                                                               @LAA */ 01315000
*                7 IxgenfConnDiscDisconnInfo,  /* Last disconnect from  01316000
*                                                 the log stream on     01317000
*                                                 this system info.     01318000
*                                                               @LDA */ 01319000
*                  9 IxgenfConnDiscCount fixed(16),                     01320000
*                                          /* The number of connections 01321000
*                                             to this log stream in the 01322000
*                                             sysplex.  Set only when   01323000
*                                             IxgenfSystemLevelDisc     01324000
*                                             is on.            @LDA */ 01325000
*            5   IxgenfWrOffLoadInfo                                    01326000
*                  bdy(word),         /* Writer Offload has completed   01327000
*                                        from Logger inventory          01328000
*                                                                @LBC*/ 01329000
*                7 IxgenfWrOffLoadGMTTimeStamp BIT(64), /* Time stamp   01330000
*                                                               @L8A */ 01331000
*                7 IxgenfWrOffLoadLogStreamName                         01332000
*                   CHAR(LENGTH(IxgenfLogStreamNames)), /* log stream   01333000
*                                             name              @L8A */ 01334000
*                7 IxgenfWrOffLoadSafeImportPoint CHAR(8),/* Highest    01335000
*                                             log block id, that is     01336000
*                                             no longer in the          01337000
*                                             coupling facility @L8A */ 01338000
*                                                                       01339000
*                                                                       01340000
*            5   IxgenfLogStreamNames (*) CHAR(26);                     01341000
*                                         /* Name(s) of log streams     01342000
*                                            that are connected to the  01343000
*                                            structure and affected by  01344000
*                                            the reported event @L8A */ 01345000
*   DECLARE  IxgenfEyeCatcher CHAR(4) CONSTANT('ENF '),                 01346000
*                                                                       01347000
*            IxgenfCompId     CHAR(5) CONSTANT('SCLOG');                01348000
*                                                                       01349000
*@LOGIC;                                                                01350000
*#PRAGMA TOOL=CBGEN.                                                    01351000
*#DELETE.IXGENFCOMPID                                                   01352000
*#EPRAGMA.                                                              01353000
*@ENDLOGIC;                                                             01354000
*/* End of PL/X Source                                               */ 01355000
* %IF IXGENF_LIST ^= 'NO' &                                             01356000
*    ZCBPRINT ^= 'NO' %THEN                                             01357000
*   %GOTO IXGENF_4;                                                     01358000
*   @LIST POP NOECHO;                                                   01359000
* %IXGENF_4:;                                                           01360000
* %END;                                                                 01361000
