*                                                                       00010000
* %DCL IXGSMF88_INCLUDED CHAR EXT;                                      00020000
* %DEACTIVATE IXGSMF88_INCLUDED;                                        00030000
* %IF IXGSMF88_INCLUDED = '' %THEN                                      00040000
* %DO;                                                                  00050000
*/* Macro made bi-lingual on 97322. CBGEN compile date 97252         */ 00060000
*% /*                                                                   00070000
         MACRO                                                          00080000
         IXGSMF88 &DSECT=YES,&LIST=YES,&TITLE=YES,&SMFRCD88=YES,       *00090000
               &SMF88PSD=COND,&SMF88LSD=COND,&SMF88ESD=COND,           *00100000
               &SMF88SSD=COND,&SMF88ASD=COND                            00110000
         GBLC  &IXGSMF88_INCLUDED                                       00120000
         GBLC  &ZCBPRINT                                                00130000
&IXGSMF88_INCLUDED SETC 'YES'                                           00140000
         AIF   ('&LIST' EQ 'NONE').P0                                   00150000
         AIF   ('&TITLE' EQ 'NO').P5                                    00160000
 TITLE   'IXGSMF88  - LOGGER mapping for SMF Record Type 88       '     00170000
.P5      ANOP                                                           00180000
**/ IXGSMF88_1:;                                                        00190000
*/* START OF SPECIFICATIONS ******************************************/ 00200000
*/*                                                                  */ 00210000
*/*                                                                  */ 00220000
*/*01* PROPRIETARY STATEMENT=                                        */ 00230000
*/***PROPRIETARY_STATEMENT********************************************/ 00240000
*/*                                                                  */ 00250000
*/*                                                                  */ 00260000
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00270000
*/* 5650-ZOS                                                         */ 00280000
*/* COPYRIGHT IBM CORP. 1994, 2019                                   */ 00293900
*/*                                                                  */ 00300000
*/* STATUS = HBB77C0                                                 */ 00313900
*/*                                                                  */ 00320000
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 00330000
*/*                                                                  */ 00340000
*/*02* ACRONYM:  IXGSMF88                                            */ 00350000
*/*                                                                  */ 00360000
*/*01* DESCRIPTIVE NAME: LOGGER mapping for SMF Record Type 88       */ 00370000
*/*                                                                  */ 00380000
*/*01* MACRO NAME: IXGSMF88                                          */ 00390000
*/*                                                                  */ 00400000
*/*01* DSECT NAME:  SMFRCD88                                         */ 00410000
*/*                                                                  */ 00420000
*/*01* COMPONENT:  System Logger (SCLOG)                             */ 00430000
*/*                                                                  */ 00440000
*/*01* EYE CATCHER: None                                             */ 00450000
*/*02*   OFFSET:    N/A                                              */ 00460000
*/*02*   LENGTH:    N/A                                              */ 00470000
*/*                                                                  */ 00480000
*/*01* STORAGE ATTRIBUTES:                                           */ 00490000
*/*02*  Subpool: Caller-determined                             @L1C  */ 00500000
*/*02*  Key: Caller-determined                                 @L1A  */ 00510000
*/*02*  Residency: Caller-determined                           @L1A  */ 00520000
*/*                                                                  */ 00530000
*/*01* SIZE: Sum of component sections:                        @L5C  */ 00540000
*/*        subtype 1:                                            @P3A*/ 00550000
*/*           SMFRCD88 -- X'0044' bytes                              */ 00560000
*/*             SMF88SDS -- X'002C' bytes w/in smfrcd88          @P3A*/ 00570000
*/*           SMF88PSD -- X'001C' bytes                              */ 00580000
*/*           SMF88LSD -- X'0058' bytes   (prev '50'x)           @L9C*/ 00590000
*/*           SMF88ESD -- X'0038' bytes   (prev '24'x)           @P3C*/ 00600000
*/*           SMF88SSD -- X'0044' bytes                              */ 00610000
*/*                                                                  */ 00620000
*/*        subtype 11:                                           @P3A*/ 00630000
*/*           SMFRCD88 -- X'0044' bytes                          @P3A*/ 00640000
*/*             SMF88SDS -- X'002C' bytes w/in smfrcd88          @P3A*/ 00650000
*/*           SMF88PSD -- X'001C' bytes                          @P3A*/ 00660000
*/*           SMF88ASD -- X'0041' bytes                              */ 00670000
*/*                                                                  */ 00680000
*/*01* CREATED BY: IXGM1TSK (or caller)                        @L1C  */ 00690000
*/*                                                                  */ 00700000
*/*01* POINTED TO BY:  Basing set up by module that calls IFASMFRA   */ 00710000
*/*                                                                  */ 00720000
*/*01* SERIALIZATION:  None                                          */ 00730000
*/*                                                                  */ 00740000
*/*01* FUNCTION:  Mapping of LOGGER component SMF Record (Type 88)   */ 00750000
*/*                                                                  */ 00760000
*/*01* EXTERNAL CLASSIFICATION: GUPI                                 */ 00770000
*/*01* END OF EXTERNAL CLASSIFICATION:                               */ 00780000
*/*                                                                  */ 00790000
*/*01* METHOD OF ACCESS:                                             */ 00800000
*/*                                                                  */ 00810000
*/*   PLX: %IXGSMF88_LIST = 'NO' suppresses printing of this macro,  */ 00820000
*/*                          any other value will list the macro.    */ 00830000
*/*        %IXGSMF88BASE = '' results in the SMFRCD88 structure      */ 00840000
*/*                   being declared 'BASED'.  %ISGSMF88BASE can be  */ 00850000
*/*                   set to override this to something else, for ex.*/ 00860000
*/*                   'BASED(SMF88PTR)' or ' '.                      */ 00870000
*/*                                                                  */ 00880000
*/*        %IFAR88 = 'YES' selects IXGSMF88 in IFASMFRA      @L1A    */ 00890000
*/*        %INCLUDE SYSLIB(IFASMFRA)                         @L1C    */ 00900000
*/*                                                                  */ 00910000
*/*   ASM: IRASMFRA IXGSMF88                                 @L1C    */ 00920000
*/*                                                                  */ 00930000
*/* DELETED-BY: Caller                                       @L1C    */ 00940000
*/*                                                                  */ 00950000
*/* DEPENDENCIES: N/A                                                */ 00960000
*/*                                                                  */ 00970000
*/* NOTES:                                                           */ 00980000
*/* 1-SYS1.SAMPLIB member IXGRPT1 uses this mapping macro,       @L1A*/ 00990000
*/*   and would need updating if incompatible changes were made. @L1A*/ 01000000
*/*   Any fields added/deleted to this macro has to be reflected @05A*/ 01010000
*/*   in the sort portion of SYS1.SAMPLIB members IXGRPT1 and    @05A*/ 01020000
*/*   IXGRPT1J.                                                  @05A*/ 01030000
*/*                                                                  */ 01040000
*/* 2-Any changes made to this macro has to be reflected in the  @05A*/ 01050000
*/*   "MVS System Management Facilities" book in section for     @05A*/ 01060000
*/*   SMF88 records.                                             @05A*/ 01070000
*/*                                                                  */ 01080000
*/* 3-LOGGR SMF counts of bytes written/deleted are internally   @05C*/ 01090000
*/*   rounded up to internal buffer sizes and/or to satisfy other@L3A*/ 01100000
*/*   internal requirements.  Additionally, many LOGGR services  @L3A*/ 01110000
*/*   may complete asynchronously so that the counts are not     @L3A*/ 01120000
*/*   incremented in the same interval that the LOGGR service    @L3A*/ 01130000
*/*   was invoked.  SMF data should therefore be regarded as     @L3A*/ 01140000
*/*   roughly proportional, sampled data.                        @L4C*/ 01150000
*/*                                                              @L4A*/ 01160000
*/* 4-LOGGR internally manages the coupling facility structure   @05C*/ 01170000
*/*   storage, offloading/migrating data to DASD when the        @L4C*/ 01180000
*/*   structure is full.  An ?IXGDELET request may be issued     @L4C*/ 01190000
*/*   while the data is still in the coupling facility, or AFTER @L4C*/ 01200000
*/*   the data has been migrated to DASD.   Field SMF88SIB tracks@L4C*/ 01210000
*/*   bytes deleted via ?IXGDELET where the data was still in the@L5C*/ 01220000
*/*   structure.   ?IXGDELETs where the bytes have been migrated @L5C*/ 01230000
*/*   to DASD are NOT tracked in this SMF record.  Field         @L5C*/ 01240000
*/*   SMF88SAB tracks bytes deleted from the coupling facility   @L5C*/ 01250000
*/*   due to LOGGR internal management (the deleted bytes were   @L5C*/ 01260000
*/*   offloaded to DASD via LOGGR internal management and then   @L5C*/ 01270000
*/*   deleted from the structure.)                               @L5C*/ 01280000
*/*                                                              @L5D*/ 01290000
*/* 5-'Interim Storage' refers to either the CF (Coupling        @05C*/ 01300000
*/*   Facility), or to Staging Data sets in the case when a          */ 01310000
*/*   DASD Only Logstream is being used.                         @03C*/ 01320000
*/*                                                                  */ 01330000
*/* 6-Time stamps in IXGSMF88 are GMT times, not local.          @P2A*/ 01340000
*/*                                                                  */ 01350000
*/*01* CHANGE ACTIVITY:                                              */ 01360000
*/*                                                                  */ 01370000
*/*   Flag LineItem  FMID    Date   ID    Comment                    */ 01380000
*/*                                                                  */ 01390000
*/*    $L0=LOGGR   HBB5520 940414   PDA5:  Initial release.          */ 01400000
*/*    $L1=LOGGR   HBB5520 940602   PDA5:  prolog, comments, basing, */ 01410000
*/*        delete SMF88EWR, SMF88SC4, rename SMF88ESF.               */ 01420000
*/*    $L2=LOGGR   HBB5520 940728   PDA5:  more comments (use float) */ 01430000
*/*        delete SMF88SWI                                           */ 01440000
*/*    $L3=LOGGR   HBB5520 940728   PDA5:  more comments             */ 01450000
*/*    $L4=LOGGR   HBB5520 940912   PDA5:  correct comments          */ 01460000
*/*    $L5=LOGGR   HBB5520 941020   PDA5:  Staging Dataset support   */ 01470000
*/*    $01=OW11208 HBB5520 950210   PDDZ:  TRSQ PTN PN72437 SMF88EO  */ 01480000
*/*    $02=OW11809 HBB5520 950321   PDV6:  ADDED SMF88EFS            */ 01490000
*/*    $L6=LOGGR   HBB6603 960329   PDZJ:  Add alter statistics  @L6A*/ 01500000
*/*    $L7=RSR     HBB6603 960329   PDXD:  Remote Site Recovery  @L7A*/ 01510000
*/*    $P1=PQC1069 HBB6603 950404   PDV6:  Added SMF88ATW, SMF88LDS  */ 01520000
*/*    $03=OW27705 JBB6604 970616   PDA8:  DASDONLY SMF recording    */ 01530000
*/*                                        TRSQ PSY0666          @03A*/ 01540000
*/*    $04=OW29849 HBB6603 971006   PDC9:  Offload Performance   @04A*/ 01550000
*/*    $05=OW44839 HBB6603 000607   PDAJ:  IXGRPT1 sort error    @05A*/ 01560000
*/*    $P2=PYM0462 HBB7706 010912   PDAS:  Change prolog to state    */ 01570000
*/*                                        that time is reported     */ 01580000
*/*                                        in GMT.               @P2A*/ 01590000
*/*    $06=OA03055 HBB7703 030529   PDA8: Change descriptions        */ 01600000
*/*    $L8=XRCLOG  HBB7720 040122   PDDZ: XRC+                   @L8A*/ 01610000
*/*    $P3=ME00853 HBB7720 040525   PDDZ: accounting updates     @P3A*/ 01620000
*/*    $L9=LOGSEP  HBB7730 050407   PD00A8: Separation Support       */ 01621000
*/*    $P4=ME10027 HBB7750 070518   PDDZ: prolog cleanup         @P4A*/ 01622000
*/*    $07=OA38747 HBB7780 120828   PDDZ: zai enabled            @07A*/ 01626900
*/*   $LA=LOGRMXRC HBB77B0 160613 PDDZ: remove DRXRC support     @LAA*/ 01627000
*/*                                                                  */ 01630000
*/*END OF SPECIFICATIONS *********************************************/ 01640000
*% /*                                                                   01650000
.P0      ANOP                                                           01660000
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 01670000
         AIF   ('&LIST' EQ 'YES').P2                                    01680000
.P1      ANOP                                                           01690000
         PUSH  PRINT                                                    01700000
         PRINT OFF                                                      01710000
.P2      ANOP                                                           01720000
         AIF   ('&SMFRCD88' EQ 'NO').L0002                              01730000
         AIF   ('&DSECT' EQ 'YES').L0003                                01740000
         AIF   ('&SMFRCD88' NE 'YES').L0002                             01750000
SMFRCD88 DS    0F                                                       01760000
         AGO   .L0004                                                   01770000
.L0003   ANOP                                                           01780000
SMFRCD88 DSECT                                                          01790000
.L0004   ANOP                                                           01800000
*                                                                       01810000
* ********************************************************************  01820000
* *   HEADER SECTION                                                    01830000
* ********************************************************************  01840000
*                                                                       01850000
*                                                                       01860000
SMF88RPS DS    0CL0024   Record Header Section                          01870000
SMF88LEN DS    1FL2      Record Length                                  01880000
SMF88SEG DS    1FL2      Segment Descriptor                             01890000
SMF88FLG DS    0CL0001   Header Flag Byte                               01900000
         ORG   SMF88FLG+X'00000001'                                     01910000
SMF88RTY DS    1CL0001   Record Type - 88                               01920000
SMF88TME DS    1FL4      Recd Written Time                              01930000
SMF88DTE DS    1CL0004   Record Written Date                            01940000
SMF88SID DS    1CL0004   System Identification (from SMFPRMxx SID      *01950000
                         Parameter)                                     01960000
SMF88WID DS    1CL0004   Subsystem ID = STC                             01970000
SMF88STP DS    1FL2      Record Subtype                                 01980000
*                                                                       01990000
* ********************************************************************  02000000
* *   SELF DEFINING SECTION                                             02010000
* ********************************************************************  02020000
*                                                                       02030000
*                                                                       02040000
SMF88SDS DS    0CL0044   Self Defining Section                          02050000
SMF88SDL DS    1FL4      Length of Self Defining Section                02060000
SMF88POF DS    1FL4      Offset to Product Section                      02070000
SMF88PLN DS    1FL2      Length of Product Section                      02080000
SMF88PON DS    1FL2      Number of Product Section                      02090000
SMF88LOF DS    1FL4      Offset to Log Stream Section                   02100000
SMF88LLN DS    1FL2      Length of Log Stream Section                   02110000
SMF88LON DS    1FL2      Number of Log Stream Sections                  02120000
SMF88EOF DS    1FL4      Offset to Event Section                        02130000
SMF88ELN DS    1FL2      Length of Event Section                        02140000
SMF88EON DS    1FL2      Number of Event Sections                       02150000
SMF88SOF DS    1FL4      Offset to Structure Section                    02160000
SMF88SLN DS    1FL2      Length of Structure Section                    02170000
SMF88SON DS    1FL2      Number of Structure Sections                   02180000
SMF88AOF DS    1FL4      Offset to Structure Alter section              02190000
SMF88ALN DS    1FL2      Length of Structure Alter section              02200000
SMF88AON DS    1FL2      Number of Structure Alter section              02210000
SMFRCD88_LEN EQU *-SMFRCD88                                             02220000
.L0002   ANOP                                                           02230000
*                                                                       02240000
* ********************************************************************  02250000
* *   PRODUCT SECTION                                                   02260000
* ********************************************************************  02270000
*                                                                       02280000
*                                                                       02290000
         AIF   ('&SMF88PSD' EQ 'NO').L0005                              02300000
         AIF   ('&DSECT' EQ 'YES').L0006                                02310000
         AIF   ('&SMF88PSD' NE 'YES').L0005                             02320000
SMF88PSD DS    0H                                                       02330000
         AGO   .L0007                                                   02340000
.L0006   ANOP                                                           02350000
SMF88PSD DSECT                                                          02360000
.L0007   ANOP                                                           02370000
SMF88TYP DS    1FL2      Record Sub-type 1 - Log stream Update          02380000
SMF88RVN DS    1CL0002   Record Version Number                     @L9C 02390000
SMF88PNM DS    1CL0008   Product Name - 'SCLOG '                        02400000
SMF88OSL DS    1CL0008   MVS Product Level                              02410000
SMF88SYN DS    1CL0008   Current System Name (from SYSNAME PARMLIB     *02420000
                         option)                                        02430000
SMF88PSD_LEN EQU *-SMF88PSD                                             02440000
.L0005   ANOP                                                           02450000
*                                                                       02460000
* ********************************************************************  02470000
* *   LOG STREAM SECTION                                                02480000
* ********************************************************************  02490000
*                                                                       02500000
*                                                                       02510000
         AIF   ('&SMF88LSD' EQ 'NO').L0008                              02520000
         AIF   ('&DSECT' EQ 'YES').L0009                                02530000
         AIF   ('&SMF88LSD' NE 'YES').L0008                             02540000
SMF88LSD DS    0F        Section describing a Log Stream.               02550000
         AGO   .L000A                                                   02560000
.L0009   ANOP                                                           02570000
SMF88LSD DSECT           Section describing a Log Stream.               02580000
.L000A   ANOP                                                           02590000
SMF88LIT DS    1CL0008   SMF-counter Instance Token.                    02600000
SMF88LSN DS    1CL0026   Log Stream Name                                02610000
SMF88LFL DS    0CL0002   Log Stream Flags.                              02620000
SMF88LFD EQU   X'80'     Valid on when SMF88LFT is on.                  02630000
*                        When ON, DRXRC-type staging data set used      02640000
*                        during the expiring SMF interval.         @L8A 02650000
*                        This flag will no longer be set on as of       02651000
*                        release HBB77B0 (z/OS v2r3).              @LAA 02652000
SMF88LFT EQU   X'40'     If set, this logstream used staging datasets  *02660000
                         during the expiring SMF interval.              02670000
SMF88LDS EQU   X'20'     When ON, the SMF record has been generated as *02680000
                         a result of the log stream disconnecting from *02690000
                         the system.                                    02700000
SMF88LZA EQU   X'10'     When ON, the log stream has ZAI(YES)           02712900
*                        specified to send log data to the IBM zAware   02713900
*                        server.                                   @07A 02714900
         DS    1BL.012   Reserved.                                 @07C 02717900
         ORG   SMF88LFL+X'00000002'                                     02720000
SMF88LTD DS    1CL0008   TOD-time when SMF global interval expired     *02730000
                         (from parameter list of ENF event 37 which    *02740000
                         requested this SMF-record from Logger).        02750000
SMF88LWI DS    1FL4      IXGWRITE invocations for this Log Stream      *02760000
                         issued during the expiring SMF interval.       02770000
SMF88LIB DS    1FL4      Minimum BLOCKLEN value of IXGWRITE seen       *02780000
                         during the expiring SMF interval. Initialized *02790000
                         to X'7FFFFFFF' if no SMF activity occurs      *02800000
                         within the SMF interval.                       02810000
SMF88LAB DS    1FL4      Maximum BLOCKLEN value of IXGWRITE seen by    *02820000
                         this Log Stream during the expiring SMF       *02830000
                         interval Initialized to zero if no SMF        *02840000
                         activity occurs within the SMF interval.       02850000
SMF88LWB DS    1CL0008   Bytes REQUESTED by user application(s) on     *02860000
                         ?IXGWRITE invocations for this log stream     *02870000
                         during the expiring SMF interval (FORMAT=LONG *02880000
                         FLOATING POINT). See Notes.                    02890000
SMF88LDB DS    1CL0008   Count of bytes written to DASD during the     *02900000
                         expiring SMF interval (FORMAT=LONG FLOATING   *02910000
                         POINT). SMF88LDB = SMF88SAB + storage-for     *02920000
                         -LOGGR-internal-requirements (ex, rounding,   *02930000
                         internally-required control information.) See *02940000
                         Notes.                                         02950000
SMF88LIO DS    1FL4      Number of times a request was made by System  *02960000
                         Logger to write log stream data to DASD       *02970000
                         during the expiring SMF interval               02980000
SMF88LIS DS    1FL4      Number of times System Logger had to suspend  *02990000
                         before writing log stream data to DASD        *03000000
                         because a previously initiated write to DASD  *03010000
                         had not yet completed during the expiring SMF *03020000
                         interval                                       03030000
SMF88GRP DS    1CL0008   GROUP Value for this logstream (Either PROD or 03031000
*                        TEST) padded with Blanks.                 @L9A 03032000
SMF88LSD_LEN EQU *-SMF88LSD                                             03040000
.L0008   ANOP                                                           03050000
*                                                                       03060000
* ********************************************************************  03070000
* *   EVENTS SECTION                                                    03080000
* ********************************************************************  03090000
*                                                                       03100000
*                                                                       03110000
         AIF   ('&SMF88ESD' EQ 'NO').L000B                              03120000
         AIF   ('&DSECT' EQ 'YES').L000C                                03130000
         AIF   ('&SMF88ESD' NE 'YES').L000B                             03140000
SMF88ESD DS    0F        Section describing Events                      03150000
         AGO   .L000D                                                   03160000
.L000C   ANOP                                                           03170000
SMF88ESD DSECT           Section describing Events                      03180000
.L000D   ANOP                                                           03190000
SMF88EDS DS    1FL4      Number of Log Stream DASD-shifts initiated by *03200000
                         this system during the expiring SMF interval   03210000
SMF88ERI DS    1FL4      Number of 'Structure Rebuild' events          *03220000
                         +initiated+ for this log stream during the    *03230000
                         expiring SMF interval.                         03240000
SMF88ERC DS    1FL4      Number of 'Structure Rebuild' events          *03250000
                         =completed= for this log stream during the    *03260000
                         expiring SMF interval.                         03270000
SMF88ESF DS    1FL4      Number of times Logger detected 'Structure    *03280000
                         full' condition for this logstream on this    *03290000
                         system during the expiring SMF interval.  @06C 03300000
SMF88ETT DS    1FL4      Number of times IXGLOGR detected              *03310000
                         'Staging-Dataset-Thre shold-Hit' condition    *03320000
                         for this logstream on this system during the  *03330000
                         expiring SMF interval.                         03340000
SMF88ETF DS    1FL4      Number of times IXGLOGR detected              *03350000
                         'Staging-Dataset-FULL' condition for this     *03360000
                         logstream on this system during the expiring  *03370000
                         SMF interval.                                  03380000
SMF88EO  DS    1FL4      Number of times IXGLOGR performed successful  *03390000
                         offload (>1 byte of data) for this logstream  *03400000
                         on this system during the expiring interval    03410000
SMF88EFS DS    1FL4      Number of times IXGLOGR performed an offload  *03420000
                         for all the log streams connected on this     *03430000
                         system to the structure due to the            *03440000
                         structure's total in-use list entries         *03450000
                         reaching 90% of the total available entries   *03460000
                         for the structure. This count is the number   *03470000
                         of occurances of this condition for the       *03480000
                         expiring interval.                             03490000
SMF88EDO DS    1FL4      Number of times a demand initiated offload    *03500000
                         was requested (via IXGOFFLD) for this         *03510000
                         logstream on this system during the expiring  *03520000
                         interval                                       03530000
SMF88EAF DS    1FL4      Number of times IXGLOGR detected               03540000
*                        'Staging-Dataset-Async-Buffer_Full' condition  03550000
*                        for this logstream on this system during the   03560000
*                        expiring SMF interval.                    @P3A 03570000
*                        This field will no longer be filled in as of   03571000
*                        release HBB77B0 (z/OS v2r3).              @LAA 03572000
         DS    1CL0016   Reserved                                  @P3A 03580000
*                                                                       03590000
SMF88ESD_LEN EQU *-SMF88ESD                                             03600000
.L000B   ANOP                                                           03610000
*                                                                       03620000
* ********************************************************************  03630000
* *   STRUCTURE (Interim Storage) Section.  See notes                   03640000
* ********************************************************************  03650000
*                                                                       03660000
*                                                                       03670000
         AIF   ('&SMF88SSD' EQ 'NO').L000E                              03680000
         AIF   ('&DSECT' EQ 'YES').L000F                                03690000
         AIF   ('&SMF88SSD' NE 'YES').L000E                             03700000
SMF88SSD DS    0F        Section describing a Structure                 03710000
         AGO   .L0010                                                   03720000
.L000F   ANOP                                                           03730000
SMF88SSD DSECT           Section describing a Structure                 03740000
.L0010   ANOP                                                           03750000
SMF88STN DS    1CL0016   Structure Name of structure used for this Log *03760000
                         Stream.                                        03770000
SMF88SWB DS    1CL0008   Current WRITTEN-Bytes-Structure. Count of     *03780000
                         bytes written to interim storage for this     *03790000
                         logstream for this interval. See Notes.       *03800000
                         (format=LONG FLOATING POINT).                  03810000
SMF88SIB DS    1CL0008   Current INSTEAD-Bytes count. Count of bytes   *03820000
                         deleted from interim storage during this      *03830000
                         interval INSTEAD OF being moved to DASD.      *03840000
                         (format = LONG FLOATING POINT). This field is *03850000
                         only incremented due to user ?IXGDELET        *03860000
                         invocations when the data had not yet been    *03870000
                         migrated from interim storage to DASD. See    *03880000
                         notes.                                         03890000
SMF88SAB DS    1CL0008   Current AFTER-Bytes count. Count of bytes     *03900000
                         deleted from interim storage during this      *03910000
                         interval AFTER being moved to DASD (format =  *03920000
                         LONG FLOATING POINT). This field is only      *03930000
                         incremented due to LOGGR internal management  *03940000
                         of interim storage. See Notes.                 03950000
         DS    1CL0004   Reserved                                       03960000
SMF88SII DS    1FL4      Current INSTEAD-Invoc count. Count of times a *03970000
                         deletion from interim storage was performed   *03980000
                         during this interval, where the data was NOT  *03990000
                         first migrated to DASD. See notes.             04000000
SMF88SAI DS    1FL4      Current AFTER-Invoc count. Count of times a   *04010000
                         deletion from interim storage was performed   *04020000
                         during this interval, AFTER being migrated to *04030000
                         DASD (occurs due to LOGGR management of       *04040000
                         interim storage.) See notes.                   04050000
SMF88SC1 DS    1FL4      Count of type-1 completions during the        *04060000
                         expired SMF interval. Log stream contents can *04070000
                         remain in interim storage. No need to move    *04080000
                         data from interim storage to DASD. See Notes.  04090000
SMF88SC2 DS    1FL4      Count of type-2 completions during the        *04100000
                         expired SMF interval. Log stream is filling   *04110000
                         interim storage but space is not critical.    *04120000
                         Logger must move data from interim storage to *04130000
                         DASD. See notes.                               04140000
SMF88SC3 DS    1FL4      Count of type-3 completions during the        *04150000
                         expired SMF interval. Space used in interim   *04160000
                         storage (by this log stream) is critical but  *04170000
                         does not exceed 100 percent. See notes.       *04180000
                         Undefined for DASDONLY Logstreams.        @06C 04190000
         DS    1CL0004   Reserved                                       04200000
SMF88SSD_LEN EQU *-SMF88SSD                                             04210000
.L000E   ANOP                                                           04220000
*                                                                       04230000
* ********************************************************************  04240000
* *   STRUCTURE Alter SECTION - These are measurements that are      *  04250000
* *   reset each time a check is made to alter the structure            04260000
* ********************************************************************  04270000
*                                                                       04280000
*                                                                       04290000
         AIF   ('&SMF88ASD' EQ 'NO').L0011                              04300000
         AIF   ('&DSECT' EQ 'YES').L0012                                04310000
         AIF   ('&SMF88ASD' NE 'YES').L0011                             04320000
SMF88ASD DS    0F        Section describing Structure Alter info        04330000
         AGO   .L0013                                                   04340000
.L0012   ANOP                                                           04350000
SMF88ASD DSECT           Section describing Structure Alter info        04360000
.L0013   ANOP                                                           04370000
SMF88ANM DS    1CL0016   Structure Name                                 04380000
SMF88ATK DS    1CL0008   Alter Token which is a STCK timestamp,        *04390000
                         associated with the last time the element to  *04400000
                         entry ratio was altered to accomadate the     *04410000
                         average buffer size being written to the      *04420000
                         structure                                      04430000
SMF88AIT DS    1CL0008   SMF-counter Instance Token.                    04440000
SMF88AWB DS    1CL0008   Current WRITTEN-Bytes-Structure. Count of     *04450000
                         bytes written to the structure on this        *04460000
                         system, associated with this Alter token for  *04470000
                         this interval. See Notes. (format=LONG        *04480000
                         FLOATING POINT).                               04490000
SMF88AO  DS    1FL4      The number of offloads that occured on this   *04500000
                         system associated with this Alter token, for  *04510000
                         this interval.                                 04520000
SMF88ACB DS    1FL4      Current allocated average buffer size for the *04530000
                         structure.                                     04540000
SMF88ATB DS    1FL4      Targeted average buffer size, average buffer  *04550000
                         size System Logger attempted to achieve, by   *04560000
                         altering the element to entry ratio.           04570000
SMF88ASZ DS    1FL4      Structure Size. Represented in the number of  *04580000
                         4K blocks.                                     04590000
SMF88ATW DS    1FL4      Total number of log data writes to the        *04600000
                         structure during the recording interval.       04610000
SMF88ALS DS    1FL4      Total number of log streams connected to the  *04620000
                         structure on this system at the time of the   *04630000
                         recording interval.                            04640000
SMF88AFG DS    0BL1      Flags                                          04650000
SMF88ABC EQU   X'80'     Record was generated to report a change in    *04660000
                         the average buffer size being written to the  *04670000
                         structure                                      04680000
SMF88ADC EQU   X'40'     Record was generated due to the last          *04690000
                         logstream disconnecting which resulted in the *04700000
                         structure Being disconnect                     04710000
*                                                                       04720000
* ********************************************************************  04730000
* *   IXGSMF88 - CONSTANTS                                           *  04740000
* ********************************************************************  04750000
*                                                                       04760000
*                                                                       04770000
SMF88_SMF_RECORD_TYPE EQU 88 Value of SMF88RTY record-type 88          *04780000
                         (decimal)                                      04790000
SMF88_SMF_RECORD_SUBTYPE EQU 1 Subtype                                  04800000
SMF88_SSMF_RECORD_SUBTYPE EQU 11 Subtype for structure alter           *04810000
                         information                                    04820000
SMF88_SMF_RECORD_VERSION EQU C'04' Value of SMF88RVN = version of      *04830000
                         SMFRCD88                                  @L9C 04840000
SMF88_BLOCKLEN_HIGH EQU X'7FFFFFFF' This constant is LARGER than the   *04850000
                         largest possible valid blocklen. SMF88 field  *04860000
                         SMF88LIB (minimum blocklen seen) is           *04870000
                         initialized to this high, invalid value if no *04880000
                         SMF activity occurs within an SMF interval.    04890000
SMF88_BLOCKLEN_ZERO EQU 0 This constant is SMALLER than the smallest   *04900000
                         possible valid blocklen. SMF88 field SMF88LAB *04910000
                         (maximum blocklen seen) is initialized to     *04920000
                         this low, invalid value if no SMF activity    *04930000
                         occurs within an SMF interval.                 04940000
         ORG   SMF88ASD+X'00000041'                                     04950000
SMF88ASD_LEN EQU *-SMF88ASD                                             04960000
.L0011   ANOP                                                           04970000
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 04980000
         AIF   ('&LIST' EQ 'YES').P4                                    04990000
.P3      ANOP                                                           05000000
         POP   PRINT                                                    05010000
.P4      ANOP                                                           05020000
.P_EXIT  ANOP                                                           05030000
         MEND                                                           05040000
**/ IXGSMF88_2:;                                                        05050000
* %IXGSMF88_INCLUDED = 'YES';                                           05060000
* %DCL ZCBPRINT CHAR EXT;                                               05070000
* %DEACTIVATE ZCBPRINT;                                                 05080000
* %DCL IXGSMF88_LIST CHAR EXT;                                          05090000
* %DEACTIVATE IXGSMF88_LIST;                                            05100000
* %IF IXGSMF88_LIST ^= 'NO' &                                           05110000
*    ZCBPRINT ^= 'NO' %THEN                                             05120000
*   %GOTO IXGSMF88_3;                                                   05130000
*   @LIST PUSH NOECHO;                                                  05140000
*   @LIST NOASSEMBLE NOECHO;                                            05150000
*   @LIST OFF C NOECHO;                                                 05160000
* %IXGSMF88_3:;                                                         05170000
*/* Start of PL/X Source                                             */ 05180000
* %IF IXGSMF88BASE = '' %THEN                                           05190000
*   %GOTO IXGSMF88_40;                                                  05200000
*DCL 1 SMFRCD88 IXGSMF88BASE,                                           05210000
*   %GOTO IXGSMF88_50;                                                  05220000
* %IXGSMF88_40:;                                                        05230000
*DCL 1 SMFRCD88 BASED,                                                  05240000
* %IXGSMF88_50:;                                                        05250000
*                                                                       05260000
*                                                                       05270000
*/********************************************************************/ 05280000
*/*   HEADER SECTION                                             @L5C*/ 05290000
*/********************************************************************/ 05300000
*                                                                       05310000
*      3 SMF88RPS,                  /* Record Header Section         */ 05320000
*        5 SMF88LEN FIXED(15),      /* Record Length                 */ 05330000
*        5 SMF88SEG FIXED(15),      /* Segment Descriptor            */ 05340000
*        5 SMF88FLG CHAR(1),        /* Header Flag Byte              */ 05350000
*          7 * BIT(1),              /* BIT 0 - SUBSYSTEM name follows   05360000
*                                      Standard Header               */ 05370000
*          7 * BIT(1),              /* BIT 1 - SUBTYPES Utilized     */ 05380000
*          7 * BIT(6),              /* BITS 2-7 Reserved             */ 05390000
*        5 SMF88RTY CHAR(1),        /* Record Type - 88              */ 05400000
*        5 SMF88TME FIXED(31) BDY(HWORD),  /* Recd Written Time      */ 05410000
*        5 SMF88DTE CHAR(4),        /* Record Written Date           */ 05420000
*        5 SMF88SID CHAR(4),        /* System Identification (from      05430000
*                                        SMFPRMxx SID Parameter)     */ 05440000
*        5 SMF88WID CHAR(4),        /* Subsystem ID = STC            */ 05450000
*        5 SMF88STP FIXED(15),      /* Record Subtype                */ 05460000
*                                                                       05470000
*/********************************************************************/ 05480000
*/*   SELF DEFINING SECTION                                      @L5C*/ 05490000
*/********************************************************************/ 05500000
*                                                                       05510000
*      3 SMF88SDS,                  /* Self Defining Section         */ 05520000
*        5 SMF88SDL FIXED(31),    /* Length of Self Defining Section */ 05530000
*        5 SMF88POF FIXED(31),      /* Offset to Product Section     */ 05540000
*        5 SMF88PLN FIXED(15),      /* Length of Product Section     */ 05550000
*        5 SMF88PON FIXED(15),      /* Number of Product Section     */ 05560000
*        5 SMF88LOF FIXED(31),      /* Offset to Log Stream Section  */ 05570000
*        5 SMF88LLN FIXED(15),      /* Length of Log Stream Section  */ 05580000
*        5 SMF88LON FIXED(15),      /* Number of Log Stream Sections */ 05590000
*        5 SMF88EOF FIXED(31),      /* Offset to Event Section       */ 05600000
*        5 SMF88ELN FIXED(15),      /* Length of Event Section       */ 05610000
*        5 SMF88EON FIXED(15),      /* Number of Event Sections      */ 05620000
*        5 SMF88SOF FIXED(31),      /* Offset to Structure Section   */ 05630000
*        5 SMF88SLN FIXED(15),      /* Length of Structure Section   */ 05640000
*        5 SMF88SON FIXED(15),      /* Number of Structure Sections  */ 05650000
*        5 SMF88AOF FIXED(31),      /* Offset to Structure Alter        05660000
*                                      section                   @L6A*/ 05670000
*        5 SMF88ALN FIXED(15),      /* Length of Structure Alter        05680000
*                                      section                   @L6A*/ 05690000
*        5 SMF88AON FIXED(15),      /* Number of Structure Alter        05700000
*                                      section                   @L6A*/ 05710000
*                                                                       05720000
*/********************************************************************/ 05730000
*/*   PRODUCT SECTION                                            @L5C*/ 05740000
*/********************************************************************/ 05750000
*                                                                       05760000
*    1 SMF88PSD BASED(ADDR(SMFRCD88)+SMF88POF),  /*                  */ 05770000
*      3 SMF88TYP FIXED(15),        /* Record Sub-type               */ 05780000
*                                   /*   1 - Log stream Update       */ 05790000
*      3 SMF88RVN CHAR(2),          /* Record Version Number     @L9C*/ 05800000
*      3 SMF88PNM CHAR(8),          /* Product Name - 'SCLOG   '     */ 05810000
*      3 SMF88OSL CHAR(8),          /* MVS Product Level             */ 05820000
*      3 SMF88SYN CHAR(8),          /* Current System Name (from        05830000
*                                      SYSNAME PARMLIB option)       */ 05840000
*                                                                       05850000
*/********************************************************************/ 05860000
*/*   LOG STREAM SECTION                                         @L5C*/ 05870000
*/********************************************************************/ 05880000
*                                                                       05890000
*    1 SMF88LSD BASED(ADDR(SMFRCD88)+SMF88LOF),  /* Section             05900000
*                                      describing a Log Stream.      */ 05910000
*      3 SMF88LIT CHAR(8),          /* SMF-counter Instance             05920000
*                                      Token.                        */ 05930000
*      3 SMF88LSN CHAR(26),         /* Log Stream Name               */ 05940000
*      3 SMF88LFL CHAR(2),          /* Log Stream Flags.             */ 05950000
*        5 SMF88LFD BIT(1),         /* Valid only when SMF88LFT is on.  05960000
*                                      When ON, DRXRC-type staging      05970000
*                                      data set used during the         05980000
*                                      expiring SMF interval.      @L8A 05990000
*                                      This flag will no longer         05991000
*                                      be set on as of release          05992000
*                                      HBB77B0 (z/OS v2r3).      @LAA*/ 05994000
*        5 SMF88LFT BIT(1),         /* If set, this logstream used      06000000
*                                      staging datasets during the      06010000
*                                      expiring SMF interval.    @5LA*/ 06020000
*        5 SMF88LDS BIT(1),         /* When ON, the SMF record has      06030000
*                                      been generated as a result of    06040000
*                                      the log stream disconnecting     06050000
*                                      from the system.          @P1A*/ 06060000
*        5 SMF88LZA BIT(1),         /* When ON, the log stream has      06071600
*                                      ZAI(YES) specified to send log   06072300
*                                      data to the IBM zAware           06073000
*                                      server                    @07A*/ 06073700
*        5 *        BIT(12),        /* Reserved.                 @07C*/ 06074900
*      3 SMF88LTD CHAR(8),          /* TOD-time when SMF global         06080000
*                                      interval expired (from parameter 06090000
*                                      list of ENF event 37 which       06100000
*                                      requested this SMF-record from   06110000
*                                      Logger).      */                 06120000
*      3 SMF88LWI FIXED(32),        /* IXGWRITE invocations for this    06130000
*                                      Log Stream issued during the     06140000
*                                      expiring SMF interval.    @L1C*/ 06150000
*      3 SMF88LIB FIXED(32),        /* Minimum BLOCKLEN value of        06160000
*                                      IXGWRITE seen during the         06170000
*                                      expiring SMF interval.           06180000
*                                      Initialized to X'7FFFFFFF' if    06190000
*                                      no SMF activity occurs within    06200000
*                                      the SMF interval.         @L3A*/ 06210000
*      3 SMF88LAB FIXED(32),        /* Maximum BLOCKLEN value of        06220000
*                                      IXGWRITE seen by this Log Stream 06230000
*                                      during the expiring SMF interval 06240000
*                                      Initialized to zero if no SMF    06250000
*                                      activity occurs within the SMF   06260000
*                                      interval.                 @L3A*/ 06270000
*      3 SMF88LWB CHAR(8),         /* Bytes REQUESTED by user           06280000
*                                     application(s) on ?IXGWRITE       06290000
*                                     invocations for this log stream   06300000
*                                     during the expiring SMF interval  06310000
*                                     (FORMAT=LONG FLOATING POINT).     06320000
*                                     See Notes.                 @L3C*/ 06330000
*                                                                       06340000
*      3 SMF88LDB CHAR(8),         /* Count of bytes written to DASD    06350000
*                                     during the expiring SMF interval  06360000
*                                     (FORMAT=LONG FLOATING POINT).     06370000
*                                                                       06380000
*                                     SMF88LDB = SMF88SAB + storage-for 06390000
*                                     -LOGGR-internal-requirements (ex, 06400000
*                                     rounding, internally-required     06410000
*                                     control information.)             06420000
*                                     See Notes.                 @L5C*/ 06430000
*                                                                       06440000
*                                                                       06450000
*      3 SMF88LIO FIXED(32),       /* Number of times a request was     06460000
*                                     made by System Logger to write    06470000
*                                     log stream data to DASD during    06480000
*                                     the expiring SMF interval  @04A*/ 06490000
*                                                                       06500000
*      3 SMF88LIS FIXED(32),       /* Number of times System Logger had 06510000
*                                     to suspend before writing log     06520000
*                                     stream data to DASD because a     06530000
*                                     previously initiated write to     06540000
*                                     DASD had not yet completed during 06550000
*                                     the expiring SMF interval  @04A*/ 06560000
*      3 SMF88GRP Char(8),         /* GROUP Value for this logstream    06560100
*                                     (Either PROD or TEST) padded with 06561000
*                                     Blanks.                    @L9A*/ 06562000
*                                                                       06570000
*/********************************************************************/ 06580000
*/*   EVENTS SECTION                                             @L5C*/ 06590000
*/********************************************************************/ 06600000
*                                                                       06610000
*    1 SMF88ESD BASED(ADDR(SMFRCD88)+SMF88EOF),  /* Section             06620000
*                                      describing Events             */ 06630000
*      3 SMF88EDS FIXED(32),   /* Number of Log Stream DASD-shifts      06640000
*                                      initiated by this system during  06650000
*                                      the expiring SMF interval @L1C*/ 06660000
*                                                                       06670000
*      3 SMF88ERI FIXED(32),   /* Number of 'Structure Rebuild'         06680000
*                                      events +initiated+ for this      06690000
*                                      log stream during the expiring   06700000
*                                      SMF interval.             @L3C*/ 06710000
*                                                                       06720000
*      3 SMF88ERC FIXED(32),   /* Number of 'Structure Rebuild'         06730000
*                                      events =completed= for this      06740000
*                                      log stream during the expiring   06750000
*                                      SMF interval.             @L3C*/ 06760000
*                                                                       06770000
*      3 SMF88ESF FIXED(32),   /* Number of times Logger detected       06780000
*                                 'Structure full' condition for this   06790000
*                                  logstream on this system during the  06800000
*                                  expiring SMF interval.        @06C*/ 06810000
*                                                                       06820000
*      3 SMF88ETT FIXED(32),   /* Number of times IXGLOGR detected      06830000
*                                'Staging-Dataset-Threshold-Hit'        06840000
*                                 condition for this logstream on       06850000
*                                 this system during the expiring       06860000
*                                 SMF interval.                  @L5A*/ 06870000
*                                                                       06880000
*      3 SMF88ETF FIXED(32),   /* Number of times IXGLOGR detected      06890000
*                                'Staging-Dataset-FULL' condition for   06900000
*                                 this logstream on this system during  06910000
*                                 the expiring SMF interval.     @P1C*/ 06920000
*                                                                       06930000
*      3 SMF88EO  FIXED(32),   /* Number of times IXGLOGR performed     06940000
*                                 successful offload (>1 byte of data)  06950000
*                                 for this logstream on this system     06960000
*                                 during the expiring interval   @01A*/ 06970000
*      3 SMF88EFS FIXED(32),   /* Number of times IXGLOGR performed     06980000
*                                 an offload for all the log streams    06990000
*                                 connected on this system to the       07000000
*                                 structure due to the structure's      07010000
*                                 total in-use list entries reaching    07020000
*                                 90% of the total available entries    07030000
*                                 for the structure. This count is      07040000
*                                 the number of occurances of this      07050000
*                                 condition for the                     07060000
*                                 expiring interval.             @01A*/ 07070000
*      3 SMF88EDO FIXED(32),   /* Number of times a demand initiated    07080000
*                                 offload was requested (via IXGOFFLD)  07090000
*                                 for this logstream on this system     07100000
*                                 during the expiring interval   @L7A*/ 07110000
*                                                                       07120000
*      3 SMF88EAF FIXED(32),   /* Number of times IXGLOGR detected      07130000
*                                'Staging-Dataset-Async-Buffer_Full'    07140000
*                                 condition for this logstream on       07150000
*                                 this system during the expiring       07160000
*                                 SMF interval.                  @P3A   07170000
*                                 This field will no longer             07171000
*                                 be filled in as of                    07172000
*                                 release HBB77B0 (z/OS v2r3).   @LAA*/ 07174000
*                                                                       07180000
*      3 *        CHAR(16),         /* Reserved                  @P3A*/ 07190000
*                                                                       07200000
*/********************************************************************/ 07210000
*/*   STRUCTURE (Interim Storage) Section.  See notes            @03C*/ 07220000
*/********************************************************************/ 07230000
*                                                                       07240000
*    1 SMF88SSD BASED(ADDR(SMFRCD88)+SMF88SOF),  /* Section             07250000
*                                      describing a Structure        */ 07260000
*      3 SMF88STN CHAR(16),        /* Structure Name of structure       07270000
*                                      used for this Log Stream.     */ 07280000
*      3 SMF88SWB CHAR(8),         /* Current WRITTEN-Bytes-Structure.  07290000
*                                     Count of bytes written to interim 07300000
*                                     storage for this logstream        07310000
*                                     for this interval.   See Notes.   07320000
*                                     (format=LONG FLOATING POINT).     07330000
*                                                                @03C*/ 07340000
*      3 SMF88SIB CHAR(8),         /* Current INSTEAD-Bytes count.      07350000
*                                     Count of bytes deleted from       07360000
*                                     interim storage during this       07370000
*                                     interval INSTEAD OF being moved   07380000
*                                     to DASD.  (format = LONG FLOATING 07390000
*                                     POINT).  This field is only       07400000
*                                     incremented due to user ?IXGDELET 07410000
*                                     invocations when the data had not 07420000
*                                     yet been migrated from interim    07430000
*                                     storage to DASD.                  07440000
*                                     See notes.                 @03C*/ 07450000
*                                                                       07460000
*      3 SMF88SAB CHAR(8),         /* Current AFTER-Bytes count.        07470000
*                                     Count of bytes deleted from       07480000
*                                  interim storage during this interval 07490000
*                                     AFTER being moved to DASD         07500000
*                                     (format = LONG FLOATING POINT).   07510000
*                                     This field is only incremented    07520000
*                                     due to LOGGR internal management  07530000
*                                     of interim storage.  See Notes.   07540000
*                                                                @03C*/ 07550000
*      3 *        CHAR(4),          /* Reserved                  @L2C*/ 07560000
*      3 SMF88SII FIXED(32),        /* Current INSTEAD-Invoc count.     07570000
*                                      Count of times a deletion from   07580000
*                                      interim storage was performed    07590000
*                                      during this interval, where the  07600000
*                                      data was NOT first migrated to   07610000
*                                      DASD.  See notes.         @03C*/ 07620000
*      3 SMF88SAI FIXED(32),        /* Current AFTER-Invoc count.       07630000
*                                      Count of times a deletion from   07640000
*                                      interim storage was performed    07650000
*                                      during this interval, AFTER      07660000
*                                      being migrated to DASD (occurs   07670000
*                                      due to LOGGR management of       07680000
*                                   interim storage.) See notes. @03C*/ 07690000
*      3 SMF88SC1 FIXED(32),        /* Count of type-1 completions      07700000
*                                      during the expired SMF interval. 07710000
*                                      Log stream contents can remain   07720000
*                                      in interim storage.  No need to  07730000
*                                      move data from interim storage   07740000
*                                      to DASD.  See Notes.      @03C*/ 07750000
*      3 SMF88SC2 FIXED(32),        /* Count of type-2 completions      07760000
*                                      during the expired SMF interval. 07770000
*                                      Log stream is filling interim    07780000
*                                      storage but space is             07790000
*                                      not critical.  Logger must       07800000
*                                      move data from interim storage   07810000
*                                      to DASD.  See notes.      @L1C*/ 07820000
*      3 SMF88SC3 FIXED(32),        /* Count of type-3 completions      07830000
*                                      during the expired SMF interval. 07840000
*                                      Space used in interim storage    07850000
*                                      (by this log stream) is          07860000
*                                      critical but does not exceed     07870000
*                                      100 percent.  See notes.         07880000
*                                      Undefined for DASDONLY           07890000
*                                      Logstreams.               @06C*/ 07900000
*      3 *        CHAR(4),          /* Reserved                  @L1C*/ 07910000
*/********************************************************************/ 07920000
*/*   STRUCTURE Alter SECTION - These are measurements that are      */ 07930000
*/*   reset each time a check is made to alter the structure     @L6A*/ 07940000
*/********************************************************************/ 07950000
*                                                                       07960000
*    1 SMF88ASD BASED(ADDR(SMFRCD88)+SMF88AOF),  /* Section describing  07970000
*                                      Structure Alter info      @L6A*/ 07980000
*      3 SMF88ANM CHAR(16),        /* Structure Name                    07990000
*                                                                @L6A*/ 08000000
*      3 SMF88ATK CHAR(8),         /* Alter Token which is a STCK       08010000
*                                     timestamp, associated with the    08020000
*                                     last time the element to entry    08030000
*                                     ratio was altered to accomadate   08040000
*                                     the average buffer size being     08050000
*                                     written to the structure          08060000
*                                                                @L6A*/ 08070000
*      3 SMF88AIT CHAR(8),          /* SMF-counter Instance             08080000
*                                      Token.                    @L6A*/ 08090000
*      3 SMF88AWB CHAR(8),         /* Current WRITTEN-Bytes-Structure.  08100000
*                                     Count of bytes written to the     08110000
*                                     structure on this system,         08120000
*                                     associated with this Alter token  08130000
*                                     for this interval.   See Notes.   08140000
*                                     (format=LONG FLOATING POINT).     08150000
*                                                                @L6A*/ 08160000
*      3 SMF88AO  FIXED(32),       /* The number of offloads that       08170000
*                                     occured on this system associated 08180000
*                                     with this Alter token, for this   08190000
*                                     interval.                  @L6A*/ 08200000
*      3 SMF88ACB FIXED(32),        /* Current allocated average        08210000
*                                      buffer size for the              08220000
*                                      structure.                @L6A*/ 08230000
*      3 SMF88ATB FIXED(32),        /* Targeted average buffer size,    08240000
*                                      average buffer size System       08250000
*                                      Logger attempted to achieve, by  08260000
*                                      altering the element to entry    08270000
*                                      ratio.                           08280000
*                                                                @L6A*/ 08290000
*      3 SMF88ASZ FIXED(32),        /* Structure Size. Represented      08300000
*                                      in the number of 4K blocks.      08310000
*                                                                @L6A*/ 08320000
*      3 SMF88ATW FIXED(32),        /* Total number of log data         08330000
*                                      writes to the structure          08340000
*                                      during the recording             08350000
*                                      interval.                 @P1A*/ 08360000
*      3 SMF88ALS FIXED(32),        /* Total number of log streams      08370000
*                                      connected to the structure       08380000
*                                      on this system at the time of    08390000
*                                      the recording interval.   @P1A*/ 08400000
*      3 SMF88AFG Bit(8),           /* Flags                     @P2A*/ 08410000
*        5 SMF88ABC Bit(1),         /* Record was generated to report   08420000
*                                      a change in the average buffer   08430000
*                                      size being written to the        08440000
*                                      structure                 @P2A*/ 08450000
*        5 SMF88ADC Bit(1),         /* Record was generated due to      08460000
*                                      the last logstream disconnecting 08470000
*                                      which resulted in the structure  08480000
*                                      Being disconnect          @P2A*/ 08490000
*        5  *    Bit(6);            /* Reserved                  @P2A*/ 08500000
*                                                                       08510000
*/********************************************************************/ 08520000
*/*   IXGSMF88 - CONSTANTS                                           */ 08530000
*/********************************************************************/ 08540000
*                                                                       08550000
*DCL SMF88_SMF_record_type FIXED(8) constant(88); /* Value of SMF88RTY  08560000
*    record-type 88 (decimal)                                        */ 08570000
*                                                                       08580000
*DCL SMF88_SMF_record_subtype FIXED(8) constant(1);  /* Subtype      */ 08590000
*                                                                       08600000
*DCL SMF88_SSMF_record_subtype FIXED(8) constant(11);  /* Subtype       08610000
*                                                 for structure alter   08620000
*                                                 information   @L6A */ 08630000
*                                                                       08640000
*DCL SMF88_SMF_Record_Version Char(2) Constant('04'); /* Value of       08650000
*    SMF88RVN = Version of SMFRCD88                              @L9C*/ 08660000
*                                                                       08670000
*DCL SMF88_blocklen_high BIT(32) CONSTANT('7FFFFFFF'X); /*This constant 08680000
*    is LARGER than the largest possible valid blocklen.   SMF88 field  08690000
*    SMF88LIB (minimum blocklen seen) is initialized to this high,      08700000
*    invalid value if no SMF activity occurs within an SMF interval. */ 08710000
*                                                                       08720000
*DCL SMF88_blocklen_zero FIXED(31) CONSTANT(0); /* This constant is     08730000
*    SMALLER than the smallest possible valid blocklen.   SMF88 field   08740000
*    SMF88LAB (maximum blocklen seen) is initialized to this low,       08750000
*    invalid value if no SMF activity occurs within an SMF interval. */ 08760000
*                                                                       08770000
*/* End of PL/X Source                                               */ 08780000
* %IF IXGSMF88_LIST ^= 'NO' &                                           08790000
*    ZCBPRINT ^= 'NO' %THEN                                             08800000
*   %GOTO IXGSMF88_4;                                                   08810000
*   @LIST POP NOECHO;                                                   08820000
* %IXGSMF88_4:;                                                         08830000
* %END;                                                                 08840000
