*                                                                       00001000
* %DCL IXLYCOMP_INCLUDED CHAR EXT;                                      00002000
* %DEACTIVATE IXLYCOMP_INCLUDED;                                        00003000
* %IF IXLYCOMP_INCLUDED = '' %THEN                                      00004000
* %DO;                                                                  00005000
*/* Macro made bi-lingual on 18014. CBGEN compile date 15295         */ 00006000
*% /*                                                                   00007000
         MACRO                                                          00008000
         IXLYCOMP &DSECT=YES,&LIST=YES,&TITLE=YES,&COMPDATANAME=YES,   *00009000
               &COMPINDEX=COND,&COMPSTRTRL=COND,&COMPSTRHDR=COND,      *00010000
               &COMPSTROBJMAPINDEX=COND,&COMPSTROBJMAP=COND,           *00011000
               &COMPHASHTABLEHDR=COND,&COMPHASHSLOTARRAY=COND,         *00012000
               &COMPHASHELEM=COND,&COMPENTRYCNTL=COND                   00013000
         GBLC  &IXLYCOMP_INCLUDED                                       00014000
         GBLC  &ZCBPRINT                                                00015000
&IXLYCOMP_INCLUDED SETC 'YES'                                           00016000
         AIF   ('&LIST' EQ 'NONE').P0                                   00017000
         AIF   ('&TITLE' EQ 'NO').P5                                    00018000
 TITLE   'IXLYCOMP  - CF Dumping Compdata Record Format Mappings     '  00019000
.P5      ANOP                                                           00020000
**/ IXLYCOMP_1:;                                                        00021000
*/* START OF SPECIFICATIONS ******************************************* 00022000
*                                                                       00023000
*****PROPRIETARY_STATEMENT********************************************* 00024000
*                                                                       00025000
*01* PROPRIETARY STATEMENT=                                             00026000
*                                                                       00027000
*    LICENSED MATERIALS - PROPERTY OF IBM                               00028000
*    5650-ZOS COPYRIGHT IBM CORP. 1993, 2017                            00029000
*                                                                       00030000
*01* STATUS:  HBB77B0                                                   00031000
*                                                                       00032000
*01* END OF PROPRIETARY STATEMENT                                       00033000
*                                                                       00034000
*01* EXTERNAL CLASSIFICATION: GUPI                                      00035000
*01* END OF EXTERNAL CLASSIFICATION:                                    00036000
*                                                                       00037000
*01* DESCRIPTIVE NAME:  CF Dumping Compdata Record Format Mappings      00038000
*                                                                       00039000
*02*  ACRONYM:  N/A                                                     00040000
*                                                                       00041000
*01* MACRO NAME:  IXLYCOMP                                              00042000
*                                                                       00043000
*01* DSECT NAME:                                                        00044000
*     CompdataName                                                      00045000
*     CompIndex                                                         00046000
*     CompStrTrl                                                        00047000
*     CompStrHdr                                                        00048000
*     CompStrObjMapIndex                                                00049000
*     CompStrObjMap                                                     00050000
*     CompHashTableHdr                                                  00051000
*     CompHashTable                                                     00052000
*     CompHashElem                                                      00053000
*     CompEntryCntl                                                     00054000
*                                                                       00055000
*01* COMPONENT: Cross System Extended Services (SCIXL)                  00056000
*                                                                       00057000
*01* EYE-CATCHER:  None                                                 00058000
*02*  OFFSET:  N/A                                                      00059000
*02*  LENGTH:  N/A                                                      00060000
*                                                                       00061000
*01* STORAGE ATTRIBUTES:                                                00062000
*02*  SUBPOOL:  User Defined                                            00063000
*02*  KEY:  User Defined                                                00064000
*02*  RESIDENCY:  User Defined                                          00065000
*                                                                       00066000
*01* SIZE:                                                              00067000
*                COMPDATANAME       -- X'0008' bytes                    00068000
*                COMPINDEX          -- X'0100' bytes                    00069000
*                COMPSTRTRL         -- X'1000' bytes                    00070000
*                COMPSTRHDR         -- X'0008' bytes                    00071000
*                COMPSTROBJMAPINDEX -- X'005C' bytes                    00072000
*                COMPSTROBJMAP      -- X'0018' bytes                    00073000
*                COMPHASHTABLEHDR   -- X'0008' bytes                    00074000
*                COMPHASHSLOTARRAY  -- X'0004' bytes                    00075000
*                COMPHASHELEM       -- X'0018' bytes                    00076000
*                COMPENTRYCNTL      -- X'0018' bytes                    00077000
*                                                                       00078000
*01* CREATED BY: User                                                   00079000
*                                                                       00080000
*01* POINTED TO BY: User                                                00081000
*                                                                       00082000
*01* SERIALIZATION: None Required                                       00083000
*                                                                       00084000
*01* FUNCTION:                                                          00085000
*                                                                       00086000
*    This macro is used to map the dump of CF structure data written    00087000
*    to and accessed from the dump dataset.  The dump dataset is        00088000
*    organized into several compdata spaces.  Each compdata space       00089000
*    contains a specific type of data.                                  00090000
*                                                                       00091000
*    NOTE: All of the records in the compdata spaces start at address   00092000
*          hex 1000.  The first page of all compdata spaces are not     00093000
*          used                                                         00094000
*                                                                       00095000
*    NOTE: To interpret the dump reason code, include the IXLYSTRC      00096000
*          mapping in your program.                                     00097000
*                                                                       00098000
*01* METHOD OF ACCESS:                                                  00099000
*     ASM: IXLYCOMP                                                     00100000
*                                                                       00101000
*  NOTE]]] Invokers of Assembler Version of IXLYCOMP macro are          00102000
*          REQUIRED to declare the constant COMPDATATYPEINDEX           00103000
*          on their own.                                                00104000
*                                                                       00105000
*     PL/AS:                                                            00106000
*         %DCL COMPDATA_NAME_ATTR          CHAR                         00107000
*         %DCL COMPDATA_INDEX_ATTR         CHAR                         00108000
*         %DCL COMPDATA_STRTRL_ATTR        CHAR                         00109000
*         %DCL COMPDATA_STR_ATTR           CHAR                         00110000
*         %DCL COMPDATA_STROBJMAPINDX_ATTR CHAR                         00111000
*         %DCL COMPDATA_STROBJMAP_ATTR     CHAR                         00112000
*         %DCL COMPDATA_HASHTABLEHDR_ATTR  CHAR                         00113000
*         %DCL COMPDATA_HASHSLOT_ATTR      CHAR                         00114000
*         %DCL COMPDATA_HASHELEM_ATTR      CHAR                         00115000
*         %DCL COMPDATA_ENTRYCNTL_ATTR     CHAR                         00116000
*         %COMPDATA_NAME_ATTR          = 'based/defined/via attributes' 00117000
*         %COMPDATA_INDEX_ATTR         = 'based/defined/via attributes' 00118000
*         %COMPDATA_STRTRL_ATTR        = 'based/defined/via attributes' 00119000
*         %COMPDATA_STR_ATTR           = 'based/defined/via attributes' 00120000
*         %COMPDATA_STROBJMAPINDX_ATTR = 'based/defined/via attributes' 00121000
*         %COMPDATA_STROBJMAP_ATTR     = 'based/defined/via attributes' 00122000
*         %COMPDATA_HASHTABLEHDR_ATTR  = 'based/defined/via attributes' 00123000
*         %COMPDATA_HASHSLOT_ATTR      = 'based/defined/via attributes' 00124000
*         %COMPDATA_HASHELEM_ATTR      = 'based/defined/via attributes' 00125000
*         %COMPDATA_ENTRYCNTL_ATTR     = 'based/defined/via attributes' 00126000
*         %INCLUDE SYSLIB(IXLYCOMP)                                     00127000
*                                                                       00128000
*  Where:                                                               00129000
*                                                                       00130000
*    COMPDATA_NAME_ATTR is associated with the CompdataName mapping     00131000
*    COMPDATA_INDEX_ATTR is associated with the CompIndex mapping       00132000
*    COMPDATA_STRTRL_ATTR is associated with the CompStrTrl mapping     00133000
*    COMPDATA_STR_ATTR is associated with the CompStrHdr mapping        00134000
*    COMPDATA_STROBJMAPINDX_ATTR is associated with the                 00135000
*                             CompStrObjMapIndex mapping                00136000
*    COMPDATA_STROBJMAP_ATTR is associated with the CompStrObjMap       00137000
*                            mapping                                    00138000
*    COMPDATA_HASHTABLEHDR_ATTR is associated with the CompHashTableHdr 00139000
*                            mapping                                    00140000
*    COMPDATA_HASHSLOT_ATTR is associated with the CompHashSlotArray    00141000
*                            mapping                                    00142000
*    COMPDATA_HASHELEM_ATTR is associated with the CompHashElem mapping 00143000
*    COMPDATA_ENTRYCNTL_ATTR is associated with the CompEntryCntl       00144000
*                            mapping                                    00145000
*                                                                       00146000
*     If any of the above variables is not set,                         00147000
*     the associated mapping will declared as BASED.                    00148000
*                                                                       00149000
*                                                                       00150000
*01* DELETED BY: User                                                   00151000
*                                                                       00152000
*01* FREQUENCY:                                                         00153000
*     N/A                                                               00154000
*                                                                       00155000
*01* DEPENDENCIES:  None                                                00156000
*                                                                       00157000
*01* DISTRIBUTION LIBRARY:  AMACLIB                                     00158000
*                                                                       00159000
*01* CHANGE ACTIVITY:                                                   00160000
*     $L0=SYSLKDFM HBB5510 920812 PD00LA: XLS Initial Release           00161000
*     $D1=DIG0032  HBB5510 921105 PD00LA: Externalize Dumping Mappings  00162000
*     $D2=DIG0044  HBB5510 930520 PD00LA: Structure Dump ID support     00163000
*     $D3=DIG0076  HBB5510 930520 PD00LA: Rebuild Support               00164000
*     $D4=DIG0108  HBB5510 930715 PD00LA: CF name change                00165000
*     $L1=DMPMG    HBB5510 930715 PD00LA: Add Incident token to the     00166000
*                                         master index                  00167000
*     $P1=PIG3552  HBB5510 931110 PD00NT: Length constants moved        00168000
*     $P2=PIG5495  HBB5510 940722 PD00EA: Add CFLEVEL                   00169000
*     $01=OW24532  HBB5520 960701 PDHT:   Event monitoring controls     00170000
*                                         and event queues support @01A 00171000
*     $P3=PRR0045  HBB5520 970626 PDHT:   Nat'l char compliant var @P3A 00172000
*     $02=OW28460  HBB6603 970801 PDXM: User managed duplexing          00173000
*     $L2=AUTOR    HBB6608 980831 PD00GW: System managed rebuild        00174000
*     $L3=CFFLASH  HBB7790 120629 PD00C9: Cf Flash                      00175000
*     $L4=CFCRYPT  HBB77B0 160311 PD00C9: CF Data Encryption            00176000
*     $04=OA53022  HBB77B0 170803 PD00OF: CompEntryCntlAdjSKey          00177000
*                                                                       00178000
* END OF SPECIFICATIONS *********************************************/  00179000
*% /*                                                                   00180000
.P0      ANOP                                                           00181000
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 00182000
         AIF   ('&LIST' EQ 'YES').P2                                    00183000
.P1      ANOP                                                           00184000
         PUSH  PRINT                                                    00185000
         PRINT OFF                                                      00186000
.P2      ANOP                                                           00187000
         AIF   ('&COMPDATANAME' EQ 'NO').L0002                          00188000
         AIF   ('&DSECT' EQ 'YES').L0003                                00189000
         AIF   ('&COMPDATANAME' NE 'YES').L0002                         00190000
.L0003   ANOP                                                           00191000
*                                                                       00192000
* ********************************************************************  00193000
* *                                                                  *  00194000
* *     Format of the COMPDATA names                                 *  00195000
* *                                                                  *  00196000
* *  ]]]] NOTE ]]]]  The CompdataNameStrNum component of the         *  00197000
* *  compdata name is dependent on the position of the structure     *  00198000
* *  within the master index.  The number of the first               *  00199000
* *  structure is 1 and therefore the compdata names for that        *  00200000
* *  structure will be CFDxx01z.  The same follows for all the       *  00201000
* *  structures within the master index.                             *  00202000
* *                                                                  *  00203000
* *  The CompdataSpaceNumber portion of the name must begin at 00.   *  00204000
* *  If another compdata space of that type is necessary, the        *  00205000
* *  number will be 01, etc.                                         *  00206000
* *                                                                  *  00207000
* ********************************************************************  00208000
*                                                                       00209000
*                                                                       00210000
         AIF   ('&DSECT' EQ 'YES').L0004                                00211000
COMPDATANAME DS 0X                                                      00212000
         AGO   .L0005                                                   00213000
.L0004   ANOP                                                           00214000
COMPDATANAME DSECT                                                      00215000
.L0005   ANOP                                                           00216000
COMPDATANAMECOMPONENT DS CL3 Indicates the component prefix             00217000
COMPDATASPACENUMBER DS CL2 Nth compdata space of a specific type. The  *00218000
                         first compdata space should be numbered 00.    00219000
COMPDATANAMESTRNUM DS CL2 Nth structure dumped                          00220000
COMPDATANAMETYPE DS CL1  Type of compdata record                        00221000
KCOMPDATANAME_LEN EQU 8  Length of CompDataName                         00222000
*                                                                       00223000
* ********************************************************************  00224000
* *                                                                  *  00225000
* * Constants defined for use in the Compdata name                   *  00226000
* *                                                                  *  00227000
* ********************************************************************  00228000
*                                                                       00229000
*                                                                       00230000
COMPDATACOMPONENT EQU C'CFD' Used to fill in the component section of  *00231000
                         the compdata name                              00232000
COMPDATATYPESTR EQU C'S' Structure type compdata                        00233000
COMPDATATYPEINDEX_0TO3 EQU C'CFD0' This is the first 4-byte segment of *00234000
                         an 8-byte constant. Name of the master index  *00235000
                         in the dump                                    00236000
COMPDATATYPEINDEX_4TO7 EQU C'000I' This is the second 4-byte segment   *00237000
                         of an 8-byte constant. Name of the master     *00238000
                         index in the dump                              00239000
COMPDATATYPEOBJ EQU C'O' Object header type compdata                    00240000
COMPDATATYPEHASH EQU C'H' Hash table type compdata                      00241000
COMPDATATYPEENTRYCNTL EQU C'C' Entry control information type compdata  00242000
COMPDATATYPEENTRYDATA EQU C'D' Entry data type compdata                 00243000
COMPDATATYPEADJ EQU C'A' Adjunct data type compdata                     00244000
COMPDATATYPELOCK EQU C'L' Lock table type compdata                      00245000
COMPDATATYPEUSER EQU C'U' User control type compdata                    00246000
COMPDATATYPEEMC EQU C'E' Event monitor control type compdata            00247000
COMPDATATYPEEVENTQ EQU C'Q' Event queue control type compdata           00248000
COMPDATANAME_LEN EQU *-COMPDATANAME                                     00249000
.L0002   ANOP                                                           00250000
         AIF   ('&COMPINDEX' EQ 'NO').L0006                             00251000
         AIF   ('&DSECT' EQ 'YES').L0007                                00252000
         AIF   ('&COMPINDEX' NE 'YES').L0006                            00253000
.L0007   ANOP                                                           00254000
*                                                                       00255000
* ********************************************************************  00256000
* *                                                                  *  00257000
* *     Format of the master index compdata space - CFD0000I         *  00258000
* *                                                                  *  00259000
* *  NOTE: The CompIndex records in the master index compdata space  *  00260000
* *        must fit evenly into a 4K record.                         *  00261000
* *                                                                  *  00262000
* ********************************************************************  00263000
*                                                                       00264000
*                                                                       00265000
         AIF   ('&DSECT' EQ 'YES').L0008                                00266000
COMPINDEX DS   0F        There will be one CompIndex type entry in the *00267000
                         master index compdata space for every         *00268000
                         structure in the dump                          00269000
         AGO   .L0009                                                   00270000
.L0008   ANOP                                                           00271000
COMPINDEX DSECT          There will be one CompIndex type entry in the *00272000
                         master index compdata space for every         *00273000
                         structure in the dump                          00274000
.L0009   ANOP                                                           00275000
COMPINDEXSTRNAME DS CL16 Name of the structure                          00276000
COMPINDEXSTRDUMPID DS H  Structure Dump ID                              00277000
         DS    CL2       Reserved                                       00278000
COMPINDEXCONNAME DS CL16 Conname used in requesting the dump            00279000
COMPINDEXSTRTYPE DS X    Structure type                                 00280000
COMPINDEXUIDL DS X       User identifier limit (UIDL) used to          *00281000
                         determine the size of the list number         *00282000
                         controls for a list structure. This field     *00283000
                         will be 0 for a cache structure                00284000
COMPINDEXSTR#EBCDIC DS 0CL2 Structure number in EBCDIC                  00285000
COMPINDEXSTRNUMEBCDIC DS CL2 Structure number in EBCDIC                 00286000
COMPINDEXHDWND DS CL32   Node element descriptor                        00287000
COMPINDEXLOCKTBLENTLEN DS F Length of the lock table entries           *00288000
                         associated with this structure                 00289000
COMPINDEXSTRTRLPTR DS A  Pointer to the structure trailer associated   *00290000
                         with this structure                            00291000
COMPINDEXNODUMPRSN DS F  Reason why the structure was not dumped - the *00292000
                         no dump reason codes are defined in the       *00293000
                         IXLYSTRC mapping                               00294000
COMPINDEXFLAGS DS 0B     Master index flags                             00295000
COMPINDEXLASTSTR EQU X'80' Indicates that this is the last entry in    *00296000
                         the master index                               00297000
COMPINDEXCONNOTFOUND EQU X'40' Indicates that the conname or contoken  *00298000
                         specified for a cache structure was not found *00299000
                         in the policy                                  00300000
COMPINDEXSTRINREBLD EQU X'20' Indicates that the the structure is in   *00301000
                         the process of rebuild                         00302000
COMPINDEXREBLDOLDSTR EQU X'10' Indicates that the structure            *00303000
                         information pertains to the OLD structure     *00304000
                         NOTE: Bit is only valid if the                *00305000
                         CompIndexStrInRebld bit is set                 00306000
COMPINDEXREBLDNEWSTR EQU X'08' Indicates that the structure            *00307000
                         information pertains to the NEW structure     *00308000
                         NOTE: Bit is only valid if the                *00309000
                         CompIndexStrInRebld bit is set                 00310000
COMPINDEXREBLDDUPLEXSTR EQU X'04' ON indicates the structure rebuild   *00311000
                         is a duplexing rebuild. OFF indicates the     *00312000
                         structure rebuild is a normal rebuild. NOTE:  *00313000
                         Bit is only valid if the CompIndexStrInRebld  *00314000
                         bit is set                                     00315000
COMPINDEXREBLDMETHODSTR EQU X'02' ON indicates the structure rebuild   *00316000
                         is system managed. OFF indicates the          *00317000
                         structure rebuild is user managed. NOTE: Bit  *00318000
                         is only valid if the CompIndexStrInRebld bit  *00319000
                         is set                                         00320000
COMPINDEXSTRENCRYPTED EQU X'01' ON indicates that data in this         *00321000
                         structure instance is encrypted                00322000
         ORG   COMPINDEXFLAGS+1                                         00323000
         DS    CL1       Reserved                                       00324000
COMPINDEXCONID DS H      Connection ID                                  00325000
COMPINDEXCFNAME DS CL8   Facility name                                  00326000
COMPINDEXINCIDENTTOKEN DS CL32 Incident Token                           00327000
COMPINDEXCFLEVEL DS F    Coupling facility operational level of the    *00328000
                         facility in which the structure is allocated   00329000
         DS    CL124     Reserved                                       00330000
KCOMPINDEX_LEN EQU 256   Length of CompIndex                            00331000
COMPINDEX_LEN EQU *-COMPINDEX                                           00332000
.L0006   ANOP                                                           00333000
         AIF   ('&COMPSTRTRL' EQ 'NO').L000A                            00334000
         AIF   ('&DSECT' EQ 'YES').L000B                                00335000
         AIF   ('&COMPSTRTRL' NE 'YES').L000A                           00336000
.L000B   ANOP                                                           00337000
*                                                                       00338000
* ********************************************************************  00339000
* *                                                                  *  00340000
* *     Structure Trailer                                            *  00341000
* *                                                                  *  00342000
* *  NOTE: The Structure Trailer is part of the Master Index compdata*  00343000
* *        space                                                     *  00344000
* *                                                                  *  00345000
* ********************************************************************  00346000
*                                                                       00347000
*                                                                       00348000
         AIF   ('&DSECT' EQ 'YES').L000C                                00349000
COMPSTRTRL DS  0F        There will be a structure trailer for each    *00350000
                         structure that is dumped (unless the dump     *00351000
                         dataset fills or an I/O error occurs while    *00352000
                         the structure is being dumped)                 00353000
         AGO   .L000D                                                   00354000
.L000C   ANOP                                                           00355000
COMPSTRTRL DSECT         There will be a structure trailer for each    *00356000
                         structure that is dumped (unless the dump     *00357000
                         dataset fills or an I/O error occurs while    *00358000
                         the structure is being dumped)                 00359000
.L000D   ANOP                                                           00360000
COMPSTRTRLDUMPRSN DS F   Reason for an incomplete dump of the          *00361000
                         structure - the dump reason codes are defined *00362000
                         in the IXLYSTRC mapping                        00363000
COMPSTRTRLOBJIDINCOMPLETE DS F Object identifier of object that is     *00364000
                         incomplete                                     00365000
COMPSTRTRLDOTINCOMPLETE DS H Dumping object type of object that is     *00366000
                         incomplete                                     00367000
COMPSTRTRLFLAGS DS 0B    Structure trailer flags                        00368000
COMPSTRTRLLOCKDUMPED EQU X'80' Indicates that some lock table entries  *00369000
                         were dumped for this structure                 00370000
COMPSTRTRLUSERDUMPED EQU X'40' Indicates that some user controls were  *00371000
                         dumped for this structure                      00372000
         ORG   COMPSTRTRLFLAGS+1                                        00373000
         DS    CL21      Reserved                                       00374000
KCOMPSTRTRL_LEN EQU 4096 Length of CompStrTrl                           00375000
         ORG   COMPSTRTRL+4096                                          00376000
COMPSTRTRL_LEN EQU *-COMPSTRTRL                                         00377000
.L000A   ANOP                                                           00378000
         AIF   ('&COMPSTRHDR' EQ 'NO').L000E                            00379000
         AIF   ('&DSECT' EQ 'YES').L000F                                00380000
         AIF   ('&COMPSTRHDR' NE 'YES').L000E                           00381000
.L000F   ANOP                                                           00382000
*                                                                       00383000
* ********************************************************************  00384000
* *                                                                  *  00385000
* *     Format of the STRUCTURE compdata type - CFDxxyyS             *  00386000
* *                                                                  *  00387000
* * The structure compdata space consists of up to four items.  The  *  00388000
* * first item that appears is the structure compdata space header   *  00389000
* * (CompStrHdr).  The header consists of pointers to the dump       *  00390000
* * header and the object map index.                                 *  00391000
* *                                                                  *  00392000
* * The dump header consists of structure information.  It is mapped *  00393000
* * by the macro IHADWHDR                                            *  00394000
* *                                                                  *  00395000
* * The object map index (CompStrObjMapIndex) is an index into the   *  00396000
* * object map.  It contains pointers to the first object map entry  *  00397000
* * of each type within that structure compdata space.               *  00398000
* *                                                                  *  00399000
* * The object map (CompStrObjMap) is a directory to the object      *  00400000
* * header in the object compdata space.  Each object has its own    *  00401000
* * entry.  The object map entries are grouped by type and are       *  00402000
* * ordered by the object identifier (CompStrObjMapObjId).           *  00403000
* *                                                                  *  00404000
* ********************************************************************  00405000
* ********************************************************************  00406000
* *                                                                  *  00407000
* *            Structure compdata space header                       *  00408000
* *                                                                  *  00409000
* ********************************************************************  00410000
*                                                                       00411000
*                                                                       00412000
         AIF   ('&DSECT' EQ 'YES').L0010                                00413000
COMPSTRHDR DS  0F        Header for the structure compdata space.      *00414000
                         There will be a header in each structure      *00415000
                         compdata space for a structure                 00416000
         AGO   .L0011                                                   00417000
.L0010   ANOP                                                           00418000
COMPSTRHDR DSECT         Header for the structure compdata space.      *00419000
                         There will be a header in each structure      *00420000
                         compdata space for a structure                 00421000
.L0011   ANOP                                                           00422000
COMPSTRHDRDUMPHDR@ DS 0A Pointer to the dump header for a given        *00423000
                         structure                                      00424000
COMPSTRHDRDUMPHDRPTR DS A Pointer to the dump header for a given       *00425000
                         structure                                      00426000
COMPSTRHDROBJMAPINDEX@ DS 0A Pointer to the object map index within    *00427000
                         the structure compdata space.                  00428000
COMPSTRHDROBJMAPINDEXPTR DS A Pointer to the object map index within   *00429000
                         the structure compdata space.                  00430000
KCOMPSTRHDR_LEN EQU 8    Length of CompStrHdr                           00431000
COMPSTRHDR_LEN EQU *-COMPSTRHDR                                         00432000
.L000E   ANOP                                                           00433000
         AIF   ('&COMPSTROBJMAPINDEX' EQ 'NO').L0012                    00434000
         AIF   ('&DSECT' EQ 'YES').L0013                                00435000
         AIF   ('&COMPSTROBJMAPINDEX' NE 'YES').L0012                   00436000
.L0013   ANOP                                                           00437000
*                                                                       00438000
* ********************************************************************  00439000
* *                                                                  *  00440000
* *            Structure compdata space object map index             *  00441000
* *                                                                  *  00442000
* ********************************************************************  00443000
*                                                                       00444000
*                                                                       00445000
         AIF   ('&DSECT' EQ 'YES').L0014                                00446000
COMPSTROBJMAPINDEX DS 0F Index by object type in the object map.        00447000
         AGO   .L0015                                                   00448000
.L0014   ANOP                                                           00449000
COMPSTROBJMAPINDEX DSECT   Index by object type in the object map.      00450000
.L0015   ANOP                                                           00451000
COMPSTROBJMAPIDXLISTINFO DS 0CL16 Information associated with list     *00452000
                         object map entries                             00453000
COMPSTROBJMAPIDXTYPELIST@ DS 0A Pointer to the beginning of the        *00454000
                         listnum type object map entries within the    *00455000
                         structure compdata space.                      00456000
COMPSTROBJMAPIDXTYPELISTPTR DS A Pointer to the beginning of the       *00457000
                         listnum type object map entries within the    *00458000
                         structure compdata space.                      00459000
COMPSTROBJMAPIDXLISTMINOBJID DS F Minimum object identifier of the     *00460000
                         listnum object map entries                     00461000
COMPSTROBJMAPIDXLISTMAXOBJID DS F Maximum object identifier of the     *00462000
                         listnum object map entries                     00463000
COMPSTROBJMAPIDXTOTALNUMLST DS F Total number of list number object    *00464000
                         map entries in this compdata space             00465000
COMPSTROBJMAPIDXSTGCINFO DS 0CL16 Information associated with the      *00466000
                         storage class object map entries               00467000
COMPSTROBJMAPIDXTYPESTGCLASS@ DS 0A Pointer to the beginning of the    *00468000
                         storage class type object map entries          00469000
COMPSTROBJMAPIDXTYPESTGCLASSPTR DS A Pointer to the beginning of the   *00470000
                         storage class type object map entries          00471000
COMPSTROBJMAPIDXSTGCMINOBJID DS F Minimum object identifier of the     *00472000
                         storage class object map entries               00473000
COMPSTROBJMAPIDXSTGCMAXOBJID DS F Maximum object identifier of the     *00474000
                         storage class object map entries               00475000
COMPSTROBJMAPIDXTOTALNUMSTG DS F Total number of Storage class object  *00476000
                         map entries in this compdata space             00477000
COMPSTROBJMAPIDXCOCINFO DS 0CL16 Information associated with the       *00478000
                         castout class object map entries               00479000
COMPSTROBJMAPIDXTYPECOCLASS@ DS 0A Pointer to the beginning of the     *00480000
                         castout class type object map entries          00481000
COMPSTROBJMAPIDXTYPECOCLASSPTR DS A Pointer to the beginning of the    *00482000
                         castout class type object map entries          00483000
COMPSTROBJMAPIDXCOCMINOBJID DS F Minimum object identifier of the      *00484000
                         castout class object map entries               00485000
COMPSTROBJMAPIDXCOCMAXOBJID DS F Maximum object identifier of the      *00486000
                         castout class object map entries               00487000
COMPSTROBJMAPIDXTOTALNUMCOC DS F Total number of castout class object  *00488000
                         map entries in this compdata space             00489000
COMPSTROBJMAPIDXTYPELOCKTBL@ DS 0A Pointer to the lock table type      *00490000
                         object map entries                             00491000
COMPSTROBJMAPIDXTYPELOCKTBLPTR DS A Pointer to the lock table type     *00492000
                         object map entries                             00493000
COMPSTROBJMAPIDXTYPEUSER@ DS 0A Pointer to the user control type       *00494000
                         object map entries                             00495000
COMPSTROBJMAPIDXTYPEUSERPTR DS A Pointer to the user control type      *00496000
                         object map entries                             00497000
COMPSTROBJMAPIDXEVENTQINFO DS 0CL16 Information associated with event  *00498000
                         queue control object map entries               00499000
COMPSTROBJMAPIDXTYPEEVENTQ@ DS 0A Pointer to the beginning of the      *00500000
                         event queue control type object map entries   *00501000
                         within the structure compdata space.           00502000
COMPSTROBJMAPIDXTYPEEVENTQPTR DS A Pointer to the beginning of the     *00503000
                         event queue control type object map entries   *00504000
                         within the structure compdata space.           00505000
COMPSTROBJMAPIDXEVENTQMINOBJID DS F Minimum object identifier of the   *00506000
                         event queue control object map entries         00507000
COMPSTROBJMAPIDXEVENTQMAXOBJID DS F Maximum object identifier of the   *00508000
                         event queue control object map entries         00509000
COMPSTROBJMAPIDXTOTALNUMEVENTQ DS F Total number of event queue        *00510000
                         control object map entries in this compdata   *00511000
                         space                                          00512000
COMPSTROBJMAPIDXEMCINFO DS 0CL20 Information associated with event     *00513000
                         monitor control object map entries             00514000
COMPSTROBJMAPIDXTYPEEMC@ DS 0A Pointer to the beginning of the event   *00515000
                         monitor control type object map entries       *00516000
                         within the structure compdata space.           00517000
COMPSTROBJMAPIDXTYPEEMCPTR DS A Pointer to the beginning of the event  *00518000
                         monitor control type object map entries       *00519000
                         within the structure compdata space.           00520000
COMPSTROBJMAPIDXTYPEEMCNUM DS CL2 Compdata space number of the pointer *00521000
                         to the beginning of the event monitor control *00522000
                         type object map entries within the structure  *00523000
                         compdata space.                                00524000
         DS    CL2       Reserved                                       00525000
COMPSTROBJMAPIDXEMCMINOBJID DS F Minimum object identifier of the      *00526000
                         event monitor control object map entries       00527000
COMPSTROBJMAPIDXEMCMAXOBJID DS F Maximum object identifier of the      *00528000
                         event monitor control object map entries       00529000
COMPSTROBJMAPIDXTOTALNUMEMC DS F Total number of event monitor control *00530000
                         object map entries in this compdata space      00531000
KCOMPSTROBJMAPINDEX_LEN EQU 92 Length of CompStrObjMapIndex             00532000
COMPSTROBJMAPINDEX_LEN EQU *-COMPSTROBJMAPINDEX                         00533000
.L0012   ANOP                                                           00534000
         AIF   ('&COMPSTROBJMAP' EQ 'NO').L0016                         00535000
         AIF   ('&DSECT' EQ 'YES').L0017                                00536000
         AIF   ('&COMPSTROBJMAP' NE 'YES').L0016                        00537000
.L0017   ANOP                                                           00538000
*                                                                       00539000
* ********************************************************************  00540000
* *                                                                  *  00541000
* *            Structure compdata space object map                   *  00542000
* *                                                                  *  00543000
* ********************************************************************  00544000
*                                                                       00545000
*                                                                       00546000
         AIF   ('&DSECT' EQ 'YES').L0018                                00547000
COMPSTROBJMAP DS 0F      Object map contained in the structure         *00548000
                         compdata space                                 00549000
         AGO   .L0019                                                   00550000
.L0018   ANOP                                                           00551000
COMPSTROBJMAP DSECT      Object map contained in the structure         *00552000
                         compdata space                                 00553000
.L0019   ANOP                                                           00554000
COMPSTROBJMAPOBJID DS F  Object identifier                              00555000
COMPSTROBJMAPOBJTYPE DS H Object type                                   00556000
COMPSTROBJMAPFLAGS DS 0B Flag byte                                      00557000
COMPSTROBJMAPSUMMARY EQU X'80' Indicates whether the summary option    *00558000
                         was specified for the object, If so, there    *00559000
                         will be no entry control, adjunct, or entry   *00560000
                         data for the object.                           00561000
COMPSTROBJMAPENTRYDATAREQUESTED EQU X'40' Indicates whether entry data *00562000
                         was requested for the given object             00563000
COMPSTROBJMAPADJREQUESTED EQU X'20' Indicates whether adjunct was      *00564000
                         requested for the given object                 00565000
COMPSTROBJMAPOBJDUMPED EQU X'10' Indicates that this object has been   *00566000
                         dumped. Note that this bit will NEVER be set  *00567000
                         in the dump - it is used ONLY for internal    *00568000
                         processing in the dump writing phase.          00569000
         ORG   COMPSTROBJMAPFLAGS+1                                     00570000
         DS    CL1                                                      00571000
COMPSTROBJMAPOBJHDRPTR DS A Pointer to the object header into the      *00572000
                         object header compdata space                   00573000
         DS    CL2                                                      00574000
COMPSTROBJMAPOBJHDRNUMBER DS CL2 Number, in EBCDIC, which indicates    *00575000
                         which object header compdata space the        *00576000
                         pointer pertains to                            00577000
         DS    CL8       Reserved                                       00578000
KCOMPSTROBJMAP_LEN EQU 24 Length of CompStrObjMap                       00579000
COMPSTROBJMAP_LEN EQU *-COMPSTROBJMAP                                   00580000
.L0016   ANOP                                                           00581000
         AIF   ('&COMPHASHTABLEHDR' EQ 'NO').L001A                      00582000
         AIF   ('&DSECT' EQ 'YES').L001B                                00583000
         AIF   ('&COMPHASHTABLEHDR' NE 'YES').L001A                     00584000
.L001B   ANOP                                                           00585000
*                                                                       00586000
* ********************************************************************  00587000
* *                                                                  *  00588000
* *     Format of the HASH TABLE compdata space - CFDxxyyH           *  00589000
* *                                                                  *  00590000
* ********************************************************************  00591000
*                                                                       00592000
*                                                                       00593000
         AIF   ('&DSECT' EQ 'YES').L001C                                00594000
COMPHASHTABLEHDR DS 0F   Mapping for the hash table header              00595000
         AGO   .L001D                                                   00596000
.L001C   ANOP                                                           00597000
COMPHASHTABLEHDR DSECT   Mapping for the hash table header              00598000
.L001D   ANOP                                                           00599000
COMPHASHTABLENUMSLOTS DS F Indicates the number of slots that are in   *00600000
                         the hash table                                 00601000
COMPHASHTABLESLOTARRAY@ DS 0A Pointer to the hash table slot array      00602000
COMPHASHTABLESLOTARRAYPTR DS A Pointer to the hash table slot array     00603000
KCOMPHASHTABLEHDR_LEN EQU 8 Length of CompHashTableHdr                  00604000
COMPHASHTABLEHDR_LEN EQU *-COMPHASHTABLEHDR                             00605000
.L001A   ANOP                                                           00606000
         AIF   ('&COMPHASHSLOTARRAY' EQ 'NO').L001E                     00607000
         AIF   ('&DSECT' EQ 'YES').L001F                                00608000
         AIF   ('&COMPHASHSLOTARRAY' NE 'YES').L001E                    00609000
COMPHASHSLOTARRAY DS 0F  Mapping for the hash table                     00610000
         AGO   .L0020                                                   00611000
.L001F   ANOP                                                           00612000
COMPHASHSLOTARRAY DSECT   Mapping for the hash table                    00613000
.L0020   ANOP                                                           00614000
COMPHASHTABLESLOT DS 0CL4                                               00615000
COMPHASHTABLEELEM@ DS 0A Pointer to the first element on the list for  *00616000
                         the given hash table entry within the         *00617000
                         compdata space                                 00618000
COMPHASHTABLEELEMPTR DS A Pointer to the first element on the list for *00619000
                         the given hash table entry within the         *00620000
                         compdata space                                 00621000
KCOMPHASHTABLESLOT_LEN EQU 4 Length of CompHashTableSlot                00622000
COMPHASHSLOTARRAY_LEN EQU *-COMPHASHSLOTARRAY                           00623000
.L001E   ANOP                                                           00624000
         AIF   ('&COMPHASHELEM' EQ 'NO').L0021                          00625000
         AIF   ('&DSECT' EQ 'YES').L0022                                00626000
         AIF   ('&COMPHASHELEM' NE 'YES').L0021                         00627000
COMPHASHELEM DS 0F       Mapping for a hash table element               00628000
         AGO   .L0023                                                   00629000
.L0022   ANOP                                                           00630000
COMPHASHELEM DSECT       Mapping for a hash table element               00631000
.L0023   ANOP                                                           00632000
COMPHASHELEMFLAGS DS 0B  Flag byte                                      00633000
COMPHASHELEMBYNAME EQU X'80' Indicates that the hash element contains  *00634000
                         the name of the element                        00635000
COMPHASHELEMBYID EQU X'40' Indicates that the hash element contains    *00636000
                         the ID of the element                          00637000
COMPHASHELEMLAST EQU X'20' Indicates that the current hash table       *00638000
                         element is the last one on the list            00639000
         ORG   COMPHASHELEMFLAGS+1                                      00640000
         DS    CL1       Reserved                                       00641000
COMPHASHENTRYCNTLNUMBER DS CL2 Number, in EBCDIC, which indicates      *00642000
                         which entry control compdata space the        *00643000
                         pointer pertains to                            00644000
COMPHASHELEMNAME DS 0CL16 If the hash element is by name, contains the *00645000
                         name of the element                            00646000
COMPHASHELEMID DS CL12   IF the hash element is by ID, contains the ID *00647000
                         of the element                                 00648000
         DS    CL4       Reserved                                       00649000
COMPHASHENTRYCNTLPTR DS A Pointer to the entry controls in the entry   *00650000
                         control compdata space                         00651000
KCOMPHASHELEM_LEN EQU 24 Length of CompHashElem                         00652000
COMPHASHELEM_LEN EQU *-COMPHASHELEM                                     00653000
.L0021   ANOP                                                           00654000
         AIF   ('&COMPENTRYCNTL' EQ 'NO').L0024                         00655000
         AIF   ('&DSECT' EQ 'YES').L0025                                00656000
         AIF   ('&COMPENTRYCNTL' NE 'YES').L0024                        00657000
.L0025   ANOP                                                           00658000
*                                                                       00659000
* ********************************************************************  00660000
* *                                                                  *  00661000
* *     Format of the ENTRY CONTROL compdata space - CFDxxyyC        *  00662000
* *                                                                  *  00663000
* ********************************************************************  00664000
*                                                                       00665000
*                                                                       00666000
         AIF   ('&DSECT' EQ 'YES').L0026                                00667000
COMPENTRYCNTL DS 0F      Mapping of the information for one entry       00668000
         AGO   .L0027                                                   00669000
.L0026   ANOP                                                           00670000
COMPENTRYCNTL DSECT      Mapping of the information for one entry       00671000
.L0027   ANOP                                                           00672000
COMPENTRYCNTLHDR DS 0CL24                                               00673000
COMPENTRYCNTLENTRYDATAPTR DS A Pointer to the entry's entry data in    *00674000
                         the entry data compdata space                  00675000
COMPENTRYCNTLFLAGS DS 0B                                                00676000
COMPENTRYCNTLEDATASERIALIZED EQU X'80' Indicates whether the entry     *00677000
                         data was dumped serialized. An ON setting     *00678000
                         indicates that the data was serialized         00679000
COMPENTRYCNTLADJSERIALIZED EQU X'40' Indicates whether the adjunct     *00680000
                         data was dumped serialized. An ON setting     *00681000
                         indicates that the data was serialized         00682000
COMPENTRYCNTLONSCM EQU X'20' Indicates whether the entry resides in    *00683000
                         coupling facility real storage or storage     *00684000
                         class memory. 0 => the entry represented by   *00685000
                         this entry control record resides in coupling *00686000
                         facility real storage. 1 => the entry resides *00687000
                         in coupling facility storage class memory. No *00688000
                         entry control information, adjunct data or    *00689000
                         entry data is returned                         00690000
COMPENTRYCNTLEDATADECRYPTERROR EQU X'10' ON indicates that the         *00691000
                         structure is encrypted and decryption of the  *00692000
                         entry data failed                              00693000
COMPENTRYCNTLADJDECRYPTERROR EQU X'08' ON indicates that the structure *00694000
                         is encrypted and decryption of the adjunct    *00695000
                         data failed                                    00696000
COMPENTRYCNTLADJSKEY EQU X'04' ON indicates that the first 32 bytes of *00697000
                         the adjunct data contain the secondary key     00698000
         ORG   COMPENTRYCNTLFLAGS+1                                     00699000
         DS    CL1       Reserved                                       00700000
COMPENTRYCNTLENTRYDATANUMBER DS CL2 Number, in EBCDIC, which indicates *00701000
                         which entry data compdata space the pointer   *00702000
                         pertains to                                    00703000
COMPENTRYCNTLENTRYDATALEN DS F Length of the entry data associated     *00704000
                         with this entry                                00705000
COMPENTRYCNTLADJPTR DS A Pointer to the entry's adjunct data in the    *00706000
                         adjunct compdata space                         00707000
         DS    CL2                                                      00708000
COMPENTRYCNTLADJNUMBER DS CL2 Number, in EBCDIC, which indicates which *00709000
                         adjunct compdata space the pointer pertains   *00710000
                         to                                             00711000
COMPENTRYCNTLPOSWTHINEKEY DS F Indicates the position of the entry     *00712000
                         within the entrykey it has                     00713000
COMPENTRYCNTLINFO DS 0C  Control information for the current entry     *00714000
                         NOTE : This field is mapped by the DDil       *00715000
                         mapping in the IXLYDDIB macro if the          *00716000
                         structure is a list structure. This field is  *00717000
                         mapped by the DDic mapping in the IXLYDDIB    *00718000
                         macro if the structure is a cache structure.  *00719000
                         To obtain the length of this use the          *00720000
                         appropriate mappings and length constant in   *00721000
                         IXLYDDIB.                                      00722000
KCOMPENTRYCNTLHDR_LEN EQU 24 Length of CompEntryCntlHdr                 00723000
COMPENTRYCNTL_LEN EQU *-COMPENTRYCNTL                                   00724000
.L0024   ANOP                                                           00725000
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 00726000
         AIF   ('&LIST' EQ 'YES').P4                                    00727000
.P3      ANOP                                                           00728000
         POP   PRINT                                                    00729000
.P4      ANOP                                                           00730000
.P_EXIT  ANOP                                                           00731000
         MEND                                                           00732000
**/ IXLYCOMP_2:;                                                        00733000
* %IXLYCOMP_INCLUDED = 'YES';                                           00734000
* %DCL ZCBPRINT CHAR EXT;                                               00735000
* %DEACTIVATE ZCBPRINT;                                                 00736000
* %DCL IXLYCOMP_LIST CHAR EXT;                                          00737000
* %DEACTIVATE IXLYCOMP_LIST;                                            00738000
* %IF IXLYCOMP_LIST ^= 'NO' &                                           00739000
*    ZCBPRINT ^= 'NO' %THEN                                             00740000
*   %GOTO IXLYCOMP_3;                                                   00741000
*   @LIST PUSH NOECHO;                                                  00742000
*   @LIST NOASSEMBLE NOECHO;                                            00743000
*   @LIST OFF C NOECHO;                                                 00744000
* %IXLYCOMP_3:;                                                         00745000
*/* Start of PL/X Source                                             */ 00746000
*                                                                       00747000
* %IF COMPDATA_NAME_ATTR = '' %THEN                                     00748000
*   %COMPDATA_NAME_ATTR = 'BASED';                                      00749000
*                                                                       00750000
* %IF COMPDATA_INDEX_ATTR = '' %THEN                                    00751000
*   %COMPDATA_INDEX_ATTR = 'BASED';                                     00752000
*                                                                       00753000
* %IF COMPDATA_STRTRL_ATTR = '' %THEN                                   00754000
*   %COMPDATA_STRTRL_ATTR = 'BASED';                                    00755000
*                                                                       00756000
* %IF COMPDATA_STR_ATTR = '' %THEN                                      00757000
*   %COMPDATA_STR_ATTR = 'BASED';                                       00758000
*                                                                       00759000
* %IF COMPDATA_STROBJMAPINDX_ATTR = '' %THEN                            00760000
*   %COMPDATA_STROBJMAPINDX_ATTR = 'BASED';                             00761000
*                                                                       00762000
* %IF COMPDATA_STROBJMAP_ATTR = '' %THEN                                00763000
*   %COMPDATA_STROBJMAP_ATTR = 'BASED';                                 00764000
*                                                                       00765000
* %IF COMPDATA_HASHTABLEHDR_ATTR = '' %THEN                             00766000
*   %COMPDATA_HASHTABLEHDR_ATTR = 'BASED';                              00767000
*                                                                       00768000
* %IF COMPDATA_HASHSLOT_ATTR = '' %THEN                                 00769000
*   %COMPDATA_HASHSLOT_ATTR = 'BASED';                                  00770000
*                                                                       00771000
* %IF COMPDATA_HASHELEM_ATTR = '' %THEN                                 00772000
*   %COMPDATA_HASHELEM_ATTR = 'BASED';                                  00773000
*                                                                       00774000
* %IF COMPDATA_ENTRYCNTL_ATTR = '' %THEN                                00775000
*   %COMPDATA_ENTRYCNTL_ATTR = 'BASED';                                 00776000
*                                                                       00777000
*/********************************************************************/ 00778000
*/*                                                                  */ 00779000
*/*     Format of the COMPDATA names                                 */ 00780000
*/*                                                                  */ 00781000
*/*  ]]]] NOTE ]]]]  The CompdataNameStrNum component of the         */ 00782000
*/*  compdata name is dependent on the position of the structure     */ 00783000
*/*  within the master index.  The number of the first               */ 00784000
*/*  structure is 1 and therefore the compdata names for that        */ 00785000
*/*  structure will be CFDxx01z.  The same follows for all the       */ 00786000
*/*  structures within the master index.                             */ 00787000
*/*                                                                  */ 00788000
*/*  The CompdataSpaceNumber portion of the name must begin at 00.   */ 00789000
*/*  If another compdata space of that type is necessary, the        */ 00790000
*/*  number will be 01, etc.                                         */ 00791000
*/*                                                                  */ 00792000
*/********************************************************************/ 00793000
*                                                                       00794000
*Dcl 1 CompdataName char(8) COMPDATA_NAME_ATTR,                         00795000
*      3 CompdataNameComponent char(3),  /* Indicates the component     00796000
*                                           prefix                   */ 00797000
*      3 CompdataSpaceNumber   char(2),  /* Nth compdata space          00798000
*                                           of a specific type.  The    00799000
*                                           first compdata space        00800000
*                                           should be numbered 00.   */ 00801000
*      3 CompdataNameStrNum    char(2),  /* Nth structure dumped     */ 00802000
*      3 CompdataNameType      char(1);  /* Type of compdata record  */ 00803000
*                                                                       00804000
*Dcl KCompDataName_Len fixed(31)                                        00805000
*         Constant(Length(CompDataName)); /* Length of CompDataName     00806000
*                                                               @P1M*/  00807000
*                                                                       00808000
*/********************************************************************/ 00809000
*/*                                                                  */ 00810000
*/* Constants defined for use in the Compdata name                   */ 00811000
*/*                                                                  */ 00812000
*/********************************************************************/ 00813000
*                                                                       00814000
*Dcl CompDataComponent char(3)                                          00815000
*               constant('CFD');      /* Used to fill in the component  00816000
*                                       section of the compdata name */ 00817000
*                                                                       00818000
*Dcl CompdataTypeStr char(1)                                            00819000
*                  constant('S');     /* Structure type compdata     */ 00820000
*                                                                       00821000
*Dcl CompdataTypeIndex char(8)                                          00822000
*               constant('CFD0000I'); /* Name of the master index       00823000
*                                        in the dump                 */ 00824000
*Dcl CompdataTypeObj char(1)                                            00825000
*                  constant('O');     /* Object header type compdata */ 00826000
*Dcl CompdataTypeHash char(1)                                           00827000
*                  constant('H');     /* Hash table type compdata    */ 00828000
*Dcl CompdataTypeEntryCntl char(1)                                      00829000
*                  constant('C');     /* Entry control information      00830000
*                                        type compdata               */ 00831000
*Dcl CompdataTypeEntryData char(1)                                      00832000
*                  constant('D');     /* Entry data type compdata    */ 00833000
*Dcl CompdataTypeAdj char(1)                                            00834000
*                  constant('A');     /* Adjunct data type compdata  */ 00835000
*Dcl CompdataTypeLock char(1)                                           00836000
*                  constant('L');     /* Lock table type compdata    */ 00837000
*Dcl CompdataTypeUser char(1)                                           00838000
*                  constant('U');     /* User control type compdata  */ 00839000
*Dcl CompdataTypeEmc  char(1)                                           00840000
*                  constant('E');     /* Event monitor control type     00841000
*                                        compdata                @01A*/ 00842000
*Dcl CompdataTypeEventQ char(1)                                         00843000
*                  constant('Q');     /* Event queue control type       00844000
*                                        compdata                @01A*/ 00845000
*                                                                       00846000
*                                                                       00847000
*                                                                       00848000
*/********************************************************************/ 00849000
*/*                                                                  */ 00850000
*/*     Format of the master index compdata space - CFD0000I         */ 00851000
*/*                                                                  */ 00852000
*/*  NOTE: The CompIndex records in the master index compdata space  */ 00853000
*/*        must fit evenly into a 4K record.                         */ 00854000
*/*                                                                  */ 00855000
*/********************************************************************/ 00856000
*                                                                       00857000
*                                                                       00858000
*Dcl 1 CompIndex COMPDATA_INDEX_ATTR,         /* There will be one      00859000
*                                                CompIndex type entry   00860000
*                                                in the master index    00861000
*                                                compdata space for     00862000
*                                                every structure in the 00863000
*                                                dump                */ 00864000
*       3 CompIndexStrname         char(16),  /* Name of the            00865000
*                                                structure           */ 00866000
*       3 CompIndexStrDumpID       fixed(16), /* Structure Dump ID      00867000
*                                                                @D2A*/ 00868000
*       3 *                        Char(2),   /* Reserved        @D2A*/ 00869000
*       3 CompIndexConname         char(16),  /* Conname used in        00870000
*                                                requesting the dump */ 00871000
*       3 CompIndexStrType         fixed(8),  /* Structure type      */ 00872000
*       3 CompIndexUIDL            fixed(8),  /* User identifier limit  00873000
*                                                (UIDL)                 00874000
*                                                used to determine      00875000
*                                                the size of the list   00876000
*                                                number controls for a  00877000
*                                                list structure.  This  00878000
*                                                field will be 0 for a  00879000
*                                                cache structure     */ 00880000
*       3 CompIndexStr#Ebcdic      char(2),   /* Structure number in    00881000
*                                                EBCDIC              */ 00882000
*         5 CompIndexStrNumEbcdic    char(2),   /* Structure number in  00883000
*                                                EBCDIC          @P3A*/ 00884000
*       3 CompIndexHdwNd           char(32),  /* Node element           00885000
*                                                descriptor          */ 00886000
*       3 CompIndexLockTblEntLen   fixed(32), /* Length of the lock     00887000
*                                                table entries          00888000
*                                                associated with this   00889000
*                                                structure           */ 00890000
*       3 CompIndexStrTrlPtr       ptr(31),   /* Pointer to the         00891000
*                                                structure trailer      00892000
*                                                associated with this   00893000
*                                                structure           */ 00894000
*       3 CompIndexNoDumpRsn       fixed(32), /* Reason why the         00895000
*                                                structure was not      00896000
*                                                dumped - the no dump   00897000
*                                                reason codes are       00898000
*                                                defined in the         00899000
*                                                IXLYSTRC mapping    */ 00900000
*       3 CompIndexFlags bit(8),              /* Master index flags  */ 00901000
*         5 CompIndexLastStr       bit(1),    /* Indicates that this    00902000
*                                                is the last            00903000
*                                                entry in the           00904000
*                                                master index        */ 00905000
*         5 CompIndexConNotFound   bit(1),    /* Indicates that the     00906000
*                                                conname or contoken    00907000
*                                                specified for a cache  00908000
*                                                structure was not      00909000
*                                                found in the policy */ 00910000
*         5 CompIndexStrInRebld    bit(1),    /* Indicates that the     00911000
*                                                the structure is in    00912000
*                                                the process of rebuild 00913000
*                                                                @D3A*/ 00914000
*         5 CompIndexRebldOldStr   bit(1), /* Indicates that the        00915000
*                                            structure information      00916000
*                                            pertains to the OLD        00917000
*                                            structure                  00918000
*                                            NOTE: Bit is only valid if 00919000
*                                            the CompIndexStrInRebld    00920000
*                                            bit is set          @D3A*/ 00921000
*         5 CompIndexRebldNewStr   bit(1), /* Indicates that the        00922000
*                                            structure information      00923000
*                                            pertains to the NEW        00924000
*                                            structure                  00925000
*                                            NOTE: Bit is only valid if 00926000
*                                            the CompIndexStrInRebld    00927000
*                                            bit is set          @D3A*/ 00928000
*         5 CompIndexRebldDuplexStr bit(1),/* ON indicates the          00929000
*                                            structure rebuild is a     00930000
*                                            duplexing rebuild. OFF     00931000
*                                            indicates the structure    00932000
*                                            rebuild is a normal        00933000
*                                            rebuild.                   00934000
*                                            NOTE: Bit is only valid if 00935000
*                                            the CompIndexStrInRebld    00936000
*                                            bit is set          @03A*/ 00937000
*         5 CompIndexRebldMethodStr bit(1),/* ON indicates the          00938000
*                                            structure rebuild is       00939000
*                                            system managed. OFF        00940000
*                                            indicates the structure    00941000
*                                            rebuild is user managed.   00942000
*                                            NOTE: Bit is only valid if 00943000
*                                            the CompIndexStrInRebld    00944000
*                                            bit is set          @L2A*/ 00945000
*         5 CompIndexStrEncrypted Bit(1), /* ON indicates that data     00946000
*                                            in this structure instance 00947000
*                                            is encrypted        @L4A*/ 00948000
*       3 *                        char(1),   /* Reserved            */ 00949000
*       3 CompIndexConID           fixed(16), /* Connection ID       */ 00950000
*       3 CompIndexCfName          char(8),   /* Facility name   @D4C*/ 00951000
*       3 CompIndexIncidentToken   char(32),  /* Incident Token  @L1C*/ 00952000
*       3 CompIndexCflevel         fixed(32), /* Coupling facility      00953000
*                                             operational level of the  00954000
*                                             facility in which the     00955000
*                                             structure is allocated    00956000
*                                                                @P2A*/ 00957000
*       3 *                        char(124); /* Reserved        @P2C*/ 00958000
* Dcl                                                                   00959000
*    KCompIndex_Len fixed(31)                                           00960000
*         Constant(Length(CompIndex));    /* Length of CompIndex @P1M*/ 00961000
*                                                                       00962000
*/********************************************************************/ 00963000
*/*                                                                  */ 00964000
*/*     Structure Trailer                                            */ 00965000
*/*                                                                  */ 00966000
*/*  NOTE: The Structure Trailer is part of the Master Index compdata*/ 00967000
*/*        space                                                     */ 00968000
*/*                                                                  */ 00969000
*/********************************************************************/ 00970000
*                                                                       00971000
*Dcl 1 CompStrTrl char(4096) COMPDATA_STRTRL_ATTR bdy(word), /* There   00972000
*                                                will be a structure    00973000
*                                                trailer for each       00974000
*                                                structure that is      00975000
*                                                dumped (unless the     00976000
*                                                dump dataset fills or  00977000
*                                                an I/O error occurs    00978000
*                                                while the structure is 00979000
*                                                being dumped)       */ 00980000
*       3 CompStrTrlDumpRsn        fixed(32), /* Reason for an          00981000
*                                                incomplete dump of     00982000
*                                                the structure - the    00983000
*                                                dump reason codes are  00984000
*                                                defined in the         00985000
*                                                IXLYSTRC mapping    */ 00986000
*       3 CompStrTrlObjIdIncomplete fixed(32), /* Object identifier of  00987000
*                                                object that is         00988000
*                                                incomplete          */ 00989000
*       3 CompStrTrlDotIncomplete  fixed(16), /* Dumping object type    00990000
*                                                of object that is      00991000
*                                                incomplete          */ 00992000
*       3 CompStrTrlFlags bit(8),             /* Structure trailer      00993000
*                                                flags               */ 00994000
*         5 CompStrTrlLockDumped   bit(1),    /* Indicates that some    00995000
*                                                lock table entries     00996000
*                                                were dumped for this   00997000
*                                                structure           */ 00998000
*         5 CompStrTrlUserDumped   bit(1),    /* Indicates that some    00999000
*                                                user controls were     01000000
*                                                dumped for this        01001000
*                                                structure           */ 01002000
*         5 *                     bit(6),     /* Reserved            */ 01003000
*       3 *                        char(21);  /* Reserved            */ 01004000
* Dcl                                                                   01005000
*    KCompStrTrl_Len fixed(31)                                          01006000
*         Constant(Length(CompStrTrl));  /* Length of CompStrTrl @P1M*/ 01007000
*/********************************************************************/ 01008000
*/*                                                                  */ 01009000
*/*     Format of the STRUCTURE compdata type - CFDxxyyS             */ 01010000
*/*                                                                  */ 01011000
*/* The structure compdata space consists of up to four items.  The  */ 01012000
*/* first item that appears is the structure compdata space header   */ 01013000
*/* (CompStrHdr).  The header consists of pointers to the dump       */ 01014000
*/* header and the object map index.                                 */ 01015000
*/*                                                                  */ 01016000
*/* The dump header consists of structure information.  It is mapped */ 01017000
*/* by the macro IHADWHDR                                            */ 01018000
*/*                                                                  */ 01019000
*/* The object map index (CompStrObjMapIndex) is an index into the   */ 01020000
*/* object map.  It contains pointers to the first object map entry  */ 01021000
*/* of each type within that structure compdata space.               */ 01022000
*/*                                                                  */ 01023000
*/* The object map (CompStrObjMap) is a directory to the object      */ 01024000
*/* header in the object compdata space.  Each object has its own    */ 01025000
*/* entry.  The object map entries are grouped by type and are       */ 01026000
*/* ordered by the object identifier (CompStrObjMapObjId).           */ 01027000
*/*                                                                  */ 01028000
*/********************************************************************/ 01029000
*/********************************************************************/ 01030000
*/*                                                                  */ 01031000
*/*            Structure compdata space header                       */ 01032000
*/*                                                                  */ 01033000
*/********************************************************************/ 01034000
*                                                                       01035000
*Dcl 1 CompStrHdr COMPDATA_STR_ATTR,   /* Header for the structure      01036000
*                                         compdata space.  There will   01037000
*                                         be a header in each           01038000
*                                         structure compdata space for  01039000
*                                         a structure                */ 01040000
*      3 CompStrHdrDumpHdr@  ptr(31),  /* Pointer to the dump header    01041000
*                                         for a given structure      */ 01042000
*        5 CompStrHdrDumpHdrPtr ptr(31), /* Pointer to the dump header  01043000
*                                         for a given structure  @P3A*/ 01044000
*      3 CompStrHdrObjMapIndex@ ptr(31),/* Pointer to the object map    01045000
*                                         index within the structure    01046000
*                                         compdata space.            */ 01047000
*        5 CompStrHdrObjMapIndexPtr ptr(31); /* Pointer to the object   01048000
*                                         map index within the          01049000
*                                         structure compdata space.     01050000
*                                                                @P3A*/ 01051000
* Dcl                                                                   01052000
*    KCompStrHdr_Len fixed(31)                                          01053000
*         Constant(Length(CompStrHdr));  /* Length of CompStrHdr @P1M*/ 01054000
*                                                                       01055000
*/********************************************************************/ 01056000
*/*                                                                  */ 01057000
*/*            Structure compdata space object map index             */ 01058000
*/*                                                                  */ 01059000
*/********************************************************************/ 01060000
*                                                                       01061000
* Dcl 1 CompStrObjMapIndex COMPDATA_STROBJMAPINDX_ATTR,                 01062000
*                                             /* Index by object type   01063000
*                                                in the object map.  */ 01064000
*       3 CompStrObjMapIdxListInfo,           /* Information associated 01065000
*                                                with list object       01066000
*                                                map entries         */ 01067000
*         5 CompStrObjMapIdxTypeList@   ptr(31), /* Pointer to the      01068000
*                                                beginning of the       01069000
*                                                listnum type object    01070000
*                                                map entries within the 01071000
*                                                structure compdata     01072000
*                                                space.              */ 01073000
*           7 CompStrObjMapIdxTypeListPtr ptr(31), /* Pointer to the    01074000
*                                                beginning of the       01075000
*                                                listnum type object    01076000
*                                                map entries within the 01077000
*                                                structure compdata     01078000
*                                                space.          @P3A*/ 01079000
*         5 CompStrObjMapIdxListMinObjID fixed(32), /* Minimum object   01080000
*                                                identifier of the      01081000
*                                                listnum                01082000
*                                                object map entries  */ 01083000
*         5 CompStrObjMapIdxListMaxObjID fixed(32), /* Maximum object   01084000
*                                                identifier of the      01085000
*                                                listnum                01086000
*                                                object map entries  */ 01087000
*         5 CompStrObjMapIdxTotalNumLst  fixed(32), /* Total number of  01088000
*                                                list number            01089000
*                                                object map entries     01090000
*                                                in this                01091000
*                                                compdata space      */ 01092000
*       3 CompStrObjMapIdxStgCInfo,           /* Information associated 01093000
*                                                with the storage class 01094000
*                                                object map entries  */ 01095000
*         5 CompStrObjMapIdxTypeStgClass@  ptr(31), /* Pointer to the   01096000
*                                                beginning of the       01097000
*                                                storage class type     01098000
*                                                object map entries  */ 01099000
*           7 CompStrObjMapIdxTypeStgClassPtr ptr(31), /* Pointer to    01100000
*                                                the beginning of the   01101000
*                                                storage class type     01102000
*                                                object map entries     01103000
*                                                                @P3A*/ 01104000
*         5 CompStrObjMapIdxStgCMinObjID fixed(32), /* Minimum object   01105000
*                                                identifier of the      01106000
*                                                storage class          01107000
*                                                object map entries  */ 01108000
*         5 CompStrObjMapIdxStgCMaxObjID fixed(32), /* Maximum object   01109000
*                                                identifier of the      01110000
*                                                storage class          01111000
*                                                object map entries  */ 01112000
*         5 CompStrObjMapIdxTotalNumStg  fixed(32), /* Total number of  01113000
*                                                Storage class          01114000
*                                                object map entries     01115000
*                                                in this                01116000
*                                                compdata space      */ 01117000
*       3 CompStrObjMapIdxCOCInfo,            /* Information associated 01118000
*                                                with the castout class 01119000
*                                                object map entries  */ 01120000
*         5 CompStrObjMapIdxTypeCOClass@   ptr(31), /* Pointer to the   01121000
*                                                beginning of the       01122000
*                                                castout class type     01123000
*                                                object map entries  */ 01124000
*           7 CompStrObjMapIdxTypeCOClassPtr ptr(31), /* Pointer to the 01125000
*                                                beginning of the       01126000
*                                                castout class type     01127000
*                                                object map entries     01128000
*                                                                @P3A*/ 01129000
*         5 CompStrObjMapIdxCOCMinObjID fixed(32), /* Minimum object    01130000
*                                                identifier of the      01131000
*                                                castout class          01132000
*                                                object map entries  */ 01133000
*         5 CompStrObjMapIdxCOCMaxObjID fixed(32), /* Maximum object    01134000
*                                                identifier of the      01135000
*                                                castout class          01136000
*                                                object map entries  */ 01137000
*         5 CompStrObjMapIdxTotalNumCOC  fixed(32), /* Total number of  01138000
*                                                castout class          01139000
*                                                object map entries     01140000
*                                                in this                01141000
*                                                compdata space      */ 01142000
*       3 CompStrObjMapIdxTypeLockTbl@   ptr(31), /* Pointer to the     01143000
*                                                lock table type object 01144000
*                                                map entries         */ 01145000
*         5 CompStrObjMapIdxTypeLockTblPtr ptr(31), /* Pointer to the   01146000
*                                                lock table type object 01147000
*                                                map entries     @P3A*/ 01148000
*       3 CompStrObjMapIdxTypeUser@      ptr(31), /* Pointer to the     01149000
*                                                user control type      01150000
*                                                object map entries  */ 01151000
*         5 CompStrObjMapIdxTypeUserPtr    ptr(31), /* Pointer to the   01152000
*                                                user control type      01153000
*                                                object map entries     01154000
*                                                                @P3A*/ 01155000
*       3 CompStrObjMapIdxEventQInfo,         /* Information associated 01156000
*                                                with event queue       01157000
*                                                control object map     01158000
*                                                entries         @01A*/ 01159000
*         5 CompStrObjMapIdxTypeEventQ@ ptr(31), /* Pointer to the      01160000
*                                                beginning of the event 01161000
*                                                queue control type     01162000
*                                                object map entries     01163000
*                                                within the structure   01164000
*                                                compdata space. @01A*/ 01165000
*           7 CompStrObjMapIdxTypeEventQPtr ptr(31), /* Pointer to the  01166000
*                                                beginning of the event 01167000
*                                                queue control type     01168000
*                                                object map entries     01169000
*                                                within the structure   01170000
*                                                compdata space. @P3C*/ 01171000
*         5 CompStrObjMapIdxEventQMinObjID fixed(32), /* Minimum object 01172000
*                                                identifier of the      01173000
*                                                event queue control    01174000
*                                                object map entries     01175000
*                                                                @01A*/ 01176000
*         5 CompStrObjMapIdxEventQMaxObjID fixed(32), /* Maximum object 01177000
*                                                identifier of the      01178000
*                                                event queue control    01179000
*                                                object map entries     01180000
*                                                                @01A*/ 01181000
*         5 CompStrObjMapIdxTotalNumEventQ fixed(32), /* Total number   01182000
*                                                of event queue control 01183000
*                                                object map entries in  01184000
*                                                this compdata space    01185000
*                                                                @01A*/ 01186000
*       3 CompStrObjMapIdxEMCInfo,            /* Information associated 01187000
*                                                with event monitor     01188000
*                                                control object map     01189000
*                                                entries         @01A*/ 01190000
*         5 CompStrObjMapIdxTypeEMC@    ptr(31), /* Pointer to the      01191000
*                                                beginning of the event 01192000
*                                                monitor control type   01193000
*                                                object map entries     01194000
*                                                within the structure   01195000
*                                                compdata space. @01A*/ 01196000
*           7 CompStrObjMapIdxTypeEMCPtr  ptr(31), /* Pointer to the    01197000
*                                                beginning of the event 01198000
*                                                monitor control type   01199000
*                                                object map entries     01200000
*                                                within the structure   01201000
*                                                compdata space. @P3C*/ 01202000
*         5 CompStrObjMapIdxTypeEMCNum char(2),  /* Compdata space      01203000
*                                                number of the pointer  01204000
*                                                to the beginning of    01205000
*                                                the event monitor      01206000
*                                                control type object    01207000
*                                                map entries within the 01208000
*                                                structure compdata     01209000
*                                                space.          @01A*/ 01210000
*         5 * char(2),                           /* Reserved     @01A*/ 01211000
*         5 CompStrObjMapIdxEMCMinObjID fixed(32), /* Minimum object    01212000
*                                                identifier of the      01213000
*                                                event monitor control  01214000
*                                                object map entries     01215000
*                                                                @01A*/ 01216000
*         5 CompStrObjMapIdxEMCMaxObjID fixed(32), /* Maximum object    01217000
*                                                identifier of the      01218000
*                                                event monitor control  01219000
*                                                object map entries     01220000
*                                                                @01A*/ 01221000
*         5 CompStrObjMapIdxTotalNumEMC fixed(32); /* Total number of   01222000
*                                                event monitor control  01223000
*                                                object map entries in  01224000
*                                                this compdata space    01225000
*                                                                @01A*/ 01226000
* DCL                                                                   01227000
*    KCompStrObjMapIndex_Len fixed(31)                                  01228000
*         Constant(Length(CompStrObjMapIndex)); /* Length of            01229000
*                                             CompStrObjMapIndex @P1M*/ 01230000
*                                                                       01231000
*/********************************************************************/ 01232000
*/*                                                                  */ 01233000
*/*            Structure compdata space object map                   */ 01234000
*/*                                                                  */ 01235000
*/********************************************************************/ 01236000
*                                                                       01237000
*Dcl 1 CompStrObjMap COMPDATA_STROBJMAP_ATTR, /* Object map contained   01238000
*                                                in the structure       01239000
*                                                compdata space      */ 01240000
*      3 CompStrObjMapObjId        fixed(32), /* Object identifier   */ 01241000
*      3 CompStrObjMapObjType      fixed(16), /* Object type         */ 01242000
*      3 CompStrObjMapFlags        bit(8),    /* Flag byte           */ 01243000
*        5 CompStrObjMapSummary      bit(1),  /* Indicates              01244000
*                                                whether the summary    01245000
*                                                option was specified   01246000
*                                                for the object, If so, 01247000
*                                                there will be no entry 01248000
*                                                control, adjunct,      01249000
*                                                or entry data for the  01250000
*                                                object.             */ 01251000
*        5 CompStrObjMapEntryDataRequested bit(1),/* Indicates whether  01252000
*                                                entry data was         01253000
*                                                requested for the      01254000
*                                                given object        */ 01255000
*        5 CompStrObjMapAdjRequested  bit(1),  /* Indicates whether     01256000
*                                                adjunct was requested  01257000
*                                                for the given          01258000
*                                                object              */ 01259000
*        5 CompStrObjMapObjDumped    bit(1),  /* Indicates that this    01260000
*                                                object has been        01261000
*                                                dumped.                01262000
*                                                Note that this         01263000
*                                                bit will               01264000
*                                                NEVER be set in the    01265000
*                                                dump - it is used ONLY 01266000
*                                                for internal           01267000
*                                                processing             01268000
*                                                in the dump writing    01269000
*                                                phase.              */ 01270000
*        5 *                         bit(4),  /* Reserved            */ 01271000
*      3 *                         char(1),                             01272000
*      3 CompStrObjMapObjHdrPtr    ptr(31),   /* Pointer to the         01273000
*                                                object header          01274000
*                                                into the               01275000
*                                                object header          01276000
*                                                compdata space      */ 01277000
*      3 * char(2),                                                     01278000
*      3 CompStrObjMapObjHdrNumber char(2),   /* Number, in EBCDIC,     01279000
*                                                which indicates        01280000
*                                                which object header    01281000
*                                                compdata space the     01282000
*                                                pointer pertains to */ 01283000
*      3 *                           char(8); /* Reserved            */ 01284000
* DCL                                                                   01285000
*    KCompStrObjMap_Len fixed(31)                                       01286000
*         Constant(Length(CompStrObjMap));/* Length of CompStrObjMap    01287000
*                                                               @P1M*/  01288000
*                                                                       01289000
*/********************************************************************/ 01290000
*/*                                                                  */ 01291000
*/*     Format of the HASH TABLE compdata space - CFDxxyyH           */ 01292000
*/*                                                                  */ 01293000
*/********************************************************************/ 01294000
*                                                                       01295000
* Dcl 1 CompHashTableHdr COMPDATA_HASHTABLEHDR_ATTR,                    01296000
*                                            /* Mapping for the hash    01297000
*                                               table header         */ 01298000
*         5 CompHashTableNumSlots fixed(31), /* Indicates the number    01299000
*                                               of slots that are       01300000
*                                               in the hash table    */ 01301000
*         5 CompHashTableSlotArray@  ptr(31),/* Pointer to the hash     01302000
*                                               table slot array     */ 01303000
*           7 CompHashTableSlotArrayPtr ptr(31),/* Pointer to the hash  01304000
*                                               table slot array @P3A*/ 01305000
*       3 *              char(0) bdy(word);  /* Ensure that the length  01306000
*                                               of the hash table       01307000
*                                               header is evenly        01308000
*                                               divisible by four       01309000
*                                               bytes.               */ 01310000
* Dcl                                                                   01311000
*    KCompHashTableHdr_Len fixed(31)                                    01312000
*         Constant(Length(CompHashTableHdr));/* Length of               01313000
*                                          CompHashTableHdr     @P1M*/  01314000
*                                                                       01315000
* Dcl 1 CompHashSlotArray COMPDATA_HASHSLOT_ATTR, /* Mapping for        01316000
*                                               the hash table       */ 01317000
*       3 CompHashTableSlot(*),                                         01318000
*           7 CompHashTableElem@     ptr(31),/* Pointer to the first    01319000
*                                               element on the list     01320000
*                                               for the given hash      01321000
*                                               table entry within the  01322000
*                                               compdata space       */ 01323000
*             9 CompHashTableElemPtr   ptr(31),/* Pointer to the first  01324000
*                                               element on the list     01325000
*                                               for the given hash      01326000
*                                               table entry within the  01327000
*                                               compdata space   @P3A*/ 01328000
*         5 *              char(0) bdy(word);/* Ensure that the length  01329000
*                                               of a hash table slot is 01330000
*                                               evenly divisible by     01331000
*                                               four bytes.          */ 01332000
*                                                                       01333000
* DCL CompHashTableSlotElem@ ptr(31) BASED; /* Used to map over the     01334000
*                                              contents of a particular 01335000
*                                              slot in the hash table   01336000
*                                              slot array            */ 01337000
* DCL CompHashTableSlotElemPtr ptr(31) BASED; /* Used to map over the   01338000
*                                              contents of a particular 01339000
*                                              slot in the hash table   01340000
*                                              slot array        @P3A*/ 01341000
* Dcl                                                                   01342000
*    KCompHashTableSlot_Len fixed(31)                                   01343000
*         Constant(Length(CompHashTableSlot));/*  Length of             01344000
*                                           CompHashTableSlot    @P1M*/ 01345000
*                                                                       01346000
* Dcl 1 CompHashElem COMPDATA_HASHELEM_ATTR, /* Mapping for a hash      01347000
*                                              table element         */ 01348000
*       3 CompHashElemFlags      bit(8),    /* Flag byte             */ 01349000
*         5 CompHashElemByName   bit(1),    /* Indicates that the       01350000
*                                              hash element contains    01351000
*                                              the name of the          01352000
*                                              element               */ 01353000
*         5 CompHashElemByID     bit(1),    /* Indicates that the       01354000
*                                              hash element contains    01355000
*                                              the ID of the element */ 01356000
*         5 CompHashElemLast     bit(1),    /* Indicates that the       01357000
*                                              current hash table       01358000
*                                              element is the last      01359000
*                                              one on the list       */ 01360000
*         5 *                    bit(5),    /* Reserved              */ 01361000
*       3 *                      char(1),   /* Reserved              */ 01362000
*       3 CompHashEntryCntlNumber char(2),  /* Number, in EBCDIC, which 01363000
*                                              indicates which entry    01364000
*                                              control compdata space   01365000
*                                              the pointer pertains to  01366000
*                                                                    */ 01367000
*       3 CompHashElemName       char(16),  /* If the hash element is   01368000
*                                              by name, contains the    01369000
*                                              name of the element   */ 01370000
*         5 CompHashElemID       char(12),  /* IF the hash element is   01371000
*                                              by ID, contains the      01372000
*                                              ID of the element     */ 01373000
*         5 *                    char(4),   /* Reserved              */ 01374000
*       3 CompHashEntryCntlPtr   ptr(31);   /* Pointer to the entry     01375000
*                                              controls in the entry    01376000
*                                              control compdata         01377000
*                                              space                 */ 01378000
*  Dcl                                                                  01379000
*    KCompHashElem_Len fixed(31)                                        01380000
*         Constant(Length(CompHashElem)); /* Length of CompHashElem     01381000
*                                                                @P1M*/ 01382000
*                                                                       01383000
*/********************************************************************/ 01384000
*/*                                                                  */ 01385000
*/*     Format of the ENTRY CONTROL compdata space - CFDxxyyC        */ 01386000
*/*                                                                  */ 01387000
*/********************************************************************/ 01388000
*                                                                       01389000
*Dcl 1 CompEntryCntl COMPDATA_ENTRYCNTL_ATTR,     /* Mapping of the     01390000
*                                                   information for     01391000
*                                                   one entry        */ 01392000
*     3 CompEntryCntlHdr,                                               01393000
*      5 CompEntryCntlEntryDataPtr     ptr(31),  /* Pointer to the      01394000
*                                                   entry's entry       01395000
*                                                   data in the         01396000
*                                                   entry data          01397000
*                                                   compdata space   */ 01398000
*      5 CompEntryCntlFlags             bit(8),                         01399000
*        7 CompEntryCntlEDataSerialized bit(1), /* Indicates whether    01400000
*                                                   the entry data      01401000
*                                                   was dumped          01402000
*                                                   serialized.  An     01403000
*                                                   ON setting          01404000
*                                                   indicates that      01405000
*                                                   the data was        01406000
*                                                   serialized       */ 01407000
*        7 CompEntryCntlAdjSerialized bit(1),   /* Indicates whether    01408000
*                                                   the adjunct data    01409000
*                                                   was dumped          01410000
*                                                   serialized.  An     01411000
*                                                   ON setting          01412000
*                                                   indicates that      01413000
*                                                   the data was        01414000
*                                                   serialized       */ 01415000
*        7 CompEntryCntlOnSCM bit(1),  /* Indicates whether the entry   01416000
*                                         resides in coupling facility  01417000
*                                         real storage or storage       01418000
*                                         class memory.                 01419000
*                                         0 => the entry represented    01420000
*                                         by this entry control record  01421000
*                                         resides in coupling facility  01422000
*                                         real storage.                 01423000
*                                         1 => the entry resides in     01424000
*                                         coupling facility storage     01425000
*                                         class memory. No entry        01426000
*                                         control information, adjunct  01427000
*                                         data or entry data is         01428000
*                                         returned               @L3A*/ 01429000
*        7 CompEntryCntlEDataDecryptError Bit(1),  /* ON indicates      01430000
*                                         that the structure is         01431000
*                                         encrypted and decryption of   01432000
*                                         the entry data failed  @L4A*/ 01433000
*        7 CompEntryCntlAdjDecryptError Bit(1),    /* ON indicates      01434000
*                                         that the structure is         01435000
*                                         encrypted and decryption of   01436000
*                                         the adjunct data              01437000
*                                         failed                 @L4A*/ 01438000
*        7 CompEntryCntlAdjSKey BIT, /* ON indicates that the           01439000
*                                      first 32 bytes of the adjunct    01440000
*                                      data contain the secondary key   01441000
*                                                                @04A*/ 01442000
*        7 *        BIT(2),         /* Reserved                  @04C*/ 01443000
*      5 *                             char(1),  /* Reserved         */ 01444000
*      5 CompEntryCntlEntryDataNumber  char(2),  /* Number, in EBCDIC,  01445000
*                                                   which indicates     01446000
*                                                   which entry data    01447000
*                                                   compdata space the  01448000
*                                                   pointer pertains to 01449000
*                                                                    */ 01450000
*      5 CompEntryCntlEntryDataLen     fixed(32),/* Length of the       01451000
*                                                   entry data          01452000
*                                                   associated with     01453000
*                                                   this entry       */ 01454000
*      5 CompEntryCntlAdjPtr           ptr(31),  /* Pointer to the      01455000
*                                                   entry's adjunct     01456000
*                                                   data in the         01457000
*                                                   adjunct compdata    01458000
*                                                   space            */ 01459000
*      5 *                             char(2),                         01460000
*      5 CompEntryCntlAdjNumber        char(2),  /* Number, in EBCDIC,  01461000
*                                                   which indicates     01462000
*                                                   which adjunct       01463000
*                                                   compdata space the  01464000
*                                                   pointer pertains to 01465000
*                                                                    */ 01466000
*       5 CompEntryCntlPosWthinEkey    fixed(32),/* Indicates the       01467000
*                                                   position of the     01468000
*                                                   entry within the    01469000
*                                                   entrykey it has */  01470000
*     3 CompEntryCntlInfo              char(*);  /* Control             01471000
*                                                   information for the 01472000
*                                                   current entry       01473000
*                                                   NOTE : This field   01474000
*                                                   is mapped by the    01475000
*                                                   DDil mapping in     01476000
*                                                   the IXLYDDIB macro  01477000
*                                                   if the structure is 01478000
*                                                   a list structure.   01479000
*                                                   This field is       01480000
*                                                   mapped by the DDic  01481000
*                                                   mapping in the      01482000
*                                                   IXLYDDIB macro if   01483000
*                                                   the structure is    01484000
*                                                   a cache structure.  01485000
*                                                   To obtain the       01486000
*                                                   length of this      01487000
*                                                   use the appropriate 01488000
*                                                   mappings and        01489000
*                                                   length constant in  01490000
*                                                   IXLYDDIB.        */ 01491000
*                                                                       01492000
* Dcl                                                                   01493000
*    KCompEntryCntlHdr_Len fixed(31)                                    01494000
*         Constant(Length(CompEntryCntlHdr)); /*  Length                01495000
*                                            of CompEntryCntlHdr @P1M*/ 01496000
*/********************************************************************/ 01497000
*/*                                                                  */ 01498000
*/*     Length Constants for the COMPDATA mappings                   */ 01499000
*/*                                                                  */ 01500000
*/********************************************************************/ 01501000
*                                                                       01502000
*                                                                       01503000
*/* End of PL/X Source                                               */ 01504000
* %IF IXLYCOMP_LIST ^= 'NO' &                                           01505000
*    ZCBPRINT ^= 'NO' %THEN                                             01506000
*   %GOTO IXLYCOMP_4;                                                   01507000
*   @LIST POP NOECHO;                                                   01508000
* %IXLYCOMP_4:;                                                         01509000
* %END;                                                                 01510000
