*                                                                       00001000
* %DCL IXLYRTAA_INCLUDED CHAR EXT;                                      00002000
* %DEACTIVATE IXLYRTAA_INCLUDED;                                        00003000
* %IF IXLYRTAA_INCLUDED = '' %THEN                                      00004000
* %DO;                                                                  00005000
*/* Macro made bi-lingual on 18014. CBGEN compile date 15295         */ 00006000
*% /*                                                                   00007000
         MACRO                                                          00008000
         IXLYRTAA &DSECT=YES,&LIST=YES,&TITLE=YES,&RTAA=YES,           *00009000
               &RTAA1=COND                                              00010000
         GBLC  &IXLYRTAA_INCLUDED                                       00011000
         GBLC  &ZCBPRINT                                                00012000
&IXLYRTAA_INCLUDED SETC 'YES'                                           00013000
         AIF   ('&LIST' EQ 'NONE').P0                                   00014000
         AIF   ('&TITLE' EQ 'NO').P5                                    00015000
 TITLE   'IXLYRTAA  - IXLRT answer area mapping                      '  00016000
.P5      ANOP                                                           00017000
**/ IXLYRTAA_1:;                                                        00018000
*/* START OF SPECIFICATIONS ******************************************* 00019000
*                                                                       00020000
*01* PROPRIETARY STATEMENT =                                            00021000
*                                                                       00022000
*    LICENSED MATERIALS - PROPERTY OF IBM                               00023000
*    5650-ZOS COPYRIGHT IBM CORP. 1993, 2015                            00024000
*                                                                       00025000
*01* STATUS = HBB77A0                                                   00026000
*                                                                       00027000
*01* END OF PROPRIETARY STATEMENT                                       00028000
*                                                                       00029000
*02* ACRONYM:  RTAA                                                     00030000
*                                                                       00031000
*01* DESCRIPTIVE NAME:  IXLRT answer area mapping                       00032000
*                                                                       00033000
*01* MACRO NAME: IXLYRTAA                                               00034000
*                                                                       00035000
*01* DSECT NAME:                                                        00036000
*     RTAA                                                              00037000
*     RTAA1                                                             00038000
*                                                                       00039000
*01* COMPONENT:  Cross System Extended Services (SCIXL)                 00040000
*                                                                       00041000
*01* EYE-CATCHER:  NONE                                                 00042000
*                                                                       00043000
*01* STORAGE ATTRIBUTES:                                                00044000
*02*  SUBPOOL:  User-supplied                                           00045000
*02*  KEY:  User-supplied                                               00046000
*02*  RESIDENCY:  User-supplied                                         00047000
*                                                                       00048000
*01* SIZE:  80 bytes                                                    00049000
*            RTAA  -- X'0018' bytes                                     00050000
*            RTAA1 -- X'0050' bytes                                     00051000
*01*           RTAA -- X'0018' bytes                                    00052000
*              RTAA1 -- X'0050' bytes                                   00053000
*              RTAAHEADER -- X'00C'                                     00054000
*              RTAADATA   -- X'00C'                                     00055000
*                                                                       00056000
*01* CREATED BY: Issuer of IXLRT macro                                  00057000
*                                                                       00058000
*01* POINTED TO BY:                                                     00059000
*     ANSAREA_ADDR in the parameter list points to the RTAA             00060000
*                                                                       00061000
*01* SERIALIZATION:                                                     00062000
*     None required                                                     00063000
*                                                                       00064000
*01* FUNCTION:  Maps the data returned by IXLRT macro invocation        00065000
*                                                                       00066000
*01* EXTERNAL CLASSIFICATION: GUPI                                      00067000
*01* END OF EXTERNAL CLASSIFICATION:                                    00068000
*                                                                       00069000
*01* METHOD OF ACCESS:                                                  00070000
*02*  ASM: IXLYRTAA USING on RTAA                                       00071000
*                                                                       00072000
*02*  PLAS: Set macro variable RTAA_ALET                                00073000
*02*        %INCLUDE SYSLIB(IXLYRTAA)                                   00074000
*                                                                       00075000
*01* DELETED BY:  User                                                  00076000
*                                                                       00077000
*01* FREQUENCY:  Created by user for response to IXLRT macro            00078000
*                                                                       00079000
*01* DEPENDENCIES: None                                                 00080000
*                                                                       00081000
*01* DISTRIBUTION LIBRARY: AMACLIB                                      00082000
*                                                                       00083000
*01* CHANGE ACTIVITY:                                                   00084000
*     $L0=SYSLKSRQ HBB5510 900112 PD00T8:  XES                          00085000
*     $L1=SYSLKSRQ HBB5510 920815 PD00EO: Remove list refs per spec rev 00086000
*     $P1=PIG5178  HBB5510 940314 PD00EO: Performance                   00087000
*     $L2=ADUPLX   HBB77A0 141030 PD0JES: Asynch duplexing              00088000
*                                                                       00089000
* NOTES: This control block must start on a word boundary.              00090000
*                                                                       00091000
*                                                                       00092000
*END OF SPECIFICATIONS ***********************************************/ 00093000
*% /*                                                                   00094000
.P0      ANOP                                                           00095000
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 00096000
         AIF   ('&LIST' EQ 'YES').P2                                    00097000
.P1      ANOP                                                           00098000
         PUSH  PRINT                                                    00099000
         PRINT OFF                                                      00100000
.P2      ANOP                                                           00101000
         AIF   ('&RTAA' EQ 'NO').L0002                                  00102000
         AIF   ('&DSECT' EQ 'YES').L0003                                00103000
         AIF   ('&RTAA' NE 'YES').L0002                                 00104000
RTAA     DS    0F        IXLRT Answer Area                              00105000
         AGO   .L0004                                                   00106000
.L0003   ANOP                                                           00107000
RTAA     DSECT           IXLRT Answer Area                              00108000
.L0004   ANOP                                                           00109000
RTAAHEADER DS  0CL12     Header                                         00110000
RTAALEVEL DS   F         Macro level of this version of the IXLYRTAA   *00111000
                         macro                                          00112000
RTAAOFFSET DS  F         Offset from the beginning of the structure    *00113000
                         (Rtaa) to the answer area data (RtaaData)      00114000
RTAALENGTH DS  F         Length of the answer area data                 00115000
RTAADATA DS    0CL12     IXLRT answer area data                         00116000
RTAATOTALCOUNT DS F      Total Count of record data entries allocated  *00117000
                         for the structure. Returned on CREATENTRY,    *00118000
                         READENTRY, UPDATENTRY, and DELETENTRY         *00119000
                         requests.                                      00120000
RTAACONNCOUNT DS 0F      Count of record data entries associated with  *00121000
                         the target connector. Returned on CREATENTRY, *00122000
                         READENTRY, UPDATENTRY, and DELETENTRY         *00123000
                         requests.                                      00124000
RTAAREADCNT DS 0F        Count of entries read for a READALL or        *00125000
                         READBYCONN request                             00126000
RTAADELCNT DS  F         Count of entries deleted for DELETENTRYLIST   *00127000
                         or DELETEBYCONN requests. For DELETEBYCONN,   *00128000
                         this count may be only substantially          *00129000
                         accurate.                                      00130000
RTAAFAILINDEX DS F       Index into the list of entry identifiers      *00131000
                         supplied on a DELETENTRYLIST request          *00132000
                         indicating a record data entry which does not *00133000
                         exist, or is an invalid index, or index of    *00134000
                         first unprocessed entry when the              *00135000
                         DELETENTRYLIST request completed prematurely   00136000
RTAA_LEN EQU   *-RTAA                                                   00137000
.L0002   ANOP                                                           00138000
         AIF   ('&RTAA1' EQ 'NO').L0005                                 00139000
         AIF   ('&DSECT' EQ 'YES').L0006                                00140000
         AIF   ('&RTAA1' NE 'YES').L0005                                00141000
RTAA1    DS    0D        IXLRT Answer Area level 1                      00142000
         AGO   .L0007                                                   00143000
.L0006   ANOP                                                           00144000
RTAA1    DSECT           IXLRT Answer Area level 1                      00145000
.L0007   ANOP                                                           00146000
         DS    CL24      Mapped by RTAA                                 00147000
RTAA1DATA DS   0CL56     Level 1 answer area data                       00148000
RTAA1ADUPREQSEQNUM DS CL16 Asynchronous duplexing request sequence     *00149000
                         number assigned to the request if one was     *00150000
                         generated. Otherwise this field contains      *00151000
                         zero. See the ADupReqSeqNum keyword on the    *00152000
                         IXLLOCK macro for more information.            00153000
         DS    CL40      Reserved                                       00154000
RTAA_LEVEL# EQU 1        Latest macro level number                      00155000
RTAA_LEVEL0 EQU 0        Macro Level Number                             00156000
RTAA_LEVEL1 EQU 1        Macro Level Number                             00157000
RTAALEVEL0LEN EQU 24     Length of base RTAA (level 0)                  00158000
RTAALEVEL1LEN EQU 80     Length of RTAA1 (level 1)                      00159000
RTAA1_LEN EQU  *-RTAA1                                                  00160000
.L0005   ANOP                                                           00161000
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 00162000
         AIF   ('&LIST' EQ 'YES').P4                                    00163000
.P3      ANOP                                                           00164000
         POP   PRINT                                                    00165000
.P4      ANOP                                                           00166000
.P_EXIT  ANOP                                                           00167000
         MEND                                                           00168000
**/ IXLYRTAA_2:;                                                        00169000
* %IXLYRTAA_INCLUDED = 'YES';                                           00170000
* %DCL ZCBPRINT CHAR EXT;                                               00171000
* %DEACTIVATE ZCBPRINT;                                                 00172000
* %DCL IXLYRTAA_LIST CHAR EXT;                                          00173000
* %DEACTIVATE IXLYRTAA_LIST;                                            00174000
* %IF IXLYRTAA_LIST ^= 'NO' &                                           00175000
*    ZCBPRINT ^= 'NO' %THEN                                             00176000
*   %GOTO IXLYRTAA_3;                                                   00177000
*   @LIST PUSH NOECHO;                                                  00178000
*   @LIST NOASSEMBLE NOECHO;                                            00179000
*   @LIST OFF C NOECHO;                                                 00180000
* %IXLYRTAA_3:;                                                         00181000
*/* Start of PL/X Source                                             */ 00182000
* %      /*                                                             00183000
* */ IXLYRTAA20: ;                                                      00184000
*  %IF RTAA_ALET = '' %THEN                                             00185000
*    %RTAA_ALET = '0';                                                  00186000
*  %RTAA_VIA = '';                                                      00187000
*  %IF RTAA_ALET ^= '0' %THEN                                           00188000
*    %RTAA_VIA = 'VIA(RTAA_ALET)';                                      00189000
* DCL 1 RTAA Based Rtaa_Via Bdy(Word),  /* IXLRT Answer Area         */ 00190000
*       2 RtaaHeader,             /* Header                          */ 00191000
*         3 RtaaLevel  FIXED(32), /* Macro level of this version of     00192000
*                                    the IXLYRTAA macro              */ 00193000
*         3 RtaaOffset FIXED(32), /* Offset from the beginning of the   00194000
*                                    structure (Rtaa) to the answer     00195000
*                                    area data (RtaaData)            */ 00196000
*         3 RtaaLength FIXED(32), /* Length of the answer area data  */ 00197000
*       2 RtaaData,               /* IXLRT answer area data          */ 00198000
*         3 RtaaTotalCount Fixed(32), /* Total Count of record data     00199000
*                                        entries allocated for the      00200000
*                                        structure.  Returned on        00201000
*                                        CREATENTRY, READENTRY,         00202000
*                                        UPDATENTRY, and DELETENTRY     00203000
*                                        requests.                   */ 00204000
*         3 RtaaConnCount Fixed(32),  /* Count of record data entries   00205000
*                                        associated with the target     00206000
*                                        connector.  Returned on        00207000
*                                        CREATENTRY, READENTRY,         00208000
*                                        UPDATENTRY, and DELETENTRY     00209000
*                                        requests.                   */ 00210000
*           5 RtaaReadCnt Fixed(32), /* Count of entries read for       00211000
*                                        a READALL or READBYCONN        00212000
*                                        request                 @P1C*/ 00213000
*             7 RtaaDelCnt Fixed(32), /* Count of entries deleted for   00214000
*                                        DELETENTRYLIST or              00215000
*                                        DELETEBYCONN requests.  For    00216000
*                                        DELETEBYCONN, this count may   00217000
*                                        be only substantially          00218000
*                                        accurate.               @L2C*/ 00219000
*         3 RtaaFailIndex Fixed(32),  /* Index into the list of entry   00220000
*                                        identifiers supplied on a      00221000
*                                        DELETENTRYLIST request         00222000
*                                        indicating a record data entry 00223000
*                                        which does not exist,          00224000
*                                        or is an invalid index,        00225000
*                                        or index of first unprocessed  00226000
*                                        entry when the DELETENTRYLIST  00227000
*                                        request completed prematurely  00228000
*                                                                    */ 00229000
*       2 * CHAR(0);              /*                                 */ 00230000
*                                                                       00231000
* DCL 1 RTAA1 Based Rtaa_Via Bdy(Dword), /* IXLRT Answer Area level 1   00232000
*                                                                @L2A*/ 00233000
*         3 * Char(Length(RTAA)),   /* Mapped by RTAA            @L2A*/ 00234000
*       2 Rtaa1Data,                /* Level 1 answer area data  @L2A*/ 00235000
*         3 Rtaa1ADupReqSeqNum Char(16), /* Asynchronous duplexing      00236000
*                                      request sequence number assigned 00237000
*                                      to the request if one was        00238000
*                                      generated. Otherwise this field  00239000
*                                      contains zero. See the           00240000
*                                      ADupReqSeqNum keyword on the     00241000
*                                      IXLLOCK macro for more           00242000
*                                      information.              @L2A*/ 00243000
*         3 * Char(40),             /* Reserved                  @L2A*/ 00244000
*       2 * CHAR(0);                /* End of IXLRT Answer Area level   00245000
*                                      1                         @L2A*/ 00246000
*                                                                       00247000
* DCL Rtaa_Level# FIXED(31) Constant(1); /* Latest macro level          00248000
*                                      number                        */ 00249000
* DCL Rtaa_Level0 FIXED(31) Constant(0); /* Macro Level Number   @L2A*/ 00250000
* DCL Rtaa_Level1 FIXED(31) Constant(1); /* Macro Level Number   @L2A*/ 00251000
*                                                                       00252000
* Dcl RtaaLevel0Len Fixed(31) Constant(Length(RTAA)); /* Length of      00253000
*                                      base RTAA (level 0)       @L2A*/ 00254000
* Dcl RtaaLevel1Len Fixed(31) Constant(Length(RTAA1)); /* Length of     00255000
*                                      RTAA1 (level 1)           @L2A*/ 00256000
*                                                                       00257000
*/* End of PL/X Source                                               */ 00258000
* %IF IXLYRTAA_LIST ^= 'NO' &                                           00259000
*    ZCBPRINT ^= 'NO' %THEN                                             00260000
*   %GOTO IXLYRTAA_4;                                                   00261000
*   @LIST POP NOECHO;                                                   00262000
* %IXLYRTAA_4:;                                                         00263000
* %END;                                                                 00264000
