*                                                                       00001000
* %DCL IXLYCCIH_INCLUDED CHAR EXT;                                      00002000
* %DEACTIVATE IXLYCCIH_INCLUDED;                                        00003000
* %IF IXLYCCIH_INCLUDED = '' %THEN                                      00004000
* %DO;                                                                  00005000
*/* Macro made bi-lingual on 18014. CBGEN compile date 15295         */ 00006000
*% /*                                                                   00007000
         MACRO                                                          00008000
         IXLYCCIH &DSECT=YES,&LIST=YES,&TITLE=YES,&CCIH=YES,           *00009000
               &CCIHCOSTATSLIST=COND,&CCIHCOUNTS=COND,&CCIHCCIBS=COND   00010000
         GBLC  &IXLYCCIH_INCLUDED                                       00011000
         GBLC  &ZCBPRINT                                                00012000
&IXLYCCIH_INCLUDED SETC 'YES'                                           00013000
         AIF   ('&LIST' EQ 'NONE').P0                                   00014000
         AIF   ('&TITLE' EQ 'NO').P5                                    00015000
 TITLE   'IXLYCCIH  - Castout Class Information Header                '*00016000
                                                                        00017000
.P5      ANOP                                                           00018000
**/ IXLYCCIH_1:;                                                        00019000
*/* START OF SPECIFICATIONS ******************************************* 00020000
*                                                                       00021000
*01* SECURITY:                                                          00022000
*                                                                       00023000
* ***PROPRIETARY_STATEMENT********************************************* 00024000
***01* PROPRIETARY STATEMENT=                                         * 00025000
*                                                                     * 00026000
*       LICENSED MATERIALS - PROPERTY OF IBM                          * 00027000
*       5645-001 COPYRIGHT IBM CORP. 1993 1997                        * 00028000
*                                                                     * 00029000
*      STATUS = HBB6603                                               * 00030000
*                                                                     * 00031000
*  **END_OF_PROPRIETARY_STATEMENT************************************** 00032000
*                                                                       00033000
*02* ACRONYM:  CCIH                                                     00034000
*                                                                       00035000
*01* DESCRIPTIVE NAME: Castout Class Information Header                 00036000
*                                                                       00037000
*01* MACRO NAME: IXLYCCIH                                               00038000
*                                                                       00039000
*01* DSECT NAME: CCIH                                                   00040000
*                                                                       00041000
*01* COMPONENT:  Cross System Extended Services (SCIXL)                 00042000
*                                                                       00043000
*01* EYE-CATCHER:  NONE                                                 00044000
*                                                                       00045000
*01* STORAGE ATTRIBUTES:                                                00046000
*02*  SUBPOOL:  User supplied                                           00047000
*02*  KEY:  User supplied                                               00048000
*02*  RESIDENCY:  User supplied                                         00049000
*                                                                       00050000
*01* SIZE:                                                              00051000
*            CCIHCOSTATSLIST -- X'0020' bytes                           00052000
*            CCIH1      -- X'0020' bytes                                00053000
*            CCIHCOUNTS      -- X'0004' bytes                           00054000
*            CCIHCCIBS       -- X'0020' bytes                           00055000
*            CCIH            -- X'0004' bytes                           00056000
*            COUNTS -- X'0004' bytes                                    00057000
*            CCIBS  -- X'0020' bytes                                    00058000
*                                                                       00059000
*01* CREATED BY:  - Storage area created by IXLCACHE invoker            00060000
*                 - CCIH data created by IXLCACHE service routine       00061000
*                                                                       00062000
*01* POINTED TO BY:  BUFFER or BUFLIST parameter on IXLCACHE            00063000
*                                                                       00064000
*01* SERIALIZATION:                                                     00065000
*     See BUFFER and BUFLIST parameter requirements on the              00066000
*     IXLCACHE interface description.                                   00067000
*                                                                       00068000
*01* FUNCTION:                                                          00069000
*02*  The CCIH contains request-level information returned in the data  00070000
*     area from a IXLCACHE READ_COSTATS request.  For each castout      00071000
*     class,  the information returned consists of the number of data   00072000
*     elements that are associated with entries in the indicated        00073000
*     castout class. For structures which are allocated in a CFLEVEL=5  00074000
*     or higher coupling facility it will also contain the user data    00075000
*     field of the first entry if CoStatsFmt=COSTATSLIST is specified   00076000
*     on the request.                                                   00077000
*                                                                       00078000
*01* EXTERNAL CLASSIFICATION: GUPI                                      00079000
*01* END OF EXTERNAL CLASSIFICATION:                                    00080000
*                                                                       00081000
*01* METHOD OF ACCESS:                                                  00082000
*02*  ASM:   IXLYCCIH USING on CCIH                                     00083000
*                                                                       00084000
*02*  PL/AS: %DCL CCIH_DCL_ATTR CHAR                                    00085000
*            %CCIH_DCL_ATTR = 'based/defined/via attribtues'            00086000
*            %INCLUDE SYSLIB(IXLYCCIH)                                  00087000
*                                                                       00088000
*            If CCIH_DCL_ATTR is not set the CCIH will be               00089000
*            declared as BASED.                                         00090000
*                                                                       00091000
*01* DELETED BY:  Invoker of IXLCACHE.                                  00092000
*                                                                       00093000
*01* FREQUENCY:  One per IXLCACHE READ_COSTATS                          00094000
*                                                                       00095000
*01* DEPENDENCIES:  See BUFFER and BUFLIST parameter requirements       00096000
*                   on the IXLCACHE interface description.              00097000
*                                                                       00098000
*01* DISTRIBUTION LIBRARY: AMACLIB                                      00099000
*                                                                       00100000
*01* CHANGE ACTIVITY:                                                   00101000
*     $L0=SYSLKSRQ HBB5510 910311 PD00K1:  XES support                  00102000
*     $P1=PIG5158  HBB5510 940211 PD00FR:  Castout class count defn     00103000
*     $01=OW28460  HBB6603 970801 PD00GW:  User managed duplexing       00104000
*     $P2=PVT0195  HBB6603 971215 PD00XM:  UDF order queue support      00105000
*                                                                       00106000
* NOTES: This control block must start on a word boundary.              00107000
*                                                                       00108000
*     ALLOCATION-METHOD:  Specific to IXLCACHE invoker.                 00109000
*                         See BUFFER and BUFLIST parameter requirements 00110000
*                         on the IXLCACHE interface description.        00111000
*                                                                       00112000
*END OF SPECIFICATIONS ***********************************************/ 00113000
*% /*                                                                   00114000
.P0      ANOP                                                           00115000
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 00116000
         AIF   ('&LIST' EQ 'YES').P2                                    00117000
.P1      ANOP                                                           00118000
         PUSH  PRINT                                                    00119000
         PRINT OFF                                                      00120000
.P2      ANOP                                                           00121000
         AIF   ('&CCIH' EQ 'NO').L0002                                  00122000
         AIF   ('&DSECT' EQ 'YES').L0003                                00123000
         AIF   ('&CCIH' NE 'YES').L0002                                 00124000
CCIH     DS    0F        Castout Class Information Header               00125000
         AGO   .L0004                                                   00126000
.L0003   ANOP                                                           00127000
CCIH     DSECT           Castout Class Information Header               00128000
.L0004   ANOP                                                           00129000
CCIHCOCLASSBEG DS H      First castout class in the range of castout   *00130000
                         classes processed                              00131000
CCIHCOCLASSEND DS H      Last castout class in the range of castout    *00132000
                         classes processed                              00133000
CCIHCOUNTSDATA DS 0C     Beginning of data fields                       00134000
CCIHEND  DS    0C        End of CCIH                                    00135000
CCIH_LEN EQU   *-CCIH                                                   00136000
.L0002   ANOP                                                           00137000
         AIF   ('&CCIHCOSTATSLIST' EQ 'NO').L0005                       00138000
         AIF   ('&DSECT' EQ 'YES').L0006                                00139000
         AIF   ('&CCIHCOSTATSLIST' NE 'YES').L0005                      00140000
CCIHCOSTATSLIST DS 0F    Castout class Information mapping for         *00141000
                         addressing CcihCcibs data mapping              00142000
         AGO   .L0007                                                   00143000
.L0006   ANOP                                                           00144000
CCIHCOSTATSLIST DSECT    Castout class Information mapping for         *00145000
                         addressing CcihCcibs data mapping              00146000
.L0007   ANOP                                                           00147000
         DS    CL32      Reserved                                       00148000
CCIHCCIBSDATA DS 0C      Beginning of data fields                       00149000
CCIHCOSTATSLISTEND DS 0C End of CcihCoStatsList                         00150000
CCIHCOSTATSLIST_LEN EQU *-CCIHCOSTATSLIST                               00151000
.L0005   ANOP                                                           00152000
         AIF   ('&CCIHCOUNTS' EQ 'NO').L0008                            00153000
         AIF   ('&DSECT' EQ 'YES').L0009                                00154000
         AIF   ('&CCIHCOUNTS' NE 'YES').L0008                           00155000
.L0009   ANOP                                                           00156000
*                                                                       00157000
*   CcihCounts maps the castout class count field. For structures       00158000
*   allocated in a CFLEVEL=4 or lower coupling facility and for         00159000
*   structures allocated in a CFLEVEL=5 or higher coupling facility     00160000
*   when CoStatsFmt=COCOUNTSLIST is either specified or selected by     00161000
*   default, CcihCounts maps the castout counts returned. CcihCounts    00162000
*   should be based on the address of CcihCountsData for the first      00163000
*   castout class count field.                                          00164000
*                                                                       00165000
*                                                                       00166000
         AIF   ('&DSECT' EQ 'YES').L000A                                00167000
CCIHCOUNTS DS  0F        Map the castout class count fields.            00168000
         AGO   .L000B                                                   00169000
.L000A   ANOP                                                           00170000
CCIHCOUNTS DSECT         Map the castout class count fields.            00171000
.L000B   ANOP                                                           00172000
CCIHCOUNTSCASTOUTCLASSCOUNT DS F Castout class count of data elements.  00173000
CCIHCOUNTS_LEN EQU *-CCIHCOUNTS                                         00174000
.L0008   ANOP                                                           00175000
         AIF   ('&CCIHCCIBS' EQ 'NO').L000C                             00176000
         AIF   ('&DSECT' EQ 'YES').L000D                                00177000
         AIF   ('&CCIHCCIBS' NE 'YES').L000C                            00178000
.L000D   ANOP                                                           00179000
*                                                                       00180000
*   CcihCCibs maps the castout class count field and the user data      00181000
*   of the first entry in each castout class. This mapping is only      00182000
*   valid for structures which are allocated in a CFLEVEL=5 or higher   00183000
*   coupling facility when COSTATS=COSTATSLIST is specified. CcihCcibs  00184000
*   should be based on the address of CcihCCibsData to map the data     00185000
*   for the first castout class in your buffer.                         00186000
*                                                                       00187000
*                                                                       00188000
         AIF   ('&DSECT' EQ 'YES').L000E                                00189000
CCIHCCIBS DS   0F                                                       00190000
         AGO   .L000F                                                   00191000
.L000E   ANOP                                                           00192000
CCIHCCIBS DSECT                                                         00193000
.L000F   ANOP                                                           00194000
CCIHCCIB DS    0CL32                                                    00195000
CCIHCCIBCOUNT DS F       Castout class count of data elements           00196000
         DS    CL4                                                      00197000
CCIHCCIBUSERDATA DS CL8  For a structure allocated with a UDF (user    *00198000
                         data field) order queue for each castout      *00199000
                         class, this field contains the user data of   *00200000
                         the first entry on the UDF order queue. For a *00201000
                         structure allocated without a UDF order       *00202000
                         queue, this field contains the user data of   *00203000
                         the first entry on the castout class queue.    00204000
         DS    CL16                                                     00205000
CCIHCCIBS_LEN EQU *-CCIHCCIBS                                           00206000
.L000C   ANOP                                                           00207000
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 00208000
         AIF   ('&LIST' EQ 'YES').P4                                    00209000
.P3      ANOP                                                           00210000
         POP   PRINT                                                    00211000
.P4      ANOP                                                           00212000
.P_EXIT  ANOP                                                           00213000
         MEND                                                           00214000
**/ IXLYCCIH_2:;                                                        00215000
* %IXLYCCIH_INCLUDED = 'YES';                                           00216000
* %DCL ZCBPRINT CHAR EXT;                                               00217000
* %DEACTIVATE ZCBPRINT;                                                 00218000
* %DCL IXLYCCIH_LIST CHAR EXT;                                          00219000
* %DEACTIVATE IXLYCCIH_LIST;                                            00220000
* %IF IXLYCCIH_LIST ^= 'NO' &                                           00221000
*    ZCBPRINT ^= 'NO' %THEN                                             00222000
*   %GOTO IXLYCCIH_3;                                                   00223000
*   @LIST PUSH NOECHO;                                                  00224000
*   @LIST NOASSEMBLE NOECHO;                                            00225000
*   @LIST OFF C NOECHO;                                                 00226000
* %IXLYCCIH_3:;                                                         00227000
*/* Start of PL/X Source                                             */ 00228000
*                                                                       00229000
* %If Ccih_Dcl_Attr = '' %Then                                          00230000
*   %Ccih_Dcl_Attr = 'Based';                                           00231000
*                                                                       00232000
* DCL 1 Ccih Ccih_Dcl_Attr BDY(WORD), /* Castout Class Information      00233000
*                                   Header                           */ 00234000
*       3 CcihCoClassBeg FIXED(16),/* First castout class in the range  00235000
*                                   of castout classes processed     */ 00236000
*       3 CcihCoClassEnd FIXED(16),/* Last castout class in the range   00237000
*                                   of castout classes processed     */ 00238000
*       3 CcihCountsData CHAR(0),  /* Beginning of data fields   @01A*/ 00239000
*       3 CcihEnd CHAR(0);         /* End of CCIH                    */ 00240000
*                                                                       00241000
* DCL 1 CcihCoStatsList Ccih_Dcl_Attr BDY(WORD),  /* Castout class      00242000
*                                   Information mapping for addressing  00243000
*                                   CcihCcibs data mapping       @01A*/ 00244000
*       3 * Char(32),              /* Reserved                   @01A*/ 00245000
*       3 CcihCCibsData CHAR(0),   /* Beginning of data fields   @01A*/ 00246000
*       3 CcihCoStatsListEnd CHAR(0);  /* End of CcihCoStatsList @01A*/ 00247000
*                                                                       00248000
* %Deactivate Ccih_Dcl_Attr;                                            00249000
*                                                                       00250000
*/* CcihCounts maps the castout class count field. For structures       00251000
*   allocated in a CFLEVEL=4 or lower coupling facility and for         00252000
*   structures allocated in a CFLEVEL=5 or higher coupling facility     00253000
*   when CoStatsFmt=COCOUNTSLIST is either specified or selected by     00254000
*   default, CcihCounts maps the castout counts returned. CcihCounts    00255000
*   should be based on the address of CcihCountsData for the first      00256000
*   castout class count field.                                   @01A*/ 00257000
*                                                                       00258000
* Dcl 1 CcihCounts  Based,             /* Map the castout class         00259000
*                                         count fields.          @01A*/ 00260000
*       2 CcihCountsCastoutClassCount(*) fixed(32); /* Castout class    00261000
*                                         count of data elements.       00262000
*                                                                @01A*/ 00263000
*                                                                       00264000
*/* CcihCCibs maps the castout class count field and the user data      00265000
*   of the first entry in each castout class. This mapping is only      00266000
*   valid for structures which are allocated in a CFLEVEL=5 or higher   00267000
*   coupling facility when COSTATS=COSTATSLIST is specified. CcihCcibs  00268000
*   should be based on the address of CcihCCibsData to map the data     00269000
*   for the first castout class in your buffer.                  @01A*/ 00270000
*                                                                       00271000
* Dcl 1 CcihCCibs based BDY(Word),                                      00272000
*      3 CcihCCib(*),                                                   00273000
*       5 CcihCCibCount fixed(32),     /* Castout class count           00274000
*                                         of data elements       @01A*/ 00275000
*       5 * char(4),                                                    00276000
*       5 CcihCCibUserData Char(8),    /* For a structure allocated     00277000
*                                         with a UDF (user data field)  00278000
*                                         order queue for each          00279000
*                                         castout class, this field     00280000
*                                         contains the user data of     00281000
*                                         the first entry on the        00282000
*                                         UDF order queue.              00283000
*                                         For a structure allocated     00284000
*                                         without a UDF order queue,    00285000
*                                         this field contains the       00286000
*                                         user data of the first        00287000
*                                         entry on the castout          00288000
*                                         class queue.           @P2C*/ 00289000
*       5 * char(16);                                                   00290000
*                                                                       00291000
*                                                                       00292000
*                                                                       00293000
*                                                                       00294000
*                                                                       00295000
*/* End of PL/X Source                                               */ 00296000
* %IF IXLYCCIH_LIST ^= 'NO' &                                           00297000
*    ZCBPRINT ^= 'NO' %THEN                                             00298000
*   %GOTO IXLYCCIH_4;                                                   00299000
*   @LIST POP NOECHO;                                                   00300000
* %IXLYCCIH_4:;                                                         00301000
* %END;                                                                 00302000
