*                                                                       00001000
* %DCL IXLYDEIB_INCLUDED CHAR EXT;                                      00002000
* %DEACTIVATE IXLYDEIB_INCLUDED;                                        00003000
* %IF IXLYDEIB_INCLUDED = '' %THEN                                      00004000
* %DO;                                                                  00005000
*/* Macro made bi-lingual on 18014. CBGEN compile date 15295         */ 00006000
*% /*                                                                   00007000
         MACRO                                                          00008000
         IXLYDEIB &DSECT=YES,&LIST=YES,&TITLE=YES,&DEIB=YES             00009000
         GBLC  &IXLYDEIB_INCLUDED                                       00010000
         GBLC  &ZCBPRINT                                                00011000
&IXLYDEIB_INCLUDED SETC 'YES'                                           00012000
         AIF   ('&LIST' EQ 'NONE').P0                                   00013000
         AIF   ('&TITLE' EQ 'NO').P5                                    00014000
 TITLE   'IXLYDEIB  - Directory Entry Information Block - DEIB        '*00015000
                                                                        00016000
.P5      ANOP                                                           00017000
**/ IXLYDEIB_1:;                                                        00018000
*/* START OF SPECIFICATIONS ******************************************* 00019000
*                                                                       00020000
*01* SECURITY:                                                          00021000
*                                                                       00022000
* ***PROPRIETARY_STATEMENT********************************************* 00023000
***01* PROPRIETARY STATEMENT=                                         * 00024000
*                                                                     * 00025000
*    LICENSED MATERIALS - PROPERTY OF IBM                             * 00026000
*    5645-001 COPYRIGHT IBM CORP. 1993 1997                           * 00027000
*                                                                     * 00028000
*   STATUS = HBB6603                                                  * 00029000
*                                                                     * 00030000
*  **END_OF_PROPRIETARY_STATEMENT************************************** 00031000
*                                                                       00032000
*02* ACRONYM:  DEIB                                                     00033000
*                                                                       00034000
*01* DESCRIPTIVE NAME: Directory Entry Information Block - DEIB         00035000
*                                                                       00036000
*01* MACRO NAME:  IXLYDEIB                                              00037000
*                                                                       00038000
*01* DSECT NAME:  DEIB                                                  00039000
*                                                                       00040000
*01* COMPONENT:  Cross System Extended Services (SCIXL)                 00041000
*                                                                       00042000
*01* EYE-CATCHER:  NONE                                                 00043000
*                                                                       00044000
*01* STORAGE ATTRIBUTES:                                                00045000
*02*  SUBPOOL:  User supplied                                           00046000
*02*  KEY:  User supplied                                               00047000
*02*  RESIDENCY:  User supplied                                         00048000
*                                                                       00049000
*01* SIZE:                                                              00050000
*            DEIB -- X'0080' bytes                                      00051000
*                                                                       00052000
*01* CREATED BY:  - Storage area created by IXLCACHE invoker            00053000
*                 - DEIB data created by IXLCACHE service routine       00054000
*                                                                       00055000
*01* POINTED TO BY:  BUFFER or BUFLIST paramter on IXLCACHE             00056000
*                                                                       00057000
*01* SERIALIZATION:  See BUFFER and BUFLIST parameter requirements      00058000
*                    on the IXLCACHE interface description.             00059000
*                                                                       00060000
*01* FUNCTION:                                                          00061000
*02*  The DEIB maps the information returned for a single cache         00062000
*     structure directory entry returned on some IXLCACHE macro         00063000
*     requests.                                                         00064000
*                                                                       00065000
*01* EXTERNAL CLASSIFICATION: GUPI                                      00066000
*01* END OF EXTERNAL CLASSIFICATION:                                    00067000
*                                                                       00068000
*01* METHOD OF ACCESS:                                                  00069000
*02*  ASM:     USING on DEIB                                            00070000
*                                                                       00071000
*02*  PL/AS:   %DCL DEIB_DCL_ATTR CHAR                                  00072000
*              %DEIB_DCL_ATTR = 'based/defined/via attributes'          00073000
*              %INCLUDE SYSLIB(IXLYDEIB)                                00074000
*                                                                       00075000
*              If DEIB_DCL_ATTR is not set the DEIB will be             00076000
*              declared as BASED.                                       00077000
*                                                                       00078000
*01* DELETED BY:  Invoker of IXLCACHE.                                  00079000
*                                                                       00080000
*01* FREQUENCY:  One per cache structure directory entry returned on    00081000
*                IXLCACHE requests.                                     00082000
*                                                                       00083000
*01* DEPENDENCIES:  See BUFFER and BUFLIST parameter requirements       00084000
*                   on the IXLCACHE interface description.              00085000
*                                                                       00086000
*01* DISTRIBUTION LIBRARY:  AMACLIB                                     00087000
*                                                                       00088000
*01* CHANGE ACTIVITY:                                                   00089000
*     $L0=SYSLKSRQ HBB5510 910311 PD00K1:  XES support                  00090000
*     $D1=DIG0129  HBB5510 930520 PD00FR:  Architecture upgrade         00091000
*     $01=OW28460  HBB6603 970801 PD00GW:  User managed duplexing       00092000
*                                                                       00093000
* NOTES: This control block must start on a word boundary.              00094000
*                                                                       00095000
*     ALLOCATION-METHOD:  Specific to IXLCACHE invoker.                 00096000
*                         See BUFFER and BUFLIST parameter requirements 00097000
*                         on the IXLCACHE interface description.        00098000
*                                                                       00099000
*END OF SPECIFICATIONS ***********************************************/ 00100000
*% /*                                                                   00101000
.P0      ANOP                                                           00102000
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 00103000
         AIF   ('&LIST' EQ 'YES').P2                                    00104000
.P1      ANOP                                                           00105000
         PUSH  PRINT                                                    00106000
         PRINT OFF                                                      00107000
.P2      ANOP                                                           00108000
         AIF   ('&DEIB' EQ 'NO').L0002                                  00109000
         AIF   ('&DSECT' EQ 'YES').L0003                                00110000
         AIF   ('&DEIB' NE 'YES').L0002                                 00111000
DEIB     DS    0F        Directory Entry Information Block              00112000
         AGO   .L0004                                                   00113000
.L0003   ANOP                                                           00114000
DEIB     DSECT           Directory Entry Information Block              00115000
.L0004   ANOP                                                           00116000
DEIBNAME DS    CL16      Name of the structure entry for which this    *00117000
                         Deib contains directory information.           00118000
DEIBUSERDATA DS CL8      Directory entry user data field.               00119000
DEIBSTGCLASS DS X        Storage class associated with the entry.       00120000
DEIBBYTEA DS   0B        Bit level directory entry fields.              00121000
DEIBCHANGED EQU X'80'    Entry changed bit. 1 ==> any cached subsystem *00122000
                         data is changed. 0 ==> any cached subsystem   *00123000
                         data is unchanged.                             00124000
DEIBCACHED EQU X'40'     Data-cached indicator. 1 ==> subsystem data   *00125000
                         is cached for the entry. 0 ==> no subsystem   *00126000
                         data is cached, e.g. only a directory entry   *00127000
                         is allocated for the name.                     00128000
DEIBPARITY EQU X'30'     Parity associated with the entry.              00129000
DEIBCOLOCKSTATE EQU X'0C' Castout lock state. Values are declared      *00130000
                         below.                                         00131000
         ORG   DEIBBYTEA+1                                              00132000
DEIBCOCLASS DS H         Castout class associated with the entry.       00133000
DEIBCOLOCKVAL DS CL2     Contents of the castout lock for the entry.   *00134000
                         (First byte is the connection ID, second byte *00135000
                         is the process ID.)                            00136000
         DS    CL1       Reserved                                       00137000
DEIBELEMNUM DS X         Cache entry size expressed as the number of   *00138000
                         elements in the entry                          00139000
DEIBLCINTEREST DS CL32   Bit string identifying which connected users  *00140000
                         have registered interest in the entry. The    *00141000
                         relative position of a bit in the string      *00142000
                         associates it with a connection ID. 1 ==> the *00143000
                         associated connection has registered interest *00144000
                         in the entry. 0 ==> the connection does not   *00145000
                         have registered interest in the entry. Bit 0  *00146000
                         in this string will always be zero.            00147000
         DS    CL8       Reserved                                       00148000
DEIBVERSION DS CL8       Cache entry version number. Valid only for    *00149000
                         structures allocated in a CFLEVEL=5 or higher *00150000
                         coupling facility.                             00151000
         DS    CL48      Reserved                                       00152000
DEIBEND  DS    0C        End of Deib                                    00153000
*                                                                       00154000
*    Castout lock state values                                          00155000
*    Note: To use these values you should reset all of the bits in      00156000
*          DEIBBYTEA except the DEIBCOLOCKSTATE bits and then compare   00157000
*          the full byte against these values.                          00158000
*                                                                       00159000
*                                                                       00160000
DEIBCOLS_RESET EQU B'00000000' The reset state is entered when the     *00161000
                         name is assigned to the directory entry or    *00162000
                         when the castout lock is reset to zeros.       00163000
DEIBCOLS_READFORCASTOUT EQU B'00000100' The read for castout state is  *00164000
                         entered when the castout lock is obtained by  *00165000
                         a CASTOUT_DATA request.                        00166000
DEIBCOLS_WRITEWITHCASTOUT EQU B'00001000' The write with castout state *00167000
                         is entered when the castout lock is obtained  *00168000
                         by a WRITE_DATA request specifying            *00169000
                         GETCOLOCK=YES.                                 00170000
DEIB_LEN EQU   *-DEIB                                                   00171000
.L0002   ANOP                                                           00172000
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 00173000
         AIF   ('&LIST' EQ 'YES').P4                                    00174000
.P3      ANOP                                                           00175000
         POP   PRINT                                                    00176000
.P4      ANOP                                                           00177000
.P_EXIT  ANOP                                                           00178000
         MEND                                                           00179000
**/ IXLYDEIB_2:;                                                        00180000
* %IXLYDEIB_INCLUDED = 'YES';                                           00181000
* %DCL ZCBPRINT CHAR EXT;                                               00182000
* %DEACTIVATE ZCBPRINT;                                                 00183000
* %DCL IXLYDEIB_LIST CHAR EXT;                                          00184000
* %DEACTIVATE IXLYDEIB_LIST;                                            00185000
* %IF IXLYDEIB_LIST ^= 'NO' &                                           00186000
*    ZCBPRINT ^= 'NO' %THEN                                             00187000
*   %GOTO IXLYDEIB_3;                                                   00188000
*   @LIST PUSH NOECHO;                                                  00189000
*   @LIST NOASSEMBLE NOECHO;                                            00190000
*   @LIST OFF C NOECHO;                                                 00191000
* %IXLYDEIB_3:;                                                         00192000
*/* Start of PL/X Source                                             */ 00193000
*                                                                       00194000
* %If Deib_Dcl_Attr = '' %Then                                          00195000
*   %Deib_Dcl_Attr = 'Based';                                           00196000
*                                                                       00197000
* Dcl 1 Deib Deib_Dcl_Attr BDY(WORD), /* Directory Entry Information    00198000
*                                         Block                      */ 00199000
*       3 DeibName     Char(16), /* Name of the structure entry for     00200000
*                                   which this Deib contains directory  00201000
*                                   information.                     */ 00202000
*       3 DeibUserData Char(8),  /* Directory entry user data field. */ 00203000
*       3 DeibStgClass Fixed(8), /* Storage class associated with the   00204000
*                                   entry.                           */ 00205000
*       3 DeibByteA    Bit(8),   /* Bit level directory entry fields.*/ 00206000
*        5 DeibChanged   Bit(1), /* Entry changed bit.                  00207000
*                                   1 ==> any cached subsystem data     00208000
*                                         is changed.                   00209000
*                                   0 ==> any cached subsystem data     00210000
*                                         is unchanged.              */ 00211000
*        5 DeibCached    Bit(1), /* Data-cached indicator.              00212000
*                                   1 ==> subsystem data is cached for  00213000
*                                         the entry.                    00214000
*                                   0 ==> no subsystem data is cached,  00215000
*                                         e.g. only a directory entry   00216000
*                                         is allocated for the name. */ 00217000
*        5 DeibParity    Bit(2), /* Parity associated with the entry.   00218000
*                                                                @D1C*/ 00219000
*        5 DeibCoLockState Bit(2), /* Castout lock state.  Values are   00220000
*                                   declared below.              @D1A*/ 00221000
*        5 *             Bit(2), /* Reserved                     @D1C*/ 00222000
*       3 DeibCoClass  Fixed(16),/* Castout class associated with the   00223000
*                                   entry.                           */ 00224000
*       3 DeibCoLockVal Char(2), /* Contents of the castout lock for    00225000
*                                   the entry.  (First byte is the      00226000
*                                   connection ID, second byte is the   00227000
*                                   process ID.)                     */ 00228000
*       3 *            Char(1),  /* Reserved                         */ 00229000
*       3 DeibElemNum  Fixed(8), /* Cache entry size expressed as       00230000
*                                   the number of elements in the       00231000
*                                   entry                            */ 00232000
*       3 DeibLcInterest Char(32),/* Bit string identifying which       00233000
*                                   connected users have registered     00234000
*                                   interest in the entry.  The         00235000
*                                   relative position of a bit in the   00236000
*                                   string associates it with a         00237000
*                                   connection ID.                      00238000
*                                   1 ==> the associated connection has 00239000
*                                   registered interest in the entry.   00240000
*                                   0 ==> the connection does not have  00241000
*                                   registered interest in the entry.   00242000
*                                   Bit 0 in this string will always    00243000
*                                   be zero.                         */ 00244000
*       3 * CHAR(8),             /* Reserved                     @01A*/ 00245000
*       3 DeibVersion CHAR(8),   /* Cache entry version number.         00246000
*                                   Valid only for structures allocated 00247000
*                                   in a CFLEVEL=5 or higher coupling   00248000
*                                   facility.                    @01A*/ 00249000
*       3 * CHAR(48),            /* Reserved                     @01C*/ 00250000
*       3 DeibEnd      Char(0);  /* End of Deib                      */ 00251000
*                                                                       00252000
* /* Castout lock state values                                   @D1A*/ 00253000
* /* Note: To use these values you should reset all of the bits in      00254000
*          DEIBBYTEA except the DEIBCOLOCKSTATE bits and then compare   00255000
*          the full byte against these values.                   @D1A*/ 00256000
*                                                                       00257000
* Dcl DeibCols_Reset            Bit(8) Constant('00000000'B), /* The    00258000
*                          reset state is entered when the name is      00259000
*                          assigned to the directory entry or when the  00260000
*                          castout lock is reset to zeros.       @D1A*/ 00261000
*     DeibCols_ReadForCastout   Bit(8) Constant('00000100'B), /* The    00262000
*                          read for castout state is entered when the   00263000
*                          castout lock is obtained by a CASTOUT_DATA   00264000
*                          request.                              @D1A*/ 00265000
*     DeibCols_WriteWithCastout Bit(8) Constant('00001000'B); /*        00266000
*                          The write with castout state is entered      00267000
*                          when the castout lock is obtained by a       00268000
*                          WRITE_DATA request specifying                00269000
*                          GETCOLOCK=YES.                        @D1A*/ 00270000
*                                                                       00271000
* %Deactivate Deib_Dcl_Attr;                                            00272000
*                                                                       00273000
*/* End of PL/X Source                                               */ 00274000
* %IF IXLYDEIB_LIST ^= 'NO' &                                           00275000
*    ZCBPRINT ^= 'NO' %THEN                                             00276000
*   %GOTO IXLYDEIB_4;                                                   00277000
*   @LIST POP NOECHO;                                                   00278000
* %IXLYDEIB_4:;                                                         00279000
* %END;                                                                 00280000
