*                                                                       00001000
* %DCL IXLYAMDA_INCLUDED CHAR EXT;                                      00002000
* %DEACTIVATE IXLYAMDA_INCLUDED;                                        00003000
* %IF IXLYAMDA_INCLUDED = '' %THEN                                      00004000
* %DO;                                                                  00005000
*/* Macro made bi-lingual on 23200. CBGEN compile date 23032         */ 00006000
*% /*                                                                   00007000
         MACRO                                                          00008000
         IXLYAMDA &DSECT=YES,&LIST=YES,&TITLE=YES,&IXLYAMDAREA=YES,    *00009000
               &IXLYAMDHD=COND,&IXLYAMDCF=COND,&IXLYAMDCF1=COND,       *00010000
               &IXLYAMDSLL=COND,&IXLYAMDSLL1=COND,&IXLYAMDSLC=COND,    *00011000
               &IXLYAMDSLC1=COND,&IXLYAMDCFMI=COND,                    *00012000
               &IXLYAMDCFMINFO=COND,&IXLYAMDCFRF=COND,                 *00013000
               &IXLYAMDCFRF1=COND,&IXLYAMDCFCP=COND,                   *00014000
               &IXLYAMDCFCPINFO=COND,&IXLYAMDSTRL=COND,                *00015000
               &IXLYAMDSTRL1=COND,&IXLYAMDSTRL2=COND,                  *00016000
               &IXLYAMDSTRL3=COND,&IXLYAMDSTRL4=COND,&IXLYAMDSTRC=COND,*00017000
               &IXLYAMDSTRC1=COND,&IXLYAMDSTRC2=COND,                  *00018000
               &IXLYAMDSTRC3=COND,&IXLYAMDSTRC4=COND,&IXLYAMDSCSC=COND,*00019000
               &IXLYAMDSCSC1=COND,&IXLYAMDSCOC=COND,                   *00020000
               &IXLYAMDSCOCSTATS=COND,&IXLYAMDSC=COND,&IXLYAMDSC1=COND,*00021000
               &IXLYAMDSSCC=COND,&IXLYAMDSSCM=COND,&IXLYAMDADUP=COND    00022000
         GBLC  &IXLYAMDA_INCLUDED                                       00023000
         GBLC  &ZCBPRINT                                                00024000
&IXLYAMDA_INCLUDED SETC 'YES'                                           00025000
         AIF   ('&LIST' EQ 'NONE').P0                                   00026000
         AIF   ('&TITLE' EQ 'NO').P5                                    00027000
 TITLE   'IXLYAMDA  - Accounting and Measurement Data Area            '*00028000
                                                                        00029000
.P5      ANOP                                                           00030000
**/ ;                                                                   00031000
*/* START OF SPECIFICATIONS ******************************************* 00032000
*                                                                       00033000
*01* PROPRIETARY STATEMENT:                                             00034000
*                                                                       00035000
*     LICENSED MATERIALS - PROPERTY OF IBM                              00036000
*     5650-ZOS COPYRIGHT IBM CORP. 1993, 2021                           00037000
*                                                                       00038000
* STATUS= HBB77D0                                                       00039000
*                                                                       00040000
*01* EXTERNAL CLASSIFICATION: GUPI                                      00041000
*01* END OF EXTERNAL CLASSIFICATION:                                    00042000
*                                                                       00043000
*01* DESCRIPTIVE NAME: Accounting and Measurement Data Area             00044000
*                                                                       00045000
*02*  ACRONYM:  AMDA                                                    00046000
*                                                                       00047000
*01* MACRO NAME: IXLYAMDA                                               00048000
*                                                                       00049000
*01* DSECT NAME:                                                        00050000
*     IXLYAMDAREA                                                       00051000
*     IXLYAMDHD                                                         00052000
*     IXLYAMDCF                                                         00053000
*     IXLYAMDCF1                                                        00054000
*     IXLYAMDSLL                                                        00055000
*     IXLYAMDSLL1                                                       00056000
*     IXLYAMDSLC                                                        00057000
*     IXLYAMDSLC1                                                       00058000
*     IXLYAMDCFMI                                                       00059000
*     IXLYAMDCFMINFO                                                    00060000
*     IXLYAMDCFRF                                          @LAA         00061000
*     IXLYAMDCFRF1                                         @LXA         00062000
*     IXLYAMDCFCP                                                       00063000
*     IXLYAMDCFCPINFO                                                   00064000
*     IXLYAMDSTRL                                                       00065000
*     IXLYAMDSTRL1                                                      00066000
*     IXLYAMDSTRL2                                                      00067000
*     IXLYAMDSTRL3                                                 @M1A 00068000
*     IXLYAMDSTRL4                                                 @M5A 00069000
*     IXLYAMDSTRC                                                       00070000
*     IXLYAMDSTRC1                                                      00071000
*     IXLYAMDSTRC2                                                 @M1A 00072000
*     IXLYAMDSTRC3                                                 @M1A 00073000
*     IXLYAMDSTRC4                                                 @M5A 00074000
*     IXLYAMDSCSC                                                       00075000
*     IXLYAMDSCSC1                                                      00076000
*     IXLYAMDSCOC                                                       00077000
*     IXLYAMDSCOCSTATS                                                  00078000
*     IXLYAMDSC                                                         00079000
*     IXLYAMDSC1                                                        00080000
*     IXLYAMDSSCC                                          @L5A         00081000
*     IXLYAMDSSCM                                          @LQA         00082000
*     IXLYAMDADUP                                                       00083000
*                                                                       00084000
*                                                                       00085000
*01* COMPONENT:  Cross System Extended Services (SCIXL)                 00086000
*                                                                       00087000
*01* EYE-CATCHER:  NONE                                                 00088000
*02*  OFFSET:  N/A                                                      00089000
*02*  LENGTH:  N/A                                                      00090000
*                                                                       00091000
*01* STORAGE ATTRIBUTES:                                                00092000
*                                                                       00093000
*02*  SUBPOOL: User-supplied                                            00094000
*02*  KEY: User-supplied                                                00095000
*02*  RESIDENCY: User-supplied                                          00096000
*                                                                       00097000
*01* SIZE: Variable                                                     00098000
*            IXLYAMDSTRL4     -- X'0300' bytes                          00099000
*            IXLYAMDSTRC4     -- X'0274' bytes                          00100000
*            IXLYAMDSTRC3     -- X'01D0' bytes                          00101000
*            IXLYAMDSTRL3     -- X'0220' bytes                          00102000
*            IXLYAMDSTRC2     -- X'0174' bytes                          00103000
*            IXLYAMDAREA      -- X'0014' bytes                          00104000
*            IXLYAMDHD        -- X'000C' bytes                          00105000
*            IXLYAMDCF        -- X'0130' bytes                          00106000
*            IXLYAMDCF1       -- X'01B0' bytes                          00107000
*            IXLYAMDSLL       -- X'0024' bytes                          00108000
*            IXLYAMDSLL1      -- X'00A4' bytes                          00109000
*            IXLYAMDSLC       -- X'0024' bytes                          00110000
*            IXLYAMDSLC1      -- X'0040' bytes                          00111000
*            IXLYAMDCFMI      -- X'0010' bytes                          00112000
*            IXLYAMDCFMINFO   -- X'0044' bytes                          00113000
*            IXLYAMDCFRF      -- X'0100' bytes                          00114000
*            IXLYAMDCFRF1     -- X'0200' bytes                          00115000
*            IXLYAMDCFCP      -- X'0018' bytes                          00116000
*            IXLYAMDCFCPINFO  -- X'0040' bytes                          00117000
*            IXLYAMDSTRL      -- X'0108' bytes                          00118000
*            IXLYAMDSTRL1     -- X'0188' bytes                          00119000
*            IXLYAMDSTRL2     -- X'01C8' bytes                          00120000
*            IXLYAMDSTRC      -- X'00F4' bytes                          00121000
*            IXLYAMDSTRC1     -- X'0174' bytes                          00122000
*            IXLYAMDSCSC      -- X'0078' bytes                          00123000
*            IXLYAMDSCSC1     -- X'00C0' bytes                          00124000
*            IXLYAMDSCOC      -- X'0010' bytes                          00125000
*            IXLYAMDSCOCSTATS -- X'0004' bytes                          00126000
*            IXLYAMDSC        -- X'0044' bytes                          00127000
*            IXLYAMDSC1       -- X'0080' bytes                          00128000
*            IXLYAMDSSCC      -- X'0238' bytes                          00129000
*            IXLYAMDSSCM      -- X'0100' bytes                          00130000
*            IXLYAMDADUP      -- X'0100' bytes                          00131000
*       See declares                                                    00132000
*                                                                       00133000
*01* CREATED BY: IXLA1MG                                                00134000
*                                                                       00135000
*01* POINTED TO BY: DATAAREA_ADDR field in MG parameter list            00136000
*                                                                       00137000
*01* SERIALIZATION:                                                     00138000
*     None required                                                     00139000
*                                                                       00140000
*01* FUNCTION:                                                          00141000
*02*  Maps facility, structure, and subchannel accounting and           00142000
*     measurement data returned by the LFSS Measurement Gatherer        00143000
*     Service (IXLMG).                                                  00144000
*                                                                       00145000
*01* METHOD OF ACCESS:                                                  00146000
*02*  ASM:        IXLYAMDA                                              00147000
*                 DSECT=YES!NO  -- Request DSECT definition             00148000
*                 AREA=YES!NO  --  Request IXLYAMDAREA definition       00149000
*                 ENTRY=YES!NO --  Request IXLYAMDENTRY definition      00150000
*     Default: DSECT=YES                                                00151000
*                                                                       00152000
*02*  PL/AS: %INCLUDE SYSLIB(IXLYAMDA)                                  00153000
*                                                                       00154000
*01* DELETED BY: User                                                   00155000
*                                                                       00156000
*01* FREQUENCY: Created for response to IXLMG                           00157000
*                                                                       00158000
*01* DEPENDENCIES: None.                                                00159000
*                                                                       00160000
*01* NOTES:                                                             00161000
*                                                                       00162000
*    -  Note that the IXLYAMDAREA_VERSION field describes the level     00163000
*       of information contained in the IXLYAMDA mapping.  The level    00164000
*       of information cannot be greater than the maximum supported     00165000
*       CFLEVEL of the MVS system where IXLMG was invoked, so           00166000
*       IXLYAMDA_VERSION will equal the MAXCFLEVEL returned by          00167000
*       IXCQUERY.  Individual facilities may have a lower or higher     00168000
*       CFLEVEL than the MAXCFLEVEL understood by the MVS system.       00169000
*       In those cases, the level of information returned for the       00170000
*       specific facility or structure will be the lower of the         00171000
*       facility's CFLEVEL and the IXLYAMDA_VERSION.  Individual        00172000
*       fields include an indication of what CFLEVEL returns this       00173000
*       information.  (Example:  IXLYAMDSTRL_MREIPI indicates that      00174000
*       it is returned when the list structure is allocated in a        00175000
*       facility with CFLEVEL 4.  Therefore, the field only has         00176000
*       meaning when the IXLYAMDA_VERSION >= 4, and the CF where the    00177000
*       list structure is allocated has CFLEVEL>=4.)  Fields not        00178000
*       labeled in this way can be assumed to be returned at all        00179000
*       CFLEVELs, ie. at CFLEVEL 0 and above.                           00180000
*                                                                       00181000
*    -  When the IXLMG request specifies CHAINTYPE=OFFSET, the          00182000
*       IXLYAMDAREA_ChainOffset flag will be on and all fields          00183000
*       that address another area in the AMDA will contain offsets      00184000
*       instead of addresses.  The offset is calculated from the        00185000
*       start of the AMDA.  To convert an offset to an address,         00186000
*       add the offset to the address of the AMDA.                 @M9A 00187000
*                                                                       00188000
*                                                                       00189000
*                                                                       00190000
*                                                                       00191000
*01* DISTRIBUTION LIBRARY:  AMACLIB                                     00192000
*                                                                       00193000
*01* CHANGE ACTIVITY:                                                   00194000
*     $L0= SYSLKLAM HBB5510 910301 PD00FR: XES Initial Release          00195000
*     $L1= SYSLKLAM HBB5510 910923 PD00CD: Add architecture updates     00196000
*     $P1= PIG0981  HBB5510 930115 PD00DT: Add structure type contants  00197000
*     $P2= PIG1026  HBB5510 930202 PD00DT: Add subchannel status        00198000
*     $D1= DIG0101  HBB5510 930325 PD00DT: Add measurement information  00199000
*     $L2= SYSLKLAM HBB5510 930525 PD00DT: Add structure types          00200000
*     $P3= PIG5027  HBB5510 940105 PD00FR: Update descriptions          00201000
*     $P4= PIG5125  HBB5510 940207 PD00DT: Add Version number           00202000
*     $P5= PIG5158  HBB5510 940211 PD00FR: Castout Class Count defn     00203000
*     $P6= PIG5126  HBB5510 940201 PD00FR: CFLEVEL support              00204000
*     $P7= PIG5229  HBB5510 940331 PD00DT: Add Queue Total counts       00205000
*     $P8= PIG5178  HBB5510 940314 PD00DT: Performance                  00206000
*     $L3= DNXES    HBB5520 940414 PD00FR: XES Dynamic Reconfig         00207000
*     $L4= XESAC    HBB5520 940511 PD00FR: XES service/architecture     00208000
*                                          change                       00209000
*     $P9= PN70931  HBB5520 940616 PD00FR: Update descriptions          00210000
*     $D2= DN70083  HBB5520 940815 PD00EA: Update target descriptions   00211000
*     $PA= PN71955  HBB5520 941130 PD00DT: Update descriptions          00212000
*     $PB= PQC0939  HBB6603 960502 PD00DT: Add Rebuild information      00213000
*     $01= OW15589  HBB5520 950711 PD00BJ: Event monitor support        00214000
*     $02= OW24532  HBB5520 960711 PD00HV: Alter EMC support            00215000
*     $PC= PUX0505  HBB6605 970916 PD00HV: Fix prolog err from ow24532  00216000
*     $03= OW28460  HBB6603 960801 PDXM: User managed duplexing         00217000
*     $PD= PVT0195  HBB6603 971215 PDXM: UDF order queue support        00218000
*     $L5= AUTOR    HBB6608 980622 PDSL: System-managed (Auto)          00219000
*                                        rebuild support                00220000
*     $L6= DELNM   ,HBB6608,980716,PD00FR: Name class masks             00221000
*     $L7= AUTOR   ,HBB6608,980807,PDSL: System-managed (Auto)          00222000
*                                        rebuild support, con't.        00223000
*     $L8= AUTOR   ,HBB6608,980828,PD00GW: Auto Rebuild                 00224000
*     $PE= PWK0181 ,HBB6608 980821 PDSL: Flag CFLEVEL 8 fields          00225000
*     $PF= PWK0284 ,HBB6608 981102 PD00BN: Auto Rebuild updates         00226000
*     $04= OW28556  HBB6603 980430 PD00DT: Symphony support             00227000
*     $05= OW34698  HBB6601 980930 PD00DT: AMData sequence              00228000
*     $PG= PWK0652 ,HBB6608 990122 PD00BN: Comment mismatch             00229000
*     $L9= MQ      ,JBB6609,980902,PD00S7: MQ Series support            00230000
*     $LA= DUPLX   ,HBB7705,991015,PD00SL: CF Duplexing                 00231000
*     $PH= PX00059 ,HBB7705,000320,PD00QQ: CFRF comments                00232000
*     $LB= DUPLX   ,HBB7705,000512,PD00SL: CF Duplexing                 00233000
*     $LC=DUPLX    ,HBB7705,000512,PD00BJ: CF Duplexing                 00234000
*     $LD=DUPLX    ,HBB7705,000519,PD00BJ: CF Duplexing                 00235000
*     $PI= PX00203 ,HBB7705,000809,PD00MO: CF Duplexing                 00236000
*     $06= OW43541  HBB6606 000929 PD00DT: Freeway support              00237000
*     $PJ=PX00471  ,HBB7705,000930,PD00BJ: Comment updates              00238000
*     $PK=PX00933  ,HBB7705,001221,PD00QQ: Add chpid type info to       00239000
*                                          IXLYAMDCFRF                  00240000
*     $PL=PX01486  ,HBB7705,010220,PD00DT: Update chpidtype constants   00241000
*     $07=OW50206  ,HBB7705,010914,PD00OF: remote cf chpid info         00242000
*                                          (TRSQ for PX01906)           00243000
*     $08=OW54796  ,HBB7705,020530,PD00DT: Tune Subchannels             00244000
*     $09=OW55968  ,HBB7705,020831,PD002F: 64-bit SSTFM support         00245000
*     $0A=OW55969  ,HBB7705,020930,PD002F: Add WRTCLI field to          00246000
*                                          IXLYAMDSTRL1                 00247000
*     $LE=XESLCR   ,HBB7720,040401,PD00WK: OA01511: Fence IXLLOCK       00248000
*                                          requests in dataspace        00249000
*                                          storage constrained          00250000
*                                          environment                  00251000
*     $0B=OA03993  ,HBB7707 030831 PD00DT: Shared/Dedicated CF CPs      00252000
*     $LF=DUPDS    ,HBB7740,060512,PD00BJ: AM Updates for CFLEVEL=15    00253000
*     $PM=ME08517   HBB7740 061120 PD00BN: Correct copyright statement  00254000
*     $0C=OA17936  ,HBB7709 061208 PD00DT: CIB Coupling Link            00255000
*     $LG=DUPDS     HBB7740 070314 PD00BJ: Doubleword SXTIME            00256000
*     $LH=DUPDS2    HBB7750 070327 PD00OF: IRTCEI support               00257000
*     $LI=CFSMQ     HBB7750 070630 PD00P9: Shared Message Queue         00258000
*                                          Notification Enhancements    00259000
*     $LJ=ME15459   HBB7770 090830 PD00DT: HWInfo valid indication      00260000
*     $LK=ME19255   HBB7780 100625 PD002F: Add IxlyamdStrl1_MUID        00261000
*     $LL=CACWRAND  HBB7790 110209 PD00C9: Cache Write-Around Support   00262000
*     $LM=CACRAVAL  HBB7790 110406 PD00C9: Background Deallocate        00263000
*     $LN=CFCHPCAR  HBB7790 110430 PD00BN: Channel path characteristics 00264000
*     $LO=CACRAVAL  HBB7790 110603 PD00C9: Remove BDC indicator         00265000
*     $LP=THININT   HBB7790 110627 PD00C9: CRAISE                       00266000
*        =ME22570   HBB7790 110923 PD00C9: RPD3 adherence               00267000
*     $LP=THININT   HBB7790 120206 PD00C9: CRAISE                       00268000
*     $LQ=CFFLASH   HBB7790 120127 PD00C9: CF Flash                     00269000
*     $LR=CFFLASH   HBB7790 121031 PD00C9: CF Flash - MSBEC, MSBELC     00270000
*     $LS=THININT   HBB7790 130123 PD00C9: Rename CRAISE to CTI         00271000
*     $LT=CFFLASH   HBB7790 130107 PD00OF: CF Flash                     00272000
*     $LU=CPLPCIE   HBB77A0 130430 PD00BN: CS5 CHPID type               00273000
*     $0D=OA40747   HBB7780 131007 PD00OF: CF Flash                     00274000
*     $LV=CPLPCIE   HBB77A0 140331 PD00BN: CS5 CHPID type               00275000
*     $PN=ME27620   HBB77A0 140616 PD00OF: Add IxlyamdaCf_CfAuth        00276000
*     $LW=ADUPLX    HBB77A0 140623 PD00OF: Async Duplexing              00277000
*     $0E=OA45224   HBB7780 140721 PD00OF: Add OpCtScmAccess            00278000
*     $0F=OA47534   HBB77A0 150331 PD0JES: Doc updates                  00279000
*     $LX=ADUPLX    HBB77A0 150430 PD00OF: Async Duplexing              00280000
*     $10=OA48832   HBB7780 150708 PD00C9: CL5 CHPID type               00281000
*     $LY=LSTNOT    HBB77B0 150410 PD00C9: List Notification            00282000
*     $LZ=ADUPLX    HBB77A0 160331 PD00BN: Async Duplexing              00283000
*     $PO=120089    HBB77A0 160805 PD00BN: Doc update for AMPBC and     00284000
*                                          AMNSAC fields                00285000
*     $M1=CFCRYPT   HBB77B0 160720 PD00C9: CF Data Encryption           00286000
*     $M2=MSTRSLV   HBB77B0 161017 PD00OF: CFLEVEL22 Master/Slave       00287000
*     $M3=CFCRYPT   HBB77B0 161102 PD00C9: CF Data Encryption           00288000
*     $M4=OA56345   HBB7790 181212 PD00MP: CFLEVEL24 Toleration (FLM2)  00289000
*     $0G=OA57778   HBB77A0 190909 PD00OF: IXLYAMDSSCC_CopyVersion      00290000
*     $M5=OA56774   HBB77A0 190307 PD00C9: CF task monopolization       00291000
*     $M6=OA56774   HBB77A0 190326 PD00BN: CF task monopolization       00292000
*     $M7=333129    HBB77D0 191231 PD00C9: V2R5                         00293000
*     $M8=333500    HBB77D0 200316 PD00C9: V2R5                         00294000
*     $PP=379320    HBB77D0 200630 PD00C9: ISV                          00295000
*     $0H=OA60275   HBB77A0 210131 PD00BN: CF buffer summary groups     00296000
*     $M7=OA60650   HBB77B0 210405 PD00C9: Structure full threshold     00297000
*     $M8=OA60650   HBB77B0 210405 PD00C9: Cache residency time         00298000
*     $M9=OA63685   HBB77D0 230419 PD00BN: Selectable CFLevel for       00299000
*                                          structure sizing             00300000
*                                                                       00301000
* END OF SPECIFICATIONS *********************************************/  00302000
*% /*                                                                   00303000
.P0      ANOP                                                           00304000
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 00305000
         AIF   ('&LIST' EQ 'YES').P2                                    00306000
.P1      ANOP                                                           00307000
         PUSH  PRINT                                                    00308000
         PRINT OFF                                                      00309000
.P2      ANOP                                                           00310000
         AIF   ('&IXLYAMDAREA' EQ 'NO').L0002                           00311000
         AIF   ('&DSECT' EQ 'YES').L0003                                00312000
         AIF   ('&IXLYAMDAREA' NE 'YES').L0002                          00313000
.L0003   ANOP                                                           00314000
*                                                                       00315000
* ********************************************************************  00316000
* ****************** AMDA Header *************************************  00317000
* ********************************************************************  00318000
*                                                                       00319000
*                                                                       00320000
         AIF   ('&DSECT' EQ 'YES').L0004                                00321000
IXLYAMDAREA DS 0F        Data area returned to caller                   00322000
         AGO   .L0005                                                   00323000
.L0004   ANOP                                                           00324000
IXLYAMDAREA DSECT        Data area returned to caller                   00325000
.L0005   ANOP                                                           00326000
IXLYAMDAREA_LENGTH DS F  Length of IXLYAMDAREA header mapping           00327000
IXLYAMDAREA_CFENT@ DS A  Address of first CF entry. A value of zero    *00328000
                         means that no CF entries were provided.        00329000
         ORG   IXLYAMDAREA_CFENT@                                       00330000
IXLYAMDAREA_CFENT_OFF DS F Offset of first CF entry. A value of zero   *00331000
                         means that no CF entries were provided.        00332000
IXLYAMDAREA_TLEN DS F    Total length of output data area needed to    *00333000
                         contain all the requested information. This   *00334000
                         length includes the area for the records that *00335000
                         WERE returned on this call.                    00336000
IXLYAMDAREA_#ENT DS F    Total number of entries of all kinds (not     *00337000
                         including the header)                          00338000
IXLYAMDAREA_VERSION DS X Version number - Maximum CFLEVEL supported by *00339000
                         MVS on system where IXLMG was invoked. Can be *00340000
                         used to determine if specific fields have     *00341000
                         valid information. See notes in prolog for    *00342000
                         more information                               00343000
IXLYAMDAREA_FLAGS DS B   Request flags                                  00344000
*  Bit definitions:                                                     00345000
IXLYAMDAREA_CHAINOFFSET EQU X'80' When on, all chain fields contain    *00346000
                         offsets rather than addresses                  00347000
         DS    CL2       Unused                                         00348000
IXLYAMDAREA_LEN EQU *-IXLYAMDAREA                                       00349000
.L0002   ANOP                                                           00350000
         AIF   ('&IXLYAMDHD' EQ 'NO').L0006                             00351000
         AIF   ('&DSECT' EQ 'YES').L0007                                00352000
         AIF   ('&IXLYAMDHD' NE 'YES').L0006                            00353000
.L0007   ANOP                                                           00354000
*                                                                       00355000
* ********************************************************************  00356000
* *****  Mapping of portion of entry common to all entries  ****        00357000
* ********************************************************************  00358000
*                                                                       00359000
*                                                                       00360000
         AIF   ('&DSECT' EQ 'YES').L0008                                00361000
IXLYAMDHD DS   0F        Common header mapping for IXLYAMDA entries     00362000
         AGO   .L0009                                                   00363000
.L0008   ANOP                                                           00364000
IXLYAMDHD DSECT          Common header mapping for IXLYAMDA entries     00365000
.L0009   ANOP                                                           00366000
IXLYAMDHD_TYPE DS B      Type of entry                                  00367000
         DS    CL3       Unused                                         00368000
IXLYAMDHD_LENGTH DS F    Length of entry                                00369000
IXLYAMDHD_NEXT DS A      Address of next entry.                         00370000
         ORG   IXLYAMDHD_NEXT                                           00371000
IXLYAMDHD_NEXT_OFF DS F  Offset of next entry                           00372000
*                                                                       00373000
* ********************************************************************  00374000
* **************** Entry Types ********************************         00375000
* ********************************************************************  00376000
*                                                                       00377000
*                                                                       00378000
IXLYAMDA_TYPECF EQU X'10' Type for CF block                             00379000
IXLYAMDA_TYPESLL EQU X'11' Type for SLL block                           00380000
IXLYAMDA_TYPESLC EQU X'12' Type for SLC block                           00381000
IXLYAMDA_TYPECFMI EQU X'13' Type for CFMI block                         00382000
IXLYAMDA_TYPECFRF EQU X'14' Type for CFRF block                         00383000
IXLYAMDA_TYPECFCP EQU X'15' Type for CFCP block                         00384000
IXLYAMDA_TYPESTRL EQU X'21' Type for STRL block                         00385000
IXLYAMDA_TYPESTRC EQU X'22' Type for STRC block                         00386000
IXLYAMDA_TYPESCSC EQU X'23' Type for SCSC block                         00387000
IXLYAMDA_TYPESCOC EQU X'24' Type for SCOC block                         00388000
IXLYAMDA_TYPESSCC EQU X'25' Type for SSCC block                         00389000
IXLYAMDA_TYPESSCM EQU X'26' Type for SSCM block                         00390000
IXLYAMDA_TYPEADUP EQU X'27' Type for ADUP block                         00391000
IXLYAMDA_TYPESC EQU X'30' Type for SC block                             00392000
IXLYAMDHD_LEN EQU *-IXLYAMDHD                                           00393000
.L0006   ANOP                                                           00394000
         AIF   ('&IXLYAMDCF' EQ 'NO').L000A                             00395000
         AIF   ('&DSECT' EQ 'YES').L000B                                00396000
         AIF   ('&IXLYAMDCF' NE 'YES').L000A                            00397000
.L000B   ANOP                                                           00398000
*                                                                       00399000
* ********************************************************************  00400000
* ********************** Facility Entry  *****************************  00401000
* ********************************************************************  00402000
* ********************** Facility Entry ******************************  00403000
* ************************* Header ***********************************  00404000
*                                                                       00405000
*                                                                       00406000
         AIF   ('&DSECT' EQ 'YES').L000C                                00407000
IXLYAMDCF DS   0F        Coupling Facility (CF) Entry                   00408000
         AGO   .L000D                                                   00409000
.L000C   ANOP                                                           00410000
IXLYAMDCF DSECT          Coupling Facility (CF) Entry                   00411000
.L000D   ANOP                                                           00412000
IXLYAMDCF_TYPE DS B      Indication of type of data X'10' indicates CF *00413000
                         entry                                          00414000
         DS    CL3       Unused                                         00415000
IXLYAMDCF_LENGTH DS F    Length of IXLYAMDCF entry mapping              00416000
IXLYAMDCF_CFNEXT DS A    Address of next CF entry. A value of 0        *00417000
                         indicates last entry.                          00418000
         ORG   IXLYAMDCF_CFNEXT                                         00419000
IXLYAMDCF_CFNEXT_OFF DS F Offset of next CF entry. A value of 0        *00420000
                         indicates last entry.                          00421000
IXLYAMDCF_SL@ DS A       Address of first CF structure limits entry. A *00422000
                         value of 0 means that no structure limit      *00423000
                         entries were provided for this CF.             00424000
         ORG   IXLYAMDCF_SL@                                            00425000
IXLYAMDCF_SL_OFF DS F    Offset of first CF structure limits entry. A  *00426000
                         value of 0 means that no structure limit      *00427000
                         entries were provided for this CF.             00428000
IXLYAMDCF_STR@ DS A      Address of first STR record for this CF. A    *00429000
                         value of zero means that no STR records were  *00430000
                         provided for this CF.                          00431000
         ORG   IXLYAMDCF_STR@                                           00432000
IXLYAMDCF_STR_OFF DS F   Offset of first STR record for this CF. A     *00433000
                         value of zero means that no STR records were  *00434000
                         provided for this CF.                          00435000
IXLYAMDCF_SC@ DS A       Address of first subchannel entry for this    *00436000
                         CF. A value of zero means that no SC records  *00437000
                         were provided for this CF.                     00438000
         ORG   IXLYAMDCF_SC@                                            00439000
IXLYAMDCF_SC_OFF DS F    Offset of first subchannel entry for this CF. *00440000
                         A value of zero means that no SC records were *00441000
                         provided for this CF.                          00442000
IXLYAMDCF_MI@ DS A       Address of the measurement information entry  *00443000
                         for this CF. A value of zero means that the   *00444000
                         MI record was not provided for this CF.        00445000
         ORG   IXLYAMDCF_MI@                                            00446000
IXLYAMDCF_MI_OFF DS F    Offset of the measurement information entry   *00447000
                         for this CF. A value of zero means that the   *00448000
                         MI record was not provided for this CF.        00449000
*                                                                       00450000
* ********************** Facility Entry  *****************************  00451000
* *********************Configuration Data*****************************  00452000
*                                                                       00453000
*                                                                       00454000
IXLYAMDCF_CFID DS F      Facility ID number                             00455000
IXLYAMDCF_CFNAME DS CL8  Facility Name                                  00456000
IXLYAMDCF_ND DS CL32     Hardware Node Descriptor for the facility.    *00457000
                         Mapped by IXLYNDE.                             00458000
         DS    CL2       Unused                                         00459000
IXLYAMDCF_SIDMAX DS H    Maximum SID value                              00460000
IXLYAMDCF_FLAGS DS B     Flags                                          00461000
*  Bit definitions:                                                     00462000
IXLYAMDCF_CONNECTED EQU X'80' Connected = Managed + Available, which   *00463000
                         indicates operations can be allowed against   *00464000
                         the facility. If this bit is off the facility *00465000
                         control information returned will be from the *00466000
                         last time the facility was connected and may  *00467000
                         be downlevel.                                  00468000
IXLYAMDCF_MANAGED EQU X'40' The facility is in the CFRM policy and XCF *00469000
                         wishes to use this facility                    00470000
IXLYAMDCF_AVAILABLE EQU X'20' This system has physical paths connected *00471000
                         to the facility                                00472000
IXLYAMDCF_VOLATILE EQU X'10' This facility's storage is volatile when  *00473000
                         this bit = 1 nonvolatile when this bit = 0     00474000
IXLYAMDCF_ALLSHAREDCPS EQU X'08' This facility is running with all     *00475000
                         shared CPs Bit = 1. At least one dedicated CP *00476000
                         Bit = 0                                        00477000
IXLYAMDCF_DCFDI EQU X'04' Equals '1'B if Dynamic CF Dispatching is     *00478000
                         active for this facility, '0'B if not         *00479000
                         (LEVEL15).                                     00480000
IXLYAMDCF_HWINFODETAILVALID EQU X'02' Equals '1'B if                   *00481000
                         IXLYAMDCF_HWInfoDetail field mapping for this *00482000
                         facility is valid,'0'B if not valid.           00483000
IXLYAMDCF_STANDALONE EQU X'01' When 1, this facility is running on a   *00484000
                         CPC with no z/OS LPARs                         00485000
IXLYAMDCF_FLAGS2 DS B    More CF Flags                                  00486000
*  Bit definitions:                                                     00487000
IXLYAMDCF_CTI EQU X'80'  Set to '1'B if coupling thin interrupts is    *00488000
                         enabled for this coupling facility (CFLEVEL   *00489000
                         19 or above). '0'B if not enabled in the      *00490000
                         coupling facility                              00491000
         DS    CL2       Unused                                         00492000
IXLYAMDCF_PATHMASKS DS CL8 Pathing masks currently in use               00493000
         ORG   IXLYAMDCF_PATHMASKS                                      00494000
IXLYAMDCF_PHYSPM DS B    Physical path mask - paths which have a       *00495000
                         physical connection to the facility            00496000
IXLYAMDCF_VARYPM DS B    VARY path mask - paths which have a logical   *00497000
                         connection to the facility                     00498000
IXLYAMDCF_XCFPM DS B     XCF path mask - paths connected to the        *00499000
                         facility in the active policy                  00500000
IXLYAMDCF_COMPPM DS B    Composite path mask = PHYSPM + VARYPM + XCFPM  00501000
         DS    CL1       Unused                                         00502000
IXLYAMDCF_INVALID DS B   Invalid paths mask - paths not connected to   *00503000
                         correct facility                               00504000
IXLYAMDCF_NOTVALIDATED DS B NotValidated paths mask -- paths not       *00505000
                         connected                                      00506000
         DS    CL1       Unused                                         00507000
IXLYAMDCF_SEQUENCE DS F  Sequence number. This sequence number is      *00508000
                         changed whenever a new "instance" of this     *00509000
                         entity comes into use                          00510000
IXLYAMDCF_CUID DS BL2    Control unit ID                                00511000
         DS    CL2       Unused                                         00512000
IXLYAMDCF_HWINFORMATION DS CL64 Facility Hardware information           00513000
         ORG   IXLYAMDCF_HWINFORMATION                                  00514000
IXLYAMDCF_HWINFODETAIL DS CL64 Facility Hardware information subfield  *00515000
                         mapping is valid when                         *00516000
                         IXLYAMDCF_HWInfoDetailValid is set             00517000
         ORG   IXLYAMDCF_HWINFODETAIL                                   00518000
         DS    CL4       Model dependent                                00519000
IXLYAMDCF_CFCCRELEASE DS H CFCC RELEASE xx.yy                           00520000
         ORG   IXLYAMDCF_CFCCRELEASE                                    00521000
IXLYAMDCF_RELEASE1 DS X  xx (packed decimal)                            00522000
IXLYAMDCF_RELEASE2 DS X  yy (can be treated as packed decimal only for *00523000
                         official releases and service levels,         *00524000
                         otherwise all hex values are possible)         00525000
IXLYAMDCF_SERVICELEVEL DS H SERVICE LEVEL xx.yy (both xx and yy can be *00526000
                         treated as packed decimal only for official   *00527000
                         releases and service levels, otherwise all    *00528000
                         hex values are possible)                       00529000
         ORG   IXLYAMDCF_SERVICELEVEL                                   00530000
IXLYAMDCF_LEVEL1 DS X    xx                                             00531000
IXLYAMDCF_LEVEL2 DS X    yy                                             00532000
IXLYAMDCF_BUILDDATE DS F BUILT ON mm/dd/yyyy                            00533000
         ORG   IXLYAMDCF_BUILDDATE                                      00534000
IXLYAMDCF_DATE1 DS X     mm (packed decimal)                            00535000
IXLYAMDCF_DATE2 DS X     dd (packed decimal)                            00536000
IXLYAMDCF_DATE3 DS H     yyyy (packed decimal)                          00537000
IXLYAMDCF_BUILDTIME DS CL3 AT hh:mm:ss                                  00538000
         ORG   IXLYAMDCF_BUILDTIME                                      00539000
IXLYAMDCF_TIME1 DS X     hh (packed decimal)                            00540000
IXLYAMDCF_TIME2 DS X     mm (packed decimal)                            00541000
IXLYAMDCF_TIME3 DS X     ss (packed decimal)                            00542000
         DS    CL30      model dependent                                00543000
IXLYAMDCF_MFR DS CL3     'IBM' - Manufacturer ID from CF Node          *00544000
                         Descriptor for IBM coupling facilities         00545000
         ORG   IXLYAMDCF_HWINFORMATION+64                               00546000
IXLYAMDCF_NOSP DS H      Number shared processors in the facility      *00547000
                         (LEVEL15)                                      00548000
IXLYAMDCF_NODP DS H      Number dedicated processors in the facility   *00549000
                         (LEVEL15)                                      00550000
         DS    CL12      Unused                                         00551000
*                                                                       00552000
* ********************** Facility Entry  *****************************  00553000
* *************** Accounting and Measurement Data ********************  00554000
*                                                                       00555000
*                                                                       00556000
IXLYAMDCF_SUBCH_CONTENTION DS F Count of times a free subchannel was   *00557000
                         not available for synchronous immediate       *00558000
                         operations                                     00559000
IXLYAMDCF_CONTENTIONTIME DS CL8 Summed contention time for waiting for *00560000
                         subchannels to become free (u-sec) for        *00561000
                         synchronous immediate operations               00562000
IXLYAMDCF_CONTENTIONTIMESQR DS CL8 Summed contention time for waiting  *00563000
                         for subchannels to become free (u-sec         *00564000
                         squared) for synchronous immediate operations  00565000
IXLYAMDCF_SUBCH_ALLOCATED DS F Count of number of subchannels that     *00566000
                         this facility has been allocated               00567000
IXLYAMDCF_SUBCH_INUSE DS F Count of number of subchannels available    *00568000
                         for use                                        00569000
IXLYAMDCF_SUBCH_MAXLIMIT DS F Count of total number of subchannels     *00570000
                         that could be used for operations if          *00571000
                         available                                      00572000
IXLYAMDCF_STRUCTURE_COUNT DS F Count of number of structures in use by *00573000
                         connectors from this system                    00574000
         DS    CL4       Unused                                         00575000
IXLYAMDCF_FAILEDOPTIMECOUNT DS F Count of the number of summed times   *00576000
                         -- for unsuccessful operations                 00577000
IXLYAMDCF_FAILEDOPSUMTIME DS CL8 Summed service time of unsuccessful   *00578000
                         operations (u-sec)                             00579000
IXLYAMDCF_FAILEDOPSUMTIMESQR DS CL8 Square of the summed service time  *00580000
                         of unsuccessful operations (u-sec squared)     00581000
IXLYAMDCF_ACCUMULATEDUTILCOUNT DS CL8 Utilization count accumulated    *00582000
                         from the subchannels that have been           *00583000
                         deallocated                                    00584000
IXLYAMDCF_ACCUMULATEDBUSYCOUNT DS CL8 Path Busy count accumulated from *00585000
                         the subchannels that have been deallocated     00586000
*                                                                       00587000
* ********************** Facility Entry  *****************************  00588000
* ******************* Control Information ****************************  00589000
*                                                                       00590000
*                                                                       00591000
IXLYAMDCF_TS DS F        Total facility space in 4K blocks. Facility   *00592000
                         space is made up of free space, dump space,   *00593000
                         control space and structure space              00594000
IXLYAMDCF_FS DS F        Total Free space in 4K blocks. Free Space =   *00595000
                         Free control space + free non-control space    00596000
IXLYAMDCF_TCS DS F       Total Control space in 4K blocks. Control     *00597000
                         space + non- control space = total space       00598000
IXLYAMDCF_FCS DS F       Total Free control space in 4K blocks          00599000
IXLYAMDCF_GDC DS CL16    Global dumping controls                        00600000
         ORG   IXLYAMDCF_GDC                                            00601000
IXLYAMDCF_TDS DS F       Total Dumping Space in 4K blocks. If TDS is   *00602000
                         lower than the MRDS then the dump space is    *00603000
                         not large enough to contain the largest       *00604000
                         structure that was dumped.                     00605000
IXLYAMDCF_FDS DS F       Free Dumping Space in 4K blocks. If FDS is    *00606000
                         smaller than the MRDS than there is not       *00607000
                         enough available dump space to contain the    *00608000
                         largest structure that was dumped.             00609000
IXLYAMDCF_ADTC DS F      Associated dump table count. If this count is *00610000
                         frequently more than one then multiple        *00611000
                         structures are being dumped at the same time   00612000
IXLYAMDCF_MRDS DS F      Maximum Requested Dumping Space in 4K blocks   00613000
IXLYAMDCF_MDX DS X       Largest Data Element size, where size in      *00614000
                         bytes is 256*(2**MDX)                          00615000
         DS    CL1                                                      00616000
IXLYAMDCF_STGI DS H      Storage increment in 4K blocks                 00617000
IXLYAMDCF_CFLEVEL DS F   Coupling facility architected function level   00618000
         DS    CL12      Unused                                         00619000
IXLYAMDCF_LEN EQU *-IXLYAMDCF                                           00620000
.L000A   ANOP                                                           00621000
         AIF   ('&IXLYAMDCF1' EQ 'NO').L000E                            00622000
         AIF   ('&DSECT' EQ 'YES').L000F                                00623000
         AIF   ('&IXLYAMDCF1' NE 'YES').L000E                           00624000
IXLYAMDCF1 DS  0F        Coupling Facility (CF) Entry, AmdaLevel>=1     00625000
         AGO   .L0010                                                   00626000
.L000F   ANOP                                                           00627000
IXLYAMDCF1 DSECT         Coupling Facility (CF) Entry, AmdaLevel>=1     00628000
.L0010   ANOP                                                           00629000
         DS    CL304     Mapped by IXLYAMDCF                            00630000
IXLYAMDCF1_RFADDR DS A   Address of the first Remote Facility record   *00631000
                         for this CF. A non-zero value will be         *00632000
                         returned when HWSTATISTICS=(YES!CF) and       *00633000
                         AMDALEVEL=(1!higher) are specified and this   *00634000
                         CF is connected to one or more remote CFs. A  *00635000
                         value of zero indicates either the data was   *00636000
                         not requested or there are no remotely        *00637000
                         connected facilities for this CF.              00638000
         ORG   IXLYAMDCF1_RFADDR                                        00639000
IXLYAMDCF1_RF_OFF DS F   Offset of the first Remote Facility record    *00640000
                         for this CF. A non-zero value will be         *00641000
                         returned when HWSTATISTICS=(YES!CF) and       *00642000
                         AMDALEVEL=(1!higher) are specified and this   *00643000
                         CF is connected to one or more remote CFs. A  *00644000
                         value of zero indicates either the data was   *00645000
                         not requested or there are no remotely        *00646000
                         connected facilities for this CF.              00647000
IXLYAMDCF1_CPADDR DS A   Address of the Channel Path record for this   *00648000
                         CF. A non-zero value will be returned when    *00649000
                         AMDALEVEL= (1!higher) is specified.            00650000
         ORG   IXLYAMDCF1_CPADDR                                        00651000
IXLYAMDCF1_CP_OFF DS F   Offset of the Channel Path record for this    *00652000
                         CF. A non-zero value will be returned when    *00653000
                         AMDALEVEL= (1!higher) is specified.            00654000
IXLYAMDCF1_TSCM DS CL8   Total CF storage-class memory in 4K blocks.   *00655000
                         Total CF storage-class memory is the amount   *00656000
                         of storage-class memory that may be           *00657000
                         concurrently used as structure extensions. It *00658000
                         is equal to the sum of the free CF            *00659000
                         storage-class memory and the storage-class    *00660000
                         memory in use by structures in the facility   *00661000
                         (LEVEL19)                                      00662000
IXLYAMDCF1_FSCM DS CL8   Free CF storage-class memory in 4k blocks.    *00663000
                         Free CF storage-class memory is the           *00664000
                         difference between the total CF storage-class *00665000
                         memory and the sum of the CF storage-class    *00666000
                         memory in use by all structures in the        *00667000
                         facility (LEVEL19)                             00668000
IXLYAMDCF1_SSTGI DS H    Storage-class memory increment. Number of 4k  *00669000
                         blocks that are assigned to a single          *00670000
                         storage-class memory segment (LEVEL19)         00671000
         DS    CL6       Reserved                                       00672000
IXLYAMDCF1_CFAUTH DS CL16 Zero or authority data from coupling         *00673000
                         facility. Zero when the coupling facility is  *00674000
                         not managed.                                   00675000
         DS    CL80      Reserved                                       00676000
IXLYAMDCF1_LEN EQU *-IXLYAMDCF1                                         00677000
.L000E   ANOP                                                           00678000
         AIF   ('&IXLYAMDSLL' EQ 'NO').L0011                            00679000
         AIF   ('&DSECT' EQ 'YES').L0012                                00680000
         AIF   ('&IXLYAMDSLL' NE 'YES').L0011                           00681000
.L0012   ANOP                                                           00682000
*                                                                       00683000
* ********************************************************************  00684000
* **************** List Structure Limits Entry************************  00685000
* ********************************************************************  00686000
* **************** List Structure Limits Entry************************  00687000
* *********************** Header *************************************  00688000
*                                                                       00689000
*                                                                       00690000
         AIF   ('&DSECT' EQ 'YES').L0013                                00691000
IXLYAMDSLL DS  0F        Structure Limits for a List Structure (SLL)   *00692000
                         Entry                                          00693000
         AGO   .L0014                                                   00694000
.L0013   ANOP                                                           00695000
IXLYAMDSLL DSECT         Structure Limits for a List Structure (SLL)   *00696000
                         Entry                                          00697000
.L0014   ANOP                                                           00698000
IXLYAMDSLL_TYPE DS B     X'11' -- indicates SLL data for CF             00699000
         DS    CL3       Unused                                         00700000
IXLYAMDSLL_LENGTH DS F   Length of IXLYAMDSLL entry mapping             00701000
IXLYAMDSLL_SLNEXT DS A   Address of next limit entry. A value of 0     *00702000
                         means last entry for this facility.            00703000
         ORG   IXLYAMDSLL_SLNEXT                                        00704000
IXLYAMDSLL_SLNEXT_OFF DS F Offset of next limit entry. A value of 0    *00705000
                         means last entry for this facility.            00706000
*                                                                       00707000
* **************** List Structure Limits Entry************************  00708000
* ********************Structure Limits********************************  00709000
*                                                                       00710000
*                                                                       00711000
IXLYAMDSLL_LNL DS F      List Header Number limit                       00712000
IXLYAMDSLL_LTECHL DS X   List lock table entry characteristic limit.   *00713000
                         The maximum supported size of a lock table    *00714000
                         entry in bytes is 2**LTECHL.                   00715000
IXLYAMDSLL_UIDL DS X     Userid Limit                                   00716000
         DS    CL2       Unused                                         00717000
IXLYAMDSLL_NDL DS F      Notification Delay Limit (NDL). The maximum   *00718000
                         list, key-range and subsidiary list           *00719000
                         notification delay limits for the structure.  *00720000
                         Bit positions 0-31 correspond to bit          *00721000
                         positions 32-63 of the CPU timer. Bit 19      *00722000
                         represents one microsecond. (CFLEVEL>=22)      00723000
         ORG   IXLYAMDSLL_NDL                                           00724000
IXLYAMDSLL_SLNDL DS F    Subsidiary list notification delay (SLND)     *00725000
                         limit. Bit positions 0-31 correspond to bit   *00726000
                         positions 32-63 of the CPU timer. Bit 19      *00727000
                         represents one microsecond. (CFLEVEL>=16)      00728000
         DS    CL12      Unused                                         00729000
IXLYAMDSLL_LEN EQU *-IXLYAMDSLL                                         00730000
.L0011   ANOP                                                           00731000
         AIF   ('&IXLYAMDSLL1' EQ 'NO').L0015                           00732000
         AIF   ('&DSECT' EQ 'YES').L0016                                00733000
         AIF   ('&IXLYAMDSLL1' NE 'YES').L0015                          00734000
IXLYAMDSLL1 DS 0X        Structure Limits for a List Structure (SLL)   *00735000
                         Entry, AmdaLevel>=1                            00736000
         AGO   .L0017                                                   00737000
.L0016   ANOP                                                           00738000
IXLYAMDSLL1 DSECT        Structure Limits for a List Structure (SLL)   *00739000
                         Entry, AmdaLevel>=1                            00740000
.L0017   ANOP                                                           00741000
         DS    CL36      Mapped by IXLYAMDSLL                           00742000
         DS    CL128     Reserved                                       00743000
IXLYAMDSLL1_LEN EQU *-IXLYAMDSLL1                                       00744000
.L0015   ANOP                                                           00745000
         AIF   ('&IXLYAMDSLC' EQ 'NO').L0018                            00746000
         AIF   ('&DSECT' EQ 'YES').L0019                                00747000
         AIF   ('&IXLYAMDSLC' NE 'YES').L0018                           00748000
.L0019   ANOP                                                           00749000
*                                                                       00750000
* ********************************************************************  00751000
* **************** Cache Structure Limits Entry***********************  00752000
* ********************************************************************  00753000
* **************** Cache Structure Limits Entry***********************  00754000
* *************************** Header *********************************  00755000
*                                                                       00756000
*                                                                       00757000
         AIF   ('&DSECT' EQ 'YES').L001A                                00758000
IXLYAMDSLC DS  0F        Structure Limits for Cache Structure (SLC)    *00759000
                         Entry                                          00760000
         AGO   .L001B                                                   00761000
.L001A   ANOP                                                           00762000
IXLYAMDSLC DSECT         Structure Limits for Cache Structure (SLC)    *00763000
                         Entry                                          00764000
.L001B   ANOP                                                           00765000
IXLYAMDSLC_TYPE DS B     X'12' -- indicates SLC data for CF             00766000
         DS    CL3       Unused                                         00767000
IXLYAMDSLC_LENGTH DS F   Length of IXLYAMDSLC entry mapping             00768000
IXLYAMDSLC_SLNEXT DS A   Address of next limit entry. A value of 0     *00769000
                         means last entry for this facility.            00770000
         ORG   IXLYAMDSLC_SLNEXT                                        00771000
IXLYAMDSLC_SLNEXT_OFF DS F Offset of next limit entry. A value of 0    *00772000
                         means last entry for this facility.            00773000
*                                                                       00774000
* **************** Cache Structure Limits Entry***********************  00775000
* ******************* Structure Limits *******************************  00776000
*                                                                       00777000
*                                                                       00778000
IXLYAMDSLC_LCIDLMT DS X  Cache local cache identifier limit             00779000
         DS    CL2       reserved                                       00780000
IXLYAMDSLC_SCLMT DS X    Cache storage class limit                      00781000
IXLYAMDSLC_CCLMT DS H    Cache cast-out class limit                     00782000
         DS    CL18      Unused                                         00783000
IXLYAMDSLC_LEN EQU *-IXLYAMDSLC                                         00784000
.L0018   ANOP                                                           00785000
         AIF   ('&IXLYAMDSLC1' EQ 'NO').L001C                           00786000
         AIF   ('&DSECT' EQ 'YES').L001D                                00787000
         AIF   ('&IXLYAMDSLC1' NE 'YES').L001C                          00788000
IXLYAMDSLC1 DS 0X        Structure Limits for a Cache Structure (SLC)  *00789000
                         Entry, AmdaLevel>=1                            00790000
         AGO   .L001E                                                   00791000
.L001D   ANOP                                                           00792000
IXLYAMDSLC1 DSECT        Structure Limits for a Cache Structure (SLC)  *00793000
                         Entry, AmdaLevel>=1                            00794000
.L001E   ANOP                                                           00795000
         DS    CL36      Mapped by IXLYAMDSLC                           00796000
         DS    CL28      Reserved                                       00797000
IXLYAMDSLC1_LEN EQU *-IXLYAMDSLC1                                       00798000
.L001C   ANOP                                                           00799000
         AIF   ('&IXLYAMDCFMI' EQ 'NO').L001F                           00800000
         AIF   ('&DSECT' EQ 'YES').L0020                                00801000
         AIF   ('&IXLYAMDCFMI' NE 'YES').L001F                          00802000
.L0020   ANOP                                                           00803000
*                                                                       00804000
* ********************************************************************  00805000
* **************** Facility Measurement Information Entry********       00806000
* ********************************************************************  00807000
* **************** Facility Measurement Information Header ******       00808000
*                                                                       00809000
*                                                                       00810000
         AIF   ('&DSECT' EQ 'YES').L0021                                00811000
IXLYAMDCFMI DS 0F        Coupling Facility Measurement Information     *00812000
                         (CFMI) Entry                                   00813000
         AGO   .L0022                                                   00814000
.L0021   ANOP                                                           00815000
IXLYAMDCFMI DSECT        Coupling Facility Measurement Information     *00816000
                         (CFMI) Entry                                   00817000
.L0022   ANOP                                                           00818000
IXLYAMDCFMI_TYPE DS B    X'13' -- indicates CFMI data for CF            00819000
         DS    CL3       Unused                                         00820000
IXLYAMDCFMI_LENGTH DS F  Length of IXLYAMDCFMI entry                    00821000
IXLYAMDCFMI_INFO@ DS A   Address of the measurement information array. *00822000
                         An address of 0 indicates no elements are     *00823000
                         provided                                       00824000
         ORG   IXLYAMDCFMI_INFO@                                        00825000
IXLYAMDCFMI_INFO_OFF DS F Offset of the measurement information array. *00826000
                         A value of 0 indicates no elements are        *00827000
                         provided.                                      00828000
IXLYAMDCFMI_INFOELEM DS F Number of elements in the array Each element *00829000
                         contains the processor number and the         *00830000
                         measurement block for each valid processor     00831000
IXLYAMDCFMI_LEN EQU *-IXLYAMDCFMI                                       00832000
.L001F   ANOP                                                           00833000
         AIF   ('&IXLYAMDCFMINFO' EQ 'NO').L0023                        00834000
         AIF   ('&DSECT' EQ 'YES').L0024                                00835000
         AIF   ('&IXLYAMDCFMINFO' NE 'YES').L0023                       00836000
.L0024   ANOP                                                           00837000
*                                                                       00838000
* *****************Facility Measurement Info Element******************  00839000
*                                                                       00840000
*                                                                       00841000
         AIF   ('&DSECT' EQ 'YES').L0025                                00842000
IXLYAMDCFMINFO DS 0F     Facility Measurement Information Element       00843000
         AGO   .L0026                                                   00844000
.L0025   ANOP                                                           00845000
IXLYAMDCFMINFO DSECT     Facility Measurement Information Element       00846000
.L0026   ANOP                                                           00847000
IXLYAMDCFMINFO_PNUM DS F Processor number for which measurement        *00848000
                         information is provided                        00849000
IXLYAMDCFMINFO_PMB DS CL64 Processor measurement block                  00850000
         ORG   IXLYAMDCFMINFO_PMB                                       00851000
IXLYAMDCFMINFO_PEXTIME DS F Processor execution time                    00852000
IXLYAMDCFMINFO_PWTTIME DS F Processor wait time                         00853000
IXLYAMDCFMINFO_PFLAGS DS CL1                                            00854000
*  Bit definitions:                                                     00855000
IXLYAMDCFMINFO_PSDI EQU X'80' '1'B if processor is dedicated, '0'B if  *00856000
                         shared (LEVEL15)                               00857000
         DS    CL1       reserved                                       00858000
IXLYAMDCFMINFO_PCWGT DS H Processor current weight. Range 0-999 for    *00859000
                         shared processor. Equals 65535 for dedicated  *00860000
                         processor. (LEVEL15)                           00861000
IXLYAMDCFMINFO_ABSG DS X Assigned buffer summary group (LEVEL25)        00862000
         DS    CL7       Reserved                                       00863000
IXLYAMDCFMINFO_PCCNT DS F Processor command count - number of commands *00864000
                         started by this processor since the last CF   *00865000
                         power-on reset. Wraps when the value exceeds  *00866000
                         the maximum value. (LEVEL25)                   00867000
IXLYAMDCFMINFO_CPU_TLE DS CL16 CPU-type topology list entry, as        *00868000
                         returned by the STSI instruction SYSIB        *00869000
                         15.1.2. Refer to Principles of Operation for  *00870000
                         format. (LEVEL25)                              00871000
         DS    CL24      reserved                                       00872000
IXLYAMDCFMINFO_LEN EQU *-IXLYAMDCFMINFO                                 00873000
.L0023   ANOP                                                           00874000
         AIF   ('&IXLYAMDCFRF' EQ 'NO').L0027                           00875000
         AIF   ('&DSECT' EQ 'YES').L0028                                00876000
         AIF   ('&IXLYAMDCFRF' NE 'YES').L0027                          00877000
.L0028   ANOP                                                           00878000
*                                                                       00879000
* ********************************************************************  00880000
* *          Coupling Facility Remote Facility Entry                 *  00881000
* *                                                                  *  00882000
* * When HWSTATISTICS=(YES!CF) and AMDALEVEL=(1 OR HIGHER) are       *  00883000
* * specified and the Coupling Facility has connectivity to one or   *  00884000
* * more remote Coupling Facilities (this requires both CFs be at    *  00885000
* * CFLEVEL 10 or higher) one Remote Facility Entry is returned for  *  00886000
* * each remote Coupling Facility.                                   *  00887000
* *                                                                  *  00888000
* * The term "subject CF" is used to describe the Coupling Facility  *  00889000
* * whose facility name is identified by the field IXLYAMDCF_CFname. *  00890000
* * The term "remote CF" is used to describe the Coupling Facility   *  00891000
* * whose facility name is identified by the field                   *  00892000
* * IXLYAMDCFRF_CFname.                                                 00893000
* *                                                                  *  00894000
* * The first remote facility record is pointed to by                *  00895000
* * IXLYAMDCF1_RFAddr and subsequent remote facility records (if     *  00896000
* * they exist) are pointed to by IXLYAMDCFRF_RFNext.                   00897000
* ********************************************************************  00898000
*                                                                       00899000
*                                                                       00900000
         AIF   ('&DSECT' EQ 'YES').L0029                                00901000
IXLYAMDCFRF DS 0D        CF Remote Facility Entry                       00902000
         AGO   .L002A                                                   00903000
.L0029   ANOP                                                           00904000
IXLYAMDCFRF DSECT        CF Remote Facility Entry                       00905000
.L002A   ANOP                                                           00906000
IXLYAMDCFRF_TYPE DS B    X'14' -- indicates remote facility entry.     *00907000
                         (LEVEL10)                                      00908000
         DS    CL3       Unused                                         00909000
IXLYAMDCFRF_LENGTH DS F  Length of IXLYAMDCFRF entry mapping.          *00910000
                         (LEVEL10)                                      00911000
IXLYAMDCFRF_RFNEXT DS A  Address of next remote facility entry. A      *00912000
                         value of zero indicates this is the last      *00913000
                         entry for this facility. (LEVEL10)             00914000
         ORG   IXLYAMDCFRF_RFNEXT                                       00915000
IXLYAMDCFRF_RFNEXT_OFF DS F Offset of next remote facility entry. A    *00916000
                         value of zero indicates this is the last      *00917000
                         entry for this facility. (LEVEL10)             00918000
*                                                                       00919000
* *******CFRF****Remote Facility Data******************************* *  00920000
*                                                                       00921000
*                                                                       00922000
IXLYAMDCFRF_NODE DS CL32 Hardware node descriptor for the remotely     *00923000
                         connected CF. Mapped by IXLYNDE. (LEVEL10)     00924000
IXLYAMDCFRF_SYID DS CL8  System identification value for the remotely  *00925000
                         connected CF. (LEVEL10)                        00926000
IXLYAMDCFRF_CFNAME DS CL8 Coupling facility name for the remotely      *00927000
                         connected CF, or binary zeroes if the CF's    *00928000
                         node descriptor does not match any CF that is *00929000
                         both (a) defined in the CFRM active policy,   *00930000
                         and (b) also accessible to the system on      *00931000
                         which the IXLMG request was made. (LEVEL10)    00932000
IXLYAMDCFRF_PGS DS X     Path group size. The number of currently      *00933000
                         active receiver/peer paths over which signals *00934000
                         may be sent from the subject CF to this       *00935000
                         remote CF. (LEVEL10)                           00936000
         DS    CL3       Unused                                         00937000
IXLYAMDCFRF_RFCTOC DS BL8 Remote facility controls time of creation.   *00938000
                         The time of day (TOD) value at the subject CF *00939000
                         when the remote facility controls for this    *00940000
                         remote CF were created. Note that since       *00941000
                         coupling facilities do not use the Sysplex    *00942000
                         Timer for TOD clock synchronization, this     *00943000
                         RFCTOC value may not be meaningfully compared *00944000
                         with RFCTOC values obtained from any other    *00945000
                         subject CF. For the same reason, RFCTOC       *00946000
                         values may not be meaningfully compared with   00947000
*                        TOD clock values obtained on any system in    *00948000
                         the sysplex. In order to meaningfully compare *00949000
                         two sets of remote facility signal counters,  *00950000
                         obtained for the same subject CF and remote   *00951000
                         CF at different points in time, the RFCTOC    *00952000
                         values obtained for the two sets of counters  *00953000
                         must be identical. (LEVEL10)                   00954000
IXLYAMDCFRF_RTESC DS F   Ready to execute signal counter. The number   *00955000
                         of ready to execute signals which have been   *00956000
                         sent from the subject CF to this remote CF    *00957000
                         since the time at which the remote facility   *00958000
                         controls were created. (LEVEL10)               00959000
IXLYAMDCFRF_RTCSC DS F   Ready to complete signal counter. The number  *00960000
                         of ready to complete signals which have been  *00961000
                         sent from the subject CF to this remote CF    *00962000
                         since the time at which the remote facility   *00963000
                         controls were created. (LEVEL10)               00964000
IXLYAMDCFRF_HESC DS F    Halt execution signal counter. The number of  *00965000
                         halt execution signals which have been sent   *00966000
                         from the subject CF to this remote CF since   *00967000
                         the time at which the remote facility         *00968000
                         controls were created. (LEVEL10)               00969000
IXLYAMDCFRF_RFSSC DS F   Request for suppression signal counter. The   *00970000
                         number of request for suppression signals     *00971000
                         which have been sent from the subject CF to   *00972000
                         this remote CF since the time at which the    *00973000
                         remote facility controls were created.        *00974000
                         (LEVEL10)                                      00975000
IXLYAMDCFRF_RFSASC DS F  Request for suppression accepted signal       *00976000
                         counter. The number of request for            *00977000
                         suppression accepted signals which have been  *00978000
                         sent from the subject CF to this remote CF    *00979000
                         since the time at which the remote facility   *00980000
                         controls were created. (LEVEL10)               00981000
IXLYAMDCFRF_SSTFM DS F   Sum of signal service times. The sum of       *00982000
                         service times includes service times for all  *00983000
                         types of requests which have been sent from   *00984000
                         the subject CF to this remote CF since the    *00985000
                         time at which the remote facility controls    *00986000
                         were created, and also includes the service   *00987000
                         time associated with any redrives of those    *00988000
                         signals. However, it excludes any delay time  *00989000
                         associated with these signals (delay time is  *00990000
                         accounted for separately). NOTE: The SSTFM     00991000
*                        has been extended to 64-bits to prevent the   *00992000
                         value from wrapping in a given data gathering *00993000
                         interval. The 64-bit value is contained in    *00994000
                         IXLYAMDCFRF_SSTFME. When the value of         *00995000
                         IXLYAMDCFRF_SSTFME is non-zero, obtain the    *00996000
                         SSTFM from IXLYAMDCFRF_SSTFME. When the       *00997000
                         IXLYAMDCFRF_SSTFME is zero, obtain the SSTFM  *00998000
                         from IXLYAMDCFRF_SSTFM. (LEVEL10)              00999000
IXLYAMDCFRF_SSTSM DS CL8 Sum of squares of signal service times. The   *01000000
                         sum of squares of service times includes      *01001000
                         squared service times for all types of        *01002000
                         requests which have been sent from the        *01003000
                         subject CF to this remote CF since the time   *01004000
                         at which the remote facility controls were    *01005000
                         created, and also includes the squared        *01006000
                         service time associated with any redrives of  *01007000
                         those signals. However, it excludes any delay *01008000
                         time associated with these signals (delay      01009000
*                        time is accounted for separately). (LEVEL10)   01010000
IXLYAMDCFRF_DSC DS F     Delayed signal counter. The number of signals *01011000
                         of all types which have experienced a delay   *01012000
                         in being sent from the subject CF to this     *01013000
                         remote CF since the time at which the remote  *01014000
                         facility controls were created. (LEVEL10)      01015000
IXLYAMDCFRF_SDTFM DS F   Sum of signal delay times. The sum of delay   *01016000
                         times includes delay times for all types of   *01017000
                         requests which have been sent from the        *01018000
                         subject CF this remote CF since the time at   *01019000
                         which the remote facility controls were       *01020000
                         created. (LEVEL10)                             01021000
IXLYAMDCFRF_SDTSM DS CL8 Sum of squares of signal times. The sum of    *01022000
                         squares of delay times includes squared delay *01023000
                         times for all types of requests which have    *01024000
                         been sent from the subject CF to this remote  *01025000
                         CF since the time at which the remote         *01026000
                         facility controls were created. (LEVEL10)      01027000
IXLYAMDCFRF_SRDSC DS F   Signal redrives signal counter. The number of *01028000
                         redrives of signals of all types which have   *01029000
                         been sent from the subject CF to this remote  *01030000
                         CF since the time at which the remote         *01031000
                         facility controls were created. (LEVEL10)      01032000
IXLYAMDCFRF_CHPIDTYPES DS CL1 A chpid type is provided for each active *01033000
                         receiver/peer message path in the path group. *01034000
                         The number of valid IXLYAMDCFRF_CHPIDTYPE     *01035000
                         entries returned in each IXLYAMDCFRF is equal *01036000
                         to the path group size returned in            *01037000
                         IXLYAMDCFRF_PGS                                01038000
         ORG   IXLYAMDCFRF_CHPIDTYPES                                   01039000
IXLYAMDCFRF_CHPIDTYPE DS X CHPid Type                                   01040000
         ORG   IXLYAMDCFRF_CHPIDTYPES+8                                 01041000
IXLYAMDCFRF_SSTFME DS CL8 64-bit Sum of signal service times. The sum  *01042000
                         of service times includes service times for   *01043000
                         all types of requests which have been sent    *01044000
                         from the subject CF to this remote CF since   *01045000
                         the time at which the remote facility         *01046000
                         controls were created, and also includes the  *01047000
                         service time associated with any redrives of  *01048000
                         those signals. However, it excludes any delay *01049000
                         time associated with these signals (delay     *01050000
                         time is accounted for separately). NOTE: When  01051000
*                        the value of IXLYAMDCFRF_SSTFME is non-zero,  *01052000
                         obtain the SSTFM from IXLYAMDCFRF_SSTFME.     *01053000
                         When the IXLYAMDCFRF_SSTFME is zero, obtain   *01054000
                         the SSTFM from IXLYAMDCFRF_SSTFM. (LEVEL11)    01055000
IXLYAMDCFRF_CHPIDS DS CL1 One CHPID for each active receiver/peer      *01056000
                         message path in the path group. The number of *01057000
                         valid IXLYAMDCFRF_CHPIDS entries returned in  *01058000
                         each IXLYAMDCFRF is equal to the path group   *01059000
                         size returned in IXLYAMDCFRF_PGS               01060000
         ORG   IXLYAMDCFRF_CHPIDS                                       01061000
IXLYAMDCFRF_CHPID DS X   Channel path ID                                01062000
*                                                                       01063000
* ********************************************************************  01064000
* * Each entry in the IXLYAMDCFRF_Validity array describes the          01065000
*   validity of fields in the corresponding entry in the                01066000
*   IXLYAMDCFRF_PathData array.                                         01067000
* ********************************************************************  01068000
*                                                                       01069000
*                                                                       01070000
         ORG   IXLYAMDCFRF_CHPIDS+8                                     01071000
IXLYAMDCFRF_VALIDITY DS B Validity flags for IXLYAMDCFRF_PathData       01072000
*  Bit definitions:                                                     01073000
IXLYAMDCFRF_MODEVALID EQU X'80' On when IXLYAMDCFRF_Mode is valid       01074000
IXLYAMDCFRF_LATENCYVALID EQU X'40' On when IXLYAMDCFRF_Latency is      *01075000
                         valid                                          01076000
IXLYAMDCFRF_DEGRADEDVALID EQU X'20' On when IXLYAMDCFRF_Degraded is    *01077000
                         valid                                          01078000
         ORG   IXLYAMDCFRF_VALIDITY+8                                   01079000
IXLYAMDCFRF_PATHDATA DS CL12 Path- specific data                        01080000
         ORG   IXLYAMDCFRF_PATHDATA                                     01081000
IXLYAMDCFRF_MODE DS X    Additional information describing the mode of *01082000
                         operation of the path - see constants         *01083000
                         IXLYAMDA_PathMode_Xxx. Valid when             *01084000
                         IXLYAMDCFRF_ModeValid on.                      01085000
IXLYAMDCFRF_FLAGS DS B   Path-related flags                             01086000
*  Bit definitions:                                                     01087000
IXLYAMDCFRF_DEGRADED EQU X'80' On => path is operating at reduced      *01088000
                         capacity, or is not operating. Valid when     *01089000
                         IXLYAMDCFRF_DegradedValid on.                  01090000
         DS    CL2       Reserved                                       01091000
IXLYAMDCFRF_LATENCY DS F Average round- trip path time, in             *01092000
                         microseconds. A value of 0 means that the     *01093000
                         time has not been or cannot be measured. A    *01094000
                         value of 1 means a time less than or equal to *01095000
                         1 microsecond. Valid when                     *01096000
                         IXLYAMDCFRF_LatencyValid on.                   01097000
         DS    CL4       Reserved                                       01098000
         ORG   IXLYAMDCFRF_PATHDATA+96                                  01099000
         DS    CL4       Reserved                                       01100000
IXLYAMDCFRF_LEN EQU *-IXLYAMDCFRF                                       01101000
.L0027   ANOP                                                           01102000
         AIF   ('&IXLYAMDCFRF1' EQ 'NO').L002B                          01103000
         AIF   ('&DSECT' EQ 'YES').L002C                                01104000
         AIF   ('&IXLYAMDCFRF1' NE 'YES').L002B                         01105000
IXLYAMDCFRF1 DS 0D       CF Remote Facility Entry, AmdaLevel >=2        01106000
         AGO   .L002D                                                   01107000
.L002C   ANOP                                                           01108000
IXLYAMDCFRF1 DSECT       CF Remote Facility Entry, AmdaLevel >=2        01109000
.L002D   ANOP                                                           01110000
         DS    CL256     Mapped by IXLYAMDCFRF                          01111000
IXLYAMDCFRF1_SPGS DS X   Sender path group size. The number of         *01112000
                         currently active sender/peer paths over which *01113000
                         signals may be sent from this remote CF to    *01114000
                         the subject CF. (LEVEL10)                      01115000
         DS    CL7       Unused                                         01116000
IXLYAMDCFRF1_SCHPIDTYPES DS CL1 A CHPID type is provided for each      *01117000
                         active sender/peer message path in the path   *01118000
                         group. The number of valid                    *01119000
                         IXLYAMDCFRF1_SCHPIDTYPE entries returned in   *01120000
                         each IXLYAMDCFRF1 is equal to the path group  *01121000
                         size returned in IXLYAMDCFRF1_SPGS. (LEVEL10)  01122000
         ORG   IXLYAMDCFRF1_SCHPIDTYPES                                 01123000
IXLYAMDCFRF1_SCHPIDTYPE DS X Sender CHPID Type                          01124000
         ORG   IXLYAMDCFRF1_SCHPIDTYPES+8                               01125000
IXLYAMDCFRF1_SCHPIDS DS CL1 One CHPID for each active sender/peer      *01126000
                         message path in the path group. The number of *01127000
                         valid IXLYAMDCFRF1_SCHPIDS entries returned   *01128000
                         in each IXLYAMDCFRF1 is equal to the path     *01129000
                         group size returned in IXLYAMDCFRF1_SPGS.     *01130000
                         (LEVEL10)                                      01131000
         ORG   IXLYAMDCFRF1_SCHPIDS                                     01132000
IXLYAMDCFRF1_SCHPID DS X Sender channel path ID                         01133000
*                                                                       01134000
* ********************************************************************  01135000
* * Each entry in the IXLYAMDCFRF1_SValidity array describes the        01136000
*   validity of fields in the corresponding entry in the                01137000
*   IXLYAMDCFRF1_SPathData array.                                       01138000
* ********************************************************************  01139000
*                                                                       01140000
*                                                                       01141000
         ORG   IXLYAMDCFRF1_SCHPIDS+8                                   01142000
IXLYAMDCFRF1_SVALIDITY DS B Validity flags for IXLYAMDCFRF1_SPathData   01143000
*  Bit definitions:                                                     01144000
IXLYAMDCFRF1_SMODEVALID EQU X'80' On when IXLYAMDCFRF1_SMode is valid   01145000
IXLYAMDCFRF1_SLATENCYVALID EQU X'40' On when IXLYAMDCFRF1_SLatency is  *01146000
                         valid                                          01147000
IXLYAMDCFRF1_SDEGRADEDVALID EQU X'20' On when IXLYAMDCFRF1_SDegraded   *01148000
                         is valid                                       01149000
         ORG   IXLYAMDCFRF1_SVALIDITY+8                                 01150000
IXLYAMDCFRF1_SPATHDATA DS CL12 Sender path-specific data                01151000
         ORG   IXLYAMDCFRF1_SPATHDATA                                   01152000
IXLYAMDCFRF1_SMODE DS X  Additional information describing the mode of *01153000
                         operation of the path - see constants         *01154000
                         IXLYAMDA_PathMode_Xxx. Valid when             *01155000
                         IXLYAMDCFRF1_SModeValid on.                    01156000
IXLYAMDCFRF1_SFLAGS DS B Sender path-related flags                      01157000
*  Bit definitions:                                                     01158000
IXLYAMDCFRF1_SDEGRADED EQU X'80' On => path is operating at reduced    *01159000
                         capacity, or is not operating. Valid when     *01160000
                         IXLYAMDCFRF1_SDegradedValid on.                01161000
         DS    CL2       Reserved                                       01162000
IXLYAMDCFRF1_SLATENCY DS F Average round- trip path time, in           *01163000
                         microseconds. A value of 0 means that the     *01164000
                         time has not been or cannot be measured. A    *01165000
                         value of 1 means a time less than or equal to *01166000
                         1 microsecond. Valid when                     *01167000
                         IXLYAMDCFRF1_SLatencyValid on.                 01168000
         DS    CL4       Reserved                                       01169000
         ORG   IXLYAMDCFRF1_SPATHDATA+96                                01170000
IXLYAMDCFRF1_SC DS F     Subchannel count. The number of subchannels   *01171000
                         associated with the remote facility.          *01172000
                         (LEVEL21)                                      01173000
IXLYAMDCFRF1_AMC DS F    Asynchronous message counter. The number of   *01174000
                         asynchronous messages that are sent to the    *01175000
                         remote facility. The counter includes the     *01176000
                         number of push commands that are sent and     *01177000
                         excludes path management commands and         *01178000
                         redrives of push commands. (LEVEL21)           01179000
IXLYAMDCFRF1_AMSTFM DS FL8 Asynchronous message service time 1st       *01180000
                         moment. The accumulated service time, in      *01181000
                         microseconds, for asynchronous messages sent  *01182000
                         to the remote facility. (LEVEL21)              01183000
IXLYAMDCFRF1_AMSTSM DS FL8 Asynchronous message service time 2nd       *01184000
                         moment. The accumlated squares of service     *01185000
                         time, in squared-microsecond units, for       *01186000
                         asynchronous messages sent to the remote      *01187000
                         facility. (LEVEL21)                            01188000
IXLYAMDCFRF1_AMPBC DS F  Asynchronous message path busy count          *01189000
                         (LEVEL21). This count may be reset to 0 when  *01190000
                         all links between the CF and the remote CF    *01191000
                         are lost and subsequently restored.            01192000
IXLYAMDCFRF1_AMNSAC DS F Asynchronous message no subchannel count      *01193000
                         (LEVEL21). This count may be reset to 0 when  *01194000
                         all links between the CF and the remote CF    *01195000
                         are lost and subsequently restored.            01196000
         DS    CL96      Reserved                                       01197000
IXLYAMDCFRF1_LEN EQU *-IXLYAMDCFRF1                                     01198000
.L002B   ANOP                                                           01199000
         AIF   ('&IXLYAMDCFCP' EQ 'NO').L002E                           01200000
         AIF   ('&DSECT' EQ 'YES').L002F                                01201000
         AIF   ('&IXLYAMDCFCP' NE 'YES').L002E                          01202000
.L002F   ANOP                                                           01203000
*                                                                       01204000
* ********************************************************************  01205000
* *          Coupling Facility Channel Path Record                      01206000
*                                                                       01207000
*   When AMDALEVEL=(1 or higher) is specified, one Channel Path         01208000
*   record is returned for each coupling facility.                      01209000
*                                                                       01210000
*   The channel path record is pointed to by IXLYAMDCF1_CPAddr.         01211000
*   It consists of the record header, mapped by IXLYAMDCFCP, and        01212000
*   an array of path descriptors, each of which describes the           01213000
*   characteristics of one path to the CF and is mapped by              01214000
*   IXLYAMDCFCP_PathInfo.                                               01215000
*                                                                       01216000
*   The entries in the array pointed to by IXLYAMDCFCP_PathInfo         01217000
*   correspond 1-1 to the entries in IXLYAMDSC_Chpids and the path      01218000
*   masks in the IXLYAMDSC record (which is always provided when        01219000
*   this record is provided).  Once the index of a particular path      01220000
*   into the IXLYAMDSC arrays has been determined, the corresponding    01221000
*   IXLYAMDCFCPInfo entry can be located using the same index:          01222000
*                                                                       01223000
*   Address of entry =                                                  01224000
*       IXLYAMDCFCP_PathInfo@ + ((index - 1) * IXLYAMDCFCP_EntryLen)    01225000
*                                                                       01226000
*   assuming that index is 1-origin.                                    01227000
*                                                                       01228000
*   An IXLYAMDCFCPInfo entry is valid if the corresponding bit in       01229000
*   IXLYAMDSC_PIM is on (for any of the IXLYAMDSC records associated    01230000
*   with the coupling facility with which this IXLYAMDCFCP record       01231000
*   is associated).                                                     01232000
*                                                                       01233000
* ********************************************************************  01234000
*                                                                       01235000
*                                                                       01236000
         AIF   ('&DSECT' EQ 'YES').L0030                                01237000
IXLYAMDCFCP DS 0D        CF Channel Path record                         01238000
         AGO   .L0031                                                   01239000
.L0030   ANOP                                                           01240000
IXLYAMDCFCP DSECT        CF Channel Path record                         01241000
.L0031   ANOP                                                           01242000
IXLYAMDCFCP_TYPE DS B    x'15' - indicates channel path entry           01243000
         DS    CL3       Unused                                         01244000
IXLYAMDCFCP_LENGTH DS F  Length of IXLYAMDCFCP entry mapping, not      *01245000
                         including the array pointed to by             *01246000
                         IXLYAMDCFCP_PathInfo@                          01247000
         DS    A         Reserved, always 0 (maps to the generic       *01248000
                         next-record pointer, but there is never more  *01249000
                         than one channel path record per CF)           01250000
IXLYAMDCFCP_NUMENTRIES DS F Number of channel path information array   *01251000
                         entries. Always the same as the number of     *01252000
                         elements in IXLYAMDSC_Chpids.                  01253000
IXLYAMDCFCP_ENTRYLEN DS F Length of each channel path information      *01254000
                         array entry                                    01255000
IXLYAMDCFCP_PATHINFO@ DS A Address of channel path information array.   01256000
         ORG   IXLYAMDCFCP_PATHINFO@                                    01257000
IXLYAMDCFCP_PATHINFO_OFF DS F Offset of channel path information       *01258000
                         array.                                         01259000
IXLYAMDCFCP_LEN EQU *-IXLYAMDCFCP                                       01260000
.L002E   ANOP                                                           01261000
         AIF   ('&IXLYAMDCFCPINFO' EQ 'NO').L0032                       01262000
         AIF   ('&DSECT' EQ 'YES').L0033                                01263000
         AIF   ('&IXLYAMDCFCPINFO' NE 'YES').L0032                      01264000
.L0033   ANOP                                                           01265000
*                                                                       01266000
* ********************************************************************  01267000
* *    Coupling Facility Channel Path Information Array entry           01268000
* ********************************************************************  01269000
*                                                                       01270000
*                                                                       01271000
         AIF   ('&DSECT' EQ 'YES').L0034                                01272000
IXLYAMDCFCPINFO DS 0F    CF channel path description                    01273000
         AGO   .L0035                                                   01274000
.L0034   ANOP                                                           01275000
IXLYAMDCFCPINFO DSECT    CF channel path description                    01276000
.L0035   ANOP                                                           01277000
IXLYAMDCFCP_CHPID DS X   CHPID                                          01278000
IXLYAMDCFCP_PATHTYPE DS X Path type - see constants                    *01279000
                         IXLYAMDA_CHPIDType_Xxx                         01280000
         DS    CL2       Reserved                                       01281000
IXLYAMDCFCP_VALIDITY DS BL4 Validity flags                              01282000
         ORG   IXLYAMDCFCP_VALIDITY                                     01283000
IXLYAMDCFCP_VALIDITY1 DS B                                              01284000
*  Bit definitions:                                                     01285000
IXLYAMDCFCP_ATTACHMENTVALID EQU X'80' On when fields in                *01286000
                         IXLYAMDCFCP_AttachmentInfo are valid           01287000
IXLYAMDCFCP_MODEVALID EQU X'40' On when IXLYAMDCFCP_Mode is valid       01288000
IXLYAMDCFCP_LATENCYVALID EQU X'20' On when IXLYAMDCFCP_Latency is      *01289000
                         valid                                          01290000
IXLYAMDCFCP_DEGRADEDVALID EQU X'10' On when IXLYAMDCFCP_Degraded is    *01291000
                         valid                                          01292000
IXLYAMDCFCP_AFFINITYVALID EQU X'0F' Each bit is on when the            *01293000
                         corresponding entry in                        *01294000
                         IXLYAMDCFCP_SAP_Affinity is valid              01295000
IXLYAMDCFCP_VALIDITY2 DS B                                              01296000
*  Bit definitions:                                                     01297000
IXLYAMDCFCP_CHIDVALID EQU X'80' On when IXLYAMDCFCP_CHID is valid       01298000
IXLYAMDCFCP_VALIDITY3 DS B Reserved                                     01299000
IXLYAMDCFCP_VALIDITY4 DS B Reserved                                     01300000
IXLYAMDCFCP_ATTACHMENTINFO DS CL3 Physical attachment information.     *01301000
                         Valid when IXLYAMDCFCP_AttachmentValid on.     01302000
         ORG   IXLYAMDCFCP_ATTACHMENTINFO                               01303000
IXLYAMDCFCP_ADAPTERID DS H Identifies the adapter through which the    *01304000
                         path is connected                              01305000
IXLYAMDCFCP_PORTNUM DS X Identifies the adapter port to which the path *01306000
                         is connected                                   01307000
IXLYAMDCFCP_MODE DS X    Additional information describing the mode of *01308000
                         operation of the path - see constants         *01309000
                         IXLYAMDA_PathMode_Xxx. Valid when             *01310000
                         IXLYAMDCFCP_ModeValid on.                      01311000
IXLYAMDCFCP_LATENCY DS F Average round-trip path time, in              *01312000
                         microseconds. A value of 0 means that the     *01313000
                         time has not been or cannot be measured. A    *01314000
                         value of 1 means a time less than or equal to *01315000
                         1 microsecond. Valid when                     *01316000
                         IXLYAMDCFCP_LatencyValid on.                   01317000
IXLYAMDCFCP_FLAGS DS B   Path-related flags                             01318000
*  Bit definitions:                                                     01319000
IXLYAMDCFCP_DEGRADED EQU X'80' On => path is operating at reduced      *01320000
                         capacity, or is not operating. Valid when     *01321000
                         IXLYAMDCFCP_DegradedValid on.                  01322000
         DS    CL1       Reserved                                       01323000
IXLYAMDCFCP_CHID DS H    Channel ID (PCHID). Valid when                *01324000
                         IXLYAMDCFCP_CHIDValid on.                      01325000
IXLYAMDCFCP_SAP_AFFINITY DS X Array of I/O processors (System Assist   *01326000
                         Processors) to which this path is accessible. *01327000
                         Each array entry is valid when the            *01328000
                         corresponding bit in                          *01329000
                         IXLYAMDCFCP_AffinityValid is on. Valid values *01330000
                         are 0-255.                                     01331000
         ORG   IXLYAMDCFCP_SAP_AFFINITY+4                               01332000
         DS    CL40      Reserved                                       01333000
IXLYAMDCFCPINFO_LEN EQU *-IXLYAMDCFCPINFO                               01334000
.L0032   ANOP                                                           01335000
         AIF   ('&IXLYAMDSTRL' EQ 'NO').L0036                           01336000
         AIF   ('&DSECT' EQ 'YES').L0037                                01337000
         AIF   ('&IXLYAMDSTRL' NE 'YES').L0036                          01338000
.L0037   ANOP                                                           01339000
*                                                                       01340000
* ********************* CFCP ** Channel Path Data ****************** *  01341000
* *            End of Coupling Facility Channel Path Entry           *  01342000
* ********************************************************************  01343000
* **************** Structure Entry for List***************************  01344000
* ********************************************************************  01345000
* ******LIST*******Header*********************************************  01346000
*                                                                       01347000
*                                                                       01348000
         AIF   ('&DSECT' EQ 'YES').L0038                                01349000
IXLYAMDSTRL DS 0F        Structure Entry for List Structure (STRL)      01350000
         AGO   .L0039                                                   01351000
.L0038   ANOP                                                           01352000
IXLYAMDSTRL DSECT        Structure Entry for List Structure (STRL)      01353000
.L0039   ANOP                                                           01354000
IXLYAMDSTRL_TYPE DS B    X'21' -- indicates STR data for CF             01355000
         DS    CL3       Unused                                         01356000
IXLYAMDSTRL_LENGTH DS F  Length of IXLYAMDSTR entry mapping             01357000
IXLYAMDSTRL_STRNEXT DS A Address of next STR entry. A value of 0 means *01358000
                         last entry for this facility.                  01359000
         ORG   IXLYAMDSTRL_STRNEXT                                      01360000
IXLYAMDSTRL_STRNEXT_OFF DS F Offset of next STR entry. A value of 0    *01361000
                         means last entry for this facility.            01362000
*                                                                       01363000
* *******LIST****Configuration Data ******************************** *  01364000
*                                                                       01365000
*                                                                       01366000
IXLYAMDSTRL_TTY DS X     Structure type identifier                      01367000
IXLYAMDSTRL_TTY_STATUS DS CL1                                           01368000
*  Bit definitions:                                                     01369000
IXLYAMDSTRL_TYPESERLIST EQU X'80' The List structure is a serialized   *01370000
                         list                                           01371000
IXLYAMDSTRL_RBLDVALID EQU X'40' The structure rebuild status           *01372000
                         indications reported in the                   *01373000
                         IXLYAMDSTRL_RBLDStatus are valid -- These     *01374000
                         values will only be valid and reported when   *01375000
                         information is requested for a particular     *01376000
                         structure                                      01377000
IXLYAMDSTRL_SID DS H     Structure ID                                   01378000
IXLYAMDSTRL_VERSION DS BL8 Structure version number. Changes when a    *01379000
                         new physical instance of the structure is     *01380000
                         allocated (e.g., user- or system-managed      *01381000
                         rebuild), and there is at least one active    *01382000
                         connector to observe the allocation.           01383000
         ORG   IXLYAMDSTRL_VERSION                                      01384000
IXLYAMDSTRL_PHYSICALVERSION DS BL8 Structure version number. Changes   *01385000
                         when a new physical instance of the structure *01386000
                         is allocated (e.g., user- or system-managed   *01387000
                         rebuild), and there is at least one active    *01388000
                         connector to observe the allocation. See also *01389000
                         IXLYAMDSSCC_CopyVersion.                       01390000
IXLYAMDSTRL_STRNAME DS CL16 Structure name                              01391000
IXLYAMDSTRL_RBLDSTATUS DS B Rebuild status flags This information will *01392000
                         only be valid if IXLYAMDSTRL_RBLDValid is     *01393000
                         set.                                           01394000
*  Bit definitions:                                                     01395000
IXLYAMDSTRL_STRINREBLD EQU X'80' ON indicates that the structure is in *01396000
                         rebuild                                        01397000
IXLYAMDSTRL_REBLDOLDSTR EQU X'40' ON indicates that the structure      *01398000
                         information pertains to the OLD structure      01399000
IXLYAMDSTRL_REBLDNEWSTR EQU X'20' ON indicates that the structure      *01400000
                         information pertains to the NEW structure      01401000
IXLYAMDSTRL_REBLDDUPLEXSTR EQU X'10' ON indicates the structure        *01402000
                         rebuild is a duplexing rebuild. OFF indicates *01403000
                         the structure rebuild is a normal rebuild.    *01404000
                         This bit only applies when                    *01405000
                         IXLYAMDSTRL_StrInRebld is on.                  01406000
IXLYAMDSTRL_REBLDMETHODSTR EQU X'08' ON indicates the structure        *01407000
                         rebuild is system managed. OFF indicates the  *01408000
                         structure rebuild is user managed. This bit   *01409000
                         only applies when IXLYAMDSTRL_StrInRebld is   *01410000
                         on.                                            01411000
         DS    CL3                                                      01412000
*                                                                       01413000
* ******LIST***************** Measurement Data ********************* *  01414000
*                                                                       01415000
*                                                                       01416000
IXLYAMDSTRL_STATUS DS CL1 Structure status bits                         01417000
*  Bit definitions:                                                     01418000
IXLYAMDSTRL_AMVALID EQU X'80' The following measurement data is valid   01419000
IXLYAMDSTRL_DUMPSERIALHELD EQU X'40' Dump serialization is held        *01420000
                         against this structure - internal operations  *01421000
                         are failed, - external operations are         *01422000
                         delayed. Hardware control data will not be    *01423000
                         available.                                     01424000
         DS    CL1       Unused                                         01425000
*                                                                       01426000
* ********************************************************************  01427000
* * Begin fields whose validity is indicated by the                     01428000
* * IXLYAMDSTRL_AMValid flag                                            01429000
* ********************************************************************  01430000
*                                                                       01431000
*                                                                       01432000
IXLYAMDSTRL_AMDATASEQUENCE DS H Sequence number associated with this   *01433000
                         instance of Measurement Data from this        *01434000
                         system.                                        01435000
IXLYAMDSTRL_REQCT DS F   Total requests by structure (this relates to  *01436000
                         external requests such as IXLLIST macro       *01437000
                         invocations, NOT to requests sent to the      *01438000
                         facility).                                     01439000
IXLYAMDSTRL_REQCTASYNC DS F Total asynchronous requests started (LOCK  *01440000
                         structure only)                                01441000
IXLYAMDSTRL_CONTCT DS F  Total number of requests that encountered     *01442000
                         contention on a lock table entry (LOCK        *01443000
                         structure only)                                01444000
IXLYAMDSTRL_FCONTCT DS F False contention count = Total number of      *01445000
                         requests that encountered false contention on *01446000
                         a lock table entry (LOCK structure only)       01447000
IXLYAMDSTRL_CRITICALREQUESTCOUNT DS F Total number of IXLLOCK          *01448000
                         CRITICALREQUEST=1 requests (LOCK structure    *01449000
                         only)                                          01450000
IXLYAMDSTRL_HIWORKQUEUECOUNT DS F Current count of the number of       *01451000
                         operations queued for subchannel contention    01452000
IXLYAMDSTRL_WORKQUEUECOUNT DS F Current count of the number of         *01453000
                         operations queued for subchannel contention    01454000
IXLYAMDSTRL_DELAYQUEUECOUNT DS F Current count of the number of        *01455000
                         operations delayed for dump serialization     *01456000
                         and/or a system-managed process (e.g.,        *01457000
                         rebuild)                                       01458000
IXLYAMDSTRL_DUMPSERIALRELEASED DS F Count of the number of times dump  *01459000
                         serialization was obtained and released for   *01460000
                         this structure                                 01461000
IXLYAMDSTRL_SYNCTIMECOUNT DS F Count of the number of summed times --  *01462000
                         for successful operations. This count         *01463000
                         represents synchronous operations to the      *01464000
                         coupling facility.                             01465000
IXLYAMDSTRL_SYNCSUMTIME DS CL8 Summed service time (u-sec)              01466000
IXLYAMDSTRL_SYNCSUMTIMESQR DS CL8 Summed service time (u-sec squared)   01467000
IXLYAMDSTRL_ASYNCTIMECOUNT DS F Count of the number of summed times -- *01468000
                         for asynchronous operations. This count       *01469000
                         represents asynchronous operations to the     *01470000
                         coupling facility.                             01471000
IXLYAMDSTRL_ASYNCSUMTIME DS CL8 Summed service time (u-sec)             01472000
IXLYAMDSTRL_ASYNCSUMTIMESQR DS CL8 Summed service time squared (u-sec  *01473000
                         squared)                                       01474000
IXLYAMDSTRL_QUEUETIMECOUNT DS F Count of the number of summed times -- *01475000
                         for operation queue time                       01476000
IXLYAMDSTRL_QUEUESUMTIME DS CL8 Summed queue time (u-sec)               01477000
IXLYAMDSTRL_QUEUESUMTIMESQR DS CL8 Summed queue time squared (u-sec    *01478000
                         squared)                                       01479000
IXLYAMDSTRL_DELAYTIMECOUNT DS F Count of the number of summed times -- *01480000
                         for operation delay time for dump             *01481000
                         serialization                                  01482000
IXLYAMDSTRL_DELAYSUMTIME DS CL8 Summed delay time (u-sec)               01483000
IXLYAMDSTRL_DELAYSUMTIMESQR DS CL8 Summed delay time squared (u-sec    *01484000
                         squared)                                       01485000
IXLYAMDSTRL_SYNCTOASYNCCOUNT DS F Count of the number of times a       *01486000
                         synchronous operation could not be performed  *01487000
                         synchronously and was changed to an           *01488000
                         asynchronous operation                         01489000
IXLYAMDSTRL_TOTALHIWORKCOUNT DS F Total count of the number of         *01490000
                         operations queued for subchannel contention    01491000
IXLYAMDSTRL_TOTALWORKCOUNT DS F Total count of the number of           *01492000
                         operations queued for subchannel contention    01493000
         DS    CL4       RESERVED                                       01494000
*                                                                       01495000
* ********************************************************************  01496000
* * End fields whose validity is indicated by the                       01497000
* * IXLYAMDSTRL_AMValid flag                                            01498000
* ********************************************************************  01499000
* ***LIST*****Control Structure Information ***********************  *  01500000
*                                                                       01501000
*                                                                       01502000
IXLYAMDSTRL_DATAFLAGS DS B                                              01503000
*  Bit definitions:                                                     01504000
IXLYAMDSTRL_VALID EQU X'80' The following list control structure       *01505000
                         information is valid                           01506000
IXLYAMDSTRL_VALID2 EQU X'40' More list control information valid        01507000
IXLYAMDSTRL_DTSVALID EQU X'08' Structure dump table size information   *01508000
                         is valid                                       01509000
         DS    CL2       not used                                       01510000
*                                                                       01511000
* ********************************************************************  01512000
* * Begin fields whose validity is indicated by the                     01513000
* * IXLYAMDSTRL_Valid flag                                              01514000
* ********************************************************************  01515000
*                                                                       01516000
*                                                                       01517000
IXLYAMDSTRL_FLAGS2 DS B  Flags                                          01518000
*  Bit definitions:                                                     01519000
IXLYAMDSTRL_REIPI EQU X'80' Reapportionment in progress indicator.     *01520000
                         1=structure ALTER to change ratio is in       *01521000
                         progress (LEVEL1)                              01522000
IXLYAMDSTRL_SSCI EQU X'40' Structure size change in progress           *01523000
                         indicator. 1=structure ALTER to change        *01524000
                         structure size is in progress (LEVEL1)         01525000
IXLYAMDSTRL_MREIPI EQU X'20' Monitor Reapportionment change in         *01526000
                         progress indicator. 1=structure ALTER to      *01527000
                         change Event Monitor Controls is in progress  *01528000
                         (LEVEL4)                                       01529000
IXLYAMDSTRL_IRTCEI EQU X'10' Immediate RTC completion enablement       *01530000
                         indicator. 1 ==> immediate RTC completion     *01531000
                         controls have been set for this structure,    *01532000
                         allowing enablement of the expedited duplex   *01533000
                         completion protocol. (LEVEL16)                 01534000
IXLYAMDSTRL_ENCRYPT EQU X'08' Structure data encrypted indicator.      *01535000
                         1=structure data is encrypted                  01536000
IXLYAMDSTRL_MS EQU X'04' Monopolization state. 1=structure is          *01537000
                         consuming a disproportionate share of         *01538000
                         coupling facility resources (CFLEVEL 24)       01539000
IXLYAMDSTRL_MDLES DS X   Maximum data list entry size (maximum number  *01540000
                         of elements per entry)                         01541000
IXLYAMDSTRL_STFLAGS DS B                                                01542000
         ORG   IXLYAMDSTRL_STFLAGS                                      01543000
IXLYAMDSTRL_ST DS B      Structure type values                          01544000
*  Bit definitions:                                                     01545000
IXLYAMDSTRL_ST_SKI EQU X'80' Secondary key indicator 0 ==> Secondary   *01546000
                         keys are not supported. 1 ==> Secondary keys  *01547000
                         are supported. (CF level >=9)                  01548000
IXLYAMDSTRL_ST_PLEIDI EQU X'40' Programmable LEID indicator (LEVEL8)    01549000
IXLYAMDSTRL_ST_CI EQU X'20' Count indicator. 1= list limit accounting  *01550000
                         by elements, 0 = list limit accounting by     *01551000
                         entries                                        01552000
IXLYAMDSTRL_ST_LI EQU X'10' Lock Indicator                              01553000
IXLYAMDSTRL_ST_DI EQU X'08' Data Indicator                              01554000
IXLYAMDSTRL_ST_AI EQU X'04' Adjunct indicator                           01555000
IXLYAMDSTRL_ST_NI EQU X'02' Name indicator                              01556000
IXLYAMDSTRL_ST_KI EQU X'01' Key indicator                               01557000
         ORG   IXLYAMDSTRL_STFLAGS+1                                    01558000
IXLYAMDSTRL_LTECH DS X   Lock table entry characteristic. The width of *01559000
                         a lock table entry in bytes is 2**LTECH        01560000
IXLYAMDSTRL_LELX DS X    List element characteristic. The size of a    *01561000
                         list element in bytes is 256*(2**LELX)         01562000
IXLYAMDSTRL_NLE DS F     Lock table entry count                         01563000
IXLYAMDSTRL_LC DS F      List count - number of list headers in the    *01564000
                         structure                                      01565000
IXLYAMDSTRL_SS DS F      Structure size in 4k blocks                    01566000
IXLYAMDSTRL_MSS DS F     Maximum structure size in 4K blocks.           01567000
IXLYAMDSTRL_MINSS DS F   Minimum structure size in 4K blocks. The      *01568000
                         structure may actually be allocated smaller   *01569000
                         than this, but if so, structure attributes    *01570000
                         such as entry/element ratio will differ       *01571000
                         significantly from those which were           *01572000
                         requested.                                     01573000
IXLYAMDSTRL_MLSELC DS F  Maximum number of list elements that can      *01574000
                         reside in coupling facility real storage.     *01575000
                         This count is only substantially accurate.     01576000
IXLYAMDSTRL_LSELC DS F   Number of structure list elements in the list *01577000
                         set which are currently in use that reside in *01578000
                         coupling facility real storage.                01579000
IXLYAMDSTRL_NLTEC DS F   Non-zero lock table entry count. This count   *01580000
                         is only substantially accurate.                01581000
IXLYAMDSTRL_MLSEC DS F   LIST Structure = Maximum number of list       *01582000
                         entries that can reside in coupling facility  *01583000
                         real storage for the structure. LOCK          *01584000
                         Structure = Maximum number of record data     *01585000
                         elements. This count is only substantially    *01586000
                         accurate.                                      01587000
IXLYAMDSTRL_LSEC DS F    LIST Structure = Number of structure list     *01588000
                         entries in the list set which are currently   *01589000
                         in use that reside in coupling facility real  *01590000
                         storage. LOCK Structure = Number of record    *01591000
                         entries in the structure which are currently  *01592000
                         in use.                                        01593000
IXLYAMDSTRL_DTS DS F     Structure dump table size in 4k blocks         01594000
IXLYAMDSTRL_MRSS DS F    Marginal structure size. This is the true     *01595000
                         minimum size with which the structure can be  *01596000
                         allocated, regardless of ratio                *01597000
                         considerations. (LEVEL1)                       01598000
IXLYAMDSTRL_TSS DS F     Target structure size. For a CFLEVEL 0        *01599000
                         facility, the target structure size will be   *01600000
                         equal to the actual structure size. For a     *01601000
                         CFLEVEL 1 or higher facility, the target      *01602000
                         structure size will be equal to the target    *01603000
                         structure size specified on the initial       *01604000
                         allocate or subsequent expand or contract     *01605000
                         request. The target size may or may not be    *01606000
                         equal to the actual size. (LEVEL1)             01607000
IXLYAMDSTRL_TMELC DS F   Target maximum element count. For a CFLEVEL 0 *01608000
                         facility the target maximum element count     *01609000
                         will be equal to the actual maximum element   *01610000
                         count. For CFLEVEL 1 or higher facilities,    *01611000
                         the target maximum element count will reflect *01612000
                         the target ratio specified on the initial     *01613000
                         allocate or subsequent reapportionment        *01614000
                         request. This may or may not equal the actual *01615000
                         maximum element count. (LEVEL1)                01616000
IXLYAMDSTRL_TMEC DS F    Target maximum entry count. For a CFLEVEL 0   *01617000
                         facility the target maximum entry count will  *01618000
                         be equal to the actual maximum entry count.   *01619000
                         For CFLEVEL 1 or higher facilities, the       *01620000
                         target maximum entry count will reflect the   *01621000
                         target ratio specified on the initial         *01622000
                         allocate or subsequent reapportionment        *01623000
                         request. This may or may not equal the actual *01624000
                         maximum entry count. (LEVEL1)                  01625000
IXLYAMDSTRL_PETELR DS F  Pending entry to element ratio. This field is *01626000
                         only applicable to CFLEVEL 1 or higher        *01627000
                         facilities. (LEVEL1)                           01628000
         ORG   IXLYAMDSTRL_PETELR                                       01629000
IXLYAMDSTRL_PETELR_ENTRY DS H Entry ratio portion (LEVEL1)              01630000
IXLYAMDSTRL_PETELR_ELEMENT DS H Element ratio portion (LEVEL1)          01631000
IXLYAMDSTRL_EMCCNT DS F  Count of Event Monitor Control (EMC) objects  *01632000
                         in use by the structure. Applicable only if   *01633000
                         structure allocated in CFLEVEL 3 or higher    *01634000
                         facility.                                      01635000
IXLYAMDSTRL_MAXEMCCNT DS F Maximum number of EMCs for the structure.   *01636000
                         Applicable only if structure allocated in     *01637000
                         CFLEVEL 3 or higher facility.                  01638000
IXLYAMDSTRL_TMAXEMCCNT DS F Target Maximum number of EMCs for the      *01639000
                         structure. Applicable only if structure       *01640000
                         allocated in CFLEVEL 3 or higher facility.     01641000
*                                                                       01642000
* ********************************************************************  01643000
* * End fields whose validity is indicated by the                       01644000
* * IXLYAMDSTRL_Valid flag                                              01645000
* ********************************************************************  01646000
*                                                                       01647000
*                                                                       01648000
IXLYAMDSTRL_LEN EQU *-IXLYAMDSTRL                                       01649000
.L0036   ANOP                                                           01650000
         AIF   ('&IXLYAMDSTRL1' EQ 'NO').L003A                          01651000
         AIF   ('&DSECT' EQ 'YES').L003B                                01652000
         AIF   ('&IXLYAMDSTRL1' NE 'YES').L003A                         01653000
IXLYAMDSTRL1 DS 0F       Structure Entry for a List Structure (STRL),  *01654000
                         AmdaLevel>=1                                   01655000
         AGO   .L003C                                                   01656000
.L003B   ANOP                                                           01657000
IXLYAMDSTRL1 DSECT       Structure Entry for a List Structure (STRL),  *01658000
                         AmdaLevel>=1                                   01659000
.L003C   ANOP                                                           01660000
         DS    CL264     Mapped by IXLYAMDSTRL                          01661000
*                                                                       01662000
* ********************************************************************  01663000
* * Begin fields whose validity is indicated by the                     01664000
* * IXLYAMDSTRL_Valid flag                                              01665000
* ********************************************************************  01666000
*                                                                       01667000
*                                                                       01668000
IXLYAMDSTRL_TEMCSTGPCT DS H Pending percent of structure storage to be *01669000
                         used as EMCs, expressed in hundredths of a    *01670000
                         percent (ie. range is 0 to 10000)              01671000
IXLYAMDSTRL1_FLAGS DS B  Flags                                          01672000
*  Bit definitions:                                                     01673000
IXLYAMDSTRL1_WRTCLI EQU X'80' Wait on ready to complete list indicator *01674000
                         - Indicates that the sending of the RTC       *01675000
                         signal is delayed until the RTC is received.  *01676000
                         During this time no resources can be held for *01677000
                         the list item being processed. (LEVEL11)       01678000
IXLYAMDSTRL1_PCQC EQU X'40' Asynchronous duplexing operation queue     *01679000
                         control, bit 0. Indicates whether an          *01680000
                         operation queue has been created for the      *01681000
                         structure for asynchronous duplexing. 0 = No  *01682000
                         asynchronous duplexing operation queue        *01683000
                         exists. 1 = An asynchronous duplexing         *01684000
                         operation queue has been created for the      *01685000
                         structure. (LEVEL21)                           01686000
IXLYAMDSTRL1_DPLXST EQU X'20' Duplexing state. ON => structure is in   *01687000
                         the duplexing active state. (LEVEL10)          01688000
IXLYAMDSTRL1_MI EQU X'10' Designated master structure - Indicates that *01689000
                         RTC signal will always be sent first.         *01690000
                         (LEVEL24)                                      01691000
IXLYAMDSTRL1_DPLXT EQU X'03' Duplexing type. Valid when                *01692000
                         IxlyamdStrL1_DPLXST is on. See constants      *01693000
                         IXLYAMDA_DPLXT_Xxx. (LEVEL21)                  01694000
         ORG   IXLYAMDSTRL1_FLAGS+1                                     01695000
IXLYAMDSTRL1_PCQCH DS X  Asynchronous duplexing operation queue        *01696000
                         characteristic. The number of queue entries   *01697000
                         is the product of 4096 and 2 raised to the    *01698000
                         power of PCQCH. (LEVEL21)                      01699000
IXLYAMDSTRL1_LSCUR DS F  List set cursor (LEVEL8)                       01700000
IXLYAMDSTRL1_SCCVN DS F  Structure copy controls version number        *01701000
                         (LEVEL8)                                       01702000
IXLYAMDSTRL1_SXTIME DS CL8 Structure related CPU execution time        *01703000
                         (LEVEL15)                                      01704000
IXLYAMDSTRL1_SLND DS F   Subsidiary list notification delay. Bit       *01705000
                         positions 0-31 correspond to bit positions    *01706000
                         32-63 of the CPU timer. Bit 19 represents one *01707000
                         microsecond. (CFLEVEL>=16)                     01708000
IXLYAMDSTRL1_MUID DS X   Maximum user id limit for the structure        01709000
         DS    CL3       Reserved                                       01710000
*                                                                       01711000
* ********************************************************************  01712000
* * End fields whose validity is indicated by the                       01713000
* * IXLYAMDSTRL_Valid flag                                              01714000
* ********************************************************************  01715000
*                                                                       01716000
*                                                                       01717000
IXLYAMDSTRL1_SSCMADDR DS A Address of the structure storage-class      *01718000
                         memory record (SSCM) for this structure. A    *01719000
                         non-zero value will be returned when          *01720000
                         HWSTATISTICS=(YES) or the STRNAME keyword is  *01721000
                         specified, AMDALEVEL=(1 or higher) is         *01722000
                         specified, and the coupling facility in which *01723000
                         the structure resides can use storage-class   *01724000
                         memory extensions (CFLEVEL 19 or higher). A   *01725000
                         value of zero means that the SSCM record was  *01726000
                         not provided for this structure because it     01727000
*                        was not requested, not available, or the      *01728000
                         coupling facility in which the structure      *01729000
                         resides does not support storage-class memory *01730000
                         extensions                                     01731000
         ORG   IXLYAMDSTRL1_SSCMADDR                                    01732000
IXLYAMDSTRL1_SSCM_OFF DS F Offset of the structure storage-class       *01733000
                         memory record (SSCM) for this structure. A    *01734000
                         non-zero value will be returned when          *01735000
                         HWSTATISTICS=(YES) or the STRNAME keyword is  *01736000
                         specified, AMDALEVEL=(1 or higher) is         *01737000
                         specified, and the coupling facility in which *01738000
                         the structure resides can use storage-class   *01739000
                         memory extensions (CFLEVEL 19 or higher). A   *01740000
                         value of zero means that the SSCM record was  *01741000
                         not provided for this structure because it     01742000
*                        was not requested, not available, or the      *01743000
                         coupling facility in which the structure      *01744000
                         resides does not support storage-class memory *01745000
                         extensions.                                    01746000
*                                                                       01747000
* ********************************************************************  01748000
* * Begin fields whose validity is indicated by the                     01749000
* * IXLYAMDSTRL_Valid flag                                              01750000
* ********************************************************************  01751000
*                                                                       01752000
*                                                                       01753000
IXLYAMDSTRL1_LND DS F    List Notification Delay value for the         *01754000
                         structure. Bit positions 0-31 correspond to   *01755000
                         bit positions 32-63 of the CPU timer. Bit 19  *01756000
                         represents one microsecond. (CFLEVEL>=22)      01757000
IXLYAMDSTRL1_KRND DS F   Key-Range Notification Delay value for the    *01758000
                         structure. Bit positions 0-31 correspond to   *01759000
                         bit positions 32-63 of the CPU timer. Bit 19  *01760000
                         represents one microsecond. (CFLEVEL>=22)      01761000
*                                                                       01762000
* ********************************************************************  01763000
* * End fields whose validity is indicated by the                       01764000
* * IXLYAMDSTRL_Valid flag                                              01765000
* ********************************************************************  01766000
* ********************************************************************  01767000
* * Begin fields whose validity is indicated by the                     01768000
* * IXLYAMDSTRL_AMValid flag                                            01769000
* ********************************************************************  01770000
*                                                                       01771000
*                                                                       01772000
IXLYAMDSTRL1_OPCTSCMACCESS DS F Count of successful requests to the    *01773000
                         coupling facility that encountered an SCM     *01774000
                         (Storage-Class Memory) Access Required        *01775000
                         condition. (LEVEL19)                           01776000
IXLYAMDSTRL1_SCMACCESSCOUNT DS F Count of SCM (Storage-Class Memory)   *01777000
                         Access Required conditions that require the   *01778000
                         request to be restarted. (LEVEL19)             01779000
IXLYAMDSTRL1_PEERLINKUNAVAILABLECOUNT DS F Count of Peer Link Not      *01780000
                         Available conditions (LEVEL10)                 01781000
IXLYAMDSTRL1_EXECUTIONSUPPRESSEDCOUNT DS F Count of Execution          *01782000
                         Suppressed conditions (LEVEL10)                01783000
IXLYAMDSTRL1_PEERWAITSCHTIMECOUNT DS F Count of the number of times a  *01784000
                         duplexed request was holding a subchannel     *01785000
                         while waiting for a peer request to be        *01786000
                         started. (LEVEL10)                             01787000
IXLYAMDSTRL1_PEERWAITSCHSUMTIME DS CL8 Summed peer subchannel wait     *01788000
                         time (u-sec) (LEVEL10)                         01789000
IXLYAMDSTRL1_PEERWAITSCHSUMTIMESQR DS CL8 Summed peer subchannel wait  *01790000
                         time squared (u-sec squared) (LEVEL10)         01791000
IXLYAMDSTRL1_PEERWAITRSVTIMECOUNT DS F Count of the number of times a  *01792000
                         request is holding a subchannel in reserve    *01793000
                         while waiting for a peer subchannel to become *01794000
                         available to start a duplexed request.        *01795000
                         (LEVEL10)                                      01796000
IXLYAMDSTRL1_PEERWAITRSVSUMTIME DS CL8 Summed peer subchannel wait     *01797000
                         with reserve time (u-sec) (LEVEL10)            01798000
IXLYAMDSTRL1_PEERWAITRSVSUMTIMESQR DS CL8 Summed peer subchannel wait  *01799000
                         with reserve time squared (u-sec squared)     *01800000
                         (LEVEL10)                                      01801000
IXLYAMDSTRL1_PEERWAITCOMPTIMECOUNT DS F Count of the number of         *01802000
                         "waiting for peer completion" times reported. *01803000
                         One of the two duplexed operations has        *01804000
                         completed, but the completed subchannel       *01805000
                         remains unavailable for use until the peer    *01806000
                         operation completes. (LEVEL10)                 01807000
IXLYAMDSTRL1_PEERWAITCOMPSUMTIME DS CL8 Summed waiting for peer        *01808000
                         completion times. (u-sec) (LEVEL10)            01809000
IXLYAMDSTRL1_PEERWAITCOMPSUMTIMESQR DS CL8 Square of the sum of the    *01810000
                         waiting for peer completion time. (u-sec      *01811000
                         squared) (LEVEL10)                             01812000
IXLYAMDSTRL1_LOGICALVERSION DS BL8 Logical structure version number.   *01813000
                         Used in conjunction with the physical version *01814000
                         number to identify an instance of a           *01815000
                         structure. The value of this field is set     *01816000
                         equal to the physical version number when the *01817000
                         structure is initially allocated. It changes  *01818000
                         when a process that allocates a new instance  *01819000
                         of the structure (e.g., rebuild) is           *01820000
                         user-managed, but not when it is              *01821000
                         system-managed.                                01822000
*                                                                       01823000
* ********************************************************************  01824000
* * End fields whose validity is indicated by the                       01825000
* * IXLYAMDSTRL_AMValid flag                                            01826000
* ********************************************************************  01827000
*                                                                       01828000
*                                                                       01829000
IXLYAMDSTRL1_SSCCADDR DS A Address of the structure copy controls      *01830000
                         information entry for this structure. A value *01831000
                         of zero means that the SSCC record was not    *01832000
                         provided for this structure because it was    *01833000
                         not requested, not available, or contained no *01834000
                         information.                                   01835000
         ORG   IXLYAMDSTRL1_SSCCADDR                                    01836000
IXLYAMDSTRL1_SSCC_OFF DS F Offset of the structure copy controls       *01837000
                         information entry for this structure. A value *01838000
                         of zero means that the SSCC record was not    *01839000
                         provided for this structure because it was    *01840000
                         not requested, not available, or contained no *01841000
                         information.                                   01842000
IXLYAMDSTRL1_LEN EQU *-IXLYAMDSTRL1                                     01843000
.L003A   ANOP                                                           01844000
         AIF   ('&IXLYAMDSTRL2' EQ 'NO').L003D                          01845000
         AIF   ('&DSECT' EQ 'YES').L003E                                01846000
         AIF   ('&IXLYAMDSTRL2' NE 'YES').L003D                         01847000
IXLYAMDSTRL2 DS 0F       Structure Entry for a List Structure (STRL),  *01848000
                         AmdaLevel>=2                                   01849000
         AGO   .L003F                                                   01850000
.L003E   ANOP                                                           01851000
IXLYAMDSTRL2 DSECT       Structure Entry for a List Structure (STRL),  *01852000
                         AmdaLevel>=2                                   01853000
.L003F   ANOP                                                           01854000
         DS    CL392     Mapped by IXLYAMDSTRL1                         01855000
IXLYAMDSTRL2_ADUPADDR DS A Address of the structure asynchronous       *01856000
                         duplexing record (ADUP) for this structure. A *01857000
                         non-zero value may be returned when           *01858000
                         HWSTATISTICS=(YES) or the STRNAME keyword is  *01859000
                         specified, AMDALEVEL=(2 or higher) is         *01860000
                         specified, and the coupling facility in which *01861000
                         the structure resides supports asynchronous   *01862000
                         duplexing (CFLEVEL 21 or higher). A value of  *01863000
                         zero means that the ADUP record was not       *01864000
                         provided for this structure because it was     01865000
*                        not requested, not available, or the          *01866000
                         structure does not support asynchronous       *01867000
                         duplexing.                                     01868000
         ORG   IXLYAMDSTRL2_ADUPADDR                                    01869000
IXLYAMDSTRL2_ADUP_OFF DS F Offset of the structure asynchronous        *01870000
                         duplexing record (ADUP) for this structure. A *01871000
                         non-zero value may be returned when           *01872000
                         HWSTATISTICS=(YES) or the STRNAME keyword is  *01873000
                         specified, AMDALEVEL=(2 or higher) is         *01874000
                         specified, and the coupling facility in which *01875000
                         the structure resides supports asynchronous   *01876000
                         duplexing (CFLEVEL 21 or higher). A value of  *01877000
                         zero means that the ADUP record was not       *01878000
                         provided for this structure because it was     01879000
*                        not requested, not available, or the          *01880000
                         structure does not support asynchronous       *01881000
                         duplexing.                                     01882000
*                                                                       01883000
* ********************************************************************  01884000
* * Begin fields whose validity is indicated by the                     01885000
* * IXLYAMDSTRL_AMValid flag                                            01886000
* ********************************************************************  01887000
*                                                                       01888000
*                                                                       01889000
IXLYAMDSTRL2_ADUPDELAYOPCOUNT DS F Count of asynchronously-duplexed CF *01890000
                         operations that were delayed because the      *01891000
                         primary CF was unable to accept new requests, *01892000
                         either because it could not push requests to  *01893000
                         the secondary CF or because the secondary CF  *01894000
                         could not process incoming requests.          *01895000
                         Applicable only if IxlyamdStrL2_AsynchDupPri  *01896000
                         is ON.                                         01897000
IXLYAMDSTRL2_ADUPDELAYREQCOUNT DS F Count of asynchronously-duplexed   *01898000
                         requests that ever experienced a delayed      *01899000
                         operation because the primary CF was unable   *01900000
                         to accept new requests. Applicable only if    *01901000
                         IxlyamdStrL2_AsynchDupPri is ON.               01902000
IXLYAMDSTRL2_IXLADUPXCOUNT DS F Total number of IXLADUPX requests.     *01903000
                         Applicable only if IxlyamdStrL2_AsynchDupSec  *01904000
                         is ON.                                         01905000
IXLYAMDSTRL2_IXLADUPXSUSPENDCOUNT DS F Total number of IXLADUPX        *01906000
                         requests that were suspended waiting for the  *01907000
                         operations to complete in the secondary       *01908000
                         structure of the current duplexing instance.  *01909000
                         Applicable only if IxlyamdStrL2_AsynchDupSec  *01910000
                         is ON.                                         01911000
IXLYAMDSTRL2_IXLADUPXSUSPENDTIME DS CL8 Summed suspend time for        *01912000
                         IXLADUPX invocations that were waiting for    *01913000
                         operations to complete in the secondary       *01914000
                         structure of the current duplexing instance   *01915000
                         (in u-sec). Applicable only if                *01916000
                         IxlyamdStrL2_AsynchDupSec is ON.               01917000
IXLYAMDSTRL2_IXLADUPXSUSPENDTIMESQR DS CL8 Square of the summed        *01918000
                         suspend time for IXLADUPX invocations that    *01919000
                         were waiting for operations to complete in    *01920000
                         the secondary structure of the current        *01921000
                         duplexing instance (in u-sec squared).        *01922000
                         Applicable only if IxlyamdStrL2_AsynchDupSec  *01923000
                         is ON.                                         01924000
IXLYAMDSTRL2_FLAGS DS B                                                 01925000
*  Bit definitions:                                                     01926000
IXLYAMDSTRL2_ASYNCHDUPPRI EQU X'80' ON => this record represents the   *01927000
                         primary instance of an asynchronously-        *01928000
                         duplexed structure                             01929000
IXLYAMDSTRL2_ASYNCHDUPSEC EQU X'40' ON => this record represents the   *01930000
                         secondary instance of an asynchronously-      *01931000
                         duplexed structure                             01932000
*                                                                       01933000
* ********************************************************************  01934000
* * End fields whose validity is indicated by the                       01935000
* * IXLYAMDSTRL_AMValid flag                                            01936000
* ********************************************************************  01937000
* ********************************************************************  01938000
* * Begin fields whose validity is indicated by the                     01939000
* * IXLYAMDSTRL_Valid2 flag                                             01940000
* ********************************************************************  01941000
*                                                                       01942000
*                                                                       01943000
         ORG   IXLYAMDSTRL2_FLAGS+1                                     01944000
IXLYAMDSTRL2_PCTENTRYRSV DS X Composite percent entry reserve for the  *01945000
                         structure (LEVEL25). A value of zero means    *01946000
                         that no percent entry reserve is established  *01947000
                         for the structure or the CF where the         *01948000
                         structure is allocated does not support       *01949000
                         percent entry reserve threshold. NOT          *01950000
                         applicable when IxlyamdStrL2_AsynchDupSec is  *01951000
                         ON.                                            01952000
*                                                                       01953000
* ********************************************************************  01954000
* * End fields whose validity is indicated by the                       01955000
* * IXLYAMDSTRL_Valid2 flag                                             01956000
* ********************************************************************  01957000
*                                                                       01958000
*                                                                       01959000
         DS    CL26      Reserved                                       01960000
IXLYAMDSTRL2_LEN EQU *-IXLYAMDSTRL2                                     01961000
.L003D   ANOP                                                           01962000
         AIF   ('&IXLYAMDSTRL3' EQ 'NO').L0040                          01963000
         AIF   ('&DSECT' EQ 'YES').L0041                                01964000
         AIF   ('&IXLYAMDSTRL3' NE 'YES').L0040                         01965000
.L0041   ANOP                                                           01966000
*                                                                       01967000
* ********************************************************************  01968000
* *            Write and Read Request Measurement Data                  01969000
*                                                                       01970000
*   The metrics in IXLAMDSTRL3 represent the number of structure        01971000
*   entry write and read requests issued to a structure and the         01972000
*   amount of data associated with the number of structure entry        01973000
*   data elements and entry adjunct data written and read to and        01974000
*   from a structure.                                                   01975000
*                                                                       01976000
*   For structures that contain encrypted data, the read entry data     01977000
*   amounts (i.e., IxlyamdStrl3_ReadEntryData and                       01978000
*   IxlyamdStrl3_ReadEntryDataSQR) are a summation of what is           01979000
*   returned in the list entry controls (LCTL) for each list entry      01980000
*   read by a single entry read request or by a multiple entry read     01981000
*   request.                                                            01982000
*                                                                       01983000
*   For structures that contain non-encrypted data, the read entry      01984000
*   data amounts for single entry read requests are computed            01985000
*   as they are for structures that contain encrypted data.  The        01986000
*   read entry data amounts for multiple entry read requests (e.g.,     01987000
*   Read_List or Read_Mult) are based on an average number of           01988000
*   data elements returned per entry by the request.                    01989000
* ********************************************************************  01990000
*                                                                       01991000
*                                                                       01992000
         AIF   ('&DSECT' EQ 'YES').L0042                                01993000
IXLYAMDSTRL3 DS 0D       Structure Entry for a List Structure (STRL),  *01994000
                         AmdaLevel>=3                                   01995000
         AGO   .L0043                                                   01996000
.L0042   ANOP                                                           01997000
IXLYAMDSTRL3 DSECT       Structure Entry for a List Structure (STRL),  *01998000
                         AmdaLevel>=3                                   01999000
.L0043   ANOP                                                           02000000
         DS    CL456     Mapped by IXLYAMDSTRL2                         02001000
*                                                                       02002000
* ********************************************************************  02003000
* * Begin fields whose validity is indicated by the                     02004000
* * IXLYAMDSTRL_AMValid flag                                            02005000
* ********************************************************************  02006000
*                                                                       02007000
*                                                                       02008000
IXLYAMDSTRL3_WRITEDATAREQUESTS DS F Count of write requests that       *02009000
                         request data elements be written for a        *02010000
                         structure entry                                02011000
IXLYAMDSTRL3_WRITEADJUNCTCOUNT DS F Count of adjunct areas transferred *02012000
                         to the CF for write requests                   02013000
IXLYAMDSTRL3_READDATAREQUESTS DS F count of read requests that request *02014000
                         entry data be returned                         02015000
IXLYAMDSTRL3_READADJUNCTCOUNT DS F Count of adjunct areas transferred  *02016000
                         by the CF and returned on read requests        02017000
IXLYAMDSTRL3_WRITEENTRYCOUNT DS F Count of the number of data entries  *02018000
                         written with data elements. Accounts for      *02019000
                         single and multi entry write requests          02020000
IXLYAMDSTRL3_READENTRYCOUNT DS F Count of the number of data entries   *02021000
                         read that contain data elements returned on   *02022000
                         read requests. Accounts for single and multi  *02023000
                         entry read requests                            02024000
IXLYAMDSTRL3_WRITEENTRYDATA DS FL8 Summed number of bytes of entry     *02025000
                         data in 256-byte increments written to the    *02026000
                         structure for the number of entry data        *02027000
                         elements written                               02028000
IXLYAMDSTRL3_WRITEENTRYDATASQR DS FL8 Square of the summed number of   *02029000
                         bytes of entry data in 256-byte increments    *02030000
                         written to the structure for the number of    *02031000
                         entry data elements written                    02032000
IXLYAMDSTRL3_READENTRYDATA DS FL8 Summed number of bytes of entry data *02033000
                         in 256-byte increments read and transferred   *02034000
                         by the CF.                                     02035000
IXLYAMDSTRL3_READENTRYDATASQR DS FL8 Square of the summed number of    *02036000
                         bytes of entry data in 256-byte increments    *02037000
                         read and transferred by the CF                 02038000
*                                                                       02039000
* ********************************************************************  02040000
* * End fields whose validity is indicated by the                       02041000
* * IXLYAMDSTRL_AMValid flag                                            02042000
* ********************************************************************  02043000
*                                                                       02044000
*                                                                       02045000
         DS    CL32      Reserved                                       02046000
IXLYAMDSTRL3_LEN EQU *-IXLYAMDSTRL3                                     02047000
.L0040   ANOP                                                           02048000
         AIF   ('&IXLYAMDSTRL4' EQ 'NO').L0044                          02049000
         AIF   ('&DSECT' EQ 'YES').L0045                                02050000
         AIF   ('&IXLYAMDSTRL4' NE 'YES').L0044                         02051000
IXLYAMDSTRL4 DS 0D       Structure Entry for a List Structure (STRL),  *02052000
                         AmdaLevel>=4                                   02053000
         AGO   .L0046                                                   02054000
.L0045   ANOP                                                           02055000
IXLYAMDSTRL4 DSECT       Structure Entry for a List Structure (STRL),  *02056000
                         AmdaLevel>=4                                   02057000
.L0046   ANOP                                                           02058000
         DS    CL544     Mapped by IXLYAMDSTRL3                         02059000
*                                                                       02060000
* ********************************************************************  02061000
* * Begin fields whose validity is indicated by the                     02062000
* * IXLYAMDSTRL_AMValid flag                                            02063000
* ********************************************************************  02064000
*                                                                       02065000
*                                                                       02066000
IXLYAMDSTRL4_CFMONOPTIMECOUNT DS F Count of summed queue time - for    *02067000
                         operations queued due to coupling facility    *02068000
                         resource monopolization                        02069000
IXLYAMDSTRL4_CFMONOPSUMTIME DS CL8 Summed queue time - for operations  *02070000
                         queued due to coupling facility resource      *02071000
                         monopolization (u-sec)                         02072000
IXLYAMDSTRL4_CFMONOPSUMTIMESQR DS CL8 Summed queue time squared - for  *02073000
                         operations queued due to coupling facility    *02074000
                         resource monopolization (u-sec squared)        02075000
IXLYAMDSTRL4_TOTALWORKCOUNTMONOP DS F Total count of operations queued *02076000
                         for CF monopolization avoidance.               02077000
IXLYAMDSTRL4_TOTALHIWORKCOUNTMONOP DS F Total count of high priority   *02078000
                         operations queued for CF monopolization       *02079000
                         avoidance.                                     02080000
IXLYAMDSTRL4_WORKQUEUECOUNTMONOP DS F Current count of operations      *02081000
                         queued for CF monopolization avoidance         02082000
IXLYAMDSTRL4_HIWORKQUEUECOUNTMONOP DS F Current count of high priority *02083000
                         operations queued for CF monopolization       *02084000
                         avoidance.                                     02085000
*                                                                       02086000
* ********************************************************************  02087000
* * End fields whose validity is indicated by the                       02088000
* * IXLYAMDSTRL_AMValid flag                                            02089000
* ********************************************************************  02090000
*                                                                       02091000
*                                                                       02092000
         DS    CL188     Reserved                                       02093000
IXLYAMDSTRL4_LEN EQU *-IXLYAMDSTRL4                                     02094000
.L0044   ANOP                                                           02095000
         AIF   ('&IXLYAMDSTRC' EQ 'NO').L0047                           02096000
         AIF   ('&DSECT' EQ 'YES').L0048                                02097000
         AIF   ('&IXLYAMDSTRC' NE 'YES').L0047                          02098000
.L0048   ANOP                                                           02099000
*                                                                       02100000
* ********************************************************************  02101000
* **************** Structure Entry for Cache**************************  02102000
* ********************************************************************  02103000
* ***CACHE*********Header*********************************************  02104000
*                                                                       02105000
*                                                                       02106000
         AIF   ('&DSECT' EQ 'YES').L0049                                02107000
IXLYAMDSTRC DS 0F        Structure Entry for a Cache Structure (STRC)   02108000
         AGO   .L004A                                                   02109000
.L0049   ANOP                                                           02110000
IXLYAMDSTRC DSECT        Structure Entry for a Cache Structure (STRC)   02111000
.L004A   ANOP                                                           02112000
IXLYAMDSTRC_TYPE DS B    X'22' -- indicates STR data for CF             02113000
         DS    CL3       Unused                                         02114000
IXLYAMDSTRC_LENGTH DS F  Length of IXLYAMDSTR entry mapping             02115000
IXLYAMDSTRC_STRNEXT DS A Address of next STR entry. A value of 0 means *02116000
                         last entry for this facility.                  02117000
         ORG   IXLYAMDSTRC_STRNEXT                                      02118000
IXLYAMDSTRC_STRNEXT_OFF DS F Offset of next STR entry. A value of 0    *02119000
                         means last entry for this facility.            02120000
IXLYAMDSTRC_SCSC@ DS A   Address of the SCSC entry. A value of 0 means *02121000
                         there is no entry for storage class data.      02122000
         ORG   IXLYAMDSTRC_SCSC@                                        02123000
IXLYAMDSTRC_SCSC_OFF DS F Offset of the SCSC entry. A value of 0 means *02124000
                         there is no entry for storage class data.      02125000
IXLYAMDSTRC_SCOC@ DS A   Address of the SCOC entry. A value of 0 means *02126000
                         there is no entry for castout class data       02127000
         ORG   IXLYAMDSTRC_SCOC@                                        02128000
IXLYAMDSTRC_SCOC_OFF DS F Offset of the SCOC entry. A value of 0 means *02129000
                         there is no entry for castout class data       02130000
*                                                                       02131000
* ***CACHE*******Configuration Data ******************************** *  02132000
*                                                                       02133000
*                                                                       02134000
IXLYAMDSTRC_TTY DS X     Structure type identifier                      02135000
IXLYAMDSTRC_TTY_STATUS DS CL1                                           02136000
*  Bit definitions:                                                     02137000
IXLYAMDSTRC_RBLDVALID EQU X'40' The structure rebuild status           *02138000
                         indications reported in the                   *02139000
                         IXLYAMDSTRC_RBLDStatus are valid -- These     *02140000
                         values will only be valid and reported when   *02141000
                         information is requested for a particular     *02142000
                         structure                                      02143000
         ORG   IXLYAMDSTRC_TTY_STATUS+1                                 02144000
IXLYAMDSTRC_SID DS H     Structure ID                                   02145000
IXLYAMDSTRC_VERSION DS BL8 Structure version number. Changes when a    *02146000
                         new physical instance of the structure is     *02147000
                         allocated (e.g., user- or system-managed      *02148000
                         rebuild), and there is at least one active    *02149000
                         connector to observe the allocation.           02150000
         ORG   IXLYAMDSTRC_VERSION                                      02151000
IXLYAMDSTRC_PHYSICALVERSION DS BL8 Structure version number. Changes   *02152000
                         when a new physical instance of the structure *02153000
                         is allocated (e.g., user- or system-managed   *02154000
                         rebuild), and there is at least one active    *02155000
                         connector to observe the allocation. See also *02156000
                         IXLYAMDSSCC_CopyVersion.                       02157000
IXLYAMDSTRC_STRNAME DS CL16 STR name                                    02158000
IXLYAMDSTRC_RBLDSTATUS DS B Rebuild status flags This information will *02159000
                         only be valid if IXLYAMDSTRC_RBLDValid is     *02160000
                         set.                                           02161000
*  Bit definitions:                                                     02162000
IXLYAMDSTRC_STRINREBLD EQU X'80' ON indicates that the structure is in *02163000
                         rebuild                                        02164000
IXLYAMDSTRC_REBLDOLDSTR EQU X'40' ON indicates that the structure      *02165000
                         information pertains to the OLD structure      02166000
IXLYAMDSTRC_REBLDNEWSTR EQU X'20' ON indicates that the structure      *02167000
                         information pertains to the NEW structure      02168000
IXLYAMDSTRC_REBLDDUPLEXSTR EQU X'10' ON indicates the structure        *02169000
                         rebuild is a duplexing rebuild. OFF indicates *02170000
                         the structure rebuild is a normal rebuild.    *02171000
                         This bit only applies when                    *02172000
                         IXLYAMDSTRC_StrInRebld is on.                  02173000
IXLYAMDSTRC_REBLDMETHODSTR EQU X'08' ON indicates the structure        *02174000
                         rebuild is system managed. OFF indicates the  *02175000
                         structure rebuild is user managed. This bit   *02176000
                         only applies when IXLYAMDSTRC_StrInRebld is   *02177000
                         on.                                            02178000
         ORG   IXLYAMDSTRC_RBLDSTATUS+1                                 02179000
         DS    CL3                                                      02180000
*                                                                       02181000
* *****CACHE***************** Measurement Data ********************* *  02182000
*                                                                       02183000
*                                                                       02184000
IXLYAMDSTRC_STATUS DS CL1 Structure status bits                         02185000
*  Bit definitions:                                                     02186000
IXLYAMDSTRC_AMVALID EQU X'80' The following measurement data is valid   02187000
IXLYAMDSTRC_DUMPSERIALHELD EQU X'40' Dump serialization is held        *02188000
                         against this structure - internal operations  *02189000
                         are failed - external operations are delayed. *02190000
                         Hardware control data will not be available.   02191000
         ORG   IXLYAMDSTRC_STATUS+1                                     02192000
         DS    CL1       Unused                                         02193000
*                                                                       02194000
* ********************************************************************  02195000
* * Begin fields whose validity is indicated by the                     02196000
* * IXLYAMDSTRC_AMValid flag                                            02197000
* ********************************************************************  02198000
*                                                                       02199000
*                                                                       02200000
IXLYAMDSTRC_AMDATASEQUENCE DS H Sequence number associated with this   *02201000
                         instance of Measurement Data from this        *02202000
                         system.                                        02203000
IXLYAMDSTRC_REQCT DS F   Total requests. This relates to external      *02204000
                         requests such as IXLCACHE macro invocations,  *02205000
                         not operations to the coupling facility.       02206000
IXLYAMDSTRC_REQCTASYNC DS F Total asynchronous requests started        *02207000
                         (unused, always zero)                          02208000
IXLYAMDSTRC_HIWORKQUEUECOUNT DS F Current count of the number of       *02209000
                         operations queued for subchannel contention    02210000
IXLYAMDSTRC_WORKQUEUECOUNT DS F Current count of the number of         *02211000
                         operations queued for subchannel contention    02212000
IXLYAMDSTRC_DELAYQUEUECOUNT DS F Current count of the number of        *02213000
                         operations delayed for dump serialization     *02214000
                         and/or a system-managed process (e.g.,        *02215000
                         rebuild)                                       02216000
IXLYAMDSTRC_DUMPSERIALRELEASED DS F Count of the number times dump     *02217000
                         serialization was obtained and released for   *02218000
                         this structure                                 02219000
IXLYAMDSTRC_SYNCTIMECOUNT DS F Count of the number of summed times --  *02220000
                         for successful synchronous operations to the  *02221000
                         facility                                       02222000
IXLYAMDSTRC_SYNCSUMTIME DS CL8 Summed service time (u-sec)              02223000
IXLYAMDSTRC_SYNCSUMTIMESQR DS CL8 Summed service time squared (u-sec   *02224000
                         squared)                                       02225000
IXLYAMDSTRC_ASYNCTIMECOUNT DS F Count of the number of summed times -- *02226000
                         for successful asynchronous operations to the *02227000
                         facility                                       02228000
IXLYAMDSTRC_ASYNCSUMTIME DS CL8 Summed service time (u-sec)             02229000
IXLYAMDSTRC_ASYNCSUMTIMESQR DS CL8 Summed service time squared (u-sec  *02230000
                         squared)                                       02231000
IXLYAMDSTRC_QUEUETIMECOUNT DS F Count of the number of summed times -- *02232000
                         for operation queue time                       02233000
IXLYAMDSTRC_QUEUESUMTIME DS CL8 Summed queue time (u-sec)               02234000
IXLYAMDSTRC_QUEUESUMTIMESQR DS CL8 Summed queue time squared (u-sec    *02235000
                         squared)                                       02236000
IXLYAMDSTRC_DELAYTIMECOUNT DS F Count of the number of summed times -- *02237000
                         for operation delay time for dump             *02238000
                         serialization                                  02239000
IXLYAMDSTRC_DELAYSUMTIME DS CL8 Summed delay time (u-sec)               02240000
IXLYAMDSTRC_DELAYSUMTIMESQR DS CL8 Summed delay time squared (u-sec    *02241000
                         squared)                                       02242000
IXLYAMDSTRC_SYNCTOASYNCCOUNT DS F Count of the number times a          *02243000
                         synchronous operation could not be performed  *02244000
                         synchronously and was changed to an           *02245000
                         asynchronous operation                         02246000
IXLYAMDSTRC_TOTALHIWORKCOUNT DS F Total count of the number of         *02247000
                         operations queued for subchannel contention    02248000
IXLYAMDSTRC_TOTALWORKCOUNT DS F Total count of the number of           *02249000
                         operations queued for subchannel contention    02250000
         DS    CL4       RESERVED                                       02251000
*                                                                       02252000
* ********************************************************************  02253000
* * End fields whose validity is indicated by the                       02254000
* * IXLYAMDSTRC_AMValid flag                                            02255000
* ********************************************************************  02256000
* *************Control Structure Information *********************** *  02257000
*                                                                       02258000
*                                                                       02259000
IXLYAMDSTRC_DATAFLAGS DS B                                              02260000
*  Bit definitions:                                                     02261000
IXLYAMDSTRC_VALID EQU X'80' The following cache control structure      *02262000
                         information is valid                           02263000
IXLYAMDSTRC_DTSVALID EQU X'08' Structure dump table size information   *02264000
                         is valid                                       02265000
         ORG   IXLYAMDSTRC_DATAFLAGS+1                                  02266000
         DS    CL2       reserved                                       02267000
*                                                                       02268000
* ********************************************************************  02269000
* * Begin fields whose validity is indicated by the                     02270000
* * IXLYAMDSTRC_Valid flag                                              02271000
* ********************************************************************  02272000
*                                                                       02273000
*                                                                       02274000
IXLYAMDSTRC_FLAGS2 DS B  Flags                                          02275000
*  Bit definitions:                                                     02276000
IXLYAMDSTRC_REIPI EQU X'80' Reapportionment in progress indicator.     *02277000
                         1=structure ALTER to change ratio is in       *02278000
                         progress (LEVEL1)                              02279000
IXLYAMDSTRC_SSCI EQU X'40' Structure size change in progress           *02280000
                         indicator. 1=structure ALTER to change        *02281000
                         structure size is in progress (LEVEL1)         02282000
IXLYAMDSTRC_IRTCEI EQU X'10' Immediate RTC completion enablement       *02283000
                         indicator. 1 ==> immediate RTC completion     *02284000
                         controls have been set for this structure,    *02285000
                         allowing enablement of the expedited duplex   *02286000
                         completion protocol. (LEVEL16)                 02287000
IXLYAMDSTRC_ENCRYPT EQU X'08' Structure data encrypted indicator.      *02288000
                         1=structure data is encrypted                  02289000
IXLYAMDSTRC_WRTCICO EQU X'04' Wait on ready to complete cache override *02290000
                         - Indicates that the sending of the RTC       *02291000
                         signal is delayed until the RTC is received.  *02292000
                         (LEVEL22)                                      02293000
IXLYAMDSTRC_MI EQU X'02' Designated master structure - Indicates that  *02294000
                         RTC signal will always be sent first.         *02295000
                         (LEVEL24)                                      02296000
IXLYAMDSTRC_MS EQU X'01' Monopolization state. 1=structure is          *02297000
                         consuming a disproportionate share of         *02298000
                         coupling facility resources (CFLEVEL 24)       02299000
         ORG   IXLYAMDSTRC_FLAGS2+1                                     02300000
IXLYAMDSTRC_TDEC DS F    Total Directory entry count. This count is    *02301000
                         only substantially accurate                    02302000
IXLYAMDSTRC_TDAEC DS F   Total Data area element count. This count is  *02303000
                         only substantially accurate                    02304000
IXLYAMDSTRC_BITS DS B                                                   02305000
*  Bit definitions:                                                     02306000
IXLYAMDSTRC_AAI EQU X'80' Adjunct Assignment indicator                  02307000
IXLYAMDSTRC_UDFOQI EQU X'40' UDF order queue indicator. CFLevel 5 or   *02308000
                         higher.                                        02309000
         ORG   IXLYAMDSTRC_BITS+1                                       02310000
IXLYAMDSTRC_MSCV DS X    Maximum storage class value                    02311000
IXLYAMDSTRC_NCM DS BL2   Name class mask. CFLEVEL=7 or higher           02312000
IXLYAMDSTRC_MCCV DS H    Maximum castout class value                    02313000
IXLYAMDSTRC_DAEX DS X    Data area element characteristic. The size of *02314000
                         a data element in bytes is 256*(2**DAEX)       02315000
IXLYAMDSTRC_MDAS DS X    Maximum data area size (i.e maximum number of *02316000
                         elements per entry)                            02317000
IXLYAMDSTRC_SS DS F      Structure size in 4K blocks                    02318000
IXLYAMDSTRC_MSS DS F     Maximum structure size in 4K blocks            02319000
IXLYAMDSTRC_MINSS DS F   Minimum structure size in 4K blocks. The      *02320000
                         structure may actually be allocated smaller   *02321000
                         than this, but if so, structure attributes    *02322000
                         such as entry/element ratio will differ       *02323000
                         significantly from those which were           *02324000
                         requested.                                     02325000
IXLYAMDSTRC_DTS DS F     Structure dump table size in 4k blocks         02326000
IXLYAMDSTRC_MRSS DS F    Marginal structure size. This is the true     *02327000
                         minimum size with which the structure can be  *02328000
                         allocated, regardless of ratio                *02329000
                         considerations. (LEVEL1)                       02330000
IXLYAMDSTRC_TSS DS F     Target structure size. For a CFLEVEL 0        *02331000
                         facility, the target structure size will be   *02332000
                         equal to the actual structure size. For a     *02333000
                         CFLEVEL 1 or higher facility, the target      *02334000
                         structure size will be equal to the target    *02335000
                         structure size specified on the initial       *02336000
                         allocate or subsequent expand or contract     *02337000
                         request. The target size may or may not be    *02338000
                         equal to the actual size. (LEVEL1)             02339000
IXLYAMDSTRC_TMELC DS F   Target maximum element count. For a CFLEVEL 0 *02340000
                         facility the target maximum element count     *02341000
                         will be equal to the actual maximum element   *02342000
                         count. For CFLEVEL 1 or higher facilities,    *02343000
                         the target maximum element count will reflect *02344000
                         the target ratio specified on the initial     *02345000
                         allocate or subsequent reapportionment        *02346000
                         request. This may or may not equal the actual *02347000
                         maximum element count. (LEVEL1)                02348000
IXLYAMDSTRC_TMEC DS F    Target maximum entry count. For a CFLEVEL 0   *02349000
                         facility the target maximum entry count will  *02350000
                         be equal to the actual maximum entry count.   *02351000
                         For CFLEVEL 1 or higher facilities, the       *02352000
                         target maximum entry count will reflect the   *02353000
                         target ratio specified on the initial         *02354000
                         allocate or subsequent reapportionment        *02355000
                         request. This may or may not equal the actual *02356000
                         maximum entry count. (LEVEL1)                  02357000
IXLYAMDSTRC_PDTDR DS F   Pending directory to data ratio. This field   *02358000
                         is only applicable to CFLEVEL 1 or higher     *02359000
                         facilities. (LEVEL1)                           02360000
         ORG   IXLYAMDSTRC_PDTDR                                        02361000
IXLYAMDSTRC_PDTDR_DIR DS H Directory ratio portion (LEVEL1)             02362000
IXLYAMDSTRC_PDTDR_DATA DS H Data element ratio portion (LEVEL1)         02363000
IXLYAMDSTRC_TSCC DS F    Total structure changed entry count. This     *02364000
                         count is only substantially accurate (LEVEL1)  02365000
IXLYAMDSTRC_TCDEC DS F   Total structure changed data element count.   *02366000
                         This count is only substantially accurate     *02367000
                         (LEVEL1)                                       02368000
         DS    CL4       Reserved                                       02369000
*                                                                       02370000
* ********************************************************************  02371000
* * End fields whose validity is indicated by the                       02372000
* * IXLYAMDSTRC_Valid flag                                              02373000
* ********************************************************************  02374000
*                                                                       02375000
*                                                                       02376000
IXLYAMDSTRC_LEN EQU *-IXLYAMDSTRC                                       02377000
.L0047   ANOP                                                           02378000
         AIF   ('&IXLYAMDSTRC1' EQ 'NO').L004B                          02379000
         AIF   ('&DSECT' EQ 'YES').L004C                                02380000
         AIF   ('&IXLYAMDSTRC1' NE 'YES').L004B                         02381000
IXLYAMDSTRC1 DS 0F       Structure Entry for a Cache Structure (STRC), *02382000
                         AmdaLevel>=1                                   02383000
         AGO   .L004D                                                   02384000
.L004C   ANOP                                                           02385000
IXLYAMDSTRC1 DSECT       Structure Entry for a Cache Structure (STRC), *02386000
                         AmdaLevel>=1                                   02387000
.L004D   ANOP                                                           02388000
         DS    CL244     Mapped by IXLYAMDSTRC                          02389000
*                                                                       02390000
* ********************************************************************  02391000
* * Begin fields whose validity is indicated by the                     02392000
* * IXLYAMDSTRC_Valid flag                                              02393000
* ********************************************************************  02394000
*                                                                       02395000
*                                                                       02396000
IXLYAMDSTRC1_WQC DS F    Write-with-castout queue count (LEVEL8)        02397000
IXLYAMDSTRC1_SCCVN DS F  Structure copy controls version number        *02398000
                         (LEVEL8)                                       02399000
IXLYAMDSTRC1_GCUDRI DS F Global count of unchanged directory entries   *02400000
                         with registered interest (LEVEL8)              02401000
IXLYAMDSTRC1_FDEC DS F   Free directory entry count (LEVEL8)            02402000
IXLYAMDSTRC1_FDAEC DS F  Free data area element count (LEVEL8)          02403000
IXLYAMDSTRC1_CCCUR DS H  Castout class cursor (LEVEL8)                  02404000
         DS    CL2       Reserved                                       02405000
IXLYAMDSTRC1_SXTIME DS CL8 Structure related CPU execution time        *02406000
                         (LEVEL15)                                      02407000
*                                                                       02408000
* ********************************************************************  02409000
* * End fields whose validity is indicated by the                       02410000
* * IXLYAMDSTRC_Valid flag                                              02411000
* ********************************************************************  02412000
*                                                                       02413000
*                                                                       02414000
         DS    CL16      Reserved                                       02415000
*                                                                       02416000
* ********************************************************************  02417000
* * Begin fields whose validity is indicated by the                     02418000
* * IXLYAMDSTRC_AMValid flag                                            02419000
* ********************************************************************  02420000
*                                                                       02421000
*                                                                       02422000
IXLYAMDSTRC1_PEERLINKUNAVAILABLECOUNT DS F Count of Peer Link Not      *02423000
                         Available conditions (LEVEL10)                 02424000
IXLYAMDSTRC1_EXECUTIONSUPPRESSEDCOUNT DS F Count of Execution          *02425000
                         Suppressed conditions (LEVEL10)                02426000
IXLYAMDSTRC1_PEERWAITSCHTIMECOUNT DS F Count of the number of times a  *02427000
                         duplexed request was holding a subchannel     *02428000
                         while waiting for a peer request to be        *02429000
                         started. (LEVEL10)                             02430000
IXLYAMDSTRC1_PEERWAITSCHSUMTIME DS CL8 Summed peer subchannel wait     *02431000
                         time (u-sec) (LEVEL10)                         02432000
IXLYAMDSTRC1_PEERWAITSCHSUMTIMESQR DS CL8 Summed peer subchannel wait  *02433000
                         time squared (u-sec squared) (LEVEL10)         02434000
IXLYAMDSTRC1_PEERWAITRSVTIMECOUNT DS F Count of the number of times a  *02435000
                         request is holding a subchannel in reserve    *02436000
                         while waiting for a peer subchannel to become *02437000
                         available to start a duplexed request.        *02438000
                         (LEVEL10)                                      02439000
IXLYAMDSTRC1_PEERWAITRSVSUMTIME DS CL8 Summed peer subchannel wait     *02440000
                         with reserve time (u-sec) (LEVEL10)            02441000
IXLYAMDSTRC1_PEERWAITRSVSUMTIMESQR DS CL8 Summed peer subchannel wait  *02442000
                         with reserve time squared (u-sec squared)     *02443000
                         (LEVEL10)                                      02444000
IXLYAMDSTRC1_PEERWAITCOMPTIMECOUNT DS F Count of the number of         *02445000
                         "waiting for peer completion" times reported. *02446000
                         One of the two duplexed operations has        *02447000
                         completed, but the completed subchannel       *02448000
                         remains unavailable for use until the peer    *02449000
                         operation completes. (LEVEL10)                 02450000
IXLYAMDSTRC1_PEERWAITCOMPSUMTIME DS CL8 Summed waiting for peer        *02451000
                         completion times. (u-sec) (LEVEL10)            02452000
IXLYAMDSTRC1_PEERWAITCOMPSUMTIMESQR DS CL8 Square of the sum of the    *02453000
                         waiting for peer completion time. (u-sec      *02454000
                         squared) (LEVEL10)                             02455000
IXLYAMDSTRC1_LOGICALVERSION DS BL8 Logical structure version number.   *02456000
                         Used in conjunction with the physical version *02457000
                         number to identify an instance of a           *02458000
                         structure. The value of this field is set     *02459000
                         equal to the physical version number when the *02460000
                         structure is initially allocated. It changes  *02461000
                         when a process that allocates a new instance  *02462000
                         of the structure (e.g., rebuild) is           *02463000
                         user-managed, but not when it is              *02464000
                         system-managed.                                02465000
*                                                                       02466000
* ********************************************************************  02467000
* * End fields whose validity is indicated by the                       02468000
* * IXLYAMDSTRC_AMValid flag                                            02469000
* ********************************************************************  02470000
*                                                                       02471000
*                                                                       02472000
IXLYAMDSTRC1_SSCCADDR DS A Address of the structure copy controls      *02473000
                         information entry for this structure. A value *02474000
                         of zero means that the SSCC record was not    *02475000
                         provided for this structure because it was    *02476000
                         not requested, not available, or contained no *02477000
                         information.                                   02478000
         ORG   IXLYAMDSTRC1_SSCCADDR                                    02479000
IXLYAMDSTRC1_SSCC_OFF DS F Offset of the structure copy controls       *02480000
                         information entry for this structure. A value *02481000
                         of zero means that the SSCC record was not    *02482000
                         provided for this structure because it was    *02483000
                         not requested, not available, or contained no *02484000
                         information.                                   02485000
IXLYAMDSTRC1_LEN EQU *-IXLYAMDSTRC1                                     02486000
.L004B   ANOP                                                           02487000
         AIF   ('&IXLYAMDSTRC2' EQ 'NO').L004E                          02488000
         AIF   ('&DSECT' EQ 'YES').L004F                                02489000
         AIF   ('&IXLYAMDSTRC2' NE 'YES').L004E                         02490000
IXLYAMDSTRC2 DS 0X       Structure Entry for a Cache Structure (STRC), *02491000
                         AmdaLevel>=2                                   02492000
         AGO   .L0050                                                   02493000
.L004F   ANOP                                                           02494000
IXLYAMDSTRC2 DSECT       Structure Entry for a Cache Structure (STRC), *02495000
                         AmdaLevel>=2                                   02496000
.L0050   ANOP                                                           02497000
         DS    CL372     Mapped by IXLYAMDSTRC1                         02498000
IXLYAMDSTRC2_LEN EQU *-IXLYAMDSTRC2                                     02499000
.L004E   ANOP                                                           02500000
         AIF   ('&IXLYAMDSTRC3' EQ 'NO').L0051                          02501000
         AIF   ('&DSECT' EQ 'YES').L0052                                02502000
         AIF   ('&IXLYAMDSTRC3' NE 'YES').L0051                         02503000
.L0052   ANOP                                                           02504000
*                                                                       02505000
* ********************************************************************  02506000
* *            Write and Read Request Measurement Data                  02507000
*                                                                       02508000
*   The metrics in IXLAMDSTRC3 represent the number of structure        02509000
*   entry write and read requests issued to a structure and the         02510000
*   amount of data associated with the number of structure entry        02511000
*   data elements and entry adjunct data written and read to and        02512000
*   from a structure.                                                   02513000
*                                                                       02514000
*   For structures that contain encrypted data, the read entry data     02515000
*   amounts (i.e., IxlyamdStrc3_ReadEntryData and                       02516000
*   IxlyamdStrc3_ReadEntryDataSQR) are a summation of what is           02517000
*   returned in the directory entry information block (DEIB)            02518000
*   for each entry read by a single entry read request or by a          02519000
*   multiple entry read request.                                        02520000
*                                                                       02521000
*   For structures that contain non-encrypted data, the read entry      02522000
*   data amounts for single entry read requests are computed            02523000
*   as they are for structures that contain encrypted data.  The        02524000
*   read entry data amounts for multiple entry read requests (e.g.,     02525000
*   Castout_Datalist) are based on an average number of                 02526000
*   data elements returned per entry by the request.                    02527000
* ********************************************************************  02528000
*                                                                       02529000
*                                                                       02530000
         AIF   ('&DSECT' EQ 'YES').L0053                                02531000
IXLYAMDSTRC3 DS 0D       Structure Entry for a Cache Structure (STRC), *02532000
                         AmdaLevel>=3                                   02533000
         AGO   .L0054                                                   02534000
.L0053   ANOP                                                           02535000
IXLYAMDSTRC3 DSECT       Structure Entry for a Cache Structure (STRC), *02536000
                         AmdaLevel>=3                                   02537000
.L0054   ANOP                                                           02538000
         DS    CL372     Mapped by IXLYAMDSTRC2                         02539000
         DS    CL4       Reserved                                       02540000
*                                                                       02541000
* ********************************************************************  02542000
* * Begin fields whose validity is indicated by the                     02543000
* * IXLYAMDSTRC_AMValid flag                                            02544000
* ********************************************************************  02545000
*                                                                       02546000
*                                                                       02547000
IXLYAMDSTRC3_WRITEDATAREQUESTS DS F Count of write requests that       *02548000
                         request data elements be written for a        *02549000
                         structure entry                                02550000
IXLYAMDSTRC3_WRITEADJUNCTCOUNT DS F Count of adjunct areas transferred *02551000
                         to the CF for write requests                   02552000
IXLYAMDSTRC3_READDATAREQUESTS DS F count of read requests that request *02553000
                         entry data be returned                         02554000
IXLYAMDSTRC3_READADJUNCTCOUNT DS F Count of adjunct transferred by the *02555000
                         CF and returned on read requests               02556000
IXLYAMDSTRC3_WRITEENTRYCOUNT DS F Count of the number of data entries  *02557000
                         written with data elements. Accounts for      *02558000
                         single and multi entry write requests          02559000
IXLYAMDSTRC3_READENTRYCOUNT DS F Count of the number of data entries   *02560000
                         read that contain data elements returned on   *02561000
                         read requests. Accounts for single and multi  *02562000
                         entry read requests                            02563000
IXLYAMDSTRC3_WRITEENTRYDATA DS FL8 Summed number of bytes of entry     *02564000
                         data in 256-byte increments written to the    *02565000
                         structure for the number of entry data        *02566000
                         elements written                               02567000
IXLYAMDSTRC3_WRITEENTRYDATASQR DS FL8 Square of the summed number of   *02568000
                         bytes of entry data in 256-byte increments    *02569000
                         written to the structure for the number of    *02570000
                         entry data elements written                    02571000
IXLYAMDSTRC3_READENTRYDATA DS FL8 Summed number of bytes of entry data *02572000
                         in 256-byte increments read and transferred   *02573000
                         by the CF.                                     02574000
IXLYAMDSTRC3_READENTRYDATASQR DS FL8 Square of the summed number of    *02575000
                         bytes of entry data in 256-byte increments    *02576000
                         read and transferred by the CF                 02577000
*                                                                       02578000
* ********************************************************************  02579000
* * End fields whose validity is indicated by the                       02580000
* * IXLYAMDSTRC_AMValid flag                                            02581000
* ********************************************************************  02582000
*                                                                       02583000
*                                                                       02584000
         DS    CL32      Reserved                                       02585000
IXLYAMDSTRC3_LEN EQU *-IXLYAMDSTRC3                                     02586000
.L0051   ANOP                                                           02587000
         AIF   ('&IXLYAMDSTRC4' EQ 'NO').L0055                          02588000
         AIF   ('&DSECT' EQ 'YES').L0056                                02589000
         AIF   ('&IXLYAMDSTRC4' NE 'YES').L0055                         02590000
IXLYAMDSTRC4 DS 0D       Structure Entry for a Cache Structure (STRC), *02591000
                         AmdaLevel>=4                                   02592000
         AGO   .L0057                                                   02593000
.L0056   ANOP                                                           02594000
IXLYAMDSTRC4 DSECT       Structure Entry for a Cache Structure (STRC), *02595000
                         AmdaLevel>=4                                   02596000
.L0057   ANOP                                                           02597000
         DS    CL464     Mapped by IXLYAMDSTRC3                         02598000
*                                                                       02599000
* ********************************************************************  02600000
* * Begin fields whose validity is indicated by the                     02601000
* * IXLYAMDSTRC_AMValid flag                                            02602000
* ********************************************************************  02603000
*                                                                       02604000
*                                                                       02605000
IXLYAMDSTRC4_CFMONOPTIMECOUNT DS F Count of summed queue time - for    *02606000
                         operations queued due to coupling facility    *02607000
                         resource monopolization                        02608000
IXLYAMDSTRC4_CFMONOPSUMTIME DS CL8 Summed queue time - for operations  *02609000
                         queued due to coupling facility resource      *02610000
                         monopolization (u-sec)                         02611000
IXLYAMDSTRC4_CFMONOPSUMTIMESQR DS CL8 Summed queue time squared - for  *02612000
                         operations queued due to coupling facility    *02613000
                         resource monopolization (u-sec squared)        02614000
IXLYAMDSTRC4_TOTALWORKCOUNTMONOP DS F Total count of operations queued *02615000
                         for CF monopolization avoidance.               02616000
IXLYAMDSTRC4_TOTALHIWORKCOUNTMONOP DS F Total count of high priority   *02617000
                         operations queued for CF monopolization       *02618000
                         avoidance.                                     02619000
IXLYAMDSTRC4_WORKQUEUECOUNTMONOP DS F Current count of operations      *02620000
                         queued for CF monopolization avoidance         02621000
IXLYAMDSTRC4_HIWORKQUEUECOUNTMONOP DS F Current count of high priority *02622000
                         operations queued for CF monopolization       *02623000
                         avoidance.                                     02624000
*                                                                       02625000
* ********************************************************************  02626000
* * End fields whose validity is indicated by the                       02627000
* * IXLYAMDSTRC_AMValid flag                                            02628000
* ********************************************************************  02629000
*                                                                       02630000
*                                                                       02631000
         DS    CL128     Reserved                                       02632000
IXLYAMDSTRC4_LEN EQU *-IXLYAMDSTRC4                                     02633000
.L0055   ANOP                                                           02634000
         AIF   ('&IXLYAMDSCSC' EQ 'NO').L0058                           02635000
         AIF   ('&DSECT' EQ 'YES').L0059                                02636000
         AIF   ('&IXLYAMDSCSC' NE 'YES').L0058                          02637000
.L0059   ANOP                                                           02638000
*                                                                       02639000
* ********************************************************************  02640000
* **************** Structure Cache Storage Class Entry ***************  02641000
* ********************************************************************  02642000
* *****************Header*********************************************  02643000
*                                                                       02644000
*                                                                       02645000
         AIF   ('&DSECT' EQ 'YES').L005A                                02646000
IXLYAMDSCSC DS 0F        Structure Entry for Cache Storage Class       *02647000
                         (SCSC)                                         02648000
         AGO   .L005B                                                   02649000
.L005A   ANOP                                                           02650000
IXLYAMDSCSC DSECT        Structure Entry for Cache Storage Class       *02651000
                         (SCSC)                                         02652000
.L005B   ANOP                                                           02653000
IXLYAMDSCSC_TYPE DS B    X'23' -- indicates STR data for Storage Class  02654000
         DS    CL3       Unused                                         02655000
IXLYAMDSCSC_LENGTH DS F  Length of IXLYAMDSCSC entry mapping            02656000
         DS    CL4       reserved                                       02657000
IXLYAMDSCSC_STATS DS CL108 Storage Class information                    02658000
         ORG   IXLYAMDSCSC_STATS                                        02659000
IXLYAMDSCSC_RHC DS F     Read hit counter                               02660000
IXLYAMDSCSC_RMDHC DS F   Read miss, directory hit counter               02661000
IXLYAMDSCSC_RMASC DS F   Read miss, assignment suppressed counter       02662000
IXLYAMDSCSC_RMNAC DS F   Read miss, name assigned counter               02663000
IXLYAMDSCSC_RMTSFC DS F  Read miss, target storage class full counter   02664000
IXLYAMDSCSC_WHCB0C DS F  Write hit change Bit 0 ctr                     02665000
IXLYAMDSCSC_WHCB1C DS F  Write hit change Bit 1 ctr                     02666000
IXLYAMDSCSC_WMNRC DS F   Write miss, not registered counter             02667000
IXLYAMDSCSC_WMISC DS F   Write miss, invalid state counter              02668000
IXLYAMDSCSC_WMTSFC DS F  Write miss, target storage class full counter  02669000
IXLYAMDSCSC_DERC DS F    Directory entry reclaim counter                02670000
IXLYAMDSCSC_DTERC DS F   Data entry reclaim counter                     02671000
IXLYAMDSCSC_XIFDRC DS F  XI directory reclaim counter                   02672000
IXLYAMDSCSC_XIFWC DS F   XI write counter                               02673000
IXLYAMDSCSC_XINIC DS F   XI name invalidation counter                   02674000
IXLYAMDSCSC_XICIC DS F   XI complement invalidation counter             02675000
IXLYAMDSCSC_COC DS F     Castout Counter                                02676000
IXLYAMDSCSC_RSMC DS F    Reference signal miss counter                  02677000
IXLYAMDSCSC_TSCFC DS F   Target storage class full counter              02678000
IXLYAMDSCSC_DEC DS F     Directory entry counter                        02679000
IXLYAMDSCSC_DAEC DS F    Data area element counter                      02680000
IXLYAMDSCSC_TCC DS F     Total changed counter                          02681000
IXLYAMDSCSC_DAC DS F     Data area counter                              02682000
IXLYAMDSCSC_CRLC DS F    Completed reference lists counter              02683000
IXLYAMDSCSC_PCRLC DS F   Partially completed reference lists counter    02684000
IXLYAMDSCSC_XILRC DS F   XI for local cache vector index replacement    02685000
IXLYAMDSCSC_WUXIC DS F   Write unchanged with XI counter                02686000
IXLYAMDSCSC_LEN EQU *-IXLYAMDSCSC                                       02687000
.L0058   ANOP                                                           02688000
         AIF   ('&IXLYAMDSCSC1' EQ 'NO').L005C                          02689000
         AIF   ('&DSECT' EQ 'YES').L005D                                02690000
         AIF   ('&IXLYAMDSCSC1' NE 'YES').L005C                         02691000
IXLYAMDSCSC1 DS 0D       Structure Entry for Cache Storage Class       *02692000
                         (SCSC), AmdaLevel>=1                           02693000
         AGO   .L005E                                                   02694000
.L005D   ANOP                                                           02695000
IXLYAMDSCSC1 DSECT       Structure Entry for Cache Storage Class       *02696000
                         (SCSC), AmdaLevel>=1                           02697000
.L005E   ANOP                                                           02698000
         DS    CL120     Mapped by IXLYAMDSCSC                          02699000
IXLYAMDSCSC1_UDERIC DS F Unchanged directory entry with registered     *02700000
                         interest counter (LEVEL8)                      02701000
IXLYAMDSCSC1_WMASC DS F  Write Miss Assignment Suppression Counter (CF *02702000
                         LEVEL18)                                       02703000
IXLYAMDSCSC1_WMWSC DS F  Write Miss Write Suppression Counter (CF      *02704000
                         LEVEL17, SL 10.13)                             02705000
         DS    CL4       Reserved                                       02706000
IXLYAMDSCSC1_DART DS FL8 Data-Area Residency Time. A 64-bit unsigned   *02707000
                         binary integer that approximates in           *02708000
                         microseconds via a moving weighted average    *02709000
                         the elapsed time a data area resides in a     *02710000
                         storage class before it is reclaimed (CF      *02711000
                         LEVEL25)                                       02712000
IXLYAMDSCSC1_DERT DS FL8 Directory-Entry Residency Time. A 64 - bit    *02713000
                         unsigned binary integer that approximates in  *02714000
                         microseconds via a moving weighted average    *02715000
                         the elapsed time a directory entry actively   *02716000
                         resides in a storage class before it is       *02717000
                         reclaimed (CF LEVEL25)                         02718000
         DS    CL40      Reserved                                       02719000
IXLYAMDSCSC1_LEN EQU *-IXLYAMDSCSC1                                     02720000
.L005C   ANOP                                                           02721000
         AIF   ('&IXLYAMDSCOC' EQ 'NO').L005F                           02722000
         AIF   ('&DSECT' EQ 'YES').L0060                                02723000
         AIF   ('&IXLYAMDSCOC' NE 'YES').L005F                          02724000
.L0060   ANOP                                                           02725000
*                                                                       02726000
* ********************************************************************  02727000
* **************** Structure Cache CastOut Class Information Header***  02728000
* ********************************************************************  02729000
*                                                                       02730000
*                                                                       02731000
         AIF   ('&DSECT' EQ 'YES').L0061                                02732000
IXLYAMDSCOC DS 0F        Structure Entry for Cache CastOut Class       *02733000
                         (SCOC)                                         02734000
         AGO   .L0062                                                   02735000
.L0061   ANOP                                                           02736000
IXLYAMDSCOC DSECT        Structure Entry for Cache CastOut Class       *02737000
                         (SCOC)                                         02738000
.L0062   ANOP                                                           02739000
IXLYAMDSCOC_TYPE DS B    X'24' -- indicates STR data for CastOut       *02740000
                         Classes                                        02741000
         DS    CL3       Unused                                         02742000
IXLYAMDSCOC_LENGTH DS F  Length of IXLYAMDSCOC entry mapping            02743000
IXLYAMDSCOCSTATS@ DS A   Address of the SCOC entry. An address of 0    *02744000
                         indicates no entries were processed            02745000
         ORG   IXLYAMDSCOCSTATS@                                        02746000
IXLYAMDSCOCSTATS_OFF DS F Offset of the SCOC entry. An address of 0    *02747000
                         indicates no entries were processed            02748000
IXLYAMDSCOCBEG DS H      First castout class in the range of castout   *02749000
                         classes processed                              02750000
IXLYAMDSCOCEND DS H      Last castout class in the range of castout    *02751000
                         classes processed                              02752000
IXLYAMDSCOC_LEN EQU *-IXLYAMDSCOC                                       02753000
.L005F   ANOP                                                           02754000
         AIF   ('&IXLYAMDSCOCSTATS' EQ 'NO').L0063                      02755000
         AIF   ('&DSECT' EQ 'YES').L0064                                02756000
         AIF   ('&IXLYAMDSCOCSTATS' NE 'YES').L0063                     02757000
.L0064   ANOP                                                           02758000
*                                                                       02759000
* *****************Cast Out Class Statistics**************************  02760000
*                                                                       02761000
*                                                                       02762000
         AIF   ('&DSECT' EQ 'YES').L0065                                02763000
IXLYAMDSCOCSTATS DS 0F   Cast Out Class Stats                           02764000
         AGO   .L0066                                                   02765000
.L0065   ANOP                                                           02766000
IXLYAMDSCOCSTATS DSECT   Cast Out Class Stats                           02767000
.L0066   ANOP                                                           02768000
IXLYAMDSCOCENTRY DS F    Number of data elements associated with       *02769000
                         entries in the indicated castout class         02770000
IXLYAMDSCOCSTATS_LEN EQU *-IXLYAMDSCOCSTATS                             02771000
.L0063   ANOP                                                           02772000
         AIF   ('&IXLYAMDSC' EQ 'NO').L0067                             02773000
         AIF   ('&DSECT' EQ 'YES').L0068                                02774000
         AIF   ('&IXLYAMDSC' NE 'YES').L0067                            02775000
.L0068   ANOP                                                           02776000
*                                                                       02777000
* ********************************************************************  02778000
* ******************** Subchannel Entry ******************************  02779000
* ********************************************************************  02780000
*                                                                       02781000
*                                                                       02782000
         AIF   ('&DSECT' EQ 'YES').L0069                                02783000
IXLYAMDSC DS   0F        Subchannel Entry (SC)                          02784000
         AGO   .L006A                                                   02785000
.L0069   ANOP                                                           02786000
IXLYAMDSC DSECT          Subchannel Entry (SC)                          02787000
.L006A   ANOP                                                           02788000
IXLYAMDSC_TYPE DS B      X'30' -- indicates SC data                     02789000
         DS    CL3       Unused                                         02790000
IXLYAMDSC_LENGTH DS F    Length of IXLYAMDSC entry mapping              02791000
IXLYAMDSC_SCNEXT DS A    Address of next SC entry. A value of 0 means  *02792000
                         last entry for this facility                   02793000
         ORG   IXLYAMDSC_SCNEXT                                         02794000
IXLYAMDSC_SCNEXT_OFF DS F Offset of next SC entry. A value of 0 means  *02795000
                         last entry for this facility.                  02796000
*                                                                       02797000
* ******************* Configuration Data  *************************  *  02798000
*                                                                       02799000
*                                                                       02800000
IXLYAMDSC_SCNUMBER DS H  Subchannel number                              02801000
IXLYAMDSC_PAM DS B       Path available mask for coupling facility     *02802000
                         subchannels                                    02803000
IXLYAMDSC_PIM DS B       Path installed mask for coupling facility     *02804000
                         subchannels                                    02805000
IXLYAMDSC_CHPID_SET DS CL8 Set of CHPIDs                                02806000
         ORG   IXLYAMDSC_CHPID_SET                                      02807000
IXLYAMDSC_CHPIDS DS B    CHPID array for coupling facility subchannels  02808000
         ORG   IXLYAMDSC_CHPID_SET+8                                    02809000
IXLYAMDSC_SCDEVICE DS H  Subchannel device number                       02810000
IXLYAMDSC_SUBCH_STATUS DS BL2 Subchannel status                         02811000
*  Bit definitions:                                                     02812000
IXLYAMDSC_NOTOPERATIONAL EQU X'80' Subchannel not operational           02813000
IXLYAMDSC_NOTINUSE EQU X'40' Subchannel operational but not being used *02814000
                         for operations                                 02815000
IXLYAMDSC_ACTIVE EQU X'20' Subchannel operational and used for         *02816000
                         operations                                     02817000
IXLYAMDSC_CHPIDSETTYPE DS CL8 Set of CHPID Types                        02818000
         ORG   IXLYAMDSC_CHPIDSETTYPE                                   02819000
IXLYAMDSC_CHPIDSTYPE DS X CHPID array for channel path type             02820000
         ORG   IXLYAMDSC_CHPIDSETTYPE+8                                 02821000
         DS    CL4       Reserved                                       02822000
*                                                                       02823000
*   *************** Contention data  *******************************    02824000
*                                                                       02825000
*                                                                       02826000
IXLYAMDSC_SUBCH_BUSY DS F Subchannel busy count. Compare to the        *02827000
                         utilization count below.                       02828000
IXLYAMDSC_ALLPATHS_BUSY DS F All path busy termination count. Compare  *02829000
                         to the utilization count below.                02830000
IXLYAMDSC_UTILIZATION DS F Utilization count -- Number of times this   *02831000
                         subchannel was picked for an operation         02832000
IXLYAMDSC_SEQUENCE DS F  Sequence number. This sequence number is      *02833000
                         changed whenever a new "instance" of this     *02834000
                         entity comes into use                          02835000
         DS    CL12                                                     02836000
IXLYAMDSC_LEN EQU *-IXLYAMDSC                                           02837000
.L0067   ANOP                                                           02838000
         AIF   ('&IXLYAMDSC1' EQ 'NO').L006B                            02839000
         AIF   ('&DSECT' EQ 'YES').L006C                                02840000
         AIF   ('&IXLYAMDSC1' NE 'YES').L006B                           02841000
IXLYAMDSC1 DS  0X        Subchannel Entry (SC), AmdaLevel>=1            02842000
         AGO   .L006D                                                   02843000
.L006C   ANOP                                                           02844000
IXLYAMDSC1 DSECT         Subchannel Entry (SC), AmdaLevel>=1            02845000
.L006D   ANOP                                                           02846000
         DS    CL68      Mapped by IXLYAMDSC                            02847000
         DS    CL60      Reserved                                       02848000
IXLYAMDSC1_LEN EQU *-IXLYAMDSC1                                         02849000
.L006B   ANOP                                                           02850000
         AIF   ('&IXLYAMDSSCC' EQ 'NO').L006E                           02851000
         AIF   ('&DSECT' EQ 'YES').L006F                                02852000
         AIF   ('&IXLYAMDSSCC' NE 'YES').L006E                          02853000
.L006F   ANOP                                                           02854000
*                                                                       02855000
* ********************************************************************  02856000
* *                   Structure copy controls                        *  02857000
* *                                                                  *  02858000
* * This record is returned only when AMDALEVEL of at least 1        *  02859000
* * is specified.                                                       02860000
* ********************************************************************  02861000
*                                                                       02862000
*                                                                       02863000
         AIF   ('&DSECT' EQ 'YES').L0070                                02864000
IXLYAMDSSCC DS 0F        Structure copy controls record                 02865000
         AGO   .L0071                                                   02866000
.L0070   ANOP                                                           02867000
IXLYAMDSSCC DSECT        Structure copy controls record                 02868000
.L0071   ANOP                                                           02869000
IXLYAMDSSCC_TYPE DS B    X'25' -- indicates SSCC data                   02870000
         DS    CL3       Unused                                         02871000
IXLYAMDSSCC_LENGTH DS F  Length of IXLYAMDSSCC entry mapping            02872000
         DS    CL16      Reserved                                       02873000
IXLYAMDSSCC_COPYCONTROLS DS CL512 Structure copy controls (LEVEL8)      02874000
         ORG   IXLYAMDSSCC_COPYCONTROLS                                 02875000
         DS    CL184     Reserved                                       02876000
IXLYAMDSSCC_COPYVERSION DS BL8 Structure copy version number. Changes  *02877000
                         when a new physical instance of the structure *02878000
                         is allocated for a system-managed rebuild     *02879000
                         process. Use with structure version number    *02880000
                         (IXLYAMDSTRx_PhysicalVersion) to identify an  *02881000
                         instance of a structure. May be zero if the   *02882000
                         structure has never been copied.               02883000
         ORG   IXLYAMDSSCC_COPYCONTROLS+512                             02884000
         DS    CL32      Reserved                                       02885000
IXLYAMDSSCC_LEN EQU *-IXLYAMDSSCC                                       02886000
.L006E   ANOP                                                           02887000
         AIF   ('&IXLYAMDSSCM' EQ 'NO').L0072                           02888000
         AIF   ('&DSECT' EQ 'YES').L0073                                02889000
         AIF   ('&IXLYAMDSSCM' NE 'YES').L0072                          02890000
.L0073   ANOP                                                           02891000
*                                                                       02892000
* ********************************************************************  02893000
* *              Structure Storage-Class Memory (SSCM)               *  02894000
* *                                                                  *  02895000
* * This record is returned only when AMDALEVEL of at least 1        *  02896000
* * is specified.                                                       02897000
* ********************************************************************  02898000
*                                                                       02899000
*                                                                       02900000
         AIF   ('&DSECT' EQ 'YES').L0074                                02901000
IXLYAMDSSCM DS 0D        Structure Storage-Class Memory record          02902000
         AGO   .L0075                                                   02903000
.L0074   ANOP                                                           02904000
IXLYAMDSSCM DSECT        Structure Storage-Class Memory record          02905000
.L0075   ANOP                                                           02906000
IXLYAMDSSCM_TYPE DS B    X'26' -- indicates SSCM data                   02907000
         DS    CL3       Unused                                         02908000
IXLYAMDSSCM_LENGTH DS F  Length of IXLYAMDSSCM entry mapping            02909000
         DS    CL16      Reserved                                       02910000
IXLYAMDSSCM_STATS DS CL180 Structure SCM extension information         *02911000
                         (LEVEL19)                                      02912000
         ORG   IXLYAMDSSCM_STATS                                        02913000
IXLYAMDSSCM_MXSCM DS FL8 Maximum storage-class memory the structure    *02914000
                         can use in 4K blocks                           02915000
IXLYAMDSSCM_SCMAT DS X   SCM Algorithm Type                             02916000
         DS    CL3       Reserved                                       02917000
IXLYAMDSSCM_MSBEC DS F   The maximum number of list entries that can   *02918000
                         be stored in a single storage-class memory    *02919000
                         buffer                                         02920000
IXLYAMDSSCM_MSBELC DS F  The maximum number of list elements that can  *02921000
                         be stored in a single storage-class memory    *02922000
                         buffer                                         02923000
IXLYAMDSSCM_MNELC DS F   The minimum element count                      02924000
IXLYAMDSSCM_MNEC DS F    The minimum entry count                        02925000
         DS    CL8       Reserved                                       02926000
IXLYAMDSSCM_FXAUS DS F   Fixed augmented space in 4K blocks             02927000
         DS    CL4       Reserved                                       02928000
IXLYAMDSSCM_IUAUS DS F   In-use augmented space in 4K blocks            02929000
IXLYAMDSSCM_IUSCM DS FL8 In-use storage-class memory by the structure  *02930000
                         in 4K blocks                                   02931000
         DS    CL4       Reserved                                       02932000
IXLYAMDSSCM_EMXAUS DS F  Estimated maximum space in 4K blocks that may *02933000
                         be assigned as augmented space for the        *02934000
                         structure                                      02935000
IXLYAMDSSCM_EMSEC DS FL8 Estimated maximum number of list entries that *02936000
                         may reside in storage-class memory for the    *02937000
                         structure                                      02938000
IXLYAMDSSCM_EMSELC DS FL8 Estimated maximum number of list elements    *02939000
                         that may reside in storage-class memory for   *02940000
                         the structure                                  02941000
IXLYAMDSSCM_SLSEC DS FL8 Number of existing structure list entries in  *02942000
                         the list set that reside in storage-class     *02943000
                         memory                                         02944000
IXLYAMDSSCM_SLSELC DS FL8 Number of existing structure list elements   *02945000
                         in the list set that reside in storage-class  *02946000
                         memory                                         02947000
IXLYAMDSSCM_SCMLT DS X   Percentage of the list entry and list element *02948000
                         counts that determines the lower threshold    *02949000
                         for migration between storage-class memory    *02950000
                         and CF storage                                 02951000
IXLYAMDSSCM_SCMUT DS X   Percentage of the list entry and list element *02952000
                         counts that determines the upper threshold    *02953000
                         for migration from CF storage to              *02954000
                         storage-class memory                           02955000
IXLYAMDSSCM_SCMLTR DS X  Percentage of the list entry and list element *02956000
                         counts that determines the lower threshold    *02957000
                         regulator for migration between CF SCM and CF *02958000
                         real storage. The lower threshold regulators  *02959000
                         are used to stop migration from CF SCM into   *02960000
                         CF real storage after being triggered by the  *02961000
                         lower threshold                                02962000
IXLYAMDSSCM_SCMUTR DS X  Percentage of the list entry and list element *02963000
                         counts that determines the upper threshold    *02964000
                         regulator for migration between CF real       *02965000
                         storage and CF SCM. The upper threshold       *02966000
                         regulators are used to stop migration from CF *02967000
                         real storage into CF SCM after being          *02968000
                         triggered by the upper threshold               02969000
IXLYAMDSSCM_SCMWC DS F   SCM write count. Number of list write         *02970000
                         operations performed to storage-class memory   02971000
IXLYAMDSSCM_SCMRFC DS F  SCM read after fault count. The number of     *02972000
                         read operations against storage-class memory  *02973000
                         that were initiated by a reference to list    *02974000
                         structure objects residing on storage-class   *02975000
                         memory                                         02976000
IXLYAMDSSCM_SCMRPC DS F  SCM read for prefetch count. The number of    *02977000
                         read operations against storage-class memory  *02978000
                         that were initiated as a prefetch operation   *02979000
                         in order to retrieve list structure objects   *02980000
                         on storage-class memory that are expected to  *02981000
                         be referenced                                  02982000
IXLYAMDSSCM_SRSTFM DS FL8 The accumulated service times in             *02983000
                         microseconds for read operations to           *02984000
                         storage-class memory                           02985000
IXLYAMDSSCM_SRSTSM DS FL8 The accumulated squares of service times, in *02986000
                         squared microsecond units for read operations *02987000
                         to storage-class memory                        02988000
IXLYAMDSSCM_SWSTFM DS FL8 The accumulated service times in             *02989000
                         microseconds for write operations to          *02990000
                         storage-class memory                           02991000
IXLYAMDSSCM_SWSTSM DS FL8 The accumulated squares of service times, in *02992000
                         squared microsecond units, for write          *02993000
                         operations to storage-class memory             02994000
IXLYAMDSSCM_SCMRBT DS FL8 SCM read bytes transferred. Number of bytes  *02995000
                         in 4K-byte units transferred from             *02996000
                         storage-class memory to CF storage             02997000
IXLYAMDSSCM_SCMWBT DS FL8 SCM write bytes transferred. Number of bytes *02998000
                         in 4K-byte units transferred from CF storage  *02999000
                         to storage-class memory                        03000000
IXLYAMDSSCM_SAECC DS F   SCM auxiliary enabled command count. Number   *03001000
                         of commands that required the use of CF       *03002000
                         auxiliary frames                               03003000
IXLYAMDSSCM_SRCC1C DS F  SCM reference count 1 - The number of         *03004000
                         references against storage-class memory to    *03005000
                         locate list structure objects                  03006000
IXLYAMDSSCM_SRCC2C DS F  SCM reference count 2 - The number of         *03007000
                         references against storage-class memory to    *03008000
                         resolve list entry key hashing                 03009000
IXLYAMDSSCM_SRCC3C DS F  SCM reference count 3 - The number of         *03010000
                         references against storage-class memory for   *03011000
                         the purpose of migrating list structure       *03012000
                         objects from CF storage to storage-class      *03013000
                         memory to allow for the creation of new list  *03014000
                         structure objects in CF storage                03015000
IXLYAMDSSCM_SRCC4C DS F  SCM reference count 4 - The number of         *03016000
                         references against storage-class memory for   *03017000
                         the purpose of migrating list structure       *03018000
                         objects from storage-class memory to CF       *03019000
                         storage to allow for key-range initialization *03020000
                         to complete.                                   03021000
         DS    CL52      Reserved                                       03022000
IXLYAMDSSCM_LEN EQU *-IXLYAMDSSCM                                       03023000
.L0072   ANOP                                                           03024000
         AIF   ('&IXLYAMDADUP' EQ 'NO').L0076                           03025000
         AIF   ('&DSECT' EQ 'YES').L0077                                03026000
         AIF   ('&IXLYAMDADUP' NE 'YES').L0076                          03027000
.L0077   ANOP                                                           03028000
*                                                                       03029000
* ********************************************************************  03030000
* *              Asynchronous Duplexing (ADUP)                       *  03031000
* *                                                                  *  03032000
* * This record is returned only when AMDALEVEL of at least 2        *  03033000
* * is specified.                                                       03034000
* ********************************************************************  03035000
*                                                                       03036000
*                                                                       03037000
         AIF   ('&DSECT' EQ 'YES').L0078                                03038000
IXLYAMDADUP DS 0D        Structure asynchronous duplexing record        03039000
         AGO   .L0079                                                   03040000
.L0078   ANOP                                                           03041000
IXLYAMDADUP DSECT        Structure asynchronous duplexing record        03042000
.L0079   ANOP                                                           03043000
IXLYAMDADUP_TYPE DS B    X'27' -- indicates asynchronous duplexing     *03044000
                         data                                           03045000
         DS    CL3       Unused                                         03046000
IXLYAMDADUP_LENGTH DS F  Length of IxlyamdaDup entry mapping            03047000
         DS    CL16      Reserved                                       03048000
IXLYAMDADUP_INFO DS CL192 Structure asynchronous duplexing information *03049000
                         (LEVEL21)                                      03050000
         ORG   IXLYAMDADUP_INFO                                         03051000
IXLYAMDADUP_FOSN DS FL8  Failed operation sequence number. The value   *03052000
                         of the push operation sequence number that    *03053000
                         was being processed when an error was         *03054000
                         encountered that resulted in a duplexing      *03055000
                         failure. (CFLEVEL 21)                          03056000
IXLYAMDADUP_HEOSN DS FL8 Highest executable operation sequence number. *03057000
                         The value of the upper bound of the           *03058000
                         continuous sequence of assigned sequence      *03059000
                         numbers that have been received by the        *03060000
                         secondary but have not yet completed in the   *03061000
                         secondary. (CFLEVEL 21)                        03062000
IXLYAMDADUP_LAOSN DS FL8 Last assigned operation sequence number. The  *03063000
                         value of the highest valued sequence number   *03064000
                         assigned to an asynchronous duplexing         *03065000
                         operation. Not defined in the secondary.      *03066000
                         (CFLEVEL 21)                                   03067000
IXLYAMDADUP_LAOSNS DS FL8 Last assigned operation sequence number      *03068000
                         secondary. The value of the highest valued    *03069000
                         sequence number assigned to an asynchronous   *03070000
                         duplexing operation as indicated by the       *03071000
                         primary CF and received by the secondary CF.  *03072000
                         (CFLEVEL 21)                                   03073000
IXLYAMDADUP_LCOSN DS FL8 Last completed operation sequence number. The *03074000
                         value of the highest valued sequence number   *03075000
                         that has been executed in the secondary       *03076000
                         structure. Not defined in the primary.        *03077000
                         (CFLEVEL 21)                                   03078000
IXLYAMDADUP_LCOSNP DS FL8 Last completed operation sequence number     *03079000
                         primary. The value of the highest valued      *03080000
                         sequence number that has been executed as     *03081000
                         indicated by the secondary CF and received by *03082000
                         the primary CF. (CFLEVEL 21)                   03083000
IXLYAMDADUP_TPOC DS F    Transmitted push-operation count. The number  *03084000
                         of push operations transmitted to the         *03085000
                         secondary CF. (CFLEVEL 21)                     03086000
IXLYAMDADUP_RCPOC DS F   Reported complete push-operation count. The   *03087000
                         number of push operations that have completed *03088000
                         and been reported as complete to the primary  *03089000
                         structure. (CFLEVEL 21)                        03090000
IXLYAMDADUP_CQSC DS F    Secondary queue stall count. The number of    *03091000
                         stalls in the processing of the secondary     *03092000
                         operation queue. A stall occurs whenever the  *03093000
                         operation identified by the HEOSN is          *03094000
                         completed and at least one queue element with *03095000
                         a higher valued OSN than the HEOSN exists     *03096000
                         that has not been processed. (CFLEVEL 21)      03097000
         DS    CL4       Reserved                                       03098000
IXLYAMDADUP_PDTFM DS FL8 Primary delay time 1st moment. The            *03099000
                         accumulated primary delay times, in           *03100000
                         microseconds, for push operations. The        *03101000
                         primary delay time is the elapsed time in the *03102000
                         primary CF between the assignment of the      *03103000
                         operation to the queue buffer and the first   *03104000
                         attempt to send the operation to the          *03105000
                         secondary CF. (CFLEVEL 21)                     03106000
IXLYAMDADUP_PDTSM DS FL8 Primary delay time 2nd moment. The            *03107000
                         accumulated squares of primary delay times,   *03108000
                         in squared-microsecond units, for push        *03109000
                         operations. (CFLEVEL 21)                       03110000
IXLYAMDADUP_PMDTFM DS FL8 Push message delay time 1st moment. The      *03111000
                         accumulated push message delay times, in      *03112000
                         microseconds, for push operations. The push   *03113000
                         message delay time is the elapsed time from   *03114000
                         the first attempt to send the push operation  *03115000
                         in the primary CF to the time that the        *03116000
                         secondary CF assigns the push operation to a  *03117000
                         secondary queue entry. (CFLEVEL 21)            03118000
IXLYAMDADUP_PMDTSM DS FL8 Primary message delay time 2nd moment. The   *03119000
                         accumulated squares of push message delay     *03120000
                         times, in squared-microsecond units, for push *03121000
                         operations. (CFLEVEL 21)                       03122000
IXLYAMDADUP_CQDTFM DS FL8 Secondary queue delay time 1st moment. The   *03123000
                         accumulated queue delay times, in             *03124000
                         microseconds, for push operations. The queue  *03125000
                         delay time is the elapsed time from the time  *03126000
                         the push operation is assigned to a secondary *03127000
                         queue entry to the time of completion of the  *03128000
                         push operation. (CFLEVEL 21)                   03129000
IXLYAMDADUP_CQDTSM DS FL8 Secondary queue delay time 2nd moment. The   *03130000
                         accumulated squares of secondary queue delay  *03131000
                         times, in squared-microsecond units, for push *03132000
                         operations. (CFLEVEL 21)                       03133000
IXLYAMDADUP_CQSTFM DS FL8 Secondary queue stall time 1st moment. The   *03134000
                         accumulated secondary queue stall times, in   *03135000
                         microseconds, for push operations. The        *03136000
                         secondary queue stall time is the elapsed     *03137000
                         time from the time the operation identified   *03138000
                         by the HEOSN is completed in the secondary    *03139000
                         structure with one or more uncompleted        *03140000
                         operations to the time when the HEOSN is      *03141000
                         advanced. (CFLEVEL 21)                         03142000
IXLYAMDADUP_CQSTSM DS FL8 Secondary queue stall time 2nd moment. The   *03143000
                         accumulated squares of secondary queue stall  *03144000
                         times, in squared-microsecond units, for push *03145000
                         operations. (CFLEVEL 21)                       03146000
IXLYAMDADUP_SCDTFM DS FL8 Secondary reported completion delay time 1st *03147000
                         moment. The accumulated secondary reported    *03148000
                         completion delay times, in microseconds, for  *03149000
                         push operations. The secondary reported       *03150000
                         completion delay time is the elapsed time, in *03151000
                         the secondary CF, from the time the push      *03152000
                         operation completes in the secondary to the   *03153000
                         time that the completion of the OSN is        *03154000
                         reported to the primary. (CFLEVEL 21)          03155000
IXLYAMDADUP_SCDTSM DS FL8 Secondary reported completion delay time 2nd *03156000
                         moment. The accumulated squares of secondary  *03157000
                         reported completion delay times, in           *03158000
                         squared-microsecond units, for push           *03159000
                         operations. (CFLEVEL 21)                       03160000
IXLYAMDADUP_PRDTFM DS FL8 Push response delay time 1st moment. The     *03161000
                         accumulated push response delay times, in     *03162000
                         microseconds, for push operations. The push   *03163000
                         response delay time is the elapsed time from  *03164000
                         the launch of the operation response in the   *03165000
                         secondary CF to the time that the primary CF  *03166000
                         recognizes the response. (CFLEVEL 21)          03167000
IXLYAMDADUP_PRDTSM DS FL8 Push response delay time 2nd moment. The     *03168000
                         accumulated squares of push response delay    *03169000
                         times, in squared-microsecond units, for push *03170000
                         operations. (CFLEVEL 21)                       03171000
IXLYAMDADUP_PODTFM DS FL8 Push operation delay time 1st moment. The    *03172000
                         accumulated push operation delay time, in     *03173000
                         microseconds, for push operations. The push   *03174000
                         operation delay time is the elapsed time from *03175000
                         the time when the primary CF queues the       *03176000
                         operation for push to the secondary to the    *03177000
                         time when the secondary CF queues the pushed  *03178000
                         operation for processing. (CFLEVEL 21)         03179000
IXLYAMDADUP_PODTSM DS FL8 Push operation delay time 2nd moment. The    *03180000
                         accumulated squares of push operation delay   *03181000
                         times, in squared-microsecond units, for push *03182000
                         operations. (CFLEVEL 21)                       03183000
IXLYAMDADUP_SPDTFM DS FL8 Secondary processed delay time 1st moment.   *03184000
                         The accumulated secondary processed delay     *03185000
                         time, in microseconds, for push operations.   *03186000
                         The secondary processed delay time is the     *03187000
                         elapsed time from the time when the primary   *03188000
                         CF queues the operation for push to the       *03189000
                         secondary to the time when the secondary CF   *03190000
                         applies the pushed update to the secondary    *03191000
                         structure. (CFLEVEL 21)                        03192000
IXLYAMDADUP_SPDTSM DS FL8 Secondary processed delay time 2nd moment.   *03193000
                         The accumulated squares of secondary          *03194000
                         processed delay times, in squared-microsecond *03195000
                         units, for push operations. (CFLEVEL 21)       03196000
         DS    CL40      Reserved                                       03197000
*                                                                       03198000
* ********************************************************************  03199000
* *****************Structure types************************************  03200000
* ********************************************************************  03201000
*                                                                       03202000
*                                                                       03203000
IXLYAMDA_LIST EQU X'03'  List structure                                 03204000
IXLYAMDA_CACHE EQU X'04' Cache Structure                                03205000
IXLYAMDA_LOCK EQU X'FF'  Lock Structure                                 03206000
*                                                                       03207000
* *****************Channel Path Types*********************************  03208000
* ********************************************************************  03209000
*                                                                       03210000
*                                                                       03211000
IXLYAMDA_CHPIDTYPE_CFS EQU X'0B' CHPID TYPE for CF Sender chpid         03212000
IXLYAMDA_CHPIDTYPE_CFR EQU X'0C' CHPID TYPE for CF Receiver chpid       03213000
IXLYAMDA_CHPIDTYPE_CBS EQU X'16' CHPID TYPE for CF Cluster Bus Sender   03214000
IXLYAMDA_CHPIDTYPE_CBR EQU X'17' CHPID TYPE for CF Cluster Bus         *03215000
                         Receiver                                       03216000
IXLYAMDA_CHPIDTYPE_ICS EQU X'18' CHPID TYPE for CF Internal Coupling   *03217000
                         Sender                                         03218000
IXLYAMDA_CHPIDTYPE_ICR EQU X'19' CHPID TYPE for CF Internal Coupling   *03219000
                         Receiver                                       03220000
IXLYAMDA_CHPIDTYPE_CBP EQU X'21' CHPID TYPE for CF Integrated Cluster  *03221000
                         Bus Peer                                       03222000
IXLYAMDA_CHPIDTYPE_CFP EQU X'22' CHPID TYPE for CF Peer chpid           03223000
IXLYAMDA_CHPIDTYPE_ICP EQU X'23' CHPID TYPE for CF Internal Coupling   *03224000
                         Peer                                           03225000
IXLYAMDA_CHPIDTYPE_CIB EQU X'26' CHPID TYPE for CIB Coupling Link       03226000
IXLYAMDA_CHPIDTYPE_CS5 EQU X'33' CHPID TYPE for CS5 (coupling over     *03227000
                         PCIe) link                                     03228000
IXLYAMDA_CHPIDTYPE_CL5 EQU X'34' CHPID TYPE for CL5 (coupling over     *03229000
                         RoCE) link                                     03230000
*                                                                       03231000
* ********************************************************************  03232000
* * Channel path operational modes                                      03233000
* ********************************************************************  03234000
*                                                                       03235000
*                                                                       03236000
IXLYAMDA_PATHMODE_CFP_1GBIT EQU 1 CFP path supporting a 1.0625 Gbit /  *03237000
                         sec data rate                                  03238000
IXLYAMDA_PATHMODE_CFP_2GBIT EQU 2 CFP path supporting a 2.125 Gbit /   *03239000
                         sec data rate                                  03240000
IXLYAMDA_PATHMODE_CIB_1X_IFB_HCA2_O_LR EQU 16                           03241000
*                                                                       03242000
*                                      CIB path operating at 1X         03243000
*                                      bandwidth using the IFB          03244000
*                                      protocol, adapter type HCA2-O    03245000
*                                      LR                               03246000
*                                                                       03247000
IXLYAMDA_PATHMODE_CIB_12X_IFB_HCA2_O EQU 17                             03248000
*                                                                       03249000
*                                      CIB path operating at 12X        03250000
*                                      bandwidth using the IFB          03251000
*                                      protocol, adapter type HCA2-O    03252000
*                                                                       03253000
*                                                                       03254000
IXLYAMDA_PATHMODE_CIB_1X_IFB_HCA3_O_LR EQU 32                           03255000
*                                                                       03256000
*                                      CIB path operating at 1X         03257000
*                                      bandwidth using the IFB          03258000
*                                      protocol, adapter type HCA3-O    03259000
*                                      LR                               03260000
*                                                                       03261000
IXLYAMDA_PATHMODE_CIB_12X_IFB_HCA3_O EQU 33                             03262000
*                                                                       03263000
*                                      CIB path operating at 12X        03264000
*                                      bandwidth using the IFB          03265000
*                                      protocol, adapter type HCA3-O    03266000
*                                                                       03267000
*                                                                       03268000
IXLYAMDA_PATHMODE_CIB_12X_IFB3_HCA3_O EQU 48                            03269000
*                                                                       03270000
*                                      CIB path operating at 12X        03271000
*                                      bandwidth using the IFB3         03272000
*                                      protocol, adapter type HCA3-O    03273000
*                                                                       03274000
*                                                                       03275000
IXLYAMDA_PATHMODE_CS5_8X_GEN3_PCIE_O_SR EQU 64                          03276000
*                                                                       03277000
*                                      CS5 path operating at 8X         03278000
*                                      bandwidth using the third        03279000
*                                      generation PCIe protocol         03280000
*                                                                       03281000
IXLYAMDA_PATHMODE_CL5_10GB_ROCE_LR EQU 80 CL5 path operating at 10     *03282000
                         Gigabit per second bandwidth over Converged   *03283000
                         Enhanced Ethernet protocol                     03284000
*                                                                       03285000
* ********************************************************************  03286000
* * Storage-class memory algorithm types                                03287000
* ********************************************************************  03288000
*                                                                       03289000
*                                                                       03290000
IXLYAMDA_SCMAT_KEYPRIORITY1 EQU 1 KeyPriority1 algorithm                03291000
*                                                                       03292000
* ********************************************************************  03293000
* * Duplexing type values                                               03294000
* ********************************************************************  03295000
*                                                                       03296000
*                                                                       03297000
IXLYAMDA_DPLXT_SYNCHRONOUS EQU B'00' Synchronous duplexing              03298000
IXLYAMDA_DPLXT_ASYNCHRONOUSPRI EQU B'01' Asynchronous duplexing,       *03299000
                         primary structure                              03300000
IXLYAMDA_DPLXT_ASYNCHRONOUSSEC EQU B'10' Asynchronous duplexing,       *03301000
                         secondary structure                            03302000
IXLYAMDADUP_LEN EQU *-IXLYAMDADUP                                       03303000
.L0076   ANOP                                                           03304000
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 03305000
         AIF   ('&LIST' EQ 'YES').P4                                    03306000
.P3      ANOP                                                           03307000
         POP   PRINT                                                    03308000
.P4      ANOP                                                           03309000
.P_EXIT  ANOP                                                           03310000
         MEND                                                           03311000
**/ ;                                                                   03312000
* %IXLYAMDA_INCLUDED = 'YES';                                           03313000
* %DCL ZCBPRINT CHAR EXT;                                               03314000
* %DEACTIVATE ZCBPRINT;                                                 03315000
* %DCL IXLYAMDA_LIST CHAR EXT;                                          03316000
* %DEACTIVATE IXLYAMDA_LIST;                                            03317000
* %IF IXLYAMDA_LIST = 'NO' !                                            03318000
*    ZCBPRINT = 'NO' %THEN                                              03319000
* %DO;                                                                  03320000
*   @LIST PUSH NOECHO;                                                  03321000
*   @LIST NOASSEMBLE NOECHO;                                            03322000
*   @LIST OFF C NOECHO;                                                 03323000
* %END;                                                                 03324000
*/* Start of PL/X Source                                             */ 03325000
*  %IF IXLYAMDA_ALET = '' %THEN                                         03326000
*     %IXLYAMDA_ALET = '0';                                             03327000
*  %IXLYAMDA_VIA = '';                                                  03328000
*  %IF IXLYAMDA_ALET ^= '0' %THEN                                       03329000
*     %IXLYAMDA_VIA = 'VIA(IXLYAMDA_ALET)';                             03330000
*                                                                       03331000
*/********************************************************************/ 03332000
*/****************** AMDA Header *************************************/ 03333000
*/********************************************************************/ 03334000
*                                                                       03335000
*   DECLARE                                                             03336000
*     1    IXLYAMDAREA BASED IXLYAMDA_VIA, /* Data area returned to     03337000
*                                      caller                        */ 03338000
*       3    IXLYAMDAREA_Length FIXED(32), /* Length of IXLYAMDAREA     03339000
*                                      header mapping                */ 03340000
*       3    IXLYAMDAREA_CFEnt@ PTR(31), /* Address of first CF         03341000
*                                      entry. A value of zero means     03342000
*                                      that no CF entries were          03343000
*                                      provided.                     */ 03344000
*         5 IXLYAMDAREA_CFEnt_Off Fixed(32), /* Offset of first CF      03345000
*                                      entry.  A value of zero means    03346000
*                                      that no CF entries were          03347000
*                                      provided.                 @M9A*/ 03348000
*       3    IXLYAMDAREA_TLen FIXED(32), /* Total length of output      03349000
*                                      data area needed to contain      03350000
*                                      all the requested information.   03351000
*                                      This length includes the area    03352000
*                                      for the records that WERE        03353000
*                                      returned on this call.        */ 03354000
*       3    IXLYAMDAREA_#Ent FIXED(32), /* Total number of entries     03355000
*                                      of all kinds (not including      03356000
*                                      the header)                   */ 03357000
*       3    IXLYAMDAREA_Version FIXED(8), /* Version number - Maximum  03358000
*                                      CFLEVEL supported by MVS on      03359000
*                                      system where IXLMG was invoked.  03360000
*                                      Can be used to determine if      03361000
*                                      specific fields have valid       03362000
*                                      information. See notes in prolog 03363000
*                                      for more information      @02C*/ 03364000
*       3 IXLYAMDAREA_Flags Bit(8),  /* Request flags            @M9A*/ 03365000
*                                                                       03366000
*         5 IXLYAMDAREA_ChainOffset Bit(1),  /* When on, all chain      03367000
*                                      fields contain offsets           03368000
*                                      rather than addresses     @M9A*/ 03369000
*         5 * Bit(7),               /* Unused                    @M9A*/ 03370000
*       3    *        CHAR(2);      /* Unused                    @M9C*/ 03371000
*                                                                       03372000
*/********************************************************************/ 03373000
*/*****  Mapping of portion of entry common to all entries  **** @01C*/ 03374000
*/********************************************************************/ 03375000
*                                                                       03376000
*   DECLARE                                                             03377000
*     1    IXLYAMDHD BASED,         /* Common header mapping for        03378000
*                                      IXLYAMDA entries              */ 03379000
*       3    IXLYAMDHD_Type BIT(8), /* Type of entry                 */ 03380000
*       3    *        CHAR(3),      /* Unused                        */ 03381000
*       3    IXLYAMDHD_Length FIXED(32), /* Length of entry          */ 03382000
*       3    IXLYAMDHD_Next PTR(31), /* Address of next entry.       */ 03383000
*         5 IXLYAMDHD_Next_Off Fixed(32); /* Offset of next             03384000
*                                      entry                     @M9A*/ 03385000
*                                                                       03386000
*/********************************************************************/ 03387000
*/**************** Entry Types ********************************  @01C*/ 03388000
*/********************************************************************/ 03389000
*                                                                       03390000
*   DECLARE                                                             03391000
*     IXLYAMDA_TypeCF BIT(8) CONSTANT('10'X), /* Type for CF block   */ 03392000
*     IXLYAMDA_TypeSLL BIT(8) CONSTANT('11'X), /* Type for SLL block */ 03393000
*     IXLYAMDA_TypeSLC BIT(8) CONSTANT('12'X), /* Type for SLC block */ 03394000
*     IXLYAMDA_TypeCFMI BIT(8) CONSTANT('13'X), /* Type for CFMI        03395000
*                                      block                     @D1A*/ 03396000
*     IXLYAMDA_TypeCFRF BIT(8) CONSTANT('14'X), /* Type for CFRF        03397000
*                                      block                     @LAA*/ 03398000
*     IXLYAMDA_TypeCFCP BIT(8) CONSTANT('15'X), /* Type for CFCP        03399000
*                                      block                     @LNA*/ 03400000
*     IXLYAMDA_TypeSTRL BIT(8) CONSTANT('21'X), /* Type for STRL        03401000
*                                      block                         */ 03402000
*     IXLYAMDA_TypeSTRC BIT(8) CONSTANT('22'X), /* Type for STRC        03403000
*                                      block                         */ 03404000
*     IXLYAMDA_TypeSCSC BIT(8) CONSTANT('23'X), /* Type for SCSC        03405000
*                                      block                         */ 03406000
*     IXLYAMDA_TypeSCOC BIT(8) CONSTANT('24'X), /* Type for SCOC        03407000
*                                      block                         */ 03408000
*     IXLYAMDA_TypeSSCC BIT(8) CONSTANT('25'X), /* Type for SSCC        03409000
*                                      block                     @PFC*/ 03410000
*     IXLYAMDA_TypeSSCM BIT(8) CONSTANT('26'X), /* Type for SSCM        03411000
*                                      block                     @LQA*/ 03412000
*     IXLYAMDA_TypeADup BIT(8) CONSTANT('27'X), /* Type for ADUP        03413000
*                                      block                     @LWA*/ 03414000
*     IXLYAMDA_TypeSC BIT(8) CONSTANT('30'X); /* Type for SC block   */ 03415000
*                                                                       03416000
*                                                                       03417000
*/********************************************************************/ 03418000
*/********************** Facility Entry  *****************************/ 03419000
*/********************************************************************/ 03420000
*                                                                       03421000
*/********************** Facility Entry ******************************/ 03422000
*/************************* Header ***********************************/ 03423000
*                                                                       03424000
*   DECLARE                                                             03425000
*     1    IXLYAMDCF BASED IXLYAMDA_VIA, /* Coupling Facility (CF)      03426000
*                                      Entry                         */ 03427000
*       3    IXLYAMDCF_Type BIT(8), /* Indication of type of data       03428000
*                                      X'10' indicates CF entry      */ 03429000
*       3    *        CHAR(3),      /* Unused                        */ 03430000
*       3    IXLYAMDCF_Length FIXED(32), /* Length of IXLYAMDCF entry   03431000
*                                      mapping                       */ 03432000
*       3    IXLYAMDCF_CFNext PTR(31), /* Address of next CF entry. A   03433000
*                                      value of 0 indicates last        03434000
*                                      entry.                        */ 03435000
*         5 IXLYAMDCF_CFNext_Off Fixed(32), /* Offset of next CF        03436000
*                                      entry.  A value of 0             03437000
*                                      indicates last entry.     @M9A*/ 03438000
*       3    IXLYAMDCF_SL@ PTR(31), /* Address of first CF structure    03439000
*                                      limits entry. A value of 0       03440000
*                                      means that no structure limit    03441000
*                                      entries were provided for        03442000
*                                      this CF.                      */ 03443000
*         5 IXLYAMDCF_SL_Off Fixed(32), /* Offset of first CF structure 03444000
*                                      limits entry. A value of 0       03445000
*                                      means that no structure limit    03446000
*                                      entries were provided for        03447000
*                                      this CF.                  @M9A*/ 03448000
*       3    IXLYAMDCF_STR@ PTR(31), /* Address of first STR record     03449000
*                                      for this CF. A value of zero     03450000
*                                      means that no STR records were   03451000
*                                      provided for this CF.         */ 03452000
*         5 IXLYAMDCF_STR_Off Fixed(32),  /* Offset of first STR record 03453000
*                                      for this CF. A value of zero     03454000
*                                      means that no STR records were   03455000
*                                      provided for this CF.     @M9A*/ 03456000
*       3    IXLYAMDCF_SC@ PTR(31), /* Address of first subchannel      03457000
*                                      entry for this CF. A value of    03458000
*                                      zero means that no SC records    03459000
*                                      were provided for this CF.    */ 03460000
*         5 IXLYAMDCF_SC_Off Fixed(32), /* Offset of first subchannel   03461000
*                                      entry for this CF. A value of    03462000
*                                      zero means that no SC records    03463000
*                                      were provided for this           03464000
*                                      CF.                       @M9A*/ 03465000
*       3    IXLYAMDCF_MI@ PTR(31), /* Address of the measurement       03466000
*                                      information entry for this CF.   03467000
*                                      A value of zero means that the   03468000
*                                      MI record was not provided for   03469000
*                                      this CF.                      */ 03470000
*         5 IXLYAMDCF_MI_Off Fixed(32), /* Offset of the measurement    03471000
*                                      information entry for this CF.   03472000
*                                      A value of zero means that the   03473000
*                                      MI record was not provided for   03474000
*                                      this CF.                  @M9A*/ 03475000
*                                                                       03476000
*/********************** Facility Entry  *****************************/ 03477000
*/*********************Configuration Data*****************************/ 03478000
*                                                                       03479000
*       3    IXLYAMDCF_Cfid FIXED(32), /* Facility ID number         */ 03480000
*       3    IXLYAMDCF_CFname CHAR(8), /* Facility Name              */ 03481000
*       3    IXLYAMDCF_ND CHAR(32), /* Hardware Node Descriptor for     03482000
*                                      the facility. Mapped by          03483000
*                                      IXLYNDE.                      */ 03484000
*       3    *        CHAR(2),      /* Unused                        */ 03485000
*       3    IXLYAMDCF_SidMax FIXED(16), /* Maximum SID value        */ 03486000
*       3    IXLYAMDCF_Flags BIT(8), /* Flags                        */ 03487000
*         5    IXLYAMDCF_Connected BIT(1), /* Connected = Managed +     03488000
*                                      Available, which indicates       03489000
*                                      operations can be allowed        03490000
*                                      against the facility. If this    03491000
*                                      bit is off the facility          03492000
*                                      control information returned     03493000
*                                      will be from the last time the   03494000
*                                      facility was connected and may   03495000
*                                      be downlevel.                 */ 03496000
*         5    IXLYAMDCF_Managed BIT(1), /* The facility is in the      03497000
*                                      CFRM policy and XCF wishes to    03498000
*                                      use this facility             */ 03499000
*         5    IXLYAMDCF_Available BIT(1), /* This system has           03500000
*                                      physical paths connected to      03501000
*                                      the facility                  */ 03502000
*         5    IXLYAMDCF_Volatile BIT(1), /* This facility's storage    03503000
*                                      is volatile when this bit = 1    03504000
*                                      nonvolatile when this bit = 0 */ 03505000
*         5    IXLYAMDCF_AllSharedCPs BIT(1), /* This facility is       03506000
*                                      running with all shared CPs      03507000
*                                      Bit = 1. At least one dedicated  03508000
*                                      CP Bit = 0                @0BA*/ 03509000
*         5    IXLYAMDCF_DCFDI bit(1), /* Equals '1'B if                03510000
*                                      Dynamic CF Dispatching is active 03511000
*                                      for this facility, '0'B if not   03512000
*                                      (LEVEL15).                @LFA*/ 03513000
*         5    IXLYAMDCF_HWInfoDetailValid  bit(1), /* Equals '1'B if   03514000
*                                      IXLYAMDCF_HWInfoDetail field     03515000
*                                      mapping for this facility is     03516000
*                                      valid,'0'B if not valid.  @LJA*/ 03517000
*         5    IXLYAMDCF_StandAlone Bit(1),  /* When 1, this facility   03518000
*                                      is running on a CPC with no      03519000
*                                      z/OS LPARs                @LNA*/ 03520000
*       3    IXLYAMDCF_Flags2 BIT(8), /* More CF Flags           @LPC*/ 03521000
*         5    IXLYAMDCF_CTI  Bit(1), /* Set to '1'B if coupling        03522000
*                                        thin interrupts is enabled     03523000
*                                        for this coupling facility     03524000
*                                        (CFLEVEL 19 or above).         03525000
*                                        '0'B if not enabled in the     03526000
*                                        coupling facility       @LSC*/ 03527000
*         5   * Bit(7),               /* Reserved                @LPA*/ 03528000
*       3    *        CHAR(2),      /* Unused                    @LPC*/ 03529000
*       3    IXLYAMDCF_PathMasks CHAR(8), /* Pathing masks currently    03530000
*                                      in use                        */ 03531000
*         5    IXLYAMDCF_PHYSPM BIT(8), /* Physical path mask - paths   03532000
*                                      which have a physical            03533000
*                                      connection to the facility    */ 03534000
*         5    IXLYAMDCF_VARYPM BIT(8), /* VARY path mask - paths       03535000
*                                      which have a logical             03536000
*                                      connection to the facility    */ 03537000
*         5    IXLYAMDCF_XCFPM BIT(8), /* XCF path mask - paths         03538000
*                                      connected to the facility in     03539000
*                                      the active policy             */ 03540000
*         5    IXLYAMDCF_COMPPM BIT(8), /* Composite path mask =        03541000
*                                      PHYSPM + VARYPM + XCFPM       */ 03542000
*         5    *        CHAR(1),    /* Unused                        */ 03543000
*         5    IXLYAMDCF_Invalid BIT(8), /* Invalid paths mask -        03544000
*                                      paths not connected to correct   03545000
*                                      facility                      */ 03546000
*         5    IXLYAMDCF_NotValidated BIT(8), /* NotValidated paths     03547000
*                                      mask -- paths not connected   */ 03548000
*         5    *        CHAR(1),    /* Unused                        */ 03549000
*       3    IXLYAMDCF_Sequence FIXED(32), /* Sequence number. This     03550000
*                                      sequence number is changed       03551000
*                                      whenever a new "instance" of     03552000
*                                      this entity comes into use    */ 03553000
*       3    IXLYAMDCF_CUID BIT(16), /* Control unit ID              */ 03554000
*       3    *        CHAR(2),      /* Unused                        */ 03555000
*       3    IXLYAMDCF_HWInformation CHAR(64) BDY(WORD),                03556000
*                                   /* Facility Hardware information    03557000
*                                                                    */ 03558000
*         4    IXLYAMDCF_HWInfoDetail CHAR(64) BDY(WORD),               03559000
*                                   /* Facility Hardware information    03560000
*                                      subfield mapping is valid when   03561000
*                                      IXLYAMDCF_HWInfoDetailValid      03562000
*                                      is set                    @LJA*/ 03563000
*         5    *        CHAR(4),    /* Model dependent           @LJA*/ 03564000
*         5    IXLYAMDCF_CFCCRelease Fixed(16),                         03565000
*                                   /* CFCC RELEASE xx.yy        @LJA*/ 03566000
*           7    IXLYAMDCF_RELEASE1 FIXED(8),                           03567000
*                                      /* xx (packed decimal)    @LJA*/ 03568000
*           7    IXLYAMDCF_RELEASE2 FIXED(8),                           03569000
*                                      /* yy (can be treated as         03570000
*                                      packed decimal only for          03571000
*                                      official releases and service    03572000
*                                      levels, otherwise all hex        03573000
*                                      values are possible)      @LJA*/ 03574000
*         5    IXLYAMDCF_ServiceLevel Fixed(16),                        03575000
*                                   /* SERVICE LEVEL xx.yy (both xx     03576000
*                                      and yy can be treated as         03577000
*                                      packed decimal only for          03578000
*                                      official releases and service    03579000
*                                      levels, otherwise all hex        03580000
*                                      values are possible)      @LJA*/ 03581000
*           7    IXLYAMDCF_LEVEL1 FIXED(8),                             03582000
*                                      /* xx                     @LJA*/ 03583000
*           7    IXLYAMDCF_LEVEL2 FIXED(8),                             03584000
*                                      /* yy                     @LJA*/ 03585000
*         5    IXLYAMDCF_BuildDate Fixed(32),                           03586000
*                                   /* BUILT ON mm/dd/yyyy       @LJA*/ 03587000
*           7    IXLYAMDCF_DATE1 FIXED(8),                              03588000
*                                       /* mm (packed decimal)   @LJA*/ 03589000
*           7    IXLYAMDCF_DATE2 FIXED(8),                              03590000
*                                       /* dd (packed decimal)   @LJA*/ 03591000
*           7    IXLYAMDCF_DATE3 FIXED(16),                             03592000
*                                        /* yyyy (packed decimal)@LJA*/ 03593000
*         5    IXLYAMDCF_BuildTime CHAR(3),                             03594000
*                                   /* AT hh:mm:ss               @LJA*/ 03595000
*           7    IXLYAMDCF_TIME1 FIXED(8),                              03596000
*                                       /* hh (packed decimal)   @LJA*/ 03597000
*           7    IXLYAMDCF_TIME2 FIXED(8),                              03598000
*                                       /* mm (packed decimal)   @LJA*/ 03599000
*           7    IXLYAMDCF_TIME3 FIXED(8),                              03600000
*                                       /* ss (packed decimal)   @LJA*/ 03601000
*         5    *        CHAR(30),   /* model dependent           @LJA*/ 03602000
*         5    IXLYAMDCF_MFR CHAR(3),                                   03603000
*                                   /* 'IBM' - Manufacturer ID from     03604000
*                                      CF Node Descriptor for IBM       03605000
*                                      coupling facilities       @LJA*/ 03606000
*         5    *        CHAR(0),    /* End of Facility HW Info   @LJA*/ 03607000
*       3    IXLYAMDCF_NOSP fixed(16), /* Number shared processors      03608000
*                                      in the facility (LEVEL15) @LFA*/ 03609000
*       3    IXLYAMDCF_NODP fixed(16), /* Number dedicated processors   03610000
*                                      in the facility (LEVEL15) @LFA*/ 03611000
*       3    *        CHAR(12),     /* Unused                        */ 03612000
*                                                                       03613000
*/********************** Facility Entry  *****************************/ 03614000
*/*************** Accounting and Measurement Data ********************/ 03615000
*                                                                       03616000
*       3    IXLYAMDCF_Subch_Contention FIXED(32), /* Count of times    03617000
*                                      a free subchannel was not        03618000
*                                      available for synchronous        03619000
*                                      immediate operations          */ 03620000
*       3    IXLYAMDCF_ContentionTime CHAR(8), /* Summed contention     03621000
*                                      time for waiting for             03622000
*                                      subchannels to become free       03623000
*                                      (u-sec) for synchronous          03624000
*                                      immediate operations          */ 03625000
*       3    IXLYAMDCF_ContentionTimeSQR CHAR(8), /* Summed             03626000
*                                      contention time for waiting      03627000
*                                      for subchannels to become free   03628000
*                                      (u-sec squared) for              03629000
*                                      synchronous immediate            03630000
*                                      operations                    */ 03631000
*       3    IXLYAMDCF_Subch_Allocated FIXED(31), /* Count of number    03632000
*                                      of subchannels that this         03633000
*                                      facility has been allocated   */ 03634000
*       3    IXLYAMDCF_Subch_Inuse FIXED(32), /* Count of number of     03635000
*                                      subchannels available for use */ 03636000
*       3    IXLYAMDCF_Subch_MaxLimit FIXED(32), /* Count of total      03637000
*                                      number of subchannels that       03638000
*                                      could be used for operations     03639000
*                                      if available                  */ 03640000
*       3    IXLYAMDCF_Structure_Count FIXED(32), /* Count of number    03641000
*                                      of structures in use by          03642000
*                                      connectors from this system   */ 03643000
*       3    *        CHAR(4),      /* Unused                        */ 03644000
*       3    IXLYAMDCF_FailedOpTimeCount FIXED(32), /* Count of the     03645000
*                                      number of summed times -- for    03646000
*                                      unsuccessful operations       */ 03647000
*       3    IXLYAMDCF_FailedOpSumTime CHAR(8), /* Summed service       03648000
*                                      time of unsuccessful             03649000
*                                      operations (u-sec)            */ 03650000
*       3    IXLYAMDCF_FailedOpSumTimeSQR CHAR(8), /* Square of the     03651000
*                                      summed service time of           03652000
*                                      unsuccessful operations (u-sec   03653000
*                                      squared)                      */ 03654000
*       3    IXLYAMDCF_AccumulatedUtilCount CHAR(8), /* Utilization     03655000
*                                      count accumulated from the       03656000
*                                      subchannels that have been       03657000
*                                      deallocated               @08A*/ 03658000
*       3    IXLYAMDCF_AccumulatedBusyCount CHAR(8), /* Path Busy       03659000
*                                      count accumulated from the       03660000
*                                      subchannels that have been       03661000
*                                      deallocated               @08A*/ 03662000
*                                                                       03663000
*/********************** Facility Entry  *****************************/ 03664000
*/******************* Control Information ****************************/ 03665000
*                                                                       03666000
*       3    IXLYAMDCF_TS FIXED(32), /* Total facility space in 4K      03667000
*                                      blocks. Facility space is made   03668000
*                                      up of free space, dump space,    03669000
*                                      control space and                03670000
*                                      structure space               */ 03671000
*       3    IXLYAMDCF_FS FIXED(32), /* Total Free space in 4K          03672000
*                                      blocks. Free Space = Free        03673000
*                                      control space + free             03674000
*                                      non-control space             */ 03675000
*       3    IXLYAMDCF_TCS FIXED(32), /* Total Control space in 4K      03676000
*                                      blocks. Control space + non-     03677000
*                                      control space = total space   */ 03678000
*       3    IXLYAMDCF_FCS FIXED(32), /* Total Free control space in    03679000
*                                      4K blocks                     */ 03680000
*       3    IXLYAMDCF_GDC,         /* Global dumping controls       */ 03681000
*         5    IXLYAMDCF_TDS FIXED(32), /* Total Dumping Space in 4K    03682000
*                                      blocks. If TDS is lower than     03683000
*                                      the MRDS then the dump space     03684000
*                                      is not large enough to contain   03685000
*                                      the largest structure that was   03686000
*                                      dumped.                       */ 03687000
*         5    IXLYAMDCF_FDS FIXED(32), /* Free Dumping Space in 4K     03688000
*                                      blocks. If FDS is smaller than   03689000
*                                      the MRDS than there is not       03690000
*                                      enough available dump space to   03691000
*                                      contain the largest structure    03692000
*                                      that was dumped.              */ 03693000
*         5    IXLYAMDCF_ADTC FIXED(32), /* Associated dump table       03694000
*                                      count. If this count is          03695000
*                                      frequently more than one then    03696000
*                                      multiple structures are being    03697000
*                                      dumped at the same time       */ 03698000
*         5    IXLYAMDCF_MRDS FIXED(32), /* Maximum Requested Dumping   03699000
*                                      Space in 4K blocks        @L1C*/ 03700000
*       3    IXLYAMDCF_MDX FIXED(8), /* Largest Data Element size,      03701000
*                                      where size in bytes is           03702000
*                                      256*(2**MDX)                  */ 03703000
*       3    *        CHAR(1),                                          03704000
*       3    IXLYAMDCF_STGI FIXED(16), /* Storage increment in 4K       03705000
*                                      blocks                        */ 03706000
*       3    IXLYAMDCF_CFLEVEL FIXED(32), /* Coupling facility          03707000
*                                      architected function level       03708000
*                                                                @P6A*/ 03709000
*       3    *        CHAR(12),     /* Unused                    @P6C*/ 03710000
*       3    *        CHAR(0);                                          03711000
*                                                                       03712000
*   DECLARE                                                             03713000
*     1    IXLYAMDCF1 BASED IXLYAMDA_VIA, /* Coupling Facility (CF)     03714000
*                                      Entry, AmdaLevel>=1       @02A*/ 03715000
*       3    * CHAR(LENGTH(IXLYAMDCF)), /* Mapped by IXLYAMDCF          03716000
*                                                                @02A*/ 03717000
*       3    IXLYAMDCF1_RFAddr PTR(31), /* Address of the first         03718000
*                                      Remote Facility record for       03719000
*                                      this CF.  A non-zero value       03720000
*                                      will be returned when            03721000
*                                      HWSTATISTICS=(YES!CF) and        03722000
*                                      AMDALEVEL=(1!higher) are         03723000
*                                      specified and this CF is         03724000
*                                      connected to one or more         03725000
*                                      remote CFs.  A value of zero     03726000
*                                      indicates either the data was    03727000
*                                      not requested or there are no    03728000
*                                      remotely connected facilities    03729000
*                                      for this CF.              @PIC*/ 03730000
*         5 IXLYAMDCF1_RF_Off Fixed(32),  /* Offset of the first        03731000
*                                      Remote Facility record for       03732000
*                                      this CF.  A non-zero value       03733000
*                                      will be returned when            03734000
*                                      HWSTATISTICS=(YES!CF) and        03735000
*                                      AMDALEVEL=(1!higher) are         03736000
*                                      specified and this CF is         03737000
*                                      connected to one or more         03738000
*                                      remote CFs.  A value of zero     03739000
*                                      indicates either the data was    03740000
*                                      not requested or there are no    03741000
*                                      remotely connected facilities    03742000
*                                      for this CF.              @M9A*/ 03743000
*       3    IXLYAMDCF1_CPAddr Ptr(31), /* Address of the Channel       03744000
*                                      Path record for this CF.  A      03745000
*                                      non-zero value will be           03746000
*                                      returned when AMDALEVEL=         03747000
*                                      (1!higher) is specified.  @LNA*/ 03748000
*         5 IXLYAMDCF1_CP_Off Fixed(32), /* Offset of the Channel       03749000
*                                      Path record for this CF.  A      03750000
*                                      non-zero value will be           03751000
*                                      returned when AMDALEVEL=         03752000
*                                      (1!higher) is specified.  @M9A*/ 03753000
*       3    IXLYAMDCF1_TSCM CHAR(8), /* Total CF storage-class         03754000
*                                      memory in 4K blocks. Total CF    03755000
*                                      storage-class memory is the      03756000
*                                      amount of storage-class memory   03757000
*                                      that may be concurrently used    03758000
*                                      as structure extensions. It is   03759000
*                                      equal to the sum of the free     03760000
*                                      CF storage-class memory and      03761000
*                                      the storage-class memory in      03762000
*                                      use by structures in the         03763000
*                                      facility (LEVEL19)        @LTC*/ 03764000
*       3    IXLYAMDCF1_FSCM CHAR(8), /* Free CF storage-class memory   03765000
*                                      in 4k blocks. Free CF            03766000
*                                      storage-class memory is the      03767000
*                                      difference between the total     03768000
*                                      CF storage-class memory and      03769000
*                                      the sum of the CF                03770000
*                                      storage-class memory in use by   03771000
*                                      all structures in the facility   03772000
*                                      (LEVEL19)                 @LTC*/ 03773000
*       3    IXLYAMDCF1_SSTGI Fixed(16), /* Storage-class memory        03774000
*                                           increment. Number of 4k     03775000
*                                           blocks that are assigned    03776000
*                                           to a single storage-class   03777000
*                                           memory segment              03778000
*                                           (LEVEL19)            @LQA*/ 03779000
*       3    *        CHAR(6),      /* Reserved                  @PNA*/ 03780000
*       3    IxlyamdCf1_CfAuth CHAR(16), /* Zero or authority data      03781000
*                                      from coupling facility. Zero     03782000
*                                      when the coupling facility is    03783000
*                                      not managed.              @PNA*/ 03784000
*       3    *        CHAR(80);     /* Reserved                  @PNC*/ 03785000
*                                                                       03786000
*/********************************************************************/ 03787000
*/**************** List Structure Limits Entry************************/ 03788000
*/********************************************************************/ 03789000
*                                                                       03790000
*/**************** List Structure Limits Entry************************/ 03791000
*/*********************** Header *************************************/ 03792000
*                                                                       03793000
*   DECLARE                                                             03794000
*     1    IXLYAMDSLL BASED IXLYAMDA_VIA, /* Structure Limits for a     03795000
*                                      List Structure (SLL) Entry    */ 03796000
*       3    IXLYAMDSLL_Type BIT(8), /* X'11' -- indicates SLL data     03797000
*                                      for CF                        */ 03798000
*       3    *        CHAR(3),      /* Unused                        */ 03799000
*       3    IXLYAMDSLL_Length FIXED(32), /* Length of IXLYAMDSLL       03800000
*                                      entry mapping                 */ 03801000
*       3    IXLYAMDSLL_SLNext PTR(31), /* Address of next limit        03802000
*                                      entry. A value of 0 means last   03803000
*                                      entry for this facility.      */ 03804000
*         5 IXLYAMDSLL_SLNext_Off Fixed(32), /* Offset of next limit    03805000
*                                      entry. A value of 0 means last   03806000
*                                      entry for this facility.  @M9A*/ 03807000
*                                                                       03808000
*/**************** List Structure Limits Entry************************/ 03809000
*/********************Structure Limits********************************/ 03810000
*                                                                       03811000
*       3    IXLYAMDSLL_LNL FIXED(32), /* List Header Number limit   */ 03812000
*       3    IXLYAMDSLL_LTECHL FIXED(8), /* List lock table entry       03813000
*                                      characteristic limit. The        03814000
*                                      maximum supported size of a      03815000
*                                      lock table entry in bytes is     03816000
*                                      2**LTECHL.                    */ 03817000
*       3    IXLYAMDSLL_UIDL FIXED(8), /* Userid Limit               */ 03818000
*       3    *        CHAR(2),      /* Unused                        */ 03819000
*       3    IXLYAMDSLL_NDL FIXED(32), /* Notification Delay Limit      03820000
*                                      (NDL). The maximum list,         03821000
*                                      key-range and subsidiary list    03822000
*                                      notification delay limits for    03823000
*                                      the structure.  Bit positions    03824000
*                                      0-31 correspond to bit positions 03825000
*                                      32-63 of the CPU timer.  Bit 19  03826000
*                                      represents one microsecond.      03827000
*                                      (CFLEVEL>=22)             @LYA*/ 03828000
*         5  IXLYAMDSLL_SLNDL FIXED(32), /* Subsidiary list             03829000
*                                      notification delay (SLND) limit. 03830000
*                                      Bit positions 0-31 correspond to 03831000
*                                      bit positions 32-63 of the CPU   03832000
*                                      timer.  Bit 19 represents one    03833000
*                                      microsecond. (CFLEVEL>=16)@LYC*/ 03834000
*       3    *        CHAR(12);     /* Unused                    @LIC*/ 03835000
*                                                                       03836000
*   DECLARE                                                             03837000
*     1    IXLYAMDSLL1 BASED IXLYAMDA_VIA, /* Structure Limits for a    03838000
*                                      List Structure (SLL) Entry,      03839000
*                                      AmdaLevel>=1              @02A*/ 03840000
*       3    * CHAR(LENGTH(IXLYAMDSLL)), /* Mapped by IXLYAMDSLL        03841000
*                                                                @02A*/ 03842000
*       3    * CHAR(128);           /* Reserved                  @02A*/ 03843000
*                                                                       03844000
*/********************************************************************/ 03845000
*/**************** Cache Structure Limits Entry***********************/ 03846000
*/********************************************************************/ 03847000
*                                                                       03848000
*/**************** Cache Structure Limits Entry***********************/ 03849000
*/*************************** Header *********************************/ 03850000
*                                                                       03851000
*   DECLARE                                                             03852000
*     1    IXLYAMDSLC BASED IXLYAMDA_VIA, /* Structure Limits for       03853000
*                                      Cache Structure (SLC) Entry   */ 03854000
*       3    IXLYAMDSLC_Type BIT(8), /* X'12' -- indicates SLC data     03855000
*                                      for CF                        */ 03856000
*       3    *        CHAR(3),      /* Unused                        */ 03857000
*       3    IXLYAMDSLC_Length FIXED(32), /* Length of IXLYAMDSLC       03858000
*                                      entry mapping                 */ 03859000
*       3    IXLYAMDSLC_SLNext PTR(31), /* Address of next limit        03860000
*                                      entry. A value of 0 means last   03861000
*                                      entry for this facility.      */ 03862000
*         5 IXLYAMDSLC_SLNext_Off Fixed(32), /* Offset of next limit    03863000
*                                      entry. A value of 0 means last   03864000
*                                      entry for this facility.  @M9A*/ 03865000
*                                                                       03866000
*/**************** Cache Structure Limits Entry***********************/ 03867000
*/******************* Structure Limits *******************************/ 03868000
*                                                                       03869000
*       3    IXLYAMDSLC_LCIDLMT FIXED(8), /* Cache local cache          03870000
*                                      identifier limit              */ 03871000
*       3    *        CHAR(2),      /* reserved                      */ 03872000
*       3    IXLYAMDSLC_SCLMT FIXED(8), /* Cache storage class limit */ 03873000
*       3    IXLYAMDSLC_CCLMT FIXED(16), /* Cache cast-out class        03874000
*                                      limit                         */ 03875000
*       3    *        CHAR(18),     /* Unused                        */ 03876000
*       3    *        CHAR(0);                                          03877000
*                                                                       03878000
*   DECLARE                                                             03879000
*     1    IXLYAMDSLC1 BASED IXLYAMDA_VIA, /* Structure Limits for a    03880000
*                                      Cache Structure (SLC) Entry,     03881000
*                                      AmdaLevel>=1              @02A*/ 03882000
*       3    * CHAR(LENGTH(IXLYAMDSLC)), /* Mapped by IXLYAMDSLC        03883000
*                                                                @02A*/ 03884000
*       3    * CHAR(28);            /* Reserved                  @02A*/ 03885000
*                                                                       03886000
*                                                                       03887000
*/********************************************************************/ 03888000
*/**************** Facility Measurement Information Entry********@D1A*/ 03889000
*/********************************************************************/ 03890000
*                                                                       03891000
*/**************** Facility Measurement Information Header ******@D1A*/ 03892000
*                                                                       03893000
*   DECLARE                                                             03894000
*     1    IXLYAMDCFMI BASED IXLYAMDA_VIA, /* Coupling Facility         03895000
*                                      Measurement Information (CFMI)   03896000
*                                      Entry                     @D1A*/ 03897000
*       3    IXLYAMDCFMI_Type BIT(8), /* X'13' -- indicates CFMI data   03898000
*                                      for CF                    @D1A*/ 03899000
*       3    *        CHAR(3),      /* Unused                    @D1A*/ 03900000
*       3    IXLYAMDCFMI_Length FIXED(32), /* Length of IXLYAMDCFMI     03901000
*                                      entry                     @D1A*/ 03902000
*       3    IXLYAMDCFMI_INFO@ PTR(31), /* Address of the measurement   03903000
*                                      information array. An address    03904000
*                                      of 0 indicates no elements are   03905000
*                                      provided                  @D1A*/ 03906000
*         5 IXLYAMDCFMI_INFO_Off Fixed(32), /* Offset of the            03907000
*                                      measurement information          03908000
*                                      array. A value of 0              03909000
*                                      indicates no elements are        03910000
*                                      provided.                 @M9A*/ 03911000
*       3    IXLYAMDCFMI_INFOELEM FIXED(32); /* Number of elements in   03912000
*                                      the array Each element           03913000
*                                      contains the processor number    03914000
*                                      and the measurement block for    03915000
*                                      each valid processor      @D1A*/ 03916000
*                                                                       03917000
*/*****************Facility Measurement Info Element******************/ 03918000
*                                                                       03919000
*   DECLARE                                                             03920000
*     1    IXLYAMDCFMINFO BASED IXLYAMDA_VIA, /* Facility Measurement   03921000
*                                      Information Element       @D1A*/ 03922000
*       3    IXLYAMDCFMINFO_PNUM FIXED(32), /* Processor number for     03923000
*                                      which measurement information    03924000
*                                      is provided               @D1A*/ 03925000
*       3    IXLYAMDCFMINFO_PMB CHAR(64) BDY(WORD), /* Processor        03926000
*                                      measurement block         @D1A*/ 03927000
*         5    IXLYAMDCFMINFO_PEXTIME FIXED(32), /* Processor           03928000
*                                      execution time            @D1A*/ 03929000
*         5    IXLYAMDCFMINFO_PWTTIME FIXED(32), /* Processor wait      03930000
*                                      time                      @D1A*/ 03931000
*         5    IXLYAMDCFMINFO_PFLAGS char(1), /*                 @LFA*/ 03932000
*              7 IXLYAMDCFMINFO_PSDI bit(1), /* '1'B if processor is    03933000
*                                      dedicated, '0'B if shared        03934000
*                                      (LEVEL15)                 @LFA*/ 03935000
*              7 * bit(7),          /* reserved                  @LFA*/ 03936000
*         5    * char(1),           /* reserved                  @LFA*/ 03937000
*         5    IXLYAMDCFMINFO_PCWGT fixed(16), /* Processor current     03938000
*                                      weight.  Range 0-999 for shared  03939000
*                                      processor.  Equals 65535 for     03940000
*                                      dedicated processor.             03941000
*                                      (LEVEL15)                 @LFA*/ 03942000
*         5    IXLYAMDCFMINFO_ABSG Fixed(8),  /* Assigned buffer        03943000
*                                      summary group (LEVEL25)   @0HA*/ 03944000
*         5    * Char(7),           /* Reserved                  @0HA*/ 03945000
*         5    IXLYAMDCFMINFO_PCCNT Fixed(32),  /* Processor command    03946000
*                                      count - number of commands       03947000
*                                      started by this processor        03948000
*                                      since the last CF power-on       03949000
*                                      reset.  Wraps when the value     03950000
*                                      exceeds the maximum value.       03951000
*                                      (LEVEL25)                 @0HA*/ 03952000
*         5    IXLYAMDCFMINFO_CPU_TLE Char(16),  /* CPU-type            03953000
*                                      topology list entry, as          03954000
*                                      returned by the STSI             03955000
*                                      instruction SYSIB 15.1.2.        03956000
*                                      Refer to Principles of           03957000
*                                      Operation for format.            03958000
*                                      (LEVEL25)                 @0HA*/ 03959000
*         5    *        CHAR(24);   /* reserved                  @0HC*/ 03960000
*                                                                       03961000
*/********************************************************************/ 03962000
*/*          Coupling Facility Remote Facility Entry                 */ 03963000
*/*                                                                  */ 03964000
*/* When HWSTATISTICS=(YES!CF) and AMDALEVEL=(1 OR HIGHER) are       */ 03965000
*/* specified and the Coupling Facility has connectivity to one or   */ 03966000
*/* more remote Coupling Facilities (this requires both CFs be at    */ 03967000
*/* CFLEVEL 10 or higher) one Remote Facility Entry is returned for  */ 03968000
*/* each remote Coupling Facility.                                   */ 03969000
*/*                                                                  */ 03970000
*/* The term "subject CF" is used to describe the Coupling Facility  */ 03971000
*/* whose facility name is identified by the field IXLYAMDCF_CFname. */ 03972000
*/* The term "remote CF" is used to describe the Coupling Facility   */ 03973000
*/* whose facility name is identified by the field                   */ 03974000
*/* IXLYAMDCFRF_CFname.                                          @LXA*/ 03975000
*/*                                                                  */ 03976000
*/* The first remote facility record is pointed to by                */ 03977000
*/* IXLYAMDCF1_RFAddr and subsequent remote facility records (if     */ 03978000
*/* they exist) are pointed to by IXLYAMDCFRF_RFNext.            @PIC*/ 03979000
*/********************************************************************/ 03980000
*   DECLARE                                                             03981000
*     1    IXLYAMDCFRF BASED IXLYAMDA_VIA BDY(DWORD), /* CF Remote      03982000
*                                      Facility Entry            @LAA*/ 03983000
*       3    IXLYAMDCFRF_Type BIT(8), /* X'14' -- indicates remote      03984000
*                                      facility entry. (LEVEL10) @PIC*/ 03985000
*       3    *        CHAR(3),      /* Unused                    @LAA*/ 03986000
*       3    IXLYAMDCFRF_Length FIXED(32), /* Length of IXLYAMDCFRF     03987000
*                                      entry mapping. (LEVEL10)  @PIC*/ 03988000
*       3    IXLYAMDCFRF_RFNext PTR(31), /* Address of next remote      03989000
*                                      facility entry.  A value of      03990000
*                                      zero indicates this is the       03991000
*                                      last entry for this facility.    03992000
*                                      (LEVEL10)                 @PIC*/ 03993000
*         5 IXLYAMDCFRF_RFNext_Off Fixed(32), /* Offset of next remote  03994000
*                                      facility entry.  A value of      03995000
*                                      zero indicates this is the       03996000
*                                      last entry for this facility.    03997000
*                                      (LEVEL10)                 @M9C*/ 03998000
*                                                                       03999000
*/*******CFRF****Remote Facility Data******************************* */ 04000000
*                                                                       04001000
*       3    IXLYAMDCFRF_Node CHAR(32), /* Hardware node descriptor     04002000
*                                      for the remotely connected CF.   04003000
*                                      Mapped by IXLYNDE. (LEVEL10)     04004000
*                                                                @PIC*/ 04005000
*       3    IXLYAMDCFRF_SYID CHAR(8), /* System identification value   04006000
*                                      for the remotely connected CF.   04007000
*                                      (LEVEL10)                 @PIC*/ 04008000
*       3    IXLYAMDCFRF_CFNAME CHAR(8), /* Coupling facility name      04009000
*                                      for the remotely connected CF,   04010000
*                                      or binary zeroes if the CF's     04011000
*                                      node descriptor does not match   04012000
*                                      any CF that is both (a) defined  04013000
*                                      in the CFRM active policy, and   04014000
*                                      (b) also accessible to the       04015000
*                                      system on which the IXLMG        04016000
*                                      request was made. (LEVEL10)      04017000
*                                                                @PIC*/ 04018000
*       3    IXLYAMDCFRF_PGS   FIXED(8), /* Path group size.  The       04019000
*                                      number of currently active       04020000
*                                      receiver/peer paths over which   04021000
*                                      signals may be sent from the     04022000
*                                      subject CF to this remote        04023000
*                                      CF. (LEVEL10)             @07C*/ 04024000
*       3    *        CHAR(3),      /* Unused                    @LBA*/ 04025000
*       3    IXLYAMDCFRF_RFCTOC BIT(64), /* Remote facility controls    04026000
*                                      time of creation.  The time      04027000
*                                      of day (TOD) value at the        04028000
*                                      subject CF when the remote       04029000
*                                      facility controls for this       04030000
*                                      remote CF were created.  Note    04031000
*                                      that since coupling facilities   04032000
*                                      do not use the Sysplex Timer     04033000
*                                      for TOD clock synchronization,   04034000
*                                      this RFCTOC value may not be     04035000
*                                      meaningfully compared with       04036000
*                                      RFCTOC values obtained from      04037000
*                                      any other subject CF.  For the   04038000
*                                      same reason, RFCTOC values may   04039000
*                                      not be meaningfully compared     04040000
*                                      with TOD clock values            04041000
*                                      obtained on any system in        04042000
*                                      the sysplex.  In order to        04043000
*                                      meaningfully compare two sets    04044000
*                                      of remote facility signal        04045000
*                                      counters, obtained for the       04046000
*                                      same subject CF and remote CF    04047000
*                                      at different points in time,     04048000
*                                      the RFCTOC values obtained       04049000
*                                      for the two sets of counters     04050000
*                                      must be identical. (LEVEL10)     04051000
*                                                                @PIC*/ 04052000
*       3    IXLYAMDCFRF_RTESC FIXED(32), /* Ready to execute signal    04053000
*                                      counter.  The number of ready    04054000
*                                      to execute signals which have    04055000
*                                      been sent from the subject CF    04056000
*                                      to this remote CF since the      04057000
*                                      time at which the remote         04058000
*                                      facility controls were           04059000
*                                      created. (LEVEL10)        @PIC*/ 04060000
*       3    IXLYAMDCFRF_RTCSC FIXED(32), /* Ready to complete signal   04061000
*                                      counter.  The number of ready    04062000
*                                      to complete signals which have   04063000
*                                      been sent from the subject CF    04064000
*                                      to this remote CF since the      04065000
*                                      time at which the remote         04066000
*                                      facility controls were           04067000
*                                      created. (LEVEL10)        @PIC*/ 04068000
*       3    IXLYAMDCFRF_HESC  FIXED(32), /* Halt execution signal      04069000
*                                      counter.  The number of halt     04070000
*                                      execution signals which have     04071000
*                                      been sent from the subject CF    04072000
*                                      to this remote CF since the      04073000
*                                      time at which the remote         04074000
*                                      facility controls were           04075000
*                                      created. (LEVEL10)        @PIC*/ 04076000
*       3    IXLYAMDCFRF_RFSSC FIXED(32), /* Request for suppression    04077000
*                                      signal counter.  The number of   04078000
*                                      request for suppression signals  04079000
*                                      which have been sent from the    04080000
*                                      subject CF to this remote CF     04081000
*                                      since the time at which the      04082000
*                                      remote facility controls were    04083000
*                                      created. (LEVEL10)        @PIC*/ 04084000
*       3    IXLYAMDCFRF_RFSASC FIXED(32), /* Request for suppression   04085000
*                                      accepted signal counter.  The    04086000
*                                      number of request for            04087000
*                                      suppression accepted signals     04088000
*                                      which have been sent from the    04089000
*                                      subject CF to this remote CF     04090000
*                                      since the time at which the      04091000
*                                      remote facility controls were    04092000
*                                      created. (LEVEL10)        @PIC*/ 04093000
*       3    IXLYAMDCFRF_SSTFM FIXED(32), /* Sum of signal service      04094000
*                                      times.  The sum of service       04095000
*                                      times includes service times     04096000
*                                      for all types of requests        04097000
*                                      which have been sent from the    04098000
*                                      subject CF to this remote CF     04099000
*                                      since the time at which the      04100000
*                                      remote facility controls were    04101000
*                                      created, and also includes       04102000
*                                      the service time associated      04103000
*                                      with any redrives of those       04104000
*                                      signals.  However, it excludes   04105000
*                                      any delay time associated        04106000
*                                      with these signals (delay        04107000
*                                      time is accounted for            04108000
*                                      separately).                     04109000
*                                      NOTE: The SSTFM has been         04110000
*                                      extended to 64-bits to prevent   04111000
*                                      the value from wrapping in a     04112000
*                                      given data gathering interval.   04113000
*                                      The 64-bit value is contained in 04114000
*                                      IXLYAMDCFRF_SSTFME. When the     04115000
*                                      value of IXLYAMDCFRF_SSTFME is   04116000
*                                      non-zero, obtain the SSTFM from  04117000
*                                      IXLYAMDCFRF_SSTFME.  When the    04118000
*                                      IXLYAMDCFRF_SSTFME is zero,      04119000
*                                      obtain the SSTFM from            04120000
*                                      IXLYAMDCFRF_SSTFM. (LEVEL10)     04121000
*                                                                @09C*/ 04122000
*       3    IXLYAMDCFRF_SSTSM CHAR(8), /* Sum of squares of signal     04123000
*                                      service times.  The sum of       04124000
*                                      squares of service times         04125000
*                                      includes squared service times   04126000
*                                      for all types of requests        04127000
*                                      which have been sent from the    04128000
*                                      subject CF to this remote CF     04129000
*                                      since the time at which the      04130000
*                                      remote facility controls were    04131000
*                                      created, and also includes       04132000
*                                      the squared service time         04133000
*                                      associated with any redrives     04134000
*                                      of those signals.  However, it   04135000
*                                      excludes any delay time          04136000
*                                      associated with these signals    04137000
*                                      (delay time is accounted for     04138000
*                                      separately). (LEVEL10)    @PIC*/ 04139000
*       3    IXLYAMDCFRF_DSC   FIXED(32), /* Delayed signal counter.    04140000
*                                      The number of signals of all     04141000
*                                      types which have experienced     04142000
*                                      a delay in being sent from the   04143000
*                                      subject CF to this remote CF     04144000
*                                      since the time at which the      04145000
*                                      remote facility controls were    04146000
*                                      created. (LEVEL10)        @PIC*/ 04147000
*       3    IXLYAMDCFRF_SDTFM FIXED(32), /* Sum of signal delay        04148000
*                                      times.  The sum of delay times   04149000
*                                      includes delay times for all     04150000
*                                      types of requests which have     04151000
*                                      been sent from the subject CF    04152000
*                                      this remote CF since the time    04153000
*                                      at which the remote facility     04154000
*                                      controls were created.           04155000
*                                      (LEVEL10)                 @PIC*/ 04156000
*       3    IXLYAMDCFRF_SDTSM CHAR(8), /* Sum of squares of signal     04157000
*                                      times.  The sum of squares of    04158000
*                                      delay times includes squared     04159000
*                                      delay times for all types of     04160000
*                                      requests which have been sent    04161000
*                                      from the subject CF to this      04162000
*                                      remote CF since the time at      04163000
*                                      which the remote facility        04164000
*                                      controls were created.           04165000
*                                      (LEVEL10)                 @PIC*/ 04166000
*       3    IXLYAMDCFRF_SRDSC FIXED(32), /* Signal redrives signal     04167000
*                                      counter.  The number of          04168000
*                                      redrives of signals of all       04169000
*                                      types which have been sent       04170000
*                                      from the subject CF to this      04171000
*                                      remote CF since the time at      04172000
*                                      which the remote facility        04173000
*                                      controls were created.           04174000
*                                      (LEVEL10)                 @PIC*/ 04175000
*       3    IXLYAMDCFRF_CHPIDTYPES(8), /* A chpid type is provided for 04176000
*                                      each active receiver/peer        04177000
*                                      message path in the path group.  04178000
*                                      The number of valid              04179000
*                                      IXLYAMDCFRF_CHPIDTYPE entries    04180000
*                                      returned in each IXLYAMDCFRF is  04181000
*                                      equal to the path group size     04182000
*                                      returned in IXLYAMDCFRF_PGS      04183000
*                                                                @07C*/ 04184000
*         5    IXLYAMDCFRF_CHPIDTYPE FIXED(8), /* CHPid Type     @PKA*/ 04185000
*       3    IXLYAMDCFRF_SSTFME CHAR(8), /* 64-bit Sum of signal        04186000
*                                      service times.  The sum of       04187000
*                                      service times includes service   04188000
*                                      times for all types of requests  04189000
*                                      which have been sent from the    04190000
*                                      subject CF to this remote CF     04191000
*                                      since the time at which the      04192000
*                                      remote facility controls were    04193000
*                                      created, and also includes       04194000
*                                      the service time associated      04195000
*                                      with any redrives of those       04196000
*                                      signals.  However, it excludes   04197000
*                                      any delay time associated        04198000
*                                      with these signals (delay        04199000
*                                      time is accounted for            04200000
*                                      separately).                     04201000
*                                      NOTE: When the value of          04202000
*                                      IXLYAMDCFRF_SSTFME is non-zero,  04203000
*                                      obtain the SSTFM from            04204000
*                                      IXLYAMDCFRF_SSTFME.  When the    04205000
*                                      IXLYAMDCFRF_SSTFME is zero,      04206000
*                                      obtain the SSTFM from            04207000
*                                      IXLYAMDCFRF_SSTFM. (LEVEL11)     04208000
*                                                                @09A*/ 04209000
*       3    IXLYAMDCFRF_CHPIDS(8), /* One CHPID for each active        04210000
*                                      receiver/peer message path in    04211000
*                                      the path group.  The number      04212000
*                                      of valid IXLYAMDCFRF_CHPIDS      04213000
*                                      entries returned in each         04214000
*                                      IXLYAMDCFRF is equal to the      04215000
*                                      path group size returned in      04216000
*                                      IXLYAMDCFRF_PGS           @LNA*/ 04217000
*         5    IXLYAMDCFRF_CHPID FIXED(8), /* Channel path ID    @LNA*/ 04218000
*/********************************************************************/ 04219000
*/* Each entry in the IXLYAMDCFRF_Validity array describes the          04220000
*   validity of fields in the corresponding entry in the                04221000
*   IXLYAMDCFRF_PathData array.                                  @LNA*/ 04222000
*/********************************************************************/ 04223000
*       3    IXLYAMDCFRF_Validity(8) Bit(8),  /* Validity flags for     04224000
*                                      IXLYAMDCFRF_PathData      @LNA*/ 04225000
*         5    IXLYAMDCFRF_ModeValid Bit(1),  /* On when                04226000
*                                      IXLYAMDCFRF_Mode is valid @LNA*/ 04227000
*         5    IXLYAMDCFRF_LatencyValid Bit(1),  /* On when             04228000
*                                      IXLYAMDCFRF_Latency is           04229000
*                                      valid                     @LNA*/ 04230000
*         5    IXLYAMDCFRF_DegradedValid Bit(1),  /* On when            04231000
*                                      IXLYAMDCFRF_Degraded is          04232000
*                                      valid                     @LNA*/ 04233000
*         5    * Bit(5),            /* Unused                    @LNA*/ 04234000
*                                                                       04235000
*       3    IXLYAMDCFRF_PathData(8) Char(12) Bdy(Word),  /* Path-      04236000
*                                      specific data             @LNA*/ 04237000
*         5    IXLYAMDCFRF_Mode Fixed(8),  /* Additional information    04238000
*                                      describing the mode of           04239000
*                                      operation of the path -          04240000
*                                      see constants                    04241000
*                                      IXLYAMDA_PathMode_Xxx.           04242000
*                                      Valid when                       04243000
*                                      IXLYAMDCFRF_ModeValid on. @LNA*/ 04244000
*         5    IXLYAMDCFRF_Flags Bit(8),  /* Path-related flags  @LNA*/ 04245000
*           7    IXLYAMDCFRF_Degraded Bit(1),  /* On => path is         04246000
*                                      operating at reduced             04247000
*                                      capacity, or is not              04248000
*                                      operating.  Valid when           04249000
*                                      IXLYAMDCFRF_DegradedValid        04250000
*                                      on.                       @LNA*/ 04251000
*           7    * Bit(7),          /* Reserved                  @LNA*/ 04252000
*                                                                       04253000
*         5    * Char(2),           /* Reserved                  @LNA*/ 04254000
*                                                                       04255000
*         5    IXLYAMDCFRF_Latency Fixed(32),  /* Average round-        04256000
*                                      trip path time, in               04257000
*                                      microseconds.  A value of 0      04258000
*                                      means that the time has not      04259000
*                                      been or cannot be measured.      04260000
*                                      A value of 1 means a time        04261000
*                                      less than or equal to 1          04262000
*                                      microsecond.  Valid when         04263000
*                                      IXLYAMDCFRF_LatencyValid         04264000
*                                      on.                       @LNA*/ 04265000
*                                                                       04266000
*         5    * Char(4),           /* Reserved                  @LNA*/ 04267000
*                                                                       04268000
*       3    * CHAR(4);             /* Reserved                  @LNC*/ 04269000
*                                                                       04270000
*   DECLARE                                                             04271000
*     1    IXLYAMDCFRF1 BASED IXLYAMDA_VIA BDY(DWORD), /* CF Remote     04272000
*                                      Facility Entry, AmdaLevel >=2    04273000
*                                                                @LXA*/ 04274000
*       3    * CHAR(LENGTH(IXLYAMDCFRF)), /* Mapped by IXLYAMDCFRF      04275000
*                                                                @LXA*/ 04276000
*       3    IXLYAMDCFRF1_SPGS   FIXED(8), /* Sender path group size.   04277000
*                                      The number of currently active   04278000
*                                      sender/peer paths over which     04279000
*                                      signals may be sent from this    04280000
*                                      remote CF to the subject CF.     04281000
*                                      (LEVEL10)                 @LXA*/ 04282000
*       3    *        CHAR(7),      /* Unused                    @LXA*/ 04283000
*       3    IXLYAMDCFRF1_SCHPIDTYPES(8), /* A CHPID type is provided   04284000
*                                      for each active sender/peer      04285000
*                                      message path in the path group.  04286000
*                                      The number of valid              04287000
*                                      IXLYAMDCFRF1_SCHPIDTYPE entries  04288000
*                                      returned in each IXLYAMDCFRF1    04289000
*                                      is equal to the path group size  04290000
*                                      returned in IXLYAMDCFRF1_SPGS.   04291000
*                                      (LEVEL10)                 @LXA*/ 04292000
*         5    IXLYAMDCFRF1_SCHPIDTYPE FIXED(8), /* Sender CHPID Type   04293000
*                                                                @LXA*/ 04294000
*       3    IXLYAMDCFRF1_SCHPIDS(8), /* One CHPID for each active      04295000
*                                      sender/peer message path in the  04296000
*                                      path group.  The number of       04297000
*                                      valid IXLYAMDCFRF1_SCHPIDS       04298000
*                                      entries returned in each         04299000
*                                      IXLYAMDCFRF1 is equal to the     04300000
*                                      path group size returned in      04301000
*                                      IXLYAMDCFRF1_SPGS. (LEVEL10)     04302000
*                                                                @LXA*/ 04303000
*         5    IXLYAMDCFRF1_SCHPID FIXED(8), /* Sender channel path ID  04304000
*                                                                @LXA*/ 04305000
*/********************************************************************/ 04306000
*/* Each entry in the IXLYAMDCFRF1_SValidity array describes the        04307000
*   validity of fields in the corresponding entry in the                04308000
*   IXLYAMDCFRF1_SPathData array.                                @LXA*/ 04309000
*/********************************************************************/ 04310000
*       3    IXLYAMDCFRF1_SValidity(8) Bit(8),  /* Validity flags for   04311000
*                                      IXLYAMDCFRF1_SPathData    @LXA*/ 04312000
*         5    IXLYAMDCFRF1_SModeValid Bit(1),  /* On when              04313000
*                                      IXLYAMDCFRF1_SMode is valid      04314000
*                                                                @LXA*/ 04315000
*         5    IXLYAMDCFRF1_SLatencyValid Bit(1),  /* On when           04316000
*                                      IXLYAMDCFRF1_SLatency is         04317000
*                                      valid                     @LXA*/ 04318000
*         5    IXLYAMDCFRF1_SDegradedValid Bit(1),  /* On when          04319000
*                                      IXLYAMDCFRF1_SDegraded is        04320000
*                                      valid                     @LXA*/ 04321000
*         5    * Bit(5),            /* Unused                    @LXA*/ 04322000
*                                                                       04323000
*       3    IXLYAMDCFRF1_SPathData(8) Char(12) Bdy(Word),  /* Sender   04324000
*                                      path-specific data        @LXA*/ 04325000
*         5    IXLYAMDCFRF1_SMode Fixed(8),  /* Additional information  04326000
*                                      describing the mode of           04327000
*                                      operation of the path -          04328000
*                                      see constants                    04329000
*                                      IXLYAMDA_PathMode_Xxx.           04330000
*                                      Valid when                       04331000
*                                      IXLYAMDCFRF1_SModeValid on.      04332000
*                                                                @LXA*/ 04333000
*         5    IXLYAMDCFRF1_SFlags Bit(8), /* Sender path-related       04334000
*                                      flags                     @LXA*/ 04335000
*           7    IXLYAMDCFRF1_SDegraded Bit(1),  /* On => path is       04336000
*                                      operating at reduced             04337000
*                                      capacity, or is not              04338000
*                                      operating.  Valid when           04339000
*                                      IXLYAMDCFRF1_SDegradedValid      04340000
*                                      on.                       @LXA*/ 04341000
*           7    * Bit(7),          /* Reserved                  @LXA*/ 04342000
*                                                                       04343000
*         5    * Char(2),           /* Reserved                  @LXA*/ 04344000
*                                                                       04345000
*         5    IXLYAMDCFRF1_SLatency Fixed(32),  /* Average round-      04346000
*                                      trip path time, in               04347000
*                                      microseconds.  A value of 0      04348000
*                                      means that the time has not      04349000
*                                      been or cannot be measured.      04350000
*                                      A value of 1 means a time        04351000
*                                      less than or equal to 1          04352000
*                                      microsecond.  Valid when         04353000
*                                      IXLYAMDCFRF1_SLatencyValid       04354000
*                                      on.                       @LXA*/ 04355000
*         5    * Char(4),           /* Reserved                  @LXA*/ 04356000
*                                                                       04357000
*       3    IXLYAMDCFRF1_SC FIXED(32), /* Subchannel count. The        04358000
*                                      number of subchannels            04359000
*                                      associated with the remote       04360000
*                                      facility. (LEVEL21)      @LXA*/  04361000
*       3    IXLYAMDCFRF1_AMC FIXED(32), /* Asynchronous message        04362000
*                                      counter. The number of           04363000
*                                      asynchronous messages that are   04364000
*                                      sent to the remote facility.     04365000
*                                      The counter includes the number  04366000
*                                      of push commands that are sent   04367000
*                                      and excludes path management     04368000
*                                      commands and redrives of push    04369000
*                                      commands. (LEVEL21)       @LXA*/ 04370000
*       3    IXLYAMDCFRF1_AMSTFM FIXED(64), /* Asynchronous message     04371000
*                                      service time 1st moment. The     04372000
*                                      accumulated service time, in     04373000
*                                      microseconds, for asynchronous   04374000
*                                      messages sent to the remote      04375000
*                                      facility. (LEVEL21)       @LXA*/ 04376000
*       3    IXLYAMDCFRF1_AMSTSM FIXED(64), /* Asynchronous message     04377000
*                                      service time 2nd moment. The     04378000
*                                      accumlated squares of service    04379000
*                                      time, in squared-microsecond     04380000
*                                      units, for asynchronous          04381000
*                                      messages sent to the remote      04382000
*                                      facility. (LEVEL21)       @LXA*/ 04383000
*       3    IXLYAMDCFRF1_AMPBC Fixed(32),  /* Asynchronous message     04384000
*                                      path busy count (LEVEL21).       04385000
*                                      This count may be reset to 0     04386000
*                                      when all links between the       04387000
*                                      CF and the remote CF are         04388000
*                                      lost and subsequently            04389000
*                                      restored.                 @POC*/ 04390000
*       3    IXLYAMDCFRF1_AMNSAC Fixed(32),  /* Asynchronous message    04391000
*                                      no subchannel count              04392000
*                                      (LEVEL21).  This count may       04393000
*                                      be reset to 0 when all links     04394000
*                                      between the CF and the remote    04395000
*                                      CF are lost and subsequently     04396000
*                                      restored.                 @POC*/ 04397000
*       3    *        CHAR(96),     /* Reserved                  @LZC*/ 04398000
*       3    *        CHAR(0);      /*                           @LXA*/ 04399000
*                                                                       04400000
*/********************************************************************/ 04401000
*/*          Coupling Facility Channel Path Record                      04402000
*                                                                       04403000
*   When AMDALEVEL=(1 or higher) is specified, one Channel Path         04404000
*   record is returned for each coupling facility.                      04405000
*                                                                       04406000
*   The channel path record is pointed to by IXLYAMDCF1_CPAddr.         04407000
*   It consists of the record header, mapped by IXLYAMDCFCP, and        04408000
*   an array of path descriptors, each of which describes the           04409000
*   characteristics of one path to the CF and is mapped by              04410000
*   IXLYAMDCFCP_PathInfo.                                               04411000
*                                                                       04412000
*   The entries in the array pointed to by IXLYAMDCFCP_PathInfo@        04413000
*   correspond 1-1 to the entries in IXLYAMDSC_Chpids and the path      04414000
*   masks in the IXLYAMDSC record (which is always provided when        04415000
*   this record is provided).  Once the index of a particular path      04416000
*   into the IXLYAMDSC arrays has been determined, the corresponding    04417000
*   IXLYAMDCFCPInfo entry can be located using the same index:          04418000
*                                                                       04419000
*   Address of entry =                                                  04420000
*       IXLYAMDCFCP_PathInfo@ + ((index - 1) * IXLYAMDCFCP_EntryLen)    04421000
*                                                                       04422000
*   assuming that index is 1-origin.                                    04423000
*                                                                       04424000
*   An IXLYAMDCFCPInfo entry is valid if the corresponding bit in       04425000
*   IXLYAMDSC_PIM is on (for any of the IXLYAMDSC records associated    04426000
*   with the coupling facility with which this IXLYAMDCFCP record       04427000
*   is associated).                                                     04428000
*                                                                @LNA*/ 04429000
*/********************************************************************/ 04430000
* Declare                                                               04431000
* 1 IXLYAMDCFCP Based IXLYAMDA_VIA Bdy(DWord), /* CF Channel Path       04432000
*                                      record                    @LNA*/ 04433000
*   3 IXLYAMDCFCP_Type Bit(8),      /* x'15' - indicates channel        04434000
*                                      path entry                @LNA*/ 04435000
*   3 * Char(3),                    /* Unused                    @LNA*/ 04436000
*   3 IXLYAMDCFCP_Length Fixed(32), /* Length of IXLYAMDCFCP            04437000
*                                      entry mapping, not including     04438000
*                                      the array pointed to by          04439000
*                                      IXLYAMDCFCP_PathInfo@     @LNA*/ 04440000
*   3 * Ptr(31),                    /* Reserved, always 0 (maps to      04441000
*                                      the generic next-record          04442000
*                                      pointer, but there is never      04443000
*                                      more than one channel path       04444000
*                                      record per CF)            @LNA*/ 04445000
*   3 IXLYAMDCFCP_NumEntries Fixed(31),  /* Number of channel path      04446000
*                                      information array entries.       04447000
*                                      Always the same as the           04448000
*                                      number of elements in            04449000
*                                      IXLYAMDSC_Chpids.         @LNA*/ 04450000
*   3 IXLYAMDCFCP_EntryLen Fixed(31),  /* Length of each channel        04451000
*                                      path information array           04452000
*                                      entry                     @LNA*/ 04453000
*   3 IXLYAMDCFCP_PathInfo@ Ptr(31),  /* Address of channel path        04454000
*                                      information array.        @LNA*/ 04455000
*     5 IXLYAMDCFCP_PathInfo_Off Fixed(32); /* Offset of channel path   04456000
*                                      information array.        @M9A*/ 04457000
*/********************************************************************/ 04458000
*/*    Coupling Facility Channel Path Information Array entry    @LNA*/ 04459000
*/********************************************************************/ 04460000
* Declare                                                               04461000
* 1 IXLYAMDCFCPInfo Based IXLYAMDA_VIA Bdy(Word),  /* CF channel        04462000
*                                      path description          @LNA*/ 04463000
*   3 IXLYAMDCFCP_CHPID Fixed(8),   /* CHPID                     @LNA*/ 04464000
*                                                                       04465000
*   3 IXLYAMDCFCP_PathType Fixed(8),  /* Path type - see constants      04466000
*                                      IXLYAMDA_CHPIDType_Xxx    @LNA*/ 04467000
*   3 * Char(2),                    /* Reserved                  @LNA*/ 04468000
*                                                                       04469000
*   3 IXLYAMDCFCP_Validity Bit(32),  /* Validity flags           @LNA*/ 04470000
*                                                                       04471000
*     5 IXLYAMDCFCP_Validity1 Bit(8),                         /* @LNA*/ 04472000
*       7 IXLYAMDCFCP_AttachmentValid Bit(1),  /* On when fields in     04473000
*                                      IXLYAMDCFCP_AttachmentInfo       04474000
*                                      are valid                 @LNA*/ 04475000
*       7 IXLYAMDCFCP_ModeValid Bit(1),  /* On when IXLYAMDCFCP_Mode    04476000
*                                      is valid                  @LNA*/ 04477000
*       7 IXLYAMDCFCP_LatencyValid Bit(1),  /* On when                  04478000
*                                      IXLYAMDCFCP_Latency is           04479000
*                                      valid                     @LNA*/ 04480000
*       7 IXLYAMDCFCP_DegradedValid Bit(1),  /* On when                 04481000
*                                      IXLYAMDCFCP_Degraded is          04482000
*                                      valid                     @LNA*/ 04483000
*       7 IXLYAMDCFCP_AffinityValid Bit(4),  /* Each bit is on when     04484000
*                                      the corresponding entry in       04485000
*                                      IXLYAMDCFCP_SAP_Affinity         04486000
*                                      is valid                  @LNA*/ 04487000
*     5 IXLYAMDCFCP_Validity2 Bit(8),                         /* @LNA*/ 04488000
*       7 IXLYAMDCFCP_CHIDValid Bit(1),  /* On when IXLYAMDCFCP_CHID    04489000
*                                      is valid                  @LNA*/ 04490000
*       7 * Bit(7),                 /* Reserved                  @LNA*/ 04491000
*                                                                       04492000
*     5 IXLYAMDCFCP_Validity3 Bit(8),  /* Reserved               @LNA*/ 04493000
*     5 IXLYAMDCFCP_Validity4 Bit(8),  /* Reserved               @LNA*/ 04494000
*                                                                       04495000
*   3 IXLYAMDCFCP_AttachmentInfo Char(3) Bdy(Word),  /* Physical        04496000
*                                      attachment information.          04497000
*                                      Valid when                       04498000
*                                      IXLYAMDCFCP_AttachmentValid      04499000
*                                      on.                       @LNA*/ 04500000
*     5 IXLYAMDCFCP_AdapterID Fixed(16),  /* Identifies the adapter     04501000
*                                      through which the path is        04502000
*                                      connected                 @LNA*/ 04503000
*     5 IXLYAMDCFCP_PortNum Fixed(8),  /* Identifies the adapter        04504000
*                                      port to which the path is        04505000
*                                      connected                 @LNA*/ 04506000
*   3 IXLYAMDCFCP_Mode Fixed(8),    /* Additional information           04507000
*                                      describing the mode of           04508000
*                                      operation of the path -          04509000
*                                      see constants                    04510000
*                                      IXLYAMDA_PathMode_Xxx.           04511000
*                                      Valid when                       04512000
*                                      IXLYAMDCFCP_ModeValid on. @LNA*/ 04513000
*   3 IXLYAMDCFCP_Latency Fixed(32),  /* Average round-trip path        04514000
*                                      time, in microseconds.  A        04515000
*                                      value of 0 means that the        04516000
*                                      time has not been or cannot      04517000
*                                      be measured.  A value of 1       04518000
*                                      means a time less than or        04519000
*                                      equal to 1 microsecond.          04520000
*                                      Valid when                       04521000
*                                      IXLYAMDCFCP_LatencyValid         04522000
*                                      on.                       @LNA*/ 04523000
*   3 IXLYAMDCFCP_Flags Bit(8),     /* Path-related flags        @LNA*/ 04524000
*     5 IXLYAMDCFCP_Degraded Bit(1),  /* On => path is operating        04525000
*                                      at reduced capacity, or is       04526000
*                                      not operating.  Valid when       04527000
*                                      IXLYAMDCFCP_DegradedValid        04528000
*                                      on.                       @LNA*/ 04529000
*     5 * Bit(7),                   /* Reserved                  @LNA*/ 04530000
*                                                                       04531000
*   3 * Char(1),                    /* Reserved                  @LNA*/ 04532000
*                                                                       04533000
*   3 IXLYAMDCFCP_CHID Fixed(16),   /* Channel ID (PCHID).  Valid       04534000
*                                      when IXLYAMDCFCP_CHIDValid       04535000
*                                      on.                       @LNA*/ 04536000
*   3 IXLYAMDCFCP_SAP_Affinity(4) Fixed(8),  /* Array of I/O            04537000
*                                      processors (System Assist        04538000
*                                      Processors) to which this        04539000
*                                      path is accessible.  Each        04540000
*                                      array entry is valid when        04541000
*                                      the corresponding bit in         04542000
*                                      IXLYAMDCFCP_AffinityValid        04543000
*                                      is on.  Valid values are         04544000
*                                      0-255.                    @LNA*/ 04545000
*   3 * Char(40),                   /* Reserved                  @LNA*/ 04546000
*   3 * Char(0);                                                        04547000
*                                                                       04548000
*/********************* CFCP ** Channel Path Data ****************** */ 04549000
*                                                                       04550000
*/*            End of Coupling Facility Channel Path Entry           */ 04551000
*                                                                       04552000
*/********************************************************************/ 04553000
*/**************** Structure Entry for List***************************/ 04554000
*/********************************************************************/ 04555000
*                                                                       04556000
*/******LIST*******Header*********************************************/ 04557000
*                                                                       04558000
*   DECLARE                                                             04559000
*     1    IXLYAMDSTRL BASED IXLYAMDA_VIA, /* Structure Entry for       04560000
*                                      List Structure (STRL)         */ 04561000
*       3    IXLYAMDSTRL_Type BIT(8), /* X'21' -- indicates STR data    04562000
*                                      for CF                        */ 04563000
*       3    *        CHAR(3),      /* Unused                        */ 04564000
*       3    IXLYAMDSTRL_Length FIXED(32), /* Length of IXLYAMDSTR      04565000
*                                      entry mapping                 */ 04566000
*       3    IXLYAMDSTRL_STRNext PTR(31), /* Address of next STR        04567000
*                                      entry. A value of 0 means last   04568000
*                                      entry for this facility.      */ 04569000
*         5 IXLYAMDSTRL_STRNext_Off Fixed(32), /* Offset of next STR    04570000
*                                      entry. A value of 0 means last   04571000
*                                      entry for this facility.  @M9A*/ 04572000
*                                                                       04573000
*/*******LIST****Configuration Data ******************************** */ 04574000
*                                                                       04575000
*       3    IXLYAMDSTRL_TTY FIXED(8), /* Structure type identifier  */ 04576000
*       3    IXLYAMDSTRL_TTY_Status CHAR(1),                            04577000
*         5    IXLYAMDSTRL_TypeSerList BIT(1), /* The List structure    04578000
*                                      is a serialized list      @L2A*/ 04579000
*         5    IXLYAMDSTRL_RBLDValid BIT(1), /* The structure rebuild   04580000
*                                      status indications reported in   04581000
*                                      the IXLYAMDSTRL_RBLDStatus are   04582000
*                                      valid -- These values will only  04583000
*                                      be valid and reported when       04584000
*                                      information is requested for a   04585000
*                                      particular structure      @PBA*/ 04586000
*       3    IXLYAMDSTRL_SID FIXED(16), /* Structure ID              */ 04587000
*       3    IXLYAMDSTRL_Version BIT(64), /* Structure version number.  04588000
*                                      Changes when a new physical      04589000
*                                      instance of the structure is     04590000
*                                      allocated (e.g., user- or        04591000
*                                      system-managed rebuild), and     04592000
*                                      there is at least one active     04593000
*                                      connector to observe the         04594000
*                                      allocation.               @PFC*/ 04595000
*         5    IXLYAMDSTRL_PhysicalVersion BIT(64), /* Structure        04596000
*                                      version number.                  04597000
*                                      Changes when a new physical      04598000
*                                      instance of the structure is     04599000
*                                      allocated (e.g., user- or        04600000
*                                      system-managed rebuild), and     04601000
*                                      there is at least one active     04602000
*                                      connector to observe the         04603000
*                                      allocation. See also             04604000
*                                      IXLYAMDSSCC_CopyVersion.  @L7A*/ 04605000
*       3    IXLYAMDSTRL_STRName CHAR(16), /* Structure name         */ 04606000
*       3    IXLYAMDSTRL_RBLDStatus BIT(8), /* Rebuild status flags     04607000
*                                      This information will only be    04608000
*                                      valid if IXLYAMDSTRL_RBLDValid   04609000
*                                      is set.                   @PBA*/ 04610000
*         5    IXLYAMDSTRL_StrInRebld BIT(1), /* ON indicates that      04611000
*                                      the structure is in rebuild      04612000
*                                                               @PBA*/  04613000
*         5    IXLYAMDSTRL_RebldOldStr BIT(1), /* ON indicates that     04614000
*                                      the structure information        04615000
*                                      pertains to the OLD structure    04616000
*                                                               @PBA*/  04617000
*         5    IXLYAMDSTRL_RebldNewStr BIT(1), /* ON indicates that     04618000
*                                      the structure information        04619000
*                                      pertains to the NEW structure    04620000
*                                                               @PBA*/  04621000
*         5    IXLYAMDSTRL_RebldDuplexStr BIT(1), /* ON indicates the   04622000
*                                      structure rebuild is a duplexing 04623000
*                                      rebuild.  OFF indicates the      04624000
*                                      structure rebuild is a normal    04625000
*                                      rebuild.  This bit only applies  04626000
*                                      when IXLYAMDSTRL_StrInRebld is   04627000
*                                      on.                       @03A*/ 04628000
*                                                                       04629000
*         5    IXLYAMDSTRL_RebldMethodStr  BIT(1), /* ON indicates the  04630000
*                                      structure rebuild is system      04631000
*                                      managed.  OFF indicates the      04632000
*                                      structure rebuild is user        04633000
*                                      managed.  This bit only applies  04634000
*                                      when IXLYAMDSTRL_StrInRebld is   04635000
*                                      on.                       @L8A*/ 04636000
*                                                                       04637000
*       3    *        CHAR(3),                                          04638000
*                                                                       04639000
*/******LIST***************** Measurement Data ********************* */ 04640000
*                                                                       04641000
*       3    IXLYAMDSTRL_Status CHAR(1), /* Structure status bits    */ 04642000
*         5    IXLYAMDSTRL_AMValid BIT(1), /* The following             04643000
*                                      measurement data is valid     */ 04644000
*         5    IXLYAMDSTRL_DumpSerialHeld BIT(1), /* Dump               04645000
*                                      serialization is held against    04646000
*                                      this structure - internal        04647000
*                                      operations are failed, -         04648000
*                                      external operations are          04649000
*                                      delayed. Hardware control data   04650000
*                                      will not be available.        */ 04651000
*       3    *        CHAR(1),      /* Unused                    @05C*/ 04652000
*/********************************************************************/ 04653000
*/* Begin fields whose validity is indicated by the              @LDM*/ 04654000
*/* IXLYAMDSTRL_AMValid flag                                     @LDM*/ 04655000
*/********************************************************************/ 04656000
*       3    IXLYAMDSTRL_AMDataSequence FIXED(16), /* Sequence number   04657000
*                                      associated with this instance    04658000
*                                      of Measurement Data from this    04659000
*                                      system.                   @05A*/ 04660000
*       3    IXLYAMDSTRL_Reqct FIXED(32), /* Total requests by          04661000
*                                      structure (this relates to       04662000
*                                      external requests such as        04663000
*                                      IXLLIST macro invocations, NOT   04664000
*                                      to requests sent to the          04665000
*                                      facility).                    */ 04666000
*       3    IXLYAMDSTRL_ReqctAsync FIXED(32), /* Total asynchronous    04667000
*                                      requests started (LOCK structure 04668000
*                                      only)                     @PJC*/ 04669000
*       3    IXLYAMDSTRL_ContCt FIXED(32), /* Total number of           04670000
*                                      requests that encountered        04671000
*                                      contention on a lock table       04672000
*                                      entry (LOCK structure only)   */ 04673000
*       3    IXLYAMDSTRL_FContCt FIXED(32), /* False contention count   04674000
*                                      = Total number of requests       04675000
*                                      that encountered false           04676000
*                                      contention on a lock table       04677000
*                                      entry (LOCK structure only)   */ 04678000
*       3    IXLYAMDSTRL_CriticalRequestCount FIXED(32), /* Total       04679000
*                                      number of                        04680000
*                                      IXLLOCK CRITICALREQUEST=1        04681000
*                                      requests (LOCK structure         04682000
*                                      only)                     @LEA*/ 04683000
*       3    IXLYAMDSTRL_HiWorkQueueCount FIXED(32), /* Current count   04684000
*                                      of the number of operations      04685000
*                                      queued for subchannel            04686000
*                                      contention                    */ 04687000
*       3    IXLYAMDSTRL_WorkQueueCount FIXED(32), /* Current count     04688000
*                                      of the number of operations      04689000
*                                      queued for subchannel            04690000
*                                      contention                    */ 04691000
*       3    IXLYAMDSTRL_DelayQueueCount FIXED(32), /* Current count    04692000
*                                      of the number of operations      04693000
*                                      delayed for dump serialization   04694000
*                                      and/or a system-managed process  04695000
*                                      (e.g., rebuild)           @L5C*/ 04696000
*       3    IXLYAMDSTRL_DumpSerialReleased FIXED(32), /* Count of      04697000
*                                      the number of times dump         04698000
*                                      serialization was obtained and   04699000
*                                      released for this structure   */ 04700000
*       3    IXLYAMDSTRL_SyncTimeCount FIXED(32), /* Count of the       04701000
*                                      number of summed times -- for    04702000
*                                      successful operations. This      04703000
*                                      count represents synchronous     04704000
*                                      operations to the coupling       04705000
*                                      facility.                     */ 04706000
*       3    IXLYAMDSTRL_SyncSumTime CHAR(8), /* Summed service time    04707000
*                                      (u-sec)                       */ 04708000
*       3    IXLYAMDSTRL_SyncSumTimeSQR CHAR(8), /* Summed service      04709000
*                                      time (u-sec squared)          */ 04710000
*       3    IXLYAMDSTRL_AsyncTimeCount FIXED(32), /* Count of the      04711000
*                                      number of summed times -- for    04712000
*                                      asynchronous operations. This    04713000
*                                      count represents asynchronous    04714000
*                                      operations to the coupling       04715000
*                                      facility.                     */ 04716000
*       3    IXLYAMDSTRL_AsyncSumTime CHAR(8), /* Summed service time   04717000
*                                      (u-sec)                       */ 04718000
*       3    IXLYAMDSTRL_AsyncSumTimeSQR CHAR(8), /* Summed service     04719000
*                                      time squared (u-sec squared)  */ 04720000
*       3    IXLYAMDSTRL_QueueTimeCount FIXED(32), /* Count of the      04721000
*                                      number of summed times -- for    04722000
*                                      operation queue time          */ 04723000
*       3    IXLYAMDSTRL_QueueSumTime CHAR(8), /* Summed queue time     04724000
*                                      (u-sec)                       */ 04725000
*       3    IXLYAMDSTRL_QueueSumTimeSQR CHAR(8), /* Summed queue       04726000
*                                      time squared (u-sec squared)  */ 04727000
*       3    IXLYAMDSTRL_DelayTimeCount FIXED(32), /* Count of the      04728000
*                                      number of summed times -- for    04729000
*                                      operation delay time for dump    04730000
*                                      serialization                 */ 04731000
*       3    IXLYAMDSTRL_DelaySumTime CHAR(8), /* Summed delay time     04732000
*                                      (u-sec)                       */ 04733000
*       3    IXLYAMDSTRL_DelaySumTimeSQR CHAR(8), /* Summed delay       04734000
*                                      time squared (u-sec squared)  */ 04735000
*       3    IXLYAMDSTRL_SyncToAsyncCount FIXED(32), /* Count of the    04736000
*                                      number of times a synchronous    04737000
*                                      operation could not be           04738000
*                                      performed synchronously and      04739000
*                                      was changed to an asynchronous   04740000
*                                      operation                     */ 04741000
*       3    IXLYAMDSTRL_TotalHiWorkCount FIXED(32), /* Total count     04742000
*                                      of the number of operations      04743000
*                                      queued for subchannel            04744000
*                                      contention                @P7A*/ 04745000
*       3    IXLYAMDSTRL_TotalWorkCount FIXED(32), /* Total count       04746000
*                                      of the number of operations      04747000
*                                      queued for subchannel            04748000
*                                      contention                @P7A*/ 04749000
*       3    *        CHAR(4),      /* RESERVED                      */ 04750000
*                                                                       04751000
*/********************************************************************/ 04752000
*/* End fields whose validity is indicated by the                @L5A*/ 04753000
*/* IXLYAMDSTRL_AMValid flag                                     @L5A*/ 04754000
*/********************************************************************/ 04755000
*                                                                       04756000
*/***LIST*****Control Structure Information ***********************  */ 04757000
*                                                                       04758000
*       3    IXLYAMDSTRL_DataFlags Bit(8),                              04759000
*         5    IXLYAMDSTRL_Valid BIT(1), /* The following list          04760000
*                                      control structure information    04761000
*                                      is valid                      */ 04762000
*         5    IXLYAMDSTRL_Valid2 BIT(1), /* More list control          04763000
*                                      information valid         @M7A*/ 04764000
*         5    *        BIT(2),     /* reserved                  @M7C*/ 04765000
*         5    IXLYAMDSTRL_DTSValid BIT(1), /* Structure dump table     04766000
*                                      size information is valid     */ 04767000
*         5    *        BIT(3),     /* reserved                  @M7A*/ 04768000
*       3    *        CHAR(2),      /* not used                  @L3C*/ 04769000
*/********************************************************************/ 04770000
*/* Begin fields whose validity is indicated by the              @LDM*/ 04771000
*/* IXLYAMDSTRL_Valid flag                                       @LDM*/ 04772000
*/********************************************************************/ 04773000
*       3    IXLYAMDSTRL_Flags2 BIT(8),  /* Flags                @L3A*/ 04774000
*         5    IXLYAMDSTRL_REIPI BIT(1), /* Reapportionment in          04775000
*                                      progress indicator.  1=structure 04776000
*                                      ALTER to change ratio is in      04777000
*                                      progress (LEVEL1)         @L3A*/ 04778000
*         5    IXLYAMDSTRL_SSCI BIT(1), /* Structure size change in     04779000
*                                      progress indicator.  1=structure 04780000
*                                      ALTER to change structure size   04781000
*                                      is in progress (LEVEL1)   @L3A*/ 04782000
*         5    IXLYAMDSTRL_MREIPI BIT(1), /* Monitor Reapportionment    04783000
*                                      change in progress indicator.    04784000
*                                      1=structure ALTER to change      04785000
*                                      Event Monitor Controls           04786000
*                                      is in progress (LEVEL4)   @02A*/ 04787000
*         5    IXLYAMDSTRL_IRTCEI BIT(1), /* Immediate RTC completion   04788000
*                                      enablement indicator. 1 ==>      04789000
*                                      immediate RTC completion         04790000
*                                      controls have been set for       04791000
*                                      this structure, allowing         04792000
*                                      enablement of the expedited      04793000
*                                      duplex completion protocol.      04794000
*                                      (LEVEL16)                 @LHA*/ 04795000
*         5    IxlyamdStrL_Encrypt Bit(1),  /*  Structure data          04796000
*                                      encrypted indicator. 1=structure 04797000
*                                      data is encrypted         @M1C*/ 04798000
*         5    IxlyamdstrL_MS Bit(1),  /* Monopolization state.         04799000
*                                      1=structure is consuming a       04800000
*                                      disproportionate share of        04801000
*                                      coupling facility resources      04802000
*                                      (CFLEVEL 24)              @M6A*/ 04803000
*         5    *        BIT(2),     /* Reserved                  @M6C*/ 04804000
*         5    *        CHAR(0),    /* End IXLYAMDSTRL_Flags2    @LHA*/ 04805000
*       3    IXLYAMDSTRL_MDLES FIXED(8), /* Maximum data list entry     04806000
*                                      size (maximum number of          04807000
*                                      elements per entry)           */ 04808000
*       3    IXLYAMDSTRL_STFlags BIT(8),                                04809000
*         5    IXLYAMDSTRL_ST BIT(8), /* Structure type values   @L9C*/ 04810000
*           7    IXLYAMDSTRL_ST_SKI BIT(1), /* Secondary key indicator  04811000
*                                      0 ==> Secondary keys are not     04812000
*                                      supported.  1 ==> Secondary keys 04813000
*                                      are supported.                   04814000
*                                      (CF level >=9)            @L9A*/ 04815000
*           7    IXLYAMDSTRL_ST_PLEIDI BIT(1), /* Programmable          04816000
*                                      LEID indicator (LEVEL8)   @PEC*/ 04817000
*           7    IXLYAMDSTRL_ST_CI BIT(1), /* Count indicator. 1=       04818000
*                                      list limit accounting by         04819000
*                                      elements, 0 = list limit         04820000
*                                      accounting by entries         */ 04821000
*           7    IXLYAMDSTRL_ST_LI BIT(1), /* Lock Indicator         */ 04822000
*           7    IXLYAMDSTRL_ST_DI BIT(1), /* Data Indicator         */ 04823000
*           7    IXLYAMDSTRL_ST_AI BIT(1), /* Adjunct indicator      */ 04824000
*           7    IXLYAMDSTRL_ST_NI BIT(1), /* Name indicator         */ 04825000
*           7    IXLYAMDSTRL_ST_KI BIT(1), /* Key indicator          */ 04826000
*       3    IXLYAMDSTRL_LTECH FIXED(8), /* Lock table entry            04827000
*                                      characteristic. The width of a   04828000
*                                      lock table entry in bytes is     04829000
*                                      2**LTECH                      */ 04830000
*       3    IXLYAMDSTRL_LELX FIXED(8), /* List element                 04831000
*                                      characteristic. The size of a    04832000
*                                      list element in bytes is         04833000
*                                      256*(2**LELX)                 */ 04834000
*       3    IXLYAMDSTRL_NLE FIXED(32), /* Lock table entry count    */ 04835000
*       3    IXLYAMDSTRL_LC FIXED(32), /* List count - number of list   04836000
*                                      headers in the structure      */ 04837000
*       3    IXLYAMDSTRL_SS FIXED(32), /* Structure size in 4k blocks*/ 04838000
*       3    IXLYAMDSTRL_MSS FIXED(32), /* Maximum structure size in    04839000
*                                      4K blocks.                    */ 04840000
*       3    IXLYAMDSTRL_MINSS FIXED(32), /* Minimum structure size     04841000
*                                      in 4K blocks. The structure      04842000
*                                      may actually be allocated        04843000
*                                      smaller than this, but if so,    04844000
*                                      structure attributes such as     04845000
*                                      entry/element ratio will         04846000
*                                      differ significantly from        04847000
*                                      those which were requested.      04848000
*                                                                @P3C*/ 04849000
*       3    IXLYAMDSTRL_MLSELC FIXED(32), /* Maximum number            04850000
*                                      of list elements that can reside 04851000
*                                      in coupling facility real        04852000
*                                      storage.  This count is only     04853000
*                                      substantially accurate.   @LQC*/ 04854000
*       3    IXLYAMDSTRL_LSELC FIXED(32), /* Number of structure        04855000
*                                      list elements in the list set    04856000
*                                      which are currently in use that  04857000
*                                      reside in coupling facility      04858000
*                                      real storage.             @LQC*/ 04859000
*       3    IXLYAMDSTRL_NLTEC FIXED(32), /* Non-zero lock table        04860000
*                                      entry count. This count is only  04861000
*                                      substantially accurate.   @PAC*/ 04862000
*       3    IXLYAMDSTRL_MLSEC FIXED(32), /* LIST Structure = Maximum   04863000
*                                      number of list entries that can  04864000
*                                      reside in coupling facility      04865000
*                                      real storage for the structure.  04866000
*                                      LOCK Structure =                 04867000
*                                      Maximum number of record data    04868000
*                                      elements. This count is only     04869000
*                                      substantially accurate.   @LQC*/ 04870000
*       3    IXLYAMDSTRL_LSEC FIXED(32), /* LIST Structure = Number of  04871000
*                                      structure list entries in the    04872000
*                                      list set which are currently in  04873000
*                                      use that reside in coupling      04874000
*                                      facility real storage.           04875000
*                                      LOCK Structure = Number of       04876000
*                                      record entries in the structure  04877000
*                                      which are currently              04878000
*                                      in use.                   @LQC*/ 04879000
*       3    IXLYAMDSTRL_DTS FIXED(32), /* Structure dump table size    04880000
*                                      in 4k blocks                  */ 04881000
*       3    IXLYAMDSTRL_MRSS FIXED(32), /* Marginal structure size.    04882000
*                                      This is the true minimum size    04883000
*                                      with which the structure can     04884000
*                                      be allocated,  regardless of     04885000
*                                      ratio considerations.            04886000
*                                      (LEVEL1)                  @L3A*/ 04887000
*       3    IXLYAMDSTRL_TSS FIXED(32), /* Target structure size.       04888000
*                                      For a CFLEVEL 0 facility, the    04889000
*                                      target structure size will       04890000
*                                      be equal to the actual structure 04891000
*                                      size.  For a CFLEVEL 1 or higher 04892000
*                                      facility, the target structure   04893000
*                                      size will be equal to the target 04894000
*                                      structure size specified on the  04895000
*                                      initial allocate or subsequent   04896000
*                                      expand or contract request.      04897000
*                                      The target size may or may not   04898000
*                                      be equal to the actual size.     04899000
*                                      (LEVEL1)                  @D2C*/ 04900000
*       3    IXLYAMDSTRL_TMELC FIXED(32), /* Target maximum element     04901000
*                                      count.  For a CFLEVEL 0 facility 04902000
*                                      the target maximum element count 04903000
*                                      will be equal to the actual      04904000
*                                      maximum element count.  For      04905000
*                                      CFLEVEL 1 or higher facilities,  04906000
*                                      the target maximum element count 04907000
*                                      will reflect the target ratio    04908000
*                                      specified on the initial         04909000
*                                      allocate or subsequent           04910000
*                                      reapportionment request.  This   04911000
*                                      may or may not equal the actual  04912000
*                                      maximum element count.           04913000
*                                      (LEVEL1)                  @D2C*/ 04914000
*       3    IXLYAMDSTRL_TMEC FIXED(32), /* Target maximum entry        04915000
*                                      count.  For a CFLEVEL 0 facility 04916000
*                                      the target maximum entry count   04917000
*                                      will be equal to the actual      04918000
*                                      maximum entry count.  For        04919000
*                                      CFLEVEL 1 or higher facilities,  04920000
*                                      the target maximum entry count   04921000
*                                      will reflect the target ratio    04922000
*                                      specified on the initial         04923000
*                                      allocate or subsequent           04924000
*                                      reapportionment request.  This   04925000
*                                      may or may not equal the actual  04926000
*                                      maximum entry count.             04927000
*                                      (LEVEL1)                  @D2C*/ 04928000
*       3    IXLYAMDSTRL_PETELR FIXED(32), /* Pending entry to element  04929000
*                                      ratio.  This field is only       04930000
*                                      applicable to CFLEVEL 1 or       04931000
*                                      higher facilities.               04932000
*                                      (LEVEL1)                  @D2C*/ 04933000
*         5    IXLYAMDSTRL_PETELR_Entry FIXED(16), /* Entry ratio       04934000
*                                      portion (LEVEL1)          @L3A*/ 04935000
*         5    IXLYAMDSTRL_PETELR_Element FIXED(16), /* Element ratio   04936000
*                                      portion (LEVEL1)          @L3A*/ 04937000
*       3    Ixlyamdstrl_EmcCnt Fixed(32), /* Count of Event Monitor    04938000
*                                      Control (EMC) objects in use by  04939000
*                                      the structure.                   04940000
*                                      Applicable only if structure     04941000
*                                      allocated in CFLEVEL 3 or        04942000
*                                      higher facility.          @01A*/ 04943000
*       3    Ixlyamdstrl_MaxEmcCnt Fixed(32),  /* Maximum number of     04944000
*                                      EMCs for the structure.          04945000
*                                      Applicable only if structure     04946000
*                                      allocated in CFLEVEL 3 or        04947000
*                                      higher facility.          @01A*/ 04948000
*       3    Ixlyamdstrl_TMaxEmcCnt Fixed(32), /* Target Maximum        04949000
*                                      number of EMCs for the           04950000
*                                      structure.  Applicable only if   04951000
*                                      structure allocated in CFLEVEL 3 04952000
*                                      or higher facility.       @01A*/ 04953000
*/********************************************************************/ 04954000
*/* End fields whose validity is indicated by the                @L5A*/ 04955000
*/* IXLYAMDSTRL_Valid flag                                       @L5A*/ 04956000
*/********************************************************************/ 04957000
*       3    *        CHAR(0);                                          04958000
*                                                                       04959000
*   DECLARE                                                             04960000
*     1    IXLYAMDSTRL1 BASED IXLYAMDA_VIA, /* Structure Entry for a    04961000
*                                      List Structure (STRL),           04962000
*                                      AmdaLevel>=1              @02A*/ 04963000
*       3    * CHAR(LENGTH(IXLYAMDSTRL)), /* Mapped by IXLYAMDSTRL      04964000
*                                                                @02A*/ 04965000
*/********************************************************************/ 04966000
*/* Begin fields whose validity is indicated by the              @L5A*/ 04967000
*/* IXLYAMDSTRL_Valid flag                                       @L5A*/ 04968000
*/********************************************************************/ 04969000
*       3    Ixlyamdstrl_TEmcStgPct Fixed(16), /* Pending percent of    04970000
*                                      structure storage to be used as  04971000
*                                      EMCs, expressed in hundredths    04972000
*                                      of a percent (ie. range is       04973000
*                                      0 to 10000)               @02A*/ 04974000
*       3    Ixlyamdstrl1_Flags BIT(8),  /* Flags                @0AA*/ 04975000
*         5    Ixlyamdstrl1_WRTCLI BIT(1), /* Wait on ready to complete 04976000
*                                      list indicator - Indicates that  04977000
*                                      the sending of the RTC signal is 04978000
*                                      delayed until the RTC is         04979000
*                                      received. During this time no    04980000
*                                      resources can be held for the    04981000
*                                      list item being processed.       04982000
*                                      (LEVEL11)                 @0AA*/ 04983000
*         5    IxlyamdStrL1_PCQC BIT(1), /* Asynchronous duplexing      04984000
*                                      operation queue control, bit 0.  04985000
*                                      Indicates whether an operation   04986000
*                                      queue has been created for the   04987000
*                                      structure for asynchronous       04988000
*                                      duplexing. 0 = No asynchronous   04989000
*                                      duplexing operation queue        04990000
*                                      exists. 1 = An asynchronous      04991000
*                                      duplexing operation queue has    04992000
*                                      been created for the structure.  04993000
*                                      (LEVEL21)                 @LWA*/ 04994000
*         5    IxlyamdStrL1_DPLXST Bit(1),  /* Duplexing state.         04995000
*                                      ON => structure is in the        04996000
*                                      duplexing active state.          04997000
*                                      (LEVEL10)                 @LXA*/ 04998000
*         5    IxlyamdSTRL1_MI BIT(1), /* Designated master structure - 04999000
*                                      Indicates that RTC signal will   05000000
*                                      always be sent first. (LEVEL24)  05001000
*                                                                @M4A*/ 05002000
*         5    * Bit(2),            /* Reserved                  @M4C*/ 05003000
*                                                                       05004000
*         5    IxlyamdStrL1_DPLXT Bit(2),  /* Duplexing type.  Valid    05005000
*                                      when IxlyamdStrL1_DPLXST is      05006000
*                                      on.  See constants               05007000
*                                      IXLYAMDA_DPLXT_Xxx.              05008000
*                                      (LEVEL21)                 @LXA*/ 05009000
*       3   IxlyamdStrL1_PCQCH FIXED(8), /* Asynchronous duplexing      05010000
*                                      operation queue characteristic.  05011000
*                                      The number of queue entries is   05012000
*                                      the product of 4096 and 2        05013000
*                                      raised to the power of PCQCH.    05014000
*                                      (LEVEL21)                 @LWA*/ 05015000
*       3    Ixlyamdstrl1_LSCUR Fixed(32), /* List set cursor           05016000
*                                      (LEVEL8)                  @PEC*/ 05017000
*       3    Ixlyamdstrl1_SCCVN Fixed(32), /* Structure copy            05018000
*                                      controls version number          05019000
*                                      (LEVEL8)                  @PEC*/ 05020000
*       3    Ixlyamdstrl1_SXTIME char(8), /* Structure related CPU      05021000
*                                      execution time (LEVEL15)  @LGC*/ 05022000
*       3    IxlyamdStrl1_SLND Fixed(32), /* Subsidiary list            05023000
*                                      notification delay.  Bit         05024000
*                                      positions 0-31 correspond to     05025000
*                                      bit positions 32-63 of the CPU   05026000
*                                      timer.  Bit 19 represents one    05027000
*                                      microsecond. (CFLEVEL>=16)@LIA*/ 05028000
*       3    IxlyamdStrl1_MUID Fixed(8), /* Maximum user id limit       05029000
*                                      for the structure         @LKA*/ 05030000
*       3    * CHAR(3),             /* Reserved                  @LQA*/ 05031000
*/********************************************************************/ 05032000
*/* End fields whose validity is indicated by the                @L5A*/ 05033000
*/* IXLYAMDSTRL_Valid flag                                       @L5A*/ 05034000
*/********************************************************************/ 05035000
*       3    IxlyamdStrL1_SscmAddr PTR(31), /* Address of the           05036000
*                                      structure storage-class memory   05037000
*                                      record (SSCM) for this           05038000
*                                      structure. A non-zero value      05039000
*                                      will be returned when            05040000
*                                      HWSTATISTICS=(YES) or the        05041000
*                                      STRNAME keyword is specified,    05042000
*                                      AMDALEVEL=(1 or higher) is       05043000
*                                      specified, and the coupling      05044000
*                                      facility in which the            05045000
*                                      structure resides can use        05046000
*                                      storage-class memory             05047000
*                                      extensions (CFLEVEL 19 or        05048000
*                                      higher). A value of zero means   05049000
*                                      that the SSCM record was not     05050000
*                                      provided for this structure      05051000
*                                      because it was not requested,    05052000
*                                      not available, or the coupling   05053000
*                                      facility in which the            05054000
*                                      structure resides does not       05055000
*                                      support storage-class memory     05056000
*                                      extensions                @LQA*/ 05057000
*         5 IxlyamdStrL1_Sscm_Off Fixed(32), /* Offset of the           05058000
*                                      structure storage-class memory   05059000
*                                      record (SSCM) for this           05060000
*                                      structure. A non-zero value      05061000
*                                      will be returned when            05062000
*                                      HWSTATISTICS=(YES) or the        05063000
*                                      STRNAME keyword is specified,    05064000
*                                      AMDALEVEL=(1 or higher) is       05065000
*                                      specified, and the coupling      05066000
*                                      facility in which the            05067000
*                                      structure resides can use        05068000
*                                      storage-class memory             05069000
*                                      extensions (CFLEVEL 19 or        05070000
*                                      higher). A value of zero means   05071000
*                                      that the SSCM record was not     05072000
*                                      provided for this structure      05073000
*                                      because it was not requested,    05074000
*                                      not available, or the coupling   05075000
*                                      facility in which the            05076000
*                                      structure resides does not       05077000
*                                      support storage-class memory     05078000
*                                      extensions.               @M9A*/ 05079000
*/********************************************************************/ 05080000
*/* Begin fields whose validity is indicated by the              @M7A*/ 05081000
*/* IXLYAMDSTRL_Valid flag                                       @M7A*/ 05082000
*/********************************************************************/ 05083000
*       3    IxlyamdStrl1_LND Fixed(32), /* List Notification Delay     05084000
*                                        value for the structure. Bit   05085000
*                                        positions 0-31 correspond to   05086000
*                                        bit positions 32-63 of the CPU 05087000
*                                        timer.  Bit 19 represents one  05088000
*                                        microsecond.                   05089000
*                                        (CFLEVEL>=22)           @LYA*/ 05090000
*       3    IxlyamdStrl1_KRND Fixed(32), /* Key-Range Notification     05091000
*                                        Delay value for the structure. 05092000
*                                        Bit positions 0-31 correspond  05093000
*                                        to bit positions 32-63 of the  05094000
*                                        CPU timer.  Bit 19 represents  05095000
*                                        one microsecond.               05096000
*                                        (CFLEVEL>=22)           @LYA*/ 05097000
*/********************************************************************/ 05098000
*/* End fields whose validity is indicated by the                @LYM*/ 05099000
*/* IXLYAMDSTRL_Valid flag                                       @LYM*/ 05100000
*/********************************************************************/ 05101000
*                                                                       05102000
*/********************************************************************/ 05103000
*/* Begin fields whose validity is indicated by the              @LDA*/ 05104000
*/* IXLYAMDSTRL_AMValid flag                                     @LDA*/ 05105000
*/********************************************************************/ 05106000
*                                                                       05107000
*       3    IxlyamdStrL1_OpCtScmAccess FIXED(32), /* Count of          05108000
*                                      successful requests to the       05109000
*                                      coupling facility that           05110000
*                                      encountered an SCM               05111000
*                                      (Storage-Class Memory) Access    05112000
*                                      Required condition. (LEVEL19)    05113000
*                                                                @0EA*/ 05114000
*       3    IxlyamdStrL1_ScmAccessCount FIXED(32), /* Count of SCM     05115000
*                                      (Storage-Class Memory) Access    05116000
*                                      Required conditions that         05117000
*                                      require the request to be        05118000
*                                      restarted. (LEVEL19)      @LTA*/ 05119000
*       3    Ixlyamdstrl1_PeerLinkUnavailableCount Fixed(32), /* Count  05120000
*                                      of Peer Link                     05121000
*                                      Not Available conditions         05122000
*                                      (LEVEL10)                 @LDC*/ 05123000
*       3    Ixlyamdstrl1_ExecutionSuppressedCount Fixed(32),           05124000
*                                   /* Count of Execution               05125000
*                                      Suppressed conditions            05126000
*                                      (LEVEL10)                 @LDC*/ 05127000
*       3    Ixlyamdstrl1_PeerWaitSchTimeCount FIXED(32), /* Count of   05128000
*                                      the number of times a duplexed   05129000
*                                      request was holding a subchannel 05130000
*                                      while waiting for a peer request 05131000
*                                      to be started.                   05132000
*                                      (LEVEL10)                 @PKC*/ 05133000
*       3    Ixlyamdstrl1_PeerWaitSchSumTime CHAR(8), /* Summed peer    05134000
*                                      subchannel wait time (u-sec)     05135000
*                                      (LEVEL10)                 @LCC*/ 05136000
*       3    Ixlyamdstrl1_PeerWaitSchSumTimeSQR CHAR(8), /* Summed peer 05137000
*                                      subchannel wait time squared     05138000
*                                      (u-sec squared) (LEVEL10) @LCC*/ 05139000
*       3    Ixlyamdstrl1_PeerWaitRsvTimeCount FIXED(32), /* Count of   05140000
*                                      the number of times a request    05141000
*                                      is holding a subchannel in       05142000
*                                      reserve while waiting for a      05143000
*                                      peer subchannel to become        05144000
*                                      available to start a duplexed    05145000
*                                      request. (LEVEL10)        @PKC*/ 05146000
*       3    Ixlyamdstrl1_PeerWaitRsvSumTime CHAR(8), /* Summed peer    05147000
*                                      subchannel wait with reserve     05148000
*                                      time (u-sec) (LEVEL10)    @LDC*/ 05149000
*       3    Ixlyamdstrl1_PeerWaitRsvSumTimeSQR CHAR(8), /* Summed peer 05150000
*                                      subchannel wait with reserve     05151000
*                                      time squared (u-sec squared)     05152000
*                                      (LEVEL10)                 @LDC*/ 05153000
*                                                                       05154000
*       3    Ixlyamdstrl1_PeerWaitCompTimeCount FIXED(32), /* Count of  05155000
*                                      the number of "waiting for peer  05156000
*                                      completion" times reported.      05157000
*                                      One of the two duplexed          05158000
*                                      operations has completed, but    05159000
*                                      the completed subchannel remains 05160000
*                                      unavailable for use until the    05161000
*                                      peer operation completes.        05162000
*                                      (LEVEL10)     @LCA*/             05163000
*       3    Ixlyamdstrl1_PeerWaitCompSumTime CHAR(8), /* Summed        05164000
*                                      waiting for peer completion      05165000
*                                      times.  (u-sec) (LEVEL10) @LDC*/ 05166000
*       3    Ixlyamdstrl1_PeerWaitCompSumTimeSQR CHAR(8), /* Square of  05167000
*                                      the sum of the waiting for peer  05168000
*                                      completion time.                 05169000
*                                      (u-sec squared) (LEVEL10) @LCA*/ 05170000
*       3    Ixlyamdstrl1_LogicalVersion BIT(64),  /* Logical           05171000
*                                      structure version number.        05172000
*                                      Used in conjunction with         05173000
*                                      the physical version             05174000
*                                      number to identify an            05175000
*                                      instance of a structure.         05176000
*                                      The value of this field          05177000
*                                      is set equal to the              05178000
*                                      physical version number          05179000
*                                      when the structure is            05180000
*                                      initially allocated.  It         05181000
*                                      changes when a process           05182000
*                                      that allocates a new             05183000
*                                      instance of the structure        05184000
*                                      (e.g., rebuild) is               05185000
*                                      user-managed, but not            05186000
*                                      when it is                       05187000
*                                      system-managed.           @L5A*/ 05188000
*/********************************************************************/ 05189000
*/* End fields whose validity is indicated by the                @LDA*/ 05190000
*/* IXLYAMDSTRL_AMValid flag                                     @LDA*/ 05191000
*/********************************************************************/ 05192000
*       3    Ixlyamdstrl1_SSCCAddr PTR(31), /* Address of the           05193000
*                                      structure copy controls          05194000
*                                      information entry for this       05195000
*                                      structure.  A value of zero      05196000
*                                      means that the SSCC record       05197000
*                                      was not provided for this        05198000
*                                      structure because it was         05199000
*                                      not requested, not available,    05200000
*                                      or contained no information.     05201000
*                                                                @L5A*/ 05202000
*         5 Ixlyamdstrl1_SSCC_Off Fixed(32); /* Offset of the           05203000
*                                      structure copy controls          05204000
*                                      information entry for this       05205000
*                                      structure.  A value of zero      05206000
*                                      means that the SSCC record       05207000
*                                      was not provided for this        05208000
*                                      structure because it was         05209000
*                                      not requested, not available,    05210000
*                                      or contained no information.     05211000
*                                                                @M9A*/ 05212000
*   DECLARE                                                             05213000
*     1    IXLYAMDSTRL2 BASED IXLYAMDA_VIA, /* Structure Entry for a    05214000
*                                      List Structure (STRL),           05215000
*                                      AmdaLevel>=2              @LXA*/ 05216000
*       3    *        CHAR(LENGTH(IXLYAMDSTRL1)), /* Mapped by          05217000
*                                      IXLYAMDSTRL1              @LXA*/ 05218000
*       3    IxlyamdStrL2_ADupAddr PTR(31), /* Address of the           05219000
*                                      structure asynchronous           05220000
*                                      duplexing record (ADUP) for      05221000
*                                      this structure. A non-zero       05222000
*                                      value may be returned when       05223000
*                                      HWSTATISTICS=(YES) or the        05224000
*                                      STRNAME keyword is specified,    05225000
*                                      AMDALEVEL=(2 or higher) is       05226000
*                                      specified, and the coupling      05227000
*                                      facility in which the            05228000
*                                      structure resides supports       05229000
*                                      asynchronous duplexing           05230000
*                                      (CFLEVEL 21 or higher). A        05231000
*                                      value of zero means that the     05232000
*                                      ADUP record was not provided     05233000
*                                      for this structure because it    05234000
*                                      was not requested, not           05235000
*                                      available, or the structure      05236000
*                                      does not support asynchronous    05237000
*                                      duplexing.                @LXA*/ 05238000
*         5 IxlyamdStrL2_ADup_Off Fixed(32), /* Offset of the           05239000
*                                      structure asynchronous           05240000
*                                      duplexing record (ADUP) for      05241000
*                                      this structure. A non-zero       05242000
*                                      value may be returned when       05243000
*                                      HWSTATISTICS=(YES) or the        05244000
*                                      STRNAME keyword is specified,    05245000
*                                      AMDALEVEL=(2 or higher) is       05246000
*                                      specified, and the coupling      05247000
*                                      facility in which the            05248000
*                                      structure resides supports       05249000
*                                      asynchronous duplexing           05250000
*                                      (CFLEVEL 21 or higher). A        05251000
*                                      value of zero means that the     05252000
*                                      ADUP record was not provided     05253000
*                                      for this structure because it    05254000
*                                      was not requested, not           05255000
*                                      available, or the structure      05256000
*                                      does not support asynchronous    05257000
*                                      duplexing.                @M9A*/ 05258000
*/********************************************************************/ 05259000
*/* Begin fields whose validity is indicated by the              @LXA*/ 05260000
*/* IXLYAMDSTRL_AMValid flag                                     @LXA*/ 05261000
*/********************************************************************/ 05262000
*       3    IxlyamdStrL2_ADupDelayOpCount Fixed(32),  /* Count         05263000
*                                      of asynchronously-duplexed CF    05264000
*                                      operations that were delayed     05265000
*                                      because the primary CF           05266000
*                                      was unable to accept new         05267000
*                                      requests, either because it      05268000
*                                      could not push requests to       05269000
*                                      the secondary CF or because      05270000
*                                      the secondary CF could not       05271000
*                                      process incoming requests.       05272000
*                                      Applicable only if               05273000
*                                      IxlyamdStrL2_AsynchDupPri is ON. 05274000
*                                                                @LXA*/ 05275000
*       3    IxlyamdStrL2_ADupDelayReqCount Fixed(32),  /* Count        05276000
*                                      of asynchronously-duplexed       05277000
*                                      requests that ever experienced   05278000
*                                      a delayed operation because      05279000
*                                      the primary CF was unable to     05280000
*                                      accept new requests.             05281000
*                                      Applicable only if               05282000
*                                      IxlyamdStrL2_AsynchDupPri is ON. 05283000
*                                                                @LXA*/ 05284000
*       3    IxlyamdStrL2_IxladupxCount Fixed(32),  /* Total number     05285000
*                                      of IXLADUPX requests.            05286000
*                                      Applicable only if               05287000
*                                      IxlyamdStrL2_AsynchDupSec is ON. 05288000
*                                                                @LXA*/ 05289000
*       3    IxlyamdStrL2_IxladupxSuspendCount Fixed(32), /* Total      05290000
*                                      number of IXLADUPX requests      05291000
*                                      that were suspended waiting      05292000
*                                      for the operations to            05293000
*                                      complete in the secondary        05294000
*                                      structure of the current         05295000
*                                      duplexing instance.              05296000
*                                      Applicable only if               05297000
*                                      IxlyamdStrL2_AsynchDupSec is ON. 05298000
*                                                                @LXA*/ 05299000
*       3    IxlyamdStrL2_IxladupxSuspendTime Char(8), /* Summed        05300000
*                                      suspend time for IXLADUPX        05301000
*                                      invocations that were waiting    05302000
*                                      for operations to complete in    05303000
*                                      the secondary structure of       05304000
*                                      the current duplexing            05305000
*                                      instance (in u-sec).             05306000
*                                      Applicable only if               05307000
*                                      IxlyamdStrL2_AsynchDupSec is ON. 05308000
*                                                                @LXA*/ 05309000
*       3    IxlyamdStrL2_IxladupxSuspendTimeSqr Char(8), /* Square     05310000
*                                      of the summed suspend time       05311000
*                                      for IXLADUPX invocations that    05312000
*                                      were waiting for operations      05313000
*                                      to complete in the secondary     05314000
*                                      structure of the current         05315000
*                                      duplexing instance (in u-sec     05316000
*                                      squared).  Applicable only if    05317000
*                                      IxlyamdStrL2_AsynchDupSec is ON. 05318000
*                                                                @LXA*/ 05319000
*       3 IxlyamdStrL2_Flags Bit(8),                                    05320000
*         5 IxlyamdStrL2_AsynchDupPri Bit(1),  /* ON => this            05321000
*                                      record represents the primary    05322000
*                                      instance of an asynchronously-   05323000
*                                      duplexed structure        @LXA*/ 05324000
*         5 IxlyamdStrL2_AsynchDupSec Bit(1),  /* ON => this            05325000
*                                      record represents the secondary  05326000
*                                      instance of an asynchronously-   05327000
*                                      duplexed structure        @LXA*/ 05328000
*         5 * Bit(6),               /* Reserved                  @LXA*/ 05329000
*                                                                       05330000
*/********************************************************************/ 05331000
*/* End fields whose validity is indicated by the                @LXA*/ 05332000
*/* IXLYAMDSTRL_AMValid flag                                     @LXA*/ 05333000
*/********************************************************************/ 05334000
*/********************************************************************/ 05335000
*/* Begin fields whose validity is indicated by the              @M7A*/ 05336000
*/* IXLYAMDSTRL_Valid2 flag                                      @M7A*/ 05337000
*/********************************************************************/ 05338000
*       3 IxlyAmdStrl2_PctEntryRsv Fixed(8),  /* Composite percent      05339000
*                                      entry reserve for the            05340000
*                                      structure (LEVEL25). A value     05341000
*                                      of zero means that no            05342000
*                                      percent entry reserve is         05343000
*                                      established for the structure    05344000
*                                      or the CF where the              05345000
*                                      structure is allocated does not  05346000
*                                      support percent entry reserve    05347000
*                                      threshold. NOT applicable when   05348000
*                                      IxlyamdStrL2_AsynchDupSec        05349000
*                                      is ON.                    @M7A*/ 05350000
*/********************************************************************/ 05351000
*/* End fields whose validity is indicated by the                @M7A*/ 05352000
*/* IXLYAMDSTRL_Valid2 flag                                      @M7A*/ 05353000
*/********************************************************************/ 05354000
*       3    *        CHAR(26),     /* Reserved                  @M7C*/ 05355000
*       3    *        CHAR(0);      /*                           @LXA*/ 05356000
*                                                                       05357000
*/********************************************************************/ 05358000
*/*            Write and Read Request Measurement Data                  05359000
*                                                                       05360000
*   The metrics in IXLAMDSTRL3 represent the number of structure        05361000
*   entry write and read requests issued to a structure and the         05362000
*   amount of data associated with the number of structure entry        05363000
*   data elements and entry adjunct data written and read to and        05364000
*   from a structure.                                                   05365000
*                                                                       05366000
*   For structures that contain encrypted data, the read entry data     05367000
*   amounts (i.e., IxlyamdStrl3_ReadEntryData and                       05368000
*   IxlyamdStrl3_ReadEntryDataSQR) are a summation of what is           05369000
*   returned in the list entry controls (LCTL) for each list entry      05370000
*   read by a single entry read request or by a multiple entry read     05371000
*   request.                                                            05372000
*                                                                       05373000
*   For structures that contain non-encrypted data, the read entry      05374000
*   data amounts for single entry read requests are computed            05375000
*   as they are for structures that contain encrypted data.  The        05376000
*   read entry data amounts for multiple entry read requests (e.g.,     05377000
*   Read_List or Read_Mult) are based on an average number of           05378000
*   data elements returned per entry by the request.             @M3A*/ 05379000
*/********************************************************************/ 05380000
*   DECLARE                                                             05381000
*     1    IXLYAMDSTRL3 BASED IXLYAMDA_VIA Bdy(DWord),  /*              05382000
*                                      Structure Entry for a            05383000
*                                      List Structure (STRL),           05384000
*                                      AmdaLevel>=3              @M1A*/ 05385000
*       3    *        CHAR(LENGTH(IXLYAMDSTRL2)), /* Mapped by          05386000
*                                      IXLYAMDSTRL2              @M1A*/ 05387000
*/********************************************************************/ 05388000
*/* Begin fields whose validity is indicated by the              @M1A*/ 05389000
*/* IXLYAMDSTRL_AMValid flag                                     @M1A*/ 05390000
*/********************************************************************/ 05391000
*       3  IxlyamdStrl3_WriteDataRequests Fixed(32), /* Count of write  05392000
*                                     requests that request data        05393000
*                                     elements be written for a         05394000
*                                     structure entry            @M1A*/ 05395000
*       3  IxlyamdStrl3_WriteAdjunctCount Fixed(32), /* Count of        05396000
*                                     adjunct areas transferred to the  05397000
*                                     CF for write requests      @M1A*/ 05398000
*       3  IxlyamdStrl3_ReadDataRequests Fixed(32), /* count of read    05399000
*                                     requests that request entry       05400000
*                                     data be returned           @M1A*/ 05401000
*       3  IxlyamdStrl3_ReadAdjunctCount Fixed(32), /* Count of adjunct 05402000
*                                     areas transferred by the CF and   05403000
*                                     returned on read requests  @M1A*/ 05404000
*       3  IxlyamdStrl3_WriteEntryCount Fixed(32), /* Count of          05405000
*                                     the number of data entries        05406000
*                                     written with data elements.       05407000
*                                     Accounts for single and multi     05408000
*                                     entry write requests       @M1A*/ 05409000
*       3  IxlyamdStrl3_ReadEntryCount Fixed(32), /* Count of           05410000
*                                     the number of data entries read   05411000
*                                     that contain data elements        05412000
*                                     returned on read requests.        05413000
*                                     Accounts for single and multi     05414000
*                                     entry read requests        @M1A*/ 05415000
*       3  IxlyamdStrl3_WriteEntryData Fixed(64), /* Summed number of   05416000
*                                     bytes of entry data in 256-byte   05417000
*                                     increments written to the         05418000
*                                     structure for the number of entry 05419000
*                                     data elements written      @M3C*/ 05420000
*       3  IxlyamdStrl3_WriteEntryDataSQR Fixed(64), /* Square of the   05421000
*                                     summed number of bytes of entry   05422000
*                                     data in 256-byte increments       05423000
*                                     written to the structure for      05424000
*                                     the number of entry               05425000
*                                     data elements written      @M3C*/ 05426000
*       3  IxlyamdStrl3_ReadEntryData Fixed(64), /* Summed number of    05427000
*                                     bytes of entry data in 256-byte   05428000
*                                     increments read and transferred   05429000
*                                     by the CF.                 @M1A*/ 05430000
*       3  IxlyamdStrl3_ReadEntryDataSQR Fixed(64), /* Square of the    05431000
*                                     summed number of bytes of entry   05432000
*                                     data in 256-byte increments read  05433000
*                                     and transferred by the CF  @M1A*/ 05434000
*/********************************************************************/ 05435000
*/* End fields whose validity is indicated by the                @M1A*/ 05436000
*/* IXLYAMDSTRL_AMValid flag                                     @M1A*/ 05437000
*/********************************************************************/ 05438000
*       3    *        CHAR(32),     /* Reserved                  @M1A*/ 05439000
*       3    *        CHAR(0);      /*                           @M1A*/ 05440000
*                                                                       05441000
*   DECLARE                                                             05442000
*     1    IXLYAMDSTRL4 BASED IXLYAMDA_VIA Bdy(DWord),  /*              05443000
*                                      Structure Entry for a            05444000
*                                      List Structure (STRL),           05445000
*                                      AmdaLevel>=4              @M5A*/ 05446000
*       3    *        CHAR(LENGTH(IXLYAMDSTRL3)), /* Mapped by          05447000
*                                      IXLYAMDSTRL3              @M5A*/ 05448000
*/********************************************************************/ 05449000
*/* Begin fields whose validity is indicated by the              @M5A*/ 05450000
*/* IXLYAMDSTRL_AMValid flag                                     @M5A*/ 05451000
*/********************************************************************/ 05452000
*       3  IxlyamdStrl4_CfMonopTimeCount Fixed(32), /* Count of         05453000
*                                     summed queue time - for           05454000
*                                     operations queued due to          05455000
*                                     coupling facility resource        05456000
*                                     monopolization             @M5A*/ 05457000
*       3  IxlyamdStrl4_CfMonopSumTime Char(8), /* Summed queue time -  05458000
*                                     for operations queued due to      05459000
*                                     coupling facility resource        05460000
*                                     monopolization (u-sec)     @M5A*/ 05461000
*       3  IxlyamdStrl4_CfMonopSumTimeSQR Char(8), /* Summed queue      05462000
*                                     time squared - for operations     05463000
*                                     queued due to coupling facility   05464000
*                                     resource monopolization (u-sec    05465000
*                                     squared)                   @M5A*/ 05466000
*       3  IxlyamdStrl4_TotalWorkCountMonop Fixed(32), /*  Total        05467000
*                                   count of operations queued for CF   05468000
*                                   monopolization avoidance.    @M5A*/ 05469000
*       3  IxlyamdStrl4_TotalHiWorkCountMonop Fixed(32), /*  Total      05470000
*                                   count of high priority              05471000
*                                   operations queued for CF            05472000
*                                   monopolization avoidance.    @M5A*/ 05473000
*       3  IxlyamdStrl4_WorkQueueCountMonop FIXED(32), /* Current       05474000
*                                   count of operations queued for      05475000
*                                   CF monopolization avoidance  @M5A*/ 05476000
*       3  IxlyamdStrl4_HiWorkQueueCountMonop FIXED(32), /* Current     05477000
*                                   count of high priority operations   05478000
*                                   queued for CF monopolization        05479000
*                                   avoidance.                   @M5A*/ 05480000
*                                                                       05481000
*/********************************************************************/ 05482000
*/* End fields whose validity is indicated by the                @M5A*/ 05483000
*/* IXLYAMDSTRL_AMValid flag                                     @M5A*/ 05484000
*/********************************************************************/ 05485000
*       3    *        CHAR(188),    /* Reserved                  @M5A*/ 05486000
*       3    *        CHAR(0);      /*                           @M5A*/ 05487000
*                                                                       05488000
*/********************************************************************/ 05489000
*/**************** Structure Entry for Cache**************************/ 05490000
*/********************************************************************/ 05491000
*                                                                       05492000
*/***CACHE*********Header*********************************************/ 05493000
*                                                                       05494000
*   DECLARE                                                             05495000
*     1    IXLYAMDSTRC BASED IXLYAMDA_VIA, /* Structure Entry for a     05496000
*                                      Cache Structure (STRC)        */ 05497000
*       3    IXLYAMDSTRC_Type BIT(8), /* X'22' -- indicates STR data    05498000
*                                      for CF                        */ 05499000
*       3    *        CHAR(3),      /* Unused                        */ 05500000
*       3    IXLYAMDSTRC_Length FIXED(32), /* Length of IXLYAMDSTR      05501000
*                                      entry mapping                 */ 05502000
*       3    IXLYAMDSTRC_STRNext PTR(31), /* Address of next STR        05503000
*                                      entry. A value of 0 means last   05504000
*                                      entry for this facility.      */ 05505000
*         5 IXLYAMDSTRC_STRNext_Off Fixed(32), /* Offset of next STR    05506000
*                                      entry. A value of 0 means last   05507000
*                                      entry for this facility.  @M9A*/ 05508000
*       3    IXLYAMDSTRC_SCSC@ PTR(31), /* Address of the SCSC entry.   05509000
*                                      A value of 0 means there is no   05510000
*                                      entry for storage class data. */ 05511000
*         5 IXLYAMDSTRC_SCSC_Off Fixed(32), /* Offset of the SCSC       05512000
*                                      entry.  A value of 0 means       05513000
*                                      there is no entry for            05514000
*                                      storage class data.       @M9A*/ 05515000
*       3    IXLYAMDSTRC_SCOC@ PTR(31), /* Address of the SCOC entry.   05516000
*                                      A value of 0 means there is no   05517000
*                                      entry for castout class data  */ 05518000
*         5 IXLYAMDSTRC_SCOC_Off Fixed(32), /* Offset of the SCOC       05519000
*                                      entry.  A value of 0 means       05520000
*                                      there is no entry for            05521000
*                                      castout class data        @M9A*/ 05522000
*                                                                       05523000
*/***CACHE*******Configuration Data ******************************** */ 05524000
*                                                                       05525000
*       3    IXLYAMDSTRC_TTY FIXED(8), /* Structure type identifier  */ 05526000
*       3    IXLYAMDSTRC_TTY_Status CHAR(1),                            05527000
*         5    *            BIT(1),    /* not used               @PBA*/ 05528000
*         5    IXLYAMDSTRC_RBLDValid BIT(1), /* The structure rebuild   05529000
*                                      status indications reported in   05530000
*                                      the IXLYAMDSTRC_RBLDStatus are   05531000
*                                      valid -- These values will only  05532000
*                                      be valid and reported when       05533000
*                                      information is requested for a   05534000
*                                      particular structure      @PBA*/ 05535000
*       3    IXLYAMDSTRC_SID FIXED(16), /* Structure ID              */ 05536000
*       3    IXLYAMDSTRC_Version BIT(64), /* Structure version number.  05537000
*                                      Changes when a new physical      05538000
*                                      instance of the structure is     05539000
*                                      allocated (e.g., user- or        05540000
*                                      system-managed rebuild), and     05541000
*                                      there is at least one active     05542000
*                                      connector to observe the         05543000
*                                      allocation.               @PFC*/ 05544000
*         5    IXLYAMDSTRC_PhysicalVersion BIT(64), /* Structure        05545000
*                                      version number.                  05546000
*                                      Changes when a new physical      05547000
*                                      instance of the structure is     05548000
*                                      allocated (e.g., user- or        05549000
*                                      system-managed rebuild), and     05550000
*                                      there is at least one active     05551000
*                                      connector to observe the         05552000
*                                      allocation. See also             05553000
*                                      IXLYAMDSSCC_CopyVersion.  @L7A*/ 05554000
*       3    IXLYAMDSTRC_STRName CHAR(16), /* STR name               */ 05555000
*       3    IXLYAMDSTRC_RBLDStatus BIT(8), /* Rebuild status flags     05556000
*                                      This information will only be    05557000
*                                      valid if IXLYAMDSTRC_RBLDValid   05558000
*                                      is set.                   @PBA*/ 05559000
*         5    IXLYAMDSTRC_StrInRebld BIT(1), /* ON indicates that      05560000
*                                      the structure is in rebuild      05561000
*                                                                @PBA*/ 05562000
*         5    IXLYAMDSTRC_RebldOldStr BIT(1), /* ON indicates that     05563000
*                                      the structure information        05564000
*                                      pertains to the OLD structure    05565000
*                                                                @PBA*/ 05566000
*         5    IXLYAMDSTRC_RebldNewStr BIT(1), /* ON indicates that     05567000
*                                      the structure information        05568000
*                                      pertains to the NEW structure    05569000
*                                                                @PBA*/ 05570000
*         5    IXLYAMDSTRC_RebldDuplexStr BIT(1), /* ON indicates the   05571000
*                                      structure rebuild is a duplexing 05572000
*                                      rebuild.  OFF indicates the      05573000
*                                      structure rebuild is a normal    05574000
*                                      rebuild.  This bit only applies  05575000
*                                      when IXLYAMDSTRC_StrInRebld is   05576000
*                                      on.                       @03A*/ 05577000
*         5    IXLYAMDSTRC_RebldMethodStr  BIT(1), /* ON indicates the  05578000
*                                      structure rebuild is system      05579000
*                                      managed.  OFF indicates the      05580000
*                                      structure rebuild is user        05581000
*                                      managed.  This bit only applies  05582000
*                                      when IXLYAMDSTRC_StrInRebld is   05583000
*                                      on.                       @L8A*/ 05584000
*       3    *        CHAR(3),                                          05585000
*                                                                       05586000
*/*****CACHE***************** Measurement Data ********************* */ 05587000
*                                                                       05588000
*       3    IXLYAMDSTRC_Status CHAR(1), /* Structure status bits    */ 05589000
*         5    IXLYAMDSTRC_AMValid BIT(1), /* The following             05590000
*                                      measurement data is valid     */ 05591000
*         5    IXLYAMDSTRC_DumpSerialHeld BIT(1), /* Dump               05592000
*                                      serialization is held against    05593000
*                                      this structure - internal        05594000
*                                      operations are failed -          05595000
*                                      external operations are          05596000
*                                      delayed. Hardware control data   05597000
*                                      will not be available.        */ 05598000
*       3    *        CHAR(1),      /* Unused                    @05C*/ 05599000
*/********************************************************************/ 05600000
*/* Begin fields whose validity is indicated by the              @LDM*/ 05601000
*/* IXLYAMDSTRC_AMValid flag                                     @LDM*/ 05602000
*/********************************************************************/ 05603000
*       3    IXLYAMDSTRC_AMDataSequence FIXED(16), /* Sequence number   05604000
*                                      associated with this instance    05605000
*                                      of Measurement Data from this    05606000
*                                      system.                   @05A*/ 05607000
*       3    IXLYAMDSTRC_Reqct FIXED(32), /* Total requests. This       05608000
*                                      relates to external requests     05609000
*                                      such as IXLCACHE macro           05610000
*                                      invocations, not operations to   05611000
*                                      the coupling facility.        */ 05612000
*       3    IXLYAMDSTRC_ReqctAsync FIXED(32), /* Total asynchronous    05613000
*                                      requests started (unused, always 05614000
*                                      zero)                     @PJC*/ 05615000
*       3    IXLYAMDSTRC_HiWorkQueueCount FIXED(32), /* Current count   05616000
*                                      of the number of operations      05617000
*                                      queued for subchannel            05618000
*                                      contention                    */ 05619000
*       3    IXLYAMDSTRC_WorkQueueCount FIXED(32), /* Current count     05620000
*                                      of the number of operations      05621000
*                                      queued for subchannel            05622000
*                                      contention                    */ 05623000
*       3    IXLYAMDSTRC_DelayQueueCount FIXED(32), /* Current count    05624000
*                                      of the number of operations      05625000
*                                      delayed for dump serialization   05626000
*                                      and/or a system-managed process  05627000
*                                      (e.g., rebuild)           @L5C*/ 05628000
*       3    IXLYAMDSTRC_DumpSerialReleased FIXED(32), /* Count of      05629000
*                                      the number times dump            05630000
*                                      serialization was obtained and   05631000
*                                      released for this structure   */ 05632000
*       3    IXLYAMDSTRC_SyncTimeCount FIXED(32), /* Count of the       05633000
*                                      number of summed times -- for    05634000
*                                      successful synchronous           05635000
*                                      operations to the facility    */ 05636000
*       3    IXLYAMDSTRC_SyncSumTime CHAR(8), /* Summed service time    05637000
*                                      (u-sec)                       */ 05638000
*       3    IXLYAMDSTRC_SyncSumTimeSQR CHAR(8), /* Summed service      05639000
*                                      time squared (u-sec squared)  */ 05640000
*       3    IXLYAMDSTRC_AsyncTimeCount FIXED(32), /* Count of the      05641000
*                                      number of summed times -- for    05642000
*                                      successful asynchronous          05643000
*                                      operations to the facility    */ 05644000
*       3    IXLYAMDSTRC_AsyncSumTime CHAR(8), /* Summed service time   05645000
*                                      (u-sec)                       */ 05646000
*       3    IXLYAMDSTRC_AsyncSumTimeSQR CHAR(8), /* Summed service     05647000
*                                      time squared (u-sec squared)  */ 05648000
*       3    IXLYAMDSTRC_QueueTimeCount FIXED(32), /* Count of the      05649000
*                                      number of summed times -- for    05650000
*                                      operation queue time          */ 05651000
*       3    IXLYAMDSTRC_QueueSumTime CHAR(8), /* Summed queue time     05652000
*                                      (u-sec)                       */ 05653000
*       3    IXLYAMDSTRC_QueueSumTimeSQR CHAR(8), /* Summed queue       05654000
*                                      time squared (u-sec squared)  */ 05655000
*       3    IXLYAMDSTRC_DelayTimeCount FIXED(32), /* Count of the      05656000
*                                      number of summed times -- for    05657000
*                                      operation delay time for dump    05658000
*                                      serialization                 */ 05659000
*       3    IXLYAMDSTRC_DelaySumTime CHAR(8), /* Summed delay time     05660000
*                                      (u-sec)                       */ 05661000
*       3    IXLYAMDSTRC_DelaySumTimeSQR CHAR(8), /* Summed delay       05662000
*                                      time squared (u-sec squared)  */ 05663000
*       3    IXLYAMDSTRC_SyncToAsyncCount FIXED(32), /* Count of the    05664000
*                                      number times a synchronous       05665000
*                                      operation could not be           05666000
*                                      performed synchronously and      05667000
*                                      was changed to an asynchronous   05668000
*                                      operation                     */ 05669000
*       3    IXLYAMDSTRC_TotalHiWorkCount FIXED(32), /* Total count     05670000
*                                      of the number of operations      05671000
*                                      queued for subchannel            05672000
*                                      contention                @P7A*/ 05673000
*       3    IXLYAMDSTRC_TotalWorkCount FIXED(32), /* Total count       05674000
*                                      of the number of operations      05675000
*                                      queued for subchannel            05676000
*                                      contention                @P7A*/ 05677000
*       3    *        CHAR(4),      /* RESERVED                      */ 05678000
*/********************************************************************/ 05679000
*/* End fields whose validity is indicated by the                @L5A*/ 05680000
*/* IXLYAMDSTRC_AMValid flag                                     @L5A*/ 05681000
*/********************************************************************/ 05682000
*                                                                       05683000
*/*************Control Structure Information *********************** */ 05684000
*                                                                       05685000
*       3    IXLYAMDSTRC_DataFlags Bit(8),                              05686000
*         5    IXLYAMDSTRC_Valid BIT(1), /* The following cache         05687000
*                                      control structure information    05688000
*                                      is valid                      */ 05689000
*         5    *        BIT(3),     /* reserved                      */ 05690000
*         5    IXLYAMDSTRC_DTSValid BIT(1), /* Structure dump table     05691000
*                                      size information is valid     */ 05692000
*       3    *        CHAR(2),      /* reserved                  @L3C*/ 05693000
*/********************************************************************/ 05694000
*/* Begin fields whose validity is indicated by the              @LDM*/ 05695000
*/* IXLYAMDSTRC_Valid flag                                       @LDM*/ 05696000
*/********************************************************************/ 05697000
*       3    IXLYAMDSTRC_Flags2 BIT(8),  /* Flags                @L3A*/ 05698000
*         5    IXLYAMDSTRC_REIPI BIT(1), /* Reapportionment in          05699000
*                                      progress indicator.  1=structure 05700000
*                                      ALTER to change ratio is in      05701000
*                                      progress (LEVEL1)         @L3A*/ 05702000
*         5    IXLYAMDSTRC_SSCI BIT(1), /* Structure size change in     05703000
*                                      progress indicator.  1=structure 05704000
*                                      ALTER to change structure size   05705000
*                                      is in progress (LEVEL1)   @L3A*/ 05706000
*         5    *        BIT(1),     /* Reserved                  @LHC*/ 05707000
*         5    IXLYAMDSTRC_IRTCEI BIT(1), /* Immediate RTC completion   05708000
*                                      enablement indicator. 1 ==>      05709000
*                                      immediate RTC completion         05710000
*                                      controls have been set for       05711000
*                                      this structure, allowing         05712000
*                                      enablement of the expedited      05713000
*                                      duplex completion protocol.      05714000
*                                      (LEVEL16)                 @LHA*/ 05715000
*         5    IxlyamdStrC_Encrypt Bit(1),  /*  Structure data          05716000
*                                      encrypted indicator. 1=structure 05717000
*                                      data is encrypted         @M1C*/ 05718000
*         5    IxlyamdStrC_WRTCICO BIT, /* Wait on ready to complete    05719000
*                                      cache override - Indicates       05720000
*                                      that the sending of the RTC      05721000
*                                      signal is delayed until the      05722000
*                                      RTC is received. (LEVEL22)       05723000
*                                                                @M2A*/ 05724000
*         5    IXLYAMDSTRC_MI BIT(1), /* Designated master structure -  05725000
*                                      Indicates that RTC signal will   05726000
*                                      always be sent first. (LEVEL24)  05727000
*                                                                @M4A*/ 05728000
*         5    IxlyamdstrC_MS Bit(1),  /* Monopolization state.         05729000
*                                      1=structure is consuming a       05730000
*                                      disproportionate share of        05731000
*                                      coupling facility resources      05732000
*                                      (CFLEVEL 24)              @M6C*/ 05733000
*         5    *        CHAR(0),    /* End IXLYAMDSTRC_Flags2    @LHA*/ 05734000
*       3    IXLYAMDSTRC_TDEC FIXED(32), /* Total Directory entry       05735000
*                                      count. This count is only        05736000
*                                      substantially accurate    @P3C*/ 05737000
*       3    IXLYAMDSTRC_TDAEC FIXED(32), /* Total Data area element    05738000
*                                      count. This count is only        05739000
*                                      substantially accurate    @P3C*/ 05740000
*       3    IXLYAMDSTRC_BITS BIT(8),                                   05741000
*         5    IXLYAMDSTRC_AAI BIT(1), /* Adjunct Assignment            05742000
*                                      indicator                     */ 05743000
*         5    IXLYAMDSTRC_UDFOQI BIT(1), /* UDF order queue            05744000
*                                      indicator.  CFLevel 5 or         05745000
*                                      higher.                   @PDA*/ 05746000
*         5    *        BIT(6),     /* reserved                  @PDC*/ 05747000
*       3    IXLYAMDSTRC_MSCV FIXED(8), /* Maximum storage class        05748000
*                                      value                         */ 05749000
*       3    IXLYAMDSTRC_NCM  BIT(16),  /* Name class mask. CFLEVEL=7   05750000
*                                      or higher                 @L6C*/ 05751000
*       3    IXLYAMDSTRC_MCCV FIXED(16), /* Maximum castout class       05752000
*                                      value                         */ 05753000
*       3    IXLYAMDSTRC_DAEX FIXED(8), /* Data area element            05754000
*                                      characteristic. The size of a    05755000
*                                      data element in bytes is         05756000
*                                      256*(2**DAEX)                 */ 05757000
*       3    IXLYAMDSTRC_MDAS FIXED(8), /* Maximum data area size       05758000
*                                      (i.e maximum number of           05759000
*                                      elements per entry)           */ 05760000
*       3    IXLYAMDSTRC_SS FIXED(32), /* Structure size in 4K blocks*/ 05761000
*       3    IXLYAMDSTRC_MSS Fixed(32), /* Maximum structure size in    05762000
*                                      4K blocks                     */ 05763000
*       3    IXLYAMDSTRC_MINSS Fixed(32), /* Minimum structure size     05764000
*                                      in 4K blocks. The structure      05765000
*                                      may actually be allocated        05766000
*                                      smaller than this, but if so,    05767000
*                                      structure attributes such as     05768000
*                                      entry/element ratio will         05769000
*                                      differ significantly from        05770000
*                                      those which were requested.      05771000
*                                                                @P3C*/ 05772000
*       3    IXLYAMDSTRC_DTS FIXED(32), /* Structure dump table size    05773000
*                                      in 4k blocks                  */ 05774000
*       3    IXLYAMDSTRC_MRSS FIXED(32), /* Marginal structure size.    05775000
*                                      This is the true minimum size    05776000
*                                      with which the structure can     05777000
*                                      be allocated,  regardless of     05778000
*                                      ratio considerations.            05779000
*                                      (LEVEL1)                  @L3A*/ 05780000
*       3    IXLYAMDSTRC_TSS FIXED(32), /* Target structure size.       05781000
*                                      For a CFLEVEL 0 facility, the    05782000
*                                      target structure size will       05783000
*                                      be equal to the actual structure 05784000
*                                      size.  For a CFLEVEL 1 or higher 05785000
*                                      facility, the target structure   05786000
*                                      size will be equal to the target 05787000
*                                      structure size specified on the  05788000
*                                      initial allocate or subsequent   05789000
*                                      expand or contract request.      05790000
*                                      The target size may or may not   05791000
*                                      be equal to the actual size.     05792000
*                                      (LEVEL1)                  @D2C*/ 05793000
*       3    IXLYAMDSTRC_TMELC FIXED(32), /* Target maximum element     05794000
*                                      count.  For a CFLEVEL 0 facility 05795000
*                                      the target maximum element count 05796000
*                                      will be equal to the actual      05797000
*                                      maximum element count.  For      05798000
*                                      CFLEVEL 1 or higher facilities,  05799000
*                                      the target maximum element count 05800000
*                                      will reflect the target ratio    05801000
*                                      specified on the initial         05802000
*                                      allocate or subsequent           05803000
*                                      reapportionment request.  This   05804000
*                                      may or may not equal the actual  05805000
*                                      maximum element count.           05806000
*                                      (LEVEL1)                  @D2C*/ 05807000
*       3    IXLYAMDSTRC_TMEC FIXED(32), /* Target maximum entry        05808000
*                                      count.  For a CFLEVEL 0 facility 05809000
*                                      the target maximum entry count   05810000
*                                      will be equal to the actual      05811000
*                                      maximum entry count.  For        05812000
*                                      CFLEVEL 1 or higher facilities,  05813000
*                                      the target maximum entry count   05814000
*                                      will reflect the target ratio    05815000
*                                      specified on the initial         05816000
*                                      allocate or subsequent           05817000
*                                      reapportionment request.  This   05818000
*                                      may or may not equal the actual  05819000
*                                      maximum entry count.             05820000
*                                      (LEVEL1)                  @D2C*/ 05821000
*       3    IXLYAMDSTRC_PDTDR FIXED(32), /* Pending directory to data  05822000
*                                      ratio.  This field is only       05823000
*                                      applicable to CFLEVEL 1 or       05824000
*                                      higher facilities.               05825000
*                                      (LEVEL1)                  @D2C*/ 05826000
*         5    IXLYAMDSTRC_PDTDR_Dir FIXED(16), /* Directory ratio      05827000
*                                      portion (LEVEL1)          @L3A*/ 05828000
*         5    IXLYAMDSTRC_PDTDR_Data FIXED(16), /* Data element ratio  05829000
*                                      portion (LEVEL1)          @L3A*/ 05830000
*       3    IXLYAMDSTRC_TSCC  FIXED(32), /* Total structure changed    05831000
*                                      entry count.  This count is      05832000
*                                      only substantially               05833000
*                                      accurate (LEVEL1)         @P9C*/ 05834000
*       3    IXLYAMDSTRC_TCDEC FIXED(32), /* Total structure changed    05835000
*                                      data element count.  This count  05836000
*                                      is only substantially            05837000
*                                      accurate (LEVEL1)         @P9C*/ 05838000
*       3    *        CHAR(4),      /* Reserved                  @L4C*/ 05839000
*/********************************************************************/ 05840000
*/* End fields whose validity is indicated by the                @L5A*/ 05841000
*/* IXLYAMDSTRC_Valid flag                                       @L5A*/ 05842000
*/********************************************************************/ 05843000
*       3    *        CHAR(0);                                          05844000
*                                                                       05845000
*   DECLARE                                                             05846000
*     1    IXLYAMDSTRC1 BASED IXLYAMDA_VIA, /* Structure Entry for a    05847000
*                                      Cache Structure (STRC),          05848000
*                                      AmdaLevel>=1              @02A*/ 05849000
*       3    * CHAR(LENGTH(IXLYAMDSTRC)), /* Mapped by IXLYAMDSTRC      05850000
*                                                                @02A*/ 05851000
*/********************************************************************/ 05852000
*/* Begin fields whose validity is indicated by the              @L5A*/ 05853000
*/* IXLYAMDSTRC_Valid flag                                       @L5A*/ 05854000
*/********************************************************************/ 05855000
*       3    Ixlyamdstrc1_WQC FIXED(32), /* Write-with-castout          05856000
*                                      queue count (LEVEL8)      @PEC*/ 05857000
*       3    Ixlyamdstrc1_SCCVN FIXED(32), /* Structure copy            05858000
*                                      controls version number          05859000
*                                      (LEVEL8)                  @PEC*/ 05860000
*       3    Ixlyamdstrc1_GCUDRI FIXED(32), /* Global count of          05861000
*                                      unchanged directory entries      05862000
*                                      with registered interest         05863000
*                                      (LEVEL8)                  @PEC*/ 05864000
*       3    Ixlyamdstrc1_FDEC FIXED(32), /* Free directory entry       05865000
*                                      count (LEVEL8)            @PEC*/ 05866000
*       3    Ixlyamdstrc1_FDAEC FIXED(32), /* Free data area            05867000
*                                      element count (LEVEL8)    @PEC*/ 05868000
*       3    Ixlyamdstrc1_CCCUR FIXED(16), /* Castout class cursor      05869000
*                                      (LEVEL8)                  @PEC*/ 05870000
*       3    * CHAR(2),             /* Reserved                  @L5A*/ 05871000
*       3    Ixlyamdstrc1_SXTIME char(8), /* Structure related CPU      05872000
*                                      execution time (LEVEL15)  @LGC*/ 05873000
*/********************************************************************/ 05874000
*/* End fields whose validity is indicated by the                @L5A*/ 05875000
*/* IXLYAMDSTRC_Valid flag                                       @L5A*/ 05876000
*/********************************************************************/ 05877000
*       3    * CHAR(16),            /* Reserved                  @LGC*/ 05878000
*/********************************************************************/ 05879000
*/* Begin fields whose validity is indicated by the              @LDA*/ 05880000
*/* IXLYAMDSTRC_AMValid flag                                     @LDA*/ 05881000
*/********************************************************************/ 05882000
*       3    Ixlyamdstrc1_PeerLinkUnavailableCount Fixed(32), /* Count  05883000
*                                      of Peer Link                     05884000
*                                      Not Available conditions         05885000
*                                      (LEVEL10)                 @LDC*/ 05886000
*       3    Ixlyamdstrc1_ExecutionSuppressedCount Fixed(32),           05887000
*                                   /* Count of Execution               05888000
*                                      Suppressed conditions            05889000
*                                      (LEVEL10)                 @LDC*/ 05890000
*       3    Ixlyamdstrc1_PeerWaitSchTimeCount FIXED(32), /* Count of   05891000
*                                      the number of times a duplexed   05892000
*                                      request was holding a subchannel 05893000
*                                      while waiting for a peer request 05894000
*                                      to be started.                   05895000
*                                      (LEVEL10)                 @PKC*/ 05896000
*       3    Ixlyamdstrc1_PeerWaitSchSumTime CHAR(8), /* Summed peer    05897000
*                                      subchannel wait time (u-sec)     05898000
*                                      (LEVEL10)                 @LCC*/ 05899000
*       3    Ixlyamdstrc1_PeerWaitSchSumTimeSQR CHAR(8), /* Summed peer 05900000
*                                      subchannel wait time squared     05901000
*                                      (u-sec squared) (LEVEL10) @LCC*/ 05902000
*       3    Ixlyamdstrc1_PeerWaitRsvTimeCount FIXED(32), /* Count of   05903000
*                                      the number of times a request    05904000
*                                      is holding a subchannel in       05905000
*                                      reserve while waiting for a      05906000
*                                      peer subchannel to become        05907000
*                                      available to start a duplexed    05908000
*                                      request. (LEVEL10)        @PKC*/ 05909000
*       3    Ixlyamdstrc1_PeerWaitRsvSumTime CHAR(8), /* Summed peer    05910000
*                                      subchannel wait with reserve     05911000
*                                      time (u-sec) (LEVEL10)    @LDC*/ 05912000
*       3    Ixlyamdstrc1_PeerWaitRsvSumTimeSQR CHAR(8), /* Summed peer 05913000
*                                      subchannel wait with reserve     05914000
*                                      time squared (u-sec squared)     05915000
*                                      (LEVEL10)                 @LDC*/ 05916000
*                                                                       05917000
*       3    Ixlyamdstrc1_PeerWaitCompTimeCount FIXED(32), /* Count of  05918000
*                                      the number of "waiting for peer  05919000
*                                      completion" times reported.      05920000
*                                      One of the two duplexed          05921000
*                                      operations has completed, but    05922000
*                                      the completed subchannel remains 05923000
*                                      unavailable for use until the    05924000
*                                      peer operation completes.        05925000
*                                      (LEVEL10)     @LCA*/             05926000
*       3    Ixlyamdstrc1_PeerWaitCompSumTime CHAR(8), /* Summed        05927000
*                                      waiting for peer completion      05928000
*                                      times.  (u-sec) (LEVEL10) @LDC*/ 05929000
*       3    Ixlyamdstrc1_PeerWaitCompSumTimeSQR CHAR(8), /* Square of  05930000
*                                      the sum of the waiting for peer  05931000
*                                      completion time.                 05932000
*                                      (u-sec squared) (LEVEL10) @LCA*/ 05933000
*       3    Ixlyamdstrc1_LogicalVersion BIT(64),  /* Logical           05934000
*                                      structure version number.        05935000
*                                      Used in conjunction with         05936000
*                                      the physical version             05937000
*                                      number to identify an            05938000
*                                      instance of a structure.         05939000
*                                      The value of this field          05940000
*                                      is set equal to the              05941000
*                                      physical version number          05942000
*                                      when the structure is            05943000
*                                      initially allocated.  It         05944000
*                                      changes when a process           05945000
*                                      that allocates a new             05946000
*                                      instance of the structure        05947000
*                                      (e.g., rebuild) is               05948000
*                                      user-managed, but not            05949000
*                                      when it is                       05950000
*                                      system-managed.           @L5A*/ 05951000
*/********************************************************************/ 05952000
*/* End fields whose validity is indicated by the                @LDA*/ 05953000
*/* IXLYAMDSTRC_AMValid flag                                     @LDA*/ 05954000
*/********************************************************************/ 05955000
*       3    Ixlyamdstrc1_SSCCAddr PTR(31), /* Address of the           05956000
*                                      structure copy controls          05957000
*                                      information entry for this       05958000
*                                      structure.  A value of zero      05959000
*                                      means that the SSCC record       05960000
*                                      was not provided for this        05961000
*                                      structure because it was         05962000
*                                      not requested, not available,    05963000
*                                      or contained no information.     05964000
*                                                                @L5A*/ 05965000
*         5 Ixlyamdstrc1_SSCC_Off Fixed(32); /* Offset of the           05966000
*                                      structure copy controls          05967000
*                                      information entry for this       05968000
*                                      structure.  A value of zero      05969000
*                                      means that the SSCC record       05970000
*                                      was not provided for this        05971000
*                                      structure because it was         05972000
*                                      not requested, not available,    05973000
*                                      or contained no information.     05974000
*                                                                @M9A*/ 05975000
*                                                                       05976000
*   DECLARE                                                             05977000
*     1    IXLYAMDSTRC2 BASED IXLYAMDA_VIA, /* Structure Entry for a    05978000
*                                      Cache Structure (STRC),          05979000
*                                      AmdaLevel>=2              @M1A*/ 05980000
*       3    *        CHAR(LENGTH(IXLYAMDSTRC1)); /* Mapped by          05981000
*                                      IXLYAMDSTRC1              @M1A*/ 05982000
*                                                                       05983000
*/********************************************************************/ 05984000
*/*            Write and Read Request Measurement Data                  05985000
*                                                                       05986000
*   The metrics in IXLAMDSTRC3 represent the number of structure        05987000
*   entry write and read requests issued to a structure and the         05988000
*   amount of data associated with the number of structure entry        05989000
*   data elements and entry adjunct data written and read to and        05990000
*   from a structure.                                                   05991000
*                                                                       05992000
*   For structures that contain encrypted data, the read entry data     05993000
*   amounts (i.e., IxlyamdStrc3_ReadEntryData and                       05994000
*   IxlyamdStrc3_ReadEntryDataSQR) are a summation of what is           05995000
*   returned in the directory entry information block (DEIB)            05996000
*   for each entry read by a single entry read request or by a          05997000
*   multiple entry read request.                                        05998000
*                                                                       05999000
*   For structures that contain non-encrypted data, the read entry      06000000
*   data amounts for single entry read requests are computed            06001000
*   as they are for structures that contain encrypted data.  The        06002000
*   read entry data amounts for multiple entry read requests (e.g.,     06003000
*   Castout_Datalist) are based on an average number of                 06004000
*   data elements returned per entry by the request.             @M3A*/ 06005000
*/********************************************************************/ 06006000
*   DECLARE                                                             06007000
*     1    IXLYAMDStrC3 BASED IXLYAMDA_VIA Bdy(DWord), /*               06008000
*                                      Structure Entry for a            06009000
*                                      Cache Structure (STRC),          06010000
*                                      AmdaLevel>=3              @M1A*/ 06011000
*       3    *        CHAR(LENGTH(IXLYAMDSTRC2)), /* Mapped by          06012000
*                                      IXLYAMDSTRC2              @M1A*/ 06013000
*       3    * CHAR(4),             /* Reserved                  @M1A*/ 06014000
*/********************************************************************/ 06015000
*/* Begin fields whose validity is indicated by the              @M1A*/ 06016000
*/* IXLYAMDSTRC_AMValid flag                                     @M1A*/ 06017000
*/********************************************************************/ 06018000
*       3  Ixlyamdstrc3_WriteDataRequests Fixed(32), /* Count of write  06019000
*                                     requests that request data        06020000
*                                     elements be written for a         06021000
*                                     structure entry            @M1A*/ 06022000
*       3  Ixlyamdstrc3_WriteAdjunctCount Fixed(32), /* Count of        06023000
*                                     adjunct areas transferred to the  06024000
*                                     CF for write requests      @M1A*/ 06025000
*       3  Ixlyamdstrc3_ReadDataRequests Fixed(32), /* count of read    06026000
*                                     requests that request entry       06027000
*                                     data be returned           @M1A*/ 06028000
*       3  Ixlyamdstrc3_ReadAdjunctCount Fixed(32), /* Count of adjunct 06029000
*                                     transferred by the CF and         06030000
*                                     returned on read requests  @M1A*/ 06031000
*       3  Ixlyamdstrc3_WriteEntryCount Fixed(32), /* Count of          06032000
*                                     the number of data entries        06033000
*                                     written with data elements.       06034000
*                                     Accounts for single and multi     06035000
*                                     entry write requests       @M1A*/ 06036000
*       3  Ixlyamdstrc3_ReadEntryCount Fixed(32), /* Count of           06037000
*                                     the number of data entries read   06038000
*                                     that contain data elements        06039000
*                                     returned on read requests.        06040000
*                                     Accounts for single and multi     06041000
*                                     entry read requests        @M1A*/ 06042000
*       3  Ixlyamdstrc3_WriteEntryData Fixed(64), /* Summed number of   06043000
*                                     bytes of entry data in 256-byte   06044000
*                                     increments written to the         06045000
*                                     structure for the number of entry 06046000
*                                     data elements written      @M3C*/ 06047000
*       3  Ixlyamdstrc3_WriteEntryDataSQR Fixed(64), /* Square of the   06048000
*                                     summed number of bytes of entry   06049000
*                                     data in 256-byte increments       06050000
*                                     written to the structure for      06051000
*                                     the number of entry               06052000
*                                     data elements written      @M3C*/ 06053000
*       3  Ixlyamdstrc3_ReadEntryData Fixed(64), /* Summed number of    06054000
*                                     bytes of entry data in 256-byte   06055000
*                                     increments read and transferred   06056000
*                                     by the CF.                 @M1A*/ 06057000
*       3  Ixlyamdstrc3_ReadEntryDataSQR Fixed(64), /* Square of the    06058000
*                                     summed number of bytes of entry   06059000
*                                     data in 256-byte increments read  06060000
*                                     and transferred by the CF  @M1A*/ 06061000
*/********************************************************************/ 06062000
*/* End fields whose validity is indicated by the                @M1A*/ 06063000
*/* IXLYAMDSTRC_AMValid flag                                     @M1A*/ 06064000
*/********************************************************************/ 06065000
*       3    *        CHAR(32),     /* Reserved                  @M1A*/ 06066000
*       3    *        CHAR(0);      /*                           @M1A*/ 06067000
*                                                                       06068000
*   DECLARE                                                             06069000
*     1    IXLYAMDSTRC4 BASED IXLYAMDA_VIA Bdy(DWord),  /*              06070000
*                                      Structure Entry for a            06071000
*                                      Cache Structure (STRC),          06072000
*                                      AmdaLevel>=4              @M5A*/ 06073000
*       3    *        CHAR(LENGTH(IXLYAMDSTRC3)), /* Mapped by          06074000
*                                      IXLYAMDSTRC3              @M5A*/ 06075000
*/********************************************************************/ 06076000
*/* Begin fields whose validity is indicated by the              @M5A*/ 06077000
*/* IXLYAMDSTRC_AMValid flag                                     @M5A*/ 06078000
*/********************************************************************/ 06079000
*       3  IxlyamdStrC4_CfMonopTimeCount Fixed(32), /* Count of         06080000
*                                     summed queue time - for           06081000
*                                     operations queued due to          06082000
*                                     coupling facility resource        06083000
*                                     monopolization             @M5A*/ 06084000
*       3  IxlyamdStrC4_CfMonopSumTime Char(8), /* Summed queue time -  06085000
*                                     for operations queued due to      06086000
*                                     coupling facility resource        06087000
*                                     monopolization (u-sec)     @M5A*/ 06088000
*       3  IxlyamdStrC4_CfMonopSumTimeSQR Char(8), /* Summed queue      06089000
*                                     time squared - for operations     06090000
*                                     queued due to coupling facility   06091000
*                                     resource monopolization (u-sec    06092000
*                                     squared)                   @M5A*/ 06093000
*       3  IxlyamdStrC4_TotalWorkCountMonop Fixed(32), /*  Total        06094000
*                                   count of operations queued for CF   06095000
*                                   monopolization avoidance.    @M5A*/ 06096000
*       3  IxlyamdStrC4_TotalHiWorkCountMonop Fixed(32), /*  Total      06097000
*                                   count of high priority              06098000
*                                   operations queued for CF            06099000
*                                   monopolization avoidance.    @M5A*/ 06100000
*       3  IxlyamdStrC4_WorkQueueCountMonop FIXED(32), /* Current       06101000
*                                   count of operations queued for      06102000
*                                   CF monopolization avoidance  @M5A*/ 06103000
*       3  IxlyamdStrC4_HiWorkQueueCountMonop FIXED(32), /* Current     06104000
*                                   count of high priority operations   06105000
*                                   queued for CF monopolization        06106000
*                                   avoidance.                   @M5A*/ 06107000
*/********************************************************************/ 06108000
*/* End fields whose validity is indicated by the                @M5A*/ 06109000
*/* IXLYAMDSTRC_AMValid flag                                     @M5A*/ 06110000
*/********************************************************************/ 06111000
*       3    *        CHAR(128),    /* Reserved                  @M5A*/ 06112000
*       3    *        CHAR(0);      /*                           @M5A*/ 06113000
*                                                                       06114000
*/********************************************************************/ 06115000
*/**************** Structure Cache Storage Class Entry ***************/ 06116000
*/********************************************************************/ 06117000
*                                                                       06118000
*/*****************Header*********************************************/ 06119000
*                                                                       06120000
*   DECLARE                                                             06121000
*     1    IXLYAMDSCSC BASED IXLYAMDA_VIA, /* Structure Entry for       06122000
*                                      Cache Storage Class (SCSC)    */ 06123000
*       3    IXLYAMDSCSC_Type BIT(8), /* X'23' -- indicates STR data    06124000
*                                      for Storage Class             */ 06125000
*       3    *        CHAR(3),      /* Unused                        */ 06126000
*       3    IXLYAMDSCSC_Length FIXED(32), /* Length of IXLYAMDSCSC     06127000
*                                      entry mapping                 */ 06128000
*       3    *        CHAR(4),      /* reserved                      */ 06129000
*       3    IXLYAMDSCSC_STATS,     /* Storage Class information     */ 06130000
*         5    IXLYAMDSCSC_RHC FIXED(32), /* Read hit counter        */ 06131000
*         5    IXLYAMDSCSC_RMDHC FIXED(32), /* Read miss, directory     06132000
*                                      hit counter                   */ 06133000
*         5    IXLYAMDSCSC_RMASC FIXED(32), /* Read miss, assignment    06134000
*                                      suppressed counter            */ 06135000
*         5    IXLYAMDSCSC_RMNAC FIXED(32), /* Read miss, name          06136000
*                                      assigned counter              */ 06137000
*         5    IXLYAMDSCSC_RMTSFC FIXED(32), /* Read miss, target       06138000
*                                      storage class full counter    */ 06139000
*         5    IXLYAMDSCSC_WHCB0C FIXED(32), /* Write hit change Bit    06140000
*                                      0 ctr                         */ 06141000
*         5    IXLYAMDSCSC_WHCB1C FIXED(32), /* Write hit change Bit    06142000
*                                      1 ctr                         */ 06143000
*         5    IXLYAMDSCSC_WMNRC FIXED(32), /* Write miss, not          06144000
*                                      registered counter            */ 06145000
*         5    IXLYAMDSCSC_WMISC FIXED(32), /* Write miss, invalid      06146000
*                                      state counter                 */ 06147000
*         5    IXLYAMDSCSC_WMTSFC FIXED(32), /* Write miss, target      06148000
*                                      storage class full counter    */ 06149000
*         5    IXLYAMDSCSC_DERC FIXED(32), /* Directory entry reclaim   06150000
*                                      counter                       */ 06151000
*         5    IXLYAMDSCSC_DTERC FIXED(32), /* Data entry reclaim       06152000
*                                      counter                       */ 06153000
*         5    IXLYAMDSCSC_XIFDRC FIXED(32), /* XI directory reclaim    06154000
*                                      counter                       */ 06155000
*         5    IXLYAMDSCSC_XIFWC FIXED(32), /* XI write counter      */ 06156000
*         5    IXLYAMDSCSC_XINIC FIXED(32), /* XI name invalidation     06157000
*                                      counter                       */ 06158000
*         5    IXLYAMDSCSC_XICIC FIXED(32), /* XI complement            06159000
*                                      invalidation counter          */ 06160000
*         5    IXLYAMDSCSC_COC FIXED(32), /* Castout Counter         */ 06161000
*         5    IXLYAMDSCSC_RSMC FIXED(32), /* Reference signal miss     06162000
*                                      counter                       */ 06163000
*         5    IXLYAMDSCSC_TSCFC FIXED(32), /* Target storage class     06164000
*                                      full counter                  */ 06165000
*         5    IXLYAMDSCSC_DEC FIXED(32), /* Directory entry counter */ 06166000
*         5    IXLYAMDSCSC_DAEC FIXED(32), /* Data area element         06167000
*                                      counter                       */ 06168000
*         5    IXLYAMDSCSC_TCC FIXED(32), /* Total changed counter   */ 06169000
*         5    IXLYAMDSCSC_DAC FIXED(32), /* Data area counter       */ 06170000
*         5    IXLYAMDSCSC_CRLC FIXED(32), /* Completed reference       06171000
*                                      lists counter                 */ 06172000
*         5    IXLYAMDSCSC_PCRLC FIXED(32), /* Partially completed      06173000
*                                      reference lists counter       */ 06174000
*         5    IXLYAMDSCSC_XILRC FIXED(32), /* XI for local cache       06175000
*                                      vector index replacement      */ 06176000
*         5    IXLYAMDSCSC_WUXIC FIXED(32), /* Write unchanged with     06177000
*                                      XI counter                    */ 06178000
*       3    *        CHAR(0);                                          06179000
*   DECLARE                                                             06180000
*     1    IXLYAMDSCSC1 BASED IXLYAMDA_VIA, /* Structure Entry for      06181000
*                                      Cache Storage Class (SCSC),      06182000
*                                      AmdaLevel>=1              @02A*/ 06183000
*       3    * CHAR(LENGTH(IXLYAMDSCSC)), /* Mapped by IXLYAMDSCSC      06184000
*                                                                @02A*/ 06185000
*       3    IXLYAMDSCSC1_UDERIC FIXED(32), /* Unchanged directory      06186000
*                                      entry with registered            06187000
*                                      interest counter (LEVEL8) @PEC*/ 06188000
*       3    IXLYAMDSCSC1_WMASC  FIXED(32), /* Write Miss Assignment    06189000
*                                      Suppression Counter              06190000
*                                      (CF LEVEL18)              @LLA*/ 06191000
*       3    IXLYAMDSCSC1_WMWSC  FIXED(32), /* Write Miss Write         06192000
*                                      Suppression Counter              06193000
*                                      (CF LEVEL17, SL 10.13)    @LLA*/ 06194000
*       3    * CHAR(4),             /* Reserved                  @M8A*/ 06195000
*       3    IXLYAMDSCSC1_DART Fixed(64), /* Data-Area Residency Time.  06196000
*                                       A 64-bit unsigned binary        06197000
*                                       integer that approximates in    06198000
*                                       microseconds via a moving       06199000
*                                       weighted average the elapsed    06200000
*                                       time a data area resides in a   06201000
*                                       storage class before it is      06202000
*                                       reclaimed (CF LEVEL25)   @M8A*/ 06203000
*       3    IXLYAMDSCSC1_DERT Fixed(64), /* Directory-Entry Residency  06204000
*                                       Time.  A 64 - bit unsigned      06205000
*                                       binary integer that             06206000
*                                       approximates in microseconds    06207000
*                                       via a moving weighted           06208000
*                                       average the elapsed time a      06209000
*                                       directory entry actively        06210000
*                                       resides in a storage class      06211000
*                                       before it is                    06212000
*                                       reclaimed (CF LEVEL25)   @M8A*/ 06213000
*       3    * CHAR(40);            /* Reserved                  @M8C*/ 06214000
*                                                                       06215000
*                                                                       06216000
*/********************************************************************/ 06217000
*/**************** Structure Cache CastOut Class Information Header***/ 06218000
*/********************************************************************/ 06219000
*                                                                       06220000
*   DECLARE                                                             06221000
*     1    IXLYAMDSCOC BASED IXLYAMDA_VIA, /* Structure Entry for       06222000
*                                      Cache CastOut Class (SCOC)    */ 06223000
*       3    IXLYAMDSCOC_Type BIT(8), /* X'24' -- indicates STR data    06224000
*                                      for CastOut Classes           */ 06225000
*       3    *        CHAR(3),      /* Unused                        */ 06226000
*       3    IXLYAMDSCOC_Length FIXED(32), /* Length of IXLYAMDSCOC     06227000
*                                      entry mapping                 */ 06228000
*       3    IXLYAMDSCOCSTATS@ PTR(31), /* Address of the SCOC entry.   06229000
*                                      An address of 0 indicates no     06230000
*                                      entries were processed        */ 06231000
*         5 IXLYAMDSCOCSTATS_Off Fixed(32), /* Offset of the SCOC       06232000
*                                      entry.  An address of 0          06233000
*                                      indicates no entries were        06234000
*                                      processed                 @M9A*/ 06235000
*       3    IXLYAMDSCOCBeg FIXED(16), /* First castout class in the    06236000
*                                      range of castout classes         06237000
*                                      processed                     */ 06238000
*       3    IXLYAMDSCOCEnd FIXED(16); /* Last castout class in the     06239000
*                                      range of castout classes         06240000
*                                      processed                     */ 06241000
*                                                                       06242000
*/*****************Cast Out Class Statistics**************************/ 06243000
*                                                                       06244000
*   DECLARE                                                             06245000
*     1    IXLYAMDSCOCSTATS BASED IXLYAMDA_VIA, /* Cast Out Class       06246000
*                                      Stats                         */ 06247000
*       3    IXLYAMDSCOCEntry FIXED(32); /* Number of data elements     06248000
*                                      associated with entries in the   06249000
*                                      indicated castout class   @P5C*/ 06250000
*                                                                       06251000
*/********************************************************************/ 06252000
*/******************** Subchannel Entry ******************************/ 06253000
*/********************************************************************/ 06254000
*                                                                       06255000
*   DECLARE                                                             06256000
*     1    IXLYAMDSC BASED IXLYAMDA_VIA, /* Subchannel Entry (SC)    */ 06257000
*       3    IXLYAMDSC_Type BIT(8), /* X'30' -- indicates SC data    */ 06258000
*       3    *        CHAR(3),      /* Unused                        */ 06259000
*       3    IXLYAMDSC_Length FIXED(32), /* Length of IXLYAMDSC entry   06260000
*                                      mapping                       */ 06261000
*       3    IXLYAMDSC_ScNext PTR(31), /* Address of next SC entry. A   06262000
*                                      value of 0 means last entry      06263000
*                                      for this facility             */ 06264000
*         5 IXLYAMDSC_ScNext_Off Fixed(32), /* Offset of next SC        06265000
*                                      entry. A value of 0 means        06266000
*                                      last entry for this              06267000
*                                      facility.                 @M9A*/ 06268000
*                                                                       06269000
*/******************* Configuration Data  *************************  */ 06270000
*                                                                       06271000
*       3    IXLYAMDSC_ScNumber FIXED(16), /* Subchannel number      */ 06272000
*       3    IXLYAMDSC_PAM BIT(8),  /* Path available mask for          06273000
*                                      coupling facility subchannels */ 06274000
*       3    IXLYAMDSC_PIM BIT(8),  /* Path installed mask for          06275000
*                                      coupling facility subchannels */ 06276000
*       3    IXLYAMDSC_Chpid_Set CHAR(8), /* Set of CHPIDs           */ 06277000
*         5    IXLYAMDSC_Chpids(8) BIT(8), /* CHPID array for           06278000
*                                      coupling facility subchannels */ 06279000
*       3    IXLYAMDSC_ScDevice FIXED(16), /* Subchannel device         06280000
*                                      number                        */ 06281000
*       3    IXLYAMDSC_Subch_Status BIT(16), /* Subchannel status       06282000
*                                                                @P2A*/ 06283000
*         5    IXLYAMDSC_NotOperational BIT(1), /* Subchannel not       06284000
*                                      operational               @P2A*/ 06285000
*         5    IXLYAMDSC_NotInUse BIT(1), /* Subchannel operational     06286000
*                                      but not being used for           06287000
*                                      operations                @P2A*/ 06288000
*         5    IXLYAMDSC_Active BIT(1), /* Subchannel operational and   06289000
*                                      used for operations       @P2A*/ 06290000
*       3    IXLYAMDSC_CHPIDSetType  CHAR(8), /* Set of CHPID Types     06291000
*                                                                @04A*/ 06292000
*         5    IXLYAMDSC_CHPIDsType(8) FIXED(8), /* CHPID array for     06293000
*                                      channel path type         @04A*/ 06294000
*       3    *        CHAR(4),      /* Reserved                      */ 06295000
*                                                                       06296000
*/* *************** Contention data  ******************************* */ 06297000
*                                                                       06298000
*       3    IXLYAMDSC_Subch_Busy FIXED(32), /* Subchannel busy         06299000
*                                      count. Compare to the            06300000
*                                      utilization count below.      */ 06301000
*       3    IXLYAMDSC_ALLPATHS_Busy FIXED(32), /* All path busy        06302000
*                                      termination count. Compare to    06303000
*                                      the utilization count below.  */ 06304000
*       3    IXLYAMDSC_Utilization FIXED(32), /* Utilization count --   06305000
*                                      Number of times this             06306000
*                                      subchannel was picked for an     06307000
*                                      operation                     */ 06308000
*       3    IXLYAMDSC_Sequence    FIXED(32), /* Sequence number. This  06309000
*                                      sequence number is changed       06310000
*                                      whenever a new "instance" of     06311000
*                                      this entity comes into use       06312000
*                                                                @08A*/ 06313000
*       3    *        CHAR(12);        /*                        @08C*/ 06314000
*                                                                       06315000
*   DECLARE                                                             06316000
*     1    IXLYAMDSC1 BASED IXLYAMDA_VIA, /* Subchannel Entry (SC),     06317000
*                                      AmdaLevel>=1              @02A*/ 06318000
*       3    * CHAR(LENGTH(IXLYAMDSC)), /* Mapped by                    06319000
*                                      IXLYAMDSC                 @02A*/ 06320000
*       3    * CHAR(60);            /* Reserved                  @02A*/ 06321000
*                                                                       06322000
*/********************************************************************/ 06323000
*/*                   Structure copy controls                        */ 06324000
*/*                                                                  */ 06325000
*/* This record is returned only when AMDALEVEL of at least 1        */ 06326000
*/* is specified.                                                @PFC*/ 06327000
*/********************************************************************/ 06328000
*   DECLARE                                                             06329000
*     1    IXLYAMDSSCC BASED IXLYAMDA_VIA, /* Structure copy controls   06330000
*                                      record                    @L5A*/ 06331000
*       3    IXLYAMDSSCC_Type BIT(8), /* X'25' -- indicates SSCC        06332000
*                                      data                      @L5A*/ 06333000
*       3    *        CHAR(3),      /* Unused                    @L5A*/ 06334000
*       3    IXLYAMDSSCC_Length FIXED(32), /* Length of IXLYAMDSSCC     06335000
*                                      entry mapping             @L5A*/ 06336000
*       3    * CHAR(16),            /* Reserved                  @L5A*/ 06337000
*       3    IXLYAMDSSCC_CopyControls CHAR(512),  /* Structure          06338000
*                                      copy controls (LEVEL8)    @PEC*/ 06339000
*         5    *        CHAR(184),  /* Reserved                  @0GA*/ 06340000
*         5    IXLYAMDSSCC_CopyVersion BIT(64), /* Structure copy       06341000
*                                      version number. Changes when a   06342000
*                                      new physical instance of the     06343000
*                                      structure is allocated for a     06344000
*                                      system-managed rebuild           06345000
*                                      process. Use with structure      06346000
*                                      version number                   06347000
*                                      (IXLYAMDSTRx_PhysicalVersion)    06348000
*                                      to identify an instance of a     06349000
*                                      structure. May be zero if the    06350000
*                                      structure has never been         06351000
*                                      copied.                   @0GA*/ 06352000
*       3    * CHAR(32);            /* Reserved                  @L5A*/ 06353000
*                                                                       06354000
*/********************************************************************/ 06355000
*/*              Structure Storage-Class Memory (SSCM)               */ 06356000
*/*                                                                  */ 06357000
*/* This record is returned only when AMDALEVEL of at least 1        */ 06358000
*/* is specified.                                                @LQA*/ 06359000
*/********************************************************************/ 06360000
*   DECLARE                                                             06361000
*     1    IXLYAMDSSCM BASED IXLYAMDA_VIA, /* Structure Storage-Class   06362000
*                                      Memory record             @LQA*/ 06363000
*       3    IXLYAMDSSCM_Type BIT(8), /* X'26' -- indicates SSCM data   06364000
*                                                                @LQA*/ 06365000
*       3    *        CHAR(3),      /* Unused                    @LQA*/ 06366000
*       3    IXLYAMDSSCM_Length FIXED(32), /* Length of IXLYAMDSSCM     06367000
*                                      entry mapping             @LQA*/ 06368000
*       3    *        CHAR(16),     /* Reserved                  @LQA*/ 06369000
*       3    IXLYAMDSSCM_Stats,     /* Structure SCM extension          06370000
*                                      information (LEVEL19)     @LQA*/ 06371000
*         5    IXLYAMDSSCM_MXSCM FIXED(64), /* Maximum storage-class    06372000
*                                      memory the structure can use     06373000
*                                      in 4K blocks              @LQA*/ 06374000
*         5    IXLYAMDSSCM_SCMAT FIXED(8), /* SCM Algorithm Type @LQA*/ 06375000
*         5    *        CHAR(3),    /* Reserved                  @LRA*/ 06376000
*         5    IXLYAMDSSCM_MSBEC FIXED(32), /* The maximum number of    06377000
*                                      list entries that can be         06378000
*                                      stored in a single               06379000
*                                      storage-class memory buffer      06380000
*                                                                @LRA*/ 06381000
*         5    IXLYAMDSSCM_MSBELC FIXED(32), /* The maximum number of   06382000
*                                      list elements that can be        06383000
*                                      stored in a single               06384000
*                                      storage-class memory buffer      06385000
*                                                                @LRA*/ 06386000
*         5    IXLYAMDSSCM_MNELC FIXED(32), /* The minimum element      06387000
*                                      count                     @0DA*/ 06388000
*         5    IXLYAMDSSCM_MNEC FIXED(32), /* The minimum entry count   06389000
*                                                                @0DA*/ 06390000
*         5    *        CHAR(8),    /* Reserved                  @0DC*/ 06391000
*         5    IXLYAMDSSCM_FXAUS FIXED(32), /* Fixed augmented space    06392000
*                                      in 4K blocks              @LQA*/ 06393000
*         5    *        CHAR(4),    /* Reserved                  @LQA*/ 06394000
*         5    IXLYAMDSSCM_IUAUS FIXED(32), /* In-use augmented space   06395000
*                                      in 4K blocks              @LQA*/ 06396000
*         5    IXLYAMDSSCM_IUSCM FIXED(64), /* In-use storage-class     06397000
*                                      memory by the structure in 4K    06398000
*                                      blocks                    @LQA*/ 06399000
*         5    *        CHAR(4),    /* Reserved                  @LQA*/ 06400000
*         5    IXLYAMDSSCM_EMXAUS FIXED(32), /* Estimated maximum       06401000
*                                      space in 4K blocks that may be   06402000
*                                      assigned as augmented space      06403000
*                                      for the structure         @LQA*/ 06404000
*         5    IXLYAMDSSCM_EMSEC FIXED(64), /* Estimated maximum        06405000
*                                      number of list entries that      06406000
*                                      may reside in storage-class      06407000
*                                      memory for the structure  @LQA*/ 06408000
*         5    IXLYAMDSSCM_EMSELC FIXED(64), /* Estimated maximum       06409000
*                                      number of list elements that     06410000
*                                      may reside in storage-class      06411000
*                                      memory for the structure  @LQA*/ 06412000
*         5    IXLYAMDSSCM_SLSEC FIXED(64), /* Number of existing       06413000
*                                      structure list entries in the    06414000
*                                      list set that reside in          06415000
*                                      storage-class memory      @LQA*/ 06416000
*         5    IXLYAMDSSCM_SLSELC FIXED(64), /* Number of existing      06417000
*                                      structure list elements in the   06418000
*                                      list set that reside in          06419000
*                                      storage-class memory      @LQA*/ 06420000
*         5    IXLYAMDSSCM_SCMLT FIXED(8), /* Percentage of the list    06421000
*                                      entry and list element counts    06422000
*                                      that determines the lower        06423000
*                                      threshold for migration          06424000
*                                      between storage-class memory     06425000
*                                      and CF storage            @LQA*/ 06426000
*         5    IXLYAMDSSCM_SCMUT FIXED(8), /* Percentage of the list    06427000
*                                      entry and list element counts    06428000
*                                      that determines the upper        06429000
*                                      threshold for migration from     06430000
*                                      CF storage to storage-class      06431000
*                                      memory                    @LQA*/ 06432000
*         5    IXLYAMDSSCM_SCMLTR FIXED(8), /* Percentage of the list   06433000
*                                      entry and list element counts    06434000
*                                      that determines the lower        06435000
*                                      threshold regulator for          06436000
*                                      migration between CF SCM and     06437000
*                                      CF real storage. The lower       06438000
*                                      threshold regulators are used    06439000
*                                      to stop migration from CF SCM    06440000
*                                      into CF real storage after       06441000
*                                      being triggered by the lower     06442000
*                                      threshold                 @LQA*/ 06443000
*         5    IXLYAMDSSCM_SCMUTR FIXED(8), /* Percentage of the list   06444000
*                                      entry and list element counts    06445000
*                                      that determines the upper        06446000
*                                      threshold regulator for          06447000
*                                      migration between CF real        06448000
*                                      storage and CF SCM. The upper    06449000
*                                      threshold regulators are used    06450000
*                                      to stop migration from CF real   06451000
*                                      storage into CF SCM after        06452000
*                                      being triggered by the upper     06453000
*                                      threshold                 @LQA*/ 06454000
*         5    IXLYAMDSSCM_SCMWC FIXED(32), /* SCM write count.         06455000
*                                      Number of list write             06456000
*                                      operations performed to          06457000
*                                      storage-class memory      @LQA*/ 06458000
*         5    IXLYAMDSSCM_SCMRFC FIXED(32), /* SCM read after fault    06459000
*                                      count. The number of read        06460000
*                                      operations against               06461000
*                                      storage-class memory that were   06462000
*                                      initiated by a reference to      06463000
*                                      list structure objects           06464000
*                                      residing on storage-class        06465000
*                                      memory                    @LQA*/ 06466000
*         5    IXLYAMDSSCM_SCMRPC FIXED(32), /* SCM read for prefetch   06467000
*                                      count. The number of read        06468000
*                                      operations against               06469000
*                                      storage-class memory that were   06470000
*                                      initiated as a prefetch          06471000
*                                      operation in order to retrieve   06472000
*                                      list structure objects on        06473000
*                                      storage-class memory that are    06474000
*                                      expected to be referenced @LQA*/ 06475000
*         5    IXLYAMDSSCM_SRSTFM FIXED(64), /* The accumulated         06476000
*                                      service times in microseconds    06477000
*                                      for read operations to           06478000
*                                      storage-class memory      @LQA*/ 06479000
*         5    IXLYAMDSSCM_SRSTSM FIXED(64), /* The accumulated         06480000
*                                      squares of service times, in     06481000
*                                      squared microsecond units for    06482000
*                                      read operations to               06483000
*                                      storage-class memory      @LQA*/ 06484000
*         5    IXLYAMDSSCM_SWSTFM FIXED(64), /* The accumulated         06485000
*                                      service times in microseconds    06486000
*                                      for write operations to          06487000
*                                      storage-class memory      @LQA*/ 06488000
*         5    IXLYAMDSSCM_SWSTSM FIXED(64), /* The accumulated         06489000
*                                      squares of service times, in     06490000
*                                      squared microsecond units, for   06491000
*                                      write operations to              06492000
*                                      storage-class memory      @LQA*/ 06493000
*         5    IXLYAMDSSCM_SCMRBT FIXED(64), /* SCM read bytes          06494000
*                                      transferred. Number of bytes     06495000
*                                      in 4K-byte units transferred     06496000
*                                      from storage-class memory to     06497000
*                                      CF storage                @LQA*/ 06498000
*         5    IXLYAMDSSCM_SCMWBT FIXED(64), /* SCM write bytes         06499000
*                                      transferred. Number of bytes     06500000
*                                      in 4K-byte units transferred     06501000
*                                      from CF storage to               06502000
*                                      storage-class memory      @LQA*/ 06503000
*         5    IXLYAMDSSCM_SAECC FIXED(32), /* SCM auxiliary enabled    06504000
*                                      command count. Number of         06505000
*                                      commands that required the use   06506000
*                                      of CF auxiliary frames    @LQA*/ 06507000
*         5    IXLYAMDSSCM_SRCC1C FIXED(32), /* SCM reference count 1   06508000
*                                      - The number of references       06509000
*                                      against storage-class memory     06510000
*                                      to locate list structure         06511000
*                                      objects                   @LQA*/ 06512000
*         5    IXLYAMDSSCM_SRCC2C FIXED(32), /* SCM reference count 2   06513000
*                                      - The number of references       06514000
*                                      against storage-class memory     06515000
*                                      to resolve list entry key        06516000
*                                      hashing                   @LQA*/ 06517000
*         5    IXLYAMDSSCM_SRCC3C FIXED(32), /* SCM reference count 3   06518000
*                                      - The number of references       06519000
*                                      against storage-class memory     06520000
*                                      for the purpose of migrating     06521000
*                                      list structure objects from CF   06522000
*                                      storage to storage-class         06523000
*                                      memory to allow for the          06524000
*                                      creation of new list structure   06525000
*                                      objects in CF storage     @LQA*/ 06526000
*         5    IXLYAMDSSCM_SRCC4C FIXED(32), /* SCM reference count 4   06527000
*                                      - The number of references       06528000
*                                      against storage-class memory     06529000
*                                      for the purpose of migrating     06530000
*                                      list structure objects from      06531000
*                                      storage-class memory to CF       06532000
*                                      storage to allow for key-range   06533000
*                                      initialization to complete.      06534000
*                                                                @0DA*/ 06535000
*       3    *        CHAR(52);     /* Reserved                  @0DC*/ 06536000
*                                                                       06537000
*/********************************************************************/ 06538000
*/*              Asynchronous Duplexing (ADUP)                       */ 06539000
*/*                                                                  */ 06540000
*/* This record is returned only when AMDALEVEL of at least 2        */ 06541000
*/* is specified.                                                @LXA*/ 06542000
*/********************************************************************/ 06543000
*   DECLARE                                                             06544000
*     1    IxlyamdaDup BASED IXLYAMDA_VIA, /* Structure asynchronous    06545000
*                                      duplexing record          @LWA*/ 06546000
*       3    IxlyamdaDup_Type BIT(8), /* X'27' -- indicates             06547000
*                                      asynchronous duplexing data      06548000
*                                                                @LWA*/ 06549000
*       3    *        CHAR(3),      /* Unused                    @LWA*/ 06550000
*       3    IxlyamdaDup_Length FIXED(32), /* Length of IxlyamdaDup     06551000
*                                      entry mapping             @LWA*/ 06552000
*       3    *        CHAR(16),     /* Reserved                  @LWA*/ 06553000
*       3    IxlyamdaDup_Info,      /* Structure asynchronous           06554000
*                                      duplexing information            06555000
*                                      (LEVEL21)                 @LWA*/ 06556000
*         5    IxlyamdaDup_FOSN FIXED(64), /* Failed operation          06557000
*                                      sequence number. The value of    06558000
*                                      the push operation sequence      06559000
*                                      number that was being            06560000
*                                      processed when an error was      06561000
*                                      encountered that resulted in a   06562000
*                                      duplexing failure. (CFLEVEL      06563000
*                                      21)                       @LWA*/ 06564000
*         5    IxlyamdaDup_HEOSN FIXED(64), /* Highest executable       06565000
*                                      operation sequence number. The   06566000
*                                      value of the upper bound of      06567000
*                                      the continuous sequence of       06568000
*                                      assigned sequence numbers that   06569000
*                                      have been received by the        06570000
*                                      secondary but have not yet       06571000
*                                      completed in the secondary.      06572000
*                                      (CFLEVEL 21)              @LWA*/ 06573000
*         5    IxlyamdaDup_LAOSN FIXED(64), /* Last assigned            06574000
*                                      operation sequence number. The   06575000
*                                      value of the highest valued      06576000
*                                      sequence number assigned to an   06577000
*                                      asynchronous duplexing           06578000
*                                      operation. Not defined in the    06579000
*                                      secondary. (CFLEVEL 21)   @LWA*/ 06580000
*         5    IxlyamdaDup_LAOSNS FIXED(64), /* Last assigned           06581000
*                                      operation sequence number        06582000
*                                      secondary. The value of the      06583000
*                                      highest valued sequence number   06584000
*                                      assigned to an asynchronous      06585000
*                                      duplexing operation as           06586000
*                                      indicated by the primary CF      06587000
*                                      and received by the secondary    06588000
*                                      CF. (CFLEVEL 21)          @LWA*/ 06589000
*         5    IxlyamdaDup_LCOSN FIXED(64), /* Last completed           06590000
*                                      operation sequence number. The   06591000
*                                      value of the highest valued      06592000
*                                      sequence number that has been    06593000
*                                      executed in the secondary        06594000
*                                      structure. Not defined in the    06595000
*                                      primary. (CFLEVEL 21)     @LWA*/ 06596000
*         5    IxlyamdaDup_LCOSNP FIXED(64), /* Last completed          06597000
*                                      operation sequence number        06598000
*                                      primary. The value of the        06599000
*                                      highest valued sequence number   06600000
*                                      that has been executed as        06601000
*                                      indicated by the secondary CF    06602000
*                                      and received by the primary      06603000
*                                      CF. (CFLEVEL 21)          @LWA*/ 06604000
*         5    IxlyamdaDup_TPOC FIXED(32), /* Transmitted               06605000
*                                      push-operation count. The        06606000
*                                      number of push operations        06607000
*                                      transmitted to the secondary     06608000
*                                      CF. (CFLEVEL 21)          @LWA*/ 06609000
*         5    IxlyamdaDup_RCPOC FIXED(32), /* Reported complete        06610000
*                                      push-operation count. The        06611000
*                                      number of push operations that   06612000
*                                      have completed and been          06613000
*                                      reported as complete to the      06614000
*                                      primary structure. (CFLEVEL      06615000
*                                      21)                       @LWA*/ 06616000
*         5    IxlyamdaDup_CQSC FIXED(32), /* Secondary queue stall     06617000
*                                      count. The number of stalls in   06618000
*                                      the processing of the secondary  06619000
*                                      operation queue. A stall occurs  06620000
*                                      whenever the operation           06621000
*                                      identified by the HEOSN is       06622000
*                                      completed and at least one       06623000
*                                      queue element with a higher      06624000
*                                      valued OSN than the HEOSN        06625000
*                                      exists that has not been         06626000
*                                      processed. (CFLEVEL 21)   @LWA*/ 06627000
*         5    *        CHAR(4),    /* Reserved                  @LWA*/ 06628000
*         5    IxlyamdaDup_PDTFM FIXED(64), /* Primary delay time 1st   06629000
*                                      moment. The accumulated primary  06630000
*                                      delay times, in microseconds,    06631000
*                                      for push operations. The         06632000
*                                      primary delay time is the        06633000
*                                      elapsed time in the primary CF   06634000
*                                      between the assignment of the    06635000
*                                      operation to the queue buffer    06636000
*                                      and the first attempt to send    06637000
*                                      the operation to the secondary   06638000
*                                      CF. (CFLEVEL 21)          @LWA*/ 06639000
*         5    IxlyamdaDup_PDTSM FIXED(64), /* Primary delay time 2nd   06640000
*                                      moment. The accumulated          06641000
*                                      squares of primary delay         06642000
*                                      times, in squared-microsecond    06643000
*                                      units, for push operations.      06644000
*                                      (CFLEVEL 21)              @LWA*/ 06645000
*         5    IxlyamdaDup_PMDTFM FIXED(64), /* Push message delay      06646000
*                                      time 1st moment. The             06647000
*                                      accumulated push message delay   06648000
*                                      times, in microseconds, for      06649000
*                                      push operations. The push        06650000
*                                      message delay time is the        06651000
*                                      elapsed time from the first      06652000
*                                      attempt to send the push         06653000
*                                      operation in the primary CF to   06654000
*                                      the time that the secondary CF   06655000
*                                      assigns the push operation to a  06656000
*                                      secondary queue entry.           06657000
*                                      (CFLEVEL 21)              @LWA*/ 06658000
*         5    IxlyamdaDup_PMDTSM FIXED(64), /* Primary message delay   06659000
*                                      time 2nd moment. The             06660000
*                                      accumulated squares of push      06661000
*                                      message delay times, in          06662000
*                                      squared-microsecond units, for   06663000
*                                      push operations. (CFLEVEL 21)    06664000
*                                                                @LWA*/ 06665000
*         5    IxlyamdaDup_CQDTFM FIXED(64), /* Secondary queue delay   06666000
*                                      time 1st moment. The             06667000
*                                      accumulated queue delay times,   06668000
*                                      in microseconds, for push        06669000
*                                      operations. The queue delay      06670000
*                                      time is the elapsed time from    06671000
*                                      the time the push operation is   06672000
*                                      assigned to a secondary queue    06673000
*                                      entry to the time of completion  06674000
*                                      of the push operation.           06675000
*                                      (CFLEVEL 21)              @LWA*/ 06676000
*         5    IxlyamdaDup_CQDTSM FIXED(64), /* Secondary queue delay   06677000
*                                      time 2nd moment. The             06678000
*                                      accumulated squares of           06679000
*                                      secondary queue delay times, in  06680000
*                                      squared-microsecond units, for   06681000
*                                      push operations. (CFLEVEL 21)    06682000
*                                                                @LWA*/ 06683000
*         5    IxlyamdaDup_CQSTFM FIXED(64), /* Secondary queue stall   06684000
*                                      time 1st moment. The             06685000
*                                      accumulated secondary queue      06686000
*                                      stall times, in microseconds,    06687000
*                                      for push operations. The         06688000
*                                      secondary queue stall time is    06689000
*                                      the elapsed time from the time   06690000
*                                      the operation identified by the  06691000
*                                      HEOSN is completed in the        06692000
*                                      secondary structure with one or  06693000
*                                      more uncompleted operations to   06694000
*                                      the time when the HEOSN is       06695000
*                                      advanced.  (CFLEVEL 21)   @LWA*/ 06696000
*         5    IxlyamdaDup_CQSTSM FIXED(64), /* Secondary queue stall   06697000
*                                      time 2nd moment. The             06698000
*                                      accumulated squares of           06699000
*                                      secondary queue stall times, in  06700000
*                                      squared-microsecond units, for   06701000
*                                      push operations. (CFLEVEL 21)    06702000
*                                                                @LWA*/ 06703000
*         5    IxlyamdaDup_SCDTFM FIXED(64), /* Secondary reported      06704000
*                                      completion delay time 1st        06705000
*                                      moment. The accumulated          06706000
*                                      secondary reported completion    06707000
*                                      delay times, in microseconds,    06708000
*                                      for push operations.  The        06709000
*                                      secondary reported completion    06710000
*                                      delay time is the elapsed time,  06711000
*                                      in the secondary CF, from the    06712000
*                                      time the push operation          06713000
*                                      completes in the secondary to    06714000
*                                      the time that the completion of  06715000
*                                      the OSN is reported to the       06716000
*                                      primary. (CFLEVEL 21)     @LWA*/ 06717000
*         5    IxlyamdaDup_SCDTSM FIXED(64), /* Secondary reported      06718000
*                                      completion delay time 2nd        06719000
*                                      moment. The accumulated          06720000
*                                      squares of secondary reported    06721000
*                                      completion delay times, in       06722000
*                                      squared-microsecond units, for   06723000
*                                      push operations. (CFLEVEL 21)    06724000
*                                                                @LWA*/ 06725000
*         5    IxlyamdaDup_PRDTFM FIXED(64), /* Push response delay     06726000
*                                      time 1st moment. The             06727000
*                                      accumulated push response delay  06728000
*                                      times, in microseconds, for      06729000
*                                      push operations. The push        06730000
*                                      response delay time is the       06731000
*                                      elapsed time from the launch of  06732000
*                                      the operation response in the    06733000
*                                      secondary CF to the time that    06734000
*                                      the primary CF recognizes the    06735000
*                                      response. (CFLEVEL 21)    @LWA*/ 06736000
*         5    IxlyamdaDup_PRDTSM FIXED(64), /* Push response delay     06737000
*                                      time 2nd moment. The             06738000
*                                      accumulated squares of push      06739000
*                                      response delay times, in         06740000
*                                      squared-microsecond units, for   06741000
*                                      push operations. (CFLEVEL 21)    06742000
*                                                                @LWA*/ 06743000
*         5    IxlyamdaDup_PODTFM Fixed(64),  /* Push operation         06744000
*                                      delay time 1st moment.  The      06745000
*                                      accumulated push operation       06746000
*                                      delay time, in microseconds,     06747000
*                                      for push operations.  The push   06748000
*                                      operation delay time is the      06749000
*                                      elapsed time from the time       06750000
*                                      when the primary CF queues       06751000
*                                      the operation for push to the    06752000
*                                      secondary to the time when the   06753000
*                                      secondary CF queues the          06754000
*                                      pushed operation for             06755000
*                                      processing. (CFLEVEL 21)  @LXA*/ 06756000
*         5    IxlyamdaDup_PODTSM Fixed(64),  /* Push operation         06757000
*                                      delay time 2nd moment.  The      06758000
*                                      accumulated squares of push      06759000
*                                      operation delay times, in        06760000
*                                      squared-microsecond units, for   06761000
*                                      push operations. (CFLEVEL 21)    06762000
*                                                                @LXA*/ 06763000
*         5    IxlyamdaDup_SPDTFM Fixed(64),  /* Secondary processed    06764000
*                                      delay time 1st moment.  The      06765000
*                                      accumulated secondary processed  06766000
*                                      delay time, in microseconds,     06767000
*                                      for push operations.  The        06768000
*                                      secondary processed delay time   06769000
*                                      is the elapsed time from the     06770000
*                                      time when the primary CF         06771000
*                                      queues the operation for push    06772000
*                                      to the secondary to the time     06773000
*                                      when the secondary CF applies    06774000
*                                      the pushed update to the         06775000
*                                      secondary structure.             06776000
*                                      (CFLEVEL 21)              @LXA*/ 06777000
*         5    IxlyamdaDup_SPDTSM Fixed(64),  /* Secondary processed    06778000
*                                      delay time 2nd moment.  The      06779000
*                                      accumulated squares of secondary 06780000
*                                      processed delay times, in        06781000
*                                      squared-microsecond units, for   06782000
*                                      push operations. (CFLEVEL 21)    06783000
*                                                                @LXA*/ 06784000
*       3    *        CHAR(40);     /* Reserved                  @LXC*/ 06785000
*                                                                       06786000
*/********************************************************************/ 06787000
*/*****************Structure types************************************/ 06788000
*/********************************************************************/ 06789000
*                                                                       06790000
*   DECLARE                                                             06791000
*     IXLYAMDA_LIST BIT(8) CONSTANT('03'X), /* List structure    @P1A*/ 06792000
*     IXLYAMDA_CACHE BIT(8) CONSTANT('04'X), /* Cache Structure  @P1A*/ 06793000
*     IXLYAMDA_LOCK BIT(8) CONSTANT('FF'X); /* Lock Structure    @L3A*/ 06794000
*                                                                       06795000
*                                                                       06796000
*/*****************Channel Path Types*********************************/ 06797000
*/********************************************************************/ 06798000
*                                                                       06799000
*   DECLARE                                                             06800000
*     IXLYAMDA_CHPIDTYPE_CFS  BIT(8) CONSTANT('0B'X), /* CHPID TYPE for 06801000
*                                        CF Sender chpid         @06A*/ 06802000
*     IXLYAMDA_CHPIDTYPE_CFR  BIT(8) CONSTANT('0C'X), /* CHPID TYPE for 06803000
*                                        CF Receiver chpid       @PLA*/ 06804000
*     IXLYAMDA_CHPIDTYPE_CBS  BIT(8) CONSTANT('16'X), /* CHPID TYPE for 06805000
*                                        CF Cluster Bus Sender   @06A*/ 06806000
*     IXLYAMDA_CHPIDTYPE_CBR  BIT(8) CONSTANT('17'X), /* CHPID TYPE for 06807000
*                                        CF Cluster Bus Receiver @06A*/ 06808000
*     IXLYAMDA_CHPIDTYPE_ICS  BIT(8) CONSTANT('18'X), /* CHPID TYPE for 06809000
*                                        CF Internal Coupling Sender    06810000
*                                                                @06A*/ 06811000
*     IXLYAMDA_CHPIDTYPE_ICR  BIT(8) CONSTANT('19'X), /* CHPID TYPE for 06812000
*                                        CF Internal Coupling Receiver  06813000
*                                                                @PLA*/ 06814000
*     IXLYAMDA_CHPIDTYPE_CBP  BIT(8) CONSTANT('21'X), /* CHPID TYPE for 06815000
*                                        CF Integrated Cluster Bus Peer 06816000
*                                                                @06A*/ 06817000
*     IXLYAMDA_CHPIDTYPE_CFP  BIT(8) CONSTANT('22'X), /* CHPID TYPE for 06818000
*                                        CF Peer chpid           @06A*/ 06819000
*     IXLYAMDA_CHPIDTYPE_ICP  BIT(8) CONSTANT('23'X), /* CHPID TYPE for 06820000
*                                        CF Internal Coupling Peer      06821000
*                                                                @06A*/ 06822000
*     IXLYAMDA_CHPIDTYPE_CIB  BIT(8) CONSTANT('26'X), /* CHPID TYPE for 06823000
*                                      CIB Coupling Link         @0CA*/ 06824000
*     IXLYAMDA_CHPIDTYPE_CS5  BIT(8) CONSTANT('33'X), /* CHPID TYPE for 06825000
*                                      CS5 (coupling over PCIe)         06826000
*                                      link                      @10C*/ 06827000
*     IXLYAMDA_CHPIDTYPE_CL5  BIT(8) CONSTANT('34'X); /* CHPID TYPE for 06828000
*                                      CL5 (coupling over RoCE)         06829000
*                                      link                      @10A*/ 06830000
*/********************************************************************/ 06831000
*/* Channel path operational modes                               @LNA*/ 06832000
*/********************************************************************/ 06833000
*Declare                                                                06834000
*IXLYAMDA_PathMode_CFP_1Gbit Fixed(8)                                   06835000
*     Constant('01'x),              /* CFP path supporting a            06836000
*                                      1.0625 Gbit / sec data           06837000
*                                      rate                      @LNA*/ 06838000
*IXLYAMDA_PathMode_CFP_2Gbit Fixed(8)                                   06839000
*     Constant('02'x),              /* CFP path supporting a            06840000
*                                      2.125 Gbit / sec data            06841000
*                                      rate                      @LNA*/ 06842000
*IXLYAMDA_PathMode_CIB_1X_IFB_HCA2_O_LR Fixed(8)                        06843000
*     Constant('10'x),              /* CIB path operating at 1X         06844000
*                                      bandwidth using the IFB          06845000
*                                      protocol, adapter type           06846000
*                                      HCA2-O LR                 @LNA*/ 06847000
*IXLYAMDA_PathMode_CIB_12X_IFB_HCA2_O Fixed(8)                          06848000
*     Constant('11'x),              /* CIB path operating at 12X        06849000
*                                      bandwidth using the IFB          06850000
*                                      protocol, adapter type           06851000
*                                      HCA2-O                    @LNA*/ 06852000
*IXLYAMDA_PathMode_CIB_1X_IFB_HCA3_O_LR Fixed(8)                        06853000
*     Constant('20'x),              /* CIB path operating at 1X         06854000
*                                      bandwidth using the IFB          06855000
*                                      protocol, adapter type           06856000
*                                      HCA3-O LR                 @LNA*/ 06857000
*IXLYAMDA_PathMode_CIB_12X_IFB_HCA3_O Fixed(8)                          06858000
*     Constant('21'x),              /* CIB path operating at 12X        06859000
*                                      bandwidth using the IFB          06860000
*                                      protocol, adapter type           06861000
*                                      HCA3-O                    @LNA*/ 06862000
*IXLYAMDA_PathMode_CIB_12X_IFB3_HCA3_O Fixed(8)                         06863000
*     Constant('30'x),              /* CIB path operating at 12X        06864000
*                                      bandwidth using the IFB3         06865000
*                                      protocol, adapter type           06866000
*                                      HCA3-O                    @LNA*/ 06867000
*IXLYAMDA_PathMode_CS5_8X_Gen3_PCIe_O_SR Fixed(8)                       06868000
*     Constant('40'x),              /* CS5 path operating at 8X         06869000
*                                      bandwidth using the third        06870000
*                                      generation PCIe protocol  @10C*/ 06871000
*IXLYAMDA_PathMode_CL5_10Gb_RoCE_LR      Fixed(8)                       06872000
*     Constant(50x);                /* CL5 path operating at 10 Gigabit 06873000
*                                      per second bandwidth over        06874000
*                                      Converged Enhanced Ethernet      06875000
*                                      protocol                  @10A*/ 06876000
*/********************************************************************/ 06877000
*/* Storage-class memory algorithm types                         @LQA*/ 06878000
*/********************************************************************/ 06879000
*Declare                                                                06880000
*IXLYAMDA_SCMAT_KeyPriority1 Fixed(8)                                   06881000
*     Constant('01'x);              /* KeyPriority1 algorithm    @LQA*/ 06882000
*                                                                       06883000
*/********************************************************************/ 06884000
*/* Duplexing type values                                        @LXA*/ 06885000
*/********************************************************************/ 06886000
*Declare                                                                06887000
*IXLYAMDA_DPLXT_Synchronous Bit(2)                                      06888000
*     Constant('00'b),              /* Synchronous duplexing     @LXA*/ 06889000
*                                                                       06890000
*IXLYAMDA_DPLXT_AsynchronousPri Bit(2)                                  06891000
*     Constant('01'b),              /* Asynchronous duplexing,          06892000
*                                      primary structure         @LXA*/ 06893000
*                                                                       06894000
*IXLYAMDA_DPLXT_AsynchronousSec Bit(2)                                  06895000
*     Constant('10'b);              /* Asynchronous duplexing,          06896000
*                                      secondary structure       @LXA*/ 06897000
*                                                                       06898000
*                                                                       06899000
*/* End of PL/X Source                                               */ 06900000
* %IF IXLYAMDA_LIST = 'NO' !                                            06901000
*    ZCBPRINT = 'NO' %THEN                                              06902000
* %DO;                                                                  06903000
*   @LIST POP NOECHO;                                                   06904000
* %END;                                                                 06905000
* %END;                                                                 06906000
