*                                                                       00001000
* %DCL IXLYDLIC_INCLUDED CHAR EXT;                                      00002000
* %DEACTIVATE IXLYDLIC_INCLUDED;                                        00003000
* %IF IXLYDLIC_INCLUDED = '' %THEN                                      00004000
* %DO;                                                                  00005000
*/* Macro made bi-lingual on 18346. CBGEN compile date 15295         */ 00006000
*% /*                                                                   00007000
         MACRO                                                          00008000
         IXLYDLIC &DSECT=YES,&LIST=YES,&TITLE=YES,&DLIC=YES,           *00009000
               &DLICDUPLEXINGCONTROLS=COND,                            *00010000
               &DLICEXTSTRUCTURECONTROLS=COND                           00011000
         GBLC  &IXLYDLIC_INCLUDED                                       00012000
         GBLC  &ZCBPRINT                                                00013000
&IXLYDLIC_INCLUDED SETC 'YES'                                           00014000
         AIF   ('&LIST' EQ 'NONE').P0                                   00015000
         AIF   ('&TITLE' EQ 'NO').P5                                    00016000
 TITLE   'IXLYDLIC  - Dumping List Structure Controls Mapping        '  00017000
.P5      ANOP                                                           00018000
**/ IXLYDLIC_1:;                                                        00019000
*/* START OF SPECIFICATIONS ******************************************* 00020000
*                                                                       00021000
*01* PROPRIETARY STATEMENT:                                             00022000
*                                                                       00023000
*     LICENSED MATERIALS - PROPERTY OF IBM                              00024000
*     5650-ZOS COPYRIGHT IBM CORP. 1993, 2017                           00025000
*                                                                       00026000
* STATUS= HBB77B0                                                       00027000
*                                                                       00028000
*01* EXTERNAL CLASSIFICATION: GUPI                                      00029000
*01* END OF EXTERNAL CLASSIFICATION:                                    00030000
*                                                                       00031000
*01* DESCRIPTIVE NAME:  Dumping List Structure Controls Mapping         00032000
*02*  ACRONYM:  DLIC                                                    00033000
*                                                                       00034000
*01* MACRO NAME:  IXLYDLIC                                              00035000
*                                                                       00036000
*01* DSECT NAME:                                                        00037000
*     DLIC                                                              00038000
*                                                                       00039000
*01* COMPONENT:  Cross System Extended Services (SCIXL)                 00040000
*                                                                       00041000
*01* EYE-CATCHER:  None                                                 00042000
*02*  OFFSET:  N/A                                                      00043000
*02*  LENGTH:  N/A                                                      00044000
*                                                                       00045000
*01* STORAGE ATTRIBUTES:                                                00046000
*02*  SUBPOOL:  User Defined                                            00047000
*02*  KEY:  User Defined                                                00048000
*02*  RESIDENCY:  User Defined                                          00049000
*                                                                       00050000
*01* SIZE:                                                              00051000
*           DLICEXTSTRUCTURECONTROLS -- X'0200' bytes                   00052000
*           DLICDUPLEXINGCONTROLS    -- X'003C' bytes                   00053000
*           DLIC                     -- X'0100' bytes                   00054000
*                                                                       00055000
*01* CREATED BY:  The IXLZSTR CF Structure Data Access Service in the   00056000
*                 user defined ANSAREA                                  00057000
*                                                                       00058000
*01* POINTED TO BY: User                                                00059000
*                                                                       00060000
*01* SERIALIZATION:                                                     00061000
*     None required                                                     00062000
*                                                                       00063000
*01* FUNCTION:                                                          00064000
*     Provides a map of the dumping List Structure controls.            00065000
*                                                                       00066000
*01* METHOD OF ACCESS:                                                  00067000
*                                                                       00068000
*     ASM:                                                              00069000
*         IXLYDLIC                                                      00070000
*     PL/AS:                                                            00071000
*         %dcl ListStrControlsAttr char                                 00072000
*         %ListStrControlsAttr = 'based/defined/via attributes'         00073000
*         %INCLUDE SYSLIB(IXLYDLIC)                                     00074000
*                                                                       00075000
*         If the ListStrControlsAttr macro variable is not set,         00076000
*         the associated mapping will be declared as based.             00077000
*                                                                       00078000
*01* DELETED BY:  N/A                                                   00079000
*                                                                       00080000
*01* FREQUENCY:  N/A                                                    00081000
*                                                                       00082000
*01* DEPENDENCIES:  N/A                                                 00083000
*                                                                       00084000
*01* DISTRIBUTION LIBRARY:                                              00085000
*     AMACLIB                                                           00086000
*                                                                       00087000
*01* CHANGE ACTIVITY:                                                   00088000
*     $L0= SYSLKDFM HBB5510 920518 PD00LA: XLS Initial Release          00089000
*     $D1= DIG0036  HBB5510 930114 PD00LA: Architecture upgrade         00090000
*     $P1= PIG5027  HBB5510 940105 PD00FR: Update descriptions          00091000
*     $L1= DNXES    HBB5520 940414 PD00FR: XES Dynamic Reconfig         00092000
*     $P2= PIG5539  HBB5510 940722 PD00LA: Change the maximum data list 00093000
*                                          entry size from a BIT(5)     00094000
*                                          field to a FIXED(8) field    00095000
*     $D2= DN70092  HBB5520 940815 PD00EA: MAXELEMNUM up to 255         00096000
*     $01= OW15589  HBB5520 960212 PD00FR: Event monitoring support     00097000
*     $02= OW24532  HBB5520 970220 PD00XM: EMC dumping support          00098000
*     $L2= AUTOR    HBB6608 980831 PD00GW: Auto Rebuild                 00099000
*     $L3= MQ       JBB6609 990114 PD00DT: MQSeries Support             00100000
*     $L4= DUPLX    Hbb7705 000821 PD00GW: CF Duplexing                 00101000
*     $P3= PYV0403  HBB7707 020218 PD002F: OW53548 support              00102000
*     $03= OW55969  HBB7705 020930 PD002F: Add WRTCLI to the list       00103000
*                                          structure controls           00104000
*     $L5=DUPDS     HBB7740 060512 PD00BJ: AM Updated for CFLEVEL=15    00105000
*     $P4=ME08517   HBB7740 061120 PD00BN: Correct copyright statement  00106000
*     $L6=DUPDS     HBB7740 070314 PD00BJ: Doubleword SXTIME            00107000
*     $L7=DUPDS2    HBB7750 070320 PD00OF: Immediate RTC support        00108000
*     $L8=CFSMQ     HBB7750 070629 PD00P9: XES Shared Message Queue     00109000
*                                          Notification Enhancements    00110000
*     $04=OA25130   HBB7709 080831 PD00BN: Immediate RTC completion     00111000
*     $L9=CFFLASH   HBB7790 120301 PD00C9: Cf Flash                     00112000
*     $LA=CFFLASH   HBB7790 121031 PD00C9: MSBEC, MSBELC                00113000
*     $LB=CFFLASH   HBB7790 130201 PD00OF: Cf Flash                     00114000
*     $05=OA40747   HBB7780 140210 PD00OF: Cf Flash                     00115000
*     $LC=LSTNOT    HBB77B0 150410 PD00C9: List Notification            00116000
*                                          Enhancements                 00117000
*     $LD=OA56345   HBB7790 181212 PD00MP: CFLEVEL24 Toleration (FLM2)  00118000
*                                                                       00119000
* END OF SPECIFICATIONS *********************************************/  00120000
*% /*                                                                   00121000
.P0      ANOP                                                           00122000
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 00123000
         AIF   ('&LIST' EQ 'YES').P2                                    00124000
.P1      ANOP                                                           00125000
         PUSH  PRINT                                                    00126000
         PRINT OFF                                                      00127000
.P2      ANOP                                                           00128000
         AIF   ('&DLIC' EQ 'NO').L0002                                  00129000
         AIF   ('&DSECT' EQ 'YES').L0003                                00130000
         AIF   ('&DLIC' NE 'YES').L0002                                 00131000
.L0003   ANOP                                                           00132000
*                                                                       00133000
* ****************************************************************** *  00134000
* *                                                                  *  00135000
* *              Dumping List Structure Controls                     *  00136000
* *                                                                  *  00137000
* ****************************************************************** *  00138000
*                                                                       00139000
*                                                                       00140000
         AIF   ('&DSECT' EQ 'YES').L0004                                00141000
DLIC     DS    0F        Mapping for List Structure controls            00142000
         AGO   .L0005                                                   00143000
.L0004   ANOP                                                           00144000
DLIC     DSECT           Mapping for List Structure controls            00145000
.L0005   ANOP                                                           00146000
         DS    CL23      Reserved                                       00147000
DLICFLAGBYTE3 DS 0CL1    Flag Byte 3 (LEVEL1)                           00148000
DLICDUPLEXINGSTATE EQU X'80' Duplexing State - Indicates that a        *00149000
                         structure is in a state of being duplexed     *00150000
                         (LEVEL11)                                      00151000
DLICWAITONREADYTOCOMP EQU X'40' Wait on ready to complete list         *00152000
                         indicator - Indicates the sending of the RTC  *00153000
                         signal is delayed until the RTC is received.  *00154000
                         During this time no resources can be held for *00155000
                         the list item being processed (LEVEL11)        00156000
DLICIRTCEI EQU X'20'     Indicates enablement of Immediate RTC         *00157000
                         Completion. (LEVEL16)                          00158000
DLICMI   EQU   X'08'     MASTER indicater, (level24)                    00159000
DLICMONREAPPINPROGRESS EQU X'04' Monitor reapportionment in progress   *00160000
                         indicator (LEVEL4). 1 indicates that the list *00161000
                         structure monitor to entry storage ratio is   *00162000
                         being reapportioned. 0 indicates that the     *00163000
                         list structure monitor to entry storage ratio *00164000
                         is not being reapportioned.                    00165000
DLICREAPPINPROGRESS EQU X'02' Entry reapportionment in progress        *00166000
                         indicator (LEVEL1). 1 indicates that the list *00167000
                         structure entry to element storage ratio is   *00168000
                         being reapportioned. 0 indicates that the     *00169000
                         list structure entry to element storage ratio *00170000
                         is not being reapportioned.                    00171000
DLICSIZECHNGINPROGRESS EQU X'01' Structure size change in progress     *00172000
                         indicator (LEVEL1)                             00173000
         ORG   DLICFLAGBYTE3+1                                          00174000
DLICMAXDTLSTENTSIZE DS X Maximum data list entry size - specifies the  *00175000
                         maximum size of a data list entry as an       *00176000
                         integral multiple of the list element size.   *00177000
                         The valid values are 1-255                     00178000
DLICFLAGBYTE2 DS 0CL1    Flag Byte 2                                    00179000
DLICLISTSTRTYPE DS 0B    List Structure type - indicates the list      *00180000
                         objects created on allocation                  00181000
DLICLISTSTR_SKI EQU X'80' Secondary key indicator bit 0 0 ==>          *00182000
                         Secondary keys are not supported. 1 ==>       *00183000
                         Secondary keys are supported. (LEVEL9)         00184000
DLICLISTSTR_PLEIDI EQU X'40' PLEID indicator, bit 1 - 0 indicates that *00185000
                         the structure supports programmable list      *00186000
                         entry identifiers. (LEVEL8)                    00187000
DLICLISTSTR_CI EQU X'20' Counter indicator, bit 2 - 0 indicates that   *00188000
                         the list entry count and list entry count     *00189000
                         limit are defined. 1 indicates that the list  *00190000
                         element count and list element count limit    *00191000
                         are defined                                    00192000
DLICLISTSTR_LOCK EQU X'10' Locks requested, bit 3 - 0 indicates that   *00193000
                         no lock table is allocated. 1 indicates that  *00194000
                         a lock table is allocated                      00195000
DLICLISTSTR_DATA EQU X'08' Data requested, bit 4 - 0 indicates that    *00196000
                         the list entries do not have data. 1          *00197000
                         indicates that the list entries do have data   00198000
DLICLISTSTR_ADJ EQU X'04' Adj requested, bit 5 - 0 indicates that the  *00199000
                         list entries do not have adjunct data. 1      *00200000
                         indicates that the list entries so do have    *00201000
                         adjunct data                                   00202000
DLICLISTSTR_NSR EQU X'02' Name support, bit 6 - 0 indicates that the   *00203000
                         list entries are not named. 1 indicates that  *00204000
                         the list entries are named                     00205000
DLICLISTSTR_KSR EQU X'01' Key support, bit 7 - 0 indicates that the    *00206000
                         list entries are not keyed. 1 indicates that  *00207000
                         the list entries are keyed                     00208000
         ORG   DLICFLAGBYTE2+1                                          00209000
DLICLKTBLENTCHAR DS X    Lock-table-entry characteristic - specifies   *00210000
                         the number of bytes in each lock table entry. *00211000
                         This is ignored if a lock table is not        *00212000
                         created                                        00213000
DLICLSTELEMCHAR DS X     List element characteristic - specifies the   *00214000
                         number of bytes in each element                00215000
DLICMINSTRSIZE DS F      Minimum Structure Size - specifies the        *00216000
                         minimum number of 4K units of facility        *00217000
                         storage that can be allocated for the list    *00218000
                         with the requested attributes. Note that the  *00219000
                         structure can be allocated smaller than this, *00220000
                         but if so, structure attributes such as the   *00221000
                         entry/element ratio will differ significantly *00222000
                         from those which were requested.               00223000
DLICLKTBLENTCT DS F      Lock-table-entry count - specifies the number *00224000
                         of lock table entries allocated. This is      *00225000
                         ignored if a lock table is not created         00226000
DLICLISTCT DS  F         List count - specifies the number of lists    *00227000
                         created                                        00228000
DLICSTRSIZE DS F         Structure size - specifies the number of 4K   *00229000
                         units of facility storage allocated for the   *00230000
                         structure                                      00231000
DLICMAXSTRSIZE DS F      Maximum Structure size - specifies the max    *00232000
                         number of of 4K units of storage blocks that  *00233000
                         can be allocated                               00234000
DLICTGTSTRSIZE DS F      Target Structure Size - specifies the target  *00235000
                         number of 4K units for facility storage to be *00236000
                         allocated for the list                         00237000
DLICTGTMAXELEMCT DS F    Target Maximum element count - specifies the  *00238000
                         target for the maximum number of list         *00239000
                         elements that are available for assignment to *00240000
                         list entries or retry data blocks, or both     00241000
DLICTGTMAXENTRYCT DS F   Target Maximum Entry Count - specifies the    *00242000
                         target for the maximum number of possible     *00243000
                         list entries in a list structure               00244000
DLICMAXLSTSTRELEMCT DS F Maximum list structure element count -        *00245000
                         specifies the max number of list elements     *00246000
                         that are available for assignment to list     *00247000
                         entries. This count is only substantially     *00248000
                         accurate.                                      00249000
DLICLSTSTRELEMCT DS F    List Structure element count - specifies the  *00250000
                         number of list elements that have been        *00251000
                         assigned to list entries.                      00252000
DLICNZLKTBLENTCT DS F    Nonzero lock-table-entry count - specifies    *00253000
                         the number of nonzero lock table entries that *00254000
                         exist in the structure. This is ignored if    *00255000
                         the lock table is not created                  00256000
DLICMAXLSTENTCT DS F     Maximum list-structure-entry- count -         *00257000
                         specifies the maximum number of possible list *00258000
                         entries in a list structure. This count is    *00259000
                         only substantially accurate.                   00260000
DLICLSTENTCT DS F        List-structure-entry count - specifies the    *00261000
                         number of existing list entries in the list   *00262000
                         structure                                      00263000
DLICSTRAUTH DS CL16      Structure Authority - A 16 byte value         *00264000
                         associated with each bit in the SID vector     00265000
DLICUSRSTRCNTL DS CL32   User Structure Control - a 32 byte field      *00266000
                         defined by the user                            00267000
DLICUIDVECTOR DS BL32    UID Vector - A bit string with an initial     *00268000
                         value of zero. A bit is set to one when a     *00269000
                         user is assigned with a user ID of i. The bit *00270000
                         at position i is set to 0 when the user is    *00271000
                         unassigned                                     00272000
DLICPENDENTTOELEMRATIO DS 0F Pending entry to element ratio (LEVEL1)    00273000
DLICPENDENTTOELEMENT DS H Pending entry to element ratio, entry        *00274000
                         portion (LEVEL1)                               00275000
DLICPENDENTTOELEMELEM DS H Pending entry to element ratio, element     *00276000
                         portion (LEVEL1)                               00277000
DLICMARGINALSTRSIZE DS F Marginal structure size - true minimum size   *00278000
                         with which the structure can be allocated     *00279000
                         (LEVEL1)                                       00280000
DLICEMCCT DS   F         Event monitor controls count - the number of  *00281000
                         event monitor controls objects which are      *00282000
                         currently in use in the structure (LEVEL3)     00283000
DLICMAXEMCCT DS F        Maximum event monitor controls count - the    *00284000
                         maximum number of event monitor controls, as  *00285000
                         currently allocated in the structure (LEVEL3)  00286000
DLICTGTMAXEMCCT DS F     Target maximum event monitor controls count - *00287000
                         the target maximum number of event monitor    *00288000
                         controls (LEVEL3)                              00289000
DLICPENDMONTOENTRATIO DS 0F Pending monitor to entry storage ratio     *00290000
                         (LEVEL 4)                                      00291000
DLICPENDMONTOENTMON DS H Pending monitor to entry ratio, monitor       *00292000
                         portion (LEVEL4)                               00293000
DLICPENDMONTOENTENT DS H Pending monitor to entry ratio, entry portion *00294000
                         (LEVEL4)                                       00295000
DLICLISTSETCURSOR DS F   List Set Cursor storage ratio (LEVEL 8)        00296000
DLICSTRCOPYCNTLVERSION DS F Structure copy controls version number     *00297000
                         (LEVEL 8)                                      00298000
DLICEXTUSERSTRCONTROLS DS CL32 Extended user structure controls (LEVEL *00299000
                         8)                                             00300000
DLICMAXIMUMUSERID DS CL1 Maximum User Identifier (LEVEL10)              00301000
         DS    CL7       Reserved                                       00302000
DLICSLND DS    F         Subsidiary list notification delay (SLND).    *00303000
                         Bit positions 0-31 correspond to bit          *00304000
                         positions 32-63 of the CPU timer. Bit 19      *00305000
                         represents one microsecond. (LEVEL16)          00306000
DLICOFFSET236 DS 0CL1    237th byte                                     00307000
DLICSSX  EQU   X'0F'     Signalling Segment Index - identifies the     *00308000
                         segment of the local signalling vector array  *00309000
                         that is used to receive duplexing signals for *00310000
                         the list structure that are initiated by the  *00311000
                         remote facility when duplexing is active.     *00312000
                         Zero when DLicIrtcei is OFF. (LEVEL16)         00313000
         ORG   DLICOFFSET236+1                                          00314000
DLICOFFSET237 DS 0CL1    238th byte                                     00315000
DLICDSSX EQU   X'0F'     Duplex Signalling Segment Index - identifies  *00316000
                         the segment of the remote-facility signalling *00317000
                         vector array that is the target of duplexing  *00318000
                         signals for the peer list structure when      *00319000
                         duplexing is active. Set when the structure   *00320000
                         is made duplexing active. Zero when           *00321000
                         DLicIrtcei is OFF. (LEVEL16)                   00322000
         ORG   DLICOFFSET237+1                                          00323000
DLICDRXL DS    H         Duplex retry index limit - specifies the      *00324000
                         maximum duplexing retry index value that is   *00325000
                         supported for duplexing signals targeted to   *00326000
                         the remote-facility duplexed list structure.  *00327000
                         Zero when DLicIrtcei is OFF. (LEVEL16)         00328000
DLICSTREXECUTIONTIME DS CL8 Time CF spent executing work related to    *00329000
                         this structure. (LEVEL15)                      00330000
DLICLNDELAY DS F         List Notification Delay. Bit positions 0-31   *00331000
                         correspond to bit positions 32-63 of the CPU  *00332000
                         timer. Bit 19 represents one microsecond.     *00333000
                         Bytes 248-251 (LEVEL22).                       00334000
DLICKRNDELAY DS F        Key Range Notification Delay. Bit positions   *00335000
                         0-31 correspond to bit positions 32-63 of the *00336000
                         CPU timer. Bit 19 represents one microsecond. *00337000
                         Bytes 252-255 (LEVEL22)                        00338000
DLIC_LEN EQU   *-DLIC                                                   00339000
.L0002   ANOP                                                           00340000
         AIF   ('&DLICDUPLEXINGCONTROLS' EQ 'NO').L0006                 00341000
         AIF   ('&DSECT' EQ 'YES').L0007                                00342000
         AIF   ('&DLICDUPLEXINGCONTROLS' NE 'YES').L0006                00343000
DLICDUPLEXINGCONTROLS DS 0X Duplexing controls from the dump header     00344000
         AGO   .L0008                                                   00345000
.L0007   ANOP                                                           00346000
DLICDUPLEXINGCONTROLS DSECT   Duplexing controls from the dump header   00347000
.L0008   ANOP                                                           00348000
DLICDUPCONNODEDESC DS CL32 node descriptor                              00349000
DLICDUPCONSTRUCTAUTH DS CL16 Structure authority                        00350000
DLICDUPCONSYSID DS CL8   System id                                      00351000
         DS    CL2       reserved                                       00352000
DLICDUPCONSTRUCTUREID DS CL2 Structure Id                               00353000
DLICDUPLEXINGCONTROLS_LEN EQU *-DLICDUPLEXINGCONTROLS                   00354000
.L0006   ANOP                                                           00355000
         AIF   ('&DLICEXTSTRUCTURECONTROLS' EQ 'NO').L0009              00356000
         AIF   ('&DSECT' EQ 'YES').L000A                                00357000
         AIF   ('&DLICEXTSTRUCTURECONTROLS' NE 'YES').L0009             00358000
.L000A   ANOP                                                           00359000
*                                                                       00360000
* ********************************************************************  00361000
* *                                                                  *  00362000
* *              Dumping Extended List Structure Controls            *  00363000
* *                                                                  *  00364000
* **************************************************************        00365000
*                                                                       00366000
*                                                                       00367000
         AIF   ('&DSECT' EQ 'YES').L000B                                00368000
DLICEXTSTRUCTURECONTROLS DS 0D Mapping for extended List Structure     *00369000
                         Controls (LEVEL19)                             00370000
         AGO   .L000C                                                   00371000
.L000B   ANOP                                                           00372000
DLICEXTSTRUCTURECONTROLS DSECT   Mapping for extended List Structure   *00373000
                         Controls (LEVEL19)                             00374000
.L000C   ANOP                                                           00375000
DLICEXTSTRCON_MXSCM DS FL8 Maximum storage-class memory the structure  *00376000
                         can use in 4K blocks                           00377000
DLICEXTSTRCON_SCMAT DS X SCM Algorithm Type                             00378000
DLICEXTSTRCON_SCMEUT DS X SCM expeditious upper threshold               00379000
DLICEXTSTRCON_SCMFT DS X SCM full threshold                             00380000
         DS    CL1       Reserved                                       00381000
DLICEXTSTRCON_MSBEC DS F The maximum number of list entries that can   *00382000
                         be stored in a single storage-class memory    *00383000
                         buffer                                         00384000
DLICEXTSTRCON_MSBELC DS F The maximum number of list elements that can *00385000
                         be stored in a single storage-class memory    *00386000
                         buffer                                         00387000
DLICEXTSTRCON_MNELC DS F Minimum element count                          00388000
DLICEXTSTRCON_MNEC DS F  Minimum entry count                            00389000
         DS    CL8       Reserved                                       00390000
DLICEXTSTRCON_FXAUS DS F Fixed augmented space in 4K blocks             00391000
         DS    CL4       Reserved                                       00392000
DLICEXTSTRCON_IUAUS DS F In-use augmented space in 4K blocks            00393000
DLICEXTSTRCON_IUSCM DS FL8 In-use storage-class memory by the          *00394000
                         structure in 4K blocks                         00395000
         DS    CL4       Reserved                                       00396000
DLICEXTSTRCON_EMXAUS DS F Estimated maximum space in 4K blocks that    *00397000
                         may be assigned as augmented space for the    *00398000
                         structure                                      00399000
DLICEXTSTRCON_EMSEC DS FL8 Estimated maximum number of list entries    *00400000
                         that may reside in storage-class memory for   *00401000
                         the structure                                  00402000
DLICEXTSTRCON_EMSELC DS FL8 Estimated maximum number of list elements  *00403000
                         that may reside in storage-class memory for   *00404000
                         the structure                                  00405000
DLICEXTSTRCON_SLSEC DS FL8 Number of existing structure list entries   *00406000
                         in the list set that reside in storage-class  *00407000
                         memory                                         00408000
DLICEXTSTRCON_SLSELC DS FL8 Number of existing structure list elements *00409000
                         in the list set that reside in storage-class  *00410000
                         memory                                         00411000
DLICEXTSTRCON_SCMLT DS X Percentage of the list entry and list element *00412000
                         counts that determines the lower threshold    *00413000
                         for migration between storage-class memory    *00414000
                         and CF storage                                 00415000
DLICEXTSTRCON_SCMUT DS X Percentage of the list entry and list element *00416000
                         counts that determines the upper threshold    *00417000
                         for migration from CF storage to              *00418000
                         storage-class memory                           00419000
DLICEXTSTRCON_SCMLTR DS X Percentage of the list entry and list        *00420000
                         element counts that determines the lower      *00421000
                         threshold regulator for migration between CF  *00422000
                         SCM and CF real storage. The lower threshold  *00423000
                         regulators are used to stop migration from CF *00424000
                         SCM into CF real storage after being          *00425000
                         triggered by the lower threshold               00426000
DLICEXTSTRCON_SCMUTR DS X Percentage of the list entry and list        *00427000
                         element counts that determines the upper      *00428000
                         threshold regulator for migration between CF  *00429000
                         real storage and CF SCM. The upper threshold  *00430000
                         regulators are used to stop migration from CF *00431000
                         real storage into CF SCM after being          *00432000
                         triggered by the upper threshold               00433000
DLICEXTSTRCON_SCMWC DS F SCM write count. Number of list write         *00434000
                         operations performed to storage class memory   00435000
DLICEXTSTRCON_SCMRFC DS F SCM read after fault count. The number of    *00436000
                         read operations against storage-class memory  *00437000
                         that were initiated by a reference to list    *00438000
                         structure objects residing on storage class   *00439000
                         memory                                         00440000
DLICEXTSTRCON_SCMRPC DS F SCM read for prefetch count. The number of   *00441000
                         read operations against storage-class memory  *00442000
                         that were initiated as a prefetch operation   *00443000
                         in order to retrieve list structure objects   *00444000
                         on storage-class memory that are expected to  *00445000
                         be referenced                                  00446000
DLICEXTSTRCON_SRSTFM DS FL8 The accumulated service times in           *00447000
                         microseconds for read operations to           *00448000
                         storage-class memory                           00449000
DLICEXTSTRCON_SRSTSM DS FL8 The accumulated squares of service times,  *00450000
                         in squared microsecond units for read         *00451000
                         operations to storage-class memory             00452000
DLICEXTSTRCON_SWSTFM DS FL8 The accumulated service times in           *00453000
                         microseconds for write operations to          *00454000
                         storage-class memory                           00455000
DLICEXTSTRCON_SWSTSM DS FL8 The accumulated squares of service times,  *00456000
                         in squared microsecond units, for write       *00457000
                         operations to storage class memory             00458000
DLICEXTSTRCON_SCMRBT DS FL8 SCM read bytes transferred. Number of      *00459000
                         bytes in 4K-byte units transferred from       *00460000
                         storage class memory to CF storage             00461000
DLICEXTSTRCON_SCMWBT DS FL8 SCM write bytes transferred. Number of     *00462000
                         bytes in 4K-byte units transferred from CF    *00463000
                         storage to storage-class memory                00464000
DLICEXTSTRCON_SAECC DS F SCM auxiliary enabled command count. Number   *00465000
                         of commands that required the use of CF       *00466000
                         auxiliary frames                               00467000
DLICEXTSTRCON_SRCC1C DS F SCM reference count 1 - The number of        *00468000
                         references against storage-class memory to    *00469000
                         locate list structure objects                  00470000
DLICEXTSTRCON_SRCC2C DS F SCM reference count 2 - The number of        *00471000
                         references against storage-class memory to    *00472000
                         resolve list entry key hashing                 00473000
DLICEXTSTRCON_SRCC3C DS F SCM reference count 3 - The number of        *00474000
                         references against storage-class for the      *00475000
                         purpose of migrating list structure objects   *00476000
                         from CF storage to storage-class memory to    *00477000
                         allow for the creation of new list structure  *00478000
                         objects in CF storage                          00479000
DLICEXTSTRCON_SRCC4C DS F SCM reference count 4 - The number of        *00480000
                         commands that were suppressed because         *00481000
                         storage-class memory migration was required   *00482000
                         to complete key-range initialization           00483000
         DS    CL332     Reserved                                       00484000
*                                                                       00485000
* ****************************************************************** *  00486000
* *                                                                  *  00487000
* *            Length Constants                                      *  00488000
* *                                                                  *  00489000
* ****************************************************************** *  00490000
*                                                                       00491000
*                                                                       00492000
KDLIC_LEN EQU  256       Length of DLIC                                 00493000
DLICEXTSTRUCTURECONTROLS_LEN EQU *-DLICEXTSTRUCTURECONTROLS             00494000
.L0009   ANOP                                                           00495000
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 00496000
         AIF   ('&LIST' EQ 'YES').P4                                    00497000
.P3      ANOP                                                           00498000
         POP   PRINT                                                    00499000
.P4      ANOP                                                           00500000
.P_EXIT  ANOP                                                           00501000
         MEND                                                           00502000
**/ IXLYDLIC_2:;                                                        00503000
* %IXLYDLIC_INCLUDED = 'YES';                                           00504000
* %DCL ZCBPRINT CHAR EXT;                                               00505000
* %DEACTIVATE ZCBPRINT;                                                 00506000
* %DCL IXLYDLIC_LIST CHAR EXT;                                          00507000
* %DEACTIVATE IXLYDLIC_LIST;                                            00508000
* %IF IXLYDLIC_LIST ^= 'NO' &                                           00509000
*    ZCBPRINT ^= 'NO' %THEN                                             00510000
*   %GOTO IXLYDLIC_3;                                                   00511000
*   @LIST PUSH NOECHO;                                                  00512000
*   @LIST NOASSEMBLE NOECHO;                                            00513000
*   @LIST OFF C NOECHO;                                                 00514000
* %IXLYDLIC_3:;                                                         00515000
*/* Start of PL/X Source                                             */ 00516000
*                                                                       00517000
* %IF ListStrControlsAttr = '' %THEN                                    00518000
*   %ListStrControlsAttr = 'based';                                     00519000
*                                                                       00520000
*/*******************************************************************/  00521000
*/*                                                                 */  00522000
*/*              Dumping List Structure Controls                    */  00523000
*/*                                                                 */  00524000
*/*******************************************************************/  00525000
*declare                                                                00526000
* 1   DLic char(256) bdy(word) ListStrControlsAttr, /* Mapping for      00527000
*                                      List Structure controls       */ 00528000
*   3   *                 char(23), /* Reserved                  @L1C*/ 00529000
*   3   DLicFlagByte3     char(1),  /* Flag Byte 3 (LEVEL1)      @L1A*/ 00530000
*     5   DlicDuplexingState     BIT(1), /* Duplexing State -           00531000
*                                      Indicates that a structure is    00532000
*                                      in a state of being duplexed     00533000
*                                      (LEVEL11)                 @P3C*/ 00534000
*     5   DlicWaitOnReadyToComp BIT(1), /* Wait on ready to complete    00535000
*                                      list indicator -  Indicates      00536000
*                                      the sending of the RTC signal    00537000
*                                      is delayed until the RTC is      00538000
*                                      received. During this time no    00539000
*                                      resources can be held for the    00540000
*                                      list item being processed        00541000
*                                      (LEVEL11)                 @03A*/ 00542000
*     5   DLicIrtcei BIT(1),        /* Indicates enablement of          00543000
*                                      Immediate RTC Completion.        00544000
*                                      (LEVEL16)                 @L7A*/ 00545000
*     5   *        BIT(1),          /* Reserved                  @LDC*/ 00546000
*     5   DLICMI   BIT(1),          /* MASTER indicater, (level24)      00547000
*                                                                @LDA*/ 00548000
*     5   DlicMonReappInProgress BIT(1), /* Monitor reapportionment in  00549000
*                                      progress indicator (LEVEL4).     00550000
*                                      1 indicates that the list        00551000
*                                      structure monitor to entry       00552000
*                                      storage ratio is being           00553000
*                                      reapportioned.  0 indicates      00554000
*                                      that the list structure monitor  00555000
*                                      to entry storage ratio is not    00556000
*                                      being reapportioned.      @02A*/ 00557000
*     5   DlicReappInProgress BIT(1),  /* Entry reapportionment in      00558000
*                                      progress indicator (LEVEL1).     00559000
*                                      1 indicates that the list        00560000
*                                      structure entry to element       00561000
*                                      storage ratio is being           00562000
*                                      reapportioned.  0 indicates      00563000
*                                      that the list structure entry    00564000
*                                      to element storage ratio is not  00565000
*                                      being reapportioned.      @L1A*/ 00566000
*     5   DlicSizeChngInProgress BIT(1), /* Structure size change in    00567000
*                                      progress indicator (LEVEL1)      00568000
*                                                                @L1A*/ 00569000
*   3   DLicMaxDtLstEntSize fixed(8),  /* Maximum data list entry       00570000
*                                         size - specifies the maximum  00571000
*                                      size of a data list entry as an  00572000
*                                      integral multiple of the list    00573000
*                                      element size.  The valid values  00574000
*                                      are 1-255                 @D2C*/ 00575000
*   3  DLicFlagByte2,               /* Flag Byte 2                   */ 00576000
*     5   DLicListStrType  bit(8),  /* List Structure type - indicates  00577000
*                                      the list objects created on      00578000
*                                      allocation                @L3C*/ 00579000
*       7  DLicListStr_SKI BIT(1),  /* Secondary key indicator bit 0    00580000
*                                      0 ==> Secondary keys are not     00581000
*                                      supported.  1 ==> Secondary keys 00582000
*                                      are supported.                   00583000
*                                      (LEVEL9)                  @L3A*/ 00584000
*       7  DLicListStr_PLEIDI bit(1), /* PLEID indicator, bit 1 - 0     00585000
*                                      indicates that the structure     00586000
*                                      supports programmable list       00587000
*                                      entry identifiers.               00588000
*                                      (LEVEL8)                  @L2A*/ 00589000
*       7  DLicListStr_CI  bit(1),  /* Counter indicator, bit 2 - 0     00590000
*                                      indicates that the list entry    00591000
*                                      count and list entry count limit 00592000
*                                      are defined. 1 indicates that    00593000
*                                      the list element count and list  00594000
*                                      element count limit are defined  00595000
*                                                                    */ 00596000
*       7  DLicListStr_Lock bit(1), /* Locks requested, bit 3 - 0       00597000
*                                      indicates that no lock table is  00598000
*                                      allocated.  1 indicates that a   00599000
*                                      lock table is allocated       */ 00600000
*       7  DLicListStr_Data bit(1), /* Data requested, bit 4 - 0        00601000
*                                      indicates that the list entries  00602000
*                                      do not have data. 1 indicates    00603000
*                                      that the list entries do have    00604000
*                                      data                          */ 00605000
*       7  DLicListStr_Adj  bit(1), /* Adj requested, bit 5 - 0         00606000
*                                      indicates that the list entries  00607000
*                                      do not have adjunct data.  1     00608000
*                                      indicates that the list entries  00609000
*                                      so do have adjunct data       */ 00610000
*       7  DLicListStr_NSR  bit(1), /* Name support, bit 6 - 0          00611000
*                                      indicates that the list entries  00612000
*                                      are not named.  1 indicates that 00613000
*                                      the list entries are named    */ 00614000
*       7  DLicListStr_KSR  bit(1), /* Key support, bit 7 - 0 indicates 00615000
*                                      that the list entries are not    00616000
*                                      keyed.  1 indicates that the     00617000
*                                      list entries are keyed        */ 00618000
*   3   DLicLkTblEntChar fixed(8),  /* Lock-table-entry characteristic  00619000
*                                      - specifies the number of bytes  00620000
*                                      in each lock table entry.  This  00621000
*                                      is ignored if a lock table is    00622000
*                                      not created                   */ 00623000
*   3   DLicLstElemChar  fixed(8),  /* List element characteristic -    00624000
*                                      specifies the number of bytes in 00625000
*                                      each element                  */ 00626000
*   3   DLicMinStrSize   fixed(32), /* Minimum Structure Size -         00627000
*                                      specifies the minimum number of  00628000
*                                      4K units of facility storage     00629000
*                                      that can be allocated for the    00630000
*                                      list with the requested          00631000
*                                      attributes.  Note that the       00632000
*                                      structure can be allocated       00633000
*                                      smaller than this,  but if so,   00634000
*                                      structure attributes such as     00635000
*                                      the entry/element ratio will     00636000
*                                      differ significantly from those  00637000
*                                      which were requested.     @P1C*/ 00638000
*   3   DLicLkTblEntCt    fixed(32), /* Lock-table-entry count -        00639000
*                                      specifies the number of lock     00640000
*                                      table entries allocated.  This   00641000
*                                      is ignored if a lock table is    00642000
*                                      not created                   */ 00643000
*   3   DLicListCt        fixed(32), /* List count - specifies the      00644000
*                                      number of lists created       */ 00645000
*   3   DLicStrSize       fixed(32), /* Structure size - specifies the  00646000
*                                      number of 4K units of facility   00647000
*                                      storage allocated for the        00648000
*                                      structure                     */ 00649000
*   3   DLicMaxStrSize    fixed(32),   /* Maximum Structure size -      00650000
*                                      specifies the max number of of   00651000
*                                      4K units of storage blocks that  00652000
*                                      can be allocated          @D1A*/ 00653000
*   3   DLicTgtStrSize    fixed(32),   /* Target Structure Size -       00654000
*                                         specifies the target number   00655000
*                                         of 4K units for facility      00656000
*                                         storage to be allocated for   00657000
*                                         the list               @D1A*/ 00658000
*   3   DLicTgtMaxElemCt  fixed(32),   /* Target Maximum element        00659000
*                                         count - specifies the target  00660000
*                                         for the maximum number of     00661000
*                                         list elements that are        00662000
*                                         available for assignment to   00663000
*                                         list entries or retry data    00664000
*                                         blocks, or both        @D1A*/ 00665000
*   3   DLicTgtMaxEntryCt fixed(32),   /* Target Maximum Entry Count -  00666000
*                                         specifies the target for the  00667000
*                                         maximum number of possible    00668000
*                                         list entries in a list        00669000
*                                         structure              @D1A*/ 00670000
*   3   DLicMaxLstStrElemCt fixed(32),/* Maximum list structure element 00671000
*                                      count - specifies the max number 00672000
*                                      of list elements that are        00673000
*                                      available for assignment to list 00674000
*                                      entries.                         00675000
*                                      This count is only substantially 00676000
*                                      accurate.                 @P1C*/ 00677000
*   3   DLicLstStrElemCt fixed(32), /* List Structure element count -   00678000
*                                      specifies the number of list     00679000
*                                      elements that have been assigned 00680000
*                                      to list entries.              */ 00681000
*   3   DLicNzLkTblEntCt fixed(32),    /* Nonzero lock-table-entry      00682000
*                                         count - specifies the number  00683000
*                                      of nonzero lock table entries    00684000
*                                      that exist in the structure.     00685000
*                                      This is ignored if the lock      00686000
*                                      table is not created          */ 00687000
*   3   DLicMaxLstEntCt   fixed(32), /* Maximum list-structure-entry-   00688000
*                                      count - specifies the maximum    00689000
*                                      number of possible list entries  00690000
*                                      in a list structure.             00691000
*                                      This count is only substantially 00692000
*                                      accurate.                 @P1C*/ 00693000
*   3   DLicLstEntCt      fixed(32), /* List-structure-entry count -    00694000
*                                      specifies the number of existing 00695000
*                                      list entries in the list         00696000
*                                      structure                     */ 00697000
*   3   DLicStrAuth       char(16), /* Structure Authority - A 16 byte  00698000
*                                      value associated with each bit   00699000
*                                      in the SID vector             */ 00700000
*   3   DLicUsrStrCntl    char(32), /* User Structure Control - a 32    00701000
*                                      byte field defined by the        00702000
*                                      user                          */ 00703000
*   3   DLicUIDVector     bit(256), /* UID Vector - A bit string with   00704000
*                                      an initial value of zero.  A bit 00705000
*                                      is set to one when a user is     00706000
*                                      assigned with a user ID of i.    00707000
*                                      The bit at position i is set to  00708000
*                                      0 when the user is unassigned */ 00709000
*   3   DLicPendEntToElemRatio FIXED(32), /* Pending entry to element   00710000
*                                      ratio (LEVEL1)            @L1A*/ 00711000
*     5   DLicPendEntToElemEnt FIXED(16), /* Pending entry to element   00712000
*                                      ratio,  entry portion            00713000
*                                      (LEVEL1)                  @L1A*/ 00714000
*     5   DLicPendEntToElemElem FIXED(16), /* Pending entry to element  00715000
*                                      ratio,  element portion          00716000
*                                      (LEVEL1)                  @L1A*/ 00717000
*   3   DLicMarginalStrSize FIXED(32), /* Marginal structure size -     00718000
*                                      true minimum size with which     00719000
*                                      the structure can be allocated   00720000
*                                      (LEVEL1)                  @L1A*/ 00721000
*   3   DLicEmcCt FIXED(32),        /* Event monitor controls count -   00722000
*                                      the number of event monitor      00723000
*                                      controls objects which are       00724000
*                                      currently in use in the          00725000
*                                      structure (LEVEL3)        @01A*/ 00726000
*   3   DLicMaxEmcCt FIXED(32),     /* Maximum event monitor controls   00727000
*                                      count - the maximum number       00728000
*                                      of event monitor controls,       00729000
*                                      as currently allocated in the    00730000
*                                      structure (LEVEL3)        @01A*/ 00731000
*   3   DLicTgtMaxEmcCt FIXED(32),  /* Target maximum event monitor     00732000
*                                      controls count - the target      00733000
*                                      maximum number of event monitor  00734000
*                                      controls (LEVEL3)         @01A*/ 00735000
*   3   DLicPendMonToEntRatio FIXED(32), /* Pending monitor to entry    00736000
*                                      storage ratio (LEVEL 4)   @02A*/ 00737000
*     5   DLicPendMonToEntMon  FIXED(16), /* Pending monitor to entry   00738000
*                                      ratio, monitor portion           00739000
*                                      (LEVEL4)                  @02A*/ 00740000
*     5   DLicPendMonToEntEnt  FIXED(16), /* Pending monitor to entry   00741000
*                                      ratio,  entry portion            00742000
*                                      (LEVEL4)                  @02A*/ 00743000
*   3   DLicListSetCursor FIXED(32),   /* List Set Cursor               00744000
*                                      storage ratio (LEVEL 8)   @L2A*/ 00745000
*   3   DLicStrCopyCntlVersion FIXED(32),   /* Structure copy controls  00746000
*                                      version number (LEVEL 8)  @L2A*/ 00747000
*   3   DLicExtUserStrControls  CHAR(32),   /* Extended user structure  00748000
*                                      controls       (LEVEL 8)  @L2A*/ 00749000
*   3   DLicMaximumUserId       CHAR(1),    /* Maximum User Identifier  00750000
*                                                     (LEVEL10)  @L4A*/ 00751000
*   3   *        CHAR(7),           /* Reserved                  @L8C*/ 00752000
*   3   DLicSlnd FIXED(32),         /* Subsidiary list notification     00753000
*                                      delay (SLND).  Bit positions     00754000
*                                      0-31 correspond to bit positions 00755000
*                                      32-63 of the CPU timer.  Bit 19  00756000
*                                      represents one microsecond.      00757000
*                                      (LEVEL16)                 @L8A*/ 00758000
*   3   DLicOffset236 CHAR(1),      /* 237th byte                @L7A*/ 00759000
*     5   *        BIT(4),          /* Reserved                  @L7A*/ 00760000
*     5   DLicSsx BIT(4),           /* Signalling Segment Index -       00761000
*                                      identifies the segment of the    00762000
*                                      local signalling vector array    00763000
*                                      that is used to receive          00764000
*                                      duplexing signals for the        00765000
*                                      list structure that are          00766000
*                                      initiated by the remote          00767000
*                                      facility when duplexing is       00768000
*                                      active. Zero when DLicIrtcei     00769000
*                                      is OFF. (LEVEL16)         @04C*/ 00770000
*     5   *        CHAR(0),         /* End DLicOffset236         @L7A*/ 00771000
*   3   DLicOffset237 CHAR(1),      /* 238th byte                @L7A*/ 00772000
*     5   *        BIT(4),          /* Reserved                  @L7A*/ 00773000
*     5   DLicDssx BIT(4),          /* Duplex Signalling Segment        00774000
*                                      Index - identifies the segment   00775000
*                                      of the remote-facility           00776000
*                                      signalling vector array that     00777000
*                                      is the target of duplexing       00778000
*                                      signals for the peer list        00779000
*                                      structure when duplexing is      00780000
*                                      active. Set when the structure   00781000
*                                      is made duplexing active. Zero   00782000
*                                      when DLicIrtcei is OFF.          00783000
*                                      (LEVEL16)                 @04C*/ 00784000
*     5   *        CHAR(0),         /* End DLicOffset237         @L7A*/ 00785000
*   3   DLicDrxl FIXED(16),         /* Duplex retry index limit -       00786000
*                                      specifies the maximum            00787000
*                                      duplexing retry index value      00788000
*                                      that is supported for            00789000
*                                      duplexing signals targeted to    00790000
*                                      the remote-facility duplexed     00791000
*                                      list structure. Zero when        00792000
*                                      DLicIrtcei is OFF. (LEVEL16)     00793000
*                                                                @L7A*/ 00794000
*   3   DLicStrExecutionTime char(8), /* Time CF spent executing        00795000
*                                       work related to this structure. 00796000
*                                      (LEVEL15)                 @L6C*/ 00797000
*   3   DLicLNDelay  FIXED(32),     /* List Notification Delay.         00798000
*                                      Bit positions 0-31 correspond to 00799000
*                                      bit positions 32-63 of the CPU   00800000
*                                      timer. Bit 19 represents one     00801000
*                                      microsecond. Bytes 248-251       00802000
*                                      (LEVEL22).                @LCA*/ 00803000
*   3   DLicKRNDelay  FIXED(32),    /* Key Range Notification Delay.    00804000
*                                      Bit positions 0-31               00805000
*                                      correspond to bit positions      00806000
*                                      32-63 of the CPU timer. Bit 19   00807000
*                                      represents one microsecond.      00808000
*                                      Bytes 252-255 (LEVEL22)   @LCA*/ 00809000
*   3   *                 char(0);  /* Reserved                  @LCC*/ 00810000
*@space;                                                                00811000
*                                                                       00812000
*declare                                                                00813000
* 1  DlicDuplexingControls char(60) based, /* Duplexing controls from   00814000
*                                       the dump header          @L5A*/ 00815000
*   3  DlicDupConNodeDesc char(32),     /* node descriptor       @L5A*/ 00816000
*   3  DlicDupConStructAuth char(16),   /* Structure authority   @L5A*/ 00817000
*   3  DlicDupConSysId char(8),         /* System id             @L5A*/ 00818000
*   3  *               char(2),         /* reserved              @L5A*/ 00819000
*   3  DlicDupConStructureId char(2);   /* Structure Id          @L5A*/ 00820000
*                                                                       00821000
*/********************************************************************/ 00822000
*/*                                                                  */ 00823000
*/*              Dumping Extended List Structure Controls            */ 00824000
*/*                                                                  */ 00825000
*/************************************************************** @L9A*/ 00826000
*Declare                                                                00827000
* 1   DlicExtStructureControls                                          00828000
*         Char(512) Bdy(DWord)                                          00829000
*         ListStrControlsAttr,             /* Mapping for extended List 00830000
*                                             Structure Controls        00831000
*                                             (LEVEL19)          @L9A*/ 00832000
*   3 DlicExtStrCon_MXSCM Fixed(64),       /* Maximum storage-class     00833000
*                                             memory the structure can  00834000
*                                             use in 4K blocks   @L9A*/ 00835000
*   3 DlicExtStrCon_SCMAT Fixed(8),        /* SCM Algorithm Type @L9A*/ 00836000
*   3 DlicExtStrCon_SCMEUT FIXED(8),       /* SCM expeditious upper     00837000
*                                             threshold          @LBA*/ 00838000
*   3 DlicExtStrCon_SCMFT FIXED(8),        /* SCM full threshold @LBA*/ 00839000
*   3 *        CHAR(1),                    /* Reserved           @LBC*/ 00840000
*   3 DlicExtStrCon_MSBEC Fixed(32),       /* The maximum number of     00841000
*                                             list entries that can be  00842000
*                                             stored in a single        00843000
*                                             storage-class memory      00844000
*                                             buffer             @LAA*/ 00845000
*   3 DlicExtStrCon_MSBELC Fixed(32),      /* The maximum number of     00846000
*                                             list elements that can be 00847000
*                                             stored in a single        00848000
*                                             storage-class memory      00849000
*                                             buffer             @LAA*/ 00850000
*   3 DlicExtStrCon_MNELC FIXED(32),       /* Minimum element           00851000
*                                             count              @LBA*/ 00852000
*   3 DlicExtStrCon_MNEC FIXED(32),        /* Minimum entry count       00853000
*                                                                @LBA*/ 00854000
*   3 * CHAR(8),                           /* Reserved           @LBC*/ 00855000
*   3 DlicExtStrCon_FXAUS Fixed(32),       /* Fixed augmented           00856000
*                                             space in 4K blocks @L9A*/ 00857000
*   3 * Char(4),                           /* Reserved           @L9A*/ 00858000
*   3 DlicExtStrCon_IUAUS Fixed(32),       /* In-use augmented          00859000
*                                             space in 4K blocks @L9A*/ 00860000
*   3 DlicExtStrCon_IUSCM Fixed(64),       /* In-use storage-class      00861000
*                                             memory by the structure   00862000
*                                             in 4K blocks       @L9A*/ 00863000
*   3 * Char(4),                           /* Reserved           @L9A*/ 00864000
*   3 DlicExtStrCon_EMXAUS Fixed(32),      /* Estimated maximum         00865000
*                                             space in 4K blocks that   00866000
*                                             may be assigned           00867000
*                                             as augmented space        00868000
*                                             for the structure  @L9A*/ 00869000
*   3 DlicExtStrCon_EMSEC Fixed(64),       /* Estimated maximum number  00870000
*                                             of list entries that may  00871000
*                                             reside in storage-class   00872000
*                                             memory for the            00873000
*                                             structure          @L9A*/ 00874000
*   3 DlicExtStrCon_EMSELC Fixed(64),      /* Estimated maximum number  00875000
*                                             of list elements that may 00876000
*                                             reside in storage-class   00877000
*                                             memory for the            00878000
*                                             structure          @L9A*/ 00879000
*   3 DlicExtStrCon_SLSEC Fixed(64),       /* Number of existing        00880000
*                                             structure list entries    00881000
*                                             in the list set that      00882000
*                                             reside in storage-class   00883000
*                                             memory             @L9A*/ 00884000
*   3 DlicExtStrCon_SLSELC Fixed(64),      /* Number of existing        00885000
*                                             structure list elements   00886000
*                                             in the list set that      00887000
*                                             reside in storage-class   00888000
*                                             memory             @L9A*/ 00889000
*   3 DlicExtStrCon_SCMLT Fixed(8),        /* Percentage of the list    00890000
*                                             entry and list element    00891000
*                                             counts that determines    00892000
*                                             the lower threshold for   00893000
*                                             migration between         00894000
*                                             storage-class memory      00895000
*                                             and CF storage     @L9A*/ 00896000
*   3 DlicExtStrCon_SCMUT Fixed(8),        /* Percentage of the list    00897000
*                                             entry and list element    00898000
*                                             counts that determines    00899000
*                                             the upper threshold for   00900000
*                                             migration from CF         00901000
*                                             storage to storage-class  00902000
*                                             memory             @L9A*/ 00903000
*   3 DlicExtStrCon_SCMLTR Fixed(8),       /* Percentage of the list    00904000
*                                             entry and list element    00905000
*                                             counts that determines    00906000
*                                             the lower threshold       00907000
*                                             regulator for migration   00908000
*                                             between CF SCM and CF     00909000
*                                             real storage.  The lower  00910000
*                                             threshold regulators are  00911000
*                                             used to stop migration    00912000
*                                             from CF SCM into CF real  00913000
*                                             storage after being       00914000
*                                             triggered by the lower    00915000
*                                             threshold          @L9A*/ 00916000
*   3 DlicExtStrCon_SCMUTR Fixed(8),       /* Percentage of the list    00917000
*                                             entry and list element    00918000
*                                             counts that determines    00919000
*                                             the upper threshold       00920000
*                                             regulator for migration   00921000
*                                             between CF real storage   00922000
*                                             and CF SCM.  The upper    00923000
*                                             threshold regulators are  00924000
*                                             used to stop migration    00925000
*                                             from CF real storage into 00926000
*                                             CF SCM after being        00927000
*                                             triggered by the upper    00928000
*                                             threshold          @L9A*/ 00929000
*   3 DlicExtStrCon_SCMWC Fixed(32),       /* SCM write count. Number   00930000
*                                             of list write operations  00931000
*                                             performed to storage      00932000
*                                             class memory       @L9A*/ 00933000
*   3 DlicExtStrCon_SCMRFC Fixed(32),      /* SCM read after fault      00934000
*                                             count. The number of      00935000
*                                             read operations against   00936000
*                                             storage-class memory      00937000
*                                             that were initiated by a  00938000
*                                             reference to list         00939000
*                                             structure objects         00940000
*                                             residing on storage       00941000
*                                             class memory       @L9A*/ 00942000
*   3 DlicExtStrCon_SCMRPC Fixed(32),      /* SCM read for prefetch     00943000
*                                             count. The number of read 00944000
*                                             operations against        00945000
*                                             storage-class memory that 00946000
*                                             were initiated as a       00947000
*                                             prefetch operation in     00948000
*                                             order to retrieve list    00949000
*                                             structure objects on      00950000
*                                             storage-class memory that 00951000
*                                             are expected to be        00952000
*                                             referenced         @L9A*/ 00953000
*   3 DlicExtStrCon_SRSTFM Fixed(64),      /* The accumulated service   00954000
*                                             times in microseconds for 00955000
*                                             read operations to        00956000
*                                             storage-class             00957000
*                                             memory             @L9A*/ 00958000
*   3 DlicExtStrCon_SRSTSM Fixed(64),      /* The accumulated squares   00959000
*                                             of service times, in      00960000
*                                             squared microsecond       00961000
*                                             units for read operations 00962000
*                                             to storage-class          00963000
*                                             memory             @L9A*/ 00964000
*   3 DlicExtStrCon_SWSTFM Fixed(64),      /* The accumulated service   00965000
*                                             times in microseconds for 00966000
*                                             write operations to       00967000
*                                             storage-class             00968000
*                                             memory             @L9A*/ 00969000
*   3 DlicExtStrCon_SWSTSM Fixed(64),      /* The accumulated squares   00970000
*                                             of service times, in      00971000
*                                             squared microsecond       00972000
*                                             units, for write          00973000
*                                             operations to storage     00974000
*                                             class memory       @L9A*/ 00975000
*   3 DlicExtStrCon_SCMRBT Fixed(64),      /* SCM read bytes            00976000
*                                             transferred. Number of    00977000
*                                             bytes in 4K-byte units    00978000
*                                             transferred from storage  00979000
*                                             class memory to CF        00980000
*                                             storage            @L9A*/ 00981000
*   3 DlicExtStrCon_SCMWBT Fixed(64),      /* SCM write bytes           00982000
*                                             transferred. Number of    00983000
*                                             bytes in 4K-byte units    00984000
*                                             transferred from CF       00985000
*                                             storage to storage-class  00986000
*                                             memory             @L9A*/ 00987000
*   3 DlicExtStrCon_SAECC Fixed(32),       /* SCM auxiliary enabled     00988000
*                                             command count. Number of  00989000
*                                             commands that required    00990000
*                                             the use of CF auxiliary   00991000
*                                             frames             @L9A*/ 00992000
*   3 DlicExtStrCon_SRCC1C Fixed(32),      /* SCM reference count 1 -   00993000
*                                             The number of references  00994000
*                                             against storage-class     00995000
*                                             memory to locate list     00996000
*                                             structure objects  @L9A*/ 00997000
*   3 DlicExtStrCon_SRCC2C Fixed(32),      /* SCM reference count 2 -   00998000
*                                             The number of references  00999000
*                                             against storage-class     01000000
*                                             memory to resolve list    01001000
*                                             entry key hashing  @L9A*/ 01002000
*   3 DlicExtStrCon_SRCC3C Fixed(32),      /* SCM reference count 3 -   01003000
*                                             The number of references  01004000
*                                             against storage-class     01005000
*                                             for the purpose of        01006000
*                                             migrating list structure  01007000
*                                             objects from CF storage   01008000
*                                             to storage-class memory   01009000
*                                             to allow for the          01010000
*                                             creation of new list      01011000
*                                             structure objects in CF   01012000
*                                             storage            @L9A*/ 01013000
*   3 DlicExtStrCon_SRCC4C FIXED(32), /* SCM reference count 4 -        01014000
*                                      The number of commands that      01015000
*                                      were suppressed because          01016000
*                                      storage-class memory migration   01017000
*                                      was required to complete         01018000
*                                      key-range initialization  @05A*/ 01019000
*   3 *        CHAR(332);           /* Reserved                  @05C*/ 01020000
*                                                                       01021000
*/*******************************************************************/  01022000
*/*                                                                 */  01023000
*/*            Length Constants                                     */  01024000
*/*                                                                 */  01025000
*/*******************************************************************/  01026000
*declare                                                                01027000
* KDLic_Len Fixed(32) Constant(Length(DLIC));  /* Length of DLIC     */ 01028000
*                                                                       01029000
*/* End of PL/X Source                                               */ 01030000
* %IF IXLYDLIC_LIST ^= 'NO' &                                           01031000
*    ZCBPRINT ^= 'NO' %THEN                                             01032000
*   %GOTO IXLYDLIC_4;                                                   01033000
*   @LIST POP NOECHO;                                                   01034000
* %IXLYDLIC_4:;                                                         01035000
* %END;                                                                 01036000
