*                                                                       00001000
* %DCL IXLYMSRI_INCLUDED CHAR EXT;                                      00002000
* %DEACTIVATE IXLYMSRI_INCLUDED;                                        00003000
* %IF IXLYMSRI_INCLUDED = '' %THEN                                      00004000
* %DO;                                                                  00005000
*/* Macro made bi-lingual on 18014. CBGEN compile date 15295         */ 00006000
*% /*                                                                   00007000
         MACRO                                                          00008000
         IXLYMSRI &DSECT=YES,&LIST=YES,&TITLE=YES,&MSRI=YES             00009000
         GBLC  &IXLYMSRI_INCLUDED                                       00010000
         GBLC  &ZCBPRINT                                                00011000
&IXLYMSRI_INCLUDED SETC 'YES'                                           00012000
         AIF   ('&LIST' EQ 'NONE').P0                                   00013000
         AIF   ('&TITLE' EQ 'NO').P5                                    00014000
 TITLE   'IXLYMSRI  - Monitor Sublist Registration Input             '  00015000
.P5      ANOP                                                           00016000
**/ IXLYMSRI_1:;                                                        00017000
*/* START OF SPECIFICATIONS ******************************************* 00018000
*                                                                       00019000
*01* SECURITY:                                                          00020000
*                                                                       00021000
*01* PROPRIETARY STATEMENT =                                            00022000
*                                                                       00023000
*    Licensed Materials - Property of IBM                               00024000
*    5647-A01                                                           00025000
*    COPYRIGHT IBM CORP. 1993, 2000                                     00026000
*                                                                       00027000
*    US Government Users Restricted Rights - Use, duplication or        00028000
*    disclosure restricted by GSA ADP Schedule Contract with            00029000
*    IBM Corp.                                                          00030000
*                                                                       00031000
*01* STATUS = JBB6609                                                   00032000
*                                                                       00033000
*01* END OF PROPRIETARY STATEMENT                                       00034000
*                                                                       00035000
*02* ACRONYM:  MSRI                                                     00036000
*                                                                       00037000
*01* DESCRIPTIVE NAME:  Monitor Sublist Registration Input              00038000
*                                                                       00039000
*01* MACRO NAME:  IXLYMSRI                                              00040000
*                                                                       00041000
*01* DSECT NAME:  MSRI                                                  00042000
*                                                                       00043000
*01* COMPONENT:  Cross System Extended Services (SCIXL)                 00044000
*                                                                       00045000
*01* EYE-CATCHER:  NONE                                                 00046000
*                                                                       00047000
*01* STORAGE ATTRIBUTES:                                                00048000
*02*  SUBPOOL:  User specified                                          00049000
*02*  KEY:  User specified                                              00050000
*02*  RESIDENCY:  User specified                                        00051000
*                                                                       00052000
*01* SIZE:  64 bytes                                                    00053000
*            MSRI -- X'0040' bytes                                      00054000
*01*             MSRI -- X'0040' bytes                                  00055000
*                                                                       00056000
*01* CREATED BY: Storage area created by IXLLIST/IXLLSTC invoker.       00057000
*                                                                       00058000
*                                                                       00059000
*01* POINTED TO BY:                                                     00060000
*     BUFFER or BUFLIST                                                 00061000
*                                                                       00062000
*01* SERIALIZATION: See BUFFER/BUFLIST parameter requirements on the    00063000
*                   IXLLIST/IXLLSTC interface description.              00064000
*                                                                       00065000
*01* FUNCTION: Maps the information needed to identify an individual    00066000
*              sublist when invoking the IXLLIST/IXLLSTC service to     00067000
*              monitor sublists.                                        00068000
*                                                                       00069000
*              The storage area(s) indicated by BUFFER or BUFLIST on    00070000
*              an IXLLIST/IXLLSTC REQUEST=MONITOR_SUBLISTS contain      00071000
*              an input array of entries.  Each entry is mapped by      00072000
*              MSRI and contains the information needed to request      00073000
*              monitoring for one sublist.                              00074000
*                                                                       00075000
*                                                                       00076000
*01* EXTERNAL CLASSIFICATION: GUPI                                      00077000
*01* END OF EXTERNAL CLASSIFICATION:                                    00078000
*                                                                       00079000
*01* METHOD OF ACCESS:                                                  00080000
*02*  ASM:    USING on MSRI                                             00081000
*                                                                       00082000
*02*  PL/AS:  %DCL MSRI_DCL_ATTR CHAR                                   00083000
*             %MSRI_DCL_ATTR = 'based/defined/via attribtues'           00084000
*             %INCLUDE SYSLIB(IXLYMSRI)                                 00085000
*                                                                       00086000
*             If MSRI_DCL_ATTR is not set the MSRI will be              00087000
*             declared as BASED.                                        00088000
*                                                                       00089000
*01* DELETED BY: Invoker of IXLLIST/IXLLSTC service                     00090000
*                                                                       00091000
*01* FREQUENCY: One for each sublist that is to be monitored.           00092000
*                                                                       00093000
*01* DEPENDENCIES: See BUFFER/BUFLIST parameter requirements on the     00094000
*                  IXLLIST/IXLLSTC interface description.               00095000
*                                                                       00096000
*01* DISTRIBUTION LIBRARY: AMACLIB                                      00097000
*                                                                       00098000
*01* CHANGE ACTIVITY:                                                   00099000
*     $00=OW15589  HBB5520 950706 PD00BJ: Event monitoring support      00100000
*     $L1=MQ       JBB6609 980812 PD002F: MQSeries Support              00101000
*                                         (AR8630)                      00102000
*                                                                       00103000
*                                                                       00104000
* NOTES: This control block must start on a double word boundary.       00105000
*                                                                       00106000
*                                                                       00107000
*   ALLOCATION-METHOD:  Specific to IXLLIST/IXLLSTC invoker.            00108000
*                       See BUFFER/BUFLIST parameter requirements on    00109000
*                       the IXLLIST/IXLLSTC interface description.      00110000
*                                                                       00111000
*END OF SPECIFICATIONS ***********************************************/ 00112000
*% /*                                                                   00113000
.P0      ANOP                                                           00114000
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 00115000
         AIF   ('&LIST' EQ 'YES').P2                                    00116000
.P1      ANOP                                                           00117000
         PUSH  PRINT                                                    00118000
         PRINT OFF                                                      00119000
.P2      ANOP                                                           00120000
         AIF   ('&MSRI' EQ 'NO').L0002                                  00121000
         AIF   ('&DSECT' EQ 'YES').L0003                                00122000
         AIF   ('&MSRI' NE 'YES').L0002                                 00123000
MSRI     DS    0D        Sublist Monitoring input                       00124000
         AGO   .L0004                                                   00125000
.L0003   ANOP                                                           00126000
MSRI     DSECT           Sublist Monitoring input                       00127000
.L0004   ANOP                                                           00128000
         DS    CL1       Reserved, specify as zero                      00129000
MSRICONID DS   X         Connection identifier                          00130000
         DS    CL5       Reserved, specify as zero                      00131000
MSRIEMC_FLAGS DS 0B      Event Monitor Control Flags                    00132000
MSRIEMC_NOTIFYONEVERY EQU X'04' 1 ==> indicates that an EMC should be  *00133000
                         queued to the event queue for every list      *00134000
                         entry added to the sublist (CFLEVEL >= 9) 0   *00135000
                         ==> indicates that an EMC should be queued to *00136000
                         the event queue for only the first list entry *00137000
                         added to the sublist                           00138000
MSRIEMC_KEYTYPE EQU X'02' 1 ==> indicates sublist monitoring is        *00139000
                         requested for a sublist with the secondary    *00140000
                         key specified by MsriSecondaryKey (CFLEVEL >= *00141000
                         9) 0 ==> indicates sublist monitoring is      *00142000
                         requested for a sublist with a list entry key *00143000
                         specified by MsriListEntryKey                  00144000
         ORG   MSRIEMC_FLAGS+1                                          00145000
MSRILISTNUM DS F         The list number of the sublist for which      *00146000
                         monitoring is desired                          00147000
         DS    CL4       Reserved, specify as zero                      00148000
MSRILISTENTRYKEYS DS 0CL32 List Entry or Secondary key indicated by    *00149000
                         MsriEMC_KeyType                                00150000
         ORG   MSRILISTENTRYKEYS                                        00151000
MSRILISTENTRYKEYBUF DS 0CL32 KeyType = B'0'                             00152000
         DS    CL16      Reserved, specify as zero                      00153000
MSRILISTENTRYKEY DS CL16 KeyType = B'0', List Entry Key of sublist for *00154000
                         which monitoring is desired.                   00155000
         ORG   MSRILISTENTRYKEYS                                        00156000
MSRISECONDARYKEY DS CL32 KeyType = B'1', Secondary List Entry Key of   *00157000
                         sublist for which monitoring is               *00158000
                         desired.(CFLEVEL >= 9)                         00159000
MSRIUNC  DS    CL16      User Notification Controls. 16 bytes of user  *00160000
                         defined data associated with the monitoring   *00161000
                         of this sublist.                               00162000
MSRIEND  DS    0C        End Sublist Monitoring Info                    00163000
MSRI_LEN EQU   *-MSRI                                                   00164000
.L0002   ANOP                                                           00165000
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 00166000
         AIF   ('&LIST' EQ 'YES').P4                                    00167000
.P3      ANOP                                                           00168000
         POP   PRINT                                                    00169000
.P4      ANOP                                                           00170000
.P_EXIT  ANOP                                                           00171000
         MEND                                                           00172000
**/ IXLYMSRI_2:;                                                        00173000
* %IXLYMSRI_INCLUDED = 'YES';                                           00174000
* %DCL ZCBPRINT CHAR EXT;                                               00175000
* %DEACTIVATE ZCBPRINT;                                                 00176000
* %DCL IXLYMSRI_LIST CHAR EXT;                                          00177000
* %DEACTIVATE IXLYMSRI_LIST;                                            00178000
* %IF IXLYMSRI_LIST ^= 'NO' &                                           00179000
*    ZCBPRINT ^= 'NO' %THEN                                             00180000
*   %GOTO IXLYMSRI_3;                                                   00181000
*   @LIST PUSH NOECHO;                                                  00182000
*   @LIST NOASSEMBLE NOECHO;                                            00183000
*   @LIST OFF C NOECHO;                                                 00184000
* %IXLYMSRI_3:;                                                         00185000
*/* Start of PL/X Source                                             */ 00186000
*                                                                       00187000
* %If MSRI_Dcl_Attr = '' %Then                                          00188000
*   %MSRI_Dcl_Attr = 'Based';                                           00189000
*                                                                       00190000
* DCL 1 Msri Msri_Dcl_Attr Bdy(DWord), /*                               00191000
*                                      Sublist Monitoring input      */ 00192000
*      3 * char(1),                 /* Reserved, specify as zero @L1A*/ 00193000
*      3 MsriConId fixed(8),        /* Connection identifier     @L1A*/ 00194000
*      3 * char(5),                 /* Reserved, specify as zero @L1C*/ 00195000
*      3 MsriEMC_Flags bit(8),      /* Event Monitor Control Flags      00196000
*                                                                @L1A*/ 00197000
*        5 * bit(5),                /* Reserved, specify as zero @L1A*/ 00198000
*        5 MsriEMC_NotifyOnEvery bit(1), /* 1 ==> indicates that an     00199000
*                                      EMC should be queued to the      00200000
*                                      event queue for every list       00201000
*                                      entry added to the sublist       00202000
*                                      (CFLEVEL >= 9)                   00203000
*                                      0 ==> indicates that an EMC      00204000
*                                      should be queued to the event    00205000
*                                      queue for only the first list    00206000
*                                      entry added to the sublist       00207000
*                                                                @L1A*/ 00208000
*        5 MsriEMC_KeyType bit(1),  /* 1 ==> indicates sublist          00209000
*                                      monitoring is requested for a    00210000
*                                      sublist with the secondary key   00211000
*                                      specified by MsriSecondaryKey    00212000
*                                      (CFLEVEL >= 9)                   00213000
*                                      0 ==> indicates sublist          00214000
*                                      monitoring is requested for a    00215000
*                                      sublist with a list entry key    00216000
*                                      specified by                     00217000
*                                      MsriListEntryKey          @L1A*/ 00218000
*        5 * bit(1),                /* Reserved, specify as zero @L1A*/ 00219000
*      3 MsriListNum fixed(32),     /* The list number of the sublist   00220000
*                                      for which monitoring is          00221000
*                                      desired                       */ 00222000
*      3 * char(4),                 /* Reserved, specify as zero @L1C*/ 00223000
*      3 MsriListEntryKeys union,   /* List Entry or Secondary key      00224000
*                                      indicated by MsriEMC_KeyType     00225000
*                                                                @L1C*/ 00226000
*        5 MsriListEntryKeyBuf,     /* KeyType = B'0'            @L1A*/ 00227000
*          7 * char(16),            /* Reserved, specify as zero @L1A*/ 00228000
*          7 MsriListEntryKey char(16), /* KeyType = B'0',              00229000
*                                      List Entry Key of sublist        00230000
*                                      for which monitoring is          00231000
*                                      desired.                  @L1A*/ 00232000
*        5 MsriSecondaryKey char(32), /* KeyType = B'1',                00233000
*                                      Secondary List Entry Key of      00234000
*                                      sublist for which monitoring     00235000
*                                      is desired.(CFLEVEL >= 9) @L1A*/ 00236000
*      3 MsriUnc char(16),          /* User Notification Controls.      00237000
*                                      16 bytes of user defined data    00238000
*                                      associated with the monitoring   00239000
*                                      of this sublist.              */ 00240000
*      3 MsriEnd            Char(0); /* End Sublist Monitoring Info  */ 00241000
*                                                                       00242000
* %Deactivate MSRI_Dcl_Attr;                                            00243000
*                                                                       00244000
*/* End of PL/X Source                                               */ 00245000
* %IF IXLYMSRI_LIST ^= 'NO' &                                           00246000
*    ZCBPRINT ^= 'NO' %THEN                                             00247000
*   %GOTO IXLYMSRI_4;                                                   00248000
*   @LIST POP NOECHO;                                                   00249000
* %IXLYMSRI_4:;                                                         00250000
* %END;                                                                 00251000
