*                                                                       00001000
* %DCL IXLYNDE_INCLUDED CHAR EXT;                                       00002000
* %DEACTIVATE IXLYNDE_INCLUDED;                                         00003000
* %IF IXLYNDE_INCLUDED = '' %THEN                                       00004000
* %DO;                                                                  00005000
*/* Macro made bi-lingual on 18014. CBGEN compile date 15295         */ 00006000
*% /*                                                                   00007000
         MACRO                                                          00008000
         IXLYNDE &DSECT=YES,&LIST=YES,&TITLE=YES,&NDE=YES               00009000
         GBLC  &IXLYNDE_INCLUDED                                        00010000
         GBLC  &ZCBPRINT                                                00011000
&IXLYNDE_INCLUDED SETC 'YES'                                            00012000
         AIF   ('&LIST' EQ 'NONE').P0                                   00013000
         AIF   ('&TITLE' EQ 'NO').P5                                    00014000
 TITLE   'IXLYNDE  - Node Descriptor                                '   00015000
.P5      ANOP                                                           00016000
**/ IXLYNDE_1:;                                                         00017000
*/* START OF SPECIFICATIONS ******************************************* 00018000
*                                                                       00019000
*01* PROPRIETARY STATEMENT =                                            00020000
*                                                                       00021000
*    LICENSED MATERIALS - PROPERTY OF IBM                               00022000
*    5650-ZOS COPYRIGHT IBM CORP. 1993, 2015                            00023000
*                                                                       00024000
*01* STATUS = HBB77A0                                                   00025000
*                                                                       00026000
*01* END OF PROPRIETARY STATEMENT                                       00027000
*                                                                       00028000
*01* DESCRIPTIVE NAME:  Node Descriptor                                 00029000
*                                                                       00030000
*02*  ACRONYM:  ND                                                      00031000
*                                                                       00032000
*01* MACRO NAME:  IXLYNDE                                               00033000
*                                                                       00034000
*01* DSECT NAME:  NDE                                                   00035000
*                                                                       00036000
*01* COMPONENT:  Cross System Extended Services (SCIXL)                 00037000
*                                                                       00038000
*01* EYE-CATCHER:  NONE                                                 00039000
*02*  OFFSET:  N/A                                                      00040000
*02*  LENGTH:  N/A                                                      00041000
*                                                                       00042000
*01* STORAGE ATTRIBUTES:                                                00043000
*02*  SUBPOOL:  user-defined                                            00044000
*02*  KEY:      user-defined                                            00045000
*02*  RESIDENCY:  user-defined                                          00046000
*                                                                       00047000
*01* SIZE:  32                                                          00048000
*                NDE -- X'0020' bytes                                   00049000
*                                                                       00050000
*01* CREATED BY:  User                                                  00051000
*                                                                       00052000
*01* POINTED TO BY:  None                                               00053000
*                                                                       00054000
*01* SERIALIZATION:  None                                               00055000
*                                                                       00056000
*01* FUNCTION:                                                          00057000
*02*  Maps a node descriptor as pertains to coupling facilities         00058000
*                                                                       00059000
*01* EXTERNAL CLASSIFICATION: GUPI                                      00060000
*01* END OF EXTERNAL CLASSIFICATION:                                    00061000
*                                                                       00062000
*01* METHOD OF ACCESS:                                                  00063000
*02*  ASM:   IXLYNDE  USING on NDE                                      00064000
*02*  PL/AS: %INCLUDE SYSLIB(IXLYNDE)                                   00065000
*                                                                       00066000
*01* STATUS:  HBB5510                                                   00067000
*                                                                       00068000
*01* DELETED BY:  N/A                                                   00069000
*                                                                       00070000
*01* FREQUENCY:   N/A                                                   00071000
*                                                                       00072000
*01* DEPENDENCIES: None                                                 00073000
*                                                                       00074000
*01* DISTRIBUTION LIBRARY: AMACLIB                                      00075000
*                                                                       00076000
*01* CHANGE ACTIVITY:                                                   00077000
*     $D0=DIG0046  HBB5510 930114 PD00FR: Node descriptor support       00078000
*     $D1=DIG0099  HBB5510 930520 PD00FR: Architecture upgrade          00079000
*     $P1=PIG5124  HBB5510 940201 PD00FR: SERIAL to SEQUENCE            00080000
*     $P2=PIG5447  HBB5510 940527 PD00DT: Restore Model number          00081000
*     $L1=ADUPLX   HBB77A0 150819 PD00SA: Name reserved space and       00082000
*                                         update copyright              00083000
*                                                                       00084000
* END OF SPECIFICATIONS *********************************************/  00085000
*% /*                                                                   00086000
.P0      ANOP                                                           00087000
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 00088000
         AIF   ('&LIST' EQ 'YES').P2                                    00089000
.P1      ANOP                                                           00090000
         PUSH  PRINT                                                    00091000
         PRINT OFF                                                      00092000
.P2      ANOP                                                           00093000
         AIF   ('&NDE' EQ 'NO').L0002                                   00094000
         AIF   ('&DSECT' EQ 'YES').L0003                                00095000
         AIF   ('&NDE' NE 'YES').L0002                                  00096000
NDE      DS    0X        Node Descriptor                                00097000
         AGO   .L0004                                                   00098000
.L0003   ANOP                                                           00099000
NDE      DSECT           Node Descriptor                                00100000
.L0004   ANOP                                                           00101000
NDEWORD0 DS    0BL4      Header Word 0                                  00102000
NDEBYTE0 DS    B         Word 0 Byte 0 - RESERVED                       00103000
NDEBYTE1 DS    0B        Word 0 Byte 1                                  00104000
NDECONFIGCODE EQU X'F0'  Configuration code. Bits 0-3. B'0000'         *00105000
                         indicates side 0, B'0001' indicates side 1.   *00106000
                         If not partitioned, the value will be B'0000'  00107000
NDEPPMODE EQU  X'04'     PP/SI mode indicator. 0 = processor is in     *00108000
                         single-image (SI) mode, 1 = processor is in   *00109000
                         physically partitioned (PP) mode               00110000
         ORG   NDEBYTE1+1                                               00111000
NDEBYTE2 DS    B         Word 0 Byte 2 - RESERVED                       00112000
NDEBYTE3 DS    0B        Word 0 Byte 3                                  00113000
NDEPARTITION DS X        LPAR Partition Number                          00114000
NDEEBCDIC DS   0CL26     EBCDIC portion of NDE                          00115000
NDETYPE  DS    CL6       EBCDIC node type                               00116000
NDEMODEL DS    CL3       EBCDIC model number - this number is not      *00117000
                         guaranteed to be the current model number.     00118000
NDEMFG   DS    CL3       EBCDIC node manufacturer                       00119000
NDEPLANT DS    CL2       EBCDIC manufacturer plant ID                   00120000
NDESEQUENCE DS CL12      EBCDIC sequence number                         00121000
NDETAG   DS    0CL2      Tag field                                      00122000
         DS    CL1       RESERVED                                       00123000
NDECPCID DS    X         Central Processor Complex (CPC) identifier     00124000
NDE_LEN  EQU   *-NDE                                                    00125000
.L0002   ANOP                                                           00126000
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 00127000
         AIF   ('&LIST' EQ 'YES').P4                                    00128000
.P3      ANOP                                                           00129000
         POP   PRINT                                                    00130000
.P4      ANOP                                                           00131000
.P_EXIT  ANOP                                                           00132000
         MEND                                                           00133000
**/ IXLYNDE_2:;                                                         00134000
* %IXLYNDE_INCLUDED = 'YES';                                            00135000
* %DCL ZCBPRINT CHAR EXT;                                               00136000
* %DEACTIVATE ZCBPRINT;                                                 00137000
* %DCL IXLYNDE_LIST CHAR EXT;                                           00138000
* %DEACTIVATE IXLYNDE_LIST;                                             00139000
* %IF IXLYNDE_LIST ^= 'NO' &                                            00140000
*    ZCBPRINT ^= 'NO' %THEN                                             00141000
*   %GOTO IXLYNDE_3;                                                    00142000
*   @LIST PUSH NOECHO;                                                  00143000
*   @LIST NOASSEMBLE NOECHO;                                            00144000
*   @LIST OFF C NOECHO;                                                 00145000
* %IXLYNDE_3:;                                                          00146000
*/* Start of PL/X Source                                             */ 00147000
*                                                                       00148000
*   DECLARE                                                             00149000
*     1    NDE      BASED,          /* Node Descriptor               */ 00150000
*       3    NdeWord0 BIT(32),      /* Header Word 0                 */ 00151000
*         5    NdeByte0 BIT(8),     /* Word 0 Byte 0 - RESERVED      */ 00152000
*         5    NdeByte1 BIT(8),     /* Word 0 Byte 1                 */ 00153000
*           7    NdeConfigCode BIT(4), /* Configuration code. Bits      00154000
*                                      0-3. B'0000' indicates side 0,   00155000
*                                      B'0001' indicates side 1. If     00156000
*                                      not partitioned, the value       00157000
*                                      will be B'0000'               */ 00158000
*           7    *        BIT(1),   /* RESERVED                      */ 00159000
*           7    NdePpMode BIT(1),  /* PP/SI mode indicator. 0 =        00160000
*                                      processor is in single-image     00161000
*                                      (SI) mode,  1 = processor is in  00162000
*                                      physically partitioned (PP)      00163000
*                                      mode                          */ 00164000
*           7    *        BIT(2),   /* RESERVED                      */ 00165000
*         5    NdeByte2 BIT(8),     /* Word 0 Byte 2 - RESERVED      */ 00166000
*         5    NdeByte3 BIT(8),     /* Word 0 Byte 3                 */ 00167000
*           7    NdePartition FIXED(8), /* LPAR Partition Number @D1C*/ 00168000
*       3    NdeEBCDIC CHAR(26),    /* EBCDIC portion of NDE         */ 00169000
*         5    NdeType  CHAR(6),    /* EBCDIC node type              */ 00170000
*         5    NdeModel CHAR(3),    /* EBCDIC model number - this       00171000
*                                      number is not guaranteed to be   00172000
*                                      the current model number.        00173000
*                                                          @D1C  @P2C*/ 00174000
*         5    NdeMfg   CHAR(3),    /* EBCDIC node manufacturer  @D1C*/ 00175000
*         5    NdePlant CHAR(2),    /* EBCDIC manufacturer plant ID  */ 00176000
*         5    NdeSequence CHAR(12), /* EBCDIC sequence number   @P1C*/ 00177000
*       3    NdeTag   CHAR(2),      /* Tag field                 @L1C*/ 00178000
*         5    *           CHAR(1),  /* RESERVED                 @D1A*/ 00179000
*         5    NdeCPCID    FIXED(8), /* Central Processor Complex       00180000
*                                       (CPC) identifier         @D1A*/ 00181000
*       3    *        CHAR(0);                                          00182000
*                                                                       00183000
*/* End of PL/X Source                                               */ 00184000
* %IF IXLYNDE_LIST ^= 'NO' &                                            00185000
*    ZCBPRINT ^= 'NO' %THEN                                             00186000
*   %GOTO IXLYNDE_4;                                                    00187000
*   @LIST POP NOECHO;                                                   00188000
* %IXLYNDE_4:;                                                          00189000
* %END;                                                                 00190000
