*                                                                       00001000
* %DCL IXLYLCTL_INCLUDED CHAR EXT;                                      00002000
* %DEACTIVATE IXLYLCTL_INCLUDED;                                        00003000
* %IF IXLYLCTL_INCLUDED = '' %THEN                                      00004000
* %DO;                                                                  00005000
*/* Macro made bi-lingual on 18014. CBGEN compile date 15295         */ 00006000
*% /*                                                                   00007000
         MACRO                                                          00008000
         IXLYLCTL &DSECT=YES,&LIST=YES,&TITLE=YES,&LCTL=YES             00009000
         GBLC  &IXLYLCTL_INCLUDED                                       00010000
         GBLC  &ZCBPRINT                                                00011000
&IXLYLCTL_INCLUDED SETC 'YES'                                           00012000
         AIF   ('&LIST' EQ 'NONE').P0                                   00013000
         AIF   ('&TITLE' EQ 'NO').P5                                    00014000
 TITLE   'IXLYLCTL  - List Entry Controls mapping                    '  00015000
.P5      ANOP                                                           00016000
**/ IXLYLCTL_1:;                                                        00017000
*/* START OF SPECIFICATIONS ******************************************* 00018000
*                                                                       00019000
*01* SECURITY:                                                          00020000
*                                                                       00021000
* ***PROPRIETARY_STATEMENT********************************************* 00022000
***01* PROPRIETARY STATEMENT=                                         * 00023000
*                                                                     * 00024000
*    LICENSED MATERIALS - PROPERTY OF IBM                             * 00025000
*    5655-068 COPYRIGHT IBM CORP. 1993                                * 00026000
*                                                                     * 00027000
*   STATUS = HBB5510                                                  * 00028000
*                                                                     * 00029000
*  **END_OF_PROPRIETARY_STATEMENT************************************** 00030000
*                                                                       00031000
*02* ACRONYM:  LCTL                                                     00032000
*                                                                       00033000
*01* DESCRIPTIVE NAME:  List Entry Controls mapping                     00034000
*                                                                       00035000
*01* MACRO NAME:  IXLYLCTL                                              00036000
*                                                                       00037000
*01* DSECT NAME:  LCTL                                                  00038000
*                                                                       00039000
*01* COMPONENT:  Cross System Extended Services (SCIXL)                 00040000
*                                                                       00041000
*01* EYE-CATCHER:  NONE                                                 00042000
*                                                                       00043000
*01* STORAGE ATTRIBUTES:                                                00044000
*02*  SUBPOOL:  User specified                                          00045000
*02*  KEY:  User specified                                              00046000
*02*  RESIDENCY:  User specified                                        00047000
*                                                                       00048000
*01* SIZE:  64 bytes                                                    00049000
*            LCTL -- X'0040' bytes                                      00050000
*01*             LCTL -- X'0040' bytes                                  00051000
*                                                                       00052000
*01* CREATED BY: Storage area created by IXLLIST invoker                00053000
*                Data fields set by IXLLIST service routine             00054000
*                                                                       00055000
*01* POINTED TO BY:                                                     00056000
*     ANSAREA, BUFFER or BUFLIST                                        00057000
*                                                                       00058000
*01* SERIALIZATION: See BUFFER/BUFLIST parameter requirements on the    00059000
*                   IXLLIST interface description.                      00060000
*                                                                       00061000
*                                                                       00062000
*01* FUNCTION: Maps the list entry controls returned in the IXLLIST     00063000
*              answer area specified by ANSAREA, and also maps the      00064000
*              list entry controls returned in the area(s) specified    00065000
*              by BUFFER or BUFLIST for an IXLLIST READ_LIST or         00066000
*              READ_MULT request when list entry controls were          00067000
*              requested.                                               00068000
*                                                                       00069000
*01* EXTERNAL CLASSIFICATION: GUPI                                      00070000
*01* END OF EXTERNAL CLASSIFICATION:                                    00071000
*                                                                       00072000
*01* METHOD OF ACCESS:                                                  00073000
*02*  ASM:    USING on LCTL                                             00074000
*                                                                       00075000
*02*  PL/AS:  %DCL LCTL_DCL_ATTR CHAR                                   00076000
*             %LCTL_DCL_ATTR = 'based/defined/via attribtues'           00077000
*             %INCLUDE SYSLIB(IXLYLCTL)                                 00078000
*                                                                       00079000
*             If LCTL_DCL_ATTR is not set the LCTL will be              00080000
*             declared as BASED.                                        00081000
*                                                                       00082000
*01* DELETED BY: Invoker of IXLLIST service                             00083000
*                                                                       00084000
*01* FREQUENCY: One per list entry controls returned on IXLLIST request 00085000
*                                                                       00086000
*01* DEPENDENCIES: See BUFFER/BUFLIST parameter requirements on the     00087000
*                  IXLLIST interface description.                       00088000
*                                                                       00089000
*01* DISTRIBUTION LIBRARY: AMACLIB                                      00090000
*                                                                       00091000
*01* CHANGE ACTIVITY:                                                   00092000
*     $L0=SYSLKSRQ HBB5510 910311 PD00K1:  XES support                  00093000
*                                                                       00094000
*                                                                       00095000
* NOTES: This control block must start on a word boundary.              00096000
*                                                                       00097000
*                                                                       00098000
*   ALLOCATION-METHOD:  Specific to IXLLIST invoker.                    00099000
*                       See BUFFER/BUFLIST parameter requirements on    00100000
*                       the IXLLIST interface description.              00101000
*                                                                       00102000
*END OF SPECIFICATIONS ***********************************************/ 00103000
*% /*                                                                   00104000
.P0      ANOP                                                           00105000
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 00106000
         AIF   ('&LIST' EQ 'YES').P2                                    00107000
.P1      ANOP                                                           00108000
         PUSH  PRINT                                                    00109000
         PRINT OFF                                                      00110000
.P2      ANOP                                                           00111000
         AIF   ('&LCTL' EQ 'NO').L0002                                  00112000
         AIF   ('&DSECT' EQ 'YES').L0003                                00113000
         AIF   ('&LCTL' NE 'YES').L0002                                 00114000
LCTL     DS    0F        List Entry Controls                            00115000
         AGO   .L0004                                                   00116000
.L0003   ANOP                                                           00117000
LCTL     DSECT           List Entry Controls                            00118000
.L0004   ANOP                                                           00119000
LCTLNONMKY DS  0CL32     Subset of list entry controls which are       *00120000
                         always valid                                   00121000
LCTLELEMNUM DS X         List entry size expressed as the number of    *00122000
                         elements in the entry                          00123000
         DS    CL7       Reserved                                       00124000
LCTLLISTNUM DS F         The number of the list on which the list      *00125000
                         entry resides                                  00126000
LCTLENTRYID DS CL12      List entry identifier                          00127000
LCTLVERSION DS CL8       List entry version number                      00128000
LCTLNAME DS    0CL16     List entry name. Only meaningful if the       *00129000
                         structure supports names.                      00130000
LCTLKEY  DS    CL16      List entry key. Only meaningful if the        *00131000
                         structure supports keys.                       00132000
         DS    CL16      Reserved                                       00133000
LCTLEND  DS    0C        End of List Entry Controls                     00134000
LCTL_LEN EQU   *-LCTL                                                   00135000
.L0002   ANOP                                                           00136000
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 00137000
         AIF   ('&LIST' EQ 'YES').P4                                    00138000
.P3      ANOP                                                           00139000
         POP   PRINT                                                    00140000
.P4      ANOP                                                           00141000
.P_EXIT  ANOP                                                           00142000
         MEND                                                           00143000
**/ IXLYLCTL_2:;                                                        00144000
* %IXLYLCTL_INCLUDED = 'YES';                                           00145000
* %DCL ZCBPRINT CHAR EXT;                                               00146000
* %DEACTIVATE ZCBPRINT;                                                 00147000
* %DCL IXLYLCTL_LIST CHAR EXT;                                          00148000
* %DEACTIVATE IXLYLCTL_LIST;                                            00149000
* %IF IXLYLCTL_LIST ^= 'NO' &                                           00150000
*    ZCBPRINT ^= 'NO' %THEN                                             00151000
*   %GOTO IXLYLCTL_3;                                                   00152000
*   @LIST PUSH NOECHO;                                                  00153000
*   @LIST NOASSEMBLE NOECHO;                                            00154000
*   @LIST OFF C NOECHO;                                                 00155000
* %IXLYLCTL_3:;                                                         00156000
*/* Start of PL/X Source                                             */ 00157000
*                                                                       00158000
* %If Lctl_Dcl_Attr = '' %Then                                          00159000
*   %Lctl_Dcl_Attr = 'Based';                                           00160000
*                                                                       00161000
* Dcl 1 Lctl Lctl_Dcl_Attr Bdy(Word), /* List Entry Controls         */ 00162000
*       3 LctlNoNmKy   Char(32) Bdy(Word), /* Subset of list entry      00163000
*                                   controls which are always valid  */ 00164000
*         5 LctlElemNum   Fixed(8),  /* List entry size expressed as    00165000
*                                       the number of elements in the   00166000
*                                       entry                        */ 00167000
*         5 *             Char(7),   /* Reserved                     */ 00168000
*         5 LctlListNum   Fixed(32), /* The number of the list on       00169000
*                                       which the list entry resides */ 00170000
*         5 LctlEntryId   Char(12),  /* List entry identifier        */ 00171000
*         5 LctlVersion   Char(8),   /* List entry version number    */ 00172000
*       3 LctlName     Char(16), /* List entry name.  Only meaningful   00173000
*                                   if the structure supports names. */ 00174000
*         5 LctlKey      Char(16), /* List entry key.  Only meaningful  00175000
*                                   if the structure supports keys.  */ 00176000
*       3 *            Char(16), /* Reserved                         */ 00177000
*       3 LctlEnd      Char(0);  /* End of List Entry Controls       */ 00178000
*                                                                       00179000
* %Deactivate Lctl_Dcl_Attr;                                            00180000
*                                                                       00181000
*/* End of PL/X Source                                               */ 00182000
* %IF IXLYLCTL_LIST ^= 'NO' &                                           00183000
*    ZCBPRINT ^= 'NO' %THEN                                             00184000
*   %GOTO IXLYLCTL_4;                                                   00185000
*   @LIST POP NOECHO;                                                   00186000
* %IXLYLCTL_4:;                                                         00187000
* %END;                                                                 00188000
