*                                                                       00001000
* %DCL IXLYLRB_INCLUDED CHAR EXT;                                       00002000
* %DEACTIVATE IXLYLRB_INCLUDED;                                         00003000
* %IF IXLYLRB_INCLUDED = '' %THEN                                       00004000
* %DO;                                                                  00005000
*/* Macro made bi-lingual on 18014. CBGEN compile date 15295         */ 00006000
*% /*                                                                   00007000
         MACRO                                                          00008000
         IXLYLRB &DSECT=YES,&LIST=YES,&TITLE=YES,&LRB_RELEASE_VER0=YES,*00009000
               &LRB_RELEASE_VER1=COND                                   00010000
         GBLC  &IXLYLRB_INCLUDED                                        00011000
         GBLC  &ZCBPRINT                                                00012000
&IXLYLRB_INCLUDED SETC 'YES'                                            00013000
         AIF   ('&LIST' EQ 'NONE').P0                                   00014000
         AIF   ('&TITLE' EQ 'NO').P5                                    00015000
 TITLE   'IXLYLRB  - Lock Request Block                              '  00016000
.P5      ANOP                                                           00017000
**/ IXLYLRB_1:;                                                         00018000
*/* START OF SPECIFICATIONS ******************************************* 00019000
*                                                                       00020000
*01* PROPRIETARY STATEMENT =                                            00021000
*                                                                       00022000
*    LICENSED MATERIALS - PROPERTY OF IBM                               00023000
*    5650-ZOS COPYRIGHT IBM CORP. 1994, 2015                            00024000
*                                                                       00025000
*01* STATUS = HBB77A0                                                   00026000
*                                                                       00027000
*01* END OF PROPRIETARY STATEMENT                                       00028000
*                                                                       00029000
*01* EXTERNAL CLASSIFICATION: GUPI                                      00030000
*01* END OF EXTERNAL CLASSIFICATION:                                    00031000
*                                                                       00032000
*02* ACRONYM:  LRB                                                      00033000
*                                                                       00034000
*01* DESCRIPTIVE NAME: Lock Request Block                               00035000
*                                                                       00036000
*01* MACRO NAME:  IXLYLRB                                               00037000
*                                                                       00038000
*01* DSECT NAME:  LRB                                                   00039000
*                                                                       00040000
*01* COMPONENT:  Cross System Extended Services (SCIXL)                 00041000
*                                                                       00042000
*01* EYE-CATCHER:  NONE                                                 00043000
*                                                                       00044000
*01* STORAGE ATTRIBUTES:                                                00045000
*02*  SUBPOOL:  User supplied                                           00046000
*02*  KEY:  User supplied                                               00047000
*02*  RESIDENCY:  User supplied                                         00048000
*                                                                       00049000
*01* SIZE:                                                              00050000
*                LRB_RELEASE_VER0 -- X'00A0' bytes                      00051000
*                LRB_RELEASE_VER1 -- X'00F0' bytes                      00052000
*                                                                       00053000
*01* CREATED BY:  IXLLOCK invoker                                       00054000
*                                                                       00055000
*01* POINTED TO BY:  REQBUFFER parameter on IXLLOCK                     00056000
*                                                                       00057000
*01* SERIALIZATION:  See REQBUFFER parameter requirements               00058000
*                    on the IXLLOCK interface description.              00059000
*                                                                       00060000
*01* FUNCTION:                                                          00061000
*02*  The LRB maps the Lock request blocks provided when the IXLLOCK    00062000
*     macro is issued for a PROCESSMULT request.                        00063000
*                                                                       00064000
*01* METHOD OF ACCESS:                                                  00065000
*02*  ASM:    IXLYLRB USING on LRB                                      00066000
*                                                                       00067000
*02*  PL/AS:  %DCL LRB_DCL_ATTR CHAR                                    00068000
*             %LRB_DCL_ATTR = 'based/defined/via attributes'            00069000
*             %INCLUDE SYSLIB(IXLYLRB)                                  00070000
*                                                                       00071000
*             If LRB_DCL_ATTR is not set the LRB will be                00072000
*             declared as BASED.                                        00073000
*                                                                       00074000
*01* DELETED BY:  Invoker of IXLLOCK                                    00075000
*                                                                       00076000
*01* FREQUENCY:   One per resource request which is to be performed     00077000
*                 IXLLOCK PROCESSMULT request.                          00078000
*                                                                       00079000
*01* DEPENDENCIES:  See REQBUFFER parameter requirements                00080000
*                   on the IXLLOCK interface description.               00081000
*                                                                       00082000
*01* DISTRIBUTION LIBRARY:  AMACLIB                                     00083000
*                                                                       00084000
*01* CHANGE ACTIVITY:                                                   00085000
*     $00=OW15590  HBB5520 950909 PD00EO: IXLLOCK ProcessMult support   00086000
*     $L1=ADUPLX   HBB77A0 141130 PD0JES: Asynch duplexing              00087000
*                                                                       00088000
*                                                                       00089000
* NOTES: This control block must start on a double word boundary.       00090000
*                                                                       00091000
*     ALLOCATION-METHOD:  Specific to IXLLOCK invoker.                  00092000
*                         See REQBUFFER parameter requirements          00093000
*                         on the IXLLOCK interface description.         00094000
*                                                                       00095000
*END OF SPECIFICATIONS ***********************************************/ 00096000
*% /*                                                                   00097000
.P0      ANOP                                                           00098000
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 00099000
         AIF   ('&LIST' EQ 'YES').P2                                    00100000
.P1      ANOP                                                           00101000
         PUSH  PRINT                                                    00102000
         PRINT OFF                                                      00103000
.P2      ANOP                                                           00104000
LRB_XTYPE_RELEASEVERS0 EQU 1                                            00105000
LRB_XMODE_SYNCEXIT EQU 0                                                00106000
LRB_XMODE_NORESPONSE EQU 1                                              00107000
LRB_XRDATA_DELETEMASK EQU 32                                            00108000
LRB_XRDATA_KEEPMASK EQU 4                                               00109000
LRB_XREQVERSION0 EQU 0                                                  00110000
LRB_XREQVERSION1 EQU 1                                                  00111000
         AIF   ('&LRB_RELEASE_VER0' EQ 'NO').L0002                      00112000
         AIF   ('&DSECT' EQ 'YES').L0003                                00113000
         AIF   ('&LRB_RELEASE_VER0' NE 'YES').L0002                     00114000
LRB_RELEASE_VER0 DS 0D   IXLLOCK Lock Request Block used for           *00115000
                         specifying a request to release (i.e. Unlock) *00116000
                         a resource and either delete or keep the      *00117000
                         associated record data element                 00118000
         AGO   .L0004                                                   00119000
.L0003   ANOP                                                           00120000
LRB_RELEASE_VER0 DSECT   IXLLOCK Lock Request Block used for           *00121000
                         specifying a request to release (i.e. Unlock) *00122000
                         a resource and either delete or keep the      *00123000
                         associated record data element                 00124000
.L0004   ANOP                                                           00125000
LRB_XTYPE DS   X         LRBs are specified on a request type (Obtain, *00126000
                         Alter, Release) basis. When specifying a      *00127000
                         request using this mapping the user must set  *00128000
                         this field to the value of                    *00129000
                         LRB_XType_ReleaseVers0                         00130000
         DS    CL7       Reserved. Should be initialized to binary     *00131000
                         zeroes                                         00132000
LRB_XRNAME DS  CL64      Resource Name                                  00133000
LRB_XHASHVAL DS F        Hash Value                                     00134000
LRB_XUDATAVAL DS CL64    User Data Value                                00135000
LRB_XMODE DS   X         Mode in which the request should be completed *00136000
                         if XES is unable to do so immediately. Valid  *00137000
                         modes for the type of requests that may be    *00138000
                         specified for this type of LRB are SYNCEXIT   *00139000
                         (specify by constant LRB_MODE_SYNCEXIT) or    *00140000
                         NORESPONSE (Specify by constant               *00141000
                         LRB_MODE_NORESPONSE). Note, SYNCSUSPEND and   *00142000
                         SYNCFAIL mode requests are not supported      *00143000
                         through the Lock Request Block (LRB)          *00144000
                         Interface.                                     00145000
         DS    X         Reserved, should be initialized to binary     *00146000
                         zeroes                                         00147000
LRB_XRDATA DS  0B        Record data options that are to be performed  *00148000
                         as part of releasing the resource. The record *00149000
                         data options that may be validly specified    *00150000
                         via this type of LRB include Delete the       *00151000
                         record data entry (Note, this is processed in *00152000
                         the same manner as an IXLLOCK                 *00153000
                         REQUEST(RELEASE) RDATA(DELETE) request.       *00154000
                         Please consult the IXLLOCK macro for more     *00155000
                         information on this option) or KEEP the       *00156000
                         record data entry (Note, this is processed in  00157000
*                        the same manner as an IXLLOCK                 *00158000
                         REQUEST(RELEASE) RDATA(KEEP) UPDATERDATA(NO). *00159000
                         The ability to update record data when        *00160000
                         keeping it is not supported by this version   *00161000
                         of the LRB. Please consult the IXLLOCK macro  *00162000
                         for more information on this option). If this *00163000
                         field contains a value other than             *00164000
                         LRB_Rdata_Delete_Mask or LRB_Rdata_Keep_Mask  *00165000
                         then XES will treat the request as if         *00166000
                         LRB_RDATA_DELETE_MASK was specified            00167000
LRB_XRDATA_DELETE EQU X'20' When this bit is ON, XES will process this *00168000
                         release request similar to an IXLLOCK         *00169000
                         REQUEST(RELEASE) RDATA(DELETE) request. This  *00170000
                         bit may be explicitly set to ON or the        *00171000
                         LRB_RData_Mask constants may be used to set   *00172000
                         the entire LRB_RData field                     00173000
LRB_XRDATA_KEEP EQU X'04' When this bit is ON, XES will process this   *00174000
                         release request similar to an IXLLOCK         *00175000
                         REQUEST(RELEASE) RDATA(KEEP) UPDATERDATA(NO)  *00176000
                         request. This bit may be explicitly set to ON *00177000
                         or the LRB_RData_Mask constants may be used   *00178000
                         to set the entire LRB_RData field              00179000
         ORG   LRB_XRDATA+1                                             00180000
         DS    CL5       Reserved, should be initialized to binary     *00181000
                         zeroes                                         00182000
LRB_XRETCODE DS F        Return code from this request. Note any       *00183000
                         return code that may be received in response  *00184000
                         to the IXLLOCK request options that are       *00185000
                         analogous to those specified on this Lock     *00186000
                         Request Block may also be received in this    *00187000
                         area. For instance, if the request needs to   *00188000
                         be completed asynchronously due to contention *00189000
                         then this field will contain a warning value  *00190000
                         (rc=4, with the LRB_RSNCode set to            *00191000
                         IxlRsnCodeAsync). Any return codes that deal   00192000
*                        with XES's processing of the request buffer   *00193000
                         as a whole (i.e. processing halted due to     *00194000
                         inaccessible REQBUFFER storage, etc.) are     *00195000
                         returned via the Retcode, rsncode paramaters  *00196000
                         on the IXLLOCK interface                       00197000
LRB_XRSNCODE DS F        Similar to the LRB_Retcode field, this area   *00198000
                         contains the reason code indicating the       *00199000
                         disposition of the request that was specified *00200000
                         via this Lock request Block (LRB)              00201000
         DS    CL4       Reserved, should be initialized to binary     *00202000
                         zeroes                                         00203000
LRB_RELEASE_VER0_LEN EQU *-LRB_RELEASE_VER0                             00204000
.L0002   ANOP                                                           00205000
         AIF   ('&LRB_RELEASE_VER1' EQ 'NO').L0005                      00206000
         AIF   ('&DSECT' EQ 'YES').L0006                                00207000
         AIF   ('&LRB_RELEASE_VER1' NE 'YES').L0005                     00208000
LRB_RELEASE_VER1 DS 0D   IXLLOCK Lock Request Block version 1.          00209000
         AGO   .L0007                                                   00210000
.L0006   ANOP                                                           00211000
LRB_RELEASE_VER1 DSECT   IXLLOCK Lock Request Block version 1.          00212000
.L0007   ANOP                                                           00213000
         DS    CL160     Mapped by LRB_Release_Ver0                     00214000
LRB1_XADUPREQSEQNUM DS CL16 Asynchronous duplexing request sequence    *00215000
                         number. A value of zero implies no            *00216000
                         asynchronous duplexing request sequence       *00217000
                         number was generated for the request. See the *00218000
                         ADupReqSeqNum keyword on the IXLLOCK macro    *00219000
                         for more information.                          00220000
         DS    CL64      Reserved, should be initialized to binary     *00221000
                         zeroes                                         00222000
LRB_RELEASE_VER1_LEN EQU *-LRB_RELEASE_VER1                             00223000
.L0005   ANOP                                                           00224000
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 00225000
         AIF   ('&LIST' EQ 'YES').P4                                    00226000
.P3      ANOP                                                           00227000
         POP   PRINT                                                    00228000
.P4      ANOP                                                           00229000
.P_EXIT  ANOP                                                           00230000
         MEND                                                           00231000
**/ IXLYLRB_2:;                                                         00232000
* %IXLYLRB_INCLUDED = 'YES';                                            00233000
* %DCL ZCBPRINT CHAR EXT;                                               00234000
* %DEACTIVATE ZCBPRINT;                                                 00235000
* %DCL IXLYLRB_LIST CHAR EXT;                                           00236000
* %DEACTIVATE IXLYLRB_LIST;                                             00237000
* %IF IXLYLRB_LIST ^= 'NO' &                                            00238000
*    ZCBPRINT ^= 'NO' %THEN                                             00239000
*   %GOTO IXLYLRB_3;                                                    00240000
*   @LIST PUSH NOECHO;                                                  00241000
*   @LIST NOASSEMBLE NOECHO;                                            00242000
*   @LIST OFF C NOECHO;                                                 00243000
* %IXLYLRB_3:;                                                          00244000
*/* Start of PL/X Source                                             */ 00245000
*                                                                       00246000
* %If LRB_Dcl_Attr = '' %Then                                           00247000
*   %LRB_Dcl_Attr = 'Based';                                            00248000
*                                                                       00249000
* DCL LRB_XType_ReleaseVers0    constant(1);                            00250000
*                                                                       00251000
* DCL LRB_XMODE_SYNCEXIT    FIXED(8) CONSTANT(0);                       00252000
* DCL LRB_XMODE_NORESPONSE  FIXED(8) CONSTANT(1);                       00253000
*                                                                       00254000
* Dcl LRB_XRDATA_DELETEMask constant('00100000'B);                      00255000
* Dcl LRB_XRDATA_KEEPMask   constant('00000100'B);                      00256000
*                                                                       00257000
* Dcl LRB_xReqVersion0 Constant(0);                           /* @L1A*/ 00258000
* Dcl LRB_xReqVersion1 Constant(1);                           /* @L1A*/ 00259000
*                                                                       00260000
* DCL 1 LRB_Release_Ver0 LRB_Dcl_Attr BDY(DWORD), /* IXLLOCK Lock       00261000
*                                      Request Block used for           00262000
*                                      specifying a request to release  00263000
*                                      (i.e.  Unlock) a resource and    00264000
*                                      either delete or keep the        00265000
*                                      associated record data element   00266000
*                                                                    */ 00267000
*       3  LRB_XType      Fixed(8), /* LRBs are specified on a request  00268000
*                                      type (Obtain, Alter, Release)    00269000
*                                      basis.  When specifying a        00270000
*                                      request using this mapping the   00271000
*                                      user must set this field to the  00272000
*                                      value of LRB_XType_ReleaseVers0  00273000
*                                                                    */ 00274000
*       3 *              char(7),   /* Reserved. Should be initialized  00275000
*                                      to binary zeroes              */ 00276000
*       3 LRB_XRname     Char(64),  /* Resource Name                 */ 00277000
*       3 LRB_XHashval   Fixed(32), /* Hash Value                    */ 00278000
*       3 LRB_XUdataval  Char(64),  /* User Data Value               */ 00279000
*       3 LRB_XMode      Fixed(8),  /* Mode in which the request should 00280000
*                                      be completed if XES is unable to 00281000
*                                      do so immediately.  Valid modes  00282000
*                                      for the type of requests that    00283000
*                                      may be specified for this type   00284000
*                                      of LRB are SYNCEXIT (specify by  00285000
*                                      constant LRB_MODE_SYNCEXIT) or   00286000
*                                      NORESPONSE (Specify by constant  00287000
*                                      LRB_MODE_NORESPONSE). Note,      00288000
*                                      SYNCSUSPEND and SYNCFAIL mode    00289000
*                                      requests are not supported       00290000
*                                      through the Lock Request Block   00291000
*                                      (LRB) Interface.              */ 00292000
*       3 *            Fixed(8),    /* Reserved, should be initialized  00293000
*                                      to binary zeroes              */ 00294000
*       3 LRB_XRdata Bit(8),        /* Record data options that are to  00295000
*                                      be performed as part of          00296000
*                                      releasing the resource.  The     00297000
*                                      record data options that may be  00298000
*                                      validly specified via this type  00299000
*                                      of LRB include Delete the record 00300000
*                                      data entry (Note, this is        00301000
*                                      processed in the same manner as  00302000
*                                      an IXLLOCK REQUEST(RELEASE)      00303000
*                                      RDATA(DELETE) request.  Please   00304000
*                                      consult the IXLLOCK macro for    00305000
*                                      more information on this option) 00306000
*                                      or KEEP the record data entry    00307000
*                                      (Note, this is processed in the  00308000
*                                      same manner as an IXLLOCK        00309000
*                                      REQUEST(RELEASE) RDATA(KEEP)     00310000
*                                      UPDATERDATA(NO).  The ability to 00311000
*                                      update record data when keeping  00312000
*                                      it is not supported by this      00313000
*                                      version of the LRB.  Please      00314000
*                                      consult the IXLLOCK macro for    00315000
*                                      more information on this         00316000
*                                      option). If this field contains  00317000
*                                      a value  other than              00318000
*                                      LRB_Rdata_Delete_Mask or         00319000
*                                      LRB_Rdata_Keep_Mask then XES     00320000
*                                      will treat the request as if     00321000
*                                      LRB_RDATA_DELETE_MASK was        00322000
*                                      specified                     */ 00323000
*          5 *                Bit(2), /* Reserved, should be            00324000
*                                      initialized to binary zeroes  */ 00325000
*          5 LRB_XRdata_DELETE Bit(1), /* When this bit is ON, XES will 00326000
*                                      process this release request     00327000
*                                      similar to an IXLLOCK            00328000
*                                      REQUEST(RELEASE) RDATA(DELETE)   00329000
*                                      request. This bit may be         00330000
*                                      explicitly set to ON or the      00331000
*                                      LRB_RData_Mask constants may be  00332000
*                                      used to set the entire LRB_RData 00333000
*                                      field                         */ 00334000
*          5 *                Bit(2), /* Reserved, should be            00335000
*                                      initialized to binary zeroes  */ 00336000
*          5 LRB_XRdata_KEEP   Bit(1), /* When this bit is ON, XES will 00337000
*                                      process this release request     00338000
*                                      similar to an IXLLOCK            00339000
*                                      REQUEST(RELEASE) RDATA(KEEP)     00340000
*                                      UPDATERDATA(NO) request.  This   00341000
*                                      bit may be explicitly set to ON  00342000
*                                      or the LRB_RData_Mask constants  00343000
*                                      may be used to set the entire    00344000
*                                      LRB_RData field               */ 00345000
*          5 *                Bit(2), /* Reserved, should be            00346000
*                                      initialized to binary zeroes  */ 00347000
*       3  *                  char(5), /* Reserved, should be           00348000
*                                      initialized to binary zeroes  */ 00349000
*       3  LRB_XRetCode        Fixed(31), /* Return code from this      00350000
*                                      request.  Note any return code   00351000
*                                      that may be received in response 00352000
*                                      to the IXLLOCK request options   00353000
*                                      that are analogous to those      00354000
*                                      specified on this Lock Request   00355000
*                                      Block may also be received in    00356000
*                                      this area.  For instance, if the 00357000
*                                      request needs to be completed    00358000
*                                      asynchronously due to contention 00359000
*                                      then this field will contain a   00360000
*                                      warning value (rc=4, with the    00361000
*                                      LRB_RSNCode set to               00362000
*                                      IxlRsnCodeAsync).  Any return    00363000
*                                      codes that deal with XES's       00364000
*                                      processing of the request buffer 00365000
*                                      as a whole (i.e.  processing     00366000
*                                      halted due to inaccessible       00367000
*                                      REQBUFFER storage, etc.)  are    00368000
*                                      returned via the Retcode,        00369000
*                                      rsncode paramaters on the        00370000
*                                      IXLLOCK interface             */ 00371000
*       3  LRB_XRsnCode        Fixed(31),/* Similar to the LRB_Retcode  00372000
*                                      field, this area contains the    00373000
*                                      reason code indicating the       00374000
*                                      disposition of the request that  00375000
*                                      was specified via this Lock      00376000
*                                      request Block (LRB)           */ 00377000
*       3 *                   Char(4), /* Reserved, should be           00378000
*                                      initialized to binary zeroes  */ 00379000
*       3 *                   Char(0) Bdy(Dword);                       00380000
*                                                                       00381000
* DCL 1 LRB_Release_Ver1 LRB_Dcl_Attr BDY(DWORD), /* IXLLOCK Lock       00382000
*                                      Request Block version 1.  @L1A*/ 00383000
*       3 * Char(Length(LRB_Release_Ver0)), /* Mapped by                00384000
*                                      LRB_Release_Ver0          @L1A*/ 00385000
*       3 LRB1_xADupReqSeqNum Char(16), /* Asynchronous duplexing       00386000
*                                      request sequence number.  A      00387000
*                                      value of zero implies no         00388000
*                                      asynchronous duplexing request   00389000
*                                      sequence number was generated    00390000
*                                      for the request. See the         00391000
*                                      ADupReqSeqNum keyword on the     00392000
*                                      IXLLOCK macro for more           00393000
*                                      information.              @L1A*/ 00394000
*       3 *              Char(64),  /* Reserved, should be              00395000
*                                      initialized to binary zeroes     00396000
*                                                                @L1A*/ 00397000
*       3 *              Char(0) Bdy(Dword); /*                  @L1A*/ 00398000
*                                                                       00399000
*/* End of PL/X Source                                               */ 00400000
* %IF IXLYLRB_LIST ^= 'NO' &                                            00401000
*    ZCBPRINT ^= 'NO' %THEN                                             00402000
*   %GOTO IXLYLRB_4;                                                    00403000
*   @LIST POP NOECHO;                                                   00404000
* %IXLYLRB_4:;                                                          00405000
* %END;                                                                 00406000
