*                                                                       00001000
* %DCL IXLYCSPA_INCLUDED CHAR EXT;                                      00002000
* %DEACTIVATE IXLYCSPA_INCLUDED;                                        00003000
* %IF IXLYCSPA_INCLUDED = '' %THEN                                      00004000
* %DO;                                                                  00005000
*/* Macro made bi-lingual on 23200. CBGEN compile date 23032         */ 00006000
*% /*                                                                   00007000
         MACRO                                                          00008000
         IXLYCSPA &DSECT=YES,&LIST=YES,&TITLE=YES,&CSPA=YES,           *00009000
               &CSPA_CFLEVELINFO=COND                                   00010000
         GBLC  &IXLYCSPA_INCLUDED                                       00011000
         GBLC  &ZCBPRINT                                                00012000
&IXLYCSPA_INCLUDED SETC 'YES'                                           00013000
         AIF   ('&LIST' EQ 'NONE').P0                                   00014000
         AIF   ('&TITLE' EQ 'NO').P5                                    00015000
 TITLE   'IXLYCSPA  - IXLCSP Request Answer Area                     '  00016000
.P5      ANOP                                                           00017000
**/ ;                                                                   00018000
*/* START OF SPECIFICATIONS ******************************************* 00019000
*                                                                       00020000
*01* SECURITY:                                                          00021000
*                                                                       00022000
*01* PROPRIETARY STATEMENT =                                            00023000
*                                                                       00024000
*    Licensed Materials - Property of IBM                               00025000
*    5650-ZOS                                                           00026000
*    COPYRIGHT IBM CORP. 1999, 2013                                     00027000
*                                                                       00028000
*01* STATUS = HBB7790                                                   00029000
*                                                                       00030000
*01* END OF PROPRIETARY STATEMENT                                       00031000
*                                                                       00032000
*01* EXTERNAL CLASSIFICATION: GUPI                                      00033000
*01* END OF EXTERNAL CLASSIFICATION:                                    00034000
*                                                                       00035000
*01* DESCRIPTIVE NAME:  IXLCSP Request Answer Area                      00036000
*                                                                       00037000
*02* ACRONYM:  CSPA                                                     00038000
*                                                                       00039000
*01* MACRO NAME:  IXLYCSPA                                              00040000
*                                                                       00041000
*01* DSECT NAME:  CSPA                                                  00042000
*                                                                       00043000
*01* COMPONENT:  Cross System Extended Services (SCIXL)                 00044000
*                                                                       00045000
*01* EYE-CATCHER:  NONE                                                 00046000
*                                                                       00047000
*01* STORAGE ATTRIBUTES:                                                00048000
*02*  SUBPOOL:  User supplied                                           00049000
*02*  KEY:  User supplied                                               00050000
*02*  RESIDENCY:  User supplied                                         00051000
*                                                                       00052000
*01* SIZE:  256 bytes                                                   00053000
*            CSPA_CFLEVELINFO -- X'000C' bytes                          00054000
*            CSPA             -- X'0100' bytes                          00055000
*                                                                       00056000
*01* CREATED BY:  Invoker of IXLCSP service.                            00057000
*                                                                       00058000
*01* POINTED TO BY:  ANSAREA parameter on IXLCSP                        00059000
*                                                                       00060000
*01* SERIALIZATION:  NONE                                               00061000
*                                                                       00062000
*01* FUNCTION:  Maps the answer area output from IXLCSP requests        00063000
*                                                                       00064000
*01* METHOD OF ACCESS:                                                  00065000
*02*  ASM:    USING on CSPA                                             00066000
*                                                                       00067000
*02*  PL/AS:  %DCL CSPA_DCL_ATTR CHAR                                   00068000
*             %CSPA_DCL_ATTR = 'based/defined/via attributes'           00069000
*             %INCLUDE SYSLIB(IXLYCSPA)                                 00070000
*                                                                       00071000
*             If CSPA_DCL_ATTR is not set the CSPA will be              00072000
*             declared as BASED.                                        00073000
*                                                                       00074000
*01* DELETED BY:  Invoker of IXLCSP service.                            00075000
*                                                                       00076000
*01* FREQUENCY:  One per IXLCSP invocation                              00077000
*                                                                       00078000
*01* DEPENDENCIES:  See the ANSAREA parameter requirements on the       00079000
*                   IXLCSP interface description.                       00080000
*                                                                       00081000
*01* DISTRIBUTION LIBRARY: AMACLIB                                      00082000
*                                                                       00083000
*01* CHANGE ACTIVITY:                                                   00084000
*     $L0=AUTOR    HBB6608 980824 PD00BN: Auto rebuild                  00085000
*     $P1=PWK0209  HBB6608 980914 PD00BD: Additional diagnostics        00086000
*     $L1=MQ       JBB6609 990126 PD00BJ: MQSeries Support              00087000
*     $01=OA02870  HBB7707 030731 PD00BN: Cspa_ListLockEntries          00088000
*     $L2=CFFLASH  HBB7790 120630 PD00BN: CF flash exploitation         00089000
*     $P2=ME25211  HBB7790 121121 PD00OF: 4K block sizes, WORD boundary 00090000
*     $P3=ME25524  HBB7790 130128 PD00BN: Cspa_DiagnosticCode validity  00091000
*     $L3=OA63685  HBB77D0 230419 PD00BN: Selectable CFLEVEL for        00092000
*                                         structure sizing              00093000
*                                                                       00094000
* NOTES: This control block must start on a word boundary.              00095000
*                                                                       00096000
* END OF SPECIFICATIONS **********************************************/ 00097000
*% /*                                                                   00098000
.P0      ANOP                                                           00099000
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 00100000
         AIF   ('&LIST' EQ 'YES').P2                                    00101000
.P1      ANOP                                                           00102000
         PUSH  PRINT                                                    00103000
         PRINT OFF                                                      00104000
.P2      ANOP                                                           00105000
         AIF   ('&CSPA' EQ 'NO').L0002                                  00106000
         AIF   ('&DSECT' EQ 'YES').L0003                                00107000
         AIF   ('&CSPA' NE 'YES').L0002                                 00108000
CSPA     DS    0F        IXLCSP answer area                             00109000
         AGO   .L0004                                                   00110000
.L0003   ANOP                                                           00111000
CSPA     DSECT           IXLCSP answer area                             00112000
.L0004   ANOP                                                           00113000
CSPA_HEADER DS CL32      Header information                             00114000
         ORG   CSPA_HEADER                                              00115000
CSPA_VERSION DS H        IXLYCSPA version number                        00116000
CSPA_LENGTH DS H         Length of the answer area                      00117000
CSPA_OFFSET DS H         Offset from the beginning of the structure    *00118000
                         (CSPA) to the answer area data (CSPA_Data)     00119000
         DS    CL26      Reserved                                       00120000
CSPA_DATA DS   CL224     Data returned by IXLCSP                        00121000
         ORG   CSPA_DATA                                                00122000
CSPA_COMMONDATA DS CL64  Data common to all IXLCSP SERVICE=COMPUTE     *00123000
                         requests                                       00124000
         ORG   CSPA_COMMONDATA                                          00125000
CSPA_STRSIZE DS F        Structure size in 4K blocks                    00126000
CSPA_MAXSIZE DS F        Maximum structure size in 4K blocks            00127000
CSPA_MINSIZE DS F        Minimum structure size in 4K blocks            00128000
CSPA_MARGINALSIZE DS F   Marginal structure size in 4K blocks           00129000
CSPA_MRCS DS   F         Minimum required control storage in 4K blocks  00130000
CSPA_DIAGNOSTICCODE DS H Diagnostic code. Set only when IXLCSP         *00131000
                         RC='04'x and RSN is 'xxxx0431'x, or RC='08'x  *00132000
                         and RSN is one of the following values:       *00133000
                         'xxxx0881'x, 'xxxx088C'x, 'xxxx088E'x,        *00134000
                         'xxxx08B1'x. Constants for the diagnostic     *00135000
                         codes when RSN='xxxx088C'x are defined below. *00136000
                         Diagnostic codes for the other reasons are    *00137000
                         defined in IXLYCON.                            00138000
         DS    H         Reserved.                                      00139000
CSPA_ACTUALCFLEVEL DS F  CFLEVEL for which calculation was performed.  *00140000
                         Valid if not zero.                             00141000
CSPA_NEEDEDCFLEVEL DS F  The CFLEVEL supported by by the designated    *00142000
                         coupling facility must be greater than or     *00143000
                         equal to this value in order to process the   *00144000
                         compute request. Valid for use if not zero     00145000
CSPA_SCMMAXSIZE DS CL8   Maximum amount of storage-class (flash)       *00146000
                         memory in 4K blocks that may be associated    *00147000
                         with the target structure                      00148000
CSPA_ESTMAXAUGSPACE DS F Estimated maximum augmented space in 4K       *00149000
                         blocks that may be required to support SCM    *00150000
                         maximum size                                   00151000
CSPA_FIXEDAUGSPACE DS F  Minimum amount of augmented space in 4K       *00152000
                         blocks that is always assigned to the         *00153000
                         structure                                      00154000
         DS    CL16      Reserved                                       00155000
CSPA_STRTYPEDATA DS CL96 Output data specific to the target structure  *00156000
                         type                                           00157000
*                                                                       00158000
*  ------------------------------------------------------------------   00159000
*   CSPA_OutData: Cache structure                                       00160000
*  ------------------------------------------------------------------   00161000
*                                                                       00162000
*                                                                       00163000
         ORG   CSPA_STRTYPEDATA                                         00164000
CSPA_CACHEDATA DS CL96   Cache-specific output                          00165000
         ORG   CSPA_CACHEDATA                                           00166000
CSPA_CACHEDIRENTRYCOUNT DS F Number of directory entries that can be   *00167000
                         contained in the target structure              00168000
CSPA_CACHEELEMENTCOUNT DS F Total number of elements that can be       *00169000
                         contained in the target structure              00170000
CSPA_CACHEDIRTOELEMENTRATIO DS F Directory- to-element ratio that      *00171000
                         could be achieved in the target structure      00172000
         ORG   CSPA_CACHEDIRTOELEMENTRATIO                              00173000
CSPA_CACHEDIRRATIO DS H  Directory part of the directory-to-element    *00174000
                         ratio                                          00175000
CSPA_CACHEELEMENTRATIO DS H Element part of the directory-to- element  *00176000
                         ratio                                          00177000
         DS    CL84      Reserved                                       00178000
*                                                                       00179000
*  ------------------------------------------------------------------   00180000
*   CSPA_OutData: List structure                                        00181000
*  ------------------------------------------------------------------   00182000
*                                                                       00183000
*                                                                       00184000
         ORG   CSPA_STRTYPEDATA                                         00185000
CSPA_LISTDATA DS CL96    List-specific output                           00186000
         ORG   CSPA_LISTDATA                                            00187000
CSPA_LISTEMCCOUNT DS F   Number of event monitor controls that can be  *00188000
                         contained in the target structure              00189000
CSPA_LISTENTRYCOUNT DS F Number of list entries that can be contained  *00190000
                         in the target structure                        00191000
CSPA_LISTELEMENTCOUNT DS F Total number of elements that can be        *00192000
                         contained in the target structure              00193000
CSPA_LISTEMCSTGPCT DS H  Percentage of structure storage over the      *00194000
                         marginal structure size that can be allocated *00195000
                         to event monitor controls in the target       *00196000
                         structure. Expressed as a decimal number in   *00197000
                         hundredths of a percent.                       00198000
         DS    CL2       Reserved                                       00199000
CSPA_LISTENTRYTOELEMENTRATIO DS F Entry- to-element ratio that could   *00200000
                         be achieved in the target structure            00201000
         ORG   CSPA_LISTENTRYTOELEMENTRATIO                             00202000
CSPA_LISTENTRYRATIO DS H Entry part of the entry-to-element ratio       00203000
CSPA_LISTELEMENTRATIO DS H Element part of the entry-to-element ratio   00204000
CSPA_LISTLOCKENTRIES DS F Number of lock entries that can be contained *00205000
                         in the target structure. Valid on either      *00206000
                         successful computation or return code 8       *00207000
                         reason code IxlRsnCodeBadStructureSize        *00208000
                         (xxxx0888)                                     00209000
CSPA_LISTSCMENTRYCOUNT DS CL8 Estimated number of list entries that    *00210000
                         can be contained in the storage-class memory  *00211000
                         associated with the target structure           00212000
CSPA_LISTSCMELEMENTCOUNT DS CL8 Estimated number of data elements that *00213000
                         can be contained in the storage-class memory  *00214000
                         associated with the target structure           00215000
CSPA_LISTSCMENTRYOVERFLOW DS CL8 Estimated number of list entries in   *00216000
                         excess of 2**32 - 1 that could be             *00217000
                         accommodated by the input amount of SCM        00218000
CSPA_LISTSCMELEMENTOVERFLOW DS CL8 Estimated number of data elements   *00219000
                         in excess of 2**32 - 1 that could be          *00220000
                         accommodated by the input amount of SCM        00221000
         DS    CL40      Reserved                                       00222000
*                                                                       00223000
*  ------------------------------------------------------------------   00224000
*   CSPA_OutData: Lock structure                                        00225000
*  ------------------------------------------------------------------   00226000
*                                                                       00227000
*                                                                       00228000
         ORG   CSPA_STRTYPEDATA                                         00229000
CSPA_LOCKDATA DS CL96    Lock-specific output                           00230000
         ORG   CSPA_LOCKDATA                                            00231000
CSPA_LOCKRDATAENTRYCOUNT DS F Number of record data entries that can   *00232000
                         be contained in the target structure           00233000
CSPA_LOCKENTRIES DS F    Number of lock entries that can be contained  *00234000
                         in the target structure. Valid on either      *00235000
                         successful computation or return code 8       *00236000
                         reason code IxlRsnCodeBadStructureSize        *00237000
                         (xxxx0888)                                     00238000
         DS    CL88      Reserved                                       00239000
         DS    CL64      Reserved                                       00240000
CSPA_END DS    0C        End IXLCSP answer area                         00241000
CSPA_LEN EQU   *-CSPA                                                   00242000
.L0002   ANOP                                                           00243000
         AIF   ('&CSPA_CFLEVELINFO' EQ 'NO').L0005                      00244000
         AIF   ('&DSECT' EQ 'YES').L0006                                00245000
         AIF   ('&CSPA_CFLEVELINFO' NE 'YES').L0005                     00246000
.L0006   ANOP                                                           00247000
*                                                                       00248000
*  ------------------------------------------------------------------   00249000
*   Output from IXLCSP SERVICE=QUERY                                    00250000
*                                                                       00251000
*   Located by adding CSPA_Offset to the address of the CSPA.           00252000
*  ------------------------------------------------------------------   00253000
*                                                                       00254000
*                                                                       00255000
         AIF   ('&DSECT' EQ 'YES').L0007                                00256000
CSPA_CFLEVELINFO DS 0F                                                  00257000
         AGO   .L0008                                                   00258000
.L0007   ANOP                                                           00259000
CSPA_CFLEVELINFO DSECT                                                  00260000
.L0008   ANOP                                                           00261000
CSPA_CFLEVELCOUNT DS F   Number of valid entries in CSPA_CFLevelArray   00262000
CSPA_CFLEVELARRAY DS CL8 Array of CFLEVEL information                   00263000
         ORG   CSPA_CFLEVELARRAY                                        00264000
CSPA_CFLEVELVALUE DS F   CFLEVEL value                                  00265000
CSPA_CFLEVELFLAGS DS B   CFLEVEL flags                                  00266000
*                                                                       00267000
* ********************************************************************  00268000
* * CSPA_CFLevelConnected and CSPA_CFLevelEmulated are not mutually     00269000
*   exclusive.  If both are on, the sizing request may be directed      00270000
*   to an actual CF or may be processed by software, as conditions      00271000
*   dictate.                                                            00272000
* ********************************************************************  00273000
*                                                                       00274000
*                                                                       00275000
*  Bit definitions:                                                     00276000
CSPA_CFLEVELCONNECTED EQU X'80' On => A CF with this CFLEVEL is        *00277000
                         connected to the system initiating the IXLCSP *00278000
                         request. In processing a sizing request       *00279000
                         specifying this CFLEVEL, the system may       *00280000
                         select any connected CF that supports it.      00281000
CSPA_CFLEVELEMULATED EQU X'40' On => The system has support for        *00282000
                         emulating this CFLEVEL in software.            00283000
         DS    CL3       Reserved                                       00284000
CSPAKSIZELEVEL0 EQU 256  Size in bytes of CSPA at macro level 0         00285000
CSPALEVELNUM EQU 0       Macro level number                             00286000
*                                                                       00287000
* ********************************************************************  00288000
* * Constants for CSPA_DiagnosticCode when RSN='xxxx0431'x,             00289000
*   'xxxx0881'x, 'xxxx088E'x, and 'xxxx08B1'x are defined in            00290000
*   IXLYCON.                                                            00291000
* ********************************************************************  00292000
* ********************************************************************  00293000
* * Constants for CSPA_DiagnosticCode when RSN='xxxx088C'x              00294000
* ********************************************************************  00295000
*                                                                       00296000
*                                                                       00297000
CSPA_BADMAXSIZE EQU 4    Maximum structure size outside CF limits       00298000
CSPA_BADLISTHEADERS EQU 6 Number of list headers outside CF limits      00299000
CSPA_BADLISTELEMCHAR EQU 7 List element characteristic outside CF      *00300000
                         limits                                         00301000
CSPA_BADLOCKNUMUSERS EQU 8 Number of lock structure users outside CF   *00302000
                         limits                                         00303000
CSPA_BADLOCKENTRIES EQU 9 Number of locks outside CF limits             00304000
CSPA_BADLISTMAXELEMNUM EQU 10 Maximum entry size (maximum number of    *00305000
                         elements) outside CF limits                    00306000
CSPA_BADLISTENTRYTOELEMRATIO EQU 11 Entry- to-element ratio            *00307000
                         (EntryRatio and ElementRatio keywords)        *00308000
                         outside CF limits                              00309000
CSPA_BADLISTENTRYCOUNT EQU 12 Maximum entry count outside CF limits     00310000
CSPA_BADLISTELEMENTCOUNT EQU 13 Maximum element count outside CF       *00311000
                         limits                                         00312000
CSPA_BADLISTSTRUCTURETYPE EQU 17 List structure attributes             *00313000
                         inconsistent. Can be caused by specifying     *00314000
                         ListCntlType= Element when the structure has  *00315000
                         no data.                                       00316000
CSPA_BADCACHEELEMCHAR EQU 18 Cache element characteristic outside CF   *00317000
                         limits                                         00318000
CSPA_BADCACHENUMCOCLASS EQU 19 Maximum number of castout classes       *00319000
                         outside CF limits                              00320000
CSPA_BADCACHEMAXELEMNUM EQU 20 Maximum entry size (maximum number of   *00321000
                         elements) outside CF limits                    00322000
CSPA_BADCACHENUMSTGCLASS EQU 21 Maximum number of storage classes      *00323000
                         outside CF limits                              00324000
CSPA_BADCACHEDIRTOELEMRATIO EQU 22 Directory- to-element ratio         *00325000
                         (DirRatio and ElementRatio keywords) outside  *00326000
                         CF limits                                      00327000
CSPA_BADCACHEDIRENTRYCOUNT EQU 23 Maximum directory entry count        *00328000
                         outside CF limits                              00329000
CSPA_BADCACHEELEMENTCOUNT EQU 24 Maximum element count outside CF      *00330000
                         limits                                         00331000
CSPA_BADSCMELEMENTCOUNT EQU 128 Count of elements in storage-class     *00332000
                         memory outside CF limits                       00333000
CSPA_CFLEVELINFO_LEN EQU *-CSPA_CFLEVELINFO                             00334000
.L0005   ANOP                                                           00335000
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 00336000
         AIF   ('&LIST' EQ 'YES').P4                                    00337000
.P3      ANOP                                                           00338000
         POP   PRINT                                                    00339000
.P4      ANOP                                                           00340000
.P_EXIT  ANOP                                                           00341000
         MEND                                                           00342000
**/ ;                                                                   00343000
* %IXLYCSPA_INCLUDED = 'YES';                                           00344000
* %DCL ZCBPRINT CHAR EXT;                                               00345000
* %DEACTIVATE ZCBPRINT;                                                 00346000
* %DCL IXLYCSPA_LIST CHAR EXT;                                          00347000
* %DEACTIVATE IXLYCSPA_LIST;                                            00348000
* %IF IXLYCSPA_LIST = 'NO' !                                            00349000
*    ZCBPRINT = 'NO' %THEN                                              00350000
* %DO;                                                                  00351000
*   @LIST PUSH NOECHO;                                                  00352000
*   @LIST NOASSEMBLE NOECHO;                                            00353000
*   @LIST OFF C NOECHO;                                                 00354000
* %END;                                                                 00355000
*/* Start of PL/X Source                                             */ 00356000
*                                                                       00357000
* %If CSPA_Dcl_Attr = '' %Then                                          00358000
*   %CSPA_Dcl_Attr = 'Based';                                           00359000
*                                                                       00360000
* Dcl 1 CSPA CSPA_Dcl_Attr Bdy(Word), /* IXLCSP answer area          */ 00361000
*       3 CSPA_Header Bdy(Word),    /* Header information            */ 00362000
*         5 CSPA_Version Fixed(16), /* IXLYCSPA version number       */ 00363000
*         5 CSPA_Length Fixed(16),  /* Length of the answer area     */ 00364000
*         5 CSPA_Offset Fixed(16),  /* Offset from the beginning        00365000
*                                      of the structure (CSPA) to       00366000
*                                      the answer area data             00367000
*                                      (CSPA_Data)                   */ 00368000
*         5 * Char(26),             /* Reserved                      */ 00369000
*       3 CSPA_Data Bdy(Word),      /* Data returned by IXLCSP       */ 00370000
*         5 CSPA_CommonData,        /* Data common to all IXLCSP        00371000
*                                      SERVICE=COMPUTE requests  @L3C*/ 00372000
*           7 CSPA_StrSize FIXED(32), /* Structure size in 4K           00373000
*                                      blocks                    @P2C*/ 00374000
*           7 CSPA_MaxSize FIXED(32), /* Maximum structure size in      00375000
*                                      4K blocks                 @P2C*/ 00376000
*           7 CSPA_MinSize FIXED(32), /* Minimum structure size in      00377000
*                                      4K blocks                 @P2C*/ 00378000
*           7 CSPA_MarginalSize FIXED(32), /* Marginal structure        00379000
*                                      size in 4K blocks         @P2C*/ 00380000
*           7 CSPA_MRCS FIXED(32),  /* Minimum required control         00381000
*                                      storage in 4K blocks      @P2C*/ 00382000
*           7 CSPA_DiagnosticCode Fixed(16), /* Diagnostic code.        00383000
*                                      Set only when IXLCSP RC='04'x    00384000
*                                      and RSN is 'xxxx0431'x, or       00385000
*                                      RC='08'x and RSN is one          00386000
*                                      of the following values:         00387000
*                                      'xxxx0881'x, 'xxxx088C'x,        00388000
*                                      'xxxx088E'x, 'xxxx08B1'x.        00389000
*                                      Constants for the diagnostic     00390000
*                                      codes when RSN='xxxx088C'x       00391000
*                                      are defined below.               00392000
*                                      Diagnostic codes for the         00393000
*                                      other reasons are defined in     00394000
*                                      IXLYCON.                  @P3C*/ 00395000
*           7 *                   Fixed(16), /* Reserved.        @L1A*/ 00396000
*           7 CSPA_ActualCfLevel Fixed(32), /* CFLEVEL for which        00397000
*                                      calculation was performed.       00398000
*                                      Valid if not zero.        @L3C*/ 00399000
*           7 CSPA_NeededCfLevel Fixed(32), /* The CFLEVEL supported by 00400000
*                                      by the designated coupling       00401000
*                                      facility must be greater than or 00402000
*                                      equal to this value in order to  00403000
*                                      process the compute request.     00404000
*                                      Valid for use if not zero @L1A*/ 00405000
*           7 CSPA_ScmMaxSize CHAR(8), /* Maximum amount of             00406000
*                                      storage-class (flash) memory     00407000
*                                      in 4K blocks that may be         00408000
*                                      associated with the target       00409000
*                                      structure                 @P2C*/ 00410000
*           7 CSPA_EstMaxAugSpace FIXED(32), /* Estimated maximum       00411000
*                                      augmented space in 4K blocks     00412000
*                                      that may be required to          00413000
*                                      support SCM maximum size  @P2C*/ 00414000
*           7 CSPA_FixedAugSpace Fixed(32),  /* Minimum amount of       00415000
*                                      augmented space in 4K blocks     00416000
*                                      that is always assigned to       00417000
*                                      the structure             @P3A*/ 00418000
*           7 * Char(16),           /* Reserved                  @P3C*/ 00419000
*         5 CSPA_StrTypeData UNION Bdy(Word),  /* Output data           00420000
*                                      specific to the target           00421000
*                                      structure type                */ 00422000
*/*------------------------------------------------------------------*/ 00423000
*/* CSPA_OutData: Cache structure                                    */ 00424000
*/*------------------------------------------------------------------*/ 00425000
*           7 CSPA_CacheData Bdy(Word),  /* Cache-specific output    */ 00426000
*             9 CSPA_CacheDirEntryCount Fixed(32),  /* Number of        00427000
*                                      directory entries that can       00428000
*                                      be contained in the target       00429000
*                                      structure                     */ 00430000
*             9 CSPA_CacheElementCount Fixed(32),  /* Total number of   00431000
*                                      elements that can be             00432000
*                                      contained in the target          00433000
*                                      structure                     */ 00434000
*             9 CSPA_CacheDirToElementRatio Fixed(32),  /* Directory-   00435000
*                                      to-element ratio that            00436000
*                                      could be achieved in the         00437000
*                                      target structure              */ 00438000
*               11 CSPA_CacheDirRatio Fixed(16),  /* Directory part of  00439000
*                                      the directory-to-element         00440000
*                                      ratio                         */ 00441000
*               11 CSPA_CacheElementRatio Fixed(16), /* Element part    00442000
*                                      of the directory-to-             00443000
*                                      element ratio                 */ 00444000
*             9 * Char(84),         /* Reserved                      */ 00445000
*/*------------------------------------------------------------------*/ 00446000
*/* CSPA_OutData: List structure                                     */ 00447000
*/*------------------------------------------------------------------*/ 00448000
*           7 CSPA_ListData Bdy(Word),  /* List-specific output      */ 00449000
*             9 CSPA_ListEMCCount Fixed(32),  /* Number of event        00450000
*                                      monitor controls that can        00451000
*                                      be contained in the target       00452000
*                                      structure                     */ 00453000
*             9 CSPA_ListEntryCount Fixed(32),  /* Number of list       00454000
*                                      entries that can be              00455000
*                                      contained in the target          00456000
*                                      structure                     */ 00457000
*             9 CSPA_ListElementCount Fixed(32),  /* Total number of    00458000
*                                      elements that can be             00459000
*                                      contained in the target          00460000
*                                      structure                     */ 00461000
*             9 CSPA_ListEMCStgPct Fixed(16),  /* Percentage of         00462000
*                                      structure storage over           00463000
*                                      the marginal structure           00464000
*                                      size that can be allocated       00465000
*                                      to event monitor controls        00466000
*                                      in the target structure.         00467000
*                                      Expressed as a decimal           00468000
*                                      number in hundredths of a        00469000
*                                      percent.                      */ 00470000
*             9 * Char(2),          /* Reserved                      */ 00471000
*             9 CSPA_ListEntryToElementRatio Fixed(32),  /* Entry-      00472000
*                                      to-element ratio that            00473000
*                                      could be achieved in the         00474000
*                                      target structure              */ 00475000
*               11 CSPA_ListEntryRatio Fixed(16),  /* Entry part of     00476000
*                                      the entry-to-element             00477000
*                                      ratio                         */ 00478000
*               11 CSPA_ListElementRatio Fixed(16), /* Element part     00479000
*                                      of the entry-to-element          00480000
*                                      ratio                         */ 00481000
*             9 CSPA_ListLockEntries Fixed(32),  /* Number of lock      00482000
*                                      entries that can be              00483000
*                                      contained in the target          00484000
*                                      structure.  Valid on either      00485000
*                                      successful computation or        00486000
*                                      return code 8 reason code        00487000
*                                      IxlRsnCodeBadStructureSize       00488000
*                                      (xxxx0888)                @01A*/ 00489000
*             9 CSPA_ListScmEntryCount CHAR(8), /* Estimated            00490000
*                                      number of list entries that      00491000
*                                      can be contained in the          00492000
*                                      storage-class memory             00493000
*                                      associated with the target       00494000
*                                      structure                 @P2C*/ 00495000
*             9 CSPA_ListScmElementCount CHAR(8), /* Estimated          00496000
*                                      number of data elements that     00497000
*                                      can be contained in the          00498000
*                                      storage-class memory             00499000
*                                      associated with the target       00500000
*                                      structure                 @P2C*/ 00501000
*             9 CSPA_ListScmEntryOverflow CHAR(8), /* Estimated         00502000
*                                      number of list entries in        00503000
*                                      excess of 2**32 - 1 that could   00504000
*                                      be accommodated by the input     00505000
*                                      amount of SCM             @P2C*/ 00506000
*             9 CSPA_ListScmElementOverflow CHAR(8), /* Estimated       00507000
*                                      number of data elements in       00508000
*                                      excess of 2**32 - 1 that could   00509000
*                                      be accommodated by the input     00510000
*                                      amount of SCM             @P2C*/ 00511000
*             9 * Char(40),         /* Reserved                  @L2C*/ 00512000
*/*------------------------------------------------------------------*/ 00513000
*/* CSPA_OutData: Lock structure                                     */ 00514000
*/*------------------------------------------------------------------*/ 00515000
*           7 CSPA_LockData Bdy(Word),  /* Lock-specific output      */ 00516000
*             9 CSPA_LockRDataEntryCount Fixed(32),  /* Number of       00517000
*                                      record data entries that         00518000
*                                      can be contained in the          00519000
*                                      target structure              */ 00520000
*             9 CSPA_LockEntries Fixed(32),  /* Number of lock          00521000
*                                      entries that can be              00522000
*                                      contained in the target          00523000
*                                      structure.  Valid on either      00524000
*                                      successful computation or        00525000
*                                      return code 8 reason code        00526000
*                                      IxlRsnCodeBadStructureSize       00527000
*                                      (xxxx0888)                @01C*/ 00528000
*             9 * Char(88),         /* Reserved                      */ 00529000
*         5 * Char(64),             /* Reserved                      */ 00530000
*       3 CSPA_End Char(0);         /* End IXLCSP answer area        */ 00531000
*                                                                       00532000
*                                                                       00533000
*/*------------------------------------------------------------------*/ 00534000
*/* Output from IXLCSP SERVICE=QUERY                                    00535000
*                                                                       00536000
*   Located by adding CSPA_Offset to the address of the CSPA.    @L3A*/ 00537000
*/*------------------------------------------------------------------*/ 00538000
*                                                                       00539000
* Dcl 1 CSPA_CFLevelInfo Based Bdy(Word),                               00540000
*       3 CSPA_CFLevelCount Fixed(32),  /* Number of valid entries      00541000
*                                      in CSPA_CFLevelArray      @L3A*/ 00542000
*       3 CSPA_CFLevelArray(*),     /* Array of CFLEVEL                 00543000
*                                      information               @L3A*/ 00544000
*         5 CSPA_CFLevelValue Fixed(32),  /* CFLEVEL value       @L3A*/ 00545000
*                                                                       00546000
*         5 CSPA_CFLevelFlags Bit(8),  /* CFLEVEL flags          @L3A*/ 00547000
*                                                                       00548000
*/********************************************************************/ 00549000
*/* CSPA_CFLevelConnected and CSPA_CFLevelEmulated are not mutually     00550000
*   exclusive.  If both are on, the sizing request may be directed      00551000
*   to an actual CF or may be processed by software, as conditions      00552000
*   dictate.                                                     @L3A*/ 00553000
*/********************************************************************/ 00554000
*           7 CSPA_CFLevelConnected Bit(1),  /* On => A CF with         00555000
*                                      this CFLEVEL is connected        00556000
*                                      to the system initiating         00557000
*                                      the IXLCSP request.  In          00558000
*                                      processing a sizing request      00559000
*                                      specifying this CFLEVEL,         00560000
*                                      the system may select any        00561000
*                                      connected CF that supports       00562000
*                                      it.                       @L3A*/ 00563000
*           7 CSPA_CFLevelEmulated Bit(1),  /* On => The system         00564000
*                                      has support for emulating        00565000
*                                      this CFLEVEL in software. @L3A*/ 00566000
*           7 * Bit(6),             /* Reserved                  @L3A*/ 00567000
*         5 * Char(3);              /* Reserved                  @L3A*/ 00568000
*                                                                       00569000
*                                                                       00570000
*                                                                       00571000
* Dcl CSPAKSizeLevel0 Fixed(31) Constant(256);  /* Size in              00572000
*                                      bytes of CSPA at macro           00573000
*                                      level 0                       */ 00574000
*                                                                       00575000
* Dcl CSPALevelNum Fixed(31) Constant(0);  /* Macro level number     */ 00576000
*                                                                       00577000
*                                                                       00578000
*/********************************************************************/ 00579000
*/* Constants for CSPA_DiagnosticCode when RSN='xxxx0431'x,             00580000
*   'xxxx0881'x, 'xxxx088E'x, and 'xxxx08B1'x are defined in            00581000
*   IXLYCON.                                                     @P3C*/ 00582000
*/********************************************************************/ 00583000
*                                                                       00584000
*                                                                       00585000
*/********************************************************************/ 00586000
*/* Constants for CSPA_DiagnosticCode when RSN='xxxx088C'x       @L1C*/ 00587000
*/********************************************************************/ 00588000
* Dcl CSPA_BadMaxSize Fixed(16) Constant(4);  /* Maximum structure      00589000
*                                      size outside CF limits    @P1A*/ 00590000
* Dcl CSPA_BadListHeaders Fixed(16) Constant(6);  /* Number of          00591000
*                                      list headers outside CF          00592000
*                                      limits                    @P1A*/ 00593000
* Dcl CSPA_BadListElemChar Fixed(16) Constant(7);  /* List              00594000
*                                      element characteristic           00595000
*                                      outside CF limits         @P1A*/ 00596000
* Dcl CSPA_BadLockNumUsers Fixed(16) Constant(8);  /* Number of         00597000
*                                      lock structure users             00598000
*                                      outside CF limits         @P1A*/ 00599000
* Dcl CSPA_BadLockEntries Fixed(16) Constant(9);  /* Number of          00600000
*                                      locks outside CF limits   @P1A*/ 00601000
* Dcl CSPA_BadListMaxElemNum Fixed(16) Constant(10);  /* Maximum        00602000
*                                      entry size (maximum number       00603000
*                                      of elements) outside CF          00604000
*                                      limits                    @P1A*/ 00605000
* Dcl CSPA_BadListEntryToElemRatio Fixed(16) Constant(11);  /* Entry-   00606000
*                                      to-element ratio (EntryRatio     00607000
*                                      and ElementRatio keywords)       00608000
*                                      outside CF limits         @P1A*/ 00609000
* Dcl CSPA_BadListEntryCount Fixed(16) Constant(12);  /* Maximum        00610000
*                                      entry count outside CF           00611000
*                                      limits                    @P1A*/ 00612000
* Dcl CSPA_BadListElementCount Fixed(16) Constant(13);  /* Maximum      00613000
*                                      element count outside CF         00614000
*                                      limits                    @P1A*/ 00615000
* Dcl CSPA_BadListStructureType Fixed(16) Constant(17);  /* List        00616000
*                                      structure attributes             00617000
*                                      inconsistent.  Can be caused     00618000
*                                      by specifying ListCntlType=      00619000
*                                      Element when the structure       00620000
*                                      has no data.              @01A*/ 00621000
* Dcl CSPA_BadCacheElemChar Fixed(16) Constant(18);  /* Cache           00622000
*                                      element characteristic           00623000
*                                      outside CF limits         @P1A*/ 00624000
* Dcl CSPA_BadCacheNumCoClass Fixed(16) Constant(19);  /* Maximum       00625000
*                                      number of castout classes        00626000
*                                      outside CF limits         @P1A*/ 00627000
* Dcl CSPA_BadCacheMaxElemNum Fixed(16) Constant(20);  /* Maximum       00628000
*                                      entry size (maximum number       00629000
*                                      of elements) outside CF          00630000
*                                      limits                    @P1A*/ 00631000
* Dcl CSPA_BadCacheNumStgClass Fixed(16) Constant(21);  /* Maximum      00632000
*                                      number of storage classes        00633000
*                                      outside CF limits         @P1A*/ 00634000
* Dcl CSPA_BadCacheDirToElemRatio Fixed(16) Constant(22); /* Directory- 00635000
*                                      to-element ratio (DirRatio       00636000
*                                      and ElementRatio keywords)       00637000
*                                      outside CF limits         @P1A*/ 00638000
* Dcl CSPA_BadCacheDirEntryCount Fixed(16) Constant(23);  /* Maximum    00639000
*                                      directory entry count            00640000
*                                      outside CF limits         @P1A*/ 00641000
* Dcl CSPA_BadCacheElementCount Fixed(16) Constant(24);  /* Maximum     00642000
*                                      element count outside CF         00643000
*                                      limits                    @P1A*/ 00644000
* Dcl CSPA_BadScmElementCount Fixed(16) Constant(128);  /* Count of     00645000
*                                      elements in storage-class        00646000
*                                      memory outside CF limits  @L2A*/ 00647000
*                                                                       00648000
* %Deactivate CSPA_Dcl_Attr;                                            00649000
*                                                                       00650000
*/* End of PL/X Source                                               */ 00651000
* %IF IXLYCSPA_LIST = 'NO' !                                            00652000
*    ZCBPRINT = 'NO' %THEN                                              00653000
* %DO;                                                                  00654000
*   @LIST POP NOECHO;                                                   00655000
* %END;                                                                 00656000
* %END;                                                                 00657000
