*                                                                       00001000
* %DCL IZUGSP_INCLUDED CHAR EXT;                                        00002000
* %DEACTIVATE IZUGSP_INCLUDED;                                          00003000
* %IF IZUGSP_INCLUDED = '' %THEN                                        00004000
* %DO;                                                                  00005000
*/* Macro made bi-lingual on 18136. CBGEN compile date 15295         */ 00006000
*% /*                                                                   00007000
         MACRO                                                          00008000
         IZUGSP &DSECT=YES,&LIST=YES,&TITLE=YES,&IZUGSP=YES             00009000
                      GBLC  &IZUGSP_INCLUDED                            00010000
                      GBLC  &ZCBPRINT                                   00011000
&IZUGSP_INCLUDED      SETC  'YES'                                       00012000
                      AIF   ('&LIST' EQ 'NONE').P0                      00013000
                      AIF   ('&TITLE' EQ 'NO').P5                       00014000
 TITLE                'IZUGSP  - IZUGSP                                *00015000
                        '                                               00016000
.P5                   ANOP                                              00017000
**/ IZUGSP_1:;                                                          00018000
*/* START OF SPECIFICATIONS ******************************************* 00019000
*                                                                       00020000
*01* PROPRIETARY STATEMENT =                                            00021000
*                                                                       00022000
*    Licensed Materials - Property of IBM                               00023000
*    5650-ZOS                                                           00024000
*    COPYRIGHT IBM CORP. 2017                                           00025000
*                                                                       00026000
*01* STATUS = HSMA230                                                   00027000
*                                                                       00028000
*01* END OF PROPRIETARY STATEMENT                                       00029000
*                                                                       00030000
*01* EXTERNAL CLASSIFICATION:                                           00031000
*02*   NOTPI: BASE                                                      00032000
*02*   PI:    FIELDS                                                    00033000
*             IZUGSP_Status                                             00034000
*             IZUGSP_URI                                                00035000
*             IZUGSP_URI_LEN                                            00036000
*01* END OF EXTERNAL CLASSIFICATION:                                    00037000
*                                                                       00038000
*01* DESCRIPTIVE NAME:  IZUGSP                                          00039000
*02*  ACRONYM:  IZUGSP                                                  00040000
*                                                                       00041000
*01* MACRO NAME:  IZUGSP                                                00042000
*                                                                       00043000
*01* DSECT NAME:                                                        00044000
*     IZUGSP                                                            00045000
*                                                                       00046000
*01* COMPONENT:  z/OSMF (S28SM)                                         00047000
*                                                                       00048000
*01* EYE-CATCHER:  IZUGSP                                               00049000
*02*   OFFSET:   0                                                      00050000
*02*   LENGTH:   8                                                      00051000
*                                                                       00052000
*01* STORAGE ATTRIBUTES:                                                00053000
*02*  SUBPOOL:  241                                                     00054000
*02*  KEY:   0                                                          00055000
*02*  RESIDENCY: Above 16M line                                         00056000
*                                                                       00057000
*01* SIZE:                                                              00058000
*             IZUGSP -- X'07A0' bytes                                   00059000
*                                                                       00060000
*01* CREATED BY:                                                        00061000
*     IZUINSTR                                                          00062000
*                                                                       00063000
*01* POINTED TO BY:                                                     00064000
*     ECVTIZUGSP                                                        00065000
*                                                                       00066000
*01* SERIALIZATION:                                                     00067000
*     The data is serialized by ENQ with QNAME=SYSZIZU and              00068000
*     RNAME=IZUGSP                                                      00069000
*                                                                       00070000
*     The following fields need to be serialized                        00071000
*     IZUGSP_Valid                                                      00072000
*     IZUGSP_URI                                                        00073000
*     IZUGSP_CURR_MEMLST                                                00074000
*     IZUGSP_AUTOSTART_GROUP                                            00075000
*     IZUGSP_HOSTNAME                                                   00076000
*     IZUGSP_SSL_PORT                                                   00077000
*     IZUGSP_LOCAL                                                      00078000
*     IZUGSP_REMOTE                                                     00079000
*                                                                       00080000
*01* FUNCTION:                                                          00081000
*02* Maintain the z/OSMF autostart server information and status        00082000
*                                                                       00083000
*01* METHOD OF ACCESS:                                                  00084000
*02*  ASM:                                                              00085000
*      IZUGSP                                                           00086000
*           DSECT=YES!NO  -- Request DSECT definition                   00087000
*           IZUGSP=YES!NO!COND -- Request Header record mapping         00088000
*                            USING on IZUGSP                            00089000
*     Default: DSECT=YES,IZUGSP=YES,                                    00090000
*     Notes: name=YES  => expand                                        00091000
*            name=NO   => do not expand                                 00092000
*            name=COND => expand only if DSECT=YES                      00093000
*                                                                       00094000
*02*   PL/X:                                                            00095000
*                                                                       00096000
*        %INCLUDE SYSLIB(IZUGSP)                                        00097000
*                                                                       00098000
*01* DELETED BY:                                                        00099000
*        N/A                                                            00100000
*                                                                       00101000
*01* FREQUENCY:  1 per system                                           00102000
*                                                                       00103000
*01* DEPENDENCIES:  NONE                                                00104000
*                                                                       00105000
*01* DISTRIBUTION LIBRARY:  AMACLIB                                     00106000
*                                                                       00107000
*01* CHANGE ACTIVITY:                                                   00108000
*  $L0=ZOSMF    HSMA230 161225 PD00xx: z/OSMF                           00109000
*                                                                       00110000
* END OF SPECIFICATIONS *********************************************/  00111000
*% /*                                                                   00112000
.P0                   ANOP                                              00113000
                      AIF   ('&ZCBPRINT' EQ 'NO').P1                    00114000
                      AIF   ('&LIST' EQ 'YES').P2                       00115000
.P1                   ANOP                                              00116000
                      PUSH  PRINT                                       00117000
                      PRINT OFF                                         00118000
.P2                   ANOP                                              00119000
                      AIF   ('&IZUGSP' EQ 'NO').L0002                   00120000
                      AIF   ('&DSECT' EQ 'YES').L0003                   00121000
                      AIF   ('&IZUGSP' NE 'YES').L0002                  00122000
IZUGSP                DS    0D     IZUPRMxx Parameter Area              00123000
                      AGO   .L0004                                      00124000
.L0003                ANOP                                              00125000
IZUGSP                DSECT        IZUPRMxx Parameter Area              00126000
.L0004                ANOP                                              00127000
IZUGSP_ID             DS    CL8    eyecather                            00128000
IZUGSP_Status         DS    B                                           00129000
*  Bit definitions:                                                     00130000
IZUGSP_Valid          EQU   X'80'  ON=Valid,OFF=Not valid If ON,       *00131000
                                   z/OSMF autostart server is          *00132000
                                   available to connect. URI of z/OSMF *00133000
                                   can be extracted from IZUGSP_URI.   *00134000
                                   If OFF, z/OSMF autostart server is  *00135000
                                   not available                        00136000
                      DS    X      reserved                             00137000
IZUGSP_URI_LEN        DS    H      Length of URI of z/OSMF autostart   *00138000
                                   server                               00139000
IZUGSP_URI            DS    CL274  URI of z/OSMF autostart server The  *00140000
                                   URI is full form. For example:      *00141000
                                   https://PEV001.POK.IB               *00142000
                                   M.COM:52278/zosmf. Valid characters *00143000
                                   are those up through the length     *00144000
                                   indicated in IZUGSP_URI_LEN          00145000
*                                                                       00146000
* ********************************************************************  00147000
* * The following fields are used by z/OSMF internally]]]            *  00148000
* ********************************************************************  00149000
*                                                                       00150000
*                                                                       00151000
                      DS    H      reserved                             00152000
IZUGSP_IZUINSTP_ECB   DS    F      ECB used between new task and       *00153000
                                   dependent address space              00154000
IZUGSP_WORK_ECB       DS    F      ECB used to wake up IZUINSTR to     *00155000
                                   process internal events for ENF83    00156000
IZUGSP_CURR_MEMLST    DS    CL116  PREV member list                     00157000
IZUGSP_FSNAME         DS    CL44   File system name                     00158000
IZUGSP_AUTOSTART_GROUP DS   CL32   Name identified by the              *00159000
                                   autostart_GROUP parameter of the    *00160000
                                   IZUPRMxx parmlib member              00161000
                      ORG   IZUGSP_AUTOSTART_GROUP                      00162000
IZUGSP_ZOSMF_NAME     DS    CL32   Same as IZUGSP_AUTOSTART_GROUP_NAME  00163000
IZUGSP_USER_DIR       DS    CL1024 User directory                       00164000
IZUGSP_HOSTNAME       DS    CL253  Hostname of z/OSMF instance          00165000
                      DS    CL3    reserved                             00166000
IZUGSP_SSL_PORT       DS    F      SSL port of z/OSMF instance          00167000
IZUGSP_USER_DIR_LEN   DS    H      User directory Len                   00168000
IZUGSP_HOSTNAME_LEN   DS    H      HOSTNAME Len                         00169000
IZUGSP_FSNAME_LEN     DS    H      File system name length              00170000
IZUGSP_CURR_MEMLST_LEN DS   H      PREV member list Len                 00171000
IZUGSP_FIRST_WORK_ADDR DS   A      The first address of work elements. *00172000
                                   The work elements are internal      *00173000
                                   ENF83 events                         00174000
IZUGSP_FLAGS          DS    B                                           00175000
*  Bit definitions:                                                     00176000
IZUGSP_IZUINSTP_Complete EQU X'80' ON=COMPLETE, OFF=INCOMPLETE If      *00177000
                                   ON,the depend address space         *00178000
                                   completes the detection. If OFF,    *00179000
                                   the detection is not complete yet.   00180000
IZUGSP_LOCAL          EQU   X'40'  AUTOSTART is LOCAL                   00181000
IZUGSP_REMOTE         EQU   X'20'  AUTOSTART is REMOTE                  00182000
IZUGSP_ENQ_STATE      EQU   X'10'  ENQ state for concurrent             00183000
IZUGSP_PARMLIB_SFX    DS    CL116                                       00184000
IZUGSP_EnqToken       DS    CL32   out token for ENQ                    00185000
IZUGSP_Server_Job_name DS   CL8    AUTOSTART server jobname             00186000
                      DS    CL1    reserved                             00187000
IZUGSP_PARMLIB_SFX_LEN DS   H                                           00188000
                      DS    CL8    reserved                             00189000
IZUGSP_Len            EQU   *-IZUGSP                                    00190000
.L0002                ANOP                                              00191000
                      AIF   ('&ZCBPRINT' EQ 'NO').P3                    00192000
                      AIF   ('&LIST' EQ 'YES').P4                       00193000
.P3                   ANOP                                              00194000
                      POP   PRINT                                       00195000
.P4                   ANOP                                              00196000
.P_EXIT               ANOP                                              00197000
                      MEND                                              00198000
**/ IZUGSP_2:;                                                          00199000
* %IZUGSP_INCLUDED = 'YES';                                             00200000
* %DCL ZCBPRINT CHAR EXT;                                               00201000
* %DEACTIVATE ZCBPRINT;                                                 00202000
* %DCL IZUGSP_LIST CHAR EXT;                                            00203000
* %DEACTIVATE IZUGSP_LIST;                                              00204000
* %IF IZUGSP_LIST ^= 'NO' &                                             00205000
*    ZCBPRINT ^= 'NO' %THEN                                             00206000
*   %GOTO IZUGSP_3;                                                     00207000
*   @LIST PUSH NOECHO;                                                  00208000
*   @LIST NOASSEMBLE NOECHO;                                            00209000
*   @LIST OFF C NOECHO;                                                 00210000
* %IZUGSP_3:;                                                           00211000
*/* Start of PL/X Source                                             */ 00212000
*%if IZUGSP_Based = '' %Then                                            00213000
*   %IZUGSP_Based = 'ECVTIZUGSP';                                       00214000
*Dcl 1 IZUGSP  BASED(IZUGSP_Based) Bdy(DWord),   /* IZUPRMxx            00215000
*                                               Parameter Area       */ 00216000
*     3 IZUGSP_ID CHAR(8),          /* eyecather                     */ 00217000
*     3 IZUGSP_Status  BIT(8),                                          00218000
*      5 IZUGSP_Valid      BIT(1),  /* ON=Valid,OFF=Not valid           00219000
*                                      If ON, z/OSMF autostart server   00220000
*                                      is available  to connect. URI    00221000
*                                      of z/OSMF can be extracted from  00222000
*                                      IZUGSP_URI. If OFF, z/OSMF       00223000
*                                      autostart server is not          00224000
*                                      available                     */ 00225000
*      5 *               BIT(7),     /* reserved                     */ 00226000
*     3 *                FIXED(8),   /* reserved                     */ 00227000
*     3 IZUGSP_URI_LEN FIXED(16),   /* Length of URI of z/OSMF          00228000
*                                       autostart server             */ 00229000
*     3 IZUGSP_URI CHAR(274),  /*URI of z/OSMF autostart                00230000
*                                      server                           00231000
*                                      The URI is full form.            00232000
*                                      For example:                     00233000
*                            https://PEV001.POK.IBM.COM:52278/zosmf.    00234000
*                            Valid characters are those up through the  00235000
*                            length indicated in IZUGSP_URI_LEN      */ 00236000
*/********************************************************************/ 00237000
*/* The following fields are used by z/OSMF internally]]]            */ 00238000
*/********************************************************************/ 00239000
*     3 *                FIXED(16),  /* reserved                     */ 00240000
*     3 IZUGSP_IZUINSTP_ECB FIXED(31),  /* ECB used between new task    00241000
*                                       and dependent address space  */ 00242000
*     3 IZUGSP_WORK_ECB FIXED(31),      /* ECB used to wake up          00243000
*                                       IZUINSTR to process internal    00244000
*                                       events for ENF83             */ 00245000
*     3 IZUGSP_CURR_MEMLST CHAR(116),      /* PREV member list       */ 00246000
*     3 IZUGSP_FSNAME        CHAR(44),   /* File system name         */ 00247000
*     3 IZUGSP_AUTOSTART_GROUP  CHAR(32),  /* Name identified           00248000
*                                         by the autostart_GROUP        00249000
*                                         parameter of the IZUPRMxx     00250000
*                                         parmlib member            */  00251000
*      5 IZUGSP_ZOSMF_NAME CHAR(32),     /* Same as                     00252000
*                                       IZUGSP_AUTOSTART_GROUP_NAME  */ 00253000
*     3 IZUGSP_USER_DIR CHAR(1024),        /* User directory         */ 00254000
*     3 IZUGSP_HOSTNAME CHAR(253),  /* Hostname of z/OSMF instance   */ 00255000
*     3 *               CHAR(3),    /* reserved                      */ 00256000
*     3 IZUGSP_SSL_PORT FIXED(32),  /* SSL port of z/OSMF instance   */ 00257000
*     3 IZUGSP_USER_DIR_LEN  Fixed(16),    /* User directory Len     */ 00258000
*     3 IZUGSP_HOSTNAME_LEN  Fixed(16),  /* HOSTNAME Len             */ 00259000
*     3 IZUGSP_FSNAME_LEN  Fixed(16),  /* File system name length    */ 00260000
*     3 IZUGSP_CURR_MEMLST_LEN Fixed(16),  /* PREV member list Len   */ 00261000
*     3 IZUGSP_FIRST_WORK_ADDR Ptr(31),  /* The first address of work   00262000
*                                         elements. The work elements   00263000
*                                         are internal ENF83 events  */ 00264000
*     3 IZUGSP_FLAGS       BIT(8),                                      00265000
*      5 IZUGSP_IZUINSTP_Complete  BIT(1),  /* ON=COMPLETE,             00266000
*                                              OFF=INCOMPLETE           00267000
*                                       If ON,the depend address space  00268000
*                                       completes the detection.        00269000
*                                       If OFF, the detection is not    00270000
*                                       complete yet.                */ 00271000
*      5 IZUGSP_LOCAL      BIT(1),      /* AUTOSTART is LOCAL        */ 00272000
*      5 IZUGSP_REMOTE     BIT(1),      /* AUTOSTART is REMOTE       */ 00273000
*      5 IZUGSP_ENQ_STATE  BIT(1),      /* ENQ state for concurrent  */ 00274000
*      5 IZUGSP_SETCMD_ON  BIT(1),      /* SET command flag  */                 
*      5 IZUGSP_UPDCMD_ON  BIT(1),      /* UPDATE flag  */                      
*      5 IZUGSP_MATCMD_ON  BIT(1),      /* MATCH flag  */                       
*      5 *                 BIT(1),      /* reserved                  */         
*     3 IZUGSP_PARMLIB_SFX CHAR(116),                                   00276000
*     3 IZUGSP_EnqToken    CHAR(32),  /* out token for ENQ           */ 00277000
*     3 IZUGSP_Server_Job_name  CHAR(8),  /* AUTOSTART server jobname*/ 00278000
*     3 * CHAR(1),                    /* reserved                    */ 00279000
*     3 IZUGSP_PARMLIB_SFX_LEN Fixed(16),                               00280000
*     3 IZUGSP_AUTOSTART_SYSNAME CHAR(8),  /* SYSNAME for AUTOSTART  */         
*     3 IZUGSP_SET_PARAMETER CHAR(126),    /* SYSNAME for AUTOSTART  */         
*     3 * CHAR(0) BDY(DWORD);         /* end of IZUGSP               */ 00282000
*                                                                       00283000
*                                                                               
*    /************************/                                                 
*    /* Constants for IZUGSP */                                                 
*    /************************/                                                 
*Dcl IZUGSP_kCBNAME   Char(8) Constant('IZUGSP  ');                             
*                                                                               
*Dcl IZUGSP_ENQMinorName   Char(6) Constant('IZUGSP');                          
*                                                                               
*Dcl IZUGSP_ENQMajorName   Char(8) constant('SYSZIZU ');                        
*                                                                               
*Dcl IZUGSP_Subpool   Constant(241);                                            
*                                                                               
*Dcl IZUGSP_MaxValidSfxCnt Fixed(31) Constant(38);                              
*                                                                               
*Dcl IZUGSP_MemberSuffixListLen Fixed(31)                                       
*       Constant( 1 + (IZUGSP_MaxValidSfxCnt * 2) +                             
*                  (IZUGSP_MaxValidSfxCnt * 1 - 1) +  1 + 1 );                  
*                                                                       00284000
*@LOGIC;                                                                00285000
*#PRAGMA TOOL=CBGEN.                                                    00286000
*#USEORG.                                                               00287000
*#ALIGNOP.                                                              00288000
*#NOTUPPER.                                                             00289000
*#EPRAGMA.                                                              00290000
*@ENDLOGIC;                                                             00291000
*/* End of PL/X Source                                               */ 00292000
* %IF IZUGSP_LIST ^= 'NO' &                                             00293000
*    ZCBPRINT ^= 'NO' %THEN                                             00294000
*   %GOTO IZUGSP_4;                                                     00295000
*   @LIST POP NOECHO;                                                   00296000
* %IZUGSP_4:;                                                           00297000
* %END;                                                                 00298000
