*  /* START OF SPECIFICATIONS ***************************************** 00050000
*                                                                     * 00100000
*01*  MODULE-NAME = LXRES                                             * 00150000
*                                                                     * 00200000
*01*  DESCRIPTIVE-NAME = LINKAGE INDEX RESERVE MACRO                  * 00250000
*                                                                     * 00300000
*01*  COPYRIGHT =                                                     * 00341600
*            5694-A01                                                 * 00383200
*            THIS MODULE IS "RESTRICTED MATERIALS OF IBM"             * 00424800
*            (C)COPYRIGHT IBM CORP. 1980, 2004                        * 00466400
*            LICENSED MATERIALS - PROPERTY OF IBM                     * 00508000
*                                                                     * 00550000
*01*  STATUS = HBB7709                                                * 00583300
*                                                                     * 00616600
*01*  EXTERNAL CLASSIFICATION: PI                                     * 00627700
*01*  END OF EXTERNAL CLASSIFICATION:                                 * 00638800
*                                                                     * 00650000
*01*  FUNCTION = INTERFACE TO THE LXRES SERVICE                       * 00700000
*                                                                     * 00750000
*01*  NOTES = THE 'SYSTEM' PARAMETER DEFAULTS TO 'NO' ONLY FOR        * 00800000
*             STANDARD OR LIST FORMS OF THE MACRO OR,IN PL/S,         * 00850000
*             FOR MODIFY OR EXECUTE FORMS SPECIFYING 'COMPLETE'.      * 00900000
*                                                                     * 00950000
*01*  MODULE-TYPE = MACRO                                             * 01000000
*                                                                     * 01050000
*01*  PROCESSOR = ASSEMBLER,PL/S-III (BILINGUAL)              @ZM50111* 01100000
*                                                                     * 01137500
*01*  MACROS = IHBERMAC,AHALXRES                                      * 01175000
*                                                                     * 01212500
*01*  CHANGE ACTIVITY =       NEW FOR OS/VS2 JBB1226.                 * 01250000
*                             UPDATE BOTH BAL AND PL/S MACDATE        * 01268700
*                             WHENEVER THIS MACRO IS CHANGED.         * 01287500
*                             THE S/D CODE IS @G387PXX.               * 01325000
*             VS50111 - (PL/S) FORCE RC=12 ON NULL LXLIST(1). @ZM50111* 01362500
*             PBB0031 - (PL/S) PTR NOTATION CHECKS INVALID.   @ZMB0031* 01381200
*             OY04740 - (ASM) LXLIST ADDRESS INCORRECT ON EXECUTE     * 01385900
*                             FORM IF LXLIST SPECIFIED AS REGISTER    * 01390600
*                             FORM.                           @YA04740* 01395300
*           $P1=PIG1968,HBB5510,930616,PDXB: Savearea                 * 01397600
*   $L1=LXREU    HBB7709  030801  PD00XB:  ASN-and-LX-Reuse Facility    01398800
*                                                                     * 01400000
*01*  MNOTES = IHB001 LXLIST OPERAND REQUIRED, NOT SPECIFIED          * 01450000
*              IHB002 INVALID SYSTEM OPERAND - ___                    * 01500000
*              IHB002 INVALID REUSABLE OPERAND - ____             @L1A* 01516600
*              IHB002 INVALID LXSIZE OPERAND - ____               @L1A* 01533200
*              IHB002 INVALID LXLIST OPERAND - ___                    * 01550000
*              IHB002 INVALID MF OPERAND - ___                        * 01600000
*              IHB027 EXCESSIVE POSITIONAL PARAMETERS SPECIFIED       * 01650000
*              IHB280 REG FORM LIST ADDRESS INVALID WITH MF=L         * 01700000
*                                                                     * 01750000
*01*  PL/S MSGS = AS FOLLOWS:                                         * 01800000
*     AHA0013 MF(2) (LISTNAME) IS REQUIRED BUT IS NOT SUPPLIED.       * 01850000
*             NO TEXT IS GENERATED.                                   * 01900000
*     AHA0013 LXLIST(1) (LIST ADDR) IS REQUIRED BUT IS NOT SPECIFIED. * 01950000
*             NO TEXT IS GENERATED.                                   * 02000000
*     AHA0013 LXLIST IS REQUIRED FOR STANDARD FORM BUT IS NOT         * 02050000
*             SPECIFIED. NO TEXT IS GENERATED.                        * 02100000
*     AHA0023 BASED FORM LXLIST ADDRESS '_' INVALID WITH MF(L).       * 02150000
*             NO TEXT IS GENERATED.                                   * 02200000
*     AHA0023 POINTER FORM LXLIST ADDRESS '_' INVALID WITH MF(L).     * 02250000
*             NO TEXT IS GENERATED.                                   * 02300000
*     AHA0023 'COMPLETE' IS INVALID WITH MF(L). NO TEXT IS GENERATED. * 02350000
*     AHA0033 MF - '_' - HAS TOO MANY ARGUMENTS. NO TEXT IS GENERATED.* 02400000
*     AHA0033 LXLIST - '_' - HAS TOO MANY ARGUMENTS.                  * 02450000
*             NO TEXT IS GENERATED.                                   * 02500000
*     AHA0033 SYSTEM - '_' - HAS TOO MANY ARGUMENTS.                  * 02550000
*             NO TEXT IS GENERATED.                                   * 02600000
*     AHA0033 REUSABLE - '_' - HAS TOO MANY ARGUMENTS.                * 02610000
*             NO TEXT IS GENERATED.                                   * 02620000
*     AHA0033 LXSIZE - '_' - HAS TOO MANY ARGUMENTS.                  * 02630000
*             NO TEXT IS GENERATED.                                   * 02640000
*     AHA0043 MF(1) MUST BE 'L,E OR M'. NO TEXT IS GENERATED.         * 02650000
*     AHA0043 MF(3) MUST BE 'COMPLETE' WITH MF(E) OR MF(M).           * 02700000
*             NO TEXT IS GENERATED.                                   * 02750000
*     AHA0043 SYSTEM MUST BE 'YES' OR 'NO'. NO TEXT IS GENERATED.     * 02800000
*     AHA0043 REUSABLE MUST BE 'YES' OR 'NO'. NO TEXT IS GENERATED.   * 02816600
*     AHA0043 LXSIZE MUST BE '12', '16', '23', or '24'                * 02833200
*     AHA0053 THE MACLIST '_' IS NOT ALLOWED. NO TEXT IS GENERATED.   * 02850000
*                                                                     * 02900000
*A000000-999999                                                @G387PXX 02950000
***** END OF SPECIFICATIONS ******************************************* 03050000
         MACRO                                                          03200000
&LABL    LXRES &LXLIST=,   REQUIRED RX OR REG FORM LIST ADDR   (INPUT) X03250000
               &ELXLIST=,  REQUIRED RX OR REG FORM LIST ADDR     @L1A  X03275000
               &SYSTEM=,   OPTIONAL, MUST BE 'YES' OR 'NO'     (INPUT) X03300000
               &REUSABLE=, OPTIONAL, MUST BE 'YES' OR 'NO'       @L1A  X03316600
               &LXSIZE=, OPTIONAL, MUST BE '12', '16', '23', '24' @L1A X03333200
               &MF=,       OPTIONAL MACRO FORM (DEFAULTS TO STANDARD)  X03350000
               &RELATED=   OPTIONAL VALUE FOR DOCUMENTATION             03400000
         GBLC  &SYSOSREL                                           @L1A 03412500
         GBLC  &SYSOSREL_ZOSV1R6                                   @L1A 03425000
         SYSSTATE TEST                                             @L1A 03437500
.*                                                                      03450000
.********************************************************************** 03500000
.*       DECLARE ARITHMETIC VARIABLES                                 * 03550000
.********************************************************************** 03600000
         LCLA  &A          GENERAL USAGE LOCAL ARITH. VAR.              03650000
         LCLA  &OPTNI      MASK FOR NI OF OPTIONS BYTE                  03700000
         LCLA  &OPTOI      MASK FOR OI OF OPTIONS BYTE                  03750000
.********************************************************************** 03800000
.*       DECLARE BIT VARIABLES                                        * 03850000
.********************************************************************** 03900000
         LCLB  &B(8)       OPTIONS BITS                                 03950000
         LCLB  &N(8)       NI MASK BITS                                 04000000
         LCLB  &O(8)       OI MASK BITS                                 04050000
         LCLB  &S(9)       OPTIONS SPECIFIED BITS                       04100000
.********************************************************************** 04150000
.*       DECLARE CHARACTER VARIABLES                                  * 04200000
.********************************************************************** 04250000
         LCLC  &BOPTS      OPTIONS BYTE INIT STRING FOR STD. FORM       04300000
         LCLC  &EPLV       HOLDS E-FORM PARMADDR FOR USE IN LA/R INST.  04350000
         LCLC  &GNAME1     LABEL FOR STANDARD FORM                      04400000
         LCLC  &GNAMEL     LABEL FOR STANDARD FORM                      04450000
         LCLC  &LT1        LOAD TYPE 1 - THIS VARIABLE WILL BE:         04500000
.*                              'R' IF LXLIST IS A REG TYPE ADDR        04550000
.*                           OR 'A' IF LXLIST IS AN RX TYPE ADDR        04600000
         LCLC  &LT2        LOAD TYPE 2 - THIS VARIABLE WILL BE:         04650000
.*                              'R' IF E-FORM PARM IS A REG TYPE ADDR   04700000
.*                           OR 'A' IF E-FORM PARM IS AN RX TYPE ADDR   04750000
         LCLC  &LXLV       HOLDS VALUE OF LXLIST FOR USE IN LA/R INST.  04800000
         LCLC  &OPERAND    HOLDS OPERAND STRINGS FOR MNOTES             04850000
         LCLC  &OPVAL      HOLDS OPERAND VALUES FOR MNOTES              04900000
         LCLC  &P1         CHAR VARIABLE FOR 'SYSTEM' PARM              04950000
         LCLC  &P2         CHAR VARIABLE FOR 'REUSABLE' PARM       @L1A 04966600
         LCLC  &P3         CHAR VARIABLE FOR 'LXSIZE' PARM         @L1A 04983200
.*                                                                      05000000
.********************************************************************** 05050000
.*       INITIALIZE ARITHMETIC VARIABLES                              * 05100000
.********************************************************************** 05150000
&OPTNI   SETA  255      INIT TO TURN OFF NO OPTIONS                     05200000
&OPTOI   SETA  0        INIT TO TURN ON NO OPTIONS                      05250000
.********************************************************************** 05300000
.*       INITIALIZE BIT VARIABLES                                     * 05350000
.********************************************************************** 05400000
&B(1)    SETB  0   SHOW SYSTEM=NO                                       05450000
&B(2)    SETB  0   SHOW REUSABLE=NO                                @L1A 05500000
&B(3)    SETB  0   SHOW LXSIZE^=16                                 @L1A 05550000
&B(4)    SETB  0   SHOW LXSIZE^=23                                 @L1A 05600000
&B(5)    SETB  0   SHOW LXSIZE^=24                                 @L1A 05650000
&B(6)    SETB  0   SHOW no ELXLIST                                 @L1A 05700000
&B(7)    SETB  0        RESERVED BIT- MUST BE ZERO                      05750000
&B(8)    SETB  0        RESERVED BIT- MUST BE ZERO                      05800000
.* IF AN NI-MASK BIT IS SET TO ZERO, THE NI WILL TURN OFF THE OPTION    05850000
&N(1)    SETB  1   NI-MASK BIT TO TURN OFF 'SYSTEM' OPTION              05900000
&N(2)    SETB  1   NI-MASK BIT TO TURN OFF 'REUSABLE' OPTION       @L1A 05950000
&N(3)    SETB  1   NI-MASK BIT TO TURN OFF 'LXSIZE' OPTION         @L1A 06000000
&N(4)    SETB  1   NI-MASK BIT TO TURN OFF 'LXSIZE' OPTION         @L1A 06050000
&N(5)    SETB  1   NI-MASK BIT TO TURN OFF 'LXSIZE' OPTION         @L1A 06100000
&N(6)    SETB  1   NI-MASK BIT TO TURN OFF 'ELXLIST' OPTION        @L1A 06150000
&N(7)    SETB  1        RESERVED BIT- MUST BE ONE                       06200000
&N(8)    SETB  1        RESERVED BIT- MUST BE ONE                       06250000
.* IF AN OI-MASK BIT IS SET TO ONE, THE OI WILL TURN ON THE OPTION      06300000
&O(1)    SETB  0   OI-MASK BIT TO TURN ON 'SYSTEM' OPTION               06350000
&O(2)    SETB  0   OI-MASK BIT TO TURN ON 'REUSABLE' OPTION        @L1A 06400000
&O(3)    SETB  0   OI-MASK BIT TO TURN ON 'LXSIZE=16' OPTION       @L1A 06450000
&O(4)    SETB  0   OI-MASK BIT TO TURN ON 'LXSIZE=23' option       @L1A 06500000
&O(5)    SETB  0   OI-MASK BIT TO TURN ON 'LXSIZE=24' option       @L1A 06550000
&O(6)    SETB  0   OI-MASK IT TO TURN ON 'ELXLIST' OPTION          @L1A 06600000
&O(7)    SETB  0        RESERVED BIT- MUST BE ZERO                      06650000
&O(8)    SETB  0        RESERVED BIT- MUST BE ZERO                      06700000
.*       AN 'S' BIT ON MEANS THE PARM WAS SPECIFIED                     06750000
&S(1)    SETB  0   SHOW SYSTEM NOT SPECIFIED                            06800000
&S(2)    SETB  0   SHOW REUSABLE NOT SPECIFIED                     @L1A 06850000
&S(3)    SETB  0   SHOW LXSIZE=16 not specified                    @L1A 06900000
&S(4)    SETB  0   SHOW LXSIZE=23 not specified                    @L1A 06950000
&S(5)    SETB  0   SHOW LXSIZE=24 not specified                    @L1A 07000000
&S(6)    SETB  0   SHOW ELXLIST NOT SPECIFIED                      @L1A 07050000
&S(7)    SETB  0        RESERVED BIT- MUST BE ZERO                      07100000
&S(8)    SETB  0        RESERVED BIT- MUST BE ZERO                      07150000
&S(9)    SETB  0   SHOW LXLIST NOT SPECIFIED                            07200000
.*                                                                      07250000
.********************************************************************** 07300000
.*       PUT OUT BAL MACDATE COMMENT LINE REGARDLESS OF ERRORS.       * 07350000
.********************************************************************** 07400000
*              MACDATE = 87.118                                @YA04740 07450000
.********************************************************************** 07500000
.*       CHECK FOR EXTRANEOUS POSITIONAL PARMS                        * 07550000
.********************************************************************** 07600000
         AIF   (N'&SYSLIST NE 0).ERR027                                 07650000
         AIF   ('&LXLIST' NE '' AND '&ELXLIST' NE '').ERR281       @L1A 07675000
.********************************************************************** 07700000
.*       VALIDATE LXLIST PARAMETER IF PRESENT                         * 07750000
.********************************************************************** 07800000
&S(9)    SETB  (T'&LXLIST NE 'O')       IF OPTION SPECIFIED SET BIT     07850000
         AIF   (T'&LXLIST EQ 'O').OK20  IF NOT, GO CHECK SYSTEM PARM    07900000
&OPERAND SETC  'LXLIST'                 SET FOR POSSIBLE ERROR MSGS     07950000
&OPVAL   SETC  '&LXLIST'                SET FOR POSSIBLE ERROR MSGS     08000000
         AIF   ('&REUSABLE' EQ '').OKR1                            @L1A 08008300
         AIF   ('&REUSABLE(1)' EQ 'NO').OKR1                       @L1A 08016600
&OPVAL   SETC  'REUSABLE=YES'           SET FOR ERROR MSG          @L1A 08024900
         AGO   .ERR280                                             @L1A 08033200
.OKR1    ANOP                                                      @L1A 08041500
.*   DETERMINE WHETHER LXLIST ADDRESS IS RX OR REG TYPE                 08050000
         AIF   ('&LXLIST'(1,1) EQ '(').OK11   BRANCH IF REG TYPE        08100000
&LXLV    SETC  '&LXLIST'                SET VALUE FOR USE IN LOAD INST. 08150000
&LT1     SETC  'A'                      SET TO 'LA' FOR RX TYPE ADDR    08200000
         AGO   .OK20                    GO CHECK SYSTEM PARAMETER       08250000
.OK11    ANOP                                                           08300000
&LT1     SETC  'R'                      SET TO 'LR' FOR REG TYPE ADDR   08350000
&LXLV    SETC  '&LXLIST(1)'             EXTRACT REGISTER NAME           08400000
         AIF   (N'&LXLIST NE 1).ERR002  BR IF INVALID REG FORM          08420000
.OK20    ANOP                                                           08421400
.********************************************************************** 08422800
.*       VALIDATE ELXLIST PARAMETER IF PRESENT                    @L1A* 08424200
.********************************************************************** 08425600
&S(6)    SETB  (T'&ELXLIST NE 'O')      IF OPTION SPECIFIED SET BIT     08427000
&B(6)    SETB  (T'&ELXLIST NE 'O')      IF OPTION SPECIFIED SET BIT     08428400
&O(6)    SETB  (T'&ELXLIST NE 'O')      IF OPTION SPECIFIED SET BIT     08429800
         AIF   (T'&ELXLIST EQ 'O').OKE20 IF NOT, GO CHECK SYSTEM PARM   08431200
&OPERAND SETC  'ELXLIST'                SET FOR POSSIBLE ERROR MSGS     08432600
&OPVAL   SETC  '&ELXLIST'               SET FOR POSSIBLE ERROR MSGS     08434000
.*   DETERMINE WHETHER ELXLIST ADDRESS IS RX OR REG TYPE                08435400
         AIF   ('&ELXLIST'(1,1) EQ '(').OKE11 BRANCH IF REG TYPE        08436800
&LXLV    SETC  '&ELXLIST'               SET VALUE FOR USE IN LOAD INST. 08438200
&LT1     SETC  'A'                      SET TO 'LA' FOR RX TYPE ADDR    08439600
         AGO   .OKE20                   GO CHECK SYSTEM PARAMETER       08441000
.OKE11   ANOP                                                           08442400
&LT1     SETC  'R'                      SET TO 'LR' FOR REG TYPE ADDR   08443800
&LXLV    SETC  '&ELXLIST(1)'            EXTRACT REGISTER NAME           08445200
         AIF   (N'&ELXLIST NE 1).ERR002 BR IF INVALID REG FORM          08446600
.OKE20   ANOP                                                           08448000
.********************************************************************** 08450000
.*       VALIDATE SYSTEM PARAMETER IF PRESENT                         * 08500000
.********************************************************************** 08550000
&S(1)    SETB  (T'&SYSTEM NE 'O')       SET OPTION SPECIFIED BIT        08650000
         AIF   (T'&SYSTEM EQ 'O').OK21                                  08700000
&OPERAND SETC  'SYSTEM'                                                 08750000
&OPVAL   SETC  '&SYSTEM'                                                08800000
         AIF   ('&SYSTEM' NE 'YES' AND '&SYSTEM' NE 'NO').ERR002        08850000
&P1      SETC  '&SYSTEM'                                                08900000
         AGO   .OK22                                               @L1C 08950000
.OK21    ANOP  DEFAULT TO SYSTEM=NO IF SYSTEM NOT SPECIFIED             09000000
.*             UNLESS IT IS THE EXECUTE FORM                            09050000
&P1      SETC  'NO'                                                     09100000
.********************************************************************** 09101500
.*       VALIDATE REUSABLE PARAMETER IF PRESENT                       * 09103000
.********************************************************************** 09104500
.OK22    ANOP                                                      @L1A 09106000
&S(2)    SETB  (T'&REUSABLE NE 'O')     SET OPTION SPECIFIED BIT   @L1A 09107500
         AIF   (T'&REUSABLE EQ 'O').OK23                           @L1A 09109000
&OPERAND SETC  'REUSABLE'                                          @L1A 09110500
&OPVAL   SETC  '&REUSABLE'                                         @L1A 09112000
       AIF   ('&REUSABLE' NE 'YES' AND '&REUSABLE' NE 'NO').ERR002 @L1A 09113500
&P2      SETC  '&REUSABLE'                                         @L1A 09115000
         AGO   .OK24                                               @L1A 09116500
.OK23    ANOP  DEFAULT TO REUSABLE=NO IF REUSABLE NOT SPECIFIED    @L1A 09118000
.*             UNLESS IT IS THE EXECUTE FORM                       @L1A 09119500
&P2      SETC  'NO'                                                @L1A 09121000
.********************************************************************** 09122500
.*       VALIDATE LXSIZE PARAMETER IF PRESENT                         * 09124000
.********************************************************************** 09125500
.OK24    ANOP                                                      @L1A 09127000
&S(3)    SETB  (T'&LXSIZE NE 'O')       SET OPTION SPECIFIED BIT   @L1A 09128500
&S(4)    SETB  (T'&LXSIZE NE 'O')       SET OPTION SPECIFIED BIT   @L1A 09130000
         AIF   (T'&LXSIZE EQ 'O').OK25                             @L1A 09131500
&OPERAND SETC  'LXSIZE'                                            @L1A 09133000
&OPVAL   SETC  '&LXSIZE'                                           @L1A 09134500
       AIF   ('&LXSIZE' NE '12' AND '&LXSIZE' NE '16'                  x09136000
               AND '&LXSIZE' NE '23'                                   x09137500
               AND '&LXSIZE' NE '24').ERR002                       @L1A 09139000
&P3      SETC  '&LXSIZE'                                           @L1A 09140500
         AGO   .OK99                                               @L1A 09142000
.OK25    ANOP  DEFAULT TO LXSIZE=12 IF LXSIZE NOT SPECIFIED        @L1A 09143500
.*             UNLESS IT IS THE EXECUTE FORM                       @L1A 09145000
&P3      SETC  '12'                                                @L1A 09146500
.OK99    ANOP                                                           09150000
.********************************************************************** 09200000
.* MAP OPTIONS BITS INTO OPTIONS BYTE                                   09250000
.********************************************************************** 09300000
&B(1)    SETB  ('&P1' EQ 'YES')                                         09350000
&B(2)    SETB  ('&P2' EQ 'YES')                                    @L1A 09360000
&B(3)    SETB  ('&P3' EQ '16')                                     @L1A 09370000
&B(4)    SETB  ('&P3' EQ '23')                                     @L1A 09380000
&B(5)    SETB  ('&P3' EQ '24')                                     @L1A 09390000
&BOPTS   SETC  '&B(1)&B(2)&B(3)&B(4)&B(5)&B(6)&B(7)&B(8)'               09400000
.MAP1    AIF   (&S(1) NE 1).MAP2        IF S(1)-SYSTEM WAS NOT SET      09450000
         AIF   (&B(1) EQ 1).MAP1S       IF SYSTEM=YES WAS SPECIFIED     09500000
.*                                      SYSTEM=NO  WAS SPECIFIED        09550000
&N(1)    SETB  0                        ENABLE EXECUTE FORM TO CLR BIT  09600000
         AGO   .MAP2                                                    09650000
.MAP1S   ANOP                                                           09700000
&O(1)    SETB  1                    ENABLE EXECUTE FORM TO SET BIT @L1A 09703400
.MAP2    AIF   (&S(2) NE 1).MAP3    IF S(2)-REUSABLE WAS NOT SET   @L1A 09706800
         AIF   (&B(2) EQ 1).MAP2S   IF REUSABLE=YES WAS SPECIFIED  @L1A 09710200
.*                                  REUSABLE=NO WAS SPECIFIED      @L1A 09713600
&N(2)    SETB  0                    ENABLE EXECUTE FORM TO CLR BIT @L1A 09717000
         AGO   .MAP3                                               @L1A 09720400
.MAP2S   ANOP                                                      @L1A 09723800
&O(2)    SETB  1                    ENABLE EXECUTE FORM TO SET BIT @L1A 09727200
.MAP3    AIF   (&S(3) NE 1).MAP4    IF S(3) - LXSIZE not set       @L1A 09730600
         AIF   (&B(3) EQ 1).MAP3S   IF lxsize=16 WAS SPECIFIED     @L1A 09734000
.*                                  lxsize^=16                     @L1A 09737400
&N(3)    SETB  0                    ENABLE EXECUTE FORM TO CLR BIT @L1A 09740800
         AGO   .MAP4                                               @L1A 09744200
.MAP3S   ANOP                                                      @L1A 09747600
&O(3)    SETB  1                    ENABLE EXECUTE FORM TO SET BIT @L1A 09751000
.MAP4    ANOP                                                      @L1A 09754400
         AIF   (&S(4) NE 1).MAP5    IF S(4) - LXSIZE not set       @L1A 09757800
         AIF   (&B(4) EQ 1).MAP4S   IF lxsize=23 WAS SPECIFIED     @L1A 09761200
.*                                  lxsize^=23                     @L1A 09764600
&N(4)    SETB  0                    ENABLE EXECUTE FORM TO CLR BIT @L1A 09768000
         AGO   .MAP5                                               @L1A 09771400
.MAP4S   ANOP                                                      @L1A 09774800
&O(4)    SETB  1                    ENABLE EXECUTE FORM TO SET BIT @L1A 09778200
.MAP5    ANOP                                                      @L1A 09781600
         AIF   (&S(5) NE 1).MAP6    IF S(5) - LXSIZE not set       @L1A 09785000
         AIF   (&B(5) EQ 1).MAP5S   IF lxsize=24 WAS SPECIFIED     @L1A 09788400
.*                                  lxsize^=24                     @L1A 09791800
&N(5)    SETB  0                    ENABLE EXECUTE FORM TO CLR BIT @L1A 09795200
         AGO   .MAP6                                               @L1A 09798600
.MAP5S   ANOP                                                      @L1A 09802000
&O(5)    SETB  1                    ENABLE EXECUTE FORM TO SET BIT @L1A 09805400
.MAP6    ANOP                                                      @L1A 09808800
         AIF   (&S(6) NE 1).MAP7    IF S(6)-ELXLIST WAS NOT SET    @L1A 09812200
         AIF   (&B(6) EQ 1).MAP6S   IF ELXLIST WAS SPECIFIED       @L1A 09815600
.*                                  ELXLIST WAS NOT SPECIFIED      @L1A 09819000
.* For ELXLIST, we're only going to allow "turn on" of the bit,         09822400
.* to avoid extra instructions for those who just recompile with        09825800
.* LXLIST                                                               09829200
.*&N(6)  SETB  0                    ENABLE EXECUTE FORM TO CLR BIT @L1A 09832600
         AGO   .MAP7                                               @L1A 09836000
.MAP6S   ANOP                                                      @L1A 09839400
&O(6)    SETB  1                    ENABLE EXECUTE FORM TO SET BIT @L1A 09842800
.MAP7    ANOP                                                      @L1A 09846200
&OPTNI   SETA  128*&N(1)+64*&N(2)+32*&N(3)+16*&N(4)+8*&N(5)+4*&N(6)+2*&X09850000
               N(7)+&N(8)               OPTIONS NI MASK VALUE           09900000
&OPTOI   SETA  128*&O(1)+64*&O(2)+32*&O(3)+16*&O(4)+8*&O(5)+4*&O(6)+2*&X09950000
               O(7)+&O(8)               OPTIONS OI MASK VALUE           10000000
.********************************************************************** 10050000
.*       DETERMINE TYPE OF REQUEST                                    * 10100000
.********************************************************************** 10150000
         AIF   (T'&MF NE 'O').CKMF2     MF OMITTED = STANDARD FORM      10200000
.********************************************************************** 10250000
.*       STANDARD FORM SPECIFIED                                      * 10300000
.********************************************************************** 10350000
&OPERAND SETC  '(E)LXLIST'                                              10400000
         AIF   ('&LXLV' EQ '').ERR001   REQUIRED OPERAND NOT SPECIFIED  10450000
.* GENERATE STANDARD FORM                                               10500000
&GNAME1  SETC  'IHB'.'&SYSNDX'.'1'                                      10550000
&GNAMEL  SETC  'IHB'.'&SYSNDX'.'L'                                      10600000
&LABL    DC    0H'0'                .LXRES XM SERVICE PC                10650000
         AIF  (&SYSOSREL GE &SYSOSREL_ZOSV1R6).ITISR6A             @L1A 10666600
         AIF  ('&ELXLIST' NE '').ITISR6A                           @L1A 10683200
         STM   14,12,12(13)         .SAVE CALLER'S REGS                 10700000
.ITISR6A ANOP                                                      @L1A 10730000
         AIF   ('&LT1' EQ 'R').SF10     BR IF (E)LXLIST WAS REG FORM    10760000
         LA    15,&LXLV             .GET ADDR OF (E)LXLIST              10790000
         ST    15,&GNAME1           .STORE (E)LXLIST ADDR IN PARM LIST  10820000
         AGO   .SF12                                                    10850000
.SF10    ST    &LXLV,&GNAME1        .STORE (E)LXLIST ADDR IN PARM LIST  10900000
.SF12    ANOP                                                           10950000
         CNOP  0,4                  .FORCE PARM LIST TO WORD BOUNDARY   11000000
         LA    1,*+8                .POINT REG1 TO PARM LIST            11050000
         B     &GNAMEL              .BRANCH AROUND PARM LIST            11075000
         DC    XL1'00'              .FORMAT BYTE                        11100000
         DC    BL1'&BOPTS'          .OPTIONS BYTE                       11150000
         DC    AL2(0)               .RESERVED                           11200000
&GNAME1  DC    A(0)                 .(E)LXLIST ADDRESS                  11225000
&GNAMEL  DS    0H                                                       11250000
         AIF  (&SYSOSREL GE &SYSOSREL_ZOSV1R6).ITISR6B             @L1A 11275000
         AIF  ('&ELXLIST' NE '').ITISR6B                           @L1A 11300000
         ESAR  2                    .EXTRACT SASID                      11325000
         ST    2,16(,13)            .SAVE SASID IN REG 15 SLOT          11350000
.ITISR6B ANOP                                                      @L1A 11400000
         L     15,16(0,0)           .GET ADDR OF CVT                    11450000
         L     15,772(,15)          .GET ADDR OF SYSTEM FUNCTION TABLE  11500000
         L     15,0(,15)            .GET LX/EX FOR LXRES                11550000
         PC    0(15)                .PC TO LXRES SERVICE                11600000
         AIF  (&SYSOSREL GE &SYSOSREL_ZOSV1R6).ITISR6C             @L1A 11650000
         AIF  ('&ELXLIST' NE '').ITISR6C                           @L1A 11700000
         L     2,16(,13)            .EXTRACT SAVED SASID                14446600
         SSAR  2                    .RESTORE SASID                      14473200
         LM    2,12,28(13)          .RESTORE REGS 2-12                  14500000
         L     14,12(,13)           .RESTORE REG 14                     14550000
.ITISR6C ANOP                                                      @L1A 14575000
         MEXIT                                                          14600000
.********************************************************************** 14700000
.CKMF2   ANOP                                                           14700700
&OPERAND SETC  'MF'                     SET FOR POSSIBLE ERROR MSGS     14701400
&OPVAL   SETC  '&MF'                                                    14702100
         AIF   ('&MF' NE 'L').CKMF3     IF NOT LIST FORM CK FOR EXECUTE 14702800
.********************************************************************** 14703500
.*                                                                      14704200
.********************************************************************** 14704900
.*       LIST FORM SPECIFIED                                          * 14705600
.********************************************************************** 14706300
&OPERAND SETC  'REG FORM (E)LXLIST ADDRESS'                             14707000
&OPVAL   SETC  'MF=L'                                                   14707700
         AIF   ('&LT1' EQ 'R').ERR280   &OPERAND INVALID WITH &OPVAL    14708400
&LABL    DC    0F'0'                .LXRES PC PARAMETER LIST            14709100
         DC    XL1'00'              .FORMAT BYTE                        14709800
         DC    BL1'&BOPTS'          .OPTIONS FLAG BYTE                  14710500
         DC    AL2(0)               .RESERVED                           14711200
         AIF   ('&LXLV' NE '').LF10     BR IF (E)LXLIST WAS SPECIFIED   14711900
&LXLV    SETC  '0'                      DEFAULT TO ZERO                 14712600
.LF10    ANOP                                                           14713300
         DC    A(&LXLV)             .(E)LXLIST ADDRESS                  14714000
         MEXIT                                                          14714700
.********************************************************************** 14715400
.*       EXECUTE FORM SPECIFIED                                       * 14716100
.********************************************************************** 14716800
.CKMF3   AIF   ('&MF(1)' NE 'E').ERR002 INVALID MF PARAMETER            14717500
         AIF   ('&MF(2)' EQ '').ERR002  MUST BE (E,PLIST ADDR)          14718200
.* DETERMINE WHETHER PARMLIST ADDRESS IS RX OR REG TYPE                 14718900
         AIF   ('&MF(2)'(1,1) EQ '(').EXREG      BRANCH IF REG TYPE     14719600
&EPLV    SETC  '&MF(2)'                 SET VALUE FOR USE IN LOAD INST. 14720300
&LT2     SETC  'A'                      SET TO 'LA' FOR RX TYPE ADDR    14721000
         AGO   .ETXT1                   GO GENERATE EXECUTE FORM TEXT   14721700
.EXREG   ANOP                                                           14722400
&LT2     SETC  'R'                      SET TO 'LR' FOR REG TYPE ADDR   14723100
&EPLV    SETC  '&MF(2)'(2,K'&MF(2)-2)   EXTRACT REGISTER NAME           14723800
.ETXT1   ANOP                           GENERATE EXECUTE FORM TEXT      14724500
&LABL    DC    0H'0'                .LXRES XM SERVICE PC                14725200
         AIF  (&SYSOSREL GE &SYSOSREL_ZOSV1R6).ITISR6D             @L1A 14725400
         AIF  ('&ELXLIST' NE '').ITISR6D                           @L1A 14725600
         STM   14,12,12(13)         .SAVE CALLER'S REGS                 14725900
.ITISR6D ANOP                                                      @L1A 14726200
         AIF   ('&EPLV' EQ '1').ETXT3   BRANCH IF SPECIAL REG 1         14726600
.ETXT2   ANOP                                                           14727300
         L&LT2 1,&EPLV              .LXRES PARAMETER LIST ADDRESS       14728000
.ETXT3   ANOP                                                           14728700
         AIF   (&OPTOI EQ 0).SKIPOI     IF NO OPTIONS TURNED ON         14729400
         OI    1(1),&OPTOI          .SET OPTIONS IN OPTIONS BYTE        14730100
.SKIPOI  AIF   (&OPTNI EQ 255).SKIPNI   IF NO OPTIONS TURNED OFF        14730800
         NI    1(1),&OPTNI          .CLEAR OPTIONS IN OPTIONS BYTE      14731500
.SKIPNI  AIF   (&S(9) NE 1).SKIPLX      IF LXLIST NOT SPECIFIED         14732200
         AIF   ('&LT1' EQ 'R').ETXT5  BR IF LXLIST IS REG FORM @YA04740 14732900
         LA    15,&LXLV             .GET ADDR OF LXLIST                 14733600
         ST    15,4(,1)             .STORE LXLIST ADDR INTO PARM LIST   14734300
         AGO   .SKIPLX                                                  14735000
.ETXT5   ANOP                           REG FORM LXLIST                 14735700
         ST    &LXLV,4(,1)          .STORE LXLIST ADDR INTO PARM LIST   14736400
.SKIPLX  ANOP                                                           14737100
         AIF   (&S(6) NE 1).SKIPELX     IF ELXLIST NOT SPECIFIED   @L1A 14737200
         AIF   ('&LT1' EQ 'R').ETXTE5 BR IF ELXLIST IS REG FORM    @L1A 14737300
         LA    15,&LXLV             .GET ADDR OF ELXLIST           @L1A 14737400
         ST    15,4(,1)             .STORE ELXLIST ADDR            @L1A 14737500
         AGO   .SKIPELX                                            @L1A 14737600
.ETXTE5  ANOP                           REG FORM ELXLIST           @L1A 14737700
         ST    &LXLV,4(,1)          .STORE ELXLIST ADDR            @L1A 14737800
.SKIPELX ANOP                                                      @L1A 14737900
         AIF  (&SYSOSREL GE &SYSOSREL_ZOSV1R6).ITISR6E             @L1A 14738000
         AIF  ('&ELXLIST' NE '').ITISR6E                           @L1A 14738100
         ESAR  2                    .EXTRACT SASID                      14738200
         ST    2,16(,13)            .SAVE SASID IN REG 15 SLOT          14738500
.ITISR6E ANOP                                                      @L1A 14738900
         L     15,16(0,0)           .GET ADDR OF CVT                    14739300
         L     15,772(,15)          .GET ADDR OF SYSTEM FUNCTION TABLE  14739700
         L     15,0(,15)            .GET LX/EX FOR LXRES                14740100
         PC    0(15)                .PC TO LXRES SERVICE                14740500
         AIF  (&SYSOSREL GE &SYSOSREL_ZOSV1R6).ITISR6F             @L1A 14740900
         AIF  ('&ELXLIST' NE '').ITISR6F                           @L1A 14741300
         L     2,16(,13)            .EXTRACT SAVED SASID                14742000
         SSAR  2                    .RESTORE SASID                      14742700
         LM    2,12,28(13)          .RESTORE REGS 2-12                  14743400
         L     14,12(,13)           .RESTORE REG 14                     14744100
.ITISR6F ANOP                                                      @L1A 14744400
         MEXIT                                                          14744800
.********************************************************************** 14745500
.*       PROCESS ERROR CONDITIONS                                     * 14750000
.********************************************************************** 14800000
.ERR001  ANOP SEV 12 MNOTE -- IHB001 &OPERAND REQ''D - NOT SPECIFIED    14850000
         IHBERMAC 1017,&OPERAND                                         14900000
         MEXIT                                                          14950000
.ERR002  ANOP SEV 12 MNOTE -- IHB002 - INVALID &OPERAND OPERAND &OPVAL  15000000
         IHBERMAC 1001,&OPERAND,&OPVAL                                  15050000
         MEXIT                                                          15100000
.ERR027  ANOP SEV 12 MNOTE -- IHB027 - EXCESSIVE POSITIONAL PARAMETERS  15150000
         IHBERMAC 238                                                   15200000
         MEXIT                                                          15250000
.ERR280  ANOP SEV 12 MNOTE -- IHB280 &OPERAND INVALID WITH &OPVAL       15300000
         IHBERMAC 1020,&OPERAND,&OPVAL                                  15350000
         MEXIT                                                     @L1A 15362500
.ERR281  ANOP SEV 12 MNOTE -- IHB280 &OPERAND INVALID WITH &OPVAL  @L1A 15375000
         IHBERMAC 1020,LXLIST,ELXLIST                              @L1A 15387500
         MEND                                                           15400000
* */                                                                    15450000
*@EJECT;                                                                15500000
*%LXRES:                                                                15550000
*        MACRO KEYS(LXLIST,SYSTEM,REUSABLE,LXSIZE,MF,RELATED  /* @L1C*/ 15566600
*                  ,ELXLIST);                                 /* @L1C*/ 15583200
*    DCL SYSOSREL CHAR EXT;         /* DEFINE GLOBAL OS RELEASE  @L1A*/ 15599800
*    DCL SYSOSREL_ZOSV1R6 CHAR EXT; /* ZOS R6 VALUE              @L1A*/ 15616400
*    ANS('?SYSSTATE (TEST);') RESCAN;                         /* @L1A*/ 15633000
*/********************************************************************/ 15650000
*/*                DEFINE EXTERNAL MACRO VARIABLES                   */ 15700000
*/********************************************************************/ 15750000
* DECLARE                                                               15850000
*   EHAMAXDIM FIXED     EXT, /* NUMBER OF OPTION PARAMETERS.         */ 15900000
*   EHAMAXLEN FIXED     EXT, /* LENGTH OF STANDARD LIST.             */ 15950000
*   EHAREGS   CHARACTER EXT, /* CONTAINS DECLARED REGISTER NUMBERS.  */ 16000000
*   EHAMAPS   CHARACTER EXT, /* CONTAINS REQUESTS FOR MAPPINGS       */ 16050000
*   EHAPCLIST CHARACTER EXT; /* CONTAINS STANDARD PC LIST NAMES.     */ 16100000
*/********************************************************************/ 16150000
*/*                DEFINE INTERNAL MACRO VARIABLES                   */ 16200000
*/********************************************************************/ 16250000
* DECLARE CC       FIXED;    /* STARTING COLUMN FOR PL/S COMMENTS    */ 16300000
* DECLARE IVCLROPT FIXED;    /* IF SET TO 1 IMPLIES CODE TO CLEAR    */ 16500000
*                            /* OPTIONS MUST BE GENERATED. THIS WILL */ 16550000
*                            /* BE TRUE FOR THE MF(M) AND MF(E) CASES*/ 16600000
*                            /* WHERE 'COMPLETE' IS NOT SPECIFIED.   */ 16650000
*                            /* FOR THE STD. FORM OR WHEN 'COMPLETE' */ 16700000
*                            /* IS SPECIFIED THE ZEROING OF THE PARM */ 16750000
*                            /* LIST WOULD MAKE SUCH CODE REDUNDANT. */ 16800000
* DECLARE IVDOCMT  CHAR;     /* COMMENT FOR DO AND END LINES.        */ 16850000
* DECLARE IVINDNT2 FIXED;    /* STARTING COLUMN FOR ALL ANSWER TEXT  */ 16900000
*                            /*   EXCEPT DO AND END STATEMENTS.      */ 16950000
* DECLARE IVLFORM  CHAR;     /* HOLDS LIST-FORM INVOCATION STRING.   */ 17100000
* DECLARE IVLIST   CHAR;     /* NAME OF STANDARD OR SUPPLIED LIST.   */ 17150000
* DECLARE IVLP1    FIXED;    /* LEFT  PAREN COL FOR PTR FORM LXLIST  */ 17200000
* DECLARE IVLSTLEN FIXED;    /* LENGTH OF LXRES PARAMETER LIST.      */ 17250000
* DECLARE IVOPTS   CHAR;     /* OPTIONS BYTE INITIALIZATION STRING   */ 17300000
* DECLARE IVOPT11  CHAR;     /* XM@00111 BIT INITIALIZATION STRING   */ 17350000
* DECLARE IVOPT12  CHAR;     /* XM@00112 BIT INIT STRING         @L1A*/ 17358300
* DECLARE IVOPT13  CHAR;     /* XM@00113 BIT INIT STRING         @L1A*/ 17366600
* DECLARE IVOPT14  CHAR;     /* XM@00114 BIT INIT STRING         @L1A*/ 17374900
* DECLARE IVOPT15  CHAR;     /* XM@00115 BIT INIT STRING         @L1A*/ 17383200
* DECLARE IVOPT16  CHAR;     /* XM@00116 BIT INIT STRING         @L1A*/ 17391500
* DECLARE IVRC     FIXED;    /* RETURN CODE TO DETERMINE IF TEXT WILL*/ 17400000
*                            /* BE GENERATED.                        */ 17450000
* DECLARE IVRP1    FIXED;    /* RIGHT PAREN COL FOR PTR FORM LXLIST  */ 17500000
* IF LXLIST ^= '' & ELXLIST ^= '' THEN                     /*    @L1A*/ 17503800
* DO;                                                      /*    @L1A*/ 17507600
*   ANS MSG('LXRES --> LXLIST IS NOT VALID WITH ELXLIST'); /*    @L1A*/ 17511400
*   RETURN CODE(8);                                        /*    @L1A*/ 17515200
* END;                                                     /*    @L1A*/ 17519000
* IF REUSABLE ^= '' & REUSABLE(1) = 'YES' &                /*    @L1A*/ 17522800
*    LXLIST ^= '' THEN                                     /*    @L1A*/ 17526600
* DO;                                                      /*    @L1A*/ 17530400
*   ANS MSG('LXRES --> LXLIST IS NOT VALID WITH REUSABLE(YES)');  /*    17534200
*                                                                @L1A*/ 17538000
*   RETURN CODE(8);                                        /*    @L1A*/ 17541800
* END;                                                     /*    @L1A*/ 17545600
*/********************************************************************/ 17550000
*/*                INITIALIZE INTERNAL MACRO VARIABLES                  17600000
*/********************************************************************/ 17650000
* IF LXLIST ^= '' THEN                                        /* @L1A*/ 17654000
*   LXLISTSTR = LXLIST(1);                                    /* @L1A*/ 17658000
* ELSE                                                        /* @L1A*/ 17662000
*   LXLISTSTR = ELXLIST(1);                                   /* @L1A*/ 17666000
* CC         = MACRMAR-35;   /* COMMENT COLUMN (DEFAULT= 72-35 = 37) */ 17670000
* IVDOCMT    = ' LXRES';                                                17700000
*                            /* START OF DO-END COMMENT--NO KEYS YET */ 17750000
* IVCLROPT   = 0;            /* DON'T GENERATE CODE TO CLEAR OPTIONS */ 17800000
* IVINDNT2   = MACCOL + 2;   /* SET INDENTATION MARGIN.              */ 17850000
* IVLFORM    = '?AHALXRES('; /* BEGINNING OF AHALXRES INV-STRING.    */ 18200000
* IVLIST     = 'XM@001';     /* STANDARD LIST NAME FOR LXRES SERVICE */ 18250000
* IVLP1      = INDEX(LXLISTSTR                                          18283300
*                         ,'('); /* GET POSITION OF LEFT PAREN   @L1C*/ 18316600
*                            /* NOTE: A NON-ZERO VALUE FOR IVLP1     */ 18350000
*                            /* INDICATES A POINTER FORM ADDRESS.    */ 18400000
* IVLSTLEN   = 8;            /* SET LENGTH OF LXRES PARAMETER LIST.  */ 18450000
* IVRC       = 0;            /* SET CODE TO GENERATE TEXT            */ 18500000
* IF IVLP1=1 THEN            /* IF POINTER NOTATION          @ZMB0031*/ 18550000
*   DO;                      /* POINTER NOTATION.            @ZMB0031*/ 18554100
*     IVRP1=LENGTH(LXLISTSTR);  /* GET LAST CHAR OF SUBLIST      @L1C*/ 18558200
*     IF LXLISTSTR(IVRP1:IVRP1)^=')' THEN /* IF NOT A RIGHT             18562300
*                                           PAREN                @L1C*/ 18566400
*       IVRP1=IVLP1;         /* FORCE 'NOT-SPECIFIED' ERROR  @ZMB0031*/ 18570500
*   END;                     /* POINTER NOTATION.            @ZMB0031*/ 18574600
* ELSE                       /* NOT POINTER NOTATION.        @ZMB0031*/ 18578700
*   DO;                      /* NOT POINTER NOTATION.        @ZMB0031*/ 18582800
*     IVLP1=0;               /* NOT POINTER NOTATION.        @ZMB0031*/ 18586900
*     IVRP1=0;               /* NOT POINTER NOTATION.        @ZMB0031*/ 18591000
*   END;                     /* NOT POINTER NOTATION.        @ZMB0031*/ 18595100
*/********************************************************************/ 18600000
*/*                CHECK FOR MACLIST                                 */ 18650000
*/********************************************************************/ 18700000
* IF MACLIST ^= ''           /* MACLIST SUPPLIED?                    */ 18850000
*   THEN DO;                 /* YES -                                */ 18900000
*     IVRC = 12;             /*       PREVENT TEXT GENERATION        */ 18950000
*     ANS MSG('AHA0053 THE MACLIST '!!QUOTE(MACLIST)!!                  19000000
*             ' IS NOT ALLOWED. NO TEXT IS GENERATED.');                19050000
*                            /*       INDICATE MACLIST IN DO-COMMENT.*/ 19100000
*     IVDOCMT = IVDOCMT!!' '!!MACLIST;                                  19150000
*   END;                     /* END - MACLIST SPECIFIED.             */ 19200000
*/********************************************************************/ 19250000
*/*                PROCESS MF KEYWORD                                */ 19300000
*/********************************************************************/ 19350000
* IF MF = ''                 /* STANDARD FORM?                       */ 19500000
*   THEN                     /* YES -                                */ 19550000
*     GOTO LHA00200;         /*       SKIP MF PROCESSING.            */ 19600000
*                            /* NO  - INDICATE MF KEY IN DO-COMMENT. */ 19650000
* IVDOCMT = IVDOCMT!!' MF'!!MF;                                         19700000
* IF MF(2) = ''              /* WAS A LIST NAME SUPPLIED?            */ 19750000
*   THEN DO;                 /* NO  - PUT OUT ERROR MSG AHA0013.     */ 19800000
*     ANS MSG('AHA0013 MF(2) (LISTNAME) IS REQUIRED '!!                 19850000
*             'BUT IS NOT SUPPLIED. NO TEXT IS GENERATED.');            19900000
*     IVRC = 12;             /* KILL TEXT GENERATION.                */ 19950000
*   END;                                                                20000000
* IF NUMBER(MF) > 3          /* TOO MANY MF ARGUMENTS.               */ 20050000
*   THEN DO;                 /* YES - PUT OUT ERROR MSG AHA0033.     */ 20100000
*     ANS MSG('AHA0033 MF - '!!MF!!' - HAS TOO MANY ARGUMENTS. '!!      20150000
*             'NO TEXT IS GENERATED.');                                 20200000
*     IVRC = 12;             /* KILL TEXT GENERATION.                */ 20250000
*   END;                                                                20300000
* IF MF(1) = 'L'             /* LIST FORM?                           */ 20350000
*   THEN DO;                 /* YES - CK FOR ERRORS UNIQUE TO MF(L)  */ 20400000
*     IF INDEX(LXLISTSTR,'->') ^= 0  /* IF BASED FORM OF ADDRESS USED*/ 20450000
*       THEN DO;             /* INVALID VALUE FOR (E)LXLIST          */ 20500000
*         ANS MSG('AHA0023 BASED FORM (E)LXLIST ADDRESS '''!!LXLISTSTR  20550000
*               !!''' INVALID WITH MF(L). NO TEXT IS GENERATED.');      20600000
*         IVRC = 12;         /* KILL TEXT GENERATION.                */ 20650000
*       END;                 /* INVALID VALUE FOR (E)LXLIST          */ 20700000
*     IF IVLP1 =1            /* IF POINTER FORM OF ADDRESS   @ZMB0031*/ 20750000
*       THEN DO;             /* INVALID VALUE FOR (E)LXLIST          */ 20800000
*         ANS MSG('AHA0023 POINTER FORM (E)LXLIST ADDRESS '''!!         20850000
*                 LXLISTSTR!!''' INVALID WITH MF(L). '!!                20900000
*                 'NO TEXT IS GENERATED.');                             20950000
*         IVRC = 12;         /* KILL TEXT GENERATION.                */ 21000000
*       END;                 /* INVALID VALUE FOR (E)LXLIST          */ 21050000
*     IF MF(3) = 'COMPLETE'  /* ONLY VALID FOR MF(E) AND MF(M)       */ 21100000
*       THEN DO;             /*                                      */ 21150000
*         ANS MSG('AHA0023 ''COMPLETE'' IS INVALID WITH MF(L). '!!      21200000
*                 'NO TEXT IS GENERATED.');                             21250000
*         IVRC = 12;         /* KILL TEXT GENERATION.                */ 21300000
*       END;                 /* INVALID VALUE FOR MF(3)              */ 21350000
*     GOTO LHA00200;         /* END MF PROCESSING                    */ 21400000
*   END;                     /* LIST FORM                            */ 21450000
* IF MF(1) = 'M'             /* NO  - MODIFY FORM?                   */ 21500000
*   THEN                     /* YES -                                */ 21550000
*     GOTO LHA00100;         /*       CHECK FOR THIRD ARGUMENT.      */ 21600000
* IF MF(1) ^= 'E'            /* NO  - EXECUTE FORM?                  */ 21650000
*   THEN DO;                 /* NO  - PUT OUT ERROR MSG AHA0043.     */ 21700000
*     ANS MSG('AHA0043 MF(1) MUST BE ''L,E OR M''. '!!                  21750000
*             'NO TEXT IS GENERATED.');                                 21800000
*     IVRC = 12;             /* KILL TEXT GENERATION.                */ 21850000
*   END;                                                                21900000
*LHA00100:                                                              21950000
* IVCLROPT = 1;              /* GENERATE CLEAR OPTIONS CODE FOR      */ 22000000
*                            /* THE MF(M) AND MF(E) CASES.           */ 22050000
* IF MF(3) = ''              /* WAS A THIRD ARGUMENT SPECIFIED?      */ 22100000
*   THEN                     /* NO  -                                */ 22150000
*     GOTO LHA00200;         /*       CHECK FOR (E)LXLIST KEYWORD    */ 22200000
* IF MF(3) ^= 'COMPLETE'     /* YES - IS THIRD ARGUMENT VALID?       */ 22250000
*   THEN DO;                 /* NO  - PUT OUT ERROR MSG AHA0043.     */ 22300000
*     ANS MSG('AHA0043 MF(3) MUST BE ''COMPLETE'' '!!                   22350000
*             'WITH MF(E) OR MF(M).'!!                                  22400000
*             'NO TEXT IS GENERATED.');                                 22450000
*     IVRC = 12;             /* KILL TEXT GENERATION.                */ 22500000
*   END;                                                                22550000
* IVCLROPT = 0;              /* DON'T GENERATE CLEAR OPTIONS CODE FOR*/ 22600000
*                            /* THE MF(M) AND MF(E) 'COMPLETE' CASES.*/ 22650000
*/********************************************************************/ 22700000
*/*                PROCESS LXLIST KEYWORD                            */ 22750000
*/********************************************************************/ 22800000
*LHA00200:                                                              22850000
* IF LXLIST ^= ''            /* LXLIST SPECIFIED?                    */ 22900000
*   THEN DO;                 /* YES - ADD KEYWD TO COMMENT           */ 22950000
*     IVDOCMT = IVDOCMT!!' LXLIST'!!LXLIST;                             23000000
*     IF LXLISTSTR ^= '' &   /* WAS ARGUMENT SPECIFIED?      @ZM50111*/ 23050000
*       ((IVLP1=0 & IVRP1=0)!/* AND NOT POINTER FORM         @ZM50111*/ 23175000
*       (IVLP1+1 <= IVRP1-1))/* AND NOT = '()' ?             @ZM50111*/ 23187500
*       THEN DO;             /* YES - (E)LXLIST SPECIFIED            */ 23218700
*         IF NUMBER(LXLIST) > 1 /* TOO MANY LXLIST ARGS?             */ 23250000
*           THEN DO;         /* YES - ISSUE AHA0033                  */ 23300000
*             ANS MSG('AHA0033 LXLIST - '!!LXLIST!!                     23350000
*                      ' - HAS TOO MANY ARGUMENTS. '!!                  23400000
*                      'NO TEXT IS GENERATED.');                        23450000
*             IVRC = 12;     /* KILL TEXT GENERATION                 */ 23500000
*           END;             /* NUMBER(LXLIST) > 1                   */ 23550000
*       END;                 /* (E)LXLIST SPECIFIED                  */ 23600000
*       ELSE DO;             /* NO ARGUMENT-ISSUE AHA0013            */ 24150000
*         ANS MSG('AHA0013 (E)LXLIST (LIST ADDR) IS REQUIRED '!!        24200000
*                 'BUT IS NOT SPECIFIED. NO TEXT IS GENERATED.');       24250000
*         IVRC = 12;         /* KILL TEXT GENERATION                 */ 24300000
*       END;                 /* NO LXLIST ARGUMENT                   */ 24350000
*   END;                     /* LXLIST KEYWORD SPECIFIED             */ 24400000
*   ELSE DO;                 /* LXLIST NOT SPECIFIED                 */ 24450000
*     IF MF = ''             /* IF STANDARD FORM                     */ 24500000
*      & ELXLIST = ''        /* But not ELXLIST                  @L1A*/ 24525000
*       THEN DO;             /* ERROR - LXLIST IS REQUIRED           */ 24550000
*         ANS MSG('AHA0013 LXLIST IS REQUIRED FOR STANDARD FORM '!!     24600000
*                 'BUT IS NOT SPECIFIED. NO TEXT IS GENERATED.');       24650000
*         IVRC = 12;         /* KILL TEXT GENERATION                 */ 24700000
*       END;                 /* ERROR - LXLIST IS REQUIRED           */ 24750000
*   END;                     /* LXLIST NOT SPECIFIED                 */ 24800000
*/********************************************************************/ 24801300
*/*                PROCESS ELXLIST KEYWORD                       @L1A*/ 24802600
*/********************************************************************/ 24803900
*LHA00201:                                                              24805200
* IVOPT16 = '0';             /* SET DEFAULT INIT. STRING         @L1A*/ 24806500
* IF ELXLIST ^= ''           /* ELXLIST SPECIFIED?               @L1A*/ 24807800
*   THEN DO;                 /* YES - ADD KEYWD TO COMMENT       @L1A*/ 24809100
*   IVOPT16 = '1';           /* ELXLIST is specified             @L1A*/ 24810400
*     IVDOCMT = IVDOCMT!!' ELXLIST'!!ELXLIST;                           24811700
*     IF LXLISTSTR ^= '' &   /* WAS ARGUMENT SPECIFIED?          @L1A*/ 24813000
*       ((IVLP1=0 & IVRP1=0)!/* AND NOT POINTER FORM             @L1A*/ 24814300
*       (IVLP1+1 <= IVRP1-1))/* AND NOT = '()' ?                 @L1A*/ 24815600
*       THEN DO;             /* YES - ELXLIST SPECIFIED          @L1A*/ 24816900
*         IF NUMBER(ELXLIST) > 1 /* TOO MANY LXLIST ARGS?        @L1A*/ 24818200
*           THEN DO;         /* YES - ISSUE AHA0033              @L1A*/ 24819500
*             ANS MSG('AHA0033 ELXLIST - '!!ELXLIST!!                   24820800
*                      ' - HAS TOO MANY ARGUMENTS. '!!                  24822100
*                      'NO TEXT IS GENERATED.');                        24823400
*             IVRC = 12;     /* KILL TEXT GENERATION             @L1A*/ 24824700
*           END;             /* NUMBER(ELXLIST) > 1              @L1A*/ 24826000
*       END;                 /* ELXLIST SPECIFIED                @L1A*/ 24827300
*       ELSE DO;             /* NO ARGUMENT-ISSUE AHA0013        @L1A*/ 24828600
*         ANS MSG('AHA0013 ELXLIST (LIST ADDR) IS REQUIRED '!!          24829900
*                 'BUT IS NOT SPECIFIED. NO TEXT IS GENERATED.');       24831200
*         IVRC = 12;         /* KILL TEXT GENERATION             @L1A*/ 24832500
*       END;                 /* NO ELXLIST ARGUMENT              @L1A*/ 24833800
*   END;                     /* ELXLIST KEYWORD SPECIFIED        @L1A*/ 24835100
*   ELSE DO;                 /* ELXLIST NOT SPECIFIED            @L1A*/ 24836400
*     IF MF = ''             /* IF STANDARD FORM                 @L1A*/ 24837700
*      & LXLIST = ''         /* But not LXLIST                   @L1A*/ 24839000
*       THEN DO;             /* ERROR - ELXLIST IS REQUIRED      @L1A*/ 24840300
*         ANS MSG('AHA0013 ELXLIST IS REQUIRED FOR STANDARD FORM '!!    24841600
*                 'BUT IS NOT SPECIFIED. NO TEXT IS GENERATED.');       24842900
*         IVRC = 12;         /* KILL TEXT GENERATION             @L1A*/ 24844200
*       END;                 /* ERROR - ELXLIST IS REQUIRED      @L1A*/ 24845500
*   END;                     /* ELXLIST NOT SPECIFIED            @L1A*/ 24846800
*/********************************************************************/ 24850000
*/*                PROCESS SYSTEM KEYWORD                            */ 24900000
*/********************************************************************/ 24950000
* IVOPT11 = '0';             /* SET DEFAULT INIT. STRING             */ 25000000
* IF SYSTEM ^= ''            /* SYSTEM SPECIFIED?                    */ 25050000
*   THEN DO;                 /* YES - ADD SYSTEM KYWD TO COMMENT     */ 25100000
*     IVDOCMT=IVDOCMT!!' SYSTEM'!!SYSTEM;                               25150000
*     IF SYSTEM(1) ^= ''     /* ARGUMENT SPECIFIED?                  */ 25350000
*       THEN DO;             /* YES                                  */ 25400000
*         IF SYSTEM(1)='YES' /* IS ARGUMENT 'YES'                    */ 25450000
*           THEN             /* YES                                  */ 25500000
*             IVOPT11= '1';  /* SET OPTION INIT. STRING              */ 25550000
*           ELSE DO;         /* ARGUMENT IS NOT 'YES'                */ 25600000
*             IF SYSTEM(1)^='NO' /* ARGUMENT OTHER THAN 'NO'         */ 25650000
*               THEN DO;     /* YES - INVALID ARGUMENT               */ 25700000
*                 ANS MSG('AHA0043 SYSTEM MUST BE '!!                   25750000
*                         '''YES'' OR ''NO''. '!!                       25800000
*                         'NO TEXT IS GENERATED.');                     25850000
*                 IVRC=12;   /* PREVENT TEXT GENERATION              */ 25900000
*               END;         /* INVALID SYSTEM ARGUMENT              */ 25950000
*           END;             /* ARGUMENT IS NOT 'YES'                */ 26000000
*           IF NUMBER(SYSTEM) > 1 /* TOO MANY SYSTEM ARGS?           */ 26050000
*             THEN DO;                  /* YES -                     */ 26100000
*               ANS MSG('AHA0033 SYSTEM - '!!SYSTEM!!                   26150000
*                      ' - HAS TOO MANY ARGUMENTS. '!!                  26200000
*                      'NO TEXT IS GENERATED.');                        26250000
*               IVRC = 12;   /* KILL TEXT GENERATION                 */ 26300000
*             END;           /* TOO MANY SYSTEM ARGS                 */ 26350000
*       END;                 /* ARGUMENT SPECIFIED                   */ 26400000
*       ELSE DO;             /* NO ARGUMENT                          */ 26450000
*         ANS MSG('AHA0043 SYSTEM MUST BE ''YES'' OR ''NO''. '!!        26500000
*                         'NO TEXT IS GENERATED.');                     26550000
*         IVRC=12;           /* PREVENT TEXT GENERATION              */ 26600000
*       END;                 /* NO ARGUMENT                          */ 26650000
*   END;                     /* SYSTEM SPECIFIED                     */ 26700000
*/********************************************************************/ 26700600
*/*                PROCESS REUSABLE KEYWORD                          */ 26701200
*/********************************************************************/ 26701800
* IVOPT12 = '0';             /* SET DEFAULT INIT. STRING         @L1A*/ 26702400
* IF REUSABLE ^= ''          /* REUSABLE SPECIFIED?              @L1A*/ 26703000
*   THEN DO;                 /* YES - ADD REUSABLE KYWD TO COMMENT      26703600
*                                                                @L1A*/ 26704200
*     IVDOCMT=IVDOCMT!!' REUSABLE'!!REUSABLE;                 /* @L1A*/ 26704800
*     IF REUSABLE(1) ^= ''   /* ARGUMENT SPECIFIED?              @L1A*/ 26705400
*       THEN DO;             /* YES                              @L1A*/ 26706000
*         IF REUSABLE(1)='YES' /* IS ARGUMENT 'YES'              @L1A*/ 26706600
*           THEN             /* YES                              @L1A*/ 26707200
*             IVOPT12= '1';  /* SET OPTION INIT. STRING          @L1A*/ 26707800
*           ELSE DO;         /* ARGUMENT IS NOT 'YES'            @L1A*/ 26708400
*             IF REUSABLE(1)^='NO' /* ARGUMENT OTHER THAN 'NO'   @L1A*/ 26709000
*               THEN DO;     /* YES - INVALID ARGUMENT           @L1A*/ 26709600
*                 ANS MSG('AHA0043 REUSABLE MUST BE '!!                 26710200
*                         '''YES'' OR ''NO''. '!!                       26710800
*                         'NO TEXT IS GENERATED.');           /* @L1A*/ 26711400
*                 IVRC=12;   /* PREVENT TEXT GENERATION          @L1A*/ 26712000
*               END;         /* INVALID REUSABLE ARGUMENT        @L1A*/ 26712600
*           END;             /* ARGUMENT IS NOT 'YES'            @L1A*/ 26713200
*           IF NUMBER(REUSABLE) > 1 /* TOO MANY REUSABLE ARGS?   @L1A*/ 26713800
*             THEN DO;                  /* YES -                 @L1A*/ 26714400
*               ANS MSG('AHA0033 REUSABLE - '!!REUSABLE!!               26715000
*                      ' - HAS TOO MANY ARGUMENTS. '!!                  26715600
*                      'NO TEXT IS GENERATED.');              /* @L1A*/ 26716200
*               IVRC = 12;   /* KILL TEXT GENERATION             @L1A*/ 26716800
*             END;           /* TOO MANY REUSABLE ARGS           @L1A*/ 26717400
*       END;                 /* ARGUMENT SPECIFIED               @L1A*/ 26718000
*       ELSE DO;             /* NO ARGUMENT                      @L1A*/ 26718600
*         ANS MSG('AHA0043 REUSABLE MUST BE ''YES'' OR ''NO''. '!!      26719200
*                         'NO TEXT IS GENERATED.');           /* @L1A*/ 26719800
*         IVRC=12;           /* PREVENT TEXT GENERATION          @L1A*/ 26720400
*       END;                 /* NO ARGUMENT                      @L1A*/ 26721000
*   END;                     /* REUSABLE SPECIFIED               @L1A*/ 26721600
*/********************************************************************/ 26722200
*/*                PROCESS LXSIZE KEYWORD                            */ 26722800
*/********************************************************************/ 26723400
* IVOPT13 = '0';             /* SET DEFAULT INIT. STRING         @L1A*/ 26724000
* IVOPT14 = '0';             /* SET DEFAULT INIT. STRING         @L1A*/ 26724600
* IVOPT15 = '0';             /* SET DEFAULT INIT. STRING         @L1A*/ 26725200
* IF LXSIZE ^= ''            /* LXSIZE SPECIFIED?                @L1A*/ 26725800
*   THEN DO;                 /* YES - ADD LXSIZE KYWD TO COMMENT        26726400
*                                                                @L1A*/ 26727000
*     IVDOCMT=IVDOCMT!!' LXSIZE'!!LXSIZE;                     /* @L1A*/ 26727600
*     IF LXSIZE(1) ^= ''     /* ARGUMENT SPECIFIED?              @L1A*/ 26728200
*       THEN DO;             /* YES                              @L1A*/ 26728800
*         IF LXSIZE(1)='16'  /* IS ARGUMENT '16'                 @L1A*/ 26729400
*           THEN             /* YES                              @L1A*/ 26730000
*             IVOPT13= '1';  /* SET OPTION INIT. STRING          @L1A*/ 26730600
*    ELSE IF LXSIZE(1)='23'  /* IS ARGUMENT '23'                 @L1A*/ 26731200
*           THEN             /* YES                              @L1A*/ 26731800
*             IVOPT14= '1';  /* SET OPTION INIT. STRING          @L1A*/ 26732400
*    ELSE IF LXSIZE(1)='24'  /* IS ARGUMENT '24'                 @L1A*/ 26733000
*           THEN             /* YES                              @L1A*/ 26733600
*             IVOPT15= '1';  /* SET OPTION INIT. STRING          @L1A*/ 26734200
*           ELSE DO;         /* ARGUMENT IS NOT 'YES'            @L1A*/ 26734800
*             IF LXSIZE(1)^='12' /* ARGUMENT OTHER THAN 'NO'     @L1A*/ 26735400
*               THEN DO;     /* YES - INVALID ARGUMENT           @L1A*/ 26736000
*                 ANS MSG('AHA0043 LXSIZE MUST BE '!!                   26736600
*                         '''12'', ''16'', ''23'' OR ''24''. '!!        26737200
*                         'NO TEXT IS GENERATED.');           /* @L1A*/ 26737800
*                 IVRC=12;   /* PREVENT TEXT GENERATION          @L1A*/ 26738400
*               END;         /* INVALID LXSIZE ARGUMENT          @L1A*/ 26739000
*           END;             /* ARGUMENT IS NOT 'YES'            @L1A*/ 26739600
*           IF NUMBER(LXSIZE) > 1 /* TOO MANY LXSIZE ARGS?       @L1A*/ 26740200
*             THEN DO;                  /* YES -                 @L1A*/ 26740800
*               ANS MSG('AHA0033 LXSIZE - '!!LXSIZE!!                   26741400
*                      ' - HAS TOO MANY ARGUMENTS. '!!                  26742000
*                      'NO TEXT IS GENERATED.');              /* @L1A*/ 26742600
*               IVRC = 12;   /* KILL TEXT GENERATION             @L1A*/ 26743200
*             END;           /* TOO MANY LXSIZE ARGS             @L1A*/ 26743800
*       END;                 /* ARGUMENT SPECIFIED               @L1A*/ 26744400
*       ELSE DO;             /* NO ARGUMENT                      @L1A*/ 26745000
*         ANS MSG('AHA0043 LXSIZE MUST BE '                             26745600
*                      !! '''12'', ''16'', ''23'' OR ''24''.'           26746200
*                      !! 'NO TEXT IS GENERATED.');           /* @L1A*/ 26746800
*         IVRC=12;           /* PREVENT TEXT GENERATION          @L1A*/ 26747400
*       END;                 /* NO ARGUMENT                      @L1A*/ 26748000
*   END;                     /* LXSIZE SPECIFIED                 @L1A*/ 26748600
*/********************************************************************/ 26750000
*/*                PROCESS 'RELATED' KEYWORD                         */ 26800000
*/********************************************************************/ 26850000
* IF RELATED ^= ''           /* IF RELATED WAS SPECIFIED             */ 26900000
*   THEN                     /* ADD KEYWORD TO DO COMMENT            */ 26950000
*     IVDOCMT=IVDOCMT!!' RELATED'!!RELATED;                             27000000
*/********************************************************************/ 27050000
*/*                PUT OUT LABELS (IF ANY)                           */ 27100000
*/********************************************************************/ 27150000
* IF MACLABEL ^= ''          /* ANY LABELS SPECIFIED?                */ 27200000
*   THEN                     /* YES - PUT THEM OUT.                  */ 27250000
*     ANS(MACLABEL) COL(MACLMAR);                                       27300000
*/********************************************************************/ 27350000
*/*     PUT OUT DO STATEMENT (OR COMMENT FOR LIST FORM)              */ 27400000
*/********************************************************************/ 27450000
* IVDOCMT=IVDOCMT!!' MACDATE(87.118) '; /* ADD MACDATE TO COMMENT    */ 27500000
*                                       /*                   @YA04740*/ 27550000
* IF MF(1) = 'L'             /* LIST FORM OF THE MACRO?              */ 28850000
*   THEN DO;                 /* YES -                                */ 28900000
*     ANS(COMMENT(IVDOCMT))  /*       PUT OUT THE INVOCATION STRING  */ 28950000
*       COL(MACCOL);         /*         AS A COMMENT.                */ 29000000
*     IF IVRC > 4            /* ANY SEVERE ERRORS?                   */ 29050000
*       THEN                 /* YES -                                */ 29060000
*         GOTO LHA99999;     /*       EXIT - NO TEXT PRODUCED.       */ 29070000
*       GOTO LHA01000;       /* NO  - PROCESS LIST FORM.             */ 29080000
*   END;                     /* END - LIST FORM SPECIFIED.           */ 29090000
*   ELSE DO;                 /* NO  - NOT THE LIST FORM.             */ 29100000
*                            /*       GENERATE THE DO STATEMENT.     */ 29110000
*     ANS('DO; '!!COMMENT(IVDOCMT)) COL(MACCOL);                        29120000
*     IF IVRC > 4            /* ANY SEVERE ERRORS?                   */ 29130000
*       THEN                 /* YES -                                */ 29140000
*         GOTO LHA09000;     /*       PUT OUT END STMT AND EXIT      */ 29150000
*   END;                     /* END - NOT THE LIST FORM.             */ 29160000
*/********************************************************************/ 29300000
*/*   INDICATE EPILOG IS TO PRODUCE STANDARD SAVEAREA MAPPING.       */ 29303000
*/********************************************************************/ 29306000
* IF INDEX(EHAMAPS,'SA@')=0   /* IF SA@ MAPPING NOT PREVIOUSLY       */ 29309000
*   THEN                      /* REQUESTED THEN INDICATE REQUEST     */ 29312000
*     EHAMAPS = EHAMAPS!!'SA@,'; /* NOTE: COMMAS SEPERATE REQUESTS   */ 29315000
*/********************************************************************/ 29321000
*/*   INDICATE EPILOG IS TO PROVIDE ACCESS TO XM SERVICES.           */ 29324000
*/********************************************************************/ 29327000
* IF INDEX(EHAMAPS,'XM@')=0   /* IF XM SERVICES NOT PREVIOUSLY       */ 29330000
*   THEN                      /* REQUESTED THEN INDICATE REQUEST     */ 29333000
*     EHAMAPS = EHAMAPS!!'XM@,'; /* NOTE: COMMAS SEPERATE REQUESTS   */ 29336000
* IF MF(1)='M' THEN          /* IF MODIFY FORM OF MACRO              */ 29339000
*   GOTO LHA00800;           /* THEN DONT GEN PC LINKAGE FRONT END   */ 29342000
*/********************************************************************/ 29345000
*/*                DEFINE REGISTER NAMES FOR PC LINKAGE              */ 29348000
*/********************************************************************/ 29351000
* IF INDEX(EHAREGS,'00F')=0  /* REGISTER 0 PREVIOUSLY DEFINED?       */ 29354000
*   THEN                     /* NO  -                                */ 29357000
*     EHAREGS=EHAREGS!!'00F';/*       DEFINE IT.                     */ 29360000
* IF INDEX(EHAREGS,'01P')=0  /* REGISTER 1 PREVIOUSLY DEFINED?       */ 29363000
*   THEN                     /* NO  -                                */ 29366000
*     EHAREGS=EHAREGS!!'01P';/*       DEFINE IT.                     */ 29369000
* IF INDEX(EHAREGS,'02P')=0  /* REGISTER 2 PREVIOUSLY DEFINED?       */ 29372000
*   THEN                     /* NO  -                                */ 29375000
*     EHAREGS=EHAREGS!!'02P';/*       DEFINE IT.                     */ 29378000
* IF INDEX(EHAREGS,'12P')=0  /* REGISTER 12 PREVIOUSLY DEFINED?      */ 29390000
*   THEN                     /* NO  -                                */ 29393000
*     EHAREGS=EHAREGS!!'12P';/*       DEFINE IT.                     */ 29396000
* IF INDEX(EHAREGS,'13P')=0  /* REGISTER 13 PREVIOUSLY DEFINED?      */ 29399000
*   THEN                     /* NO  -                                */ 29402000
*     EHAREGS=EHAREGS!!'13P';/*       DEFINE IT.                     */ 29405000
* IF INDEX(EHAREGS,'14P')=0  /* REGISTER 14 PREVIOUSLY DEFINED?      */ 29408000
*   THEN                     /* NO  -                                */ 29411000
*     EHAREGS=EHAREGS!!'14P';/*       DEFINE IT.                     */ 29414000
* IF INDEX(EHAREGS,'15F')=0  /* FIXED REG 15 PREVIOUSLY DEFINED?     */ 29417000
*   THEN                     /* NO  -                                */ 29420000
*     EHAREGS=EHAREGS!!'15F';/*       DEFINE IT.                     */ 29423000
*/********************************************************************/ 29426000
*/*                GENERATE LINKAGE TO LXRES SERVICE (FRONT END)     */ 29429000
*/********************************************************************/ 29432000
* ANS('RESPECIFY')                                COL(IVINDNT2);        29435000
* ANS('(GPR00F,')                                 COL(IVINDNT2+1);      29438000
* ANS('GPR01P,')                                  COL(IVINDNT2+2);      29441000
* IF SYSOSREL < SYSOSREL_ZOSV1R6 &                            /* @L1A*/ 29442200
*   ELXLIST = '' THEN                                         /* @L1A*/ 29443400
* DO;                                                         /* @L1A*/ 29444600
*   ANS('GPR13P,')                                COL(IVINDNT2+2);      29445800
*   ANS('GPR14P,')                                COL(IVINDNT2+2);      29447000
* END;                                                        /* @L1A*/ 29448200
* ANS('GPR15F) RESTRICTED;')                      COL(IVINDNT2+2);      29450000
*  IF SYSOSREL < SYSOSREL_ZOSV1R6 &                           /* @L1A*/ 29450700
*   ELXLIST = '' THEN                                         /* @L1A*/ 29451400
*  DO;                                                        /* @L1A*/ 29452100
* ANS('STM(GPR14P,GPR12P,SA@G1412);')             COL(IVINDNT2);        29453000
* ANS(COMMENT(' SAVE CALLER''S REGS            ')) COL(CC);             29456000
*  END;                                                       /* @L1A*/ 29457500
*/********************************************************************/ 29459000
*/*                SET UP APPROPRIATE LIST NAME                      */ 29462000
*/********************************************************************/ 29465000
*LHA00800:                                                              29468000
* IF MF ^= ''                /* MODIFY OR EXECUTE FORM OF THE MACRO? */ 29500000
*   THEN DO;                 /* YES -                                */ 29550000
*     IVLIST = MF(2);        /*       USE LIST NAME PROVIDED.        */ 29600000
*     GOTO LHA00900;         /*       EXECUTE COMMON PROCESSING.     */ 29650000
*   END;                     /* END- EXECUTE OR MODIFY FORMSPECIFIED */ 29700000
*   ELSE DO;                 /* NO - MUST BE STANDARD FORM.          */ 29750000
*                            /*      USE STANDARD LIST NAME.         */ 29800000
*    IF INDEX(EHAPCLIST,IVLIST)=0 /* STD. LIST PREVIOUSLY DEFINED?   */ 29850000
*      THEN                  /* NO  - DEFINE IT.                     */ 29900000
*        EHAPCLIST = EHAPCLIST !! IVLIST;                               29950000
*   END;                     /* END- STANDARD LIST NAME TO BE USED   */ 30000000
* IF EHAMAXLEN < IVLSTLEN    /* IS THIS THE LONGEST LIST YET DEFINED?*/ 30050000
*   THEN                     /* YES -                                */ 30100000
*     EHAMAXLEN = IVLSTLEN;  /*       SET ITS LENGTH AS THE MAXIMUM. */ 30150000
* GOTO LHA00910;             /* ZERO OUT THE STANDARD LIST.          */ 30200000
*/********************************************************************/ 30300000
*/*                ZERO OUT THE LIST AND SET DEFAULTS                */ 30350000
*/*                     IF STANDARD FORM                             */ 30400000
*/*                  OR IF MODIFY OR EXECUTE FORM WITH 'COMPLETE'    */ 30450000
*/********************************************************************/ 30500000
*LHA00900:                                                              30600000
* IF MF(3) = ''              /* WAS 'COMPLETE' SPECIFIED?            */ 30650000
*   THEN                     /* NO  -                                */ 30700000
*     GOTO LHA00920;         /*       DO NOT ZERO THE LIST.          */ 30750000
*LHA00910:                   /* YES - ZERO THE LIST.                 */ 30800000
*/*  MAINTENANCE NOTE: THE '00' AND '20' FIELDS ARE AUTOMATICALLY    */ 30850000
*/*                    INITIALIZED TO THEIR DEFAULT VALUES OF ZERO   */ 30900000
*/*                    VIA THE ZEROING OF THE LIST. IF THE DEFAULTS  */ 30950000
*/*                    BECOME NON-ZERO ADDITIONAL STMTS SHOULD BE    */ 31000000
*/*                    INSERTED HERE.                                */ 31050000
* ANS(IVLIST!!'='!!IVLIST!!'&&'!!IVLIST!!'; ')      COL(IVINDNT2);      31100000
* ANS(COMMENT(' ZERO THE LIST                 '))   COL(CC);            31150000
*/********************************************************************/ 31200000
*/*                ASSIGN VALUES TO LIST ITEMS                       */ 31250000
*/********************************************************************/ 31300000
*LHA00920:                                                              31400000
* IF SYSTEM ^= ''            /* IF SYSTEM KEYWORD SPECIFIED          */ 31450000
*   THEN DO;                                                            31500000
*     IF IVOPT11 = '0'       /* IF SYSTEM=NO SPECIFIED               */ 31550000
*       THEN DO;                                                        31600000
*         IF IVCLROPT = 1    /* IF CLEAR OPTIONS REQUIRED            */ 31650000
*           THEN DO;                                                    31700000
*             ANS(IVLIST!!'11='''!!IVOPT11!!'''B; ') COL(IVINDNT2);     31750000
*             ANS(COMMENT(' SET SYSTEM=NO OPTION          ')) COL(CC);  31800000
*           END;                                                        31850000
*       END;                 /* SYSTEM=NO SPECIFIED                  */ 31900000
*       ELSE DO;             /* SYSTEM=YES OPTION SPECIFIED          */ 31950000
*         ANS(IVLIST!!'11='''!!IVOPT11!!'''B; ') COL(IVINDNT2);         31990000
*         ANS(COMMENT(' SET SYSTEM=YES OPTION         ')) COL(CC);      32030000
*       END;                                                            32070000
*   END;                                                                32150000
* IF REUSABLE ^= ''          /* IF REUSABLE KEYWORD SPECIFIED    @L1A*/ 32151200
*   THEN DO;                                                  /* @L1A*/ 32152400
*     IF IVOPT12 = '0'       /* IF REUSABLE=NO SPECIFIED         @L1A*/ 32153600
*       THEN DO;                                              /* @L1A*/ 32154800
*         IF IVCLROPT = 1    /* IF CLEAR OPTIONS REQUIRED        @L1A*/ 32156000
*           THEN DO;                                          /* @L1A*/ 32157200
*             ANS(IVLIST!!'12='''!!IVOPT12!!'''B; ') COL(IVINDNT2)      32158400
*                               ;                             /* @L1A*/ 32159600
*             ANS(COMMENT(' SET REUSABLE=NO OPTION          ')) COL(CC) 32160800
*                               ;                             /* @L1A*/ 32162000
*           END;                                              /* @L1A*/ 32163200
*       END;                 /* REUSABLE=NO SPECIFIED            @L1A*/ 32164400
*       ELSE DO;             /* REUSABLE=YES OPTION SPECIFIED    @L1A*/ 32165600
*         ANS(IVLIST!!'12='''!!IVOPT12!!'''B; ') COL(IVINDNT2)          32166800
*                               ;                             /* @L1A*/ 32168000
*         ANS(COMMENT(' SET REUSABLE=YES OPTION         ')) COL(CC)     32169200
*                               ;                             /* @L1A*/ 32170400
*       END;                                                  /* @L1A*/ 32171600
*   END;                                                                32172800
* IF LXSIZE ^= ''            /* IF LXSIZE KEYWORD SPECIFIED      @L1A*/ 32174000
*   THEN DO;                                                  /* @L1A*/ 32175200
*     IF IVOPT13 = '0'       /* IF LXSIZE ^= 16 specified        @L1A*/ 32176400
*       THEN DO;                                              /* @L1A*/ 32177600
*         IF IVCLROPT = 1    /* IF CLEAR OPTIONS REQUIRED        @L1A*/ 32178800
*           THEN DO;                                          /* @L1A*/ 32180000
*             ANS(IVLIST!!'13='''!!IVOPT13!!'''B; ') COL(IVINDNT2)      32181200
*                               ;                             /* @L1A*/ 32182400
*             ANS(COMMENT(' SET LXSIZE ^= 16 OPTION       ')) COL(CC)   32183600
*                               ;                             /* @L1A*/ 32184800
*           END;                                              /* @L1A*/ 32186000
*       END;                 /* LXSIZE=NO SPECIFIED              @L1A*/ 32187200
*       ELSE DO;             /* LXSIZE=YES OPTION SPECIFIED      @L1A*/ 32188400
*         ANS(IVLIST!!'13='''!!IVOPT13!!'''B; ') COL(IVINDNT2)          32189600
*                               ;                             /* @L1A*/ 32190800
*         ANS(COMMENT(' SET LXSIZE=16 OPTION         ')) COL(CC)        32192000
*                               ;                             /* @L1A*/ 32193200
*       END;                                                  /* @L1A*/ 32194400
*     IF IVOPT14 = '0'       /* IF LXSIZE ^= 23 specified        @L1A*/ 32195600
*       THEN DO;                                              /* @L1A*/ 32196800
*         IF IVCLROPT = 1    /* IF CLEAR OPTIONS REQUIRED        @L1A*/ 32198000
*           THEN DO;                                          /* @L1A*/ 32199200
*             ANS(IVLIST!!'14='''!!IVOPT14!!'''B; ') COL(IVINDNT2)      32200400
*                               ;                             /* @L1A*/ 32201600
*             ANS(COMMENT(' SET LXSIZE ^= 23 OPTION       ')) COL(CC)   32202800
*                               ;                             /* @L1A*/ 32204000
*           END;                                              /* @L1A*/ 32205200
*       END;                 /* LXSIZE=NO SPECIFIED              @L1A*/ 32206400
*       ELSE DO;             /* LXSIZE=YES OPTION SPECIFIED      @L1A*/ 32207600
*         ANS(IVLIST!!'14='''!!IVOPT14!!'''B; ') COL(IVINDNT2)          32208800
*                               ;                             /* @L1A*/ 32210000
*         ANS(COMMENT(' SET LXSIZE=23 OPTION         ')) COL(CC)        32211200
*                               ;                             /* @L1A*/ 32212400
*       END;                                                  /* @L1A*/ 32213600
*     IF IVOPT15 = '0'       /* IF LXSIZE ^= 24 specified        @L1A*/ 32214800
*       THEN DO;                                              /* @L1A*/ 32216000
*         IF IVCLROPT = 1    /* IF CLEAR OPTIONS REQUIRED        @L1A*/ 32217200
*           THEN DO;                                          /* @L1A*/ 32218400
*             ANS(IVLIST!!'15='''!!IVOPT15!!'''B; ') COL(IVINDNT2)      32219600
*                               ;                             /* @L1A*/ 32220800
*             ANS(COMMENT(' SET LXSIZE ^= 24 OPTION       ')) COL(CC)   32222000
*                               ;                             /* @L1A*/ 32223200
*           END;                                              /* @L1A*/ 32224400
*       END;                 /* LXSIZE=NO SPECIFIED              @L1A*/ 32225600
*       ELSE DO;             /* LXSIZE=YES OPTION SPECIFIED      @L1A*/ 32226800
*         ANS(IVLIST!!'15='''!!IVOPT15!!'''B; ') COL(IVINDNT2)          32228000
*                               ;                             /* @L1A*/ 32229200
*         ANS(COMMENT(' SET LXSIZE=24 OPTION         ')) COL(CC)        32230400
*                               ;                             /* @L1A*/ 32231600
*       END;                                                  /* @L1A*/ 32232800
*   END;                                                                32234000
* IF ELXLIST ^= ''           /* IF ELXLIST KEYWORD SPECIFIED     @L1A*/ 32235200
*   THEN DO;                                                  /* @L1A*/ 32236400
*         ANS(IVLIST!!'16='''!!IVOPT16!!'''B; ') COL(IVINDNT2)          32237600
*                               ;                             /* @L1A*/ 32238800
*         ANS(COMMENT(' ELXLIST specified              ')) COL(CC)      32240000
*                               ;                             /* @L1A*/ 32241200
*   END;                                                                32242400
* IF LXLIST = '' &           /* IF LXLIST KEYWORD NOT SPECIFIED      */ 32243600
*    ELXLIST = ''            /* IF ELXLIST KEYWORD NOT SPECIFIED @L1A*/ 32244800
*   THEN GOTO LHA00930;                                                 32250000
* IF IVLP1 = 0               /* IF NOT POINTER FORM ADDRESS          */ 32300000
*   THEN DO;                                                            32350000
*     ANS(IVLIST!!'22=ADDR('!!LXLISTSTR!!'); ')        COL(IVINDNT2);   32400000
*     ANS(COMMENT(' SET LXLIST ADDRESS            '))  COL(CC);         32450000
*   END;                                                                32500000
*   ELSE DO;                                                            32550000
*     ANS(IVLIST!!'22='!!LXLISTSTR(IVLP1+1:IVRP1-1)!!';')               32600000
*                                                      COL(IVINDNT2);   32650000
*     ANS(COMMENT(' SET (E)LXLIST ADDRESS            ')) COL(CC);       32700000
*   END;                                                                32750000
*LHA00930:                                                              32800000
* IF MF(1) = 'M'             /* IF MODIFY FORM OF MACRO              */ 32850000
*   THEN                     /* YES -                                */ 32900000
*     GOTO LHA09000;         /*       DO NOT GENERATE PC LINKAGE     */ 32950000
*/********************************************************************/ 32960000
*/*                BALANCE OF PC LINKAGE (BACK END)                  */ 32970000
*/********************************************************************/ 32980000
* ANS('GPR01P=ADDR('!!IVLIST!!'); ')              COL(IVINDNT2);        32984000
* ANS(COMMENT(' LXRES PARAMETER LIST ADDRESS  ')) COL(CC);              32988000
*  IF SYSOSREL < SYSOSREL_ZOSV1R6 &                           /* @L1A*/ 32989000
*   ELXLIST = '' THEN                                         /* @L1A*/ 32990000
*  DO;                                                        /* @L1A*/ 32991000
* ANS('ESAR(SA@GPR15);')                          COL(IVINDNT2);        32992000
* ANS(COMMENT('SAVE SASID                     ')) COL(CC);              32996000
*  END;                                                       /* @L1A*/ 33014000
* ANS('GPR15F=XM@(1);')                           COL(IVINDNT2);        33032000
* ANS(COMMENT(' GET LX/EX FOR LXRES FROM SFT  ')) COL(CC);              33050000
* IF SYSOSREL < SYSOSREL_ZOSV1R6 &                            /* @L1A*/ 33090000
*   ELXLIST = '' THEN                                         /* @L1A*/ 33130000
*  ANS('GEN (DS 0H);') COL(IVINDNT2); /* MAKE PL/AS USE SAVEAREA @P1A*/ 33170000
* ANS('PC(GPR15F);')                              COL(IVINDNT2);        33210000
* ANS(COMMENT(' PC TO LXRES SERVICE           ')) COL(CC);              33250000
*  IF SYSOSREL < SYSOSREL_ZOSV1R6 &                           /* @L1A*/ 33254100
*   ELXLIST = '' THEN                                         /* @L1A*/ 33258200
*  DO;                                                        /* @L1A*/ 33262300
* ANS('SSAR(SA@GPR15);')                          COL(IVINDNT2);        33266600
* ANS(COMMENT('RESTORE SASID                  ')) COL(CC);              33283200
* ANS('LM(GPR02P,GPR12P,SA@G0212);')              COL(IVINDNT2);        33300000
* ANS(COMMENT(' RESTORE REGS 2-12             ')) COL(CC);              33350000
* ANS('GPR14P=SA@GPR14;')                         COL(IVINDNT2);        33400000
* ANS(COMMENT(' RESTORE REG 14                ')) COL(CC);              33450000
*  END;                                                       /* @L1A*/ 33500000
* ANS('RESPECIFY')                                COL(IVINDNT2);        34550000
* ANS('(GPR00F,')                                 COL(IVINDNT2+1);      34600000
* ANS('GPR01P,')                                  COL(IVINDNT2+2);      34650000
* IF SYSOSREL < SYSOSREL_ZOSV1R6 &                            /* @L1A*/ 34700000
*   ELXLIST = '' THEN                                         /* @L1A*/ 34750000
* DO;                                                         /* @L1A*/ 34800000
*   ANS('GPR13P,')                                COL(IVINDNT2+2);      34850000
*   ANS('GPR14P,')                                COL(IVINDNT2+2);      34900000
* END;                                                        /* @L1A*/ 34950000
* ANS('GPR15F) UNRESTRICTED;')                    COL(IVINDNT2+2);      35700000
*                                                                       35750000
*LHA09000:                   /* CLOSE OUT DO GROUP.                  */ 35800000
* ANS('END; ') COL(MACCOL);                                             35850000
* GOTO LHA99999;             /* RETURN TO INVOKER                    */ 35900000
*/********************************************************************/ 35950000
*/*                PROCESS LIST-FORM                                 */ 36000000
*/********************************************************************/ 36050000
*LHA01000:                                                              36150000
*                            /* PUT LIST-NAME IN AHALXRES MACLIST(1) */ 36200000
* IVLFORM = IVLFORM!!MF(2)!!',';                                        36250000
* IF MF(3) ^= ''             /* WERE LIST ATTRIBUTES SPECIFIED?      */ 36300000
*   THEN                     /* YES - PUT THEM IN AHALXRES MACLIST(2)*/ 36350000
*     IVLFORM = IVLFORM!!MF(3)!!',';                                    36400000
*   ELSE                     /* NO  -                                */ 36450000
*     IVLFORM = IVLFORM!!',';/* INDICATE NO MF(3) LIST ATTRIBUTES    */ 36500000
* IF SYSTEM ^= ''            /* IF SYSTEM WAS SPECIFIED              */ 36600000
*  ! REUSABLE ^= ''          /* IF REUSABLE WAS SPECIFIED        @L1A*/ 36612500
*  ! LXSIZE ^= ''            /* IF LXSIZE WAS SPECIFIED          @L1A*/ 36625000
*  ! ELXLIST ^= ''           /* IF ELXLIST was specified         @L1A*/ 36637500
*   THEN DO;                 /* AT LEAST ONE OPTION SET              */ 36650000
*     IVOPTS  = IVOPT11 !! IVOPT12 !! IVOPT13 !! IVOPT14 !! IVOPT15 !!  36683300
*          IVOPT16 !! '00';  /* Set options byte init string     @L1C*/ 36716600
*     IVLFORM = IVLFORM!!IVOPTS!!',';/*SET OPTIONS BYTE IN MACLIST(3)*/ 36750000
*   END;                     /* AT LEAST ONE OPTION SET              */ 36800000
*   ELSE                     /* NO OPTIONS SET                       */ 36850000
*     IVLFORM = IVLFORM!!',';/* INDICATE NO OPTIONS INITIALIZATION   */ 36900000
*                                                                       36950000
* IF LXLIST ^= '' !          /* IF LXLIST WAS SPECIFIED              */ 36983300
*   ELXLIST ^= ''            /* IF ELXLIST WAS SPECIFIED         @L1A*/ 37016600
*   THEN                     /* SET VALUE IN MACLIST(4)              */ 37050000
*     IVLFORM = IVLFORM!!LXLISTSTR;                                     37100000
* ANS(IVLFORM!!');');        /* INVOKE LIST MACRO (AHALXRES).        */ 37150000
*/********************************************************************/ 37200000
*/*                RETURN                                            */ 37250000
*/********************************************************************/ 37300000
*LHA99999:                                                              37500000
*  RETURN CODE(IVRC);                                                   37550000
*/********************************************************************/ 37600000
*/*                END OF LXRES MACRO                                */ 37650000
*/********************************************************************/ 37700000
* % END LXRES;                                                          37750013
