*********************************************************************** 00050000
*        @PROCESS  OPT(4),FORMAT,GMAR(1,72),NOIMP,                    * 00100000
*                                                                     * 00150000
*PROPRIETARY V3 STATEMENT                                             * 00200000
*LICENSED MATERIALS - PROPERTY OF IBM                                 * 00250000
*"RESTRICTED MATERIALS OF IBM"                                        * 00300000
*5695-DF1                                                             * 00350000
*(C) COPYRIGHT 1992  IBM CORP.                                        * 00400000
*END PROPRIETARY V3 STATEMENT                                         * 00450000
*********************************************************************** 00500000
         MACRO                                                          00550000
&NAME    PROTECT   &REG                                                 00600000
.*A 210500,211000                                                A43356 00650000
.*C 280000                                                       A43356 00700000
         AIF   ('&REG' EQ  '').ERR1                                     00750000
         AIF   ('&NAME' EQ '').NLBL                              A43356 00800000
&NAME    DS    0H                                                A43356 00850000
.NLBL    AIF   ('&REG' EQ '(1)').GOEN                            A43356 00900000
         AIF   ('&REG'(1,1) NE '(').GADD                                00950000
         LR    1,&REG(1)           LOAD PARAMETER REGISTER              01000000
         AGO   .GOEN                                                    01050000
.GADD    LA    1,&REG              LOAD PARAMETER REGISTER              01100000
.GOEN    SVC   98                  ISSUE PROTECT SVC                    01150000
         AGO   .END                                                     01200000
.ERR1    MNOTE 'PARAMETER NOT SPECIFIED'                                01250000
.END     MEND                                                           01300000
