*********START OF SPECIFICATIONS*************************************** 00010000
*                                                                       00020001
* $MAC(RACDEF) COMP(SC1BN) PROD(RACF):                                  00030000
*                                                                       00040000
* DESCRIPTIVE NAME = RESOURCE DEFINITION MACRO                          00050000
*                                                                       00060000
* *01* PROPRIETARY STATEMENT=                                         * 00070000
*  **PROPRIETARY_STATEMENT********************************************* 00080000
*                                                                     * 00090000
*                                                                     * 00100000
*   Licensed Materials - Property of IBM                              * 00110004
*   5650-ZOS Copyright IBM Corp. 1977, 2019                           * 00120004
*                                                                     * 00130000
*   STATUS= HBB77C0                                                   * 00140000
*                                                                     * 00150000
*  **END_OF_PROPRIETARY_STATEMENT************************************** 00160000
*                                                                    *  00170000
*01* EXTERNAL CLASSIFICATION:                                        *  00180000
*02* GUPI:                                                           *  00190000
*01* END OF EXTERNAL CLASSIFICATION:                                 *  00200000
*                                                                    *  00210000
*                                                                    *  00220001
* FUNCTION = ISSUED WHENEVER A RESOURCE MANAGER                         00230000
*    DETERMINES THAT A RESOURCE SHOULD BE DEFINED, DELETED OR           00240000
*    CHANGED TO THE SECURITY PACKAGE.                              @L5A 00250000
*                                                                       00260000
*                                                                       00270001
* CHANGE ACTIVITY =  A 00000000-99999999                       @Y40RSGD 00280000
*                    RACF VERSION 1, RELEASE 2                 @PC002PY 00290000
*                    RACF VERSION 1, RELEASE 3                 @PC003PY 00300000
*                    $L4=HRF1402,RACF/140,810701,SJRDSD:           @L4A 00310000
*                    OZ56979                                   @ZA56979 00320000
*                    OZ56982                                   @ZA56982 00330000
*                    $T1=UZ90211,SAF/RF15,810702,CNTDSD:           @T1A 00340000
*                    $L5=HRF1502,RACF/150,820311,CNTDSD:           @L5A 00350000
*                    $L6=HRF1602,RACF/160,830307,CNTDSD:           @L6A 00360000
*                    UZ90283                                   @ZA90283 00370000
*                    UZ90284                                   @ZA90284 00380000
*                    UZ90285                                   @ZA90285 00390000
*                    $L7=HRF1702,RACF/170,840608,CNTDSD:           @L7A 00400000
*                    $L8=HRF1802,RACF/180,860904,CNTDSD:           @L8A 00410000
*                    $M1=JRF1812,RACF/181,871116,CNTDSD:           @M1A 00420000
* $M2=JBB3313  RACF/190 880330 PDLCL1 : MVS B1 SECURITY            @M2A 00430000
*                    OY12773                                   @YA12773 00440000
*                    $P1=PGW0010 RACF/190 880428                   @P1A 00450000
* $P2=PGW0054  RACF/190 890308 PDPWB1 : PGW0054                    @P2A 00460000
* $M3=VMSFS    RACF/190 890517 PDB_S1 : SHARED FILE SYSTEM         @M3A 00470000
*                    OY13562                                   @YA13562 00480000
* $P3=PGP0418  RACF/190 890517 PDB_S1 : PGP0418                    @P3A 00490000
* $P4=PGP0568  RACF/190 890923 PDB_S1 : PGP0568                    @P4A 00500000
* $M4=RELID    RACF/192 900904 PDAHW1 : SUPPORT FOR RACF 1.9.2     @M4A 00510000
* $P5=PJA0029  RACF/192 910524 PDPSB1 : PJA0029                    @P5A 00520000
* $01=OY50857  RACF/192 920206 PDMDC1 : Support for OY50857        @01A 00530000
* $M5=OW04015  RACF/210 930427 PDKAF1 : Support for RACF 2.1       @M5A 00540000
* $M6=OW10709  RACF/220 940510 PDJMV1 : SUPPORT FOR RACF 2.2       @M6A 00550000
* $M7=RELID    RACF/230 960422 PDJMV1 : SUPPORT FOR RACF 2.3       @M7A 00560000
* $P6=PQC2423  RACF/230 960913 PDAWC1 : PQC2423                    @P6A 00570000
* $M8=RELID    RACF/240 960904 PDJMV1 : SUPPORT FOR RACF 2.4       @M8A 00580000
* $M9=RELID    RACF/260 970728 PDCAM1 : SUPPORT FOR RACF 2.6       @M9A 00590000
* $MA=RELID    HRF2608  980624 PDRDS2 : SUPPORT FOR HRF2608        @MAA 00600000
* $MB=RELID   RACF/7703 990415 PDRDS2 : SUPPORT FOR HRF7703        @MBA 00610000
* $MC=RELID    HRF7705  000405 PDIFS2 : SUPPORT FOR HRF7705        @MCA 00620000
* $MD=RELID    HRF7706  010430 PDRDC1 : SUPPORT FOR HRF7706        @MDA 00630000
* $ME=RELID    HRF7707  020109 PDMSF1 : SUPPORT FOR HRF7707        @MEA 00640000
* $MF=RELID    HRF7708  020118 PDMSF1 : SUPPORT FOR HRF7708        @MFA 00650000
* $MG=TPSEQ    HRF7708  020628 PDJJP1 : DFSMS Enhancements         @MGA 00660000
* $P7=PYN0600  HRF7708  020909 PDJJP1 : PTM PYN0600                @P7A 00670000
* $MH=RELID    HRF7709  030430 PDMSD1 : SUPPORT FOR HRF7709        @MHA 00680000
* $MI=RELID    HRF7720  040224 PDRIV1 : Support SAF FMID HBB7720   @MIA 00690000
* $MJ=RELID    HRF7730  050531 PDRIV1 : Support SAF FMID HBB7730   @MJA 00700000
* $MK=RELID    HRF7740  060330 PDRIV1 : Support SAF FMID HBB7740   @MKA 00710000
* $ML=RELID    HRF7750  070302 PDRIV1 : Support SAF FMID HBB7750   @MLA 00720000
* $MM=RELID    HRF7760  080522 PDJLW1 : Support SAF FMID HBB7760   @MMA 00730000
* $MN=RELID    HRF7770  090511 PDJLW1 : Support SAF FMID HBB7770   @MNA 00740000
* $MO=RELID    HRF7780  100513 PDJLW1 : Support SAF FMID HBB7780   @MOA 00750000
* $MP=RELID    HRF7790  110117 PDJLW1 : Support SAF FMID HBB7790   @MPA 00760000
* $MQ=RELID    HRF77A0  130110 PDAWS1 : Support SAF FMID HBB77A0   @MQA 00770000
* $MR=RELID    HRF77B0  150508 PDPGP1 : Support SAF FMID HBB77B0   @MRA 00780000
* $MS=RELID    HBB77C0  180524 PDGTM1 : ParmList Version Support   @MSA 00790006
*                                                                       00800000
*                                                                       00810000
*                                                                       00820000
* CHANGE DESCRIPTION:                                                   00830000
*    A - SUPPORT FOR SECLABL KEYWORD                               @M2A 00840000
*    A - DELETE REGISTER CHECK                                     @P1A 00850000
*    A - Generate correct length plist for release < 1.8.X         @P2A 00860000
*    A - SUPPORT THE KEYWORDS ENTITYX, MENTX AND NEWNAMX FOR            00870000
*        SHARED FILE SYSTEM                                        @M3A 00880000
*    A - NO ACTUAL CHANGES IN THE CODE                         @YA13562 00890000
*    A - Issue mnote when racdef is invoked in standard form       @P3A 00900000
*        and neither entity nor entityx keyword is specified,      @P3A 00910000
*        for release 1.9 and later only.                           @P3A 00920000
*    D - Support to disallow specification of RESOWN, STORCLA      @P4A 00930000
*        and MGMTCLA when ENVIR is not equal to VERIFY.            @P4A 00940000
*    A - Add support for RACF release 1.9.2                        @M4A 00950000
*    C - Status to correctly correspond to MVS level               @P5A 00960000
*    M - Skip test for required keywords when model related        @01A 00970000
*        keywords are specified with MF not equal to S.            @01A 00980000
*    A - Allow RACF Release 2.1 to be specified                    @M5A 00990000
*    A - Allow RACF Release 2.2 to be specified                    @M6A 01000000
*    A - Allow RACF Release 2.3 to be specified                    @M7A 01010000
*    A - Fix setting tape flag when EXPDTX is specified            @P6A 01020000
*        for the standard form of the macro.                       @P6A 01030000
*    A - Allow RACF Release 2.4 to be specified                    @M8A 01040000
*    A - Allow RACF Release 2.6 to be specified for FMID HRF2260   @M9A 01050000
*    A - Allow RACF Release 2608 to be specified for FMID HRF2608  @MAA 01060000
*    A - Allow RACF Release 7703 to be specified for FMID HRF7703  @MBA 01070000
*    A - Allow RACF Release 7705 to be specified for FMID HRF7705  @MCA 01080000
*    A - Allow RACF Release 7706 to be specified for FMID HRF7706  @MDA 01090000
*    A - Allow RACF Release 7707 to be specified for FMID HRF7707  @MEA 01100000
*    A - Allow RACF Release 7708 to be specified for FMID HRF7708  @MFA 01110000
*    A - Added MNOTE to prevent FILESEQ number greater than 65535  @MGA 01120000
*    A - Update MNOTE for FILESEQ number greater than 65535        @P7A 01130000
*        Needs to be RC 4 to allow assemble continue               @P7A 01140000
*    A - Allow RACF Release 7709 to be specified for FMID HRF7709  @MHA 01150000
*    A - Add support for SAF Release FMID HBB7720                  @MIA 01160000
*    A - Add support for SAF Release FMID HBB7730                  @MJA 01170000
*    A - Add support for SAF Release FMID HBB7740                  @MKA 01180000
*    A - Add support for SAF Release FMID HBB7750                  @MLA 01190000
*    A - Add support for SAF Release FMID HBB7760                  @MMA 01200000
*    A - Add support for SAF Release FMID HBB7770                  @MNA 01210000
*    A - Add support for SAF Release FMID HBB7780                  @MOA 01220000
*    A - Add support for SAF Release FMID HBB7790                  @MPA 01230000
*    A - Add support for SAF Release FMID HBB77A0                  @MQA 01240000
*    A - Add support for SAF Release FMID HBB77B0                  @MRA 01250000
* A - Support for Parameter List Version                                01260001
*     - Specify the parameter list version instead of                   01270001
*       the last 4 characters of the FMID by specifying                 01280001
*       RELEASE=PLV0001                                            @MSA 01290001
*                                                                       01300002
*                                                                       01310001
*                                                                       01320001
*                                                                       01330001
*********END OF SPECIFICATIONS***************************************** 01340000
         MACRO                                                          01350000
&SYMBOL  RACDEF &ENTITY=,&VOLSER=,&DSTYPE=,&OLDVOL=,&NEWNAME=,         -01360000
               &TYPE=,&MF=S,&INSTLN=,&CLASS=,&MENTITY=,            @M3C-01370000
               &UNIT=,                                             @L4A-01380000
               &UACC=,                                             @L4A-01390000
               &OWNER=,                                            @L4A-01400000
               &LEVEL=,                                            @L4A-01410000
               &AUDIT=,                                            @L4A-01420000
               &DATA=,                                             @L4A-01430000
               &SPECIAL=,                                          @L4A-01440000
               &MVOLSER=,&ACEE=,                               @PC003PY-01450000
               &RACFIND=,&CHKAUTH=,                                @L5A-01460000
               &WARNING=,&GENERIC=,                                @L7A-01470000
               &FILESEQ=,&EXPDT=,&EXPDTX=,                         @L8A-01480000
               &RETPD=,&ACCLVL=,                                   @L7A-01490000
               &TAPELBL=,&ERASE=,                                  @L7A-01500000
               &SECLVL=,&CATGORY=,                                 @L7A-01510000
               &MCLASS=,&MGENER=,&NOTIFY=,                         @L7A-01520000
               &RELEASE=,                                          @L8A-01530000
               &ENVIR=,                                            @M1A-01540000
               &RESOWN=,                                           @M1A-01550000
               &MGMTCLA=,                                          @M1A-01560000
               &STORCLA=,                                          @M2C-01570000
               &DDNAME=,                                       @YA12773-01580000
               &SECLABL=,                                          @M3C-01590000
               &ENTITYX=,                                          @M3A-01600000
               &MENTX=,                                            @M3A-01610000
               &NEWNAMX=                                           @M3A 01620000
.* DEFINE LOCAL SET SYMBOLS                                        @L7A 01630000
         LCLA  &BIT0,&BIT1,&BIT2,&BIT3,&BIT4,&BIT5,&CLNGTH     @PC002PY 01640000
         LCLA  &BIT6,&BIT7                                       @L4A   01650000
         LCLA  &BITA0,&BITA1,&BITA2                                @L5A 01660000
         LCLA  &BITA3,&BITA4,&BITA5,&BITA6,&BITA7                  @L6A 01670000
         LCLB  &UACC0,&UACC1,&UACC2,&UACC3,&UACC4,&UACC5         @L4A   01680000
         LCLB  &UACC6,&UACC7                                     @L4A   01690000
         LCLA  &UACCVAL                                          @L4A   01700000
         LCLB  &AUDIT0,&AUDIT1,&AUDIT2,&AUDIT3,&AUDIT4,&AUDIT5   @L4A   01710000
         LCLB  &AUDIT6,&AUDIT7                                   @L4A   01720000
         LCLA  &AUDITVL                                          @L4A   01730000
         LCLC  &AUDITRG,&AUD(2),&AUDQ(2)                           @L5A 01740000
         LCLA  &I,&J                                               @L5A 01750000
         LCLB  &MFFLAG                                                  01760000
         LCLC  &CHAR                                           @PC002PY 01770000
         LCLA  &BRPT                                               @L7A 01780000
         LCLA  &RLVL                                               @M3C 01790000
         LCLA  &RLVLSZ(10)                                         @M5C 01800000
         LCLA  &PARMLEN                                            @M3A 01810000
         LCLB  &RLVLCHK                                            @L7A 01820000
         LCLB  &COPENTY          1 => ENTITYX IS SPECIFIED         @M3A 01830000
         LCLB  &COPMENT          1 => MENTX IS SPECIFIED           @M3A 01840000
         LCLB  &COPNWNM          1 => NEWNAMX IS SPECIFIED         @M3A 01850000
         LCLC  &CMENTY1          COMMON ENTITY - FIRST OPERAND     @M3A 01860000
         LCLC  &CMENTY2          COMMON ENTITY - SECOND OPERAND    @M3A 01870000
         LCLC  &CMMENT           MENTITY OR MENTX AS SPECIFIED     @M3A 01880000
         LCLC  &CMNWNM           NEWNAME OR NEWNAMX AS SPECIFIED   @M3A 01890000
         LCLC  &LCTYPE           LOCAL VARIABLE FOR TYPE           @M3A 01900000
.*                                                                      01910000
.*       SET "TYPE" TO "DEFINE" FOR RELEASE 1.9, IF TYPE NOT       @M3A 01920000
.*       SPECIFIED WITH 'LIST' AND 'STANDARD' MACRO FORMAT.        @M3A 01930000
.*                                                                      01940000
&LCTYPE  SETC  '&TYPE'                                             @M3A 01950000
         AIF   ('&LCTYPE' NE '').NOCPTYP                           @M3A 01960000
         AIF   ('&MF' NE 'S' AND '&MF' NE 'L').NOCPTYP             @M3A 01970000
&LCTYPE  SETC  'DEFINE'                                            @M3A 01980000
.NOCPTYP ANOP                                                      @M3A 01990000
.*                                                                      02000000
.* DEFINE GLOBAL SET SYMBOLS                                       @T1A 02010000
.*                                                                      02020000
         GBLB  &ICHRAC             ICHRAC - A FLAG WHICH, WHEN     @T1A 02030000
.*                                 ON, INDICATES THAT THIS MACRO   @T1A 02040000
.*                                 IS BEING INVOKED INTERNALLY     @T1A 02050000
.*                                 BY THE RACROUTE MACRO.          @T1A 02060000
         GBLC  &ICHL               SETS ADDRESSABILITY TO THE      @T1A 02070000
.*                                 PARAMETER LIST FOR THE          @T1A 02080000
.*                                 RACROUTE MACRO.                 @T1A 02090000
         GBLC  &ICHRLVL             SYMBOL TO BRANCH TO            @L7A 02100000
.*                                  WHEN INCOMPATIBLE MACRO LEVEL. @L7A 02110000
         GBLB  &ICHCOM              ICHCOM - A flag which when on  @M3A 02120000
.*                                  indicates that the racheck is  @M3A 02130000
.*                                  invoked by command processors  @M3A 02140000
.*                                  It generates parameter list    @M3A 02150000
.*                                  with 31 bit addressing and     @M3A 02160000
.*                                  the SVC call.                  @M3A 02170000
.* INITIALIZE FOR, AND VALIDATE, RELEASE PARAMETER                 @L7A 02180000
&RLVLSZ(1) SETA 48                 R1.6 PARAMETER LIST SIZE        @L7A 02190000
&RLVLSZ(2) SETA 56                 R1.6 SIZE FOR RACROUTE CALL     @L7A 02200000
&RLVLSZ(3) SETA 104                R1.7 PARAMETER LIST SIZE        @L7A 02210000
&RLVLSZ(4) SETA 104                R1.8 PARAMETER LIST SIZE        @M3C 02220000
&RLVLSZ(5) SETA 104                R1.8.1 PARAMETER LIST SIZE      @M3C 02230000
&RLVLSZ(6) SETA 124                R1.8X PARAMETER SIZE            @M3C 02240000
&RLVLSZ(7) SETA 124                1.9 PARAMETER SIZE              @M3A 02250000
&RLVLSZ(8) SETA 124                1.9.2 PARAMETER LIST SIZE       @M5C 02260000
&RLVLSZ(9) SETA 124                2.1 PARAMETER LIST SIZE         @M5A 02270000
&RLVLSZ(10) SETA 124               2.2 PARAMETER LIST SIZE         @M6A 02280000
&RLVLSZ(11) SETA 124               2.3 PARAMETER LIST SIZE         @M7A 02290000
&RLVLSZ(12) SETA 124               2.4 PARAMETER LIST SIZE         @M8A 02300000
&RLVLSZ(13) SETA 124               2.6 PARAMETER LIST SIZE         @M9A 02310000
&RLVLSZ(14) SETA 124              2608 PARAMETER LIST SIZE         @MAA 02320000
&RLVLSZ(15) SETA 124              7703 PARAMETER LIST SIZE         @MBA 02330000
&RLVLSZ(16) SETA 124              7705 PARAMETER LIST SIZE         @MCA 02340000
&RLVLSZ(17) SETA 124              7706 PARAMETER LIST SIZE         @MDA 02350000
&RLVLSZ(18) SETA 124              7707 PARAMETER LIST SIZE         @MEA 02360000
&RLVLSZ(19) SETA 124              7708 PARAMETER LIST SIZE         @MFA 02370000
&RLVLSZ(20) SETA 124              7709 PARAMETER LIST SIZE         @MHA 02380000
&RLVLSZ(21) SETA 124              7720 PARAMETER LIST SIZE         @MIA 02390000
&RLVLSZ(22) SETA 124              7730 PARAMETER LIST SIZE         @MJA 02400000
&RLVLSZ(23) SETA 124              7740 PARAMETER LIST SIZE         @MKA 02410000
&RLVLSZ(24) SETA 124              7750 PARAMETER LIST SIZE         @MLA 02420000
&RLVLSZ(25) SETA 124              7760 PARAMETER LIST SIZE         @MMA 02430000
&RLVLSZ(26) SETA 124              7770 PARAMETER LIST SIZE         @MNA 02440000
&RLVLSZ(27) SETA 124              7780 PARAMETER LIST SIZE         @MOA 02450000
&RLVLSZ(28) SETA 124              7790 PARAMETER LIST SIZE         @MPA 02460000
&RLVLSZ(29) SETA 124              77A0 PARAMETER LIST SIZE         @MQA 02470000
&RLVLSZ(30) SETA 124              77B0 PARAMETER LIST SIZE         @MRA 02480000
.*                                                                 @MSA 02490001
&RLVLSZ(31) SETA 124               Set the Parameter List Size     @MSA 02500001
.*                                 for RELEASE=PLV0001             @MSA 02510001
.*                                 PLVnnnn indicates the           @MSA 02520001
.*                                 Parameter List Version          @MSA 02530001
.*                                                                 @MSA 02540001
.*                                                                 @M3A 02550000
.*  INITIALIZE LOCAL VARIABLE SYMBOLS                              @M3A 02560000
.*                                                                 @M3A 02570000
&COPENTY SETB  0                   ASSUME ENTITY IS SPECIFIED      @M3A 02580000
&COPNWNM SETB  0                   ASSUME MENTITY IS SPECIFIED     @M3A 02590000
&COPMENT SETB  0                   ASSUME NEWNAME IS SPECIFIED     @M3A 02600000
         AIF   (N'&ENTITY GT 1).COPTWO1  Is entity two operand?    @M3A 02610000
&CMENTY1 SETC  '&ENTITY'          Copy only operand to Cmenty1     @M3A 02620000
&CMENTY2 SETC  ''                 Set second operand to null.      @M3A 02630000
         AGO   .COMFLO1           Goto common flow.                @M3A 02640000
.COPTWO1 ANOP                                                      @M3A 02650000
&CMENTY1 SETC  '&ENTITY(1)'       Copy first operand of entity     @M3A 02660000
&CMENTY2 SETC  '&ENTITY(2)'       Copy second operand of entity    @M3A 02670000
.COMFLO1 ANOP                                                      @M3A 02680000
&CMMENT  SETC  '&MENTITY'         Copy model entity name           @M3A 02690000
&CMNWNM  SETC  '&NEWNAME'         Copy newname                     @M3A 02700000
.*                                                                 @M3A 02710000
         AIF   (&ICHRAC).RLVL01                                    @L7A 02720000
&ICHRLVL SETC  'ICH&SYSNDX.X'      CREATE LABEL FOR SVC BYPASS     @L7A 02730000
&RLVL    SETA  1                   SET R1.6 PARAMETER LIST         @L7A 02740000
         AGO   .RLVL05                                             @L7A 02750000
.RLVL01  ANOP                                                      @L7A 02760000
&RLVL    SETA  2                   SET SIZE FOR CALL BY RACROUTE   @L7A 02770000
.RLVL05  ANOP                                                      @L7A 02780000
         AIF   ('&RELEASE' EQ '').NORLVL                           @L7A 02790000
         AIF   (N'&RELEASE GT 2).ERLVL1 INVALID RELEASE PARAMETER  @L7A 02800000
         AIF   ('&RELEASE(1)' EQ '1.6').RLVL06                     @M2C 02810000
         AIF   ('&RELEASE(1)' EQ '1.7').RLVL06                     @M2C 02820000
         AIF   ('&RELEASE(1)' EQ '1.8').RLVL06                     @M2C 02830000
         AIF   ('&RELEASE(1)' EQ '1.8.1').RLVL06                   @M2C 02840000
         AIF   ('&RELEASE(1)' EQ '1.8X').RLVL06                @YA12773 02850000
         AIF   ('&RELEASE(1)' EQ '1.9').LNGNMCK                    @M3C 02860000
         AIF   ('&RELEASE(1)' EQ '1.9.2').LNGNMCK                  @M4A 02870000
         AIF   ('&RELEASE(1)' EQ '2.1').LNGNMCK                    @M5A 02880000
         AIF   ('&RELEASE(1)' EQ '2.2').LNGNMCK                    @M6A 02890000
         AIF   ('&RELEASE(1)' EQ '2.3').LNGNMCK                    @M7A 02900000
         AIF   ('&RELEASE(1)' EQ '2.4').LNGNMCK                    @M8A 02910000
         AIF   ('&RELEASE(1)' EQ '2.6').LNGNMCK                    @M9A 02920000
         AIF   ('&RELEASE(1)' EQ '2608').LNGNMCK                   @MAA 02930000
         AIF   ('&RELEASE(1)' EQ '7703').LNGNMCK                   @MBA 02940000
         AIF   ('&RELEASE(1)' EQ '7705').LNGNMCK                   @MCA 02950000
         AIF   ('&RELEASE(1)' EQ '7706').LNGNMCK                   @MDA 02960000
         AIF   ('&RELEASE(1)' EQ '7707').LNGNMCK                   @MEA 02970000
         AIF   ('&RELEASE(1)' EQ '7708').LNGNMCK                   @MFA 02980000
         AIF   ('&RELEASE(1)' EQ '7709').LNGNMCK                   @MHA 02990000
         AIF   ('&RELEASE(1)' EQ '7720').LNGNMCK                   @MIA 03000000
         AIF   ('&RELEASE(1)' EQ '7730').LNGNMCK                   @MJA 03010000
         AIF   ('&RELEASE(1)' EQ '7740').LNGNMCK                   @MKA 03020000
         AIF   ('&RELEASE(1)' EQ '7750').LNGNMCK                   @MLA 03030000
         AIF   ('&RELEASE(1)' EQ '7760').LNGNMCK                   @MMA 03040000
         AIF   ('&RELEASE(1)' EQ '7770').LNGNMCK                   @MNA 03050000
         AIF   ('&RELEASE(1)' EQ '7780').LNGNMCK                   @MOA 03060000
         AIF   ('&RELEASE(1)' EQ '7790').LNGNMCK                   @MPA 03070000
         AIF   ('&RELEASE(1)' EQ '77A0').LNGNMCK                   @MQA 03080000
         AIF   ('&RELEASE(1)' EQ '77B0').LNGNMCK                   @MRA 03090000
         AIF   ('&RELEASE(1)' EQ 'PLV0001').LNGNMCK                @MSA 03100008
         AGO   .ERLVL1                                             @M2A 03110000
.*                                                                 @M3A 03120000
.*  TEST THE FOLLOWING :                                           @M3A 03130000
.*    1. RACDEF IS INVOKED VIA RACROUTE FOR RELEASE 1.9.           @M3A 03140000
.*    2. THE FOLLOWING PAIRS OF KEYWORDS ARE NOT SPECIFIED         @M3A 03150000
.*       SIMULTANEOUSLY AS THEY ARE MUTUALLY EXCLUSIVE.            @M3A 03160000
.*       A. ENTITY AND ENTITYX.                                    @M3A 03170000
.*       B. MENTITY AND MENTX.                                     @M3A 03180000
.*       C. NEWNAME AND NEWNAMX.                                   @M3A 03190000
.*                                                                 @M3A 03200000
.LNGNMCK ANOP                                                      @M3A 03210000
         AIF   (&ICHCOM).ERTN34                                    @M3A 03220000
         AIF   (NOT &ICHRAC).ERR34   error if release=1.9 or later @M4C 03230000
.ERTN34  ANOP                        and not invoked via Racroute  @M4C 03240000
         AIF   ('&ENTITYX' NE '' AND '&ENTITY' NE '').ERR28   test @M3A 03250000
.ERTN28  ANOP                               for mutual exclusivity @M3A 03260000
         AIF   ('&ENTITYX' EQ '').CHKMENT    entityx not specified @M3A 03270000
&COPENTY SETB  1                             Set bit for entityx   @M3A 03280000
         AIF   (N'&ENTITYX GT 1).COPTWO2    branch not one operand @M3A 03290000
&CMENTY1 SETC  '&ENTITYX'                       Copy first operand @M3A 03300000
&CMENTY2 SETC  ''                      Set second operand to null  @M3A 03310000
         AGO   .COMFLO2                to common logic flow        @M3A 03320000
.COPTWO2 ANOP                                                      @M3A 03330000
&CMENTY1 SETC  '&ENTITYX(1)'          Copy first operand           @M3A 03340000
&CMENTY2 SETC  '&ENTITYX(2)'          copy second operand          @M3A 03350000
.COMFLO2 ANOP                        Common flow in logic          @M3A 03360000
.CHKMENT ANOP                                                      @M3A 03370000
         AIF   ('&MENTX' NE '' AND '&MENTITY' NE '').ERR29  test   @M3A 03380000
.ERTN29  ANOP                         mutual exclusivity           @M3A 03390000
         AIF   ('&MENTX' EQ '').CHKNWNM    skip-mentx not specfied @M3A 03400000
&COPMENT SETB  1                         Set indicator             @M3A 03410000
&CMMENT  SETC  '&MENTX'                  Copy model name           @M3A 03420000
.CHKNWNM ANOP                                                      @M3A 03430000
         AIF   ('&NEWNAMX' NE '' AND '&NEWNAME' NE '').ERR30  test @M3A 03440000
.ERTN30  ANOP                                 mutual exclusivity   @M3A 03450000
         AIF   ('&NEWNAMX' EQ '').RLVL06       skip-not specified  @M3A 03460000
&COPNWNM SETB  1                          Set newnamx indicator    @M3A 03470000
&CMNWNM  SETC  '&NEWNAMX'                 Copy new name            @M3A 03480000
.*                                                                 @M3A 03490000
.RLVL06  ANOP                                                      @M2A 03500000
         AIF   (N'&RELEASE EQ 1).NORLVLC CHECK NOT SPECIFIED       @L7A 03510000
         AIF   ('&RELEASE(2)' NE 'CHECK').ERLVL1 INVALID VALUE     @L7A 03520000
         AIF   ('&MF(1)' NE 'E').ERLVL2 CHECK ONLY WITH MF=E       @L7A 03530000
&RLVLCHK SETB  1                  INDICATE RELEASE-CHECK REQUESTED @L7A 03540000
.ERLVL2R ANOP                                                      @L7A 03550000
.NORLVLC ANOP                                                      @L7A 03560000
.CHECKVER ANOP                                                     @MSA 03570001
         AIF   ('&RELEASE(1)' NE 'PLV0001').CHECKFMID              @MSA 03580009
.PLVER0001 ANOP                                                    @MSA 03590001
&RLVL    SETA  31              Indicate Parameter List Version     @MSA 03600001
.*                             PLV0001 was specified on RELEASE=   @MSA 03610001
.CHECKFMID ANOP                                                    @MSA 03620001
         AIF   ('&RELEASE(1)' NE '77B0').RLVL77B0                  @MRA 03630000
&RLVL    SETA  30                  INDICATE RELEASE=77B0           @MRA 03640000
.RLVL77B0 ANOP                                                     @MRA 03650000
         AIF   ('&RELEASE(1)' NE '77A0').RLVL77A0                  @MQA 03660000
&RLVL    SETA  29                  INDICATE RELEASE=77A0           @MQA 03670000
.RLVL77A0 ANOP                                                     @MQA 03680000
         AIF   ('&RELEASE(1)' NE '7790').RLVL7790                  @MPA 03690000
&RLVL    SETA  28                  INDICATE RELEASE=7790           @MPA 03700000
.RLVL7790 ANOP                                                     @MPA 03710000
         AIF   ('&RELEASE(1)' NE '7780').RLVL7780                  @MOA 03720000
&RLVL    SETA  27                  INDICATE RELEASE=7780           @MOA 03730000
.RLVL7780 ANOP                                                     @MOA 03740000
         AIF   ('&RELEASE(1)' NE '7770').RLVL7770                  @MNA 03750000
&RLVL    SETA  26                  INDICATE RELEASE=7770           @MNA 03760000
.RLVL7770 ANOP                                                     @MNA 03770000
         AIF   ('&RELEASE(1)' NE '7760').RLVL7760                  @MMA 03780000
&RLVL    SETA  25                  INDICATE RELEASE=7760           @MMA 03790000
.RLVL7760 ANOP                                                     @MMA 03800000
         AIF   ('&RELEASE(1)' NE '7750').RLVL7750                  @MLA 03810000
&RLVL    SETA  24                  INDICATE RELEASE=7750           @MLA 03820000
.RLVL7750 ANOP                                                     @MLA 03830000
         AIF   ('&RELEASE(1)' NE '7740').RLVL7740                  @MKA 03840000
&RLVL    SETA  23                  INDICATE RELEASE=7740           @MKA 03850000
.RLVL7740 ANOP                                                     @MKA 03860000
         AIF   ('&RELEASE(1)' NE '7730').RLVL7730                  @MJA 03870000
&RLVL    SETA  22                  INDICATE RELEASE=7730           @MJA 03880000
.RLVL7730 ANOP                                                     @MJA 03890000
         AIF   ('&RELEASE(1)' NE '7720').RLVL7720                  @MIA 03900000
&RLVL    SETA  21                  INDICATE RELEASE=7720           @MIA 03910000
.RLVL7720 ANOP                                                     @MIA 03920000
         AIF   ('&RELEASE(1)' NE '7709').RLVL7709                  @MHA 03930000
&RLVL    SETA  20                  INDICATE RELEASE=7709           @MHA 03940000
.RLVL7709 ANOP                                                     @MHA 03950000
         AIF   ('&RELEASE(1)' NE '7708').RLVL7708                  @MFA 03960000
&RLVL    SETA  19                  INDICATE RELEASE=7708           @MFA 03970000
.RLVL7708 ANOP                                                     @MFA 03980000
         AIF   ('&RELEASE(1)' NE '7707').RLVL7707                  @MEA 03990000
&RLVL    SETA  18                  INDICATE RELEASE=7707           @MEA 04000000
.RLVL7707 ANOP                                                     @MEA 04010000
         AIF   ('&RELEASE(1)' NE '7706').RLVL7706                  @MDA 04020000
&RLVL    SETA  17                  INDICATE RELEASE=7706           @MDA 04030000
.RLVL7706 ANOP                                                     @MDA 04040000
         AIF   ('&RELEASE(1)' NE '7705').RLVL7705                  @MCA 04050000
&RLVL    SETA  16                  INDICATE RELEASE=7705           @MCA 04060000
.RLVL7705 ANOP                                                     @MCA 04070000
         AIF   ('&RELEASE(1)' NE '7703').RLVL7703                  @MBA 04080000
&RLVL    SETA  15                  INDICATE RELEASE=7703           @MBA 04090000
.RLVL7703 ANOP                                                     @MBA 04100000
         AIF   ('&RELEASE(1)' NE '2608').RLVL260                   @MAA 04110000
&RLVL    SETA  14                  INDICATE RELEASE=2608           @MAA 04120000
.RLVL260 ANOP                                                      @MAA 04130000
         AIF   ('&RELEASE(1)' NE '2.6').RLVL240                    @M9A 04140000
&RLVL    SETA  13                  INDICATE RELEASE=2.6            @M9A 04150000
.RLVL240 ANOP                                                      @M9A 04160000
         AIF   ('&RELEASE(1)' NE '2.4').RLVL230                    @M8A 04170000
&RLVL    SETA  12                  INDICATE RELEASE=2.4            @M8A 04180000
.RLVL230 ANOP                                                      @M8A 04190000
         AIF   ('&RELEASE(1)' NE '2.3').RLVL220                    @M7A 04200000
&RLVL    SETA  11                  INDICATE RELEASE=2.3            @M7A 04210000
.RLVL220 ANOP                                                      @M7A 04220000
         AIF   ('&RELEASE(1)' NE '2.2').RLVL210                    @M6A 04230000
&RLVL    SETA  10                  INDICATE RELEASE=2.2            @M6A 04240000
.RLVL210 ANOP                                                      @M6A 04250000
         AIF   ('&RELEASE(1)' NE '2.1').RLVL192                    @M5A 04260000
&RLVL    SETA  9                   INDICATE RELEASE=2.1            @M5A 04270000
.RLVL192 ANOP                                                      @M5A 04280000
         AIF   ('&RELEASE(1)' NE '1.9.2').RLVL190                  @M4A 04290000
&RLVL    SETA  8                   INDICATE RELEASE=1.9.2          @M4A 04300000
.RLVL190 ANOP                                                      @M4A 04310000
         AIF   ('&RELEASE(1)' NE '1.9').RLVL18X                    @M2A 04320000
&RLVL    SETA  7                   INDICATE RELEASE=1.9            @M2A 04330000
.RLVL18X ANOP                                                      @M2A 04340000
         AIF   ('&RELEASE(1)' NE '1.8X').RLVL18A               @YA12773 04350000
&RLVL    SETA  6                   INDICATE RELEASE=1.8X       @YA12773 04360000
.RLVL18A ANOP                                                  @YA12773 04370000
         AIF   ('&RELEASE(1)' NE '1.8.1').RLVL18B                  @M3C 04380000
&RLVL    SETA  5                   INDICATE RELEASE= 1.8.1         @M3A 04390000
.RLVL18B ANOP                                                      @M3A 04400000
         AIF   ('&RELEASE(1)' NE '1.8').RLVL18                     @M3C 04410000
&RLVL    SETA  4                   INDICATE RELEASE=1.8            @M1A 04420000
.RLVL18  ANOP                                                      @L8A 04430000
         AIF   ('&RELEASE(1)' NE '1.7').RLVL17                     @L7A 04440000
&RLVL    SETA  3                   INDICATE RELEASE=1.7            @L7A 04450000
.RLVL17  ANOP                                                      @L7A 04460000
.NORLVL  ANOP                                                      @L7A 04470000
.ERLVL1R ANOP                                                      @L7A 04480000
.*                                                                 @L7A 04490000
.* PERFORM PARAMETER DIAGNOSIS                                          04500000
.*                                                                 @L7A 04510000
.* CHECK SPECIFIED PARAMETERS AGAINST RACF LEVEL                   @L7A 04520000
         AIF   (&RLVL GE 7).RLVL20 1.9 PARAMETERS VALID            @M2A 04530000
         AIF   ('&ENTITYX' NE '').ERR31  no entityx with           @M3A 04540000
.ERTN31  ANOP                            down level release        @M3A 04550000
         AIF   ('&MENTX' NE '').ERR32    no mentx with             @M3A 04560000
.ERTN32  ANOP                            down level release        @M3A 04570000
         AIF   ('&NEWNAMX' NE '').ERR33  no newnamx with           @M3A 04580000
.ERTN33  ANOP                            down level release        @M3A 04590000
         AIF   ('&SECLABL' NE '').ERLVLC not with downlevel        @M2A 04600000
.*                                       release.                  @M2A 04610000
         AGO   .RLVL19A                                            @M2A 04620000
.ERLVLCR ANOP                                                      @M2A 04630000
&RLVL    SETA  7              1.9 PARAMETERS USED, SO ASSUME       @M2A 04640000
.*                            RELEASE 1.9 EXPANSION AFTER ERROR    @M2A 04650000
         AGO   .RLVL20                                             @M2A 04660000
.RLVL19A ANOP                                                      @M2A 04670000
         AIF   (&RLVL GE 6).RLVL20 1.8X PARAMETERS VALID           @M3A 04680000
         AIF   ('&DDNAME' NE '').ERLVLD                            @M3C 04690000
         AGO   .RLV18XA                                            @M3A 04700000
.ERLVLDR ANOP                                                      @M3A 04710000
&RLVL    SETA  6              1.8X PARAMETERS USED, SO ASSUME      @M2A 04720000
.*                            RELEASE 1.8X EXPANSION AFTER ERROR   @M2A 04730000
         AGO   .RLVL20                                             @M3A 04740000
.RLV18XA ANOP                                                      @M3A 04750000
         AIF   (&RLVL GE 5).RLVL20 1.8.1 PARAMETERS VALID          @M3A 04760000
         AIF   ('&ENVIR&RESOWN&MGMTCLA&STORCLA' NE '').ERLVLE      @M3A 04770000
         AGO   .RLV181A                                            @M3A 04780000
.ERLVLER ANOP                                                      @M3A 04790000
&RLVL    SETA  5              1.8.1 PARAMETERS USED, SO ASSUME RELEASE X04800000
                              1.8.1 EXPANSION AFTER ERROR          @M3A 04810000
         AGO   .RLVL20                                             @M3A 04820000
.RLV181A ANOP                                                      @M3A 04830000
         AIF   (&RLVL GE 4).RLVL20 1.8 PARAMETERS VALID            @L8A 04840000
         AIF   ('&EXPDTX' NE '').ERLVLB                            @M3C 04850000
         AGO   .RLVL19                                             @L8A 04860000
.ERLVLBR ANOP                                                      @L8A 04870000
&RLVL    SETA  4              1.8 PARAMETERS USED, SO ASSUME           X04880000
                              RELEASE 1.8 EXPANSION AFTER ERROR    @L8A 04890000
         AGO   .RLVL20                                             @L8A 04900000
.RLVL19  ANOP                                                      @L8A 04910000
         AIF   (&RLVL GE 3).RLVL20 1.7 PARAMETERS VALID            @L7A 04920000
         AIF   ('&CATGORY&FILESEQ&EXPDT&RETPD&ACCLVL&TAPELBL&ERASE&SECLX04930000
               VL&MCLASS&MGENER&NOTIFY' NE '').ERLVLA              @L7A 04940000
         AIF   ('&DSTYPE' EQ 'T').ERLVLA                           @L7A 04950000
         AGO   .RLVL20                                             @L7A 04960000
.ERLVLAR ANOP                                                      @L7A 04970000
&RLVL    SETA  3                   1.7 PARAMETERS USED, SO ASSUME      X04980000
                                   RELEASE 1.7 EXPANSION           @L7A 04990000
.RLVL20  ANOP                                                      @L7A 05000000
&PARMLEN SETA  &RLVLSZ(&RLVL)       LEN OF RACDEF  PARMETER LIST   @L7A 05010000
.*                                                                 @L7A 05020000
         AIF   (&RLVL LT 7).ERTN35        1.9 checks are needed.   @P3A 05030000
         AIF   ('&MF' EQ 'S' AND '&CMENTY1' EQ '').ERR35           @P3A 05040000
.ERTN35  ANOP                                                      @P3A 05050000
.*                                                                 @L7A 05060000
.*                                                                 @L7A 05070000
.* VALIDATE DSTYPE PARAMETER                                            05080000
         AIF   ('&DSTYPE' NE 'N' AND '&DSTYPE' NE 'V' AND '&DSTYPE' NE -05090000
               '' AND '&DSTYPE' NE 'M'                                 -05100000
               AND '&DSTYPE' NE 'T').ERR01                         @L7A 05110000
.ERTN01  ANOP                                                           05120000
.* VALIDATE MGENER PARAMETER                                       @L7A 05130000
         AIF   ('&MGENER' EQ '').ERTN01B                           @L7A 05140000
         AIF   ('&MGENER' NE 'ASIS' AND '&MGENER' NE 'YES').ERR01B @L7A 05150000
.ERTN01B ANOP  ,                                                   @L7A 05160000
.* VALIDATE SPECIAL PARAMETER.                                   @L4A   05170000
         AIF   ('&SPECIAL' NE 'NO' AND '&SPECIAL' NE 'YES' AND         -05180000
               '&SPECIAL' NE '').ERR13                           @L4A   05190000
.ERTN13  ANOP  ,                                                 @L4A   05200000
.* VALIDATE RACFIND PARAMETER                                      @L5A 05210000
         AIF   ('&RACFIND' NE 'YES' AND '&RACFIND' NE 'NO' AND         *05220000
               '&RACFIND' NE '').ERR14                             @L5A 05230000
.ERTN14  ANOP                                                      @L5A 05240000
.* VALIDATE CHKAUTH PARAMETER                                      @L5A 05250000
         AIF   ('&CHKAUTH' NE 'YES' AND '&CHKAUTH' NE 'NO' AND         *05260000
               '&CHKAUTH' NE '').ERR15                             @L5A 05270000
.ERTN15  ANOP                                                      @L5A 05280000
.* VALIDATE WARNING PARAMETER                                           05290000
         AIF   ('&WARNING' EQ '').ERTN16                           @L6A 05300000
         AIF   ('&WARNING' NE 'YES' AND '&WARNING' NE 'NO').ERR16  @L6A 05310000
.ERTN16  ANOP  ,                                                   @L6A 05320000
.* VALIDATE GENERIC PARAMETER                                           05330000
         AIF   ('&GENERIC' EQ '').ERTN17                           @L6A 05340000
         AIF   ('&GENERIC' NE 'ASIS' AND                               -05350000
               '&GENERIC' NE 'YES').ERR17                          @L6A 05360000
.ERTN17  ANOP  ,                                                   @L6A 05370000
.* VALIDATE TYPE PARAMETER                                              05380000
         AIF   ('&LCTYPE' EQ '').RDEF004                           @M3C 05390000
         AIF   ('&LCTYPE' NE 'DEFINE' AND '&LCTYPE' NE 'DELETE' AND    -05400000
               '&LCTYPE' NE 'CHGVOL' AND '&LCTYPE' NE 'ADDVOL').ERR02   05410000
.*                                                                 @M3C 05420000
         AIF   ('&LCTYPE' EQ 'DEFINE' AND                              *05430000
               '&CMNWNM' EQ '').RDEF005                            @M3C 05440000
         AIF   ('&CMNWNM' NE '' AND '&DSTYPE' EQ 'T').ERR020       @M3C 05450000
         AIF   ('&LCTYPE' EQ 'CHGVOL' AND '&DSTYPE' EQ 'T').ERR021 @M3C 05460000
         AIF   (&COPMENT).SKIP000                                  @M3A 05470000
&CHAR    SETC  'MENTITY'                                       @PC002PY 05480000
         AIF   ('&MENTITY' NE '').ERR07                        @PC002PY 05490000
         AGO   .SKIP001                                            @M3A 05500000
.SKIP000 ANOP                                                      @M3A 05510000
&CHAR    SETC  'MENTX'                                             @M3A 05520000
         AIF   ('&MENTX' NE '').ERR07                              @M3A 05530000
.SKIP001 ANOP                                                      @M3A 05540000
&CHAR    SETC  'MVOLSER'                                       @PC002PY 05550000
         AIF   ('&MVOLSER' NE '').ERR07                        @PC002PY 05560000
&CHAR    SETC  'WARNING'                                           @L6A 05570000
         AIF   ('&WARNING' NE '').ERR07                            @L6A 05580000
&CHAR    SETC  'MGENER'                                            @L7A 05590000
         AIF   ('&MGENER'  NE '').ERR07                            @L7A 05600000
&CHAR    SETC  'MCLASS'                                            @L7A 05610000
         AIF   ('&MCLASS'  NE '').ERR07                            @L7A 05620000
.RDEF005 ANOP                                                      @L7A 05630000
.RDEF004 ANOP  ,                                                   @01M 05640000
.ERTN02  ANOP                                                           05650000
.ERTN07  ANOP                                                  @PC002PY 05660000
.ERTN020 ANOP                                                      @L7A 05670000
.ERTN021 ANOP                                                      @L7A 05680000
.* VALIDATE EXPDT AND RETPD AND  EXPDTX PARAMETERS                 @L8A 05690000
         AIF   ('&EXPDT' NE '' AND '&RETPD' NE '').ERR22           @L7A 05700000
.ERTN22  ANOP                                                      @L7A 05710000
         AIF   ('&EXPDT' NE '' AND '&EXPDTX' NE '').ERR22A         @L8A 05720000
.ERTN22A ANOP                                                      @L8A 05730000
         AIF   ('&RETPD' NE '' AND '&EXPDTX' NE '').ERR22B         @L8A 05740000
.*                                                                 @L8A 05750000
.ERTN22B ANOP                                                      @L8A 05760000
.* VERIFY AND DECODE AUDIT                                         @L5A 05770000
         AIF   ('&AUDIT' EQ '').RDEFA99                            @L5A 05780000
         AIF   (N'&AUDIT GT 2).ERR10                               @L5A 05790000
         AIF   (N'&AUDIT NE 1 OR K'&AUDIT LT 5).RDEFA08            @L5A 05800000
         AIF   ('&AUDIT'(1,2) NE '((').RDEFA08                     @L5A 05810000
&AUDITRG SETC  '&AUDIT'(3,K'&AUDIT-4)  EXTRACT REGISTER "NAME"         X05820000
                (NOTE - V1R4 REGISTER NOTATION HANDLED AT .ERR10)  @L5A 05830000
         AGO   .RDEFA99                                            @L5A 05840000
.RDEFA08 ANOP                                                      @L5A 05850000
         AIF   ('&AUDIT' NE 'NONE').RDEFA10                        @L5A 05860000
&AUDIT3  SETB  1                   AUDIT=NONE                      @L5A 05870000
         AGO   .RDEFA90                                            @L5A 05880000
.RDEFA10 ANOP                                                      @L5A 05890000
&AUD(1)  SETC  '&AUDIT(1)'                                         @L5A 05900000
&AUDQ(1) SETC  'READ'              DEFAULT QUALIFIER               @L5A 05910000
&AUD(2)  SETC  '&AUDIT(2)'                                         @L5A 05920000
&AUDQ(2) SETC  'READ'              DEFAULT QUALIFIER               @L5A 05930000
&I       SETA  1                                                   @L5A 05940000
.RDEFA30 ANOP                                                      @L5A 05950000
&J       SETA  K'&AUD(&I)                                          @L5A 05960000
         AIF   ('&AUD(&I)'(&J,1) NE ')').RDEFA34                   @L5A 05970000
.RDEFA32 ANOP                                                      @L5A 05980000
&J       SETA  &J-1                                                @L5A 05990000
         AIF   (&J GE 2 AND '&AUD(&I)'(&J,1) NE '(').RDEFA32       @L5A 06000000
&AUDQ(&I) SETC '&AUD(&I)'(&J+1,K'&AUD(&I)-&J-1)                    @L5A 06010000
&AUD(&I) SETC  '&AUD(&I)'(1,&J-1)                                  @L5A 06020000
.RDEFA34 ANOP                                                      @L5A 06030000
         AIF   ('&AUD(&I)' NE 'ALL' AND '&AUD(&I)' NE 'SUCCESS' AND    X06040000
               '&AUD(&I)' NE 'FAILURES').ERR10                     @L5A 06050000
         AIF   ('&AUDQ(&I)' NE 'READ' AND '&AUDQ(&I)' NE 'UPDATE' AND  X06060000
               '&AUDQ(&I)' NE 'CONTROL' AND                            X06070000
               '&AUDQ(&I)' NE 'ALTER').ERR10                       @L5A 06080000
         AIF   ('&AUDQ(&I)' NE 'READ').RDEFA36                     @L5A 06090000
&AUDQ(&I) SETC 'XEAD'              CHANGE FOR PROPER SORT ORDER    @L5A 06100000
.RDEFA36 ANOP                                                      @L5A 06110000
&I       SETA  &I+1                                                @L5A 06120000
         AIF   (&I LE N'&AUDIT).RDEFA30                            @L5A 06130000
.* RESOLVE AUDIT CONFLICTS                                         @L5A 06140000
         AIF   (N'&AUDIT LT 2).RDEFA50                             @L5A 06150000
         AIF   ('&AUD(1)' NE 'ALL' OR                                  X06160000
               '&AUDQ(1)'(1,1) LE '&AUDQ(2)'(1,1)).RDEFA41         @L5A 06170000
&AUDQ(2) SETC  '&AUDQ(1)'                                          @L5A 06180000
.RDEFA41 ANOP                                                      @L5A 06190000
         AIF   ('&AUD(2)' NE 'ALL' OR                                  X06200000
               '&AUDQ(2)'(1,1) LE '&AUDQ(1)'(1,1)).RDEFA43         @L5A 06210000
&AUDQ(1) SETC  '&AUDQ(2)'                                          @L5A 06220000
.RDEFA43 ANOP                                                      @L5A 06230000
         AIF   ('&AUD(1)' EQ '&AUD(2)').RDEFA47                    @L5A 06240000
         AIF   ('&AUD(1)' NE 'ALL').RDEFA46                        @L5A 06250000
&AUD(1)  SETC  'SUCCESS'                                           @L5A 06260000
         AIF   ('&AUD(2)' EQ 'FAILURES').RDEFA46                   @L5A 06270000
&AUD(1)  SETC  'FAILURES'                                          @L5A 06280000
.RDEFA46 ANOP                                                      @L5A 06290000
         AIF   ('&AUD(2)' NE 'ALL').RDEFA47                        @L5A 06300000
&AUD(2)  SETC  'SUCCESS'                                           @L5A 06310000
         AIF   ('&AUD(1)' EQ 'FAILURES').RDEFA47                   @L5A 06320000
&AUD(2)  SETC  'FAILURES'                                          @L5A 06330000
.RDEFA47 ANOP                                                      @L5A 06340000
.RDEFA50 ANOP                      ENCODE AUDIT VALUE              @L5A 06350000
&I       SETA  1                   RESET COUNTER                   @L5A 06360000
.RDEFA51 ANOP                                                      @L5A 06370000
&AUDIT0  SETB  (&AUDIT0 OR '&AUD(&I)' EQ 'ALL')                    @L5A 06380000
&AUDIT1  SETB  (&AUDIT1 OR '&AUD(&I)' EQ 'SUCCESS')                @L5A 06390000
&AUDIT2  SETB  (&AUDIT2 OR '&AUD(&I)' EQ 'FAILURES')               @L5A 06400000
         AIF   ('&AUD(&I)' NE 'ALL' AND                                X06410000
               '&AUD(&I)' NE 'SUCCESS').RDEFA53                    @L5A 06420000
&AUDIT4  SETB  (&AUDIT4 OR '&AUDQ(&I)' EQ 'CONTROL' OR                 X06430000
               '&AUDQ(&I)' EQ 'ALTER')                             @L5A 06440000
&AUDIT5  SETB  (&AUDIT5 OR '&AUDQ(&I)' EQ 'UPDATE' OR                  X06450000
               '&AUDQ(&I)' EQ 'ALTER')                             @L5A 06460000
.RDEFA53 ANOP                                                      @L5A 06470000
         AIF   ('&AUD(&I)' NE 'ALL' AND                                X06480000
               '&AUD(&I)' NE 'FAILURES').RDEFA56                   @L5A 06490000
&AUDIT6  SETB  (&AUDIT6 OR '&AUDQ(&I)' EQ 'CONTROL' OR                 X06500000
               '&AUDQ(&I)' EQ 'ALTER')                             @L5A 06510000
&AUDIT7  SETB  (&AUDIT7 OR '&AUDQ(&I)' EQ 'UPDATE' OR                  X06520000
               '&AUDQ(&I)' EQ 'ALTER')                             @L5A 06530000
.RDEFA56 ANOP                                                      @L5A 06540000
&I       SETA  &I+1                                                @L5A 06550000
         AIF   (&I LE N'&AUDIT).RDEFA51                            @L5A 06560000
         AIF   (&AUDIT1+&AUDIT2 LT 2 AND NOT &AUDIT0).RDEFA59      @L5A 06570000
&AUDIT0  SETB  1                   FORCE                           @L5A 06580000
&AUDIT1  SETB  0                     AUDIT=ALL                     @L5A 06590000
&AUDIT2  SETB  0                                                   @L5A 06600000
.RDEFA59 ANOP                                                      @L5A 06610000
.RDEFA90 ANOP                                                      @L5A 06620000
&AUDITVL SETA  128*&AUDIT0+64*&AUDIT1+32*&AUDIT2+16*&AUDIT3+8*&AUDIT4+4X06630000
               *&AUDIT5+2*&AUDIT6+&AUDIT7                          @L5A 06640000
.RDEFA99 ANOP                                                      @L5A 06650000
.ERTN10  ANOP                                                      @L5A 06660000
.* VALIDATE TAPELBL PARAMETER                                      @L7A 06670000
         AIF   ('&TAPELBL' NE 'STD' AND '&TAPELBL' NE 'NL' AND         -06680000
                '&TAPELBL' NE 'BLP' AND '&TAPELBL' NE '').ERR18    @L7A 06690000
.ERTN18  ANOP                                                      @L7A 06700000
.* VALIDATE ERASE PARAMETER                                        @L7A 06710000
         AIF   ('&ERASE' NE 'YES' AND '&ERASE' NE 'NO'                 -06720000
               AND '&ERASE' NE '').ERR19                           @L7A 06730000
.ERTN19  ANOP                                                      @L7A 06740000
.* VALIDATE ENVIR PARAMETER                                        @M1A 06750000
         AIF   ('&ENVIR' NE '' AND '&ENVIR' NE 'VERIFY').ERR25     @M1A 06760000
.ERTN25  ANOP                                                      @M1A 06770000
.* FOR S FORM, VALIDATE COMBINATIONS                               @M1A 06780000
         AIF   ('&MF' NE 'S').REGCHK                              2@P4D 06790000
.* STORCLA/MGMTCLA REQUIRES RESOWN                                 @M1A 06800000
         AIF   ('&STORCLA&MGMTCLA' NE '' AND                           X06810000
               '&RESOWN' EQ '').ERR27                              @M1A 06820000
.ERTN27  ANOP                                                      @M1A 06830000
.REGCHK  ANOP                                                      @M1A 06840000
.* REGISTER FORMS OF ADDRESS PARAMETERS NOT VALID WITH LIST FORM        06850000
         AIF   ('&MF' NE 'L').ERTN03                               @L7A 06860000
         AIF   ('&CMENTY1' EQ '').RDEF010                          @M3C 06870000
         AIF   ('&CMENTY1'(1,1) EQ '(').ERR03                      @M3C 06880000
.RDEF010 ANOP                                                           06890000
         AIF   ('&VOLSER' EQ '').RDEF020                                06900000
         AIF   ('&VOLSER'(1,1) EQ '(').ERR03                            06910000
.RDEF020 ANOP                                                           06920000
         AIF   ('&OLDVOL' EQ '').RDEF040                                06930000
         AIF   ('&OLDVOL'(1,1) EQ '(').ERR03                            06940000
.RDEF040 ANOP                                                           06950000
         AIF   ('&CMNWNM' EQ '').RDEF050                           @M3C 06960000
         AIF   ('&CMNWNM'(1,1) EQ '(').ERR03                       @M3C 06970000
.RDEF050 ANOP                                                           06980000
         AIF   ('&INSTLN' NE '' AND '&INSTLN(1)' NE '&INSTLN').ERR03    06990000
         AIF   ('&CLASS' EQ '').RDEF052                        @PC002PY 07000000
         AIF   ('&CLASS'(1,1) EQ '(').ERR03                    @PC002PY 07010000
.RDEF052 ANOP                                                  @PC002PY 07020000
         AIF   ('&CMMENT' EQ '').RDEF053                           @M3C 07030000
         AIF   ('&CMMENT'(1,1) EQ '(').ERR03                       @M3C 07040000
.RDEF053 ANOP                                                  @PC002PY 07050000
         AIF   ('&MVOLSER' EQ '').RDEF054                      @PC002PY 07060000
         AIF   ('&MVOLSER'(1,1) EQ '(').ERR03                  @PC002PY 07070000
.RDEF054 ANOP                                                  @PC002PY 07080000
         AIF   ('&ACEE' EQ '').RDEF055                         @PC----  07090000
         AIF   ('&ACEE'(1,1) EQ '(').ERR03                     @PC003PY 07100000
.RDEF055 ANOP                                                  @PC003PY 07110000
         AIF   ('&UNIT' EQ '').RDEF056                             @L4A 07120000
         AIF   ('&UNIT'(1,1) EQ '(').ERR03                         @L4A 07130000
.RDEF056 ANOP  ,                                                   @L4A 07140000
         AIF   ('&UACC' EQ '').RDEF057                             @L4A 07150000
         AIF   ('&UACC'(1,1) EQ '(').ERR03                         @L4A 07160000
         AIF   ('&UACC' EQ 'ALTER').RDEF057                        @L4A 07170000
         AIF   ('&UACC' EQ 'CONTROL').RDEF057                      @L4A 07180000
         AIF   ('&UACC' EQ 'UPDATE').RDEF057                       @L4A 07190000
         AIF   ('&UACC' EQ 'READ').RDEF057                         @L4A 07200000
         AIF   ('&UACC' EQ 'EXECUTE').RDEF057                      @M1A 07210000
         AIF   ('&UACC' EQ 'NONE').RDEF057                         @L4A 07220000
         AGO   .ERR09                                              @L4A 07230000
.ERTN09  ANOP  ,                                                   @L4A 07240000
.RDEF057 ANOP  ,                                                   @L4A 07250000
         AIF   ('&OWNER' EQ '').RDEF058                            @L4A 07260000
         AIF   ('&OWNER'(1,1) EQ '(').ERR03                        @L4A 07270000
.RDEF058 ANOP  ,                                                   @L4A 07280000
         AIF   ('&LEVEL' EQ '').RDEF059                            @L4A 07290000
         AIF   ('&LEVEL'(1,1) EQ '(').ERR03                        @L4A 07300000
         AIF   (K'&LEVEL GT 2).ERR11                               @L4A 07310000
.ERTN11  ANOP  ,                                                   @L4A 07320000
.RDEF059 ANOP  ,                                                   @L4A 07330000
         AIF   ('&AUDITRG' NE '').ERR03                            @L5A 07340000
         AIF   ('&DATA' EQ '').RDEF05B                             @L4A 07350000
         AIF   ('&DATA'(1,1) EQ '(').ERR03                         @L4A 07360000
.RDEF05B ANOP  ,                                                   @L4A 07370000
         AIF   ('&FILESEQ' EQ '').RDEF05C                          @L7A 07380000
         AIF   ('&FILESEQ'(1,1) EQ '(').ERR03                      @L7A 07390000
.RDEF05C ANOP                                                      @L7A 07400000
         AIF   ('&EXPDT' EQ '').RDEF05D                            @L7A 07410000
         AIF   ('&EXPDT'(1,1) EQ '(').ERR03                        @L7A 07420000
.RDEF05D ANOP                                                      @L7A 07430000
         AIF   ('&RETPD' EQ '').RDEF05E                            @L7A 07440000
         AIF   ('&RETPD'(1,1) EQ '(').ERR03                        @L7A 07450000
.RDEF05E ANOP                                                      @L7A 07460000
         AIF   ('&ACCLVL' EQ '').RDEF05G                           @L7A 07470000
         AIF   (T'&ACCLVL(1) EQ 'O').RDEF05F                       @L7A 07480000
         AIF   ('&ACCLVL(1)'(1,1) EQ '(').ERR03                    @L7A 07490000
.RDEF05F ANOP                                                      @L7A 07500000
         AIF   (N'&ACCLVL EQ 1).RDEF05G                            @L7A 07510000
         AIF   ('&ACCLVL(2)'(1,1) EQ '(').ERR03                    @L7A 07520000
.RDEF05G ANOP                                                      @L7A 07530000
         AIF   ('&MCLASS' EQ '').RDEF05H                           @L7A 07540000
         AIF   ('&MCLASS'(1,1) EQ '(').ERR03                       @L7A 07550000
.RDEF05H ANOP                                                      @L7A 07560000
         AIF   ('&NOTIFY' EQ '').RDEF05I                           @L7A 07570000
         AIF   ('&NOTIFY'(1,1) EQ '(').ERR03                       @L7A 07580000
.RDEF05I ANOP                                                      @L7A 07590000
         AIF   ('&RESOWN' EQ '').RDEF05J                           @M1A 07600000
         AIF   ('&RESOWN'(1,1) EQ '(').ERR03                       @M1A 07610000
.RDEF05J ANOP                                                      @M1A 07620000
         AIF   ('&MGMTCLA' EQ '').RDEF05K                          @M1A 07630000
         AIF   ('&MGMTCLA'(1,1) EQ '(').ERR03                      @M1A 07640000
.RDEF05K ANOP                                                      @M1A 07650000
         AIF   ('&STORCLA' EQ '').RDEF05L                          @M1A 07660000
         AIF   ('&STORCLA'(1,1) EQ '(').ERR03                      @M1A 07670000
.RDEF05L ANOP                                                      @L8A 07680000
         AIF   ('&EXPDTX' EQ '').RDEF05P                           @L8A 07690000
         AIF   ('&EXPDTX'(1,1) EQ '(').ERR03                       @L8A 07700000
.RDEF05P ANOP                                                  @YA12773 07710000
         AIF   ('&DDNAME' EQ '').RDEF05M                       @YA12773 07720000
         AIF   ('&DDNAME'(1,1) EQ '(').ERR03                   @YA12773 07730000
.RDEF05M ANOP                                                      @M1A 07740000
         AIF   ('&SECLABL' EQ '').RDEF05N                          @M2A 07750000
         AIF   ('&SECLABL'(1,1) EQ '(').ERR03                      @M2A 07760000
.RDEF05N ANOP                                                      @M2A 07770000
.ERTN03  ANOP                                                           07780000
.ERTN05  ANOP                                                           07790000
.* PRODUCE LIST FORM IF REQUESTED                                       07800000
         AIF   ('&MF' NE 'L').RDEF269                                   07810000
.* PRODUCE FIRST FLAGS BYTE FROM TYPE,OLDVOL,NEWNAME,&DSTYPE PARMS      07820000
&SYMBOL  DS    0F                                                       07830000
.RDEF110 ANOP                                                           07840000
ICH0&SYSNDX EQU *                                                       07850000
.* PRODUCE LENGTH                                                       07860000
.**************************************************************    @T1A 07870000
.* IF THIS MACRO WAS INVOKED BY THE RACROUTE MACRO, THE 3 BYTES    @T1A 07880000
.* AFTER LENGTH ARE RESERVED, AND INSTLN IS GENERATED AT THE       @T1A 07890000
.* END OF THE LIST.                                                @T1A 07900000
.**************************************************************    @T1A 07910000
         AIF   (NOT &ICHRAC AND NOT &ICHCOM).RDEF111               @M3C 07920000
&ICHL    DC    AL1(&PARMLEN)  LENGTH OF PARAMETER LIST             @L7A 07930000
         DC    AL3(0)                                              @T1A 07940000
         AGO   .RDEF114                                            @T1A 07950000
.RDEF111 ANOP                                                      @T1A 07960000
         DC    AL1(&PARMLEN) - LENGTH OF PARAMETER LIST            @L7A 07970000
.* PRODUCE INSTALLATION DATA ADDRESS                                    07980000
         AIF   ('&INSTLN' EQ '' OR '&INSTLN(1)' NE '&INSTLN').RDEF112   07990000
         DC    AL3(&INSTLN) - INSTALLATION DATA ADDRESS                 08000000
         AGO   .RDEF114                                                 08010000
.RDEF112 ANOP                                                           08020000
         DC    AL3(0) - INSTALLATION DATA ADDRESS                       08030000
.RDEF114 ANOP                                                           08040000
.* PRODUCE FIRST FLAGS BYTE                                             08050000
         AIF   ('&LCTYPE' NE 'DELETE').RDEF120                     @M3C 08060000
&BIT0    SETA  1                                                        08070000
.RDEF120 ANOP                                                           08080000
         AIF   ('&LCTYPE' NE 'ADDVOL').RDEF130                     @M3C 08090000
&BIT1    SETA  1                                                        08100000
.RDEF130 ANOP                                                           08110000
         AIF   ('&LCTYPE' NE 'CHGVOL').RDEF135                     @M3C 08120000
&BIT0    SETA  1                                                   @L4A 08130000
&BIT1    SETA  1                                                   @L4A 08140000
.RDEF135 ANOP  ,                                                   @L4A 08150000
         AIF   ('&OLDVOL' EQ '').RDEF140                                08160000
&BIT2    SETA  1                                                        08170000
.RDEF140 ANOP                                                           08180000
         AIF   ('&CMNWNM' EQ '').RDEF145                           @M3C 08190000
&BIT3    SETA  1                                                        08200000
.RDEF145 ANOP                                                      @T1A 08210000
.******************************************************            @T1A 08220000
.* IF THIS MACRO WAS INVOKED BY THE RACROUTE MACRO, THE            @T1A 08230000
.* PARAMETER LIST HAS 31-BIT ADDRESSING.                           @T1A 08240000
.******************************************************            @T1A 08250000
         AIF   (NOT &ICHRAC AND NOT &ICHCOM).RDEF150               @M3C 08260000
&BIT4    SETA  1               31-BIT ADDRESSING IN LIST           @T1A 08270000
.RDEF150 ANOP                                                           08280000
         AIF   ('&DSTYPE' NE 'M').RDEF160                          @L4A 08290000
&BIT6    SETA  1                                                   @L4A 08300000
.RDEF160 ANOP  ,                                                   @L4A 08310000
         AIF   ('&DSTYPE' NE 'V').RDEF170                               08320000
&BIT5    SETA  1                                                        08330000
.RDEF170 ANOP                                                           08340000
         AIF   ('&SPECIAL' EQ 'NO' OR '&SPECIAL' EQ '').RDEF171  @L4A   08350000
&BIT7    SETA  1                                                 @L4A   08360000
.RDEF171 ANOP  ,                                                 @L4A   08370000
         DC    B'&BIT0&BIT1&BIT2&BIT3&BIT4&BIT5&BIT6&BIT7' FLAGS @L4A   08380000
.**************************************************************    @T1A 08390000
.* IF THIS MACRO WAS INVOKED BY THE RACROUTE MACRO, THE 3 BYTES    @T1A 08400000
.* AFTER FLAGS  ARE RESERVED, AND ENTITY IS GENERATED AT THE       @T1A 08410000
.* END OF THE LIST.                                                @T1A 08420000
.**************************************************************    @T1A 08430000
         AIF   (NOT &ICHRAC AND NOT &ICHCOM).RDEF175               @M3C 08440000
         DC    AL3(0)                                              @T1A 08450000
         AGO   .RDEF190                                            @T1A 08460000
.RDEF175 ANOP                                                      @T1A 08470000
.* PRODUCE ENTITY OR ENTITYX NAME ADDRESS                          @M3C 08480000
         AIF   ('&CMENTY1' EQ '').RDEF180                          @M3C 08490000
         AIF   ('&CMENTY1'(1,1) EQ '(').RDEF180                    @M3C 08500000
         DC    AL3(&CMENTY1) - ENTITY OR ENTITYX NAME ADDRESS      @M3C 08510000
         AGO   .RDEF190                                                 08520000
.RDEF180 ANOP                                                           08530000
         DC    AL3(0) -       ENTITY NAME ADDR FIELD                    08540000
.RDEF190 ANOP                                                           08550000
.* PRODUCE OLD VOLSER, OR NEWNAME ADDRESS                               08560000
         AIF   ('&OLDVOL' EQ '').RDEF210                                08570000
         AIF   ('&OLDVOL'(1,1) EQ '(').RDEF210                          08580000
         DC    A(&OLDVOL) -   OLD VOLSER ADDRESS                        08590000
         AGO   .RDEF230                                                 08600000
.RDEF210 ANOP                                                           08610000
         AIF   ('&CMNWNM' EQ '').RDEF220                           @M3C 08620000
         AIF   ('&CMNWNM'(1,1) EQ '(').RDEF220                     @M3C 08630000
         DC    A(&CMNWNM) -   NEW ENTITY NAME ADDRESS              @M3C 08640000
         AGO   .RDEF230                                                 08650000
.RDEF220 ANOP                                                           08660000
         DC    A(0) -         OLDVOL OR NEWNAME ADDRESS FIELD           08670000
.RDEF230 ANOP                                                           08680000
.* PRODUCE VOLSER ADDRESS                                               08690000
         AIF   ('&VOLSER' EQ '').RDEF24E NO VOLSER                      08700000
         AIF   ('&VOLSER'(1,1) EQ '(').RDEF24E                          08710000
         DC    A(&VOLSER) -   ENTITY VOLSER ADDRESS                     08720000
         AGO   .RDEF24F                                                 08730000
.RDEF24E ANOP                                                           08740000
         DC    A(0) -         ENTITY VOLSER ADDRESS FIELD               08750000
.RDEF24F ANOP                                                           08760000
.* PRODUCE CLASS ADDRESS                                       @PC002PY 08770000
         AIF   ('&CLASS' EQ '').RDEF251 NO CLASS               @PC002PY 08780000
         AIF   ('&CLASS'(1,1) EQ '(').RDEF251                  @PC002PY 08790000
         AIF   ('&CLASS'(1,1) EQ '''').RDEF250                 @PC002PY 08800000
         DC    A(&CLASS) -    ENTITY CLASS ADDRESS             @PC002PY 08810000
         AGO   .RDEF252                                        @PC002PY 08820000
.RDEF250 ANOP                                                  @PC002PY 08830000
         DC    A(ICH1&SYSNDX) -    ENTITY CLASS ADDRESS        @ZA56979 08840000
         AGO   .RDEF252                                        @PC002PY 08850000
.RDEF251 ANOP                                                  @PC002PY 08860000
         DC    A(0) -         ENTITY CLASS ADDRESS FIELD       @PC002PY 08870000
.RDEF252 ANOP                                                  @PC002PY 08880000
.* PRODUCE MENTITY OR MENTX ADDRESS                                @M3C 08890000
         AIF   ('&CMMENT' EQ '').RDEF253 NO MENTITY                @M3C 08900000
         AIF   ('&CMMENT'(1,1) EQ '(').RDEF253                     @M3C 08910000
         DC    A(&CMMENT) -   MENTITY ADDRESS                      @M3C 08920000
         AGO   .RDEF254                                        @PC002PY 08930000
.RDEF253 ANOP                                                  @PC002PY 08940000
         DC    A(0) -         MENTITY ADDRESS FIELD            @PC002PY 08950000
.RDEF254 ANOP                                                  @PC002PY 08960000
.* PRODUCE MVOLSER ADDRESS                                     @PC002PY 08970000
         AIF   ('&MVOLSER' EQ '').RDEF255 NO MVOLSER           @PC002PY 08980000
         AIF   ('&MVOLSER'(1,1) EQ '(').RDEF255                @PC002PY 08990000
         DC    A(&MVOLSER) -  ENTITY MVOLSER ADDRESS           @PC002PY 09000000
         AGO   .RDEF256                                        @PC002PY 09010000
.RDEF255 ANOP                                                  @PC002PY 09020000
         DC    A(0) -         ENTITY MVOLSER ADDRESS FIELD     @PC002PY 09030000
.RDEF256 ANOP                                                  @PC002PY 09040000
.* PRODUCE ACEE ADDRESS                                        @PC003PY 09050000
         AIF   ('&ACEE' EQ '').RDEF257 NO ACEE                 @PC003PY 09060000
         AIF   ('&ACEE'(1,1) EQ '(').RDEF257                   @PC003PY 09070000
         DC    A(&ACEE) -     ACEE ADDRESS                     @PC003PY 09080000
         AGO   .RDEF258                                        @PC003PY 09090000
.RDEF257 ANOP                                                  @PC003PY 09100000
         DC    A(0) -         ACEE ADDRESS FIELD               @PC003PY 09110000
.RDEF258 ANOP                                                  @PC003PY 09120000
.* PRODUCE UNIT ADDRESS.                                           @L4A 09130000
         AIF   ('&UNIT' EQ '').RDEF259                             @L4A 09140000
         AIF   ('&UNIT'(1,1) EQ '(').RDEF259                       @L4A 09150000
         DC    A(&UNIT) - UNIT ADDRESS.                            @L4A 09160000
         AGO   .RDEF25A                                            @L4A 09170000
.RDEF259 ANOP  ,                                                   @L4A 09180000
         DC    A(0) -         NO UNIT ADDRESS FIELD.               @L4A 09190000
.RDEF25A ANOP  ,                                                   @L4A 09200000
.* PRODUCE UACC VALUE.                                             @L4A 09210000
         AIF   ('&UACC' EQ '').RDEF25B                             @L4A 09220000
         AIF   ('&UACC'(1,1) EQ '(').RDEF25B                       @L4A 09230000
&UACC0   SETB  ('&UACC' EQ 'ALTER')                                @L4A 09240000
&UACC1   SETB  ('&UACC' EQ 'CONTROL')                              @L4A 09250000
&UACC2   SETB  ('&UACC' EQ 'UPDATE')                               @L4A 09260000
&UACC3   SETB  ('&UACC' EQ 'READ')                                 @L4A 09270000
&UACC4   SETB  ('&UACC' EQ 'EXECUTE')                              @M1A 09280000
&UACC5   SETB  0                                                   @L4A 09290000
&UACC6   SETB  0                                                   @L4A 09300000
&UACC7   SETB  ('&UACC' EQ 'NONE' OR '&UACC' EQ 'EXECUTE')         @M1A 09310000
&UACCVAL SETA  128*&UACC0+64*&UACC1+32*&UACC2+16*&UACC3+8*&UACC4+1*&UACX09320000
               C7                                                  @M1A 09330000
         DC    AL1(&UACCVAL) - UACC VALUE.                         @L4A 09340000
         AGO   .RDEF25C                                            @L4A 09350000
.RDEF25B ANOP  ,                                                   @L4A 09360000
         DC    AL1(0) -       NO UACC VALUE FIELD.                 @L4A 09370000
.RDEF25C ANOP  ,                                                   @L4A 09380000
.* PRODUCE LEVEL VALUE.                                            @L4A 09390000
         AIF   ('&LEVEL' EQ '').RDEF25D                            @L4A 09400000
         AIF   ('&LEVEL'(1,1) EQ '(').RDEF25D                      @L4A 09410000
         DC    AL1(&LEVEL) - LEVEL VALUE.                          @L4A 09420000
         AGO   .RDEF25E                                            @L4A 09430000
.RDEF25D ANOP  ,                                                   @L4A 09440000
         DC    AL1(0) -       NO LEVEL NUMBER PRESENT.             @L4A 09450000
.RDEF25E ANOP  ,                                                   @L4A 09460000
.* PRODUCE AUDIT VALUE.                                            @L4A 09470000
         AIF   ('&AUDIT' EQ '').RDEF25F                            @L4A 09480000
         AIF   ('&AUDITRG' NE '').RDEF25F                          @L5A 09490000
         DC    AL1(&AUDITVL) - AUDIT INDICATOR.                    @L4A 09500000
         AGO   .RDEF25G                                            @L4A 09510000
.RDEF25F ANOP  ,                                                   @L4A 09520000
         DC    AL1(0) -       NO AUDIT INDICATOR PRESENT.          @L4A 09530000
.RDEF25G ANOP  ,                                                   @L4A 09540000
.* PRODUCE SECOND FLAG BYTE                                        @L5A 09550000
.* INITIALIZE BIT SET VARIABLES                                         09560000
&BIT0    SETA  0                                                   @L5A 09570000
&BIT1    SETA  0                                                   @L5A 09580000
&BIT2    SETA  0                                                   @L5A 09590000
&BIT3    SETA  0                                                   @L6A 09600000
&BIT4    SETA  0                                                   @L6A 09610000
&BIT5    SETA  0                                                   @L6A 09620000
&BIT6    SETA  0                                                   @L6A 09630000
&BIT7    SETA  0                                                   @L6A 09640000
         AIF   ('&RACFIND' EQ '').RDEF25J                          @L5A 09650000
&BIT0    SETA  1              RACFIND CODED                        @L5A 09660000
         AIF   ('&RACFIND' EQ 'NO').RDEF25J                        @L5A 09670000
&BIT1    SETA  1              RACFIND=YES                          @L5A 09680000
.RDEF25J ANOP                                                      @L5A 09690000
         AIF   ('&CHKAUTH' NE 'YES').RDEF25K     DEFAULT IS NO     @L5A 09700000
&BIT2    SETA  1              CHKAUTH=YES                          @L5A 09710000
.RDEF25K ANOP                                                      @L5A 09720000
         AIF   (&RLVL LE 2).RDEF25P     BYPASS CODE IF 1.6 VERSION @L7A 09730000
         AIF   ('&DSTYPE' NE 'T').RDEF25N                          @L7A 09740000
&BIT3    SETA  1              DSTYPE=T                             @L7A 09750000
.RDEF25N ANOP                                                      @L7A 09760000
         AIF   ('&ERASE' NE 'YES').RDEF25O                         @L7A 09770000
&BIT4    SETA  1              ERASE=YES                            @L7A 09780000
.RDEF25O ANOP                                                      @L7A 09790000
         AIF   ('&MGENER' NE 'YES').RDEF25P                        @L7A 09800000
&BIT5    SETA  1              MGENER=YES                           @L7A 09810000
.RDEF25P ANOP                                                      @L7A 09820000
         AIF   ('&WARNING' NE 'YES').RDEF25L                       @L6A 09830000
&BIT6    SETA  1              WARNING=YES                          @L6A 09840000
.RDEF25L ANOP  ,                                                   @L6A 09850000
         AIF   ('&GENERIC' NE 'YES').RDEF25M                       @L6A 09860000
&BIT7    SETA  1              GENERIC=YES                          @L6A 09870000
.RDEF25M ANOP  ,                                                   @L6A 09880000
         DC    B'&BIT0&BIT1&BIT2&BIT3&BIT4&BIT5&BIT6&BIT7'         @L7A 09890000
.* PRODUCE OWNER ADDRESS.                                          @L4A 09900000
         AIF   ('&OWNER' EQ '').RDEF25H                            @L4A 09910000
         AIF   ('&OWNER'(1,1) EQ '(').RDEF25H                      @L4A 09920000
         DC    A(&OWNER) - OWNER ADDRESS.                          @L4A 09930000
         AGO   .RDEF260                                            @L4A 09940000
.RDEF25H ANOP  ,                                                   @L4A 09950000
         DC    A(0) -         NO OWNER ADDRESS FIELD.              @L4A 09960000
.RDEF260 ANOP  ,                                                   @L4A 09970000
.* PRODUCE DATA ADDRESS.                                           @L4A 09980000
         AIF   ('&DATA' EQ '').RDEF261                             @L4A 09990000
         AIF   ('&DATA'(1,1) EQ '(').RDEF261                       @L4A 10000000
         DC    A(&DATA) - DATA ADDRESS.                            @L4A 10010000
         AGO   .RDEF262                                            @L4A 10020000
.RDEF261 ANOP  ,                                                   @L4A 10030000
         DC    A(0) -         NO DATA ADDRESS FIELD.               @L4A 10040000
.RDEF262 ANOP  ,                                                   @L4A 10050000
.******************************************************            @T1A 10060000
.* IF THIS MACRO WAS INVOKED INTERNALLY BY THE RACROUTE            @T1A 10070000
.* MACRO, INSTLN AND ENTITY ARE PRODUCED HERE AS                   @T1A 10080000
.* 31-BIT ADDRESSES.                                               @T1A 10090000
.******************************************************            @T1A 10100000
         AIF   (NOT &ICHRAC AND NOT &ICHCOM).RDEF267               @M3C 10110000
.* PRODUCE INSTALLATION DATA ADDRESS                               @T1A 10120000
         AIF   ('&INSTLN' EQ '' OR                                     *10130000
               '&INSTLN(1)' NE '&INSTLN').RDEF263                  @T1A 10140000
         DC    A(&INSTLN)          INSTALLATION DATA ADDRESS       @T1A 10150000
         AGO   .RDEF264                                            @T1A 10160000
.RDEF263 ANOP                                                      @T1A 10170000
         DC    A(0)           INSTALLATION DATA ADDRESS            @T1A 10180000
.RDEF264 ANOP                                                      @T1A 10190000
.* PRODUCE ENTITY NAME ADDRESS                                     @T1A 10200000
         AIF   ('&CMENTY1' EQ '').RDEF265                         @M3C  10210000
         AIF   ('&CMENTY1'(1,1) EQ '(').RDEF265                    @M3C 10220000
         DC    A(&CMENTY1)    ENTITY NAME ADDRESS                  @M3C 10230000
         AGO   .RDEFY10                                            @L7A 10240000
.RDEF265 ANOP                                                      @T1A 10250000
         DC    A(0)           ENTITY NAME ADDR FIELD               @T1A 10260000
         AGO   .RDEFY10                                            @L7A 10270000
.RDEF267 ANOP                                                      @T1A 10280000
         AIF   (&RLVL LE 2).RDEFR90  BYPASS CODE IF 1.6 VERSION    @L7A 10290000
         DC    A(0)           31 BIT INSTALLATION DATA ADDRESS     @L7A 10300000
         DC    A(0)           31 BIT ENTITY NAME ADDRESS           @L7A 10310000
.RDEFY10 ANOP                                                      @L7A 10320000
         AIF   (&RLVL LE 2).RDEFR90  BYPASS CODE IF 1.6 VERSION    @L7A 10330000
.* PRODUCE ACCESS LEVEL ADDRESS                                    @L7A 10340000
         AIF   ('&ACCLVL' EQ '').RDEFR05                           @L7A 10350000
         AIF   (T'&ACCLVL(1) EQ 'O').RDEFR05                       @L7A 10360000
         AIF   ('&ACCLVL(1)'(1,1) EQ '(').RDEFR05                  @L7A 10370000
         DC    A(&ACCLVL(1))  ACCESS LEVEL ADDRESS PART ONE        @L7A 10380000
         AGO   .RDEFR07                                            @L7A 10390000
.RDEFR05 ANOP                                                      @L7A 10400000
         DC    A(0)           ACCESS LEVEL ADDRESS PART ONE        @L7A 10410000
.RDEFR07 ANOP                                                      @L7A 10420000
         AIF   (T'&ACCLVL(2) EQ 'O').RDEFR0A                       @L7A 10430000
         AIF   ('&ACCLVL(2)'(1,1) EQ '(').RDEFR0A                  @L7A 10440000
         DC    A(&ACCLVL(2))  ACCESS LEVEL ADDRESS PART TWO        @L7A 10450000
         AGO   .RDEFR15                                            @L7A 10460000
.RDEFR0A ANOP                                                      @L7A 10470000
         DC    A(0)           ACCESS LEVEL ADDRESS PART TWO        @L7A 10480000
.RDEFR15 ANOP                                                      @L7A 10490000
.* PRODUCE SECURITY LEVEL ADDRESS                                  @L7A 10500000
         AIF   ('&SECLVL' EQ '').RDEFR20                           @L7A 10510000
         AIF   ('&SECLVL'(1,1) EQ '(').RDEFR20                     @L7A 10520000
         DC    A(&SECLVL)   SECURITY LEVEL ADDRESS                 @L7A 10530000
         AGO   .RDEFR25                                            @L7A 10540000
.RDEFR20 ANOP                                                      @L7A 10550000
         DC    A(0)           SECURITY LEVEL ADDRESS               @L7A 10560000
.RDEFR25 ANOP                                                      @L7A 10570000
.* PRODUCE DEPARTMENT LIST ADDRESS                                 @L7A 10580000
         AIF   ('&CATGORY' EQ '').RDEFR30                          @L7A 10590000
         AIF   ('&CATGORY'(1,1) EQ '(').RDEFR30                    @L7A 10600000
         DC    A(&CATGORY)  DEPARTMENT LIST ADDRESS                @L7A 10610000
         AGO   .RDEFR35                                            @L7A 10620000
.RDEFR30 ANOP                                                      @L7A 10630000
         DC    A(0)           DEPARTMENT LIST ADDRESS              @L7A 10640000
.RDEFR35 ANOP                                                      @L7A 10650000
.* PRODUCE EXPIRATION DATE OR RETENTION PERIOD ADDRESS             @L7A 10660000
         AIF   ('&RETPD' EQ '').RDEFR40                            @L7A 10670000
         AIF   ('&RETPD'(1,1) EQ '(').RDEFR40                      @L7A 10680000
         DC    A(&RETPD)      RETENTION PERIOD ADDRESS             @L7A 10690000
         AGO   .RDEFR47                                            @L7A 10700000
.RDEFR40 ANOP                                                      @L7A 10710000
         AIF   ('&EXPDT' EQ '').RDEFR42                            @L8A 10720000
         AIF   ('&EXPDT'(1,1) EQ '(').RDEFR42                      @L8A 10730000
         DC    A(&EXPDT)      EXPIRATION DATE ADDRESS              @L7A 10740000
         AGO   .RDEFR47                                            @L7A 10750000
.RDEFR42 ANOP                                                      @L8A 10760000
         AIF   ('&EXPDTX' EQ '').RDEFR45                           @L8A 10770000
         AIF   ('&EXPDTX'(1,1) EQ '(').RDEFR45                     @L8A 10780000
         DC    A(&EXPDTX)     EXTENDED EXPIRATION DATE ADDRESS     @L8A 10790000
         AGO   .RDEFR47                                            @L8A 10800000
.RDEFR45 ANOP                                                      @L7A 10810000
         DC    A(0)       EXT/EXP DATE OR RET PERIOD ADDRESS       @L7A 10820000
.RDEFR47 ANOP                                                      @L7A 10830000
.* PRODUCE FILE SEQUENCE NUMBER                                    @L7A 10840000
         AIF   ('&FILESEQ' EQ '').RDEFR50                          @L7A 10850000
         AIF   ('&FILESEQ'(1,1) EQ '(').RDEFR50                    @L7A 10860000
         AIF   ('&FILESEQ' GE '65536').ERR36                       @MGA 10870000
.ERTN36  ANOP                                                      @MGA 10880000
         DC    AL2(&FILESEQ)     FILE SEQUENCE NUMBER              @L7A 10890000
         AGO   .RDEFR55                                            @L7A 10900000
.RDEFR50 ANOP                                                      @L7A 10910000
         DC    AL2(0)           FILE SEQUENCE NUMBER               @L7A 10920000
.RDEFR55 ANOP                                                      @L7A 10930000
.* PRODUCE TAPE FLAG                                               @L7A 10940000
&BIT0    SETA  0                                                   @L7A 10950000
&BIT1    SETA  0                                                   @L7A 10960000
&BIT7    SETA  0                                                   @L7A 10970000
         AIF   ('&TAPELBL' EQ '' OR '&TAPELBL' EQ 'STD').RDEFR65   @L7A 10980000
         AIF   ('&TAPELBL' NE 'BLP').RDEFR60                       @L7A 10990000
&BIT0    SETA  1                                                   @L7A 11000000
         AGO   .RDEFR65                                            @L7A 11010000
.RDEFR60 ANOP                                                      @L7A 11020000
&BIT1    SETA  1                                                   @L7A 11030000
.RDEFR65 ANOP                                                      @L7A 11040000
         AIF   ('&RETPD' NE '' OR '&EXPDT' EQ '').RDEFR70          @L7A 11050000
&BIT7    SETA  1                                                   @L7A 11060000
         AGO   .RDEFR74                                            @L8A 11070000
.RDEFR70 ANOP                                                      @L7A 11080000
         AIF   ('&EXPDTX' EQ '').RDEFR74                           @L8A 11090000
&BIT6    SETA  1                                                   @L8A 11100000
&BIT7    SETA  1                                                   @P6A 11110000
.RDEFR74 ANOP                                                      @L8A 11120000
         DC    B'&BIT0&BIT1.0000&BIT6&BIT7'                        @L8A 11130000
         DC    X'00' -        RESERVED                             @L7A 11140000
.RDEFR77 ANOP                                                      @L7A 11150000
.* PRODUCE MCLASS ADDRESS                                          @L7A 11160000
         AIF   ('&MCLASS' EQ '').RDEFR79                           @L7A 11170000
         AIF   ('&MCLASS'(1,1) EQ '(').RDEFR79                     @L7A 11180000
         AIF   ('&MCLASS'(1,1) EQ '''').RDEFR78                    @L7A 11190000
         DC    A(&MCLASS) - MODEL CLASS ADDRESS                    @L7A 11200000
         AGO   .RDEFR80                                            @L7A 11210000
.RDEFR78 ANOP                                                      @L7A 11220000
         DC    A(ICH2&SYSNDX) - MODEL CLASS ADDRESS                @L7A 11230000
         AGO   .RDEFR80                                            @L7A 11240000
.RDEFR79 ANOP                                                      @L7A 11250000
         DC    A(0) - MODEL CLASS ADDRESS                          @L7A 11260000
.RDEFR80 ANOP                                                      @L7A 11270000
.* PRODUCE NOTIFY ID ADDRESS                                       @L7A 11280000
         AIF   ('&NOTIFY' EQ '').RDEFR83                           @L7A 11290000
         AIF   ('&NOTIFY'(1,1) EQ '(').RDEFR83                     @L7A 11300000
         DC    A(&NOTIFY) - NOTIFY ID ADDRESS                      @L7A 11310000
         AGO   .RDEFR85                                            @L7A 11320000
.RDEFR83 ANOP                                                      @L7A 11330000
         DC    A(0) - NOTIFY ID ADDRESS                            @L7A 11340000
.RDEFR85 ANOP                                                      @L7A 11350000
         AIF   (&RLVL GE 4).RDEFR86      V1.8 OR HIGHER            @M1A 11360000
.* RESERVE FOUR FULLWORDS FOR FUTURE EXPANSION                     @L7A 11370000
         DC    4A(0) - RESERVED                                    @L7A 11380000
         AGO   .RDEFR90                                            @M1A 11390000
.RDEFR86 ANOP                                                      @M1A 11400000
.* PRODUCE STORAGE CLASS ADDRESS                                   @M1A 11410000
         AIF   ('&STORCLA' EQ '').RDEFR87                          @M1A 11420000
         AIF   ('&STORCLA'(1,1) EQ '(').RDEFR87                    @M1A 11430000
         DC    A(&STORCLA) - STORAGE CLASS ADDRESS                 @M1A 11440000
         AGO   .RDEFR88                                            @M1A 11450000
.RDEFR87 ANOP                                                      @M1A 11460000
         DC    A(0) - STORAGE CLASS ADDRESS                        @M1A 11470000
.RDEFR88 ANOP                                                      @M1A 11480000
.* PRODUCE MANAGEMENT CLASS ADDRESS                                @M1A 11490000
         AIF   ('&MGMTCLA' EQ '').RDEFR89                          @M1A 11500000
         AIF   ('&MGMTCLA'(1,1) EQ '(').RDEFR89                    @M1A 11510000
         DC    A(&MGMTCLA) - MANAGEMENT CLASS ADDRESS              @M1A 11520000
         AGO   .RDEFR8A                                            @M1A 11530000
.RDEFR89 ANOP                                                      @M1A 11540000
         DC    A(0) - MANAGEMENT CLASS ADDRESS                     @M1A 11550000
.RDEFR8A ANOP                                                      @M1A 11560000
.* PRODUCE RESOURCE OWNER ADDRESS                                  @M1A 11570000
         AIF   ('&RESOWN' EQ '').RDEFR8B                           @M1A 11580000
         AIF   ('&RESOWN'(1,1) EQ '(').RDEFR8B                     @M1A 11590000
         DC    A(&RESOWN) - RESOURCE OWNER ADDRESS                 @M1A 11600000
         AGO   .RDEFR8C                                            @M1A 11610000
.RDEFR8B ANOP                                                      @M1A 11620000
         DC    A(0) - RESOURCE OWNER ADDRESS                       @M1A 11630000
.RDEFR8C ANOP                                                      @M1A 11640000
.* PRODUCE ENVIRONMENT FLAG BYTE                                   @M2C 11650000
&BIT0    SETA  0                                                   @M3A 11660000
         AIF   ('&ENVIR' EQ '').RDEFR8D                            @M1A 11670000
&BIT0    SETA  1                                    SET ENVIR FLAG @M3A 11680000
.RDEFR8D ANOP                                                      @M1A 11690000
&BIT1    SETA  &COPENTY                                            @M3A 11700000
&BIT2    SETA  &COPMENT                                            @M3A 11710000
&BIT3    SETA  &COPNWNM                                            @M3A 11720000
         DC    B'&BIT0&BIT1&BIT2&BIT3.0000' - SET ENVIRONMENT FLAG @M3A 11730000
         DC    XL3'0'           RESERVED                           @M1A 11740000
.RDEFR9D ANOP                                                  @YA12773 11750000
         AIF   (&RLVL LT 6).RDEFR90                                @M3A 11760000
.* PRODUCE DDNAME ADDRESS                                      @YA12773 11770000
         AIF   ('&DDNAME' EQ '').RDEFR9E                       @YA12773 11780000
         AIF   ('&DDNAME'(1,1) EQ '(').RDEFR9E                 @YA12773 11790000
         DC    A(&DDNAME) - DDNAME ADDRESS                     @YA12773 11800000
         AGO   .RDEFR9F                                            @M3C 11810000
.RDEFR9E ANOP                                                  @YA08770 11820000
         DC    A(0) - DDNAME ADDRESS                           @YA12773 11830000
.RDEFR9F ANOP                                                      @M3A 11840000
         AIF   (&RLVL GE 7).RDEFR9G                                @M3A 11850000
         DC    4A(0)                                               @M3A 11860000
         AGO   .RDEFR90                                            @M3A 11870000
.RDEFR9G ANOP                                                      @M3A 11880000
.* PRODUCE SECLABL ADDRESS                                         @M2A 11890000
         AIF   ('&SECLABL' EQ '').RDEFR9A                          @M2A 11900000
         AIF   ('&SECLABL'(1,1) EQ '(').RDEFR9A                    @M2A 11910000
         DC    A(&SECLABL) - SECURITY LABEL ADDRESS                @M2A 11920000
         AGO   .RDEFRA0                                            @M2A 11930000
.RDEFR9A ANOP                                                      @M2A 11940000
         DC    A(0) - SECURITY LABEL ADDRESS                       @M2A 11950000
.RDEFRA0 ANOP                                                      @M2A 11960000
         DC    3A(0) - RESERVED                                @YA12773 11970000
.RDEFR90 ANOP                                                      @P2M 11980000
.* IF CLASS NAME SPECIFIED EXPLICITLY, PRODUCE IT BELOW LIST FORM       11990000
         AIF   ('&CLASS' EQ '').RDEF268                        @PC002PY 12000000
         AIF   ('&CLASS'(1,1) NE '''').RDEF268                 @PC002PY 12010000
&CLNGTH  SETA  K'&CLASS-2                                      @PC002PY 12020000
ICH1&SYSNDX EQU   *                                            @ZA56979 12030000
         DC    AL1(&CLNGTH) - CLASS NAME LENGTH                @PC002PY 12040000
         DC    CL9&CLASS    - CLASS NAME                       @PC002PY 12050000
.RDEF268 ANOP                                                  @PC002PY 12060000
.* IF MCLASS NAME SPECIFIED EXPLICITYLY, PRODUCE IT BELOW LIST     @L7A 12070000
         AIF   ('&MCLASS' EQ '').RDEFFF                            @L7A 12080000
         AIF   ('&MCLASS'(1,1) NE '''').RDEFFF                     @L7A 12090000
&CLNGTH  SETA  K'&MCLASS-2                                         @L7A 12100000
ICH2&SYSNDX EQU *                                                  @L7A 12110000
         DC    AL1(&CLNGTH) - MCLASS NAME LENGTH                   @L7A 12120000
         DC    CL9&MCLASS   - MCLASS NAME                          @L7A 12130000
.RDEFFF  ANOP                                                      @L7A 12140000
         AIF   (&MFFLAG).RDEF330                                        12150000
         MEXIT                                                          12160000
.* END OF LIST FORM GENERATION                                          12170000
.RDEF269 ANOP                                                           12180000
.* TEST FOR OTHER MACRO FORMS                                           12190000
         AIF   ('&MF' EQ 'S').RDEF270                                   12200000
         AIF   ('&MF(1)' NE 'E' AND                                    -12210000
                '&MF(1)' NE 'M').ERR06                             @M2C 12220000
         AGO   .RDEF345                                                 12230000
.RDEF270 ANOP                                                           12240000
.ERTN06  ANOP                                                           12250000
.* PRODUCE STANDARD FORM                                                12260000
&SYMBOL  DS    0H                                                       12270000
&MFFLAG  SETB  1              SET TRUE FOR STANDARD FORM PASS THRU LIST 12280000
.*                            FORM DEFINITION ABOVE                     12290000
.* PRODUCE LOGIC TO MODIFY IN-LINE LIST FORM                            12300000
.* PRODUCE INSTALLATION DATA                                            12310000
         AIF   ('&INSTLN(1)' EQ '&INSTLN').RDEF271                      12320000
         AIF   (NOT &ICHRAC AND NOT &ICHCOM).RDEF27A               @M3C 12330000
         ST    &INSTLN(1),ICH0&SYSNDX+48    INSTALLATION DATA ADDR @T1A 12340000
         AGO   .RDEF271                                            @T1A 12350000
.RDEF27A ANOP                                                      @T1A 12360000
         STCM  &INSTLN(1),7,ICH0&SYSNDX+1 - INSTALLATION DATA ADDRESS   12370000
.RDEF271 ANOP                                                           12380000
         AIF   ('&CMENTY1' EQ '').RDEF280                          @M3C 12390000
         AIF   (NOT &ICHRAC AND NOT &ICHCOM).RDEF275               @M3C 12400000
         AIF   ('&CMENTY1'(1,1) NE '(').RDEF280                    @M3C 12410000
         ST    &CMENTY1,ICH0&SYSNDX+52      STORE ENTITY NAME ADDR @M3C 12420000
         AGO   .RDEF280                                            @T1A 12430000
.RDEF275 ANOP                                                      @T1A 12440000
         AIF   ('&CMENTY1'(1,1) NE '(').RDEF280                    @M3C 12450000
         STCM  &CMENTY1,7,ICH0&SYSNDX+5     STORE ENTITY NAME ADDR @M3A 12460000
.RDEF280 ANOP                                                           12470000
         AIF   ('&OLDVOL' EQ '').RDEF300                                12480000
         AIF   ('&OLDVOL'(1,1) NE '(').RDEF300                          12490000
         ST    &OLDVOL(1),ICH0&SYSNDX+8 - STORE OLDVOL ADDR IN LIST     12500000
         AGO   .RDEF310                                                 12510000
.RDEF300 ANOP                                                           12520000
         AIF   ('&CMNWNM' EQ '').RDEF310                           @M3C 12530000
         AIF   ('&CMNWNM'(1,1) NE '(').RDEF310                     @M3C 12540000
         ST    &CMNWNM,ICH0&SYSNDX+8 - STORE NEW NAME IN LIST      @M3C 12550000
.RDEF310 ANOP                                                           12560000
         AIF   ('&VOLSER' EQ '').RDEF320                                12570000
         AIF   ('&VOLSER'(1,1) NE '(').RDEF320                          12580000
         ST    &VOLSER(1),ICH0&SYSNDX+12 - STORE VOLSER ADDR IN LIST    12590000
.RDEF320 ANOP                                                           12600000
         AIF   ('&CLASS' EQ '').RDEF321                        @PC002PY 12610000
         AIF   ('&CLASS'(1,1) NE '(').RDEF321                  @PC002PY 12620000
         ST    &CLASS(1),ICH0&SYSNDX+16 - STORE CLASS ADDR IN LIST      12630000
.RDEF321 ANOP                                                  @PC002PY 12640000
         AIF   ('&CMMENT' EQ '').RDEF322                           @M3C 12650000
         AIF   ('&CMMENT'(1,1) NE '(').RDEF322                     @M3C 12660000
         ST    &CMMENT,ICH0&SYSNDX+20 - STORE ADDR IN LIST         @M3C 12670000
.RDEF322 ANOP                                                  @PC002PY 12680000
         AIF   ('&MVOLSER' EQ '').RDEF323                      @PC002PY 12690000
         AIF   ('&MVOLSER'(1,1) NE '(').RDEF323                @PC002PY 12700000
         ST    &MVOLSER(1),ICH0&SYSNDX+24 - STORE MVOLSER ADDR IN LIST  12710000
.RDEF323 ANOP                                                  @PC003PY 12720000
         AIF   ('&ACEE' EQ '').RDEF324                         @PC003PY 12730000
         AIF   ('&ACEE'(1,1) NE '(').RDEF324                   @PC003PY 12740000
         ST    &ACEE(1),ICH0&SYSNDX+28 - STORE ACEE ADDR IN LIST        12750000
.RDEF324 ANOP                                                  @PC003PY 12760000
         AIF   ('&UNIT' EQ '').RDEF325                             @L4A 12770000
         AIF   ('&UNIT'(1,1) NE '(').RDEF325                       @L4A 12780000
         ST    &UNIT(1),ICH0&SYSNDX+32 - STORE UNIT ADDR IN LIST.  @L4A 12790000
.RDEF325 ANOP  ,                                                   @L4A 12800000
         AIF   ('&UACC' EQ '').RDEF326                             @L4A 12810000
         AIF   ('&UACC'(1,1) NE '(').RDEF326                       @L4A 12820000
         STC   &UACC(1),ICH0&SYSNDX+36 - STORE UACC VALUE IN LIST. @L4A 12830000
.RDEF326 ANOP  ,                                                   @L4A 12840000
         AIF   ('&LEVEL' EQ '').RDEF327                            @L4A 12850000
         AIF   ('&LEVEL'(1,1) NE '(').RDEF327                      @L4A 12860000
         STC   &LEVEL(1),ICH0&SYSNDX+37 - STORE LEVEL VALUE.       @L4A 12870000
.RDEF327 ANOP  ,                                                   @L4A 12880000
         AIF   ('&AUDITRG' EQ '').RDEF328                          @L5A 12890000
         STC   &AUDITRG,ICH0&SYSNDX+38 - STORE AUDIT VALUE.        @L5A 12900000
.RDEF328 ANOP  ,                                                   @L4A 12910000
         AIF   ('&OWNER' EQ '').RDEF329                            @L4A 12920000
         AIF   ('&OWNER'(1,1) NE '(').RDEF329                      @L4A 12930000
         ST    &OWNER(1),ICH0&SYSNDX+40 - STORE OWNER ADDRESS.     @L4A 12940000
.RDEF329 ANOP  ,                                                   @L4A 12950000
         AIF   ('&DATA' EQ '').RDEF32A                             @L4A 12960000
         AIF   ('&DATA'(1,1) NE '(').RDEF32A                       @L4A 12970000
         ST    &DATA(1),ICH0&SYSNDX+44 - STORE DATA ADDRESS.       @L4A 12980000
.RDEF32A ANOP  ,                                                   @L4A 12990000
         AIF   (&RLVL LE 2).RDEF32X  BYPASS CODE IF 1.6 VERSION    @M1A 13000000
         AIF   ('&ACCLVL' EQ '').RDEF32I                           @L7A 13010000
         AIF   (T'&ACCLVL(1) EQ 'O').RDEF32H                       @L7A 13020000
         AIF   ('&ACCLVL(1)'(1,1) NE '(').RDEF32H                  @L7A 13030000
         ST    &ACCLVL(1),ICH0&SYSNDX+56 - STORE ACCESS PART 1 ADR @L7A 13040000
.RDEF32H ANOP                                                      @L7A 13050000
         AIF   (T'&ACCLVL(2) EQ'O').RDEF32I                        @L7A 13060000
         AIF   ('&ACCLVL(2)'(1,1) NE '(').RDEF32I                  @L7A 13070000
         ST    &ACCLVL(2),ICH0&SYSNDX+60 - STORE ACCESS PART 2 ADR @L7A 13080000
.RDEF32I ANOP                                                      @L7A 13090000
         AIF   ('&SECLVL' EQ '').RDEF32J                           @L7A 13100000
         AIF   ('&SECLVL'(1,1) NE '(').RDEF32J                     @L7A 13110000
         ST    &SECLVL(1),ICH0&SYSNDX+64 - STORE SECLVL ADDRESS.   @L7A 13120000
.RDEF32J ANOP                                                      @L7A 13130000
         AIF   ('&CATGORY' EQ '').RDEF32K                          @L7A 13140000
         AIF   ('&CATGORY'(1,1) NE '(').RDEF32K                    @L7A 13150000
         ST    &CATGORY(1),ICH0&SYSNDX+68 - STORE CATGORY ADDRESS. @L7A 13160000
.RDEF32K ANOP                                                      @L7A 13170000
         AIF   ('&EXPDT' EQ '').RDF32L                             @L8A 13180000
         AIF   ('&EXPDT'(1,1) NE '(').RDEF32M                      @L7A 13190000
         ST    &EXPDT(1),ICH0&SYSNDX+72 - STORE EXP DATE ADDRESS.  @L7A 13200000
         AGO   .RDEF32M                                            @L7A 13210000
.RDF32L  ANOP                                                      @L8A 13220000
         AIF   ('&EXPDTX' EQ '').RDEF32L                           @L8A 13230000
         AIF   ('&EXPDTX'(1,1) NE '(').RDEF32M                     @L8A 13240000
         ST    &EXPDTX(1),ICH0&SYSNDX+72 - STORE EXTD DATE ADDRESS.@L8A 13250000
         AGO   .RDEF32M                                            @L8A 13260000
.RDEF32L ANOP                                                      @L7A 13270000
         AIF   ('&RETPD' EQ '').RDEF32M                            @L7A 13280000
         AIF   ('&RETPD'(1,1) NE '(').RDEF32M                      @L7A 13290000
         ST    &RETPD(1),ICH0&SYSNDX+72 - STORE RETENTION ADDRESS. @L7A 13300000
.RDEF32M ANOP                                                      @L7A 13310000
         AIF   ('&FILESEQ' EQ '').RDEF32N                          @L7A 13320000
         AIF   ('&FILESEQ'(1,1) NE '(').RDEF32N                    @L7A 13330000
         STH   &FILESEQ(1),ICH0&SYSNDX+76 - STORE FILESEQ ADDRESS. @L7A 13340000
.RDEF32N ANOP                                                      @L7A 13350000
         AIF   ('&MCLASS' EQ '').RDEF32O                           @L7A 13360000
         AIF   ('&MCLASS'(1,1) NE '(').RDEF32O                     @L7A 13370000
         ST    &MCLASS(1),ICH0&SYSNDX+80 - STORE MCLASS ADDRESS    @L7A 13380000
.RDEF32O ANOP                                                      @L7A 13390000
         AIF   ('&NOTIFY' EQ '').RDEF32P                           @L7A 13400000
         AIF   ('&NOTIFY'(1,1) NE '(').RDEF32P                     @L7A 13410000
         ST    &NOTIFY(1),ICH0&SYSNDX+84 - STORE NOTIFY ID ADDRESS @L7A 13420000
.RDEF32P ANOP                                                      @L7A 13430000
         AIF   (&RLVL LT 4).RDEF32X           LOWER THAN V1.8      @M1A 13440000
         AIF   ('&STORCLA' EQ '').RDEF32Q                          @M1A 13450000
         AIF   ('&STORCLA'(1,1) NE '(').RDEF32Q                    @M1A 13460000
         ST    &STORCLA(1),ICH0&SYSNDX+88 - STORE STORAGE CLASS    @M1A 13470000
.RDEF32Q ANOP                                                      @M1A 13480000
         AIF   ('&MGMTCLA' EQ '').RDEF32R                          @M1A 13490000
         AIF   ('&MGMTCLA'(1,1) NE '(').RDEF32R                    @M1A 13500000
         ST    &MGMTCLA(1),ICH0&SYSNDX+92 - STORE MANAGEMENT CLASS @M1A 13510000
.RDEF32R ANOP                                                      @M1A 13520000
         AIF   ('&RESOWN' EQ '').RDEF32U                           @M1A 13530000
         AIF   ('&RESOWN'(1,1) NE '(').RDEF32U                     @M1A 13540000
         ST    &RESOWN(1),ICH0&SYSNDX+96 - STORE RESOURCE OWNER    @M1A 13550000
.RDEF32U ANOP                                                  @YA12773 13560000
         AIF   ('&DDNAME' EQ '').RDEF32S                       @YA12773 13570000
         AIF   ('&DDNAME'(1,1) NE '(').RDEF32S                 @YA12773 13580000
         ST    &DDNAME(1),ICH0&SYSNDX+104 - STORE DDNAME ADDR  @YA12773 13590000
.RDEF32S ANOP                                                      @M1A 13600000
         AIF   ('&SECLABL' EQ '').RDEF32T                          @M2A 13610000
         AIF   ('&SECLABL'(1,1) NE '(').RDEF32T                    @M2A 13620000
         ST    &SECLABL(1),ICH0&SYSNDX+108 - STORE SECLABL ADDRESS @M2A 13630000
.RDEF32T ANOP                                                      @M2A 13640000
.RDEF32X ANOP                                                      @M1A 13650000
.* LIST FORM MODIFICATION COMPLETE - PRODUCE LIST FORM WITH BAL AROUND  13660000
         CNOP  0,4 -          ALIGN LIST FORM                           13670000
&BRPT    SETA  &PARMLEN+4                                          @L7A 13680000
         AIF   ('&CLASS' EQ '').RDEF32Y                            @M1A 13690000
         AIF   ('&CLASS'(1,1) NE '''' ).RDEF32Y                    @M1A 13700000
&BRPT    SETA  &BRPT+10                                            @L7A 13710000
.RDEF32Y ANOP                                                      @M1A 13720000
         AIF   ('&MCLASS' EQ '').RDEFBAL                           @L7A 13730000
         AIF   ('&MCLASS'(1,1) NE '''').RDEFBAL                    @L7A 13740000
&BRPT    SETA  &BRPT+10                                            @L7A 13750000
.RDEFBAL ANOP                                                      @L7A 13760000
         BAL   1,*+&BRPT      POINT REG 1 AT LIST FORM             @L7A 13770000
         AGO   .RDEF110                                            @L7A 13780000
.RDEF330 ANOP                                                           13790000
.***********************************************************       @T1A 13800000
.* IF THIS MACRO WAS INVOKED INTERNALLY BY THE RACROUTE            @T1A 13810000
.* MACRO, SIMPLY EXIT RATHER THAN GOING TO THE RACF ROUTINE.       @T1A 13820000
.***********************************************************       @T1A 13830000
         AIF   (&ICHRAC).RDEF340                                   @T1A 13840000
.*                                                                 @M2A 13850000
.* IF MODIFY FORM (MF=M) THEN EXIT RATHER THAN GOING TO RACDEF     @M2A 13860000
         AIF   ('&MF(1)' EQ 'M').RDEF340                           @M2A 13870000
.* TAKE SVC                                                             13880000
         SVC   133           ISSUE RACDEF SVC                           13890000
         AIF   (NOT &RLVLCHK).RDEF340    GENERATE BRANCH LABEL     @L7A 13900000
&ICHRLVL DS    0H                                                  @L7A 13910000
.RDEF340 ANOP                                                      @T1A 13920000
         MEXIT                                                          13930000
.* PRODUCE EXECUTE FORM IF REQUESTED                                    13940000
.RDEF345 ANOP                                                           13950000
         AIF   (&ICHRAC).RDEF346                                   @T1A 13960000
&SYMBOL  IHBINNRA &MF(2) -    LOAD REG 1 WITH LIST FORM ADDRESS         13970000
         AGO   .RDEF34G                                            @T1A 13980000
.**********************************************************        @T1A 13990000
.*  IF THIS MACRO WAS INVOKED INTERNALLY BY THE RACROUTE           @T1A 14000000
.*  MACRO, PICK UP THE ADDRESS OF THE RACDEF PARAMETER LIST        @T1A 14010000
.*  FROM THE RACROUTE PARAMETER LIST.                              @T1A 14020000
.**********************************************************        @T1A 14030000
.RDEF346 ANOP                                                      @T1A 14040000
         A     1,36(1)              POINT REG1 AT RACDEF LIST      @T1A 14050000
.RDEF34G ANOP                                                      @T1A 14060000
.* MODIFY INSTALLATION DATA                                             14070000
.* IF REQUESTED, CHECK SIZE OF LIST FORM VS EXECUTE FORM           @L7A 14080000
         AIF   (NOT &RLVLCHK).RLVL100                              @L7A 14090000
         CLI   0(1),&RLVLSZ(&RLVL)  LIST FORM LARGE ENOUGH?        @L7A 14100000
         BNL   *+12                 YES, CONTINUE                  @L7A 14110000
         LA    15,100               NO, SET BAD RETURN CODE        @L7A 14120000
         B     &ICHRLVL             DO NOT ISSUE THE SVC           @L7A 14130000
.RLVL100 ANOP  ,                                                   @L7A 14140000
.*                                                                 @L7A 14150000
         AIF   ('&INSTLN' EQ '').RDEF349                                14160000
         AIF   ('&INSTLN(1)' NE '&INSTLN').RDEF348                      14170000
         LA    0,&INSTLN - INSTALLATION DATA ADDRESS                    14180000
         AIF   (NOT &ICHRAC AND NOT &ICHCOM).RDEF347               @M3C 14190000
         ST    0,48(1)            STORE INSTALLATION DATA ADDR     @T1A 14200000
         AGO   .RDEF349                                            @T1A 14210000
.RDEF347 ANOP                                                      @T1A 14220000
         STCM  0,7,1(1) - STORE INSTALLATION DATA ADDRESS               14230000
         AGO   .RDEF349                                                 14240000
.RDEF348 ANOP                                                           14250000
         AIF   (NOT &ICHRAC AND NOT &ICHCOM).RDEF34F               @M3C 14260000
         ST    &INSTLN(1),48(1) STORE INSTALLATION DATA ADDR       @T1A 14270000
         AGO   .RDEF349                                            @T1A 14280000
.RDEF34F ANOP                                                      @T1A 14290000
         STCM  &INSTLN(1),7,1(1) - STORE INSTALLATION DATA ADDRESS      14300000
.RDEF349 ANOP                                                           14310000
.* MODIFY LIST FLAG FIELD AS REQUESTED                                  14320000
         AIF   ('&LCTYPE' EQ 'DELETE').RDF349A    For type to be   @M3C 14330000
         AIF   ('&LCTYPE' EQ 'ADDVOL').RDF349A    specified, alter @M3C 14340000
         AIF   ('&LCTYPE' EQ 'CHGVOL').RDF349A    the flags in     @M3C 14350000
         AIF   ('&LCTYPE' EQ 'DEFINE').RDF349A    modify form.     @M3A 14360000
         AIF   ('&SPECIAL' EQ 'YES').RDF349A                       @L4A 14370000
         AIF   ('&OLDVOL' NE '').RDF349A                           @L4A 14380000
         AIF   ('&CMNWNM' NE '').RDF349A                           @M3C 14390000
         AIF   ('&DSTYPE' NE 'N' AND '&DSTYPE' NE 'T' AND              -14400000
               '&DSTYPE' NE 'V' AND '&DSTYPE' NE 'M').RDEF410      @L7A 14410000
.RDF349A ANOP  ,                                                   @L4A 14420000
&BITA0   SETA  1                                                   @M3A 14430000
&BITA1   SETA  1                                                   @M3A 14440000
         AIF   ('&LCTYPE' NE 'CHGVOL').RDEF350                     @M3C 14450000
&BIT0    SETA  1                                                   @L4A 14460000
&BIT1    SETA  1                                                   @L4A 14470000
&BITA0   SETA  0                                                   @M3A 14480000
&BITA1   SETA  0                                                   @M3A 14490000
.RDEF350 ANOP                                                      @M3A 14500000
         AIF   ('&LCTYPE' NE 'DELETE').RDEF351                     @M3C 14510000
&BIT0    SETA  1                                                        14520000
&BITA0   SETA  0                                                   @M3A 14530000
&BITA1   SETA  0                                                   @M3A 14540000
.RDEF351 ANOP                                                      @M3A 14550000
         AIF   ('&LCTYPE' NE 'DEFINE').RDEF352                     @M3C 14560000
&BITA0   SETA  0                                                   @M3A 14570000
&BITA1   SETA  0                                                   @M3A 14580000
.RDEF352 ANOP                                                           14590000
         AIF   ('&LCTYPE' NE 'ADDVOL').RDEF360                     @M3C 14600000
&BIT1    SETA  1                                                        14610000
&BITA0   SETA  0                                                   @M3A 14620000
&BITA1   SETA  0                                                   @M3A 14630000
.RDEF360 ANOP                                                           14640000
         AIF   ('&OLDVOL' EQ '').RDEF370                                14650000
&BIT2    SETA  1                                                        14660000
.RDEF370 ANOP                                                           14670000
         AIF   ('&CMNWNM' EQ '').RDEF375                           @M3C 14680000
&BIT3    SETA  1                                                        14690000
.******************************************************            @T1A 14700000
.* IF THIS MACRO WAS INVOKED INTERNALLY BY THE RACROUTE            @T1A 14710000
.* MACRO, THE PARAMETER LIST HAS 31-BIT ADDRESSING.                @T1A 14720000
.******************************************************            @T1A 14730000
.RDEF375 ANOP                                                      @T1A 14740000
         AIF   (NOT &ICHRAC AND NOT &ICHCOM).RDEF380               @M3C 14750000
&BIT4    SETA  1               31-BIT ADDRESSING IN PARAM LIST     @T1A 14760000
.RDEF380 ANOP                                                           14770000
         AIF   ('&DSTYPE' NE 'M').RDEF390                          @L4A 14780000
&BIT6    SETA  1                                                   @L4A 14790000
.RDEF390 ANOP  ,                                                   @L4A 14800000
         AIF   ('&DSTYPE' NE 'V').RDEF400                               14810000
&BIT5    SETA  1                                                        14820000
.RDEF400 ANOP                                                           14830000
         AIF   ('&SPECIAL' NE 'YES').RDEF401                     @L4A   14840000
&BIT7    SETA  1                                                 @L4A   14850000
.RDEF401 ANOP  ,                                                 @L4A   14860000
*                                SET FLAGS.                      @L4A   14870000
&BITA5   SETA  1                                                   @M3A 14880000
&BITA6   SETA  1                                                   @M3A 14890000
         AIF   ('&DSTYPE' EQ '').RDEF402                      @ZA56982  14900000
&BITA5   SETA  0                                                   @M3A 14910000
&BITA6   SETA  0                                                   @M3A 14920000
.RDEF402 ANOP                                                 @ZA56982  14930000
         AIF   ('&BITA0&BITA1&BIT2&BITA5&BITA6' EQ                     +14940000
               '11111').RDEF409                                    @M3A 14950000
         NI    4(1),B'&BITA0&BITA1.111&BITA5&BITA6.1' SETFIRSTFLAG @M3C 14960000
.RDEF409 ANOP                                                      @M3A 14970000
         AIF   ('&BIT0&BIT1&BIT2&BIT3&BIT4&BIT5&BIT6&BIT7' EQ          +14980000
               '00000000').RDEF410                                 @L7A 14990000
         OI    4(1),B'&BIT0&BIT1&BIT2&BIT3&BIT4&BIT5&BIT6&BIT7'         15000000
.RDEF410 ANOP                                                           15010000
.* MODIFY ADDRESS PARAMETERS AS REQUIRED                                15020000
         AIF   ('&CMENTY1' EQ '').RDEF430                          @M3C 15030000
         AIF   ('&CMENTY1'(1,1) NE '(').RDEF420                    @M3C 15040000
         AIF   (NOT &ICHRAC AND NOT &ICHCOM).RDEF415               @M3C 15050000
         ST    &CMENTY1,52(1)     STORE ENTITY NAME ADDRESS        @M3C 15060000
         AGO   .RDEF430                                            @T1A 15070000
.RDEF415 ANOP                                                      @T1A 15080000
         STCM  &CMENTY1,7,5(1) - STORE ENTITY NAME ADDRESS         @M3C 15090000
         AGO   .RDEF430                                                 15100000
.RDEF420 ANOP                                                           15110000
         LA    0,&CMENTY1 - MOVE ENTITY NAME ADDRESS               @M3C 15120000
         AIF   (NOT &ICHRAC AND NOT &ICHCOM).RDEF425               @M3C 15130000
         ST    0,52(1)         INTO PARM LIST                      @T1A 15140000
         AGO   .RDEF430                                            @T1A 15150000
.RDEF425 ANOP                                                      @T1A 15160000
         STCM  0,7,5(1) -      INTO PARM LIST                           15170000
.RDEF430 ANOP                                                           15180000
         AIF   ('&OLDVOL' EQ '').RDEF470                                15190000
         AIF   ('&OLDVOL'(1,1) NE '(').RDEF460                          15200000
         ST    &OLDVOL(1),8(1) STORE OLD VOLSER ADDRESS                 15210000
         AGO   .RDEF490                                                 15220000
.RDEF460 ANOP                                                           15230000
         LA    0,&OLDVOL -    MOVE OLD VOLSER ADDRESS                   15240000
         ST    0,8(1) -        INTO PARM LIST                           15250000
         AGO   .RDEF490                                                 15260000
.RDEF470 ANOP                                                           15270000
         AIF   ('&CMNWNM' EQ '').RDEF490                           @M3C 15280000
         AIF   ('&CMNWNM'(1,1) NE '(').RDEF480                     @M3C 15290000
         ST    &CMNWNM,8(1) STORE NEW ENTITY NAME ADDRESS          @M3C 15300000
         AGO   .RDEF490                                                 15310000
.RDEF480 ANOP                                                           15320000
         LA    0,&CMNWNM -    MOVE NEW ENTITY NAME ADDRESS         @M3C 15330000
         ST    0,8(1) -        INTO PARM LIST                           15340000
.RDEF490 ANOP                                                           15350000
         AIF   ('&VOLSER' EQ '').RDEF510                                15360000
         AIF   ('&VOLSER'(1,1) NE '(').RDEF500                          15370000
         ST    &VOLSER(1),12(1) STORE VOLSER ADDRESS                    15380000
         AGO   .RDEF510                                                 15390000
.RDEF500 ANOP                                                           15400000
         LA    0,&VOLSER -    MOVE VOLSER ADDRESS                       15410000
         ST    0,12(1) -        INTO PARAMETER                          15420000
.RDEF510 ANOP                                                           15430000
         AIF   ('&CLASS' EQ '').RDEF530                        @PC002PY 15440000
         AIF   ('&CLASS'(1,1) EQ '''').ERR08                   @PC002PY 15450000
         AIF   ('&CLASS'(1,1) NE '(').RDEF520                  @PC002PY 15460000
         ST    &CLASS(1),16(1) STORE CLASS ADDRESS             @PC002PY 15470000
         AGO   .RDEF530                                        @PC002PY 15480000
.RDEF520 ANOP                                                  @PC002PY 15490000
         LA    0,&CLASS -     MOVE CLASS ADDRESS               @PC002PY 15500000
         ST    0,16(1) -        INTO PARAMETER                 @PC002PY 15510000
.ERTN08  ANOP                                                  @PC002PY 15520000
.RDEF530 ANOP                                                  @PC002PY 15530000
         AIF   ('&CMMENT' EQ '').RDEF550                           @M3C 15540000
         AIF   ('&CMMENT'(1,1) NE '(').RDEF540                     @M3C 15550000
         ST    &CMMENT,20(1) STORE MENTITY ADDRESS                 @M3C 15560000
         AGO   .RDEF550                                        @PC002PY 15570000
.RDEF540 ANOP                                                  @PC002PY 15580000
         LA    0,&CMMENT -    MOVE MENTITY ADDRESS                 @M3C 15590000
         ST    0,20(1) -        INTO PARAMETER                 @PC002PY 15600000
.RDEF550 ANOP                                                  @PC002PY 15610000
         AIF   ('&MVOLSER' EQ '').RDEF570                      @PC002PY 15620000
         AIF   ('&MVOLSER'(1,1) NE '(').RDEF560                @PC002PY 15630000
         ST    &MVOLSER(1),24(1) STORE MVOLSER ADDRESS         @PC002PY 15640000
         AGO   .RDEF570                                        @PC002PY 15650000
.RDEF560 ANOP                                                  @PC002PY 15660000
         LA    0,&MVOLSER -   MOVE MVOLSER ADDRESS             @PC002PY 15670000
         ST    0,24(1) -        INTO PARAMETER                 @PC002PY 15680000
.RDEF570 ANOP                                                           15690000
         AIF   ('&ACEE' EQ '').RDEF590                         @PC003PY 15700000
         AIF   ('&ACEE'(1,1) NE '(').RDEF580                   @PC003PY 15710000
         ST    &ACEE(1),28(1) STORE ACEE ADDRESS               @PC003PY 15720000
         AGO   .RDEF590                                        @PC003PY 15730000
.RDEF580 ANOP                                                  @PC003PY 15740000
         LA    0,&ACEE -      MOVE ACEE ADDRESS                @PC003PY 15750000
         ST    0,28(1) -        INTO PARAMETER                 @PC003PY 15760000
.RDEF590 ANOP                                                           15770000
         AIF   ('&UNIT' EQ '').RDEF610                             @L4A 15780000
         AIF   ('&UNIT'(1,1) NE '(').RDEF600                       @L4A 15790000
         ST    &UNIT(1),32(1) - STORE UNIT ADDRESS.                @L4A 15800000
         AGO   .RDEF610                                            @L4A 15810000
.RDEF600 ANOP  ,                                                   @L4A 15820000
         LA    0,&UNIT -      MOVE UNIT ADDRESS                    @L4A 15830000
         ST    0,32(1) -        INTO PARAMETER.                    @L4A 15840000
.RDEF610 ANOP  ,                                                   @L4A 15850000
         AIF   ('&UACC' EQ '').RDEF630                             @L4A 15860000
         AIF   ('&UACC'(1,1) NE '(').RDEF620                       @L4A 15870000
         STC   &UACC(1),36(1) - STORE UACC VALUE IN LIST.          @L4A 15880000
         AGO   .RDEF630                                            @L4A 15890000
.RDEF620 ANOP  ,                                                   @L4A 15900000
&UACC0   SETB  ('&UACC' EQ 'ALTER')                                @L4A 15910000
&UACC1   SETB  ('&UACC' EQ 'CONTROL')                              @L4A 15920000
&UACC2   SETB  ('&UACC' EQ 'UPDATE')                               @L4A 15930000
&UACC3   SETB  ('&UACC' EQ 'READ')                                 @L4A 15940000
&UACC4   SETB  ('&UACC' EQ 'EXECUTE')                              @M1A 15950000
&UACC5   SETB  0                                                   @L4A 15960000
&UACC6   SETB  0                                                   @L4A 15970000
&UACC7   SETB  ('&UACC' EQ 'NONE' OR '&UACC' EQ 'EXECUTE')         @M1A 15980000
&UACCVAL SETA  128*&UACC0+64*&UACC1+32*&UACC2+16*&UACC3+8*&UACC4+1*&UACX15990000
               C7                                                  @M1A 16000000
         MVI   36(1),&UACCVAL MOVE UACC VALUE INTO PARAMETER.      @L4A 16010000
.RDEF630 ANOP  ,                                                   @L4A 16020000
         AIF   ('&LEVEL' EQ '').RDEF650                            @L4A 16030000
         AIF   ('&LEVEL'(1,1) NE '(').RDEF640                      @L4A 16040000
         STC   &LEVEL(1),37(1) - STORE LEVEL VALUE.                @L4A 16050000
         AGO   .RDEF650                                            @L4A 16060000
.RDEF640 ANOP  ,                                                   @L4A 16070000
         AIF   (T'&LEVEL(1) EQ 'N' AND K'&LEVEL(1) LE 2).RDEF641   @L4A 16080000
         AGO   .ERR12                                              @L4A 16090000
.ERTN12  ANOP  ,                                                   @L4A 16100000
.RDEF641 ANOP  ,                                                   @L4A 16110000
         MVI   37(1),&LEVEL - MOVE LEVEL VALUE INTO PARAMETER.     @L4A 16120000
.RDEF650 ANOP  ,                                                   @L4A 16130000
         AIF   ('&AUDIT' EQ '').RDEF670                            @L4A 16140000
         AIF   ('&AUDITRG' EQ '').RDEF660                          @L5A 16150000
         STC   &AUDITRG,38(1) - STORE AUDIT VALUE.                 @L5A 16160000
         AGO   .RDEF670                                            @L4A 16170000
.RDEF660 ANOP  ,                                                   @L4A 16180000
         MVI   38(1),&AUDITVL MOVE AUDIT VALUE INTO PARAMETER.     @L4A 16190000
.RDEF670 ANOP  ,                                                   @L4A 16200000
         AIF   ('&RACFIND' EQ '' AND '&CHKAUTH' EQ '' AND '&WARNING' EQ*16210000
                '' AND '&GENERIC' EQ '' AND '&DSTYPE' NE 'T' AND       *16220000
               '&ERASE' NE '' AND '&MGENER' EQ '').RDEF6           @L7A 16230000
.* PRODUCE SECOND FLAG BYTE                                        @L5A 16240000
.* INITIALIZE BIT SET VARIABLES                                         16250000
&BITA1   SETA  1                                                   @L5A 16260000
&BITA2   SETA  1                                                   @L5A 16270000
&BITA3   SETA  1                                                   @L7A 16280000
&BITA4   SETA  1                                                   @L7A 16290000
&BITA5   SETA  1                                                   @L7A 16300000
&BITA6   SETA  1                                                   @L6A 16310000
&BITA7   SETA  1                                                   @L6A 16320000
&BIT0    SETA  0                                                   @L5A 16330000
&BIT1    SETA  0                                                   @L5A 16340000
&BIT2    SETA  0                                                   @L5A 16350000
&BIT3    SETA  0                                                   @L6A 16360000
&BIT4    SETA  0                                                   @L6A 16370000
&BIT5    SETA  0                                                   @L6A 16380000
&BIT6    SETA  0                                                   @L6A 16390000
&BIT7    SETA  0                                                   @L6A 16400000
         AIF   ('&RACFIND' NE 'NO').RDEF671                        @L5A 16410000
&BITA1   SETA  0            RACFIND=NO SPECIFIED                   @L5A 16420000
.RDEF671 ANOP                                                      @L5A 16430000
         AIF   ('&CHKAUTH' NE 'NO').RDEF672                        @L5A 16440000
&BITA2   SETA  0            CHKAUTH=NO SPECIFIED                   @L5A 16450000
.RDEF672 ANOP                                                      @L5A 16460000
         AIF   ('&WARNING' NE 'NO').RDEF673                        @L6A 16470000
&BITA6   SETA  0            WARNING=NO SPECIFIED                   @L6A 16480000
.RDEF673 ANOP  ,                                                   @L6A 16490000
         AIF   ('&GENERIC' NE 'ASIS').RDEF674                      @L6A 16500000
&BITA7   SETA  0            GENERIC=ASIS SPECIFIED                 @L6A 16510000
.RDEF674 ANOP  ,                                                   @L6A 16520000
         AIF   (&RLVL LE 2).RDEFZ15 BYPASS CODE IF 1.6 RELEASE     @L7A 16530000
         AIF   ('&DSTYPE' EQ 'T' OR '&DSTYPE' EQ '').RDEFZ05       @L7A 16540000
&BITA3   SETA   0                                                  @L7A 16550000
.RDEFZ05 ANOP                                                      @L7A 16560000
         AIF   ('&ERASE' NE 'NO').RDEFZ10                          @L7A 16570000
&BITA4   SETA  0            ERASE=NO SPECIFIED                     @L7A 16580000
.RDEFZ10 ANOP                                                      @L7A 16590000
         AIF   ('&MGENER' NE 'ASIS').RDEFZ15                       @L7A 16600000
&BITA5   SETA  0            MGENER=ASIS SPECIFIED                  @L7A 16610000
.RDEFZ15 ANOP                                                      @L7A 16620000
         AIF   ('&BITA1&BITA2&BITA3&BITA4&BITA5&BITA6&BITA7' EQ        -16630000
               '1111111').RDEF6                                    @L7A 16640000
         NI    39(1),B'1&BITA1&BITA2&BITA3&BITA4&BITA5&BITA6&BITA7'    X16650000
                                                                   @L7A 16660000
.RDEF6   ANOP                                                      @L7A 16670000
         AIF   ('&RACFIND' EQ '').RDEF676                          @L6A 16680000
&BIT0    SETA  1            RACFIND CODED                          @L5A 16690000
         AIF   ('&RACFIND' NE 'YES').RDEF676                       @L6A 16700000
&BIT1    SETA  1            RACFIND=YES SPECIFIED                  @L5A 16710000
.RDEF676 ANOP                                                      @L6A 16720000
         AIF   ('&CHKAUTH' NE 'YES').RDEF677                       @L6A 16730000
&BIT2    SETA  1            CHKAUTH=YES SPECIFIED                  @L5A 16740000
.RDEF677 ANOP                                                      @L6A 16750000
         AIF   ('&WARNING' NE 'YES').RDEF678                       @L6A 16760000
&BIT6    SETA  1            WARNING=YES SPECIFIED                  @L6A 16770000
.RDEF678 ANOP  ,                                                   @L6A 16780000
         AIF   ('&GENERIC' NE 'YES').RDEF679                       @L6A 16790000
&BIT7    SETA  1            GENERIC=YES SPECIFIED                  @L6A 16800000
.RDEF679 ANOP  ,                                                   @L6A 16810000
         AIF   (&RLVL LE 2).RDEFZ30   BYPASS CODE IF 1.6 RELEASE   @L7A 16820000
         AIF   ('&DSTYPE' NE 'T').RDEFZ20                          @L7A 16830000
&BIT3    SETA  1            DSTYPE=T SPECIFIED                     @L7A 16840000
.RDEFZ20 ANOP                                                      @L7A 16850000
         AIF   ('&ERASE' NE 'YES').RDEFZ25                         @L7A 16860000
&BIT4    SETA  1            ERASE=YES SPECIFIED                    @L7A 16870000
.RDEFZ25 ANOP                                                      @L7A 16880000
         AIF   ('&MGENER' NE 'YES').RDEFZ30                        @L7A 16890000
&BIT5    SETA  1            MGENER=YES SPECIFIED                   @L7A 16900000
.RDEFZ30 ANOP                                                      @L7A 16910000
         AIF   ('&BIT0&BIT1&BIT2&BIT3&BIT4&BIT5&BIT6&BIT7' EQ          -16920000
               '00000000').RD6                                     @L7A 16930000
         OI    39(1),B'&BIT0&BIT1&BIT2&BIT3&BIT4&BIT5&BIT6&BIT7'   @L7A 16940000
.RD6     ANOP                                                      @L7A 16950000
         AIF   ('&OWNER' EQ '').RDEF690                            @L4A 16960000
         AIF   ('&OWNER'(1,1) NE '(').RDEF681                      @L6A 16970000
         ST    &OWNER(1),40(1) - STORE OWNER ADDRESS.              @L4A 16980000
         AGO   .RDEF690                                            @L4A 16990000
.RDEF681 ANOP  ,                                                   @L6A 17000000
         LA    0,&OWNER -     MOVE OWNER ADDRESS                   @L4A 17010000
         ST    0,40(1) -        INTO PARAMETER.                    @L4A 17020000
.RDEF690 ANOP  ,                                                   @L4A 17030000
         AIF   ('&DATA' EQ '').RDEF710                             @L4A 17040000
         AIF   ('&DATA'(1,1) NE '(').RDEF700                       @L4A 17050000
         ST    &DATA(1),44(1) - STORE DATA ADDRESS.                @L4A 17060000
         AGO   .RDEF710                                            @L4A 17070000
.RDEF700 ANOP  ,                                                   @L4A 17080000
         LA    0,&DATA -      MOVE DATA ADDRESS                    @L4A 17090000
         ST    0,44(1) -        INTO PARAMETER.                    @L4A 17100000
.RDEF710 ANOP  ,                                                   @L4A 17110000
         AIF   (&RLVL LE 2).RDEF900    BYPASS CODE IF 1.6 RELEASE  @M1A 17120000
         AIF   ('&ACCLVL' EQ '').RDEF730                           @L7A 17130000
         AIF   (T'&ACCLVL(1) EQ 'O').RDEF720                       @L7A 17140000
         AIF   ('&ACCLVL(1)'(1,1) NE '(').RDEF715                  @L7A 17150000
         ST    &ACCLVL(1),56(1) - STORE ACCESS LEVEL PART ONE      @L7A 17160000
         AGO   .RDEF720                                            @L7A 17170000
.RDEF715 ANOP                                                      @L7A 17180000
         LA    0,&ACCLVL(1) -      MOVE ACCLVL PART ONE ADDRESS    @L7A 17190000
         ST    0,56(1)               INTO PARAMETER.               @L7A 17200000
.RDEF720 ANOP                                                      @L7A 17210000
         AIF   (T'&ACCLVL(2) EQ 'O').RDEF730                       @L7A 17220000
         AIF   ('&ACCLVL(2)'(1,1) NE '(').RDEF725                  @L7A 17230000
         ST    &ACCLVL(2),60(1) - STORE ACCESS LEVEL PART TWO      @L7A 17240000
         AGO   .RDEF730                                            @L7A 17250000
.RDEF725 ANOP                                                      @L7A 17260000
         LA    0,&ACCLVL(2) -      MOVE ACCLVL PART TWO ADDRESS    @L7A 17270000
         ST    0,60(1)               INTO PARAMETER.               @L7A 17280000
.RDEF730 ANOP                                                      @L7A 17290000
         AIF   ('&SECLVL' EQ '').RDEF740                           @L7A 17300000
         AIF   ('&SECLVL'(1,1) NE '(').RDEF735                     @L7A 17310000
         ST    &SECLVL(1),64(1) - STORE SECURITY LEVEL ADDRESS     @L7A 17320000
         AGO   .RDEF740                                            @L7A 17330000
.RDEF735 ANOP                                                      @L7A 17340000
         LA    0,&SECLVL -          MOVE SECLVL ADDRESS            @L7A 17350000
         ST    0,64(1)                INTO PARAMETER.              @L7A 17360000
.RDEF740 ANOP                                                      @L7A 17370000
         AIF   ('&CATGORY' EQ '').RDEF750                          @L7A 17380000
         AIF   ('&CATGORY'(1,1) NE '(').RDEF745                    @L7A 17390000
         ST    &CATGORY(1),68(1) - STORE CATEGORY LIST ADDRESS     @L7A 17400000
         AGO   .RDEF750                                            @L7A 17410000
.RDEF745 ANOP                                                      @L7A 17420000
         LA    0,&CATGORY -          MOVE CATEGORY ADDRESS         @L7A 17430000
         ST    0,68(1)                INTO PARAMETER.              @L7A 17440000
.RDEF750 ANOP                                                      @L7A 17450000
         AIF   ('&EXPDT' EQ '').RDEF756                            @L8A 17460000
         AIF   ('&EXPDT'(1,1) NE '(').RDEF755                      @L7A 17470000
         ST    &EXPDT(1),72(1) - STORE EXPIRATION DATE ADDRESS     @L7A 17480000
         AGO   .RDEF770                                            @L7A 17490000
.RDEF755 ANOP                                                      @L7A 17500000
         LA    0,&EXPDT -           MOVE EXPIRATION DATE ADDRESS   @L7A 17510000
         ST    0,72(1)                INTO PARAMETER.              @L7A 17520000
         AGO   .RDEF770                                            @L7A 17530000
.RDEF756 ANOP                                                      @L7A 17540000
         AIF   ('&EXPDTX' EQ '').RDEF760                           @L8A 17550000
         AIF   ('&EXPDTX'(1,1) NE '(').RDEF758                     @L8A 17560000
         ST    &EXPDTX(1),72(1) - STORE EX EXPIRATION DATE ADDRESS @L8A 17570000
         AGO   .RDEF770                                            @L8A 17580000
.RDEF758 ANOP                                                      @L8A 17590000
         LA    0,&EXPDTX -       MOVE EX EXPIRATION DATE ADDRESS   @L8A 17600000
         ST    0,72(1)                INTO PARAMETER.              @L8A 17610000
         AGO   .RDEF770                                            @L8A 17620000
.RDEF760 ANOP                                                      @L7A 17630000
         AIF   ('&RETPD' EQ '').RDEF770                            @L7A 17640000
         AIF   ('&RETPD'(1,1) NE '(').RDEF765                      @L7A 17650000
         ST    &RETPD(1),72(1) - STORE RETENTION PERIOD ADDRESS    @L7A 17660000
         AGO   .RDEF770                                            @L7A 17670000
.RDEF765 ANOP                                                      @L7A 17680000
         LA    0,&RETPD -           MOVE RETENTION PERIOD ADDRESS  @L7A 17690000
         ST    0,72(1)                INTO PARAMETER.              @L7A 17700000
.RDEF770 ANOP                                                      @L7A 17710000
         AIF   ('&FILESEQ' EQ '').RDEF780                          @L7A 17720000
         AIF   ('&FILESEQ'(1,1) NE '(').RDEF775                    @L7A 17730000
         STH   &FILESEQ(1),76(1) -  STORE FILE SEQUENCE NUMBER     @L7A 17740000
         AGO   .RDEF780                                            @L7A 17750000
.RDEF775 ANOP                                                      @L7A 17760000
         ICM   0,3,=AL2(&FILESEQ)   MOVE FILE SEQUENCE NUMBER      @L7A 17770000
         STH   0,76(1)                INTO PARAMETER.              @L7A 17780000
.RDEF780 ANOP                                                      @L7A 17790000
.* PRODUCE TAPE FLAG BYTE                                          @L7A 17800000
&BIT0    SETA  0                                                   @L7A 17810000
&BIT1    SETA  0                                                   @L7A 17820000
&BIT7    SETA  0                                                   @L7A 17830000
&BITA0   SETA  1                                                   @L7A 17840000
&BITA1   SETA  1                                                   @L7A 17850000
&BITA7   SETA  1                                                   @L7A 17860000
         AIF   ('&TAPELBL' EQ '' AND '&RETPD' EQ '' AND '&EXPDT' EQ    -17870000
               '' AND '&EXPDTX' EQ '').RDEF795                     @L8A 17880000
         AIF   ('&TAPELBL' EQ '').RDEF781                          @L7A 17890000
&BITA0   SETA  0                         TAPELBL=STD SPECIFIED     @L7A 17900000
&BITA1   SETA  0                                                   @L7A 17910000
.RDEF781 ANOP                                                      @L7A 17920000
         AIF   ('&RETPD' EQ '').RDEF782                            @L7A 17930000
&BITA7   SETA  0                           EXPDT SPECIFIED         @L7A 17940000
.RDEF782 ANOP                                                      @L7A 17950000
         NI    78(1),B'&BITA0&BITA1.11111&BITA7'                   @L7A 17960000
.RDEF785 ANOP                                                      @L7A 17970000
         AIF   ('&TAPELBL' EQ 'STD' OR '&TAPELBL' EQ '').RDEF790   @L7A 17980000
         AIF   ('&TAPELBL' NE 'BLP').RDEF786                       @L7A 17990000
&BIT0    SETA  1                                                   @L7A 18000000
         AGO   .RDEF790                                            @L7A 18010000
.RDEF786 ANOP                                                      @L7A 18020000
&BIT1    SETA  1                                                   @L7A 18030000
.RDEF790 ANOP                                                      @L7A 18040000
         AIF   ('&EXPDTX' EQ '').RDEF791                           @L8A 18050000
&BIT6    SETA  1                                                   @L8A 18060000
&BIT7    SETA  1                                                   @P6A 18070000
         AGO   .RDEF792                                            @L8A 18080000
.RDEF791 ANOP                                                      @L8A 18090000
         AIF   ('&EXPDT' EQ '').RDEF792                            @L7A 18100000
&BIT7    SETA  1                                                   @L7A 18110000
.RDEF792 ANOP                                                      @L7A 18120000
         OI    78(1),B'&BIT0&BIT1.0000&BIT6&BIT7'                  @L8A 18130000
.RDEF795 ANOP                                                      @L7A 18140000
.* PRODUCE MCLASS ADDRESS                                          @L7A 18150000
         AIF   ('&MCLASS' EQ '').RDEF810                           @L7A 18160000
         AIF   ('&MCLASS'(1,1) EQ '''').ERR024                     @L7A 18170000
         AIF   ('&MCLASS'(1,1) NE '(').RDEF800                     @L7A 18180000
         ST    &MCLASS(1),80(1) - STORE MCLASS ADDRESS             @L7A 18190000
         AGO   .RDEF810                                            @L7A 18200000
.RDEF800 ANOP                                                      @L7A 18210000
         LA    0,&MCLASS - MOVE MCLASS ADDRESS                     @L7A 18220000
         ST    0,80(1)   - INTO PARAMETER LIST                     @L7A 18230000
.ERTN024 ANOP                                                      @L7A 18240000
.RDEF810 ANOP                                                      @L7A 18250000
.* PRODUCE NOTIFY ID ADDRESS                                       @L7A 18260000
         AIF   ('&NOTIFY' EQ '').RDEF820                           @L7A 18270000
         AIF   ('&NOTIFY'(1,1) NE '(').RDEF815                     @L7A 18280000
         ST    &NOTIFY,84(1) - STORE NOTIFY ID ADDRESS             @L7A 18290000
         AGO   .RDEF820                                            @L7A 18300000
.RDEF815 ANOP                                                      @L7A 18310000
         LA    0,&NOTIFY - MOVE NOTIFY ID ADDRESS                  @L7A 18320000
         ST    0,84(1)   - INTO PARAMETER LIST                     @L7A 18330000
.RDEF820 ANOP                                                      @L7A 18340000
         AIF   (&RLVL LT 4).RDEF900         LOWER THAN V1.8        @M1A 18350000
         AIF   ('&STORCLA' EQ '').RDEF830                          @M1A 18360000
         AIF   ('&STORCLA'(1,1) NE '(').RDEF825                    @M1A 18370000
         ST    &STORCLA,88(1) - STORE STORAGE CLASS ADDRESS        @M1A 18380000
         AGO   .RDEF830                                            @M1A 18390000
.RDEF825 ANOP                                                      @M1A 18400000
         LA    0,&STORCLA - MOVE STORAGE CLASS ADDRESS             @M1A 18410000
         ST    0,88(1)   - INTO PARAMETER LIST                     @M1A 18420000
.RDEF830 ANOP                                                      @M1A 18430000
         AIF   ('&MGMTCLA' EQ '').RDEF840                          @M1A 18440000
         AIF   ('&MGMTCLA'(1,1) NE '(').RDEF835                    @M1A 18450000
         ST    &MGMTCLA,92(1) - STORE MANAGEMENT CLASS ADDRESS     @M1A 18460000
         AGO   .RDEF840                                            @M1A 18470000
.RDEF835 ANOP                                                      @M1A 18480000
         LA    0,&MGMTCLA - MOVE MANAGEMENT CLASS ADDRESS          @M1A 18490000
         ST    0,92(1)   - INTO PARAMETER LIST                     @M1A 18500000
.RDEF840 ANOP                                                      @M1A 18510000
         AIF   ('&RESOWN' EQ '').RDEF850                           @M1A 18520000
         AIF   ('&RESOWN'(1,1) NE '(').RDEF845                     @M1A 18530000
         ST    &RESOWN,96(1) - STORE RESOURCE OWNER ADDRESS        @M1A 18540000
         AGO   .RDEF850                                            @M1A 18550000
.RDEF845 ANOP                                                      @M1A 18560000
         LA    0,&RESOWN - MOVE RESOURCE OWNER ADDRESS             @M1A 18570000
         ST    0,96(1)   - INTO PARAMETER LIST                     @M1A 18580000
.RDEF850 ANOP                                                      @M1A 18590000
&BIT0    SETA  0             to modify-initialize the bits needed  @M3A 18600000
&BITA0   SETA  1             to turn on and off the flags          @M3A 18610000
&BIT1    SETA  0             for environment, entity, model        @M3A 18620000
&BITA1   SETA  1             entity and new name. The bita's       @M3A 18630000
&BIT2    SETA  0             turn off the flags and bit's          @M3A 18640000
&BITA2   SETA  1             turn on the flags. Initialize the     @M3A 18650000
&BIT3    SETA  0             bits for nochange.                    @M3A 18660000
&BITA3   SETA  1             BIT'S=>OI          BITA'S=>NI         @M3A 18670000
         AIF   ('&ENVIR' EQ '').RDEF851                            @M1A 18680000
&BIT0    SETA  1                                                   @M3A 18690000
.RDEF851 ANOP                                                  @YA12773 18700000
         AIF   ('&ENTITY' EQ '').SKIPAA0     entity specified      @M3A 18710000
&BITA1   SETA  0                             turn off the flag     @M3A 18720000
.SKIPAA0 ANOP                                                      @M3A 18730000
         AIF   ('&ENTITYX' EQ '').SKIPAA1    entityx specified     @M3A 18740000
&BIT1    SETA  1                             turn on the flag      @M3A 18750000
.SKIPAA1 ANOP                                                      @M3A 18760000
         AIF   ('&MENTITY' EQ '').SKIPAA2    model entity          @M3A 18770000
&BITA2   SETA  0                       specified turn off the flag @M3A 18780000
.SKIPAA2 ANOP                                                      @M3A 18790000
         AIF   ('&MENTX' EQ '').SKIPAA3      mentx specified       @M3A 18800000
&BIT2    SETA  1                             turn on the flag      @M3A 18810000
.SKIPAA3 ANOP                                                      @M3A 18820000
         AIF   ('&NEWNAME' EQ '').SKIPAA4    newname specified     @M3A 18830000
&BITA3   SETA  0                             turn the flag off     @M3A 18840000
.SKIPAA4 ANOP                                                      @M3A 18850000
         AIF   ('&NEWNAMX' EQ '').SKIPAA5    newnamx specified     @M3A 18860000
&BIT3    SETA  1                             turn the flag on      @M3A 18870000
.SKIPAA5 ANOP                                                      @M3A 18880000
.*   if no flag is to be turned off then goto skipaa6              @M3A 18890000
         AIF   ('&BITA0&BITA1&BITA2&BITA3' EQ '1111').SKIPAA6      @M3A 18900000
         NI    100(1),B'&BITA0&BITA1&BITA2&BITA3.1111'             @M3A 18910000
.SKIPAA6 ANOP                                                      @M3A 18920000
.*   if no flag is to be turned on then goto skipaa7               @M3A 18930000
         AIF   ('&BIT0&BIT1&BIT2&BIT3' EQ '0000').SKIPAA7          @M3A 18940000
         OI    100(1),B'&BIT0&BIT1&BIT2&BIT3.0000'                 @M3A 18950000
.SKIPAA7 ANOP                                                      @M3A 18960000
         AIF   ('&DDNAME' EQ '').RDEF860                       @YA12773 18970000
         AIF   ('&DDNAME'(1,1) NE '(').RDEF852                 @YA12773 18980000
         ST    &DDNAME,104(1) - STORE DDNAME ADDRESS           @YA12773 18990000
         AGO   .RDEF860                                        @YA12773 19000000
.RDEF852 ANOP                                                  @YA12773 19010000
         LA    0,&DDNAME - MOVE DDNAME ADDRESS                 @YA12773 19020000
         ST    0,104(1)   - INTO THE PARAMETER LIST            @YA12773 19030000
.RDEF860 ANOP                                                      @M1A 19040000
         AIF   ('&SECLABL' EQ '').RDEF870                          @M2A 19050000
         AIF   ('&SECLABL'(1,1) NE '(').RDEF865                    @M2A 19060000
         ST    &SECLABL,108(1) - STORE SECURITY LABEL ADDRESS      @M2A 19070000
         AGO   .RDEF870                                            @M2A 19080000
.RDEF865 ANOP                                                      @M2A 19090000
         LA    0,&SECLABL - MOVE SECURITY LABEL ADDRESS            @M2A 19100000
         ST    0,108(1)   - INTO THE PARAMETER LIST                @M2A 19110000
.RDEF870 ANOP                                                      @M2A 19120000
.RDEF900 ANOP                                                      @M1A 19130000
.* PRODUCE ENTRY LOGIC & EXIT                                           19140000
         AGO   .RDEF330                                                 19150000
.* DIAGNOSTIC MESSAGES                                                  19160000
.ERR01   ANOP                                                           19170000
         MNOTE 8,'*** INVALID DSTYPE PARAMETER ***'                     19180000
         AGO   .ERTN01                                                  19190000
.ERR01B  ANOP                                                      @L7A 19200000
         MNOTE 8,'*** INVALID MGENER PARAMETER ***'                @L7A 19210000
         AGO   .ERTN01B                                            @L7A 19220000
.ERR02   ANOP                                                           19230000
         MNOTE 8,'*** INVALID TYPE PARAMETER ***'                       19240000
         AGO   .ERTN02                                                  19250000
.ERR03   ANOP                                                           19260000
         MNOTE 8,'*** REGISTER SPECIFICATION NOT VALID, LIST FORM ***'  19270000
         AGO   .ERTN03                                                  19280000
.ERR05   ANOP                                                           19290000
         MNOTE 8,'*** ONLY REGS 2-12 ALLOWED FOR PARAMETERS ***'        19300000
         AGO   .ERTN05                                                  19310000
.ERR06   ANOP                                                           19320000
         MNOTE 8,'*** INVALID MF PARAMETER ***'                         19330000
         AGO   .ERTN06                                                  19340000
.ERR07   ANOP                                                           19350000
         MNOTE 8,'*** &CHAR PARAMETER ONLY VALID WITH TYPE=DEFINE ***'  19360000
         AGO   .ERTN07                                                  19370000
.ERR08   ANOP                                                  @PC002PY 19380000
         MNOTE 8,'*** ''CLASSNAME'' FORM NOT ALLOWED WITH MF=E ***'     19390000
         AGO   .ERTN08                                         @PC002PY 19400000
.ERR09   ANOP  ,                                                   @L4A 19410000
         MNOTE 8,'*** INVALID UACC PARAMETER ***'                  @L4A 19420000
         AGO   .ERTN09                                             @L4A 19430000
.ERR10   ANOP  ,                   HANDLE V1R4 REGISTER NOTATION   @L5A 19440000
         AIF   (N'&AUDIT NE 1 OR '&AUDIT(1)' EQ '&AUDIT').ERR10M   @L5A 19450000
&AUDITRG SETC  '&AUDIT(1)'         SET V1R4 REGISTER "NAME"        @L5A 19460000
         AGO   .ERTN10                                             @L5A 19470000
.ERR10M  ANOP                                                      @L5A 19480000
         MNOTE 8,'*** INVALID AUDIT PARAMETER ***'                 @L4A 19490000
         AGO   .ERTN10                                             @L4A 19500000
.ERR11   ANOP  ,                                                   @L4A 19510000
         MNOTE 8,'*** INVALID LEVEL PARAMETER ***'                 @L4A 19520000
         AGO   .ERTN11                                             @L4A 19530000
.ERR12   ANOP  ,                                                   @L4A 19540000
         MNOTE 8,'*** INVALID LEVEL PARAMETER ***'                 @L4A 19550000
         AGO   .ERTN12                                             @L4A 19560000
.ERR13   ANOP  ,                                                   @L4A 19570000
         MNOTE 8,'*** ONLY YES OR NO ALLOWED ***'                  @L4A 19580000
         AGO   .ERTN13                                             @L4A 19590000
.ERR14   ANOP  ,                                                   @L5A 19600000
         MNOTE 8,'*** INVALID RACFIND PARAMETER ***'               @L5A 19610000
         AGO   .ERTN14                                             @L5A 19620000
.ERR15   ANOP  ,                                                   @L5A 19630000
         MNOTE 8,'*** INVALID CHKAUTH PARAMETER ***'               @L5A 19640000
         AGO   .ERTN15                                             @L5A 19650000
.ERR16   ANOP  ,                                                   @L6A 19660000
         MNOTE 8,'*** INVALID WARNING PARAMETER ***'               @L6A 19670000
         AGO   .ERTN16                                             @L6A 19680000
.ERR17   ANOP  ,                                                   @L6A 19690000
         MNOTE 8,'*** INVALID GENERIC PARAMETER ***'               @L6A 19700000
         AGO   .ERTN17                                             @L6A 19710000
.ERR18   ANOP                                                      @L7A 19720000
         MNOTE 8,'*** INVALID TAPE LABEL PARAMETER ***'            @L7A 19730000
         AGO   .ERTN18                                             @L7A 19740000
.ERR19   ANOP                                                      @L7A 19750000
         MNOTE 8,'** INVALID ERASE PARAMETER ***'                  @L7A 19760000
         AGO   .ERTN19                                             @L7A 19770000
.ERR020  ANOP                                                      @L7A 19780000
         MNOTE 8,'*** ''NEWNAME OR NEWNAMX'' PARAMETER CANNOT BE SPECIF-19790000
               IED WITH DS TYPE=T'                                 @M3C 19800000
         AGO   .ERTN020                                            @L7A 19810000
.ERR021  ANOP                                                      @L7A 19820000
         MNOTE 8,'*** TYPE PARAMETER ''CHGVOL'' MAY NOT BE SPECIFIED WI-19830000
               TH DSTYPE=T'                                        @L7A 19840000
         AGO   .ERTN021                                            @L7A 19850000
.ERR22   ANOP                                                      @L7A 19860000
         MNOTE 8,'*** EITHER ''EXPDT'' OR ''RETPD'' BUT NOT BOTH MAY BE-19870000
                CODED'                                             @L7A 19880000
         AGO   .ERTN22                                             @L7A 19890000
.ERR22A  ANOP                                                      @L7A 19900000
         MNOTE 8,'*** EITHER ''EXPDT'' OR ''EXPDTX'' BUT NOT BOTH MAY B-19910000
               E CODED'                                            @L8A 19920000
         AGO   .ERTN22A                                            @L7A 19930000
.ERR22B  ANOP                                                      @L7A 19940000
         MNOTE 8,'*** EITHER ''RETPD'' OR ''EXPDTX'' BUT NOT BOTH MAY B-19950000
               E CODED'                                            @L8A 19960000
         AGO   .ERTN22B                                            @L7A 19970000
.ERR024  ANOP                                                      @L7A 19980000
         MNOTE 8,'''MCLASSNAME'' FORM NOT ALLOWED WITH MF=E'       @L7A 19990000
         AGO   .ERTN024                                            @L7A 20000000
.ERR25   ANOP                                                      @M1A 20010000
         MNOTE 8,'*** INVALID ENVIR PARAMETER ***'                 @M1A 20020000
         AGO   .ERTN25                                            3@P4D 20030000
.ERR27   ANOP                                                      @M1A 20040000
         MNOTE 8,'*** RESOWN IS REQUIRED FOR ''STORCLA''/''MGMTCLA'' **X20050000
                *'                                                 @M1A 20060000
         AGO   .ERTN27                                             @M1A 20070000
.*                                                                 @M3A 20080000
.ERR28   ANOP                                                      @M3A 20090000
         MNOTE 8,'*** ENTITY AND ENTITYX ARE MUTUALLY EXCLUSIVE KEYWORDX20100000
               S ***'                                              @M3A 20110000
         AGO   .ERTN28                                             @M3A 20120000
.*                                                                 @M3A 20130000
.ERR29   ANOP                                                      @M3A 20140000
         MNOTE 8,'***  MENTITY AND MENTX ARE MUTUALLY EXCLUSIVE KEYWORDX20150000
               S ***'                                              @M3A 20160000
         AGO   .ERTN29                                             @M3A 20170000
.*                                                                 @M3A 20180000
.ERR30   ANOP                                                      @M3A 20190000
         MNOTE 8,'*** NEWNAME AND NEWNAMX ARE MUTUALLY EXCLUSIVE KEYWORX20200000
               DS ***'                                             @M3A 20210000
         AGO   .ERTN30                                             @M3A 20220000
.*                                                                 @M3A 20230000
.ERR31   ANOP                                                      @M3A 20240000
         MNOTE 8,'*** "ENTITYX" IS SUPPORTED BY RELEASE 1.9 AND LATER OX20250000
               NLY, ENTITYX IS IGNORED ***'                        @M3A 20260000
         AGO   .ERTN31                                             @M3A 20270000
.*                                                                 @M3A 20280000
.ERR32   ANOP                                                      @M3A 20290000
         MNOTE 8,'*** "MENTX" IS SUPPORTED BY RELEASE 1.9 AND LATER ONLX20300000
               Y, MENTX IS IGNORED ***'                            @M3A 20310000
         AGO   .ERTN32                                             @M3A 20320000
.*                                                                 @M3A 20330000
.ERR33   ANOP                                                      @M3A 20340000
         MNOTE 8,'*** "NEWNAMX" IS SUPPORTED BY RELEASE 1.9 AND LATER OX20350000
               NLY, NEWNAMX IS IGNORED ***'                        @M3A 20360000
         AGO   .ERTN33                                             @M3A 20370000
.*                                                                 @M3A 20380000
.ERR34   ANOP                                                      @M3A 20390000
         MNOTE 8,'*** RACDEF CAN BE INVOKED ONLY VIA RACROUTE FOR RELEAX20400000
               SE 1.9 AND LATER ***'                               @M3A 20410000
         AGO   .ERTN34                                             @M3A 20420000
.*                                                                 @M3A 20430000
.ERR35   ANOP                                                      @P3A 20440000
         MNOTE 8,'*** EITHER ''ENTITY'' OR ''ENTITYX'' MUST BE SPECIFIEX20450000
               D IN STANDARD FORM WITH RELEASE 1.9 AND LATER ***'  @P3A 20460000
         AGO   .ERTN35                                             @P3A 20470000
.*                                                                 @P3A 20480000
.ERR36   MNOTE 4,'*** POSSIBLE TRUNCATION OF FILESEQ NUMBER ***'   @P7C 20490000
         AGO   .ERTN36                                             @MGA 20500000
.*                                                                 @MGA 20510000
.ERLVL1  MNOTE 8,'*** INCORRECT SPECIFICATION OF ''RELEASE'' ***'  @L7A 20520000
         AGO   .ERLVL1R                                            @L7A 20530000
.ERLVL2  MNOTE 4,'*** ''RELEASE-CHECK'' ONLY VALID WITH ''MF=E'' ***'  X20540000
                                                                   @L7A 20550000
         AGO   .ERLVL2R                                            @L7A 20560000
.ERLVLA  MNOTE 4,'*** ''RELEASE'' INCOMPATIBLE WITH SPECIFIED KEYWORD(SX20570000
               ) ***'                                              @L7A 20580000
         AGO   .ERLVLAR                                            @L7A 20590000
.ERLVLB  MNOTE 4,'*** ''RELEASE'' INCOMPATIBLE WITH SPECIFIED KEYWORD(SX20600000
               ) ***'                                              @L8A 20610000
         AGO   .ERLVLBR                                            @L8A 20620000
.ERLVLC  MNOTE 4,'*** ''RELEASE'' INCOMPATIBLE WITH SPECIFIED KEYWORD(SX20630000
               ) ***'                                              @M2A 20640000
         AGO   .ERLVLCR                                            @M2A 20650000
.ERLVLD  MNOTE 4,'*** ''RELEASE'' INCOMPATIBLE WITH SPECIFIED KEYWORD(SX20660000
               ) ***'                                              @M3A 20670000
         AGO   .ERLVLDR                                            @M3A 20680000
.ERLVLE  MNOTE 4,'*** ''RELEASE'' INCOMPATIBLE WITH SPECIFIED KEYWORD(SX20690000
               ) ***'                                              @M3A 20700000
         AGO   .ERLVLER                                            @M3A 20710000
.* DIAGNOSTICS COMPLETE                                                 20720000
         MEND                                                           20730000
                                                                        20740000
