*********START OF SPECIFICATIONS*************************************** 00010000
*                                                                    *  00020002
* $MAC(RACHECK) COMP(SC1BN) PROD(RACF):                              *  00030000
*                                                                    *  00040000
* DESCRIPTIVE NAME:                                                  *  00050000
*   AUTHORIZATION CHECKING INTERFACE                                 *  00060000
*                                                                    *  00070000
* *01* PROPRIETARY STATEMENT=                                         * 00080000
*  **PROPRIETARY_STATEMENT********************************************* 00090000
*                                                                     * 00100000
*                                                                     * 00110000
*   Licensed Materials - Property of IBM                              * 00120007
*   5650-ZOS Copyright IBM Corp. 1977, 2019                           * 00130007
*                                                                     * 00140000
*   STATUS= HBB77C0                                                   * 00150001
*                                                                     * 00160000
*  **END_OF_PROPRIETARY_STATEMENT************************************** 00170000
*                                                                    *  00180000
*01* EXTERNAL CLASSIFICATION:                                        *  00190000
*02* GUPI:                                                           *  00200000
*01* END OF EXTERNAL CLASSIFICATION:                                 *  00210000
*                                                                    *  00220000
*                                                                       00230000
* FUNCTION:                                                             00240000
*   THIS MACRO ALLOWS THE CALLER TO CHECK A USER'S AUTHORIZATION        00250000
*   TO A RESOURCE.                                                 @L5A 00260000
*                                                                       00270000
*                                                                       00280003
* CHANGE ACTIVITY:                                                      00290000
*   RACF VERSION 1 RELEASE 2                                   @PC002PY 00300000
*   RACF VERSION 1 RELEASE 3                                   @PC003PY 00310000
*   $L4=HRF1402,RACF/140,810701,SJRDSD:                            @L4A 00320000
*   OZ56981                                                    @ZA56981 00330000
*   OZ60572                                                    @ZA60572 00340000
*   $T1=UZ90210,SAF/RF15,810702,CNTDSD:                            @T1A 00350000
*   $L5=HRF1502,RACF/150,811218,CNTDSD:                            @L5A 00360000
*   OZ59764                                                    @ZA59764 00370000
*   $L6=HRF1602,RACF/160,830307,CNTDSD:                            @L6A 00380000
*   UZ90283                                                    @ZA90283 00390000
*   UZ90284                                                    @ZA90284 00400000
*   UZ90285                                                    @ZA90285 00410000
*   $L7=HRF1702,RACF/170,840601,CNTDSD:                            @L7A 00420000
*   $L8=HRF1802,RACF/180,860925,CNTDSD:                            @L8A 00430000
*   $P1=PEQ0070,RACF/180,870720,CNTDSD:                            @P1A 00440000
*   $M1=JRF1812,RACF/181,871123,CNTDSD: RELEASE=1.8.1 ALLOWED      @M1A 00450000
*   OY12773                                                    @YA12773 00460000
*   $M2= MVSB1   RACF/190 880328 PDV_Z1: MVS B1 SECURITY           @M2A 00470000
*   $P2= PGW0002 RACF/190 880427 PDV_Z1: PTM PGW0002               @P2A 00480000
*   $P3= PGW0011 RACF/190 880427 PDV_Z1: PTM PGW0011               @P3A 00490000
*   $P4= PGW0020 RACF/190 880615 PDI_H1: PTM PGW0020               @P4A 00500000
*   $D1= DGU0025 RACF/190 881221 PDTGB1: DCR 25                    @D1A 00510000
*   $D2= DGU0058 RACF/190 890201 PDI_H1: DCR 58                    @D2A 00520000
*   $M3= VMSFS   RACF/190 890517 PDB_S1: SHARED FILE SYSTEM        @M3A 00530000
*   $M4=HRF1822,RACF/182,871118,JCD1:                              @M4A 00540000
*   $D3=HRF1822,RACF/182,880206,JCD1: DCR3                         @D3A 00550000
*   $D4= DGU0088 RACF/190 890412 PDTGB1: DCR 88                    @D4A 00560000
*   $P5= PGW0066 RACF/190 890412 PDTGB1: PTM PGW0066               @P5A 00570000
*   $P6= PGP0563 RACF/190 890922 PDB_S1: PTM PGP0563               @P6A 00580000
*   $P7= PGP0575 RACF/190 890922 PDB_S1: PTM PGP0575               @P7A 00590000
*   $P8= PGP0572 RACF/190 890922 PDB_S1: PTM PGP0572               @P8A 00600000
*   $P9= PGP0611 RACF/190 890922 PDB_S1: PTM PGP0611               @P9A 00610000
*   $Q1= PGP0576 RACF/190 890922 PDTGB1: PTM PGP0576               @Q1A 00620000
*   $Q2= PI90010 RACF/190 891020 PDB_S1: PTM PI90010 (OY27097)     @Q2A 00630000
*   $Q3= PI90038 RACF/190 901002 PDJCD1: PTM PI90038 (OY36441)     @Q3A 00640000
*   $M5= RELID   RACF/192 900904 PDAHW1: SUPPORT FOR RACF 1.9.2    @M5A 00650000
*   $Q4= PJA0029 RACF/192 910524 PDPSB1: PTM PJA0029               @Q4A 00660000
*   $M6= OW04015 RACF/210 930426 PDKAF1: SUPPORT FOR RACF 2.1      @M6A 00670000
*   $M7= OW10709 RACF/220 940510 PDJMV1: SUPPORT FOR RACF 2.2      @M7A 00680000
*   $M8= RELID   RACF/230 960422 PDJMV1: SUPPORT FOR RACF 2.3      @M8A 00690000
*   $Q5= PQC1932 RACF/230 960722 PDJMV1: PTM PQC1932               @Q5C 00700000
*   $M9= RELID   RACF/240 960904 PDJMV1: SUPPORT FOR RACF 2.4      @M9A 00710000
*   $Q6= PSY0429 RACF/230 970305 PDPHW1: PTM PSY0429/ OW25078      @Q6A 00720000
*   $N1= RELID   RACF/260 970728 PDCAM1: SUPPORT FOR RACF HRF2260  @N1A 00730000
*   $Q7= PVT0078 RACF/260 971027 PDJJP1: FIN APAR OW29544          @Q7A 00740000
*   $N2= RELID   HRF2608  980624 PDRDS2: SUPPORT FOR HRF2608       @N2A 00750000
*   $N3= RELID   HRF7703  990415 PDRDS2: SUPPORT FOR HRF7703       @N3A 00760000
*   $N4= RELID   HRF7705  000405 PDIFS2: SUPPORT FOR HRF7705       @N4A 00770000
*   $Q8= PYJ0052 HBB7705  000823 PDJSO1: PTM PYJ0052/ VM62572      @Q8A 00780000
*   $N5= RELID   HRF7706  010430 PDRDC1: SUPPORT FOR HRF7706       @N5A 00790000
*   $N6= RELID   HRF7707  020109 PDMSF1: SUPPORT FOR HRF7707       @N6A 00800000
*   $N7= RELID   HRF7708  020118 PDMSF1: SUPPORT FOR HRF7708       @N7A 00810000
*   $N8= TPSEQ   HRF7708  020628 PDJJP1: DFSMS ENHANCEMENTS        @N8A 00820000
*   $Q9= PYN0600 HRF7708  020910 PDJJP1: PTM PYN0600               @Q9A 00830000
*   $N9= RELID   HRF7709  030430 PDMSD1: SUPPORT FOR HRF7709       @N9A 00840000
*   $NA= RELID   HRF7720  040224 PDRIV1: Support SAF FMID HBB7720  @NAA 00850000
*   $NB= RELID   HRF7730  050531 PDRIV1: Support SAF FMID HBB7730  @NBA 00860000
*   $NC= RELID   HRF7740  060330 PDRIV1: Support SAF FMID HBB7740  @NCA 00870000
*   $ND= RELID   HRF7750  070302 PDRIV1: Support SAF FMID HBB7750  @NDA 00880000
*   $NE= RELID   HRF7760  080522 PDJLW1: Support SAF FMID HBB7760  @NEA 00890000
*   $NF= RELID   HBB7770  090511 PDJLW1: Support SAF FMID HBB7770  @NFA 00900000
*   $NG= RELID   HBB7780  100513 PDJLW1: Support SAF FMID HBB7780  @NGA 00910000
*   $NH= RELID   HBB7790  110117 PDJLW1: Support SAF FMID HBB7790  @NHA 00920000
*   $NI= RELID   HBB77A0  130110 PDAWS1: Support SAF FMID HBB77A0  @NIA 00930000
*   $NJ= PDSESEC HBB77A0  130218 PDGTM1: PDSE Member Level Secur   @NJA 00940000
*   $PA= ME26557 HBB77A0  130814 PDGTM1: PDSE Member Level Secur   @PAA 00950000
*   $PB= ME26644 HBB77A0  130910 PDGTM1: PDSE Member Level Secur   @PBA 00960000
*   $NK= PDSESEC HBB77A0  131114 PDGTM1: PDSE Member Level Secur   @NKA 00970000
*   $NL= RELID   HBB77B0  150508 PDPGP1: Support SAF FMID HBB77B0  @NLA 00980000
*   $NM= RELID   HBB77B0  160518 PDPGP1: Missed updates for 77B0   @NMA 00990000
*   $NN= RELID   HBB77C0  180524 PDGTM1: ParmList Version Support  @NNA 01000001
*                                                                       01010001
*                                                                       01020003
*                                                                       01030000
*                                                                       01040000
* CHANGE DESCRIPTIONS:                                                  01050000
*   A000000-999999 ORIGINAL CODE                               @PC002PY 01060000
*   A - SUPPORT FOR WRITER, LOGSTR, TOKEN, AND RECVR KEYWORDS      @M2A 01070000
*   A - SUPPORT FOR MF=M                                           @P2A 01080000
*   A - MNOTES IF NEW KEYWORDS USED WITHOUT RACROUTE               @P3A 01090000
*   A - 1.9 KEYWORDS ARE BYPASSED IF RELEASE=1.8                   @P4A 01100000
*   D - WRITER KEYWORD SUPPORT (IMPLEMENTED VIA WRITER CLASS)      @D1A 01110000
*   A - SUPPORT FOR STATUS=EVERDOM                                 @D2A 01120000
*   A - LONG NAME SUPPORT UNDER SHARED FILE SYSTEM. SUPPORT FOR    @M3A 01130000
*       KEYWORD "ENTITYX" AND ATTR=ACCESS                          @M3A 01140000
*   A - SUPPORT FOR STATUS=WRITEONLY                               @D4A 01150000
*   C - "NOT ALLOWED WITH MF=E" MNOTES TO INCLUDE MF=M             @P5A 01160000
*   C - GENERATE CORRECT PARAMETER LIST FOR RELEASE 1.8X           @P6A 01170000
*   A - SUPPORT TO VALIDATE SECOND ENTITY/ENTITYX PARAMETER        @P7A 01180000
*       ON THE MODIFY AND EXECUTE FORMS                            @P7A 01190000
*   A - SUPPORT TO DISALLOW RTOKEN KEYWORD WITH SECOND ENTITY      @P8A 01200000
*       OPERAND BEING 'PRIVATE' OR 'CSA' IN LIST AND STANDARD      @P8A 01210000
*       FORMS                                                      @P8A 01220000
*   C - '&RELEASE' TO '&RELEASE'(1,3) FOR LOGICAL COMPARISON       @P9A 01230000
*       WITH '1.9'                                                 @P9A 01240000
*   C - ATTR=ACCESS TO STATUS=ACCESS                               @Q1A 01250000
*   C - SUPPORT TO DISALLOW RTOKEN WITH MODIFY AND EXECUTE FORMS   @Q2A 01260000
*   C - ASSEMBLER F COMPATABILITY                                  @Q3A 01270000
*   C - ALLOW RACF RELEASE 1.9.2 TO BE SPECIFIED                   @M5A 01280000
*   C - STATUS TO CORRECTLY CORRESPOND TO MVS LEVEL, AND CHANGE    @Q4A 01290000
*       PRODUCT I.D. TO RACF/192                                   @Q4A 01300000
*   C - ALLOW RACF RELEASE 2.1 TO BE SPECIFIED                     @M6A 01310000
*   C - ALLOW RACF RELEASE 2.2 TO BE SPECIFIED                     @M7A 01320000
*   C - ALLOW RACF RELEASE 2.3 TO BE SPECIFIED                     @M8A 01330000
*   C - FIX PROGRAM NUMBER IN COPYRITE STATEMENT 2.3.0             @Q5C 01340000
*   A - ALLOW RACF RELEASE 2.4 TO BE SPECIFIED                     @M9A 01350000
*   A - STATUS=ACCESS IN EXECUTE FORM OF RACROUTE=AUTH GENERATES   @Q6A 01360000
*       INCORRECT PARM LIST X'30'.  THE CORRECT PARM LIST IS X'10' @Q6A 01370000
*   A - ALLOW RACF RELEASE 2.6 TO BE SPECIFIED FOR HRF2260         @N1A 01380000
*   A - HAD TO SHUT OFF ENTITY BIT WHEN PROFILE IS SPECIFIED       @Q7A 01390000
*   A - ALLOW RACF RELEASE 2608 TO BE SPECIFIED FOR HRF2608        @N2A 01400000
*   A - ALLOW RACF RELEASE 7703 TO BE SPECIFIED FOR HRF7703        @N3A 01410000
*   A - ALLOW RACF RELEASE 7705 TO BE SPECIFIED FOR HRF7705        @N4A 01420000
*   A - RESET ACHKFLG4 FIELDS BEFORE SETTING THEM WITH THE NEW     @Q8A 01430000
*       STATUS= VALUE.                                             @Q8A 01440000
*   A - ALLOW RACF RELEASE 7706 TO BE SPECIFIED FOR HRF7706        @N5A 01450000
*   A - ALLOW RACF RELEASE 7707 TO BE SPECIFIED FOR HRF7707        @N6A 01460000
*   A - ALLOW RACF RELEASE 7708 TO BE SPECIFIED FOR HRF7708        @N7A 01470000
*   A - ADDED MNOTE TO PREVENT FILESEQ NUMBER GREATER THAN 65535   @N8A 01480000
*   A - UPDATE MNOTE FOR FILESEQ NUMBER GREATER THAN 65535         @Q9A 01490000
*       NEEDS TO BE RC 4 TO ALLOW ASSEMBLE CONTINUE                @Q9A 01500000
*   A - ALLOW RACF RELEASE 7709 TO BE SPECIFIED FOR HRF7709        @N9A 01510000
*   A - Add support for SAF Release FMID HBB7720                   @NAA 01520000
*   A - Add support for SAF Release FMID HBB7730                   @NBA 01530000
*   A - Add support for SAF Release FMID HBB7740                   @NCA 01540000
*   A - Add support for SAF Release FMID HBB7750                   @NDA 01550000
*   A - Add support for SAF Release FMID HBB7760                   @NEA 01560000
*   A - Add support for SAF Release FMID HBB7770                   @NFA 01570000
*   A - Add support for SAF Release FMID HBB7780                   @NGA 01580000
*   A - Add support for SAF Release FMID HBB7790                   @NHA 01590000
*   A - Add support for SAF Release FMID HBB77A0                   @NIA 01600000
*   A - Support for PDSE Member Level Security                          01610000
*       - Support for keywords MEMCOUNT and MEMBER                 @NJA 01620000
*   A - Support for PDSE Member Level Security                          01630000
*       - The MEMCOUNT and MEMBER parameters should not                 01640000
*         be added at the end of the Parameter List for                 01650000
*         RACROUTE REQUEST=AUTH with releases prior to                  01660000
*         release 77A0 (z/OS V2R2).                                @PAA 01670000
*   A - Support for PDSE Member Level Security                          01680000
*       - Set the length of the Parameter List to the                   01690000
*         correct length even if we issued an MNOTE having              01700000
*         detected a non-valid combination of keywords and              01710000
*         release level                                            @PBA 01720000
*   A - Support for PDSE Member Level Security                          01730000
*       - Support for DSTYPE=L                                     @NKA 01740000
*   A - Add support for SAF Release FMID HBB77B0                   @NLA 01750000
*   A - Get missed hits for release id update                      @NMA 01760000
*   A - Support for Parameter List Version                              01770001
*       - Specify the parameter list version instead of                 01780001
*         the last 4 characters of the FMID by specifying               01790001
*         RELEASE=PLV0001                                          @NNA 01800001
*                                                                       01810001
*                                                                       01820003
*                                                                       01830003
*                                                                       01840001
*********END OF SPECIFICATIONS***************************************** 01850000
         MACRO                                                          01860000
&SYMBOL  RACHECK &ENTITY=,&CLASS=,&PROFILE=,&VOLSER=,&OLDVOL=,         -01870000
               &ATTR=,&DSTYPE=,&LOG=,&MF=S,&INSTLN=,                   *01880000
               &OWNER=,                                          @L4A  *01890000
               &RACFIND=,                                        @L5A  *01900000
               &ACCLVL=,                                         @L5A  *01910000
               &ACEE=,&APPL=,                                    @L6A  *01920000
               &GENERIC=,                                        @L7A  *01930000
               &RELEASE=,                                        @L7A  *01940000
               &FILESEQ=,                                        @L7A  *01950000
               &TAPELBL=,                                        @L7A  *01960000
               &STATUS=,                                         @L7A  *01970000
               &USERID=,                                         @L8A  *01980000
               &GROUPID=,                                        @L8A  *01990000
               &DDNAME=,                                     @YA12773  *02000000
               &LOGSTR=,                                         @D1D  *02010000
               &RECVR=,                                          @M2A  *02020000
               &RTOKEN=,                                         @M2A  *02030000
               &ENTITYX=,                                        @M3A  *02040000
               &UTOKEN=,                                         @M2A  *02050000
               &MEMCOUNT=,                                       @NJA  *02060000
               &MEMBER=                                          @NJA   02070000
.*                                                                      02080000
.* DEFINE LOCAL SET SYMBOLS                                             02090000
         LCLA  &BIT0,&BIT1,&BIT2,&BIT3,&BIT4,&BIT5,&BIT6,&BIT7,&CLNGTH  02100000
         LCLA  &BIX0,&BIX1,&BIX2,&BIX3,&BIX4,&BIX5,&BIX6,&BIX7          02110000
         LCLA  &OFFSET                                         @PC003PY 02120000
         LCLB  &MFFLAG                                                  02130000
         LCLC  &SUBSTR                                                  02140000
         LCLA  &RLVL,&RLVLSZ(10)                                   @M6C 02150000
         LCLB  &RLVLCHK                                            @L7A 02160000
         LCLA  &PARMLEN                                            @L7A 02170000
         LCLB  &LONGNAM          0 => ENTITY IS SPECIFIED          @M3A 02180000
         LCLC  &CMENTY1          FIRST OPERAND - ENTITY OR ENTITYX @M3A 02190000
         LCLC  &CMENTY2          SECOND OPERAND- ENTITY OR ENTITYX @M3A 02200000
.* DEFINE GLOBAL SET SYMBOLS                                       @T1A 02210000
         GBLB  &ICHRAC              ICHRAC - A FLAG WHICH, WHEN    @T1A 02220000
.*                                  ON, INDICATES THAT THIS MACRO  @T1A 02230000
.*                                  IS BEING INVOKED INTERNALLY    @T1A 02240000
.*                                  BY THE RACROUTE MACRO.         @T1A 02250000
         GBLC  &ICHL                THIS IS USED TO COMMUNICATE    @T1A 02260000
.*                                  TO THE RACROUTE MACRO THE      @T1A 02270000
.*                                  ADDRESS OF THE PARAMETER LIST. @T1A 02280000
         GBLC  &ICHRLVL             SYMBOL TO BRANCH TO            @L7A 02290000
.*                                  WHEN INCOMPATIBLE MACRO LEVEL. @L7A 02300000
.*                                                                      02310000
         GBLB  &ICHLFS              ICHLFS - A FLAG WHICH IS SET   @D3C 02320000
.*                                  BY RACROUTE TO COMMUNICATE     @D3C 02330000
.*                                  THAT THE LIMITED FUNCTION      @D3C 02340000
.*                                  SUPPORT FOR VM HAS BEEN        @D3C 02350000
.*                                  SELECTED.                      @D3C 02360000
         GBLB  &ICHCOM              ICHCOM - A FLAG WHICH WHEN ON  @M3A 02370000
.*                                  INDICATES THAT THE RACHECK IS  @M3A 02380000
.*                                  INVOKED BY COMMAND PROCESSORS  @M3A 02390000
.*                                  IT GENERATES PARAMETER LIST    @M3A 02400000
.*                                  WITH 31 BIT ADDRESSING AND     @M3A 02410000
.*                                  THE SVC CALL.                  @M3A 02420000
&LONGNAM SETB 0                     REFLECT ENTITY IS SPECIFIED.   @M3A 02430000
         AIF   (N'&ENTITY GT 1).COPTWO1                            @M3A 02440000
&CMENTY1 SETC  '&ENTITY'                                           @M3A 02450000
&CMENTY2 SETC  ''                                                  @M3A 02460000
         AIF   ('&CMENTY1' EQ '').COMFLO1                          @M3A 02470000
         AIF   ('&CMENTY1'(1,1) NE '(').COMFLO1                    @M3A 02480000
&CMENTY1 SETC  '&ENTITY(1)'                                        @M3A 02490000
         AGO   .COMFLO1                                            @M3A 02500000
.COPTWO1 ANOP                                                      @M3A 02510000
&CMENTY1 SETC  '&ENTITY(1)'                                        @M3A 02520000
&CMENTY2 SETC  '&ENTITY(2)'                                        @M3A 02530000
.COMFLO1 ANOP                                                      @M3A 02540000
.* INITIALIZE FOR, AND VALIDATE, RELEASE PARAMETER                 @L7A 02550000
&RLVLSZ(1) SETA 56                 DEFAULT PARAMETER LIST SIZE     @L7A 02560000
&RLVLSZ(2) SETA 56                 R1.6 PARAMETER LIST SIZE        @L7A 02570000
&RLVLSZ(3) SETA 60                 R1.7 PARAMETER LIST SIZE        @L7A 02580000
&RLVLSZ(4) SETA 68                 R1.8 PARAMETER LIST SIZE        @L8A 02590000
&RLVLSZ(5) SETA 68                 R1.8.1 PARAMETER LIST SIZE      @M1A 02600000
&RLVLSZ(6) SETA 88                 R1.8X PARAMETER LIST SIZE   @YA12773 02610000
&RLVLSZ(7) SETA 92                 R1.9   PARAMETER LIST SIZE      @M2A 02620000
&RLVLSZ(8) SETA 92                 R1.9.2 PARAMETER LIST SIZE      @M5C 02630000
&RLVLSZ(9) SETA 92                 R2.1   PARAMETER LIST SIZE      @M6A 02640000
&RLVLSZ(10) SETA 92                R2.2   PARAMETER LIST SIZE      @M7A 02650000
&RLVLSZ(11) SETA 92                R2.3   PARAMETER LIST SIZE      @M8A 02660000
&RLVLSZ(12) SETA 92                R2.4   PARAMETER LIST SIZE      @M9A 02670000
&RLVLSZ(13) SETA 92                R2.6   PARAMETER LIST SIZE      @N1A 02680000
&RLVLSZ(14) SETA 92                R2608  PARAMETER LIST SIZE      @N2A 02690000
&RLVLSZ(15) SETA 92                R7703  PARAMETER LIST SIZE      @N3A 02700000
&RLVLSZ(16) SETA 92                R7705  PARAMETER LIST SIZE      @N4A 02710000
&RLVLSZ(17) SETA 92                R7706  PARAMETER LIST SIZE      @N5A 02720000
&RLVLSZ(18) SETA 92                R7707  PARAMETER LIST SIZE      @N6A 02730000
&RLVLSZ(19) SETA 92                R7708  PARAMETER LIST SIZE      @N7A 02740000
&RLVLSZ(20) SETA 92                R7709  PARAMETER LIST SIZE      @N9A 02750000
&RLVLSZ(21) SETA 92                R7720  PARAMETER LIST SIZE      @NAA 02760000
&RLVLSZ(22) SETA 92                R7730  PARAMETER LIST SIZE      @NBA 02770000
&RLVLSZ(23) SETA 92                R7740  PARAMETER LIST SIZE      @NCA 02780000
&RLVLSZ(24) SETA 92                R7750  PARAMETER LIST SIZE      @NDA 02790000
&RLVLSZ(25) SETA 92                R7760  PARAMETER LIST SIZE      @NEA 02800000
&RLVLSZ(26) SETA 92                R7770  PARAMETER LIST SIZE      @NFA 02810000
&RLVLSZ(27) SETA 92                R7780  PARAMETER LIST SIZE      @NGA 02820000
&RLVLSZ(28) SETA 92                R7790  PARAMETER LIST SIZE      @NHA 02830000
&RLVLSZ(29) SETA 100               R77A0  PARAMETER LIST SIZE      @NJC 02840000
&RLVLSZ(30) SETA 100               R77B0  PARAMETER LIST SIZE      @NMA 02850000
.*                                                                 @NNA 02860001
&RLVLSZ(31) SETA 100               Set the Parameter List Size     @NNA 02870001
.*                                 for RELEASE=PLV0001             @NNA 02880001
.*                                 PLVnnnn indicates the           @NNA 02890001
.*                                 Parameter List Version          @NNA 02900001
.*                                                                 @NNA 02910001
         AIF   (&ICHRAC).RLVL01                                    @L7A 02920000
&ICHRLVL SETC  'ICH&SYSNDX.X'      CREATE LABEL FOR SVC BYPASS     @L7A 02930000
.RLVL01  ANOP                                                      @L7A 02940000
&RLVL    SETA  1                   DEFAULT IF NOT SPECIFIED        @L7A 02950000
         AIF   ('&RELEASE' EQ '').NORLVL                           @L7A 02960000
         AIF   (N'&RELEASE GT 2).ERLVL1 INVALID RELEASE PARAMETER  @L7A 02970000
         AIF   ('&RELEASE(1)' EQ '1.6' OR  '&RELEASE(1)' EQ '1.7' OR   X02980000
               '&RELEASE(1)' EQ '1.8' OR '&RELEASE(1)' EQ '1.8.1' OR   X02990000
               '&RELEASE(1)' EQ '1.8.2').RLVL02                    @M4C 03000000
         AIF   ('&RELEASE(1)' EQ '1.8X').RLVL02                @YA12773 03010000
         AIF   ('&RELEASE(1)' EQ '1.9').LNGNM19                    @M3C 03020000
         AIF   ('&RELEASE(1)' EQ '1.9.2').LNGNM19                  @M5C 03030000
         AIF   ('&RELEASE(1)' EQ '2.1').LNGNM19                    @M6A 03040000
         AIF   ('&RELEASE(1)' EQ '2.2').LNGNM19                    @M7A 03050000
         AIF   ('&RELEASE(1)' EQ '2.3').LNGNM19                    @M8A 03060000
         AIF   ('&RELEASE(1)' EQ '2.4').LNGNM19                    @M9A 03070000
         AIF   ('&RELEASE(1)' EQ '2.6').LNGNM19                    @N1A 03080000
         AIF   ('&RELEASE(1)' EQ '2608').LNGNM19                   @N2A 03090000
         AIF   ('&RELEASE(1)' EQ '7703').LNGNM19                   @N3A 03100000
         AIF   ('&RELEASE(1)' EQ '7705').LNGNM19                   @N4A 03110000
         AIF   ('&RELEASE(1)' EQ '7706').LNGNM19                   @N5A 03120000
         AIF   ('&RELEASE(1)' EQ '7707').LNGNM19                   @N6A 03130000
         AIF   ('&RELEASE(1)' EQ '7708').LNGNM19                   @N7A 03140000
         AIF   ('&RELEASE(1)' EQ '7709').LNGNM19                   @N9A 03150000
         AIF   ('&RELEASE(1)' EQ '7720').LNGNM19                   @NAA 03160000
         AIF   ('&RELEASE(1)' EQ '7730').LNGNM19                   @NBA 03170000
         AIF   ('&RELEASE(1)' EQ '7740').LNGNM19                   @NCA 03180000
         AIF   ('&RELEASE(1)' EQ '7750').LNGNM19                   @NDA 03190000
         AIF   ('&RELEASE(1)' EQ '7760').LNGNM19                   @NEA 03200000
         AIF   ('&RELEASE(1)' EQ '7770').LNGNM19                   @NFA 03210000
         AIF   ('&RELEASE(1)' EQ '7780').LNGNM19                   @NGA 03220000
         AIF   ('&RELEASE(1)' EQ '7790').LNGNM19                   @NHA 03230000
         AIF   ('&RELEASE(1)' EQ '77A0').LNGNM19                   @NIA 03240000
         AIF   ('&RELEASE(1)' EQ '77B0').LNGNM19                   @NLA 03250000
         AIF   ('&RELEASE(1)' EQ 'PLV0001').LNGNM19                @NNA 03260009
         AGO   .ERLVL1                                         @YA12773 03270000
.*                                                                 @M3A 03280000
.*  TEST THE FOLLOWING :                                           @M3A 03290000
.*    1. FOR RELEASE 1.9 AND LATER, THE MACRO RACHECK IS INVOKED   @M5C 03300000
.*       ONLY VIA RACROUTE.                                        @M5C 03310000
.*    2. BOTH ENTITY AND ENTITYX ARE NOT SPECIFIED AS THEY ARE     @M3A 03320000
.*       MUTUALLY EXCLUSIVE KEYWORDS.                              @M3A 03330000
.*                                                                 @M3A 03340000
.LNGNM19 ANOP                                                      @M3A 03350000
         AIF   (&ICHCOM).ERTN19                                    @M3A 03360000
         AIF   (NOT &ICHRAC).ERR19                                 @M3A 03370000
.ERTN19  ANOP                                                      @M3A 03380000
         AIF   ('&ENTITYX' NE '' AND '&ENTITY' NE '').ERR18        @M3A 03390000
.ERTN18  ANOP                                                      @M3A 03400000
         AIF   ('&ENTITYX' EQ '').RLVL02                           @M3A 03410000
&LONGNAM SETB  1                     SINCE ENTITYX IS SPECIFIED,   @M3A 03420000
         AIF   (N'&ENTITYX GT 1).COPTWO2                           @M3A 03430000
&CMENTY1 SETC  '&ENTITYX'                                          @M3A 03440000
&CMENTY2 SETC  ''                                                  @M3A 03450000
         AIF   ('&CMENTY1' EQ '').COMFLO2                          @M3A 03460000
         AIF   ('&CMENTY1'(1,1) NE '(').COMFLO2                    @M3A 03470000
&CMENTY1 SETC  '&ENTITYX(1)'                                       @M3A 03480000
         AGO   .COMFLO2                                            @M3A 03490000
.COPTWO2 ANOP                                                      @M3A 03500000
&CMENTY1 SETC  '&ENTITYX(1)'                                       @M3A 03510000
&CMENTY2 SETC  '&ENTITYX(2)'                                       @M3A 03520000
.COMFLO2 ANOP                                                      @M3A 03530000
.*                                                                 @M3A 03540000
.RLVL02  ANOP                                                      @L7A 03550000
         AIF   (N'&RELEASE EQ 1).NORLVLC CHECK NOT SPECIFIED       @L7A 03560000
         AIF   ('&RELEASE(2)' NE 'CHECK').ERLVL1 INVALID VALUE     @L7A 03570000
         AIF   ('&MF(1)' NE 'E').ERLVL2 CHECK ONLY WITH MF=E       @L7A 03580000
         AIF   (&ICHLFS).ERLVLF  MF=E,CHECK SPECIFIED WITH         @M4A 03590000
.*                               RELEASE=1.8.2 AND LIMITED         @M4A 03600000
.*                               FUNCTION RACROUTE SELECTED IS     @M4A 03610000
.*                               INVALID.                          @M4A 03620000
&RLVLCHK SETB  1                  INDICATE RELEASE-CHECK REQUESTED @L7A 03630000
.ERLVL2R ANOP                                                      @L7A 03640000
.NORLVLC ANOP                                                      @L7A 03650000
.ERLVLFR ANOP                                                      @M4A 03660000
&RLVL    SETA  2                   ASSUME RELEASE=1.6              @L7A 03670000
         AIF   ('&RELEASE(1)' NE '1.7').RLVL17                     @L7A 03680000
&RLVL    SETA  3                   INDICATE RELEASE=1.7            @L7A 03690000
         AGO   .RLVL18                                             @L8A 03700000
.RLVL17  ANOP                                                      @L7A 03710000
         AIF   ('&RELEASE(1)' NE '1.8').RLVL18                     @L8A 03720000
&RLVL    SETA  4                   INDICATE RELEASE=1.8            @L8A 03730000
.RLVL18  ANOP                                                      @L8A 03740000
         AIF   ('&RELEASE(1)' NE '1.8.1').RLVL181                  @M1A 03750000
&RLVL    SETA  5                   INDICATE RELEASE=1.8.1          @M1A 03760000
.RLVL181 ANOP                                                      @M1C 03770000
         AIF   ('&RELEASE(1)' NE '1.8X').RLVL18X               @YA12773 03780000
&RLVL    SETA  6                   INDICATE RELEASE=1.8X       @YA12773 03790000
.RLVL18X ANOP                                                  @YA12773 03800000
         AIF   ('&RELEASE(1)' EQ '1.8.2' AND NOT &ICHLFS).ERLVL3   @M4A 03810000
         AIF   ('&RELEASE(1)' NE '1.8.2').RLVL182                  @M4A 03820000
&RLVL    SETA  4                   INDICATE RELEASE=1.8.2 USING    @M4A 03830000
.*                                 THE 1.8 PARAMETER LIST SIZE     @M4A 03840000
.RLVL182 ANOP                                                      @M4A 03850000
         AIF   ('&RELEASE(1)' NE '1.9').RLVL190                    @M2A 03860000
&RLVL    SETA  7                   INDICATE RELEASE=1.9.0          @M2A 03870000
.RLVL190 ANOP                                                      @M2A 03880000
         AIF   ('&RELEASE(1)' NE '1.9.2').RLVL192                  @M5C 03890000
&RLVL    SETA  8                   INDICATE RELEASE=1.9.2          @M5C 03900000
.RLVL192 ANOP                                                      @M5C 03910000
         AIF   ('&RELEASE(1)' NE '2.1').RLVL210                    @M6A 03920000
&RLVL    SETA  9                   INDICATE RELEASE=2.1            @M6A 03930000
.RLVL210 ANOP                                                      @M7A 03940000
         AIF   ('&RELEASE(1)' NE '2.2').RLVL220                    @M7A 03950000
&RLVL    SETA  10                  INDICATE RELEASE=2.2            @M7A 03960000
.RLVL220 ANOP                                                      @M8A 03970000
         AIF   ('&RELEASE(1)' NE '2.3').RLVL230                    @M8A 03980000
&RLVL    SETA  11                  INDICATE RELEASE=2.3            @M8A 03990000
.RLVL230 ANOP                                                      @M6C 04000000
         AIF   ('&RELEASE(1)' NE '2.4').RLVL240                    @M9A 04010000
&RLVL    SETA  12                  INDICATE RELEASE=2.4            @M9A 04020000
.RLVL240 ANOP                                                      @M9A 04030000
         AIF   ('&RELEASE(1)' NE '2.6').RLVL260                    @N1A 04040000
&RLVL    SETA  13                  INDICATE RELEASE=2.6            @N1A 04050000
.RLVL260 ANOP                                                      @N1A 04060000
         AIF   ('&RELEASE(1)' NE '2608').RLVL2608                  @N2A 04070000
&RLVL    SETA  14                  INDICATE RELEASE=2608           @N2A 04080000
.RLVL2608 ANOP                                                     @N2A 04090000
         AIF   ('&RELEASE(1)' NE '7703').RLVL7703                  @N3A 04100000
&RLVL    SETA  15                  INDICATE RELEASE=7703           @N3A 04110000
.RLVL7703 ANOP                                                     @N3A 04120000
         AIF   ('&RELEASE(1)' NE '7705').RLVL7705                  @N4A 04130000
&RLVL    SETA  16                  INDICATE RELEASE=7705           @N4A 04140000
.RLVL7705 ANOP                                                     @N4A 04150000
         AIF   ('&RELEASE(1)' NE '7706').RLVL7706                  @N5A 04160000
&RLVL    SETA  17                  INDICATE RELEASE=7706           @N5A 04170000
.RLVL7706 ANOP                                                     @N5A 04180000
         AIF   ('&RELEASE(1)' NE '7707').RLVL7707                  @N6A 04190000
&RLVL    SETA  18                  INDICATE RELEASE=7707           @N6A 04200000
.RLVL7707 ANOP                                                     @N6A 04210000
         AIF   ('&RELEASE(1)' NE '7708').RLVL7708                  @N7A 04220000
&RLVL    SETA  19                  INDICATE RELEASE=7708           @N7A 04230000
.RLVL7708 ANOP                                                     @N7A 04240000
         AIF   ('&RELEASE(1)' NE '7709').RLVL7709                  @N9A 04250000
&RLVL    SETA  20                  INDICATE RELEASE=7709           @N9A 04260000
.RLVL7709 ANOP                                                     @N9A 04270000
         AIF   ('&RELEASE(1)' NE '7720').RLVL7720                  @NAA 04280000
&RLVL    SETA  21                  INDICATE RELEASE=7720           @NAA 04290000
.RLVL7720 ANOP                                                     @NAA 04300000
         AIF   ('&RELEASE(1)' NE '7730').RLVL7730                  @NBA 04310000
&RLVL    SETA  22                  INDICATE RELEASE=7730           @NBA 04320000
.RLVL7730 ANOP                                                     @NBA 04330000
         AIF   ('&RELEASE(1)' NE '7740').RLVL7740                  @NCA 04340000
&RLVL    SETA  23                  INDICATE RELEASE=7740           @NCA 04350000
.RLVL7740 ANOP                                                     @NCA 04360000
         AIF   ('&RELEASE(1)' NE '7750').RLVL7750                  @NDA 04370000
&RLVL    SETA  24                  INDICATE RELEASE=7750           @NDA 04380000
.RLVL7750 ANOP                                                     @NDA 04390000
         AIF   ('&RELEASE(1)' NE '7760').RLVL7760                  @NEA 04400000
&RLVL    SETA  25                  INDICATE RELEASE=7760           @NEA 04410000
.RLVL7760 ANOP                                                     @NEA 04420000
         AIF   ('&RELEASE(1)' NE '7770').RLVL7770                  @NFA 04430000
&RLVL    SETA  26                  INDICATE RELEASE=7770           @NFA 04440000
.RLVL7770 ANOP                                                     @NFA 04450000
         AIF   ('&RELEASE(1)' NE '7780').RLVL7780                  @NGA 04460000
&RLVL    SETA  27                  INDICATE RELEASE=7780           @NGA 04470000
.RLVL7780 ANOP                                                     @NGA 04480000
         AIF   ('&RELEASE(1)' NE '7790').RLVL7790                  @NHA 04490000
&RLVL    SETA  28                  INDICATE RELEASE=7790           @NHA 04500000
.RLVL7790 ANOP                                                     @NHA 04510000
         AIF   ('&RELEASE(1)' NE '77A0').RLVL77A0                  @NIA 04520000
&RLVL    SETA  29                  INDICATE RELEASE=77A0           @NIA 04530000
.RLVL77A0 ANOP                                                     @NIA 04540000
         AIF   ('&RELEASE(1)' NE '77B0').CHECKVER                  @NNC 04550010
&RLVL    SETA  30                  INDICATE RELEASE=77B0           @NLA 04560000
.CHECKVER ANOP                                                     @NNA 04570001
         AIF   ('&RELEASE(1)' NE 'PLV0001').NORLVL                 @NNA 04580010
.PLVER0001 ANOP                                                    @NNA 04590001
&RLVL    SETA  31              Indicate Parameter List Version     @NNA 04600001
.*                             PLV0001 was specified on RELEASE=   @NNA 04610001
.NORLVL  ANOP                                                      @L7A 04620000
.ERLVL1R ANOP                                                      @L7A 04630000
.ERLVL3R ANOP                                                      @M4A 04640000
.*                                                                 @L7A 04650000
.* PERFORM PARAMETER DIAGNOSIS                                          04660000
.*                                                                 @L7A 04670000
.* CHECK SPECIFIED PARAMETERS AGAINST RACF LEVEL                   @L7A 04680000
         AIF   (&RLVL LT 7 AND '&ENTITYX' NE '').ERR20             @M3A 04690000
.ERTN20  ANOP                                                      @M3A 04700000
         AIF   (&RLVL GE 3).RLVL20 1.7 PARAMETERS VALID            @L7A 04710000
         AIF   (T'&FILESEQ NE 'O' OR T'&TAPELBL NE 'O' OR              X04720000
               T'&STATUS NE 'O').ERLVLA                            @L7A 04730000
         AIF   ('&DSTYPE' EQ 'T').ERLVLA                           @L7A 04740000
         AIF   ('&CMENTY2' EQ 'PRIVATE').ERLVLA                    @M3C 04750000
         AGO   .RLVL20                                             @L7A 04760000
.ERLVLAR ANOP                                                      @L7A 04770000
&RLVL    SETA  3                   1.7 PARAMETERS USED, SO ASSUME      X04780000
                                   RELEASE 1.7 EXPANSION           @L7A 04790000
.RLVL20  ANOP                                                      @L7A 04800000
         AIF   (&RLVL GE 4).RLVL25 1.8 PARAMETERS VALID            @L7A 04810000
         AIF   (T'&USERID NE 'O' OR T'&GROUPID NE 'O').ERLVLB      @L8A 04820000
         AGO   .RLVL25                                             @L8A 04830000
.ERLVLBR ANOP                                                      @L8A 04840000
&RLVL    SETA  4                   1.8 PARAMETERS USED, SO ASSUME      X04850000
                                   RELEASE 1.8 EXPANSION           @L8A 04860000
.RLVL25  ANOP                                                      @L8A 04870000
         AIF   (&RLVL GE 6).RLVL25X 1.8X PARAMETERS VALID      @YA12773 04880000
         AIF   (T'&DDNAME NE 'O').ERLVLC                       @YA12773 04890000
         AGO   .RLVL25X                                        @YA12773 04900000
.ERLVLCR ANOP                                                  @YA12773 04910000
&RLVL    SETA  6                   1.8X PARAMETERS USED, SO ASSUME     X04920000
                                   RELEASE 1.8X EXPANSION      @YA12773 04930000
.RLVL25X ANOP                                                  @YA12773 04940000
         AIF   (&RLVL GE 7).RLVL30 1.9 PARAMETERS VALID            @M2A 04950000
         AIF   (T'&LOGSTR NE 'O').ERLVLD                           @M2A 04960000
         AIF   (T'&UTOKEN NE 'O').ERLVLD                           @M2A 04970000
         AIF   (T'&RTOKEN NE 'O').ERLVLD                           @M2A 04980000
         AIF   (T'&RECVR  NE 'O').ERLVLD                           @D1D 04990000
         AGO   .RLVL30                                             @M2A 05000000
.ERLVLDR ANOP                                                      @M2A 05010000
&RLVL    SETA  7                   1.9 PARAMETERS USED, SO ASSUME  @M2AX05020000
                                   RELEASE 1.9 EXPANSION           @M2A 05030000
.RLVL30  ANOP                                                      @M2A 05040000
         AIF   (&RLVL GE 29).RLVL40  z/OS RACF V2R2 Parms are OK   @NJA 05050000
         AIF   ('&DSTYPE' EQ 'L').ERLVLK                           @NKA 05060000
.ERLVLKR ANOP                                                      @NKA 05070000
         AIF   (T'&MEMCOUNT EQ 'O' AND T'&MEMBER EQ 'O').RLVL40    @NJA 05080000
         AIF   (T'&MEMCOUNT NE 'O').ERLVLG                         @NJA 05090000
.ERLVLGR ANOP                                                      @NJA 05100000
         AIF   (T'&MEMBER NE 'O').ERLVLH                           @NJA 05110000
.ERLVLHR ANOP                                                      @NJA 05120000
.*                                                                 @PBA 05130000
.*                                                                1@PBD 05140000
.*                                                                 @PBA 05150000
.RLVL40  ANOP                       z/OS RACF V2R2 Parms are OK    @NJA 05160000
.*                                                                 @PBA 05170000
&PARMLEN SETA  &RLVLSZ(&RLVL)       LEN OF RACHECK PARMETER LIST   @L7A 05180000
.*                                                                 @L7A 05190000
.* VALIDATE ENTITY/ENTITYX/PROFILE PARAMETER                       @L7A 05200000
         AIF   ('&CMENTY1' EQ '' AND '&PROFILE' EQ '' AND '&MF' EQ     -05210000
               'S' ).ERR00                                         @M3C 05220000
         AIF   ('&PROFILE' NE '' AND &ICHLFS).ERR00A               @M4A 05230000
         AIF   (&ICHLFS AND '&CMENTY2' NE '').ERR01                @D3A 05240000
.ERTN00  ANOP                                                           05250000
.ERTN01  ANOP                                                      @D3A 05260000
.*--------------------------------------------------------------*  @P3A 05270000
.* VALIDATE RACROUTE INTERFACE FOR NEW PARAMETERS               *  @P3A 05280000
.*--------------------------------------------------------------*  @P3A 05290000
         AIF   (&ICHCOM).ERLVLER    SKIP IF FROM COMMAND PROCESSOR @M3A 05300000
         AIF   (&ICHRAC).ERLVLER    SKIP IF FROM RACROUTE          @P3A 05310000
         AIF   (T'&LOGSTR NE 'O').ERLVLE                           @M2A 05320000
         AIF   (T'&UTOKEN NE 'O').ERLVLE                           @M2A 05330000
         AIF   (T'&RTOKEN NE 'O').ERLVLE                           @M2A 05340000
         AIF   (T'&RECVR  NE 'O').ERLVLE                           @D1D 05350000
         AIF   (T'&MEMCOUNT NE 'O').ERLVLI                         @NJA 05360000
         AIF   (T'&MEMBER NE 'O').ERLVLJ                           @NJA 05370000
.ERLVLER ANOP                                                      @M2A 05380000
.ERLVLIR ANOP                                                      @NJA 05390000
.ERLVLJR ANOP                                                      @NJA 05400000
.* VALIDATE SECOND ENTITY/ENTITYX PARAMETER                        @P7A 05410000
         AIF   ('&CMENTY2' EQ '').ERTN17                           @P7A 05420000
         AIF   ('&CMENTY2' EQ 'PRIVATE').ERTN17                    @P7A 05430000
         AIF   ('&CMENTY2' EQ 'NONE').ERTN17                       @P7A 05440000
         AIF   ('&CMENTY2' EQ 'CSA').ERTN17                        @P7A 05450000
         AGO   .ERR17                                              @P7A 05460000
.ERTN17  ANOP  ,                                                   @P7A 05470000
.* VALIDATE LOG PARAMETER                                               05480000
         AIF   ('&LOG' NE 'ASIS' AND '&LOG' NE 'NOFAIL' AND '&LOG' NE  -05490000
               'NONE' AND '&LOG' NE 'NOSTAT' AND                       -05500000
               '&LOG' NE '').ERR02                             @ZA60572 05510000
         AIF   ('&LOG' NE '' AND &ICHLFS).ERR02A                   @M4A 05520000
.ERTN02  ANOP                                                           05530000
.* VALIDATE DSTYPE PARAMETER                                            05540000
         AIF   ('&DSTYPE' NE 'N' AND '&DSTYPE' NE 'V'                  -05550000
               AND '&DSTYPE' NE 'M' AND '&DSTYPE' NE 'T'               -05560000
               AND '&DSTYPE' NE 'L' AND '&DSTYPE' NE '').ERR03     @NKC 05570000
         AIF   ('&DSTYPE' NE '' AND &ICHLFS).ERR03A                @M4A 05580000
.ERTN03  ANOP                                                           05590000
.* VALIDATE ATTR PARAMETER                                              05600000
         AIF   ('&ATTR' EQ 'READ' OR '&ATTR' EQ 'ALTER'                -05610000
                OR '&ATTR' EQ '').RCHK000                          @Q1C 05620000
         AIF   ( '&ATTR' EQ 'UPDATE' OR '&ATTR' EQ                     -05630000
               'CONTROL' OR '&ATTR'(1,1) EQ '(').RCHK000                05640000
         AGO   .ERR04                                                   05650000
.RCHK000 ANOP                                                           05660000
.ERTN04  ANOP                                                           05670000
.* VALIDATE RACFIND PARAMETER                                      @L5A 05680000
         AIF   ('&RACFIND' NE 'YES' AND '&RACFIND' NE 'NO' AND         *05690000
               T'&RACFIND NE 'O').ERR05                            @L5A 05700000
         AIF   ('&RACFIND' NE '' AND &ICHLFS).ERR05A               @M4A 05710000
.ERTN05  ANOP                                                      @L5A 05720000
.* VALIDATE GENERIC PARAMETER                                           05730000
         AIF   ('&GENERIC' EQ '').ERTN11                           @L6A 05740000
         AIF   ('&GENERIC' NE 'YES' AND                                *05750000
               '&GENERIC' NE 'ASIS').ERR11                         @L6A 05760000
         AIF   ('&GENERIC' NE '' AND &ICHLFS).ERR11A               @M4A 05770000
.ERTN11  ANOP  ,                                                   @L6A 05780000
.* VALIDATE MF PARAMETER                                                05790000
         AIF   ('&MF' NE 'S' AND '&MF' NE 'L' AND '&MF'(1,2) NE        -05800000
               '(E' AND '&MF'(1,2) NE '(M' ).ERR06                 @P2C 05810000
.ERTN06  ANOP                                                           05820000
.* VALIDATE TAPELBL PARAMETER                                     @L7A  05830000
        AIF    ('&TAPELBL' NE 'STD' AND '&TAPELBL' NE 'BLP' AND        -05840000
               '&TAPELBL' NE 'NL' AND T'&TAPELBL NE 'O').ERR12    @L7A  05850000
         AIF   ('&TAPELBL' NE '' AND &ICHLFS).ERR12A              @M4A  05860000
.ERTN12  ANOP                                                     @L7A  05870000
.* VALIDATE STATUS PARAMETER                                      @L7A  05880000
         AIF   ('&STATUS' NE '' AND '&STATUS' NE 'ERASE'               +05890000
               AND '&STATUS' NE 'NONE').CONT1A                    @Q3C  05900000
         AGO   .CONT1B                                            @Q3A  05910000
.CONT1A  ANOP                                                     @Q3A  05920000
         AIF   ('&STATUS' NE 'EVERDOM' AND '&STATUS' NE 'ACCESS'       +05930000
               AND '&STATUS' NE 'WRITEONLY').ERR13                 @Q1C 05940000
.CONT1B  ANOP                                                           05950000
         AIF   ('&STATUS' NE '' AND &ICHLFS).ERR13A                @M4A 05960000
.ERTN13  ANOP                                                      @L7A 05970000
.*                                                                      05980000
.* VALIDATE THE RTOKEN PARAMETER. IT SHOULD NOT BE SPECIFIED WITH       05990000
.* THE SECOND ENTITY OPERAND BEING 'PRIVATE' OR 'CSA' IN THE LIST       06000000
.* AND STANDARD FORMS.                                                  06010000
.*                                                                      06020000
         AIF   ('&RTOKEN' EQ '' OR '&CMENTY2' EQ '').ERTN21        @P8A 06030000
         AIF   ('&CMENTY2' NE 'PRIVATE' AND '&CMENTY2' NE 'CSA').ERTN21 06040000
         AGO   .ERR21                                              @P8A 06050000
.ERTN21  ANOP                                                      @P8A 06060000
.*                                                                      06070000
.* GROUPID IS INVALID IF SPECIFIED FOR THE LFR FUNCTION            @M4A 06080000
         AIF   ('&GROUPID' NE '' AND &ICHLFS).ERR14A               @M4A 06090000
.* GROUPID REQUIRES A USERID FOR S FORM                            @L8A 06100000
         AIF   ('&MF' EQ 'S' AND                                       X06110000
               T'&GROUPID NE 'O' AND T'&USERID EQ 'O').ERR14       @L8A 06120000
.ERTN14  ANOP                                                      @L8A 06130000
.*                                                                 @M4A 06140000
.* VOLSER, OLDVOL, INSTLN, OWNER, ACCLVL, ACEE, APPL, FILESEQ ARE  @M4A 06150000
.* INVALID IF SPECIFIED FOR THE LFI EXPANSION.                     @M4A 06160000
.*                                                                 @M4A 06170000
         AIF   (&ICHLFS AND ('&VOLSER' NE '' OR '&OLDVOL' NE '' OR     -06180000
                '&INSTLN' NE '' OR '&OWNER' NE '' OR '&ACCLVL' NE      -06190000
                '' OR '&ACEE' NE '' OR '&APPL' NE '')).ERR15A      @M4A 06200000
         AIF   (&ICHLFS AND ('&FILESEQ' NE '')).ERR15A             @M4A 06210000
.ERTN15A ANOP                                                      @M4A 06220000
.*                                                                 @NJA 06230000
.*  Validate that:                                                 @NJA 06240000
.*    1. MEMCOUNT has not been specified on the same invocation    @NJA 06250000
.*       with any of the following keywords:                       @NJA 06260000
.*       - ACCLVL, ACEE, FILESEQ, GROUPID, MEMBER, OLDVOL,         @NJA 06270000
.*         PROFILE, RECVR, RTOKEN, STATUS, TAPELBL, USERID,        @NJA 06280000
.*         or UTOKEN                                               @NJA 06290000
.*    2. MEMBER has not been specified on the same invocation      @NJA 06300000
.*       with any of the following keywords:                       @NJA 06310000
.*       - ACCLVL, ACEE, FILESEQ, GROUPID, MEMCOUNT, OLDVOL,       @NJA 06320000
.*         PROFILE, RECVR, RTOKEN, STATUS, TAPELBL, USERID,        @NJA 06330000
.*         or UTOKEN                                               @NJA 06340000
.*    3. If MEMCOUNT and DSTYPE have been specified on the same    @NJA 06350000
.*       invocation, the DSTYPE value is N or L                    @NJA 06360000
.*    4. If MEMBER was specified, DSTYPE=L has also been           @NKC 06370000
.*       specified on the same invocation                          @NKC 06380000
.*    5. If DSTYPE=L has been specified, it has been specified     @NKA 06390000
.*       with either MEMCOUNT or MEMBER                            @NKA 06400000
.*                                                                 @NJA 06410000
         AIF   ('&MEMCOUNT' NE '' AND                                  +06420000
                ('&ACCLVL' NE '' OR '&ACEE' NE '' OR                   +06430000
                 '&FILESEQ' NE '' OR '&GROUPID' NE '' OR               +06440000
                 '&MEMBER' NE '' OR '&OLDVOL' NE '' OR                 +06450000
                 '&PROFILE' NE '' OR '&RECVR' NE '' OR                 +06460000
                 '&RTOKEN' NE '' OR '&STATUS' NE '' OR                 +06470000
                 '&TAPELBL' NE '' OR '&USERID' NE '' OR                +06480000
                                     '&UTOKEN' NE '')).ERR23       @NJA 06490000
.ERTN23  ANOP                                                      @NJA 06500000
         AIF   ('&MEMBER' NE '' AND                                    +06510000
                ('&ACCLVL' NE '' OR '&ACEE' NE '' OR                   +06520000
                 '&FILESEQ' NE '' OR '&GROUPID' NE '' OR               +06530000
                 '&MEMCOUNT' NE '' OR '&OLDVOL' NE '' OR               +06540000
                 '&PROFILE' NE '' OR '&RECVR' NE '' OR                 +06550000
                 '&RTOKEN' NE '' OR '&STATUS' NE '' OR                 +06560000
                 '&TAPELBL' NE '' OR '&USERID' NE '' OR                +06570000
                                     '&UTOKEN' NE '')).ERR24       @NJA 06580000
.ERTN24  ANOP                                                      @NJA 06590000
         AIF   ('&MEMCOUNT' NE '' AND ('&DSTYPE' EQ 'V' OR             +06600000
                '&DSTYPE' EQ 'M' OR '&DSTYPE' EQ 'T')).ERR25       @NJA 06610000
.ERTN25  ANOP                                                      @NJA 06620000
         AIF   ('&MEMBER' NE '' AND '&DSTYPE' NE 'L').ERR26        @NKC 06630000
.ERTN26  ANOP                                                      @NJA 06640000
         AIF   ('&DSTYPE' EQ 'L' AND                                   +06650000
                (T'&MEMCOUNT EQ 'O' AND                                +06660000
                 T'&MEMBER EQ 'O')).ERR27                          @NKA 06670000
.ERTN27  ANOP                                                      @NKA 06680000
.*                                                                 @M4A 06690000
.* REGISTER SPECIFICATION OF ADDR TYPE PARAMETERS NOT ALLOWED WITH LIST 06700000
.* FORM                                                                 06710000
         AIF   ('&MF' NE 'L').ERTN07                           @YA12773 06720000
         AIF   ('&INSTLN(1)' NE '&INSTLN').ERR07                        06730000
.RCHK006 ANOP                                                           06740000
         AIF   ('&CMENTY1' EQ '').RCHK010                          @M3C 06750000
         AIF   ('&CMENTY1'(1,1) EQ '(').ERR07                      @M3C 06760000
.RCHK010 ANOP                                                           06770000
         AIF   ('&CLASS' EQ '').RCHK020                                 06780000
         AIF   ('&CLASS'(1,1) EQ '(').ERR07                             06790000
.RCHK020 ANOP                                                           06800000
         AIF   ('&PROFILE' EQ '').RCHK030                               06810000
         AIF   ('&PROFILE'(1,1) EQ '(').ERR07                           06820000
.RCHK030 ANOP                                                           06830000
         AIF   ('&VOLSER' EQ '').RCHK060                                06840000
         AIF   ('&VOLSER'(1,1) EQ '(').ERR07                            06850000
.RCHK060 ANOP                                                           06860000
         AIF   ('&OLDVOL' EQ '').RCHK065                       @PC002PY 06870000
         AIF   ('&OLDVOL'(1,1) EQ '(').ERR07                   @PC002PY 06880000
.RCHK065 ANOP                                                           06890000
         AIF   ('&ATTR' EQ '').RCHK070                         @PC002PY 06900000
         AIF   ('&ATTR'(1,1) EQ '(').ERR07                     @PC002PY 06910000
.RCHK070 ANOP                                                           06920000
         AIF   ('&APPL' EQ '').RCHK075                         @PC003PY 06930000
         AIF   ('&APPL'(1,1) EQ '(').ERR07                     @PC003PY 06940000
.RCHK075 ANOP                                                  @PC003PY 06950000
         AIF   ('&ACEE' EQ '').RCHK080                         @PC003PY 06960000
         AIF   ('&ACEE'(1,1) EQ '(').ERR07                     @PC003PY 06970000
.RCHK080 ANOP                                                  @PC003PY 06980000
         AIF   ('&OWNER' EQ '').RCHK090                          @L4A   06990000
         AIF   ('&OWNER'(1,1) EQ '(').ERR07                      @L4A   07000000
.RCHK090 ANOP  ,                                                 @L4A   07010000
         AIF   ('&ACCLVL' EQ '').RCHK096                         @L7A   07020000
         AIF   (T'&ACCLVL(1) EQ 'O').RCHK095                     @L5A   07030000
         AIF   ('&ACCLVL(1)'(1,1) EQ '(').ERR07                  @L5A   07040000
.RCHK095 ANOP  ,                                                 @L4A   07050000
         AIF   (N'&ACCLVL EQ 1).RCHK096                          @L7A   07060000
         AIF   (T'&ACCLVL(2) EQ 'O').RCHK096                     @L7A   07070000
         AIF   ('&ACCLVL(2)'(1,1) EQ '(').ERR07                  @L5A   07080000
.RCHK096 ANOP                                                    @L7A   07090000
         AIF   ('&FILESEQ' EQ '').RCHK100                        @L7A   07100000
         AIF   ('&FILESEQ'(1,1) EQ '(').ERR07                    @L7A   07110000
.RCHK100 ANOP                                                  @PC003PY 07120000
         AIF   ('&USERID' EQ '').RCHK105                           @L8A 07130000
         AIF   ('&USERID'(1,1) EQ '(').ERR07                       @L8A 07140000
.RCHK105 ANOP                                                      @L8A 07150000
         AIF   ('&GROUPID' EQ '').RCHK110                          @L8A 07160000
         AIF   ('&GROUPID'(1,1) EQ '(').ERR07                      @L8A 07170000
.RCHK110 ANOP                                                      @L8A 07180000
         AIF   ('&DDNAME' EQ '').RCHK115                       @YA12773 07190000
         AIF   ('&DDNAME'(1,1) EQ '(').ERR07                   @YA12773 07200000
.RCHK115 ANOP                                                  @YA12773 07210000
         AIF   ('&LOGSTR' EQ '').RCHK120                           @M2A 07220000
         AIF   ('&LOGSTR'(1,1) EQ '(').ERR07                       @M2A 07230000
.RCHK120 ANOP                                                     3@D1D 07240000
         AIF   ('&UTOKEN' EQ '').RCHK130                           @M2A 07250000
         AIF   ('&UTOKEN'(1,1) EQ '(').ERR07                       @M2A 07260000
.RCHK130 ANOP                                                      @M2A 07270000
         AIF   ('&RTOKEN' EQ '').RCHK135                           @M2A 07280000
         AIF   ('&RTOKEN'(1,1) EQ '(').ERR07                       @M2A 07290000
.RCHK135 ANOP                                                      @M2A 07300000
         AIF   ('&RECVR' EQ '').RCHK140                            @M2A 07310000
         AIF   ('&RECVR'(1,1) EQ '(').ERR07                        @M2A 07320000
.RCHK140 ANOP                                                      @M2A 07330000
         AIF   ('&MEMCOUNT' EQ '').RCHK145                         @NJA 07340000
         AIF   ('&MEMCOUNT'(1,1) EQ '(').ERR07                     @NJA 07350000
.RCHK145 ANOP                                                      @NJA 07360000
         AIF   ('&MEMBER' EQ '').RCHK150                           @NJA 07370000
         AIF   ('&MEMBER'(1,1) EQ '(').ERR07                       @NJA 07380000
.RCHK150 ANOP                                                      @NJA 07390000
.ERTN07  ANOP                                                           07400000
.* PRODUCE LIST FORM IF REQUESTED                                       07410000
         AIF   ('&MF' NE 'L').RCHK430                                   07420000
         AIF   ('&SYMBOL' EQ '').RCHK160                                07430000
&SYMBOL  DS    0F                                                       07440000
         AGO   .RCHK16Y                                          @L4A   07450000
.RCHK160 ANOP                                                           07460000
         DS    0F                                                @L4A   07470000
.RCHK16Y ANOP  ,                                                 @L4A   07480000
ICH0&SYSNDX EQU *                                                       07490000
.RCHK16X ANOP                                                           07500000
.* PRODUCE LENGTH AND INSTALLATION DATA                                 07510000
.****** IF THIS MACRO WAS INVOKED BY THE RACROUTE MACRO            @T1A 07520000
.****** THE 3 BYTES AFTER LENGTH ARE RESERVED, AND INSTLN IS       @T1A 07530000
.****** GENERATED AT THE END OF THE LIST.                          @T1A 07540000
         AIF   (NOT &ICHCOM AND NOT &ICHRAC).RCHK16A               @M3C 07550000
&ICHL    DC    AL1(&PARMLEN)    LENGTH OF RACHECK PARAMETER LIST   @L7A 07560000
         DC    AL3(0)                                              @T1A 07570000
         AGO   .RCHK162         PRODUCE 1ST FLAG BYTE              @T1A 07580000
.RCHK16A ANOP                                                      @T1A 07590000
         DC    AL1(&PARMLEN)    LENGTH OF RACHECK PARAMETER LIST   @L7A 07600000
         AIF   ('&INSTLN' EQ '' OR                                     *07610000
               '&INSTLN(1)' NE '&INSTLN').RCHK161              @PC002PY 07620000
         DC    AL3(&INSTLN) - ADDRESS OF INSTALLATION DATA              07630000
         AGO   .RCHK162                                                 07640000
.RCHK161 ANOP                                                           07650000
         DC    AL3(0) - ADDRESS OF INSTALLATION DATA                    07660000
.RCHK162 ANOP                                                           07670000
.* PRODUCE FIRST FLAG BYTE IN LIST                                      07680000
         AIF   (T'&RACFIND EQ 'O').RCHK166                         @L5A 07690000
&BIT0    SETA  1                   RACFIND CODED                   @L5A 07700000
         AIF   ('&RACFIND' NE 'YES').RCHK166                       @L5A 07710000
&BIT1    SETA  1                   RACFIND=YES                     @L5A 07720000
.RCHK166 ANOP                                                      @L5A 07730000
&BIT2    SETA  &LONGNAM           INDICATE ENTITYX IS SPECIFIED.   @M3A 07740000
         AIF   ('&CMENTY2' NE 'CSA').RCHK170                       @M3C 07750000
&BIT7    SETA  1                                               @PC002PY 07760000
.RCHK170 ANOP                                                           07770000
         AIF   ('&DSTYPE' NE 'V').RCHK180                          @T1A 07780000
&BIT3    SETA  1                                                        07790000
.RCHK180 ANOP                                                      @T1A 07800000
.**************************************************                @T1A 07810000
.* IF THIS MACRO WAS INVOKED BY THE RACROUTE MACRO,                @T1A 07820000
.* THE PARAMETER LIST HAS 31-BIT ADDRESSING.                       @T1A 07830000
.**************************************************                @T1A 07840000
         AIF   (NOT &ICHCOM AND NOT &ICHRAC).RCHK200               @M3C 07850000
&BIT4    SETA  1                  31-BIT ADDRESSING IN PARM LIST   @T1A 07860000
.RCHK200 ANOP                                                           07870000
         AIF   ('&LOG' NE 'NOFAIL' AND                                 -07880000
               '&LOG' NE 'NOSTAT').RCHK220                     @ZA60572 07890000
&BIT5    SETA  1                                                        07900000
.RCHK220 ANOP                                                           07910000
         AIF   ('&LOG' NE 'NONE' AND                                   -07920000
               '&LOG' NE 'NOSTAT').RCHK230                     @ZA60572 07930000
&BIT6    SETA  1                                                        07940000
.RCHK230 ANOP                                                           07950000
         DC    B'&BIT0&BIT1&BIT2&BIT3&BIT4&BIT5&BIT6&BIT7'              07960000
.****** IF THIS MACRO WAS INVOKED BY THE RACROUTE MACRO            @T1A 07970000
.****** THE NEXT 3 BYTES ARE RESERVED AND ENTITY AND PROFILE       @T1A 07980000
.****** GENERATED AT THE END OF THE LIST.                          @T1A 07990000
         AIF   (NOT &ICHCOM AND NOT &ICHRAC).RCHK235               @M3C 08000000
         DC    AL3(0)                                              @T1A 08010000
         AGO   .RCHK270                                            @T1A 08020000
.RCHK235 ANOP                                                      @T1A 08030000
.* PRODUCE ENTITY NAME OR PROFILE ADDRESS                      @PC002PY 08040000
         AIF   ('&CMENTY1' EQ '').RCHK240                          @M3C 08050000
         AIF   ('&CMENTY1'(1,1) EQ '(').RCHK240                    @M3C 08060000
         DC    AL3(&CMENTY1)         - ENTITY/ENTITYX NAME ADDRESS @M3C 08070000
         AGO   .RCHK270                                                 08080000
.RCHK240 ANOP                                                           08090000
         AIF   ('&PROFILE' EQ '').RCHK260                               08100000
         AIF   ('&PROFILE'(1,1) EQ '(').RCHK260                         08110000
         DC    AL3(&PROFILE) -PROFILE ADDRESS                           08120000
         AGO   .RCHK270                                                 08130000
.RCHK260 ANOP                                                           08140000
         DC    AL3(0) -       ENTITY OR PROFILE ADDRESS FIELD  @PC002PY 08150000
.RCHK270 ANOP                                                           08160000
.* PRODUCE SECOND FLAG BYTE WITH ATTR PARAMETER                         08170000
.* RESET BIT SET SYMBOLS                                                08180000
&BIT0    SETA  0                                                        08190000
&BIT1    SETA  0                                                        08200000
&BIT2    SETA  0                                                        08210000
&BIT3    SETA  0                                                        08220000
&BIT4    SETA  0                                                        08230000
&BIT5    SETA  0                                                        08240000
&BIT6    SETA  0                                                        08250000
&BIT7    SETA  0                                                        08260000
         AIF   ('&ATTR' EQ '').RCHK335                                  08270000
         AIF   ('&ATTR'(1,1) EQ '(').RCHK340                            08280000
         AIF   ('&ATTR' NE 'ALTER').RCHK280                             08290000
&BIT0    SETA  1                                                        08300000
         AGO   .RCHK340                                                 08310000
.RCHK280 ANOP                                                           08320000
         AIF   ('&ATTR' NE 'CONTROL').RCHK320                           08330000
&BIT4    SETA  1                                                        08340000
         AGO   .RCHK340                                                 08350000
.RCHK320 ANOP                                                           08360000
         AIF   ('&ATTR' NE 'UPDATE').RCHK330                            08370000
&BIT5    SETA  1                                                        08380000
         AGO   .RCHK340                                                 08390000
.RCHK330 ANOP                                                           08400000
         AIF   ('&ATTR' NE 'READ').RCHK340                              08410000
.RCHK335 ANOP                                                           08420000
&BIT6    SETA  1                                                        08430000
.RCHK340 ANOP                                                           08440000
         DC    B'&BIT0.000&BIT4&BIT5&BIT6.0'                       @Q1C 08450000
.****** IF THIS MACRO WAS INVOKED BY THE RACROUTE MACRO            @T1A 08460000
.****** THE NEXT 3 BYTES ARE RESERVED AND CLASS NAME ADDR IS       @T1A 08470000
.****** GENERATED AT THE END OF THE LIST.                          @T1A 08480000
         AIF   (NOT &ICHCOM AND NOT &ICHRAC).RCHK345               @M3C 08490000
         DC    AL3(0)                                              @T1A 08500000
         AGO   .RCHK370                                            @T1A 08510000
.RCHK345 ANOP                                                      @T1A 08520000
.* PRODUCE CLASS NAME ADDRESS IF REQUIRED                               08530000
         AIF   ('&CLASS' EQ '').RCHK360                                 08540000
         AIF   ('&CLASS'(1,1) EQ '(').RCHK360                           08550000
         AIF   ('&CLASS'(1,1) EQ '''').RCHK350                          08560000
         DC    AL3(&CLASS) -  CLASS NAME ADDRESS                        08570000
         AGO   .RCHK370                                                 08580000
.RCHK350 ANOP                                                           08590000
         DC    AL3(ICH1&SYSNDX) CLASS NAME ADDRESS WITHIN LIST @PC003PY 08600000
         AGO   .RCHK370                                                 08610000
.RCHK360 ANOP                                                           08620000
         DC    AL3(0) -       CLASS NAME ADDRESS FIELD                  08630000
.RCHK370 ANOP                                                           08640000
.* PRODUCE THIRD FLAG BYTE                                              08650000
&BIT0    SETA  0                                                   @L7A 08660000
&BIT1    SETA  0                                                   @L4A 08670000
&BIT2    SETA  0                                                        08680000
&BIT3    SETA  0                                                   @L6A 08690000
&BIT4    SETA  0                                                   @L6A 08700000
&BIT5    SETA  0                                                   @L6A 08710000
&BIT6    SETA  0                                                   @P1A 08720000
&BIT7    SETA  0                                                   @NKA 08730000
         AIF   ('&DSTYPE' NE 'M' AND '&DSTYPE' NE 'T').RCHK372     @L7A 08740000
         AIF   ('&DSTYPE' NE 'M').RCHK371                          @L7A 08750000
&BIT1    SETA  1                            DSTYPE=M X'40'         @L4A 08760000
         AGO   .RCHK372                                            @L7A 08770000
.RCHK371 ANOP                                                      @L7A 08780000
&BIT0    SETA  1                            DSTYPE=T X'80'         @L7A 08790000
.RCHK372 AIF   ('&PROFILE' EQ '').RCHK373                               08800000
&BIT2    SETA  1                                                        08810000
.RCHK373 ANOP                                                           08820000
         AIF   ('&GENERIC' EQ '' OR '&GENERIC' EQ 'ASIS').RCHK374  @L6A 08830000
&BIT5    SETA  1         GENERIC=YES SPECIFIED                     @L6A 08840000
.RCHK374 ANOP  ,                                                   @L6A 08850000
         AIF   ('&CMENTY2' NE 'PRIVATE').RCHK375                   @M3C 08860000
&BIT6    SETA  1           ENTITY/ENTITYX=(...,PRIVATE) SPECIFIED  @P1A 08870000
.RCHK375 ANOP  ,                                                   @P1A 08880000
         AIF   ('&DSTYPE' NE 'L').RCHK376                          @NKA 08890000
&BIT7    SETA  1                            DSTYPE=L X'01'         @NKA 08900000
.RCHK376 ANOP  ,                                                   @NKA 08910000
         DC    B'&BIT0&BIT1&BIT2&BIT3&BIT4&BIT5&BIT6.&BIT7' Flag3  @NKC 08920000
.****** IF THIS MACRO WAS INVOKED BY THE RACROUTE MACRO            @T1A 08930000
.****** THE NEXT 3 BYTES ARE RESERVED AND VOLSER ADDR IS           @T1A 08940000
.****** GENERATED AT THE END OF THE LIST.                          @T1A 08950000
         AIF   (NOT &ICHCOM AND NOT &ICHRAC).RCHK380               @M3C 08960000
         DC    AL3(0)                                              @T1A 08970000
         AGO   .RCHK410                                            @T1A 08980000
.RCHK380 ANOP                                                      @T1A 08990000
         AIF   ('&VOLSER' EQ '').RCHK400                                09000000
         AIF   ('&VOLSER'(1,1) EQ '(').RCHK400                          09010000
         DC    AL3(&VOLSER) - VOLSER ADDRESS                            09020000
         AGO   .RCHK410                                                 09030000
.RCHK400 ANOP                                                           09040000
         DC    AL3(0) -       VOLSER ADDR FIELD                         09050000
.RCHK410 ANOP                                                           09060000
         AIF   ('&OLDVOL' EQ '').RCHK415                       @PC002PY 09070000
         AIF   ('&OLDVOL'(1,1) EQ '(').RCHK415                 @PC002PY 09080000
         DC    A(&OLDVOL) - OLD VOLSER ADDRESS                 @PC002PY 09090000
         AGO   .RCHK416                                        @PC002PY 09100000
.RCHK415 ANOP                                                  @PC002PY 09110000
         DC    A(0) -       OLD VOLSER ADDR FIELD              @PC002PY 09120000
.RCHK416 ANOP                                                  @PC002PY 09130000
         AIF   ('&APPL' EQ '').RCHK41B                         @PC003PY 09140000
         AIF   ('&APPL'(1,1) EQ '(').RCHK41B                   @PC003PY 09150000
         AIF   ('&APPL'(1,1) EQ '''').RCHK41A                  @PC003PY 09160000
         DC    A(&APPL) - APPL NAME ADDRESS                    @PC003PY 09170000
         AGO   .RCHK41C                                        @PC003PY 09180000
.RCHK41A ANOP                                                  @PC003PY 09190000
         DC    A(ICH2&SYSNDX) - APPL NAME ADDRESS              @PC003PY 09200000
         AGO   .RCHK41C                                        @PC003PY 09210000
.RCHK41B ANOP                                                  @PC003PY 09220000
         DC    A(0)     - APPL ADDRESS                         @PC003PY 09230000
.RCHK41C ANOP                                                  @PC003PY 09240000
         AIF   ('&ACEE' EQ '').RCHK41D                         @PC003PY 09250000
         AIF   ('&ACEE'(1,1) EQ '(').RCHK41D                   @PC003PY 09260000
         DC    A(&ACEE) - ACEE NAME ADDRESS                    @PC003PY 09270000
         AGO   .RCHK41E                                        @PC003PY 09280000
.RCHK41D ANOP                                                  @PC003PY 09290000
         DC    A(0)     - ACEE ADDRESS                         @PC003PY 09300000
.RCHK41E ANOP                                                  @PC003PY 09310000
         AIF   ('&OWNER' EQ '').RCHK41F                          @L4A   09320000
         AIF   ('&OWNER'(1,1) EQ '(').RCHK41F                    @L4A   09330000
         DC    A(&OWNER) - OWNER NAME ADDRESS.                   @L4A   09340000
         AGO   .RCHK41G                                          @L4A   09350000
.RCHK41F ANOP  ,                                                 @L4A   09360000
         DC    A(0)     - OWNER ADDRESS.                         @L4A   09370000
.RCHK41G ANOP  ,                                                 @L4A   09380000
.******************************************************            @T1A 09390000
.* IF THIS MACRO WAS INVOKED INTERNALLY BY THE RACROUTE            @T1A 09400000
.* MACRO, INSTLN,CLASS,ENTITY,PROFILE,AND VOLSER ARE               @T1A 09410000
.* PRODUCED HERE AS 31-BIT ADDRESSES.                              @T1A 09420000
.******************************************************            @T1A 09430000
         AIF   (NOT &ICHCOM AND NOT &ICHRAC).RCHK41Z               @M3C 09440000
.* PRODUCE INSTLN ADDRESS FIELD                                    @T1A 09450000
         AIF   ('&INSTLN' EQ '' OR                                     *09460000
               '&INSTLN(1)' NE '&INSTLN').RCHK41H                  @T1A 09470000
         DC    A(&INSTLN)   ADDRESS OF INSTALLATION DATA           @T1A 09480000
         AGO   .RCHK41J                                            @T1A 09490000
.RCHK41H ANOP                                                      @T1A 09500000
         DC    A(0)            ADDRESS OF INSTALLATION DATA        @T1A 09510000
.RCHK41J ANOP                                                      @T1A 09520000
.* PRODUCE ENTITY NAME OR PROFILE ADDRESS                          @T1A 09530000
         AIF   ('&CMENTY1' EQ '').RCHK41K                          @M3C 09540000
         AIF   ('&CMENTY1'(1,1) EQ '(').RCHK41K                    @M3C 09550000
         DC    A(&CMENTY1)      ENTITY NAME ADDRESS                @M3C 09560000
         AGO   .RCHK41M                                            @T1A 09570000
.RCHK41K ANOP                                                      @T1A 09580000
         AIF   ('&PROFILE' EQ '').RCHK41L                          @T1A 09590000
         AIF   ('&PROFILE'(1,1) EQ '(').RCHK41L                    @T1A 09600000
         DC    A(&PROFILE)      PROFILE ADDRESS                    @T1A 09610000
         AGO   .RCHK41M                                            @T1A 09620000
.RCHK41L ANOP                                                      @T1A 09630000
         DC    A(0)             ENTITY OR PROFILE ADDRESS FIELD    @T1A 09640000
.RCHK41M ANOP                                                      @T1A 09650000
.* PRODUCE CLASS NAME ADDRESS IF REQUIRED                          @T1A 09660000
         AIF   ('&CLASS' EQ '').RCHK41P                            @T1A 09670000
         AIF   ('&CLASS'(1,1) EQ '(').RCHK41P                      @T1A 09680000
         AIF   ('&CLASS'(1,1) EQ '''').RCHK41N                     @T1A 09690000
         DC    A(&CLASS)       CLASS NAME ADDRESS                  @T1A 09700000
         AGO   .RCHK41Q                                            @T1A 09710000
.RCHK41N ANOP                                                      @T1A 09720000
         DC    A(ICH1&SYSNDX) CLASS NAME ADDRESS WITHIN LIST       @T1A 09730000
         AGO   .RCHK41Q                                            @T1A 09740000
.RCHK41P ANOP                                                      @T1A 09750000
         DC    A(0)            CLASS NAME ADDRESS FIELD            @T1A 09760000
.RCHK41Q ANOP                                                      @T1A 09770000
.* PRODUCE VOLSER ADDRESS FIELD                                    @T1A 09780000
         AIF   ('&VOLSER' EQ '').RCHK41R                           @T1A 09790000
         AIF   ('&VOLSER'(1,1) EQ '(').RCHK41R                     @T1A 09800000
         DC    A(&VOLSER)      VOLSER ADDRESS                      @T1A 09810000
         AGO   .RCHK41Z                                            @T1A 09820000
.RCHK41R ANOP                                                      @T1A 09830000
         DC    A(0)            VOLSER ADDR FIELD                   @T1A 09840000
.RCHK41Z ANOP                                                      @T1A 09850000
         AIF   (&ICHCOM).RCHK41Y                                   @M3A 09860000
         AIF   (&ICHRAC).RCHK41Y                                   @L5A 09870000
.* GENERATE FOUR UNUSED FULLWORDS FOR 31-BIT COMPATIBILITY         @L5A 09880000
         DC    4A(0)                                               @L5A 09890000
.RCHK41Y ANOP                                                      @L5A 09900000
         AIF   ('&ACCLVL' NE '').RCHKACH                         @L5A   09910000
         DC    A(0)     - ACCESS VALUE ADDRESS.                  @L5A   09920000
         DC    A(0)     - 2ND ACCESS ADDRESS.                    @L5A   09930000
         AGO   .RCHKACI                                          @L5A   09940000
.RCHKACH ANOP  ,                                                 @L5A   09950000
         AIF   (T'&ACCLVL(1) NE 'O').RCHKACJ                     @L5A   09960000
         DC    A(0)     - ACCESS VALUE ADDRESS.                  @L5A   09970000
         AGO   .RCHKACL                                          @L5A   09980000
.RCHKACJ ANOP  ,                                                 @L5A   09990000
         AIF   ('&ACCLVL(1)'(1,1) NE '(').RCHKACK                @L5A   10000000
         DC    A(0)     - ACCESS VALUE ADDRESS.                  @L5A   10010000
         AGO   .RCHKACL                                          @L5A   10020000
.RCHKACK ANOP  ,                                                 @L5A   10030000
         DC    A(&ACCLVL(1)) - ACCESS VALUE ADDRESS.             @L5A   10040000
.RCHKACL ANOP  ,                                                 @L5A   10050000
         AIF   (T'&ACCLVL(2) NE 'O').RCHKACM                     @L5A   10060000
         DC    A(0)     - 2ND ACCESS ADDRESS.                    @L5A   10070000
         AGO   .RCHKACI                                          @L5A   10080000
.RCHKACM ANOP  ,                                                 @L5A   10090000
         AIF   ('&ACCLVL(2)'(1,1) NE '(').RCHKACN                @L5A   10100000
         DC    A(0)     - 2ND ACCESS ADDRESS.                    @L5A   10110000
         AGO   .RCHKACI                                          @L5A   10120000
.RCHKACN ANOP  ,                                                 @L5A   10130000
         DC    A(&ACCLVL(2)) - 2ND ACCESS ADDRESS.               @L5A   10140000
.RCHKACI ANOP  ,                                                 @L5A   10150000
         AIF   (&RLVL LE 2).RLVLX21 BYPASS CODE IF 1.6 VERSION    @L7A  10160000
.* PRODUCE FILESEQ CONSTANT                                       @L7A  10170000
.RCHKADA ANOP                                                     @L7A  10180000
         AIF   ('&FILESEQ' EQ '').RCHKADD        FILESEQ OMITTED  @L7A  10190000
         AIF   ('&FILESEQ'(1,1) EQ '(').RCHKADD  REG SPEC         @L7A  10200000
         AIF   ('&FILESEQ' GE '65536').ERR22                      @N8A  10210000
.ERTN22  ANOP                                                     @N8A  10220000
         DC    AL2(&FILESEQ)    FILESEQ CONSTANT                  @L7A  10230000
         AGO   .RCHKADZ                                           @L7A  10240000
.RCHKADD ANOP                                                     @L7A  10250000
         DC    AL2(0)          FILESEQ                            @L7A  10260000
.RCHKADZ ANOP                                                     @L7A  10270000
.* PRODUCE TAPE FLAG BYTE   X'00'=STD X'01'=NL X'10'=BLP          @L7A  10280000
.RCHKAEA ANOP                                                     @L7A  10290000
&BIT0    SETA  0                                                  @L7A  10300000
&BIT1    SETA  0                                                  @L7A  10310000
         AIF   ('&TAPELBL' EQ '' OR '&TAPELBL' EQ 'STD').RCHKAEX  @L7A  10320000
         AIF   ('&TAPELBL' NE 'BLP').RCHKAED                      @L7A  10330000
&BIT0    SETA  1                            TAPELBL=BLP           @L7A  10340000
         AGO   .RCHKAEX                                           @L7A  10350000
.RCHKAED ANOP                                                     @L7A  10360000
&BIT1    SETA  1                            TAPELBL=NL            @L7A  10370000
.RCHKAEX ANOP                                                     @L7A  10380000
         DC    B'&BIT0&BIT1.000000'                               @L7A  10390000
.RCHKAEZ ANOP                                                     @L7A  10400000
.* PRODUCE FOURTH FLAG BYTE                                       @L7A  10410000
.RCHKAFA ANOP                                                     @L7A  10420000
&BIT0    SETA  0                                                  @L7A  10430000
&BIT1    SETA  0                                                  @D2A  10440000
&BIT2    SETA  0                                                  @D4A  10450000
&BIT3    SETA  0                                                  @Q8A  10460000
         AIF   ('&STATUS' NE 'ERASE').RCHKAFX                     @L7A  10470000
&BIT0    SETA  1                          STATUS=ERASE     -X'80' @L7A  10480000
.RCHKAFX ANOP                                                     @L7A  10490000
         AIF   ('&STATUS' NE 'EVERDOM').RCHKEV4                   @D2A  10500000
&BIT1    SETA  1                          STATUS=EVERDOM   -X'40' @D2A  10510000
.RCHKEV4 ANOP                                                     @D2A  10520000
         AIF   ('&STATUS' NE 'WRITEONLY').RCHKACC                 @Q1C  10530000
&BIT2    SETA  1                          STATUS=WRITEONLY -X'20' @D4A  10540000
.RCHKACC ANOP                                                     @Q1A  10550000
         AIF   ('&STATUS' NE 'ACCESS').RCHKAFY                    @Q1A  10560000
&BIT3    SETA  1                          STATUS=ACCESS    -X'10' @Q1A  10570000
.RCHKAFY ANOP                                                     @D4A  10580000
         DC    B'&BIT0&BIT1&BIT2&BIT3.0000'                       @Q1C  10590000
.RCHKAFZ ANOP                                                     @L7A  10600000
         AIF   (&RLVL LE 3).RLVLX21  BYPASS IF 1.7 OR LOWER       @L8A  10610000
         AIF   ('&USERID' EQ '').RCHKB10  USERID OMITTED          @L8A  10620000
         AIF   ('&USERID'(1,1) EQ '(').RCHKB10                    @L8A  10630000
         AIF   ('&USERID'(1,1) EQ '''').RCHKB05                   @L8A  10640000
         DC    A(&USERID) - USER NAME ADDRESS                     @L8A  10650000
         AGO   .RCHKB15                                           @L8A  10660000
.RCHKB05 ANOP                                                     @L8A  10670000
         DC    A(ICH3&SYSNDX) - USER NAME ADDRESS                 @L8A  10680000
         AGO   .RCHKB15                                           @L8A  10690000
.RCHKB10 ANOP                                                     @L8A  10700000
         DC    A(0) - USER NAME ADDRESS                           @L8A  10710000
.RCHKB15 ANOP                                                     @L8A  10720000
         AIF   ('&GROUPID' EQ '').RCHKB25 GROUPID OMITTED         @L8A  10730000
         AIF   ('&GROUPID'(1,1) EQ '(').RCHKB25                   @L8A  10740000
         AIF   ('&GROUPID'(1,1) EQ '''').RCHKB20                  @L8A  10750000
         DC    A(&GROUPID) - GROUP NAME ADDRESS                   @L8A  10760000
         AGO   .RCHKB30                                           @L8A  10770000
.RCHKB20 ANOP                                                     @L8A  10780000
         DC    A(ICH4&SYSNDX) - GROUP NAME ADDRESS                @L8A  10790000
         AGO   .RCHKB30                                           @L8A  10800000
.RCHKB25 ANOP                                                     @L8A  10810000
         DC    A(0) - GROUP NAME ADDRESS                          @L8A  10820000
.RCHKB30 ANOP                                                     @L8A  10830000
         AIF   (&RLVL LT 6).RLVLX21  SKIP IF BEFORE 1.8X          @P4C  10840000
         AIF   ('&DDNAME' EQ '').RCHKB35 DDNAME  OMITTED      @YA12773  10850000
         AIF   ('&DDNAME'(1,1) EQ '(').RCHKB35                @YA12773  10860000
         DC    A(&DDNAME) - DDNAME ADDRESS                    @YA12773  10870000
         AGO   .RCHKB40                                       @YA12773  10880000
.RCHKB35 ANOP                                                 @YA12773  10890000
         DC    A(0) - DDNAME ADDRESS                          @YA12773  10900000
.RCHKB40 ANOP                                                 @YA12773  10910000
         AIF   (&RLVL LT 7).RLVL20X  SKIP IF BEFORE 1.9            @P6C 10920000
         DC    A(0) - RESERVED                                     @M2A 10930000
.RCHKB48 ANOP                                                      @M2A 10940000
         AIF   ('&UTOKEN' EQ '').RCHKB50 UTOKEN OMITTED            @M2A 10950000
         AIF   ('&UTOKEN'(1,1) EQ '(').RCHKB50                     @M2A 10960000
         DC    A(&UTOKEN)    - UTOKEN NAME ADDRESS                 @M2A 10970000
         AGO   .RCHKB55                                            @M2A 10980000
.RCHKB50 ANOP                                                      @M2A 10990000
         DC    A(0) - UTOKEN ADDRESS                               @M2A 11000000
.RCHKB55 ANOP                                                      @M2A 11010000
         AIF   ('&RTOKEN' EQ '').RCHKB57 RTOKEN OMITTED            @M2A 11020000
         AIF   ('&RTOKEN'(1,1) EQ '(').RCHKB57                     @M2A 11030000
         DC    A(&RTOKEN)    - RTOKEN  ADDRESS                     @M2A 11040000
         AGO   .RCHKB59                                            @M2A 11050000
.RCHKB57 ANOP                                                      @M2A 11060000
         DC    A(0) - RTOKEN ADDRESS                               @M2A 11070000
.RCHKB59 ANOP                                                      @M2A 11080000
         AIF   ('&LOGSTR' EQ '').RCHKB60 LOGSTR OMITTED            @M2A 11090000
         AIF   ('&LOGSTR'(1,1) EQ '(').RCHKB60                     @M2A 11100000
         DC    A(&LOGSTR)    - LOGSTR ADDRESS                      @M2A 11110000
         AGO   .RCHKB65                                            @M2A 11120000
.RCHKB60 ANOP                                                      @M2A 11130000
         DC    A(0) - LOGSTR ADDRESS                               @M2A 11140000
.RCHKB65 ANOP                                                      @M2A 11150000
         AIF   ('&RECVR' EQ '').RCHKB70 RECVR OMITTED              @M2A 11160000
         AIF   ('&RECVR'(1,1) EQ '(').RCHKB70                      @M2A 11170000
         DC    A(&RECVR)     - RECEIVER ADDRESS                    @M2A 11180000
         AGO   .RCHKB75                                            @M2A 11190000
.RCHKB70 ANOP                                                      @M2A 11200000
         DC    A(0) - RECEIVER ADDRESS                             @M2A 11210000
.RCHKB75 ANOP                                                      @M2A 11220000
         AIF   (&RLVL LT 29).RLVLX21  Skip if prior to z/OS V2R2   @PAA 11230000
         AIF   ('&MEMCOUNT' EQ '').RCHKB80 - MEMCOUNT omitted      @NJA 11240000
         AIF   ('&MEMCOUNT'(1,1) EQ '(').RCHKB80                   @NJA 11250000
         DC    A(&MEMCOUNT)  - MEMCOUNT Address                    @NJA 11260000
         AGO   .RCHKB85                                            @NJA 11270000
.RCHKB80 ANOP                                                      @NJA 11280000
         DC    A(0) - MEMCOUNT Address                             @NJA 11290000
.RCHKB85 ANOP                                                      @NJA 11300000
         AIF   ('&MEMBER' EQ '').RCHKB90 - MEMBER omitted          @NJA 11310000
         AIF   ('&MEMBER'(1,1) EQ '(').RCHKB90                     @NJA 11320000
         DC    A(&MEMBER)    - MEMBER Address                      @NJA 11330000
         AGO   .RCHKB95                                            @NJA 11340000
.RCHKB90 ANOP                                                      @NJA 11350000
         DC    A(0) - MEMBER Address                               @NJA 11360000
.RCHKB95 ANOP                                                      @NJA 11370000
         AGO   .RLVLX21                                            @P6A 11380000
.RLVL20X ANOP                                                      @P6A 11390000
         DC    4F'0'       RESERVED                                @P6A 11400000
.RLVLX21 ANOP                      END OF 1.6 BYPASS               @L7A 11410000
.* IF CLASSNAME SPECIFIED EXPLICITLY, PRODUCE IT BELOW LIST FORM        11420000
         AIF   ('&CLASS' EQ '').RCHK417                                 11430000
         AIF   ('&CLASS'(1,1) NE '''').RCHK417                          11440000
&CLNGTH  SETA  K'&CLASS-2                                               11450000
ICH1&SYSNDX EQU   *+1                                          @PC003PY 11460000
         DC    AL2(&CLNGTH) - CLASS NAME LENGTH                         11470000
.* NOTE THAT TWO BYTES MUST BE RESERVED FOR ALIGNMENT OF SVC THAT MAY   11480000
.* FOLLOW IN STANDARD FORM USAGE                                        11490000
         DC    CL8&CLASS                                                11500000
.* IF APPLNAME SPECIFIED EXPLICITLY, PRODUCE IT BELOW LIST FORM         11510000
.RCHK417 ANOP                                                  @PC003PY 11520000
         AIF   ('&APPL' EQ '').RCHK418                             @L8A 11530000
         AIF   ('&APPL'(1,1) NE '''').RCHK418                      @L8A 11540000
ICH2&SYSNDX DC    CL8&APPL                                     @PC003PY 11550000
.* IF USERID SPECIFIED EXPLICITLY, PRODUCE IT BELOW LIST FORM     @L8A  11560000
.RCHK418 ANOP                                                     @L8A  11570000
         AIF   ('&USERID' EQ '').RCHK419                          @L8A  11580000
         AIF   ('&USERID'(1,1) NE '''').RCHK419                   @L8A  11590000
ICH3&SYSNDX DC    CL8&USERID                     - USER NAME      @L8A  11600000
.* IF GROUPID SPECIFIED EXPLICITLY, PRODUCE IT BELOW LIST FORM    @L8A  11610000
.RCHK419 ANOP                                                     @L8A  11620000
         AIF   ('&GROUPID' EQ '').RCHK420                         @L8A  11630000
         AIF   ('&GROUPID'(1,1) NE '''').RCHK420                  @L8A  11640000
ICH4&SYSNDX DC    CL8&GROUPID                   - GROUP NAME      @L8A  11650000
.* LIST FORM COMPLETE - TEST FOR STANDARD FORM PASS THROUGH LIST FORM   11660000
.RCHK420 ANOP                                                           11670000
         AIF   (&MFFLAG).RCHK520                                        11680000
         MEXIT                                                          11690000
.RCHK430 ANOP                                                           11700000
         AIF   ('&MF'(1,2) EQ '(E' OR '&MF'(1,2) EQ '(M').RCHK530  @P2C 11710000
.* STANDARD FORM REQUESTED                                              11720000
&SYMBOL  DS    0H                                                       11730000
&MFFLAG  SETB  1              SET TRUE FOR PASS THROUGH LIST FORM       11740000
.* PRODUCE INSTRUCTIONS TO MODIFY IN-LINE LIST FORM WITH REGISTER ADDRS 11750000
         AIF   ('&INSTLN' EQ '' OR '&INSTLN(1)' EQ '&INSTLN').RCHK431   11760000
         AIF   (NOT &ICHCOM AND NOT &ICHRAC).RCHK43A               @M3C 11770000
         ST    &INSTLN(1),ICH0&SYSNDX+32  STORE INSTLN DATA ADDR   @T1A 11780000
         AGO   .RCHK431                                            @T1A 11790000
.RCHK43A ANOP                                                      @T1A 11800000
         STCM  &INSTLN(1),7,ICH0&SYSNDX+1 -STORE INSTALLATION DATA ADDR 11810000
.RCHK431 ANOP                                                           11820000
         AIF   ('&CMENTY1' EQ '').RCHK440                          @M3C 11830000
         AIF   ('&CMENTY1'(1,1) NE '(').RCHK440                    @M3C 11840000
&SUBSTR  SETC  '&CMENTY1'(2,K'&CMENTY1-2)                          @M3C 11850000
         AIF   (NOT &ICHCOM AND NOT &ICHRAC).RCHK435               @M3C 11860000
         ST    &SUBSTR,ICH0&SYSNDX+36     STORE ENTITY NAME ADDR   @T1A 11870000
         AGO   .RCHK440                                            @T1A 11880000
.RCHK435 ANOP                                                      @T1A 11890000
         STCM  &SUBSTR,7,ICH0&SYSNDX+5 - STORE ENTITY NAME ADDRESS      11900000
.RCHK440 ANOP                                                           11910000
         AIF   ('&PROFILE' EQ '').RCHK460                               11920000
         AIF   ('&PROFILE'(1,1) NE '(').RCHK460                         11930000
         AIF   (NOT &ICHCOM AND NOT &ICHRAC).RCHK450               @M3C 11940000
         ST    &PROFILE(1),ICH0&SYSNDX+36     STORE PROFILE ADDR   @T1A 11950000
         AGO   .RCHK460                                            @T1A 11960000
.RCHK450 ANOP                                                      @T1A 11970000
         STCM  &PROFILE(1),7,ICH0&SYSNDX+5 - STORE PROFILE ADDRESS      11980000
.RCHK460 ANOP                                                           11990000
         AIF   ('&CLASS' EQ '').RCHK470                                 12000000
         AIF   ('&CLASS'(1,1) NE '(').RCHK470                           12010000
         AIF   (NOT &ICHCOM AND NOT &ICHRAC).RCHK465               @M3C 12020000
         ST    &CLASS(1),ICH0&SYSNDX+40    STORE CLASS NAME ADDR   @T1A 12030000
         AGO   .RCHK470                                            @T1A 12040000
.RCHK465 ANOP                                                      @T1A 12050000
         STCM  &CLASS(1),7,ICH0&SYSNDX+9 - STORE CLASS NAME ADDRESS     12060000
.RCHK470 ANOP                                                           12070000
         AIF   ('&ATTR' EQ '').RCHK495                                  12080000
         AIF   ('&ATTR'(1,1) NE '(').RCHK495                            12090000
         STC   &ATTR(1),ICH0&SYSNDX+8 - STORE ATTR VALUE                12100000
.RCHK495 ANOP                                                           12110000
         AIF   ('&VOLSER' EQ '').RCHK500                                12120000
         AIF   ('&VOLSER'(1,1) NE '(').RCHK500                          12130000
         AIF   (NOT &ICHCOM AND NOT &ICHRAC).RCHK498               @M3C 12140000
         ST    &VOLSER(1),ICH0&SYSNDX+44    STORE VOLSER ADDR      @T1A 12150000
         AGO   .RCHK500                                            @T1A 12160000
.RCHK498 ANOP                                                      @T1A 12170000
         STCM  &VOLSER(1),7,ICH0&SYSNDX+13 - STORE VOLSER ADDRESS       12180000
.RCHK500 ANOP                                                           12190000
         AIF   ('&OLDVOL' EQ '').RCHK501                       @PC002PY 12200000
         AIF   ('&OLDVOL'(1,1) NE '(').RCHK501                 @PC002PY 12210000
         ST    &OLDVOL(1),ICH0&SYSNDX+16 - STORE OLD VOLSER    @PC002PY 12220000
.RCHK501 ANOP                                                           12230000
         AIF   ('&APPL' EQ '').RCHK502                         @PC003PY 12240000
         AIF   ('&APPL'(1,1) NE '(').RCHK502                   @PC003PY 12250000
         ST    &APPL(1),ICH0&SYSNDX+20 - STORE APPL ADDRESS    @PC003PY 12260000
.RCHK502 ANOP                                                  @PC003PY 12270000
         AIF   ('&ACEE' EQ '').RCHK503                         @PC003PY 12280000
         AIF   ('&ACEE'(1,1) NE '(').RCHK503                   @PC003PY 12290000
         ST    &ACEE(1),ICH0&SYSNDX+24 - STORE ACEE ADDRESS    @PC003PY 12300000
.RCHK503 ANOP                                                  @PC003PY 12310000
         AIF   ('&OWNER' EQ '').RCHK504                          @L4A   12320000
         AIF   ('&OWNER'(1,1) NE '(').RCHK504                    @L4A   12330000
         ST    &OWNER(1),ICH0&SYSNDX+28 - STORE OWNER ADDRESS.   @L4A   12340000
.RCHK504 ANOP  ,                                                 @L4A   12350000
         AIF   ('&ACCLVL' EQ '').RCHK506                         @L5A   12360000
         AIF   ('&ACCLVL(1)'(1,1) NE '(').RCHK505                @L5A   12370000
         AIF   (T'&ACCLVL(1) EQ 'O').RCHK505                     @L5A   12380000
         ST    &ACCLVL(1),ICH0&SYSNDX+48 - STORE ACCESS ADDRESS. @L5A   12390000
.RCHK505 ANOP  ,                                                 @L5A   12400000
         AIF   (T'&ACCLVL(2) EQ 'O').RCHK506                     @L5A   12410000
         AIF   ('&ACCLVL(2)'(1,1) NE '(').RCHK506                @L5A   12420000
         ST    &ACCLVL(2),ICH0&SYSNDX+52 - STORE 2ND ACC ADDR.   @L5A   12430000
.RCHK506 ANOP  ,                                                 @L5A   12440000
         AIF   ('&FILESEQ' EQ '').RCHK507                        @L7A   12450000
         AIF   ('&FILESEQ'(1,1) NE'(').RCHK507                   @L7A   12460000
         STH   &FILESEQ(1),ICH0&SYSNDX+56   STORE FILESEQ NUM    @L7A   12470000
.RCHK507 ANOP                                                    @L7A   12480000
         AIF   ('&USERID' EQ '').RCHK508                         @L8A   12490000
         AIF   ('&USERID'(1,1) NE '(').RCHK508                   @L8A   12500000
         ST    &USERID(1),ICH0&SYSNDX+60 - STORE USER ADDRESS    @L8A   12510000
.RCHK508 ANOP                                                    @L7A   12520000
         AIF   ('&GROUPID' EQ '').RCHK509                        @L8A   12530000
         AIF   ('&GROUPID'(1,1) NE '(').RCHK509                  @L8A   12540000
         ST    &GROUPID(1),ICH0&SYSNDX+64 - STORE GROUP ADDRESS  @L8A   12550000
.RCHK509 ANOP                                                    @L7A   12560000
         AIF   (&RLVL LT 6).RCHK510  SKIP IF BEFORE 1.8X     @YA12773   12570000
         AIF   ('&DDNAME' EQ '').RCHK510                     @YA12773   12580000
         AIF   ('&DDNAME'(1,1) NE '(').RCHK510               @YA12773   12590000
         ST    &DDNAME(1),ICH0&SYSNDX+68 - STORE DDNAME ADDR @YA12773   12600000
.RCHK510 ANOP                                                @YA12773   12610000
         AIF   ('&UTOKEN' EQ '').RCHK512                          4@D1D 12620000
         AIF   ('&UTOKEN'(1,1) NE '(').RCHK512                     @M2A 12630000
         ST    &UTOKEN(1),ICH0&SYSNDX+76 - STORE UTOKEN ADDRESS    @M2A 12640000
.RCHK512 ANOP                                                      @M2A 12650000
         AIF   ('&RTOKEN' EQ '').RCHK513                           @M2A 12660000
         AIF   ('&RTOKEN'(1,1) NE '(').RCHK513                     @M2A 12670000
         ST    &RTOKEN(1),ICH0&SYSNDX+80 - STORE RTOKEN ADDRESS    @M2A 12680000
.RCHK513 ANOP                                                      @M2A 12690000
         AIF   ('&LOGSTR' EQ '').RCHK514                           @M2A 12700000
         AIF   ('&LOGSTR'(1,1) NE '(').RCHK514                     @M2A 12710000
         ST    &LOGSTR(1),ICH0&SYSNDX+84 - STORE LOGSTR ADDRESS    @M2A 12720000
.RCHK514 ANOP                                                      @M2A 12730000
         AIF   ('&RECVR' EQ '').RCHK515                            @M2A 12740000
         AIF   ('&RECVR'(1,1) NE '(').RCHK515                      @M2A 12750000
         ST    &RECVR(1),ICH0&SYSNDX+88 - STORE RECVR ADDRESS      @M2A 12760000
.RCHK515 ANOP                                                      @M2A 12770000
         AIF   ('&MEMCOUNT' EQ '').RCHK516                         @NJA 12780000
         AIF   ('&MEMCOUNT'(1,1) NE '(').RCHK516                   @NJA 12790000
         ST    &MEMCOUNT(1),ICH0&SYSNDX+92 - STORE MEMCOUNT Addr   @NJA 12800000
.RCHK516 ANOP                                                      @NJA 12810000
         AIF   ('&MEMBER' EQ '').RCHK517                           @NJA 12820000
         AIF   ('&MEMBER'(1,1) NE '(').RCHK517                     @NJA 12830000
         ST    &MEMBER(1),ICH0&SYSNDX+96 - STORE MEMBER Addr       @NJA 12840000
.RCHK517 ANOP                                                      @NJA 12850000
.* LIST FORM MODIFICATION COMPLETE - PRODUCE LIST FORM WITH BAL AROUND  12860000
         CNOP  0,4                                                      12870000
&OFFSET  SETA  &PARMLEN+4                                        @L7A   12880000
         AIF   ('&CLASS' EQ '').RCHK518                                 12890000
         AIF   ('&CLASS'(1,1) NE '''').RCHK518                          12900000
&OFFSET  SETA  &OFFSET+10                                      @PC003PY 12910000
.RCHK518 ANOP                                                           12920000
         AIF   ('&APPL' EQ '').RCHK519                         @PC003PY 12930000
         AIF   ('&APPL'(1,1) NE '''').RCHK519                  @PC003PY 12940000
&OFFSET  SETA  &OFFSET+8                                       @PC003PY 12950000
.RCHK519 ANOP                                                           12960000
         AIF   ('&USERID' EQ '').RCHK51A                           @L8A 12970000
         AIF   ('&USERID'(1,1) NE '''').RCHK51A                    @L8A 12980000
&OFFSET  SETA  &OFFSET+8                                           @L8A 12990000
.RCHK51A ANOP                                                           13000000
         AIF   ('&GROUPID' EQ '').RCHK51B                          @L8A 13010000
         AIF   ('&GROUPID'(1,1) NE '''').RCHK51B                   @L8A 13020000
&OFFSET  SETA  &OFFSET+8                                       @PC003PY 13030000
.RCHK51B ANOP                                                  @PC003PY 13040000
         BAL   1,*+&OFFSET -  POINT REG 1 AT PARM LIST                  13050000
         AGO   .RCHK160                                                 13060000
.RCHK520 ANOP                                                           13070000
.************************************************************      @T1A 13080000
.* IF THIS MACRO WAS INVOKED INTERNALLY BY THE RACROUTE            @T1A 13090000
.* MACRO, SIMPLY EXIT RATHER  THAN GOING TO THE RACF ROUTINE.      @T1A 13100000
.************************************************************      @T1A 13110000
         AIF   (&ICHRAC).RCHK525                                   @T1A 13120000
         AIF   ('&MF'(1,2) EQ '(M').RCHK525 SKIP SVC FOR MF=M      @P2A 13130000
.* RETURN FROM LIST FORM TO PRODUCE SVC                                 13140000
         SVC   130               INVOKE RACHECK SVC ROUTINE             13150000
         AIF   (NOT &RLVLCHK).RCHK525                              @L7A 13160000
&ICHRLVL DS    0H                                                  @L7A 13170000
.RCHK525 ANOP                                                      @T1A 13180000
         MEXIT                                                          13190000
.RCHK530 ANOP                                                           13200000
.* PRODUCE EXECUTE FORM OF MACRO                                        13210000
         AIF   (&ICHRAC).RCK530A                                   @T1A 13220000
&SYMBOL  IHBINNRA &MF(2) -    POINT REG1 AT LIST FORM                   13230000
         AGO   .RCHK53A                                            @T1A 13240000
.***********************************************************       @T1A 13250000
.* IF THIS MACRO IS BEING INVOKED INTERNALLY BY THE RACROUTE       @T1A 13260000
.* MACRO, PICK UP THE ADDRESS OF THE RACHECK PARAMETER LIST        @T1A 13270000
.* FROM THE RACROUTE PARAMETER LIST.                               @T1A 13280000
.***********************************************************       @T1A 13290000
.RCK530A ANOP                                                      @T1A 13300000
         A     1,36(1)        POINT REG 1 AT RACHECK LIST          @T1A 13310000
.RCHK53A ANOP                                                      @T1A 13320000
.* IF REQUESTED, CHECK SIZE OF LIST-FORM VS. EXECUTE-FORM          @L7A 13330000
         AIF   (NOT &RLVLCHK).RLVLX20                              @L7A 13340000
         CLI   0(1),&RLVLSZ(&RLVL) L-FORM LARGE ENOUGH?            @L7A 13350000
         BNL   *+12                YES                             @L7A 13360000
         LA    15,100              SET INCOMPATIBLE MACROS R.C.    @L7A 13370000
         B     &ICHRLVL                                            @L7A 13380000
.RLVLX20 ANOP                                                      @L7A 13390000
.* PRODUCE INSTRUCTIONS TO MODIFY LIST                                  13400000
.* PRODUCE INSTALLATION DATA ADDRESS                                    13410000
         AIF   ('&INSTLN' EQ '').RCHK531                                13420000
         AIF   ('&INSTLN'(1,1) NE '(').RCHK532                          13430000
         AIF   (NOT &ICHRAC).RCHK53B                               @T1A 13440000
         ST    &INSTLN(1),32(1)    STORE INSTALLATION ADDR         @T1A 13450000
         AGO   .RCHK531                                            @T1A 13460000
.RCHK53B ANOP                                                      @T1A 13470000
         STCM  &INSTLN(1),7,1(1) - STORE INSTALLATION ADDR              13480000
         AGO   .RCHK531                                                 13490000
.RCHK532 ANOP                                                           13500000
         LA    0,&INSTLN - ADDRESS INSTALLATION DATA ADDRESS            13510000
         AIF   (NOT &ICHCOM AND NOT &ICHRAC).RCHK53C               @M3C 13520000
         ST    0,32(1)    STORE INSTALLATION ADDR                  @T1A 13530000
         AGO   .RCHK531                                            @T1A 13540000
.RCHK53C ANOP                                                      @T1A 13550000
         STCM  0,7,1(1) - STORE INSTALLATION DATA ADDRESS               13560000
.RCHK531 ANOP                                                           13570000
.* FLAGS FIELD                                                          13580000
&BIT2    SETA  0                                                   @M3A 13590000
&BIX2    SETA  1                                                   @M3A 13600000
         AIF   ('&ENTITY' EQ '').NSTFLG1                           @M3A 13610000
         AIF   ('&CMENTY2' NE '').RCHK535                          @Q7A 13620000
         NI    12(1),B'11011111'     TURN OFF PROFILE BIT          @Q7A 13630000
.RCHK535 ANOP                                                      @Q7A 13640000
&BIX2    SETA  0        - SET BIT TO FLAG ENTITYX IN 'M' FORM      @M3A 13650000
.NSTFLG1 ANOP                                                      @M3A 13660000
         AIF   ('&ENTITYX' EQ '').NSTFLG2                          @M3A 13670000
         AIF   ('&CMENTY2' NE '').RCHK537                          @Q7A 13680000
         NI    12(1),B'11011111'     TURN OFF PROFILE BIT          @Q7A 13690000
.RCHK537 ANOP                                                      @Q7A 13700000
&BIT2    SETA  1        - SET BIT TO FLAG ENTITYX IN 'M' FORM      @M3A 13710000
.NSTFLG2 ANOP                                                      @M3A 13720000
         AIF   ('&CMENTY2' EQ '' AND '&DSTYPE' EQ '' AND '&LOG' EQ     X13730000
                '' AND '&RACFIND' EQ '' AND '&CMENTY1' EQ '').RCHK616   13740000
.*                                                                 @M3C 13750000
&BIX0    SETA  1                   ASSUME THAT                     @L5A 13760000
&BIX1    SETA  1                     RACFIND IS NOT CODED          @L5A 13770000
         AIF   ('&RACFIND' EQ '').RCHK540                          @L5A 13780000
&BIX0    SETA  0                   RACFIND                         @L5A 13790000
&BIX1    SETA  0                     IS                            @L5A 13800000
&BIT0    SETA  1                       CODED                       @L5A 13810000
         AIF   ('&RACFIND' EQ 'NO').RCHK540                        @L5A 13820000
&BIT1    SETA  1                   RACFIND=YES CODED               @L5A 13830000
.RCHK540 ANOP                                                      @L5A 13840000
&BIX7    SETA  1                  ASSUME ENTITY(2) OMMITTED    @PC002PY 13850000
         AIF   ('&CMENTY2' EQ '').RCHK550          SKIP IF OMMITED @M3C 13860000
&BIX7    SETA  0                  CLEAR CSA BIT                @PC002PY 13870000
         AIF   ('&CMENTY2' NE 'CSA').RCHK550          SKIP NOT CSA @M3C 13880000
&BIT7    SETA  1                  SET CSA OPTION BIT           @PC002PY 13890000
.RCHK550 ANOP                                                           13900000
&BIX3    SETA  1                  ASSUME DSTYPE OMMITED        @PC002PY 13910000
         AIF   ('&DSTYPE' EQ '' ).RCHK580 SKIP IF OMMITED      @PC002PY 13920000
&BIX3    SETA  0                  CLEAR DSTYPE BIT             @PC002PY 13930000
         AIF   ('&DSTYPE' NE 'V' ).RCHK580 SKIP NOT VSAM       @PC002PY 13940000
&BIT3    SETA  1                  SET DSTYPE=V BIT             @PC002PY 13950000
.RCHK580 ANOP                                                           13960000
&BIX5    SETA  1                  ASSUME LOG OMITTED           @PC002PY 13970000
&BIX6    SETA  1                  ASSUME LOG OMMITED           @PC002PY 13980000
         AIF   ('&LOG' EQ '').RCHK610 SKIP IF OMITTED          @PC002PY 13990000
&BIX5    SETA  0                  CLEAR LOG BITS               @PC002PY 14000000
&BIX6    SETA  0                                               @PC002PY 14010000
         AIF   ('&LOG' NE 'NOFAIL' AND                                 -14020000
               '&LOG' NE 'NOSTAT').RCHK600                     @ZA60572 14030000
&BIT5    SETA  1                                                        14040000
.RCHK600 ANOP                                                           14050000
         AIF   ('&LOG' NE 'NONE' AND                                   -14060000
               '&LOG' NE 'NOSTAT').RCHK610                     @ZA60572 14070000
&BIT6    SETA  1                                                        14080000
.RCHK610 ANOP                                                           14090000
.******************************************************            @T1A 14100000
.* IF THIS MACRO WAS INVOKED INTERNALLY BY THE RACROUTE            @T1A 14110000
.* MACRO, THE PARAMETER LIST HAS 31-BIT ADDRESSING.                @T1A 14120000
.******************************************************            @T1A 14130000
&BIX4    SETA  0                  ASSUME 24-BIT ADDRESSING         @T1A 14140000
         AIF   (NOT &ICHCOM AND NOT &ICHRAC).RCHK615               @M3C 14150000
&BIT4    SETA  1                  31-BIT ADDRESSING                @T1A 14160000
.RCHK615 ANOP                                                      @T1A 14170000
         NI    4(1),B'&BIX0&BIX1&BIX2&BIX3&BIX4&BIX5&BIX6&BIX7'         14180000
         OI    4(1),B'&BIT0&BIT1&BIT2&BIT3&BIT4&BIT5&BIT6&BIT7' FLAGS   14190000
.RCHK616 ANOP                                                     @L7A  14200000
.* PRODUCE THIRD FLAG BYTE                                        @L7A  14210000
         AIF   (T'&DSTYPE EQ 'O' AND T'&GENERIC EQ 'O' AND             -14220000
               T'&PROFILE EQ 'O' AND '&CMENTY2' EQ '').RCHK624    @M3C  14230000
&BIT0    SETA  0                             X'80': DSTYPE=T      @L7A  14240000
&BIT1    SETA  0                             X'40': DSTYPE=M      @L7A  14250000
&BIT2    SETA  0                             X'20': PROFILE SPEC  @L7A  14260000
&BIT5    SETA  0                             X'04': GENERIC=YES   @L7A  14270000
&BIT6    SETA  0                            X'02': ENTITY=PRIVATE @P1A  14280000
&BIT7    SETA  0                             X'01': DSTYPE=L      @NKA  14290000
&BIX0    SETA  1                                                  @L7A  14300000
&BIX1    SETA  1                                                  @L7A  14310000
&BIX2    SETA  1                                                  @L7A  14320000
&BIX5    SETA  1                                                  @L7A  14330000
&BIX6    SETA  1                                                  @P1A  14340000
&BIX7    SETA  1                            DSTYPE=L omitted      @NKA  14350000
         AIF   (T'&DSTYPE EQ 'O').RCHK618                         @L7A  14360000
&BIX0    SETA  0                                                  @L7A  14370000
&BIX1    SETA  0                                                  @L7A  14380000
&BIX7    SETA  0                            Clear DSTYPE=L bit    @NKA  14390000
.*                                                                @NKA  14400000
         AIF   ('&DSTYPE' NE 'T' AND '&DSTYPE' NE 'M').RCHK6DL    @NKC  14410000
         AIF   ('&DSTYPE' EQ 'M').RCHK617                         @L7A  14420000
&BIT0    SETA  1                             DSTYPE=T CODED       @L7A  14430000
         AGO   .RCHK6DL                                           @NKC  14440000
.RCHK617 ANOP                                DSTYPE=M CODED       @L7A  14450000
&BIT1    SETA  1                                                  @L7A  14460000
.*                                                                @NKA  14470000
.RCHK6DL ANOP                                                     @NKA  14480000
.* PROCESS DSTYPE=L                                               @NKA  14490000
         AIF   ('&DSTYPE' NE 'L').RCHK618                         @NKA  14500000
&BIT7    SETA  1                            Set DSTYPE=L bit      @NKA  14510000
.*                                                                @NKA  14520000
.RCHK618 ANOP                                                     @L7A  14530000
.* PROCESS GENERIC                                                @L7A  14540000
         AIF   ('&GENERIC' NE 'YES').RCHK619                      @L7A  14550000
&BIT5    SETA  1                                                  @L7A  14560000
.RCHK619 ANOP                                                     @L7A  14570000
         AIF   ('&GENERIC' NE 'ASIS').RCHK61A                     @L7A  14580000
&BIX5    SETA  0                                                  @L7A  14590000
.RCHK61A ANOP                                                     @L7A  14600000
.* PROCESS ENTITY=(,PRIVATE)                                      @P1A  14610000
         AIF   ('&CMENTY2' NE 'PRIVATE').RCHK61D                  @M3C  14620000
&BIT6    SETA  1                                                  @P1A  14630000
.RCHK61D ANOP                                                     @P1A  14640000
         AIF   ('&CMENTY2' EQ 'CSA').RCHK61E                      @M3C  14650000
         AIF   ('&CMENTY2' NE 'NONE').RCHK61F                     @M3C  14660000
.RCHK61E ANOP                                                     @P1A  14670000
&BIX6    SETA  0                                                  @P1A  14680000
.RCHK61F ANOP                                                     @P1A  14690000
.* PROCESS PROFILE/ENTITY                                         @L7A  14700000
         AIF   (T'&PROFILE EQ 'O').RCHK620                        @L7A  14710000
         NI    4(1),B'11011111'     TURN OFF ENTITYX BIT          @Q7A  14720000
&BIT2    SETA  1                                                  @L7A  14730000
.RCHK620 ANOP                                                     @L7A  14740000
         AIF   ('&CMENTY1' EQ '').RCHK621                         @M3C  14750000
&BIX2    SETA  0                                                  @L7A  14760000
.RCHK621 ANOP                                                     @L7A  14770000
.* SET BITS IN THIRD FLAG BYTE                                    @L7A  14780000
         AIF   ('&BIX0&BIX1&BIX2&BIX5&BIX6&BIX7'                       +14790000
               EQ '111111').RCHK622                               @NKC  14800000
         NI    12(1),B'&BIX0&BIX1&BIX2.11&BIX5&BIX6&BIX7'  Flag3  @NKC  14810000
.RCHK622 ANOP                                                     @L7A  14820000
         AIF   ('&BIT0&BIT1&BIT2&BIT5&BIT6&BIT7'                       +14830000
               EQ '000000').RCHK624                               @NKC  14840000
         OI    12(1),B'&BIT0&BIT1&BIT2.00&BIT5&BIT6&BIT7'  Flag3  @NKC  14850000
.RCHK624 ANOP  ,                                                  @L6A  14860000
.* HANDLE ADDRESS TYPE PARAMETERS                                       14870000
         AIF   ('&CMENTY1' EQ '').RCHK640                          @M3C 14880000
         AIF   ('&CMENTY1'(1,1) NE '(').RCHK630                    @M3C 14890000
         AIF   (NOT &ICHCOM AND NOT &ICHRAC).RCHK625               @M3C 14900000
         ST    &CMENTY1,36(1)            STORE ENTITY NAME ADDRESS @M3C 14910000
         AGO   .RCHK680                                            @T1A 14920000
.RCHK625 ANOP                                                      @T1A 14930000
         STCM  &CMENTY1,7,5(1)         - STORE ENTITY NAME ADDRESS @M3C 14940000
         AGO   .RCHK680                                                 14950000
.RCHK630 ANOP                                                           14960000
         LA    0,&CMENTY1               - MOVE ENTITY NAME ADDRESS @M3C 14970000
         AIF   (NOT &ICHCOM AND NOT &ICHRAC).RCHK635               @M3C 14980000
         ST    0,36(1)         INTO PARM LIST                      @T1A 14990000
         AGO   .RCHK680                                            @T1A 15000000
.RCHK635 ANOP                                                      @T1A 15010000
         STCM  0,7,5(1) -      INTO PARM LIST                           15020000
         AGO   .RCHK680                                                 15030000
.RCHK640 ANOP                                                           15040000
         AIF   ('&PROFILE' EQ '').RCHK680                               15050000
         AIF   ('&PROFILE'(1,1) NE '(').RCHK670                         15060000
         AIF   (NOT &ICHCOM AND NOT &ICHRAC).RCHK650               @M3C 15070000
         ST    &PROFILE(1),36(1)    STORE PROFILE ADDRESS          @T1A 15080000
         AGO   .RCHK680                                            @T1A 15090000
.RCHK650 ANOP                                                      @T1A 15100000
         STCM  &PROFILE(1),7,5(1) - STORE PROFILE ADDRESS               15110000
         AGO   .RCHK680                                                 15120000
.RCHK670 ANOP                                                           15130000
         LA    0,&PROFILE -   MOVE PROFILE ADDRESS                      15140000
         AIF   (NOT &ICHCOM AND NOT &ICHRAC).RCHK675               @M3C 15150000
         ST    0,36(1)         INTO PARM LIST                      @T1A 15160000
         AGO   .RCHK680                                            @T1A 15170000
.RCHK675 ANOP                                                      @T1A 15180000
         STCM  0,7,5(1) -      INTO PARM LIST                           15190000
.RCHK680 ANOP                                                           15200000
.* PRODUCE SECOND FLAGS BYTE WITH ATTR SPECS                            15210000
         AIF   ('&ATTR' EQ '').RCHK750                                  15220000
         AIF   ('&ATTR'(1,1) EQ '(').RCHK745                            15230000
         AIF   ('&ATTR' NE 'ALTER').RCHK690                             15240000
         MVI   8(1),X'80' -   SET FOR ALTER ACCESS                      15250000
         AGO   .RCHK750                                                 15260000
.RCHK690 ANOP                                                           15270000
         AIF   ('&ATTR' NE 'UPDATE').RCHK730                            15280000
         MVI   8(1),X'04'               SET FOR UPDATE ACCESS           15290000
         AGO   .RCHK750                                                 15300000
.RCHK730 ANOP                                                           15310000
         AIF   ('&ATTR' NE 'READ').RCHK740                              15320000
         MVI   8(1),X'02'               SET FOR READ ACCESS             15330000
         AGO   .RCHK750                                                 15340000
.RCHK740 ANOP                                                           15350000
         AIF   ('&ATTR' NE 'CONTROL').RCHK750                      @Q1C 15360000
         MVI   8(1),X'08'               SET FOR CONTROL ACCESS          15370000
         AGO   .RCHK750                                                 15380000
.RCHK745 ANOP                                                           15390000
         STC   &ATTR(1),8(1) - STORE ATTR VALUE IN LIST FORM            15400000
.RCHK750 ANOP                                                           15410000
.* HANDLE CLASS PARAMETER                                               15420000
         AIF   ('&CLASS' EQ '').RCHK756                                 15430000
         AIF   ('&CLASS'(1,1) EQ '''').ERR09                            15440000
         AIF   ('&CLASS'(1,1) NE '(').RCHK754                           15450000
         AIF   (NOT &ICHCOM AND NOT &ICHRAC).RCHK752               @M3C 15460000
         ST    &CLASS(1),40(1)   STORE CLASS NAME ADDRESS          @T1A 15470000
         AGO   .RCHK756                                            @T1A 15480000
.RCHK752 ANOP                                                      @T1A 15490000
         STCM  &CLASS(1),7,9(1) - STORE CLASS NAME ADDRESS              15500000
         AGO   .RCHK756                                                 15510000
.RCHK754 ANOP                                                           15520000
         LA    0,&CLASS -     MOVE CLASS NAME ADDRESS                   15530000
         AIF   (NOT &ICHCOM AND NOT &ICHRAC).RCHK755               @M3C 15540000
         ST    0,40(1)         INTO PARM LIST                      @T1A 15550000
         AGO   .RCHK756                                            @T1A 15560000
.RCHK755 ANOP                                                      @T1A 15570000
         STCM  0,7,9(1) -      INTO PARM LIST                           15580000
.ERTN09  ANOP                                                           15590000
.RCHK756 ANOP                                                           15600000
.* HANDLE VOLSER PARAMETERS                                             15610000
         AIF   ('&VOLSER' EQ '').RCHK810                                15620000
         AIF   ('&VOLSER'(1,1) NE '(').RCHK800                          15630000
         AIF   (NOT &ICHCOM AND NOT &ICHRAC).RCHK75A               @M3C 15640000
         ST    &VOLSER(1),44(1)    STORE VOLSER ADDRESS            @T1A 15650000
         AGO   .RCHK810                                            @T1A 15660000
.RCHK75A ANOP                                                      @T1A 15670000
         STCM  &VOLSER(1),7,13(1) -  STORE VOLSER ADDRESS               15680000
         AGO   .RCHK810                                                 15690000
.RCHK800 ANOP                                                           15700000
         LA    0,&VOLSER -    MOVE VOLSER ADDRESS                       15710000
         AIF   (NOT &ICHCOM AND NOT &ICHRAC).RCHK805               @M3C 15720000
         ST    0,44(1)          INTO PARM LIST                     @T1A 15730000
         AGO   .RCHK810                                            @T1A 15740000
.RCHK805 ANOP                                                      @T1A 15750000
         STCM  0,7,13(1) -      INTO PARM LIST                          15760000
.RCHK810 ANOP                                                           15770000
         AIF   ('&OLDVOL' EQ '').RCHK820                       @PC00P2Y 15780000
         AIF   ('&OLDVOL'(1,1) NE '(').RCHK815                 @PC002PY 15790000
         ST    &OLDVOL(1),16(1) - STORE OLD VOLSER ADDRESS     @PC002PY 15800000
         AGO   .RCHK820                                        @PC002PY 15810000
.RCHK815 ANOP                                                  @PC002PY 15820000
         LA    0,&OLDVOL -   MOVE OLD VOLSER ADDRESS           @PC002PY 15830000
         ST    0,16(1) -      INTO PARM LIST                   @PC002PY 15840000
.RCHK820 ANOP                                                  @PC002PY 15850000
         AIF   ('&APPL' EQ '').RCHK835                         @PC003PY 15860000
         AIF   ('&APPL'(1,1) EQ '''').ERR10                    @PC003PY 15870000
         AIF   ('&APPL'(1,1) NE '(').RCHK830                   @PC003PY 15880000
         ST    &APPL(1),20(1) - STORE APPL ADDRESS             @PC003PY 15890000
         AGO   .RCHK835                                        @PC003PY 15900000
.RCHK830 ANOP                                                  @PC003PY 15910000
         LA    0,&APPL -     MOVE APPL ADDRESS                 @PC003PY 15920000
         ST    0,20(1) -      INTO PARM LIST                   @PC003PY 15930000
.ERTN10  ANOP                                                  @PC003PY 15940000
.RCHK835 ANOP                                                  @PC003PY 15950000
         AIF   ('&ACEE' EQ '').RCHK845                         @PC003PY 15960000
         AIF   ('&ACEE'(1,1) NE '(').RCHK840                   @PC003PY 15970000
         ST    &ACEE(1),24(1) - STORE ACEE ADDRESS             @PC003PY 15980000
         AGO   .RCHK845                                        @PC003PY 15990000
.RCHK840 ANOP                                                  @PC003PY 16000000
         LA    0,&ACEE -     MOVE ACEE ADDRESS                 @PC003PY 16010000
         ST    0,24(1) -      INTO PARM LIST                   @PC003PY 16020000
.RCHK845 ANOP                                                  @PC003PY 16030000
         AIF   ('&OWNER' EQ '').RCHK855                          @L4A   16040000
         AIF   ('&OWNER'(1,1) NE '(').RCHK850                    @L4A   16050000
         ST    &OWNER(1),28(1) - STORE OWNER ADDRESS.            @L4A   16060000
         AGO   .RCHK855                                          @L4A   16070000
.RCHK850 ANOP  ,                                                 @L4A   16080000
         LA    0,&OWNER -    MOVE OWNER ADDRESS                  @L4A   16090000
         ST    0,28(1)  -     INTO PARM LIST.                    @L4A   16100000
.RCHK855 ANOP  ,                                                 @L4A   16110000
         AIF   ('&ACCLVL' EQ '').RCHK859                         @L5A   16120000
         AIF   (T'&ACCLVL(1) EQ 'O').RCHK857                     @L5A   16130000
         AIF   ('&ACCLVL(1)'(1,1) NE '(').RCHK856                @L5A   16140000
         ST    &ACCLVL(1),48(1) - STORE ACCESS VALUE ADDRESS.    @L5A   16150000
         AGO   .RCHK857                                          @L5A   16160000
.RCHK856 ANOP  ,                                                 @L5A   16170000
         LA    0,&ACCLVL(1) - MOVE ACCESS VALUE ADDRESS          @L5A   16180000
         ST    0,48(1)      -  INTO PARM LIST.                   @L5A   16190000
.RCHK857 ANOP  ,                                                 @L5A   16200000
         AIF   (T'&ACCLVL(2) EQ 'O').RCHK859                     @L5A   16210000
         AIF   ('&ACCLVL(2)'(1,1) NE '(').RCHK858                @L5A   16220000
         ST    &ACCLVL(2),52(1) - STORE 2ND ACC ADDRESS.         @L5A   16230000
         AGO   .RCHK859                                          @L5A   16240000
.RCHK858 ANOP  ,                                                 @L5A   16250000
         LA    0,&ACCLVL(2) - MOVE 2ND ACCESS ADDRESS            @L5A   16260000
         ST    0,52(1)      -  INTO PARM LIST.                   @L5A   16270000
.RCHK859 ANOP  ,                                                 @L5A   16280000
         AIF   (&RLVL LE 2).RLVLX22 BYPASS IF RELEASE 1.6          @L7A 16290000
         AIF   ('&FILESEQ' EQ '').RCHK870     OMITTED            @L7A   16300000
         AIF   ('&FILESEQ'(1,1) NE '(').RCHK865                  @L7A   16310000
         STH   &FILESEQ,56(1)                 REG SPEC           @L7A   16320000
         AGO   .RCHK870                                          @L7A   16330000
.RCHK865 ANOP                                                    @L7A   16340000
         LH    0,=AL2(&FILESEQ)       MOVE FILESEQUENCE NUMBER   @L7A   16350000
         STH   0,56(1)                INTO PARM LIST             @L7A   16360000
.* PRODUCE TAPES FLAG BYTE    X'00'=STD X'01'=NL X'10'=BLP       @L7A   16370000
.RCHK870 ANOP                                                    @L7A   16380000
&BIX0    SETA  1                                                 @L7A   16390000
&BIX1    SETA  1                                                 @L7A   16400000
&BIT0    SETA  0                                                 @L7A   16410000
&BIT1    SETA  0                                                 @L7A   16420000
         AIF   (T'&TAPELBL EQ 'O').RCHK87X                       @L7A   16430000
&BIX0    SETA  0              RESET FLAGS IF OPERAND SPEC        @L7A   16440000
&BIX1    SETA  0                                                 @L7A   16450000
         AIF   ('&TAPELBL' EQ 'STD').RCHK880                     @L7A   16460000
         AIF   ('&TAPELBL' NE 'BLP').RCHK873                     @L7A   16470000
&BIT0    SETA  1              BLP=X'10'                          @L7A   16480000
         AGO   .RCHK879                                          @L7A   16490000
.RCHK873 ANOP                                                    @L7A   16500000
&BIT1    SETA  1              NL=X'01'                           @L7A   16510000
.RCHK879 ANOP                                                    @L7A   16520000
         NI    58(1),B'&BIX0&BIX1.111111'                        @L7A   16530000
         OI    58(1),B'&BIT0&BIT1.000000'                        @L7A   16540000
         AGO   .RCHK87X                                          @L7A   16550000
.RCHK880 ANOP                                                    @L7A   16560000
         NI    58(1),B'00111111'                                 @L7A   16570000
.RCHK87X ANOP                                                    @L7A   16580000
.* PRODUCE FOURTH FLAG BYTE                                        @L7A 16590000
         AIF   ('&STATUS' EQ '').RCHK90X                           @Q8C 16600000
&BIX0    SETA  0                 TURN OFF ERASE                    @L7A 16610000
&BIX1    SETA  0                 TURN OFF EVERDOM                  @D2A 16620000
&BIX2    SETA  0                 TURN OFF WRITEONLY                @D4A 16630000
&BIX3    SETA  0                 TURN OFF ACCESS                   @Q1A 16640000
.*                               STATUS=NONE     -X'00'            @Q8A 16650000
         NI    59(1),B'&BIX0&BIX1&BIX2&BIX3.1111'                  @Q1C 16660000
.RCHK90X ANOP                                                      @L7A 16670000
         AIF   ('&STATUS' NE 'ERASE').RCHKEV5                      @D2C 16680000
&BIT0    SETA  1                 STATUS=ERASE     -X'80'           @L7A 16690000
         OI    59(1),B'&BIT0.0000000'                              @L7A 16700000
.RCHKEV5 ANOP                                                      @D2A 16710000
         AIF   ('&STATUS' NE 'EVERDOM').RCHKWRO                    @D4C 16720000
&BIT1    SETA  1                 STATUS=EVERDOM   -X'40'           @D2A 16730000
         OI    59(1),B'0&BIT1.000000'                              @D2A 16740000
.RCHKWRO ANOP                                                      @D4A 16750000
         AIF   ('&STATUS' NE 'WRITEONLY').RCHKACD                  @Q1C 16760000
&BIT2    SETA  1                 STATUS=WRITEONLY -X'20'           @D4A 16770000
         OI    59(1),B'00&BIT2.00000'                              @Q6C 16780000
.RCHKACD ANOP                                                      @Q1A 16790000
         AIF   ('&STATUS' NE 'ACCESS').RCHK91X                     @Q1A 16800000
&BIT3    SETA  1                 STATUS=ACCESS    -X'10'           @Q1A 16810000
         OI    59(1),B'000&BIT3.0000'                              @Q6C 16820000
.RCHK91X ANOP                                                      @L7A 16830000
         AIF   (&RLVL LE 3).RLVLX22  BYPASS IF 1.7 OR LOWER       @L8A  16840000
         AIF   ('&USERID' EQ '').RCHK93X                          @L8A  16850000
         AIF   ('&USERID'(1,1) EQ '''').ERR15                     @L8A  16860000
         AIF   ('&USERID'(1,1) NE '(').RCHK92X                    @L8A  16870000
         ST    &USERID(1),60(1) - STORE USERID ADDRESS            @L8A  16880000
         AGO   .RCHK93X                                           @L8A  16890000
.RCHK92X ANOP                                                     @L8A  16900000
         LA    0,&USERID -   MOVE USERID ADDRESS                  @L8A  16910000
         ST    0,60(1) -      INTO PARM LIST                      @L8A  16920000
.ERTN15  ANOP                                                     @L8A  16930000
.RCHK93X ANOP                                                     @L8A  16940000
         AIF   ('&GROUPID' EQ '').RCHK95X                         @L8A  16950000
         AIF   ('&GROUPID'(1,1) EQ '''').ERR16                    @L8A  16960000
         AIF   ('&GROUPID'(1,1) NE '(').RCHK94X                   @L8A  16970000
         ST    &GROUPID(1),64(1) - STORE GROUPID ADDRESS          @L8A  16980000
         AGO   .RCHK95X                                           @L8A  16990000
.RCHK94X ANOP                                                     @L8A  17000000
         LA    0,&GROUPID -  MOVE GROUPID ADDRESS                 @L8A  17010000
         ST    0,64(1) -      INTO PARM LIST                      @L8A  17020000
.ERTN16  ANOP                                                     @L8A  17030000
.RCHK95X ANOP                                                     @L8A  17040000
         AIF   (&RLVL LT 6).RLVLX22  BYPASS IF NOT 1.8X       @YA12773  17050000
         AIF   ('&DDNAME' EQ '').RCHK97X                      @YA12773  17060000
         AIF   ('&DDNAME'(1,1) NE '(').RCHK96X                @YA12773  17070000
         ST    &DDNAME(1),68(1) - STORE DDNAME ADDRESS        @YA12773  17080000
         AGO   .RCHK97X                                       @YA12773  17090000
.RCHK96X ANOP                                                 @YA12773  17100000
         LA    0,&DDNAME -  MOVE DDNAME ADDRESS               @YA12773  17110000
         ST    0,68(1) -      INTO PARM LIST                  @YA12773  17120000
.RCHK97X ANOP                                                 @YA12773  17130000
         AIF   ('&UTOKEN' EQ '').RCHK0HX                          8@D1D 17140000
         AIF   ('&UTOKEN'(1,1) NE '(').RCHK0GX                     @M2A 17150000
         ST    &UTOKEN(1),76(1) - STORE UTOKEN ADDRESS             @M2A 17160000
         AGO   .RCHK0HX                                            @M2A 17170000
.RCHK0GX ANOP                                                      @M2A 17180000
         LA    0,&UTOKEN -   MOVE UTOKEN ADDRESS                   @M2A 17190000
         ST    0,76(1) -      INTO PARM LIST                       @M2A 17200000
.RCHK0HX ANOP                                                      @M2A 17210000
         AIF   ('&RTOKEN' EQ '').RCHK0QX                           @M2A 17220000
         AIF   ('&RTOKEN'(1,1) NE '(').RCHK0PX                     @M2A 17230000
         ST    &RTOKEN(1),80(1) - STORE RTOKEN ADDRESS             @M2A 17240000
         AGO   .RCHK0QX                                            @M2A 17250000
.RCHK0PX ANOP                                                      @M2A 17260000
         LA    0,&RTOKEN -   MOVE RTOKEN ADDRESS                   @M2A 17270000
         ST    0,80(1) -      INTO PARM LIST                       @M2A 17280000
.RCHK0QX ANOP                                                      @M2A 17290000
         AIF   ('&LOGSTR' EQ '').RCHK0MX                           @M2A 17300000
         AIF   ('&LOGSTR'(1,1) NE '(').RCHK0KX                     @M2A 17310000
         ST    &LOGSTR(1),84(1) - STORE LOGSTR ADDRESS             @M2A 17320000
         AGO   .RCHK0MX                                            @M2A 17330000
.RCHK0KX ANOP                                                      @M2A 17340000
         LA    0,&LOGSTR -   MOVE LOGSTR ADDRESS                   @M2A 17350000
         ST    0,84(1) -      INTO PARM LIST                       @M2A 17360000
.RCHK0MX ANOP                                                      @M2A 17370000
         AIF   ('&RECVR' EQ '').RCHK0OX                            @M2A 17380000
         AIF   ('&RECVR'(1,1) NE '(').RCHK0NX                      @M2A 17390000
         ST    &RECVR(1),88(1) - STORE RECVR ADDRESS               @M2A 17400000
         AGO   .RCHK0OX                                            @M2A 17410000
.RCHK0NX ANOP                                                      @M2A 17420000
         LA    0,&RECVR -    MOVE RECVR ADDRESS                    @M2A 17430000
         ST    0,88(1) -      INTO PARM LIST                       @M2A 17440000
.RCHK0OX ANOP                                                      @M2A 17450000
         AIF   ('&MEMCOUNT' EQ '').RCHK0SX                         @NJA 17460000
         AIF   ('&MEMCOUNT'(1,1) NE '(').RCHK0RX                   @NJA 17470000
         ST    &MEMCOUNT(1),92(1) - STORE MEMCOUNT Address         @NJA 17480000
         AGO   .RCHK0SX                                            @NJA 17490000
.RCHK0RX ANOP                                                      @NJA 17500000
         LA    0,&MEMCOUNT - LOAD MEMCOUNT Address                 @NJA 17510000
         ST    0,92(1)     - into the PARM List                    @NJA 17520000
.RCHK0SX ANOP                                                      @NJA 17530000
         AIF   ('&MEMBER' EQ '').RCHK0UX                           @NJA 17540000
         AIF   ('&MEMBER'(1,1) NE '(').RCHK0TX                     @NJA 17550000
         ST    &MEMBER(1),96(1) - STORE MEMBER Address             @NJA 17560000
         AGO   .RCHK0UX                                            @NJA 17570000
.RCHK0TX ANOP                                                      @NJA 17580000
         LA    0,&MEMBER   - LOAD MEMBER Address                   @NJA 17590000
         ST    0,96(1)     - into the PARM List                    @NJA 17600000
.RCHK0UX ANOP                                                      @NJA 17610000
.RLVLX22 ANOP                      END OF 1.6 BYPASS               @L7A 17620000
.* MODIFICATION COMPLETE - AGO ABOVE TO PRODUCE ENTRY LOGIC             17630000
         AGO   .RCHK520                                                 17640000
.* DIAGNOSTICS                                                          17650000
.ERR00   ANOP                                                           17660000
         AIF   (&RLVL GE 7).NEWMSG1                                @P9C 17670000
         MNOTE 8,'*** ENTITY OR PROFILE PARM REQUIRED ***'              17680000
         AGO   .COMSG01                                            @M3A 17690000
.NEWMSG1 ANOP                                                      @M3A 17700000
         MNOTE 8,'*** ENTITY OR ENTITYX OR PROFILE PARM REQUIRED ***'   17710000
.COMSG01 ANOP                                                      @M3A 17720000
         AGO   .ERTN00                                                  17730000
.ERR01   ANOP                                                      @D3C 17740000
         MNOTE 8,'*** CSA PARAMETER INVALID WITH RELEASE=1.8.2 SPECIFIE-17750000
               D ***'                                              @D3C 17760000
         AGO   .ERTN01                                             @D3C 17770000
.ERR00A  ANOP                                                      @M4A 17780000
         MNOTE 4,'*** PROFILE PARAMETER IGNORED WHEN RELEASE=1.8.2 IS S-17790000
               PECIFIED ***'                                       @D3C 17800000
         AGO   .ERTN00                                             @M4A 17810000
.ERR02   ANOP                                                           17820000
         MNOTE 8,'*** INVALID LOG PARAMETER SPECIFIED ***'              17830000
         AGO   .ERTN02                                                  17840000
.ERR02A  ANOP                                                      @M4A 17850000
         MNOTE 4,'*** LOG PARAMETER IGNORED WHEN RELEASE=1.8.2 IS SPECI-17860000
               FIED ***'                                           @D3C 17870000
         AGO   .ERTN02                                             @M4A 17880000
.ERR03   ANOP                                                           17890000
         MNOTE 8,'*** INVALID DSTYPE PARAMETER SPECIFIED ***'           17900000
         AGO   .ERTN03                                                  17910000
.ERR03A  ANOP                                                      @M4A 17920000
         MNOTE 8,'*** DSTYPE PARAMETER INVALID WITH RELEASE=1.8.2 IS SP-17930000
               ECIFIED ***'                                        @D3C 17940000
         AGO   .ERTN03                                             @M4A 17950000
.ERR04   ANOP                                                           17960000
         MNOTE 8,'*** INVALID ATTR PARAMETER SPECIFIED ***'             17970000
         AGO   .ERTN04                                                  17980000
.ERR05   ANOP                                                      @L5A 17990000
         MNOTE 8,'*** INVALID RACFIND PARAMETER SPECIFIED ***'     @L5A 18000000
         AGO   .ERTN05                                             @L5A 18010000
.ERR05A  ANOP                                                      @M4A 18020000
         MNOTE 4,'*** RACFIND PARAMETER IGNORED WHEN RELEASE=1.8.2 IS S-18030000
               PECIFIED ***'                                       @D3C 18040000
         AGO   .ERTN05                                             @M4A 18050000
.ERR06   ANOP                                                           18060000
         MNOTE 8,'*** INVALID MF PARAMETER SPECIFIED ***'               18070000
         AGO   .ERTN06                                                  18080000
.ERR07   ANOP                                                           18090000
         MNOTE 8,'*** REGISTER NOTATION NOT ALLOWED WITH LIST FORM ***'+18100000
                                                                   @L7A 18110000
         AGO   .ERTN07                                                  18120000
.ERR09   ANOP                                                           18130000
         MNOTE 8,'*** ''CLASSNAME'' FORM NOT ALLOWED WITH MF=E OR MF=M +18140000
               ***'                                                @P5C 18150000
         AGO   .ERTN09                                                  18160000
.ERR10   ANOP                                                  @PC003PY 18170000
         MNOTE 8,'*** ''APPLNAME'' FORM NOT ALLOWED WITH MF=E OR MF=M *+18180000
               **'                                                 @P5C 18190000
         AGO   .ERTN10                                         @PC003PY 18200000
.ERR11   ANOP                                                  @PC003PY 18210000
         MNOTE 8,'*** INVALID GENERIC PARAMETER SPECIFIED ***'     @L6A 18220000
         AGO   .ERTN11                                             @L6A 18230000
.ERR11A  ANOP                                                      @M4A 18240000
         MNOTE 4,'*** GENERIC PARAMETER IGNORED WHEN RELEASE=1.8.2 IS S-18250000
               PECIFIED ***'                                       @M4A 18260000
         AGO   .ERTN11                                             @M4A 18270000
.ERR12   ANOP                                                      @L7A 18280000
         MNOTE 8,'*** INVALID TAPELBL PARAMETER SPECIFIED ***'     @L7A 18290000
         AGO   .ERTN12                                             @L7A 18300000
.ERR12A  ANOP                                                      @M4A 18310000
         MNOTE 4,'*** TAPELBL PARAMETER IGNORED WHEN RELEASE=1.8.2 IS S-18320000
               PECIFIED ***'                                       @D3C 18330000
         AGO   .ERTN12                                             @M4A 18340000
.ERR13   ANOP                                                      @L7A 18350000
         MNOTE 8,'*** INVALID STATUS PARAMETER SPECIFIED ***'      @L7A 18360000
         AGO   .ERTN13                                             @L7A 18370000
.ERR13A  ANOP                                                      @M4A 18380000
         MNOTE 8,'*** STATUS PARAMETER INVALID WITH RELEASE=1.8.2 ***'  18390000
         AGO   .ERTN13                                             @M4A 18400000
.ERR14   MNOTE 8,'*** ''GROUPID'' IS INVALID WITHOUT ''USERID'' KEYWORDX18410000
                ***'                                               @L8A 18420000
         AGO   .ERTN14                                             @L8A 18430000
.ERR14A  MNOTE 4,'*** GROUPID PARAMETER IS IGNORED WITH RELEASE=1.8.2 S-18440000
               PECIFIED ***'                                       @D3C 18450000
         AGO   .ERTN14                                             @M4A 18460000
.ERR15   ANOP                                                      @L8A 18470000
         MNOTE 8,'*** ''USERID'' FORM NOT ALLOWED WITH MF=E OR MF=M ***+18480000
               '                                                   @P5C 18490000
         AGO   .ERTN15                                             @L8A 18500000
.ERR15A  ANOP                                                      @M4A 18510000
         MNOTE 8,'*** INVALID KEYWORD(S) SPECIFIED FOR RELEASE=1.8.2 **X18520000
               *'                                                  @D3C 18530000
         AGO   .ERTN15A                                            @M4A 18540000
.ERR16   ANOP                                                      @L8A 18550000
         MNOTE 8,'*** ''GROUPID'' FORM NOT ALLOWED WITH MF=E OR MF=M **+18560000
               *'                                                  @P5C 18570000
         AGO   .ERTN16                                             @L8A 18580000
.ERR17   ANOP                                                      @P1A 18590000
         AIF   ('&ENTITYX' NE '').NEWMSG2                          @M3A 18600000
         MNOTE 8,'*** INCORRECT ''ENTITY'' PARAMETER, ''&CMENTY2'' ***' 18610000
.*                                                                 @M3C 18620000
         AGO   .COMSG02                                            @M3A 18630000
.NEWMSG2 ANOP                                                      @M3A 18640000
         MNOTE 8,'*** INCORRECT ''ENTITYX'' PARAMETER, ''&CMENTY2'' ***X18650000
                '                                                  @M3A 18660000
.COMSG02 ANOP                                                      @M3A 18670000
         AGO   .ERTN17                                             @P1A 18680000
.ERR18   ANOP                                                      @M3A 18690000
         MNOTE 8,'*** ENTITYX AND ENTITY ARE MUTUALLY EXCLUSIVE KEYWORDX18700000
               S ***'                                              @M3A 18710000
         AGO   .ERTN18                                             @M3A 18720000
.ERR19   ANOP                                                      @M3A 18730000
         MNOTE 8,'*** RACHECK CAN BE INVOKED ONLY VIA RACROUTE FOR RELEX18740000
               ASE 1.9 AND LATER ***'                              @M3A 18750000
         AGO   .ERTN19                                             @M3A 18760000
.ERR20   ANOP                                                      @M3A 18770000
         MNOTE 8,'*** "ENTITYX" IS SUPPORTED BY RELEASE 1.9 AND LATER OX18780000
               NLY, ENTITYX IS IGNORED ***'                        @M3A 18790000
         AGO   .ERTN20                                             @M3A 18800000
.ERR21   ANOP                                                      @P8A 18810000
         MNOTE 8,'*** "RTOKEN" CANNOT BE SPECIFIED WITH SECOND ENTITY/EX18820000
               NTITYX OPERAND "&CMENTY2" ***'                      @Q2C 18830000
         AGO   .ERTN21                                             @P8A 18840000
.ERR22   MNOTE 4,'*** POSSIBLE TRUNCATION OF FILESEQ NUMBER ***'   @Q9C 18850000
         AGO   .ERTN22                                             @N8A 18860000
.ERR23   MNOTE 8,'*** "MEMCOUNT" CANNOT BE SPECIFIED ON THE SAME INVOCA+18870000
               TION WITH ANY OF THE KEYWORDS: "ACCLVL", "ACEE", "FILESE+18880000
               Q", "GROUPID", "MEMBER", "OLDVOL", "PROFILE", "RECVR", "+18890000
               RTOKEN", "STATUS", "TAPELBL", "USERID", OR "UTOKEN" ***'+18900000
                                                                   @NJA 18910000
         AGO   .ERTN23                                             @NJA 18920000
.ERR24   MNOTE 8,'*** "MEMBER" CANNOT BE SPECIFIED ON THE SAME INVOCATI+18930000
               ON WITH ANY OF THE KEYWORDS: "ACCLVL", "ACEE", "FILESEQ"+18940000
               , "GROUPID", "MEMCOUNT", "OLDVOL", "PROFILE", "RECVR", "+18950000
               RTOKEN", "STATUS", "TAPELBL", "USERID", OR "UTOKEN" ***'+18960000
                                                                   @NJA 18970000
         AGO   .ERTN24                                             @NJA 18980000
.ERR25   MNOTE 8,'*** "MEMCOUNT" CAN BE SPECIFIED ONLY FOR "DSTYPE=N" O+18990000
               R "DSTYPE=L" ***'                                   @NKC 19000000
         AGO   .ERTN25                                             @NJA 19010000
.ERR26   MNOTE 8,'*** "MEMBER" CAN BE SPECIFIED ONLY WITH "DSTYPE=L" **+19020000
               *'                                                  @NKC 19030000
         AGO   .ERTN26                                             @NJA 19040000
.ERR27   MNOTE 8,'*** "DSTYPE=L" CAN BE SPECIFIED ONLY WITH "MEMCOUNT" +19050000
               OR "MEMBER" ***'                                    @NKA 19060000
         AGO   .ERTN27                                             @NJA 19070000
.ERLVL1  MNOTE 8,'*** INCORRECT SPECIFICATION OF ''RELEASE'' ***'  @L7A 19080000
         AGO   .ERLVL1R                                            @L7A 19090000
.ERLVL2  MNOTE 4,'*** ''RELEASE-CHECK'' ONLY VALID WITH ''MF=E'' ***'  X19100000
                                                                   @L7A 19110000
         AGO   .ERLVL2R                                            @L7A 19120000
.ERLVL3  MNOTE 4,'*** RELEASE=1.8.2 ONLY VALID WHEN SPECIFIED ON A RACRX19130000
               OUTE MACRO INVOCATION ***'                          @D3A 19140000
         AGO   .ERLVL3R                                            @M4A 19150000
.ERLVLA  MNOTE 4,'*** ''RELEASE'' INCOMPATIBLE WITH SPECIFIED KEYWORD(SX19160000
               ) ***'                                              @L7A 19170000
         AGO   .ERLVLAR                                            @L7A 19180000
.ERLVLB  MNOTE 4,'*** ''RELEASE'' INCOMPATIBLE WITH SPECIFIED KEYWORD(SX19190000
               ) ***'                                              @L8A 19200000
         AGO   .ERLVLBR                                            @L8A 19210000
.ERLVLC  MNOTE 4,'*** ''RELEASE'' INCOMPATIBLE WITH SPECIFIED KEYWORD(SX19220000
               ) ***'                                          @YA12773 19230000
         AGO   .ERLVLCR                                        @YA12773 19240000
.ERLVLD  MNOTE 4,'*** ''RELEASE'' INCOMPATIBLE WITH SPECIFIED KEYWORD(SX19250000
               ) ***'                                              @M2A 19260000
         AGO   .ERLVLDR                                            @M2A 19270000
.ERLVLE  MNOTE 8,'*** ''UTOKEN'', ''RTOKEN'', ''LOGSTR'', AND ''RECVR''X19280000
                ARE ALLOWED ONLY  ON RACROUTE REQUEST=AUTH ***'    @D1C 19290000
         AGO   .ERLVLER                                            @P3A 19300000
.ERLVLF  MNOTE 8,'*** ''RELEASE'' INCOMPATIBLE WITH SPECIFIED KEYWORD(SX19310000
               ) ***'                                              @M4A 19320000
         AGO   .ERLVLFR                                            @M4A 19330000
.ERLVLG  MNOTE 8,'*** "MEMCOUNT" KEYWORD CANNOT BE SPECIFIED WITH THIS +19340000
               RELEASE LEVEL ***'                                  @NJA 19350000
         AGO   .ERLVLGR                                            @NJA 19360000
.ERLVLH  MNOTE 8,'*** "MEMBER" KEYWORD CANNOT BE SPECIFIED WITH THIS RE+19370000
               LEASE LEVEL ***'                                    @NJA 19380000
         AGO   .ERLVLHR                                            @NJA 19390000
.ERLVLI  MNOTE 8,'*** "MEMCOUNT" CAN BE SPECIFIED ONLY ON RACROUTE REQU+19400000
               EST=AUTH ***'                                       @NJA 19410000
         AGO   .ERLVLIR                                            @NJA 19420000
.ERLVLJ  MNOTE 8,'*** "MEMBER" CAN BE SPECIFIED ONLY ON RACROUTE REQUES+19430000
               T=AUTH ***'                                         @NJA 19440000
         AGO   .ERLVLJR                                            @NJA 19450000
.ERLVLK  MNOTE 8,'*** "DSTYPE=L" CANNOT BE SPECIFIED WITH THIS RELEASE +19460000
               LEVEL ***'                                          @NKA 19470000
         AGO   .ERLVLKR                                            @NJA 19480000
         MEND                                                           19490000
                                                                        19500000
