*********START OF SPECIFICATIONS*************************************** 00010000
*                                                                       00020000
* $MAC(RACLIST) COMP(SC1BN) PROD(RACF):                                 00030000
*                                                                       00040000
* DESCRIPTIVE_NAME:  AUTHORIZATION CHECKING INTERFACE                   00050000
*                                                                       00060000
* *01* PROPRIETARY STATEMENT=                                         * 00070000
*  **PROPRIETARY_STATEMENT********************************************* 00080000
*                                                                     * 00090000
*                                                                     * 00100000
*   Licensed Materials - Property of IBM                              * 00110001
*   5650-ZOS Copyright IBM Corp. 1977, 2019                           * 00120001
*                                                                     * 00130000
*   STATUS= HBB77C0                                                   * 00140001
*                                                                     * 00150000
*  **END_OF_PROPRIETARY_STATEMENT************************************** 00160000
*                                                                     * 00170000
*01* EXTERNAL CLASSIFICATION:                                         * 00180000
*02* GUPI:                                                            * 00190000
*01* END OF EXTERNAL CLASSIFICATION:                                  * 00200000
*                                                                     * 00210000
*                                                                       00220000
* FUNCTION:  BUILDS IN-STORAGE PROFILES FOR RACF DEFINED RESOURCES.     00230000
*            RACLIST PROCESSES ONLY THOSE RESOURCES DESCRIBED BY        00240000
*            CLASS DESCRIPTORS..                                        00250000
*                                                                       00260000
* CHANGE ACTIVITY:                                                      00270000
*                   $T1=UZ90211,SAF/RF15,810702,CNTDSD:            @T1A 00280000
*                   UZ90283                                    @ZA90283 00290000
*                   UZ90284                                    @ZA90284 00300000
*                   UZ90285                                    @ZA90285 00310000
*                   $L7=HRF1702,RACF/170,841205,CNTDSD:            @L7A 00320000
*                   $L8=HRF1802,RACF/180,870323,CNTDSD:            @L8A 00330000
*                   $M1=JRF1812,RACF/181,871117,CNTDSD:            @M1A 00340000
*      $L1= VTAMSLS  RACF/190 880222 PDPWB1: VTAM SESSION SEC      @L1A 00350000
*      $P1= PGW0006  RACF/190 880615 PDRTS1: PGW0006               @P1A 00360000
*      $P2= PGW0024  RACF/190 880803 PDRTS1: PGW0024               @P2A 00370000
*      $OY15980 THIS PROBLEM HAS BEEN FIXED IN RELEASE 1.9 WITH L1 FLAG 00380000
*      $P3= PGP0360  RACF/190 890715 PDB_S1: PGP0360               @P3A 00390000
*      $P4= PGP0611  RACF/190 890920 PDB_S1: PGP0611               @P4A 00400000
*      $P5= PGU1528  RACF/190 891220 PDR_G2: PGU1528               @P5A 00410000
*      $L2= RELID    RACF/192 900904 PDAHW1: RACF 1.9.2 SUPPORT    @L2A 00420000
*      $P6= PJA0029  RACF/192 910524 PDPSB2: PJA0029               @P6A 00430000
*      $01= OY58591  RACF/192 921106 PDALF1: DC FOR FILTER KEYWORD @01A 00440000
*      $L3= HPCS     RACF/210 930426 PDMAS1: RACF 2.1.0 SUPPORT    @L3A 00450000
*      $L4= OW04015  RACF/210 930507 PDKAF1: RACF 2.1.0 SUPPORT    @L4A 00460000
*      $P7= PIG3024  RACF/210 930917 PDKAF1: PIG3024               @P7A 00470000
*      $P8= PIG3428  RACF/210 931028 PDKAF1: PIG3428               @P8A 00480000
*      $02= OW00768  RACF/210 931206 PDKAF1: OW00768 (PIG3839)     @02A 00490000
*      $L5= OW10709  RACF/220 940510 PDJMV1: RACF 2.2.0 SUPPORT    @L5A 00500000
*      $L6= RELID    RACF/230 960422 PDJMV1: RACF 2.3.0 SUPPORT    @L6A 00510000
*      $P9= PQC1932  RACF/230 960722 PDJMV1: PTM PQC1932           @P9C 00520000
*      $PA= PQC2038  RACF/230 960722 PDRSU1: PTM PQC2038           @PAA 00530000
*      $M2= RELID    RACF/240 960904 PDJMV1: RACF 2.4.0 SUPPORT    @M2A 00540000
*      $M3= RELID    RACF/260 970728 PDCAM1: RACF 2.6 HRF2260      @M3A 00550000
*      $M4= RELID    HRF2608  980624 PDRDS2: HRF2608               @M4A 00560000
*      $M5= RELID    HRF7703 990415 PDRDS2: RACF 7703 HRF7703      @M5A 00570000
*      $M6= RELID    HRF7705 000405 PDIFS2: RELEASE ID HRF7705     @M6A 00580000
*      $M7= RELID    HRF7706 010430 PDRDC1: RELEASE ID HRF7706     @M7A 00590000
*      $M8= RELID    HRF7707 020109 PDMSF1: RELEASE ID HRF7707     @M8A 00600000
*      $M9= RELID    HRF7708 020118 PDMSF1: RELEASE ID HRF7708     @M9A 00610000
*      $MA= RELID    HRF7709 030430 PDMSD1: RELEASE ID HRF7709     @MAA 00620000
*      $MB= RELID    HRF7720 040224 PDRIV1: Support SAF HBB7720    @MBA 00630000
*      $MC= RELID    HRF7730 050531 PDRIV1: Support SAF HBB7730    @MCA 00640000
*      $MD= RELID    HRF7740 060330 PDRIV1: Support SAF HBB7740    @MDA 00650000
*      $ME= RELID    HRF7750 070302 PDRIV1: Support SAF HBB7750    @MEA 00660000
*      $MF= RELID    HRF7760 080522 PDJLW1: Support SAF HBB7760    @MFA 00670000
*      $MG= RELID    HBB7770 090511 PDJLW1: Support SAF HBB7770    @MGA 00680000
*      $MH= RELID    HBB7780 100513 PDJLW1: Support SAF HBB7780    @MHA 00690000
*      $MI= RELID    HBB7790 110117 PDJLW1: Support SAF HBB7790    @MIA 00700000
*      $MJ= RELID    HBB77A0 130116 PDAWS1: Support SAF HBB77A0    @MJA 00710000
*      $MK= RELID    HBB77B0 150508 PDPGP1: Support SAF HBB77B0    @MKA 00720000
*      $ML= RELID    HBB77C0 180530 PDGTM1: ParmList Version Supp  @MLA 00730001
*      $03= OA56828  HBB77C0 190411 PDMAN:  OA56828                @03A 00731001
*                                                                       00740000
*                                                                       00750001
*                                                                       00760001
*                                                                       00770001
* CHANGE DESCRIPTION                                                    00780000
*      A000000-999999                                          @PC003PY 00790000
*      A - SUPPORT VERIFY THAT THE SUBPOOL PARAMETER IS VALID      @P3A 00800000
*      C - '&RELEASE' TO '&RELEASE'(1,3) FOR LOGICAL COMPARISON    @P4A 00810000
*          WITH '1.9'                                              @P4A 00820000
*      C - REMOVE RCVTSTAT CHECK                                   @P5C 00830000
*      A - ADDED CODE TO SUPPORT RACF RELEASE 1.9.2                @L2A 00840000
*      C - STATUS TO CORRECTLY CORRESPOND TO MVS LEVEL             @P6C 00850000
*      C - RELEASE TEST FOR FILTER KEYWORD, SO LIST FORM CORRECTLY @01C 00860000
*          GENERATES DC FOR 1.9 AND LATER                          @01C 00870000
*      A - ADDED CODE TO SUPPORT GLOBAL=YES                        @L3A 00880000
*      C - ALLOW RACF RELEASE 2.1 TO BE SPECIFIED                  @L4A 00890000
*      C - TURN FLAGS ON FOR SPECIFIED RELEASE AND ANY LOWER       @P7A 00900000
*          RELEASES                                                @P7A 00910000
*      C - RESET INITIAL VALUE OF OFFSET VARIABLE TO 28, AND       @P8A 00920000
*          ADD CONDITIONAL INCREMENT OF OFFSET VARIABLE FOR        @P8A 00930000
*          RELEASES GREATER THAN 2.1.  MISC OTHER CLEANUPS.        @P8A 00940000
*      A - ALLOW RELEASE= CHECKS WITH SUBSTRINGS TO ACCEPT THAT    @02A 00950000
*          RELEASE= VALUE MAY BE EMPTY IF VALUE IS BEING DEFAULTED.@02A 00960000
*      C - ALLOW RACF RELEASE 2.2 TO BE SPECIFIED                  @L5A 00970000
*      C - ALLOW RACF RELEASE 2.3 TO BE SPECIFIED                  @L6A 00980000
*      C - COPYRITE CORRECTED                                      @P9A 00990000
*      A - ADDED CHECK FOR RELEASE = OR GT 1.9 AND RACROUTE        @PAA 01000000
*          MNOTE 8 WILL SHOW ERROR DURING ASSEMBLY                 @PAA 01010000
*      A - ALLOW RACF RELEASE 2.4 TO BE SPECIFIED                  @M2A 01020000
*      A - ALLOW RACF RELEASE 2.6 TO BE SPECIFIED FOR FMID HRF2260 @M3A 01030000
*      A - ALLOW RACF REL/ 2608 TO BE SPECIFIED FOR FMID HRF2608   @M4A 01040000
*      A - ALLOW RACF REL/ 7703 TO BE SPECIFIED FOR FMID HRF7703   @M5A 01050000
*      A - ALLOW RACF REL/ 7705 TO BE SPECIFIED FOR FMID HRF7705   @M6A 01060000
*      A - ALLOW RACF REL/ 7706 TO BE SPECIFIED FOR FMID HRF7706   @M7A 01070000
*      A - ALLOW RACF REL/ 7707 TO BE SPECIFIED FOR FMID HRF7707   @M8A 01080000
*      A - ALLOW RACF REL/ 7708 TO BE SPECIFIED FOR FMID HRF7708   @M9A 01090000
*      A - ALLOW RACF REL/ 7709 TO BE SPECIFIED FOR FMID HRF7709   @MAA 01100000
*      A - Add support for SAF Release FMID HBB7720                @MBA 01110000
*      A - Add support for SAF Release FMID HBB7730                @MCA 01120000
*      A - Add support for SAF Release FMID HBB7740                @MDA 01130000
*      A - Add support for SAF Release FMID HBB7750                @MEA 01140000
*      A - Add support for SAF Release FMID HBB7760                @MFA 01150000
*      A - Add support for SAF Release FMID HBB7770                @MGA 01160000
*      A - Add support for SAF Release FMID HBB7780                @MHA 01170000
*      A - Add support for SAF Release FMID HBB7790                @MIA 01180000
*      A - Add support for SAF Release FMID HBB77A0                @MJA 01190000
*      A - Add support for SAF Release FMID HBB77B0                @MKA 01200000
*      A - Support for Parameter List Version                           01210001
*          - Specify the parameter list version instead of              01220001
*            the last 4 characters of the FMID by specifying            01230001
*            RELEASE=PLV0001                                       @MLA 01240001
*      A - Corrected the specification of .AGO target for          @03A 01241001
*          RELEASE=1.7                                             @03A 01242001
*                                                                       01250001
*                                                                       01260001
*                                                                       01270001
*                                                                       01280001
*                                                                       01290000
*********END OF SPECIFICATIONS***************************************** 01300000
         MACRO                                                          01310000
&SYMBOL  RACLIST &LIST=,&CLASS=,&ACEE=,&APPL=,&ENVIR=,&SUBPOOL=,       *01320000
               &MF=S,&INSTLN=,&OWNER=,&RELEASE=,&LOC=,                 *01330000
               &FILTER=,&GLOBAL=                                   @L3C 01340000
.******* DEFINE LOCAL SET SYMBOLS                                       01350000
.*** THESE BITS MAP TO RLPLFLAG IN ICHRLS00,  PXFLAG IN ICHGLS00,  @L4A 01360000
.*** AND RLSTFLG2 IN IRRPRLST                                      @L4A 01370000
         LCLA  &BIT0,&BIT1,&BIT2,&BIT3,&BIT4,&BIT5,&BIT6,&BIT7     @L1A 01380000
         LCLA  &BIX0,&BIX1,&BIX2,&BIX3,&BIX4,&BIX5,&BIX6,&BIX7     @L1A 01390000
         LCLA  &OFFSET,&CLNGTH                                          01400000
.*** THESE BITS MAP TO RLSTFLG2 IN IRRPRLST                        @L3A 01410000
         LCLA  &GBIT0,&GBIT1,&GBIT2,&GBIT3,&GBIT4,&GBIT5,&GBIT6,&GBIT7  01420000
         LCLA  &GBIX0,&GBIX1,&GBIX2,&GBIX3,&GBIX4,&GBIX5,&GBIX6,&GBIX7  01430000
.*                                                                 @L3A 01440000
         LCLA  &PARMLEN                                            @L3A 01450000
         LCLB  &MFFLAG                                                  01460000
         LCLC  &SUBSTR                                                  01470000
         LCLC  &RLVL                                               @MJA 01480000
.******* DEFINE GLOBAL SET VARIABLES                               @T1A 01490000
         GBLB  &ICHRAC              ICHRAC - A FLAG WHICH, WHEN    @T1A 01500000
.*                                  ON, INDICATES THAT THIS MACRO  @T1A 01510000
.*                                  IS BEING INVOKED INTERNALLY    @T1A 01520000
.*                                  BY THE RACROUTE MACRO.         @T1A 01530000
         GBLC  &ICHL                THIS IS USED TO COMMUNICATE    @T1A 01540000
.*                                  TO THE RACROUTE MACRO THE      @T1A 01550000
.*                                  ADDRESS OF THE PARAMETER LIST  @T1A 01560000
         GBLC  &ICHRLVL             SYMBOL TO BRANCH TO            @L7A 01570000
.*                                  WHEN INCOMPATIBLE MACRO LEVEL. @L7A 01580000
&PARMLEN SETA  32                   LENGTH OF PARAMETER LIST       @L3A 01590000
.******* PERFORM PARAMETER DIAGNOSIS                                    01600000
.* VALIDATE RELEASE PARAMETER                                      @L7A 01610000
         AIF   (&ICHRAC).RLVL01                                    @L7A 01620000
&ICHRLVL SETC  'ICH&SYSNDX.X'      CREATE LABEL FOR SVC BYPASS     @L7A 01630000
.RLVL01  ANOP                                                      @L7A 01640000
         AIF   ('&RELEASE' EQ '').NORLVL                           @MJC 01650000
         AIF   (N'&RELEASE GT 2).ERLVL1  INVALID RELEASE PARAMETER @L7A 01660000
         AIF   ('&RELEASE(1)' EQ '1.6' OR                              X01670000
               '&RELEASE(1)' EQ '1.7' OR                               X01680000
               '&RELEASE(1)' EQ '1.8').NOERLVL                     @P2C 01690000
         AIF   ('&RELEASE(1)' NE '1.8.1' AND                           X01700000
               '&RELEASE(1)' NE '1.9' AND                              X01710000
               '&RELEASE(1)' NE '1.9.2' AND                            X01720000
               '&RELEASE(1)' NE '2.1'    AND                           X01730000
               '&RELEASE(1)' NE '2.2'    AND                           X01740000
               '&RELEASE(1)' NE '2.3'    AND                           X01750000
               '&RELEASE(1)' NE '2.4'    AND                           X01760000
               '&RELEASE(1)' NE '2.6'    AND                           X01770000
               '&RELEASE(1)' NE '2608' AND                             X01780000
               '&RELEASE(1)' NE '7703' AND                             X01790000
               '&RELEASE(1)' NE '7705' AND                             X01800000
               '&RELEASE(1)' NE '7706' AND                             X01810000
               '&RELEASE(1)' NE '7707' AND                             X01820000
               '&RELEASE(1)' NE '7708' AND                             X01830000
               '&RELEASE(1)' NE '7709' AND                             X01840000
               '&RELEASE(1)' NE '7720' AND                             X01850000
               '&RELEASE(1)' NE '7730' AND                             X01860000
               '&RELEASE(1)' NE '7740' AND                             X01870000
               '&RELEASE(1)' NE '7750' AND                             X01880000
               '&RELEASE(1)' NE '7760' AND                             X01890000
               '&RELEASE(1)' NE '7770' AND                             X01900000
               '&RELEASE(1)' NE '7780' AND                             X01910000
               '&RELEASE(1)' NE '7790' AND                             X01920000
               '&RELEASE(1)' NE '77A0' AND                             X01930000
               '&RELEASE(1)' NE '77B0' AND                             X01940001
               '&RELEASE(1)' NE 'PLV0001').ERLVL1                  @MLC 01950001
.NOERLVL ANOP                                                      @P2A 01960000
         AIF   (N'&RELEASE EQ 1).NORLVLC CHECK NOT SPECIFIED       @L7A 01970000
         AIF   ('&RELEASE(2)' NE 'CHECK').ERLVL1 INVALID VALUE     @L7A 01980000
         AIF   ('&MF(1)' NE 'E').ERLVL2 CHECK ONLY WITH MF=E       @L7A 01990000
.ERLVL2R ANOP                                                      @L7A 02000000
.NORLVLC ANOP                                                      @L7A 02010000
.ERLVL1R ANOP                                                      @L7A 02020000
.CHECKVER ANOP                                                     @MLA 02030001
         AIF   ('&RELEASE(1)' NE 'PLV0001').CHECKFMID              @MLA 02040001
.PLVER0001 ANOP                                                    @MLA 02050001
&RLVL    SETC  '46   '             Indicate the Parameter List     @MLA 02060001
.*                                 is at the RELEASE=77B0 level    @MLA 02070001
         AGO   .ENDRLVL                                            @MLA 02080001
.CHECKFMID ANOP                                                    @MLA 02090001
.RLVL77B0 ANOP                                                     @MLA 02100001
         AIF   ('&RELEASE(1)' NE '77B0').RLVL77A0                  @MKA 02110000
&RLVL    SETC  '46   '             INDICATE RELEASE=77B0           @MKA 02120000
         AGO   .ENDRLVL                                            @MKA 02130000
.RLVL77A0 ANOP                                                     @MKA 02140000
         AIF   ('&RELEASE(1)' NE '77A0').RLVL7790                  @MJA 02150000
&RLVL    SETC  '45   '             INDICATE RELEASE=77A0           @MJA 02160000
         AGO   .ENDRLVL                                            @MJA 02170000
.RLVL7790 ANOP                                                     @MJA 02180000
         AIF   ('&RELEASE(1)' NE '7790').RLVL7780                  @MJA 02190000
&RLVL    SETC  '44   '             INDICATE RELEASE=7790           @MJA 02200000
         AGO   .ENDRLVL                                            @MJA 02210000
.RLVL7780 ANOP                                                     @MJA 02220000
         AIF   ('&RELEASE(1)' NE '7780').RLVL7770                  @MJA 02230000
&RLVL    SETC  '43   '             INDICATE RELEASE=7780           @MJA 02240000
         AGO   .ENDRLVL                                            @MJA 02250000
.RLVL7770 ANOP                                                     @MJA 02260000
         AIF   ('&RELEASE(1)' NE '7770').RLVL7760                  @MJA 02270000
&RLVL    SETC  '42   '             INDICATE RELEASE=7770           @MJA 02280000
         AGO   .ENDRLVL                                            @MJA 02290000
.RLVL7760 ANOP                                                     @MJA 02300000
         AIF   ('&RELEASE(1)' NE '7760').RLVL7750                  @MJA 02310000
&RLVL    SETC  '41   '             INDICATE RELEASE=7760           @MJA 02320000
         AGO   .ENDRLVL                                            @MJA 02330000
.RLVL7750 ANOP                                                     @MJA 02340000
         AIF   ('&RELEASE(1)' NE '7750').RLVL7740                  @MJA 02350000
&RLVL    SETC  '40   '             INDICATE RELEASE=7750           @MJA 02360000
         AGO   .ENDRLVL                                            @MJA 02370000
.RLVL7740 ANOP                                                     @MJA 02380000
         AIF   ('&RELEASE(1)' NE '7740').RLVL7730                  @MJA 02390000
&RLVL    SETC  '39   '             INDICATE RELEASE=7740           @MJA 02400000
         AGO   .ENDRLVL                                            @MJA 02410000
.RLVL7730 ANOP                                                     @MJA 02420000
         AIF   ('&RELEASE(1)' NE '7730').RLVL7720                  @MJA 02430000
&RLVL    SETC  '38   '             INDICATE RELEASE=7730           @MJA 02440000
         AGO   .ENDRLVL                                            @MJA 02450000
.RLVL7720 ANOP                                                     @MJA 02460000
         AIF   ('&RELEASE(1)' NE '7720').RLVL7709                  @MJA 02470000
&RLVL    SETC  '37   '             INDICATE RELEASE=7720           @MJA 02480000
         AGO   .ENDRLVL                                            @MJA 02490000
.RLVL7709 ANOP                                                     @MJA 02500000
         AIF   ('&RELEASE(1)' NE '7709').RLVL7708                  @MJA 02510000
&RLVL    SETC  '36   '             INDICATE RELEASE=7709           @MJA 02520000
         AGO   .ENDRLVL                                            @MJA 02530000
.RLVL7708 ANOP                                                     @MJA 02540000
         AIF   ('&RELEASE(1)' NE '7708').RLVL7707                  @MJA 02550000
&RLVL    SETC  '35   '             INDICATE RELEASE=7708           @MJA 02560000
         AGO   .ENDRLVL                                            @MJA 02570000
.RLVL7707 ANOP                                                     @MJA 02580000
         AIF   ('&RELEASE(1)' NE '7707').RLVL7706                  @MJA 02590000
&RLVL    SETC  '34   '             INDICATE RELEASE=7707           @MJA 02600000
         AGO   .ENDRLVL                                            @MJA 02610000
.RLVL7706 ANOP                                                     @MJA 02620000
         AIF   ('&RELEASE(1)' NE '7706').RLVL7705                  @MJA 02630000
&RLVL    SETC  '33   '             INDICATE RELEASE=7706           @MJA 02640000
         AGO   .ENDRLVL                                            @MJA 02650000
.RLVL7705 ANOP                                                     @MJA 02660000
         AIF   ('&RELEASE(1)' NE '7705').RLVL7703                  @MJA 02670000
&RLVL    SETC  '32   '             INDICATE RELEASE=7705           @MJA 02680000
         AGO   .ENDRLVL                                            @MJA 02690000
.RLVL7703 ANOP                                                     @MJA 02700000
         AIF   ('&RELEASE(1)' NE '7703').RLVL2608                  @MJA 02710000
&RLVL    SETC  '31   '             INDICATE RELEASE=7703           @MJA 02720000
         AGO   .ENDRLVL                                            @MJA 02730000
.RLVL2608 ANOP                                                     @MJA 02740000
         AIF   ('&RELEASE(1)' NE '2608').RLVL260                   @MJA 02750000
&RLVL    SETC  '30   '             INDICATE RELEASE=2608           @MJA 02760000
         AGO   .ENDRLVL                                            @MJA 02770000
.RLVL260 ANOP                                                      @MJA 02780000
         AIF   ('&RELEASE(1)' NE '2.6').RLVL240                    @MJA 02790000
&RLVL    SETC  '2.6  '             INDICATE RELEASE=2.6            @MJA 02800000
         AGO   .ENDRLVL                                            @MJA 02810000
.RLVL240 ANOP                                                      @MJA 02820000
         AIF   ('&RELEASE(1)' NE '2.4').RLVL230                    @MJA 02830000
&RLVL    SETC  '2.4  '             INDICATE RELEASE=2.4            @MJA 02840000
         AGO   .ENDRLVL                                            @MJA 02850000
.RLVL230 ANOP                                                      @MJA 02860000
         AIF   ('&RELEASE(1)' NE '2.3').RLVL220                    @MJA 02870000
&RLVL    SETC  '2.3  '             INDICATE RELEASE=2.3            @MJA 02880000
         AGO   .ENDRLVL                                            @MJA 02890000
.RLVL220 ANOP                                                      @MJA 02900000
         AIF   ('&RELEASE(1)' NE '2.2').RLVL210                    @MJA 02910000
&RLVL    SETC  '2.2  '             INDICATE RELEASE=2.2            @MJA 02920000
         AGO   .ENDRLVL                                            @MJA 02930000
.RLVL210 ANOP                                                      @MJA 02940000
         AIF   ('&RELEASE(1)' NE '2.1').RLVL192                    @MJA 02950000
&RLVL    SETC  '2.1  '             INDICATE RELEASE=2.1            @MJA 02960000
         AGO   .ENDRLVL                                            @MJA 02970000
.RLVL192 ANOP                                                      @MJA 02980000
         AIF   ('&RELEASE(1)' NE '1.9.2').RLVL190                  @MJA 02990000
&RLVL    SETC  '1.9.2'             INDICATE RELEASE=1.9.2          @MJA 03000000
         AGO   .ENDRLVL                                            @MJA 03010000
.RLVL190 ANOP                                                      @MJA 03020000
         AIF   ('&RELEASE(1)' NE '1.9').RLVL181                    @MJA 03030000
&RLVL    SETC  '1.9  '             INDICATE RELEASE=1.9            @MJA 03040000
         AGO   .ENDRLVL                                            @MJA 03050000
.RLVL181 ANOP                                                      @MJA 03060000
         AIF   ('&RELEASE(1)' NE '1.8.1').RLVL180                  @MJA 03070000
&RLVL    SETC  '1.8.1'             INDICATE RELEASE= 1.8.1         @MJA 03080000
         AGO   .ENDRLVL                                            @MJA 03090000
.RLVL180 ANOP                                                      @MJA 03100000
         AIF   ('&RELEASE(1)' NE '1.8').RLVL17                     @MJA 03110000
&RLVL    SETC  '1.8  '             INDICATE RELEASE=1.8            @MJA 03120000
         AGO   .ENDRLVL                                            @MJA 03130000
.RLVL17  ANOP                                                      @MJA 03140000
         AIF   ('&RELEASE(1)' NE '1.7').RLVL16                     @MJA 03150000
&RLVL    SETC  '1.7  '             INDICATE RELEASE=1.7            @MJA 03160000
         AGO   .ENDRLVL                                            @03C 03170001
.RLVL16  ANOP                                                      @MJA 03180000
.NORLVL  ANOP                                                      @MJA 03190000
&RLVL    SETC  '1.6  '             INDICATE RELEASE=1.6            @MJA 03200000
.ENDRLVL ANOP                                                      @MJA 03210000
.******* IF RELEASE IS 1.9 OR GREATER MUST USE RACROUTE            @PAA 03220000
         AIF   ('&RELEASE(1)' EQ '').NOERR01                       @PAA 03230000
         AIF   ('&RLVL'(1,3) GE '1.9' AND NOT &ICHRAC).ERR08       @MJC 03240000
.NOERR01 ANOP                                                      @PAA 03250000
.ERTN08  ANOP                                                      @PAA 03260000
.******* CHECK SPECIFIED PARAMETERS AGAINST RACF LEVEL             @L7A 03270000
         AIF   ('&RELEASE' GE '1.7').ERLVLAR                       @L8A 03280000
         AIF   (T'&LOC NE 'O').ERLVLA                              @L7A 03290000
.ERLVLAR ANOP                                                      @L7A 03300000
.******* VALIDATE MF PARAMETER                                          03310000
         AIF   ('&MF' NE 'S' AND '&MF' NE 'L' AND '&MF'(1,2) NE        -03320000
               '(E' AND '&MF'(1,2) NE '(M').ERR06                  @L1A 03330000
.ERTN06  ANOP                                                           03340000
.******* VALIDATE ENVIR PARAMETER                                       03350000
         AIF   ('&ENVIR' EQ '').ERTN05                                  03360000
         AIF   ('&ENVIR' NE 'CREATE' AND '&ENVIR' NE 'DELETE').ERR05    03370000
.ERTN05  ANOP                                                           03380000
.******* VALIDATE OWNER PARAMETER                                       03390000
         AIF   ('&OWNER' EQ '').ERTN04                                  03400000
         AIF   ('&OWNER' NE 'NO' AND '&OWNER' NE 'YES').ERR04           03410000
.ERTN04  ANOP                                                           03420000
.******* VALIDATE LOC PARAMETER                                    @L7A 03430000
         AIF   ('&LOC' EQ '').ERTN11                               @L7A 03440000
         AIF   ('&LOC' NE 'ANY' AND '&LOC' NE 'ABOVE').ERR11       @L7A 03450000
.ERTN11  ANOP                                                      @L7A 03460000
.**      LOC ALLOWED ONLY IF RACLIST INVOKED FROM RACROUTE         @L7A 03470000
         AIF   ('&LOC' NE '' AND NOT &ICHRAC).ERR12                @L7A 03480000
.ERTN12  ANOP                                                      @L7A 03490000
.******* VALIDATE FILTER PARAMETER                                 @L1A 03500000
         AIF   ('&FILTER' EQ '').ERTN15                            @L1A 03510000
.**      RELEASE MUST BE 1.9 OR GREATER TO SPECIFY FILTER          @L1A 03520000
         AIF   ('&RELEASE(1)' EQ '').ERR13                         @P4A 03530000
         AIF   ('&RLVL'(1,3) LT '1.9').ERR13                       @MJC 03540000
.ERTN13  ANOP                                                      @L1A 03550000
.**      MUST BE CALLED BY RACROUTE MACRO TO SPECIFY FILTER        @L1A 03560000
         AIF   (NOT &ICHRAC).ERR14                                 @L1A 03570000
.ERTN14  ANOP                                                      @L1A 03580000
.**      LIST KEYWORD MUST NOT BE SPECIFIED CONCURRENTLY WITH FILTER    03590000
         AIF   ('&LIST' NE '').ERR15                               @L1A 03600000
.ERTN15  ANOP                                                      @L1A 03610000
.******* VALIDATE GLOBAL PARAMETER                                 @L3A 03620000
         AIF   ('&GLOBAL' EQ '').ERTN22                            @L3A 03630000
         AIF   ('&GLOBAL' NE 'YES' AND '&GLOBAL' NE 'NO' ).ERR19   @L3A 03640000
.ERTN19  ANOP                                                      @L3A 03650000
         AIF   ('&GLOBAL' NE '' AND NOT &ICHRAC ).ERR20            @L3A 03660000
.ERTN20  ANOP                                                      @L3A 03670000
.****************************************************              @L3A 03680000
.*  VALIDATE THAT FILTER OR LIST ARE NOT SPECIFIED                 @L3A 03690000
.*  IF GLOBAL=YES                                                  @L3A 03700000
.****************************************************              @L3A 03710000
         AIF   ('&GLOBAL' EQ 'NO').ERTN22                          @L3A 03720000
         AIF   ('&FILTER' NE '').ERR21                             @L3A 03730000
.ERTN21  ANOP                                                      @L3A 03740000
         AIF   ('&LIST' NE '').ERR22                               @L3A 03750000
.ERTN22  ANOP                                                      @L3A 03760000
         AIF   ('&MF'(1,2) NE '(M').ERTN17                         @L1A 03770000
.******* MF=M ONLY ALLOWED IF RACLIST INVOKED FROM RACROUTE AND RELEASE 03780000
.******* IS GREATER OR EQUAL TO 1.9                                @L1A 03790000
.**      TEST FOR SUPPORTING RELEASE                               @L1A 03800000
         AIF   ('&RELEASE(1)' EQ '').ERR16                         @P4A 03810000
         AIF   ('&RLVL'(1,3) LT '1.9').ERR16                       @MJC 03820000
.ERTN16  ANOP                                                      @L1A 03830000
.**      TEST FOR RACROUTE INVOKATION                              @L1A 03840000
         AIF   (NOT &ICHRAC).ERR17                                 @L1A 03850000
.ERTN17  ANOP                                                      @L1A 03860000
.* --------------------------------------------------------------- @P3A 03870000
.* VALIDATE SUBPOOL PARAMETER                                      @P3A 03880000
.* IF SUBPOOL IS SPECIFIED AND IS NOT IN THE REGISTER FORMAT       @P3A 03890000
.* THEN WE VERIFY THAT THE LITERAL IS A NUMERAL AND IS LESS        @P3A 03900000
.* THAN 255.                                                       @P3A 03910000
.* IF ERROR IS FOUND IN FIRST SUBPOOL STRING, THE SECOND STRING    @P3A 03920000
.* IS NOT LOOKED INTO.                                             @P3A 03930000
.* --------------------------------------------------------------- @P3A 03940000
         AIF   ('&SUBPOOL' EQ '').NOSPCHK                          @P3A 03950000
         AIF   ('&SUBPOOL(1)' EQ '').ERR18                         @P3A 03960000
         AIF   ('&SUBPOOL(1)'(1,1) EQ '(').SP2CHK                  @P3A 03970000
         AIF   (T'&SUBPOOL(1) NE 'N').SP2CHK                       @P3A 03980000
         AIF   ('&SUBPOOL(1)' GT '255').ERR18                      @P3A 03990000
.SP2CHK  ANOP                                                      @P3A 04000000
         AIF   ('&SUBPOOL(2)' EQ '').NOSPCHK                       @P3A 04010000
         AIF   ('&SUBPOOL(2)'(1,1) EQ '(').NOSPCHK                 @P3A 04020000
         AIF   (T'&SUBPOOL(2) NE 'N').NOSPCHK                      @P3A 04030000
         AIF   ('&SUBPOOL(2)' GT '255').ERR18                      @P3A 04040000
.ERTN18  ANOP                                                      @P3A 04050000
.NOSPCHK ANOP                                                      @P3A 04060000
.*                                                                 @P3A 04070000
.******* REGISTER SPECIFICATION OF ADDR TYPE PARAMETERS NOT ALLOWED     04080000
.******* WITH LIST FORM                                                 04090000
         AIF   ('&MF' NE 'L').RLST070                                   04100000
         AIF   ('&CLASS' EQ '').RLST010                                 04110000
         AIF   ('&CLASS'(1,1) EQ '(').ERR07                             04120000
.RLST010 ANOP                                                           04130000
         AIF   ('&LIST' EQ '').RLST020                                  04140000
         AIF   ('&LIST'(1,1) EQ '(').ERR07                              04150000
.RLST020 ANOP                                                           04160000
         AIF   ('&ACEE' EQ '').RLST030                                  04170000
         AIF   ('&ACEE'(1,1) EQ '(').ERR07                              04180000
.RLST030 ANOP                                                           04190000
         AIF   ('&INSTLN(1)' NE '&INSTLN').ERR07                        04200000
.RLST040 ANOP                                                           04210000
         AIF   ('&APPL' EQ '').RLST050                                  04220000
         AIF   ('&APPL'(1,1) EQ '(').ERR07                              04230000
.RLST050 ANOP                                                           04240000
         AIF   ('&SUBPOOL(1)' EQ '').RLST060                            04250000
         AIF   ('&SUBPOOL(1)'(1,1) EQ '(').ERR07                        04260000
.RLST060 ANOP                                                           04270000
         AIF   ('&SUBPOOL(2)' EQ '').RLST061                            04280000
         AIF   ('&SUBPOOL(2)'(1,1) EQ '(').ERR07                        04290000
.RLST061 ANOP                                                           04300000
         AIF   ('&FILTER' EQ '').RLST065                           @L1A 04310000
         AIF   ('&FILTER'(1,1) EQ '(').ERR07                       @L1A 04320000
.RLST065 ANOP                                                      @L1A 04330000
.ERTN07  ANOP                                                           04340000
.RLST070 ANOP                                                           04350000
.******* PRODUCE LIST FORM IF REQUESTED                                 04360000
         AIF   ('&MF' NE 'L').RLST430                                   04370000
&SYMBOL  DS    0F                                                       04380000
.RLST100 ANOP                                                           04390000
ICH0&SYSNDX EQU *                                                       04400000
.******* PRODUCE BYTE INFORMATION                                       04410000
         AIF   ('&SUBPOOL(1)' EQ '').RLST110                            04420000
         AIF   ('&SUBPOOL(1)'(1,1) EQ '(').RLST110                      04430000
&ICHL    DC    AL1(&SUBPOOL(1))        INDEX SUBPOOL NUMBER        @T1A 04440000
         AGO   .RLST115                                                 04450000
.RLST110 ANOP                                                           04460000
&ICHL    DC    AL1(255)                INDEX SUBPOOL NUMBER        @T1A 04470000
.RLST115 ANOP                                                           04480000
         AIF   ('&SUBPOOL(2)' EQ '').RLST120                            04490000
         AIF   ('&SUBPOOL(2)'(1,1) EQ '(').RLST120                      04500000
         DC    AL1(&SUBPOOL(2)) -      PROFILE SUBPOOL NUMBER           04510000
         AGO   .RLST125                                                 04520000
.RLST120 ANOP                                                           04530000
         DC    AL1(255)         -      PROFILE SUBPOOL NUMBER           04540000
.RLST125 ANOP                                                           04550000
         DC    AL1(2)           -      RACLIST ENTRY CODE               04560000
.******* PRODUCE FLAG BYTE 1 FROM ENVIR/OWNER/LOC PARAMETER        @L7A 04570000
&BIT0    SETA  0                       0 AND 1 INDICATE CREATE    @L4C  04580000
&BIT1    SETA  0                       '00' OR DELETE '01'        @L4C  04590000
&BIT2    SETA  0                       ADD OWNER W/ALTER          @L4C  04600000
&BIT3    SETA  0                       LOC = ABOVE SPECIFIED      @L4C  04610000
&BIT4    SETA  0                       1.8!1.8.1 SPECIFIED (WARNING    X04620000
                                        MODE SUPPORTED)           @P8C  04630000
&BIT5    SETA  0                       1.9 SPECIFIED (FILTER           X04640000
                                        SUPPORTED)                @P8C  04650000
&BIT6    SETA  0                       1.9.2 SPECIFIED            @L4A  04660000
.****** &BIT7 SHOULD NEVER BE TOUCHED, IT IS USED BY AN APAR      @L4A  04670000
         AIF   ('&ENVIR' EQ '' OR '&ENVIR' EQ 'CREATE').RLST130         04680000
         AIF   ('&ENVIR' NE 'DELETE').RLST130                           04690000
&BIT0    SETA  1                                                        04700000
.RLST130 ANOP                                                           04710000
         AIF   ('&OWNER' EQ '' OR '&OWNER' EQ 'NO').RLST131             04720000
         AIF   ('&OWNER' NE 'YES').RLST131                              04730000
&BIT2    SETA  1                                                        04740000
.RLST131 ANOP                                                           04750000
         AIF   ('&LOC' EQ '' OR '&LOC' EQ 'ANY').RLST132           @L7A 04760000
         AIF   ('&LOC' NE 'ABOVE').RLST132                         @L7A 04770000
&BIT3    SETA  1                                                   @L7A 04780000
.RLST132 ANOP                                                      @L7A 04790000
         AIF   ('&RELEASE(1)' EQ '').RLST135                       @02A 04800000
         AIF   ('&RLVL'(1,3) LT '1.8').RLST135                     @MJC 04810000
&BIT4    SETA  1       - RELEASE = 1.8!1.8.1 BIT SET ON            @P8C 04820000
.RLST133 ANOP                                                      @L1A 04830000
         AIF   ('&RLVL'(1,3) LT '1.9').RLST135                     @MJC 04840000
&BIT5    SETA  1       - RELEASE = 1.9 BIT SET ON                  @L1A 04850000
.RLST134 ANOP                                                      @L2A 04860000
         AIF   ('&RLVL'(1,5) LT '1.9.2' AND                            X04870000
                '&RLVL'(1,1) LT '2').RLST135                       @MJC 04880000
&BIT6    SETA  1       - RELEASE = 1.9.2 BIT SET ON                @L2A 04890000
.RLST135 ANOP                                                      @L1A 04900000
         DC    B'&BIT0&BIT1&BIT2&BIT3&BIT4&BIT5&BIT6.0' - FLAGS    @L2C 04910000
.******* PROCESS LIST PARMETER                                          04920000
         AIF   ('&LIST' EQ '').RLST140                                  04930000
         AIF   ('&LIST'(1,1) EQ '(').RLST140                            04940000
         DC    A(&LIST(1)) -           LIST ADDRESS                     04950000
         AGO   .RLST145                                                 04960000
.RLST140 ANOP                                                           04970000
         DC    A(0) -                  LIST ADDRESS                     04980000
.RLST145 ANOP                                                           04990000
.******* PROCESS ACEE PARAMETER                                         05000000
         AIF   ('&ACEE' EQ '').RLST150                                  05010000
         AIF   ('&ACEE'(1,1) EQ '(').RLST150                            05020000
         DC    A(&ACEE(1)) -           ACEE ADDRESS                     05030000
         AGO   .RLST155                                                 05040000
.RLST150 ANOP                                                           05050000
         DC    A(0) -                  ACEE ADDRESS                     05060000
.RLST155 ANOP                                                           05070000
.******* PROCESS INSTLN PARAMETER                                       05080000
         AIF   ('&INSTLN' EQ '' OR                                     *05090000
               '&INSTLN(1)' NE '&INSTLN').RLST160                       05100000
         DC    A(&INSTLN) -             ADDRESS OF INSTALLATION DATA    05110000
         AGO   .RLST165                                                 05120000
.RLST160 ANOP                                                           05130000
         DC    A(0) -                   ADDRESS OF INSTALLATION DATA    05140000
.RLST165 ANOP                                                           05150000
.******* PROCESS APPL PARAMETER                                         05160000
         AIF   ('&APPL' EQ '').RLST175                                  05170000
         AIF   ('&APPL'(1,1) EQ '(').RLST175                            05180000
         AIF   ('&APPL'(1,1) EQ '''').RLST170                           05190000
         DC    A(&APPL) -               APPL ADDRESS                    05200000
         AGO   .RLST180                                                 05210000
.RLST170 ANOP                                                           05220000
         DC    A(ICH1&SYSNDX) -         APPL ADDRESS                    05230000
         AGO   .RLST180                                                 05240000
.RLST175 ANOP                                                           05250000
         DC    A(0) -                   APPL ADDRESS                    05260000
.RLST180 ANOP                                                           05270000
.******* PROCESS CLASS  PARAMETER                                       05280000
         AIF   ('&CLASS' EQ '').RLST195                                 05290000
         AIF   ('&CLASS'(1,1) EQ '(').RLST195                           05300000
         AIF   ('&CLASS'(1,1) EQ '''').RLST190                          05310000
         DC    A(&CLASS) -              CLASS ADDRESS                   05320000
         AGO   .RLST200                                                 05330000
.RLST190 ANOP                                                           05340000
         DC    A(ICH2&SYSNDX) -         CLASS ADDRESS                   05350000
         AGO   .RLST200                                                 05360000
.RLST195 ANOP                                                           05370000
         DC    A(0) -                  CLASS ADDRESS                    05380000
.RLST200 ANOP                                                           05390000
.******* PROCESS FILTER PARAMETER                                  @L1A 05400000
         AIF   ('&RELEASE(1)' EQ '').RLST205                       @01A 05410000
         AIF   ('&RLVL'(1,3) LT '1.9').RLST205                     @MJC 05420000
         AIF   ('&FILTER' EQ '').RLST203                           @L1A 05430000
         AIF   ('&FILTER'(1,1) EQ '(').RLST203                     @L1A 05440000
         DC    A(&FILTER) -            FILTER STRING ADDRESS       @L1A 05450000
         AGO   .RLST205                                            @L1A 05460000
.RLST203 ANOP                                                      @L1A 05470000
         DC    A(0)       -            FILTER STRING ADDRESS       @L1A 05480000
.RLST205 ANOP                                                      @L1A 05490000
         AIF   ('&RELEASE(1)' EQ '').RLST208                       @02A 05500000
         AIF   ('&RLVL'(1,1) LT '2').RLST208                       @MJC 05510000
.******* PRODUCE EXTENDED BYTE 1 FOR RACF 2.1                      @L3A 05520000
&GBIT0   SETA  0                       RESERVED FOR FUTURE USE     @P8C 05530000
&GBIT1   SETA  0                       RESERVED FOR FUTURE USE     @P8C 05540000
&GBIT2   SETA  0                       RESERVED FOR FUTURE USE     @P8C 05550000
&GBIT3   SETA  0                       RESERVED FOR FUTURE USE     @P8C 05560000
&GBIT4   SETA  0                       RESERVED FOR FUTURE USE     @P8C 05570000
&GBIT5   SETA  0                       RESERVED FOR FUTURE USE     @P8C 05580000
.******* 2.1 OR GREATER WOULD HAVE HAD TO BEEN SPECIFIED TO BE HERE@P8A 05590000
&GBIT6   SETA  1                       GLOBAL SUPPORTED            @P8C 05600000
&GBIT7   SETA  0                       GLOBAL=YES SPECIFIED        @P8C 05610000
.RLST206 ANOP                                                      @L3A 05620000
.******* SET GLOBAL  BIT TO YES IF GLOBAL=YES                      @L3A 05630000
         AIF   ('&GLOBAL' NE 'YES').RLST207                        @L3A 05640000
&GBIT7   SETA  1                                                   @L3A 05650000
.RLST207 ANOP                                                      @L3A 05660000
         DC    B'&GBIT0&GBIT1&GBIT2&GBIT3&GBIT4&GBIT5&GBIT6&GBIT7'     X05670000
                                       EXTENDED FLAGS              @P8C 05680000
         DC    X'00'                                               @L3A 05690000
         DC    AL2(&PARMLEN)    LIST LENGTH                        @L3A 05700000
.RLST208 ANOP                                                      @L3A 05710000
.******* IF APPL EXPLICITLY SPECIFIED, PRODUCE IT BELOW LIST            05720000
         AIF   ('&APPL' EQ '').RLST210                                  05730000
         AIF   ('&APPL'(1,1) NE '''').RLST210                           05740000
ICH1&SYSNDX DC   CL8&APPL -            APPL NAME                        05750000
.RLST210 ANOP                                                           05760000
.******* IF CLASS EXPLICITLY SPECIFIED, PRODUCE IT BELOW LIST           05770000
         AIF   ('&CLASS' EQ '').RLST220                                 05780000
         AIF   ('&CLASS'(1,1) NE '''').RLST220                          05790000
ICH2&SYSNDX DC    CL8&CLASS    -       CLASS NAME                       05800000
.RLST220 ANOP                                                           05810000
.******* LIST FORM COMPLETE - TEST FOR STANDARD FORM PASS               05820000
.******* THROUGH LIST FORM                                              05830000
         AIF   (&MFFLAG).RLST390                                        05840000
         MEXIT                                                          05850000
.RLST430 ANOP                                                           05860000
         AIF   ('&MF(1)' EQ 'E' OR '&MF(1)' EQ 'M').RLST500        @L1A 05870000
.******* STANDARD FORM REQUESTED                                        05880000
&SYMBOL  DS    0H                                                       05890000
&MFFLAG  SETB  1              SET TRUE FOR PASS THROUGH LIST FORM       05900000
.******* PROCESS SUBPOOL PARAMETER                                      05910000
         AIF   ('&SUBPOOL(1)' EQ '').RLST300                            05920000
         AIF   ('&SUBPOOL(1)'(1,1) NE '(').RLST300                      05930000
         STC   &SUBPOOL(1),ICH0&SYSNDX -   STORE INDEX SUBPOOL          05940000
.RLST300 ANOP                                                           05950000
         AIF   ('&SUBPOOL(2)' EQ '').RLST305                            05960000
         AIF   ('&SUBPOOL(2)'(1,1) NE '(').RLST305                      05970000
         STC    &SUBPOOL(2),ICH0&SYSNDX+1 - STORE PROFILE SUBPOOL       05980000
.RLST305 ANOP                                                           05990000
.******* PROCESS LIST PARAMETER                                         06000000
         AIF   ('&LIST' EQ '').RLST310                                  06010000
         AIF   ('&LIST'(1,1) NE '(').RLST310                            06020000
         ST    &LIST(1),ICH0&SYSNDX+4 - STORE LIST ADDRESS              06030000
.RLST310 ANOP                                                           06040000
.******* PROCESS ACEE PARAMETER                                         06050000
         AIF   ('&ACEE' EQ '').RLST320                                  06060000
         AIF   ('&ACEE'(1,1) NE '(').RLST320                            06070000
         ST    &ACEE(1),ICH0&SYSNDX+8 - STORE ACEE ADDRESS              06080000
.RLST320 ANOP                                                           06090000
.******* PROCESS INSTLN PARAMETER                                       06100000
         AIF   ('&INSTLN' EQ '' OR '&INSTLN(1)' EQ '&INSTLN').RLST330   06110000
         ST    &INSTLN(1),ICH0&SYSNDX+12 - STORE INSTALLATION DATA ADDR 06120000
.RLST330 ANOP                                                           06130000
.******* PROCESS APPL PARAMETER                                         06140000
         AIF   ('&APPL' EQ '').RLST340                                  06150000
         AIF   ('&APPL'(1,1) NE '(').RLST340                            06160000
         ST    &APPL(1),ICH0&SYSNDX+16 - STORE APPL NAME ADDRESS        06170000
.RLST340 ANOP                                                           06180000
.******* PROCESS CLASS PARAMETER                                        06190000
         AIF   ('&CLASS' EQ '').RLST350                                 06200000
         AIF   ('&CLASS'(1,1) NE '(').RLST350                           06210000
         ST    &CLASS(1),ICH0&SYSNDX+20 - STORE CLASS NAME ADDRESS      06220000
.RLST350 ANOP                                                           06230000
.******* PROCESS FILTER PARAMETER                                  @L1A 06240000
         AIF   ('&FILTER' EQ '').RLST355                           @L1A 06250000
         AIF   ('&FILTER'(1,1) NE '(').RLST355                     @L1A 06260000
         ST    &FILTER(1),ICH0&SYSNDX+24 - STORE FILTER STRING     @P1C 06270000
.*******                                   ADDRESS                 @P1C 06280000
.RLST355 ANOP                                                      @L1A 06290000
.******* LIST FORM MODIFICATION COMPLETE                                06300000
.******* - PRODUCE LIST FORM WITH BAL AROUND                            06310000
         CNOP  0,4                                                      06320000
&OFFSET  SETA  28                                                  @P8C 06330000
         AIF   ('&APPL' EQ '').RLST380                                  06340000
         AIF   ('&APPL'(1,1) NE '''').RLST380                           06350000
&OFFSET  SETA  &OFFSET+8                                                06360000
.RLST380 ANOP                                                           06370000
         AIF   ('&CLASS' EQ '').RLST385                                 06380000
         AIF   ('&CLASS'(1,1) NE '''').RLST385                          06390000
&OFFSET  SETA  &OFFSET+8                                                06400000
.RLST385 ANOP                                                           06410000
         AIF   ('&RELEASE(1)' EQ '').RLST387                       @02A 06420000
         AIF   ('&RLVL'(1,3) LT '1.9').RLST386                     @MJC 06430000
&OFFSET  SETA  &OFFSET+4                    - ADD OFFSET OF FILTER @L1A 06440000
.RLST386 ANOP                                                      @P8A 06450000
         AIF   ('&RLVL'(1,1) LT '2').RLST387                       @MJC 06460000
&OFFSET  SETA  &OFFSET+4                    - ADD OFFSET OF GLOBAL @P8A 06470000
.RLST387 ANOP                                                      @L1A 06480000
         BAL   1,*+&OFFSET -  POINT REG 1 AT PARM LIST                  06490000
         AGO   .RLST100                                                 06500000
.RLST390 ANOP                                                           06510000
.***********************************************************       @T1A 06520000
.* IF THIS MACRO WAS INVOKED INTERNALLY BY THE RACROUTE            @T1A 06530000
.* MACRO, SIMPLY EXIT RATHER THAN GOING TO THE RACF ROUTINE.       @T1A 06540000
.***********************************************************       @T1A 06550000
         AIF   (&ICHRAC).RLST395                                   @T1A 06560000
.******* RETURN FROM LIST FORM TO PRODUCE SVC                           06570000
         L     15,16(0,0)            GET CVT ADDRESS                    06580000
         L     15,X'3E0'(0,15)       GET RACF CVT ADDRESS               06590000
         LTR   15,15                 RACF CVT EXIST                     06600000
         BZ    *+12                  NO, BRANCH TO SET NOT ACTIVE  @P5C 06610000
         CLI   X'AC'(15),X'02'       RACF FUNCTION SUPPORTED (RCVTVERS) 06620000
         BNL   *+20                  YES, BRANCH                        06630000
         LA    15,28(0,0)            RACF FUNCTION NOT SUPPORTED        06640000
         B     *+14                  SKIP CALL                          06650000
         LA    15,16(0,0)            RACF NOT ACTIVE RET CODE           06660000
         B     *+6                   SKIP CALL                          06670000
         SVC   132                   INVOKE RACF SVC ROUTER             06680000
.RLST395 ANOP                                                      @T1A 06690000
         MEXIT                                                          06700000
.******* PRODUCE EXECUTE FORM OF MACRO                                  06710000
.RLST500 ANOP                                                           06720000
         AIF   (&ICHRAC).RLST503                                   @T1A 06730000
&SYMBOL  IHBINNRA &MF(2) -    POINT REG1 AT LIST FORM                   06740000
         AGO   .RLST505                                            @T1A 06750000
.**************************************************************    @T1A 06760000
.*  IF THIS MACRO WAS INVOKED INTERNALLY BY THE RACROUTE MACRO,    @T1A 06770000
.*  PICK UP THE ADDRESS OF THE RACLIST PARAMETER LIST FROM THE     @T1A 06780000
.*  RACROUTE PARAMETER LIST.                                       @T1A 06790000
.**************************************************************    @T1A 06800000
.RLST503 ANOP                                                      @T1A 06810000
         A     1,36(1)           POINT REG 1 AT RACLIST LIST       @T1A 06820000
.RLST505 ANOP                                                      @T1A 06830000
.******* PRODUCE INSTRUCTIONS TO MODIFY LIST                            06840000
         AIF   ('&SUBPOOL(1)' EQ '').RLST515                            06850000
         AIF   ('&SUBPOOL(1)'(1,1) EQ '(').RLST510                      06860000
         MVI   0(1),&SUBPOOL(1) -      INDEX SUBPOOL NUMBER             06870000
         AGO   .RLST515                                                 06880000
.RLST510 ANOP                                                           06890000
         STC   &SUBPOOL(1),0(1) -      INDEX SUBPOOL NUMBER             06900000
.RLST515 ANOP                                                           06910000
         AIF   ('&SUBPOOL(2)' EQ '').RLST525                            06920000
         AIF   ('&SUBPOOL(2)'(1,1) EQ '(').RLST520                      06930000
         MVI   1(1),&SUBPOOL(2) -      PROFILE SUBPOOL NUMBER           06940000
         AGO   .RLST525                                                 06950000
.RLST520 ANOP                                                           06960000
         STC   &SUBPOOL(2),1(1) -      PROFILE SUBPOOL NUMBER           06970000
.RLST525 ANOP                                                           06980000
.******* PRODUCE FLAG BYTE                                         @L7A 06990000
&BIT0    SETA  0                                                        07000000
&BIT1    SETA  0                                                        07010000
&BIT2    SETA  0                                                        07020000
&BIT3    SETA  0                                                   @L7A 07030000
&BIT4    SETA  0                                                   @L1A 07040000
&BIT5    SETA  0                                                   @L1A 07050000
&BIT6    SETA  0                                                   @L4A 07060000
.****** DON'T TOUCH &BIT7 IT IS USED BY AN APAR                    @L4A 07070000
&BIX0    SETA  1                                                        07080000
&BIX1    SETA  1                                                        07090000
&BIX2    SETA  1                                                        07100000
&BIX3    SETA  1                                                   @L7A 07110000
&BIX4    SETA  1                                                   @L1A 07120000
&BIX5    SETA  1                                                   @L1A 07130000
&BIX6    SETA  1                                                   @L4A 07140000
.****** DON'T TOUCH &BIX7 IT IS USED BY AN APAR                    @L4A 07150000
         AIF   ('&ENVIR&OWNER&LOC&FILTER' EQ '').RLST532           @P2C 07160000
         AIF   ('&ENVIR' EQ '').RLST530                                 07170000
&BIX0    SETA  0                                                        07180000
&BIX1    SETA  0                                                        07190000
         AIF   ('&ENVIR' EQ 'CREATE').RLST530                           07200000
         AIF   ('&ENVIR' NE 'DELETE').RLST530                           07210000
&BIT0    SETA  1                                                        07220000
.RLST530 ANOP                                                           07230000
         AIF   ('&OWNER' EQ '').RLST531                                 07240000
&BIX2    SETA  0                                                        07250000
         AIF   ('&OWNER' EQ 'NO').RLST531                               07260000
         AIF   ('&OWNER' NE 'YES').RLST531                              07270000
&BIT2    SETA  1                                                        07280000
.RLST531 ANOP                                                           07290000
         AIF   ('&LOC' EQ '').RLST532                              @L7A 07300000
&BIX3    SETA  0                                                   @L7A 07310000
         AIF   ('&LOC' EQ 'ANY').RLST532                           @L7A 07320000
         AIF   ('&LOC' NE 'ABOVE').RLST532                         @L7A 07330000
&BIT3    SETA  1                                                   @L7A 07340000
.RLST532 ANOP                                                      @L7A 07350000
         AIF   (N'&MF LT 2).RLST536 - NO PARAMETER LIST SUPPLIED   @L2C 07360000
         AIF   ('&RELEASE(1)' EQ '').RLST535                       @02A 07370000
         AIF   ('&RLVL'(1,3) LT '1.8').RLST535                     @MJC 07380000
&BIX4    SETA  0    -  CLEAR EXISTING RELEASE=1.8!1.8.1 BIT        @P8C 07390000
&BIT4    SETA  1    -  SET RELEASE = 1.8!1.8.1 BIT ON              @P8C 07400000
.RLST533 ANOP                                                      @L1A 07410000
         AIF   ('&RLVL'(1,3) LT '1.9').RLST535                     @MJC 07420000
&BIX5    SETA  0    -  CLEAR EXISTING RELEASE=1.9 BIT              @L1A 07430000
&BIT5    SETA  1    -  SET RELEASE = 1.9 BIT ON                    @L1A 07440000
.RLST534 ANOP                                                      @L2A 07450000
         AIF   ('&RLVL'(1,5) LT '1.9.2' AND                            X07460000
                '&RLVL'(1,1) LT '2').RLST535                       @MJC 07470000
&BIX6    SETA  0    -  CLEAR EXISTING RELEASE=1.9.2 BIT            @L2A 07480000
&BIT6    SETA  1    -  SET RELEASE = 1.9.2 BIT ON                  @L2A 07490000
.RLST535 ANOP                                                      @L2C 07500000
         NI    3(1),B'&BIX0&BIX1&BIX2&BIX3&BIX4&BIX5&BIX6.0'       @L2C 07510000
         OI    3(1),B'&BIT0&BIT1&BIT2&BIT3&BIT4&BIT5&BIT6.0'           X07520000
                                        FLAGS                      @P8C 07530000
.RLST536 ANOP                                                      @L2A 07540000
.******* PROCESS LIST PARAMETER                                         07550000
         AIF   ('&LIST' EQ '').RLST545                                  07560000
         AIF   ('&LIST'(1,1) NE '(').RLST540                            07570000
         ST    &LIST(1),4(1) -          STORE LIST ADDRESS              07580000
         AGO   .RLST545                                                 07590000
.RLST540 ANOP                                                           07600000
         LA    0,&LIST(1) -             MOVE LIST ADDRESS               07610000
         ST    0,4(1) -                 INTO PARM LIST                  07620000
.RLST545 ANOP                                                           07630000
.******* PROCESS ACEE PARAMETER                                         07640000
         AIF   ('&ACEE' EQ '').RLST555                                  07650000
         AIF   ('&ACEE'(1,1) NE '(').RLST550                            07660000
         ST    &ACEE(1),8(1) -          STORE ACEE ADDRESS              07670000
         AGO   .RLST555                                                 07680000
.RLST550 ANOP                                                           07690000
         LA    0,&ACEE(1) -             MOVE ACEE ADDRESS               07700000
         ST    0,8(1) -                 INTO PARM LIST                  07710000
.RLST555 ANOP                                                           07720000
.******* PRODUCE INSTALLATION DATA ADDRESS                              07730000
         AIF   ('&INSTLN' EQ '').RLST565                                07740000
         AIF   ('&INSTLN'(1,1) NE '(').RLST560                          07750000
         ST    &INSTLN(1),12(1) -       STORE INSTALLATION ADDR         07760000
         AGO   .RLST565                                                 07770000
.RLST560 ANOP                                                           07780000
         LA    0,&INSTLN -              ADDRESS INSTALLATION DATA       07790000
         ST    0,12(1) -                STORE INSTALLATION DATA ADDRESS 07800000
.RLST565 ANOP                                                           07810000
.******* HANDLE APPL PARAMETER                                          07820000
         AIF   ('&APPL' EQ '').RLST575                                  07830000
         AIF   ('&APPL'(1,1) EQ '''').ERR10                             07840000
         AIF   ('&APPL'(1,1) NE '(').RLST570                            07850000
         ST    &APPL(1),16(1) -         STORE APPL NAME ADDRESS         07860000
         AGO   .RLST575                                                 07870000
.RLST570 ANOP                                                           07880000
         LA    0,&APPL -                MOVE APPL NAME ADDRESS          07890000
         ST    0,16(1) -                INTO PARM LIST                  07900000
.ERTN10  ANOP                                                           07910000
.RLST575 ANOP                                                           07920000
.******* HANDLE CLASS PARAMETER                                         07930000
         AIF   ('&CLASS' EQ '').RLST585                                 07940000
         AIF   ('&CLASS'(1,1) EQ '''').ERR09                            07950000
         AIF   ('&CLASS'(1,1) NE '(').RLST580                           07960000
         ST    &CLASS(1),20(1) -        STORE CLASS NAME ADDRESS        07970000
         AGO   .RLST585                                                 07980000
.RLST580 ANOP                                                           07990000
         LA    0,&CLASS -               MOVE CLASS NAME ADDRESS         08000000
         ST    0,20(1) -                INTO PARM LIST                  08010000
.ERTN09  ANOP                                                           08020000
.RLST585 ANOP                                                           08030000
.******* HANDLE FILTER PARAMETER                                   @L1A 08040000
         AIF   ('&FILTER' EQ '').RLST595                           @L1A 08050000
         AIF   ('&FILTER'(1,1) NE '(').RLST590                     @L1A 08060000
         ST    &FILTER(1),24(1)         - STORE FILTER STRING ADDRESS   08070000
         AGO   .RLST595                                            @L1A 08080000
.RLST590 ANOP                                                      @L1A 08090000
         LA    0,&FILTER -              MOVE FILTER STRING ADDRESS @L1A 08100000
         ST    0,24(1) -                INTO PARM LIST             @L1A 08110000
.RLST595 ANOP                                                      @L1A 08120000
.******* PRODUCE EXTENDED FLAG BYTE                                @L3A 08130000
.******* SET GLOBAL BIT TO YES IF GLOBAL=YES                       @L3A 08140000
.******* BYPASS THIS PROCESSING IF RELEASE IS NOT 2.1              @L3A 08150000
         AIF   ('&RELEASE(1)' EQ '').RLST599                       @02A 08160000
         AIF   ('&RLVL'(1,1) LT '2').RLST599                       @MJC 08170000
&GBIT0   SETA  0                                                   @P8C 08180000
&GBIT1   SETA  0                                                   @P8C 08190000
&GBIT2   SETA  0                                                   @P8C 08200000
&GBIT3   SETA  0                                                   @P8C 08210000
&GBIT4   SETA  0                                                   @P8C 08220000
&GBIT5   SETA  0                                                   @P8C 08230000
.******* 2.1 OR GREATER WOULD HAVE HAD TO BEEN SPECIFIED TO BE HERE@P8A 08240000
&GBIT6   SETA  1                                                   @P8C 08250000
&GBIT7   SETA  0                                                   @P8C 08260000
.******* SET BIT IF GLOBAL=YES WAS SPECIFIED                       @L3A 08270000
.RLST596 ANOP                                                      @L3A 08280000
         AIF   ('&GLOBAL' NE 'YES').RLST597                        @L3A 08290000
&GBIT7   SETA  1                                                   @L3A 08300000
.RLST597 ANOP                                                      @L3A 08310000
&GBIX0   SETA  1                                                   @L3A 08320000
&GBIX1   SETA  1                                                   @L3A 08330000
&GBIX2   SETA  1                                                   @L3A 08340000
&GBIX3   SETA  1                                                   @L3A 08350000
&GBIX4   SETA  1                                                   @L3A 08360000
&GBIX5   SETA  1                                                   @L3A 08370000
.******* GBIT6 WOULD HAVE TO BE ON TO GET HERE, SO SET GBIX6 OFF   @P8A 08380000
&GBIX6   SETA  0                                                   @P8C 08390000
&GBIX7   SETA  1                                                   @L3A 08400000
         AIF   ('&GLOBAL' NE 'NO').RLST598                         @L3A 08410000
&GBIX7   SETA  0                                                   @L3A 08420000
         AGO  .RLST598                                             @L3A 08430000
.RLST598 ANOP                                                      @L3A 08440000
         NI    28(1),B'&GBIX0&GBIX1&GBIX2&GBIX3&GBIX4&GBIX5&GBIX6&GBIX7*08450000
               '                                                   @L3A 08460000
         OI    28(1),B'&GBIT0&GBIT1&GBIT2&GBIT3&GBIT4&GBIT5&GBIT6&GBIT7*08470000
               '                        EXTENDED FLAGS             @P8C 08480000
.RLST599 ANOP                                                      @L3A 08490000
.******* MODIFICATION COMPLETE - AGO ABOVE TO PRODUCE ENTRY LOGIC       08500000
         AGO   .RLST390                                                 08510000
.******* DIAGNOSTICS                                                    08520000
.ERR04   ANOP                                                           08530000
         MNOTE 8,'*** INVALID OWNER PARAMETER SPECIFIED ***'            08540000
         AGO   .ERTN04                                                  08550000
.ERR05   ANOP                                                           08560000
         MNOTE 8,'*** INVALID ENVIR PARAMETER SPECIFIED ***'            08570000
         AGO   .ERTN05                                                  08580000
.ERR06   ANOP                                                           08590000
         MNOTE 8,'*** INVALID MF PARAMETER SPECIFIED ***'               08600000
         AGO   .ERTN06                                                  08610000
.ERR07   ANOP                                                           08620000
         MNOTE 8,'*** REGISTER ADDRESS SPECIFICATION NOT ALLOWED WITH L-08630000
               IST FORM ***'                                            08640000
         AGO   .ERTN07                                                  08650000
.ERR08   ANOP                                                      @PAA 08660000
         MNOTE 8,'*** RACLIST CAN BE INVOKED ONLY VIA RACROUTE FOR RELEX08670000
               ASE 1.9 AND LATER ***'                              @PAA 08680000
         AGO   .ERTN08                                             @PAA 08690000
.ERR09   ANOP                                                           08700000
         MNOTE 8,'*** ''CLASSNAME'' FORM NOT ALLOWED WITH MF=E ***'     08710000
         AGO   .ERTN09                                                  08720000
.ERR10   ANOP                                                           08730000
         MNOTE 8,'*** ''APPL'' FORM NOT ALLOWED WITH MF=E ***'          08740000
         AGO   .ERTN10                                                  08750000
.ERR11   ANOP                                                      @L7A 08760000
         MNOTE 8,'*** INVALID LOC PARAMETER SPECIFIED ***'         @L7A 08770000
         AGO   .ERTN11                                             @L7A 08780000
.ERR12   ANOP                                                      @L7A 08790000
         MNOTE 8,'*** ''LOC'' ALLOWED ONLY IF RACLIST IS INVOKED FROM T+08800000
               HE RACROUTE MACRO ***'                              @L7A 08810000
         AGO   .ERTN12                                             @L7A 08820000
.ERR13   ANOP                                                      @L1A 08830000
         MNOTE 4,'*** ''RELEASE'' INCOMPATIBLE WITH SPECIFIED KEYWORD(SX08840000
               ) ***'                                              @L1A 08850000
         AGO   .ERTN13                                             @L1A 08860000
.ERR14   ANOP                                                      @L1A 08870000
         MNOTE 8,'*** ''FILTER'' ALLOWED ONLY IF RACLIST IS INVOKED FRO+08880000
               M THE RACROUTE MACRO ***'                           @L1A 08890000
         AGO   .ERTN14                                             @L1A 08900000
.ERR15   ANOP                                                      @L1A 08910000
         MNOTE 8,'*** ''FILTER'' AND ''LIST'' CANNOT BE USED CONCURRENT+08920000
               LY ***'                                             @L1A 08930000
         AGO   .ERTN15                                             @L1A 08940000
.ERR16   ANOP                                                      @L1A 08950000
         MNOTE 4,'*** ''RELEASE'' INCOMPATIBLE WITH SPECIFIED KEYWORD(SX08960000
               ) ***'                                              @L1A 08970000
         AGO   .ERTN16                                             @L1A 08980000
.ERR17   ANOP                                                      @L1A 08990000
         MNOTE 8,'*** ''MF=M'' PARAMETER SPECIFIED ALLOWED ONLY IF RACL+09000000
               IST IS INVOKED FROM THE RACROUTE MACRO ***'         @L1A 09010000
         AGO   .ERTN17                                             @L1A 09020000
.ERR18   ANOP                                                      @P3A 09030000
         MNOTE 8,'*** INVALID ''SUBPOOL'' PARAMETER ***'           @P3A 09040000
         AGO   .ERTN18                                             @P3A 09050000
.ERR19   ANOP                                                      @L3A 09060000
         MNOTE 8,'*** INVALID GLOBAL PARAMETER SPECIFIED ***'      @L3A 09070000
         AGO   .ERTN19                                             @L3A 09080000
.ERR20   ANOP                                                      @L3A 09090000
         MNOTE 8,'*** ''GLOBAL'' ALLOWED ONLY IF RACLIST IS INVOKED FRO+09100000
               M THE RACROUTE MACRO ***'                                09110000
         AGO   .ERTN20                                             @L3A 09120000
.ERR21   ANOP                                                      @L3A 09130000
         MNOTE 8,'*** FILTER KEYWORD IS INVALID IF GLOBAL=YES IS SPECIF+09140000
               IED ***'                                            @L3A 09150000
         AGO   .ERTN21                                             @L3A 09160000
.ERR22   ANOP                                                      @L3A 09170000
         MNOTE 8,'*** LIST KEYWORD IS INVALID IF GLOBAL=YES IS SPECIFIE+09180000
               D ***'                                              @L3A 09190000
         AGO   .ERTN22                                             @L3A 09200000
.ERLVL1  MNOTE 8,'*** INCORRECT SPECIFICATION OF ''RELEASE'' ***'  @L7A 09210000
         AGO   .ERLVL1R                                            @L7A 09220000
.ERLVL2  MNOTE 4,'*** ''RELEASE-CHECK'' ONLY VALID WITH ''MF=E'' ***'  X09230000
                                                                   @L7A 09240000
         AGO   .ERLVL2R                                            @L7A 09250000
.ERLVLA  MNOTE 4,'*** ''RELEASE'' INCOMPATIBLE WITH SPECIFIED KEYWORD(SX09260000
               ) ***'                                              @L7A 09270000
         AGO   .ERLVLAR                                            @L7A 09280000
         MEND                                                           09290000
                                                                        09300000
