* A 00000000-99999999                                              @L8A 00010000
* START OF SPECIFICATIONS ********************************************* 00020000
*                                                                    *  00030000
* $MAC(RACSTAT) COMP(SC1BN) PROD(RACF):                              *  00040000
*                                                                    *  00050000
* DESCRIPTIVE NAME:                                                  *  00060000
*   RACF STATUS EXTRACTION INTERFACE                             @M2C*  00070000
*                                                                    *  00080000
* *01* PROPRIETARY STATEMENT=                                         * 00090000
*  **PROPRIETARY_STATEMENT********************************************* 00100000
*                                                                     * 00110000
*                                                                     * 00120000
*   Licensed Materials - Property of IBM                              * 00130000
*   5650-ZOS Copyright IBM Corp. 1977, 2019                           * 00140000
*                                                                     * 00150000
*   STATUS= HBB77C0                                                   * 00160000
*                                                                     * 00170000
*  **END_OF_PROPRIETARY_STATEMENT************************************** 00180000
*                                                                    *  00190000
*01* EXTERNAL CLASSIFICATION:                                        *  00200000
*02* GUPI:                                                           *  00210000
*01* END OF EXTERNAL CLASSIFICATION:                                 *  00220000
*                                                                    *  00230000
*                                                                     * 00240000
* FUNCTION :                                                          * 00250000
*   THIS MACRO PROVIDES THE INTERFACE TO THE RACF STATUS              * 00260000
*   EXTRACTION ROUTINE.                                               * 00270000
*                                                                     * 00280000
*   INPUT TO THE STATUS ROUTINE PROVIDED BY THIS MACRO                * 00290000
*   CONSISTS OF THE ADDRESS OF A PARAMETER LIST IN REGISTER           * 00300000
*   ONE. OUTPUT CONSISTS OF A RETURN CODE IN REGISTER 15.         @M2C* 00310000
*                                                                     * 00320000
* MACROS:                                                             * 00330000
*   IHBINNRA                                                      @M2C* 00340000
*                                                                     * 00350000
* CHANGE ACTIVITY :                                                   * 00360000
*                      UZ90283                                @ZA90283* 00370000
*                      UZ90284                                @ZA90284* 00380000
*                      UZ90285                                @ZA90285* 00390000
*                      $L7=HRF1702,RACF/170,850319,CNTDSD:        @L7A* 00400000
*                      $M1=JRF1812,RACF/181,871119,CNTDSD:        @M1A* 00410000
*   $M2=JBB3313 RACF/190 881104 PDB_S1: SUPPORT RELEASE 1.9       @M2A* 00420000
*   $P1=PGP0413 RACF/190 890612 PDB_S1: PTM PGP0413               @P1A* 00430000
*   $P2=PGP0531 RACF/190 890813 PDJCD1: PTM PGP0531               @P2A* 00440000
*   $P3=PGP0620 RACF/190 890922 PDB_S1: PTM PGP0620               @P3A* 00450000
*   $P4=PI90007 RACF/190 891010 PDB_S1: PTM PI90007               @P4A* 00460000
*   $M3=RELID   RACF/192 900904 PDAHW1: SUPPORT RELEASE 1.9.2     @M3A* 00470000
*   $P5=PJA0029 RACF/192 910524 PDPSB1: PTM PJA0029               @P5A* 00480000
*   $M4=RELID   RACF/210 930427 PDKAF1: SUPPORT RELEASE 2.1       @M4A* 00490000
*   $M5=OW10709 RACF/220 940510 PDJMV1: RELEASE 2.2 SUPPORT       @M5A* 00500000
*   $D1=OW10709 RACF/220 940826 PDSWD1: POSIT DCR 11 DO80011      @D1A* 00510000
*   $P6=OW10709 RACF/220 941003 PDSWD1: PTM PP20005               @P6A* 00520000
*   $M6=RELID   RACF/230 961422 PDJMV1: SUPPORT RELEASE 2.3.0     @M6A* 00530000
*   $P7=PQC1932 RACF/230 960722 PDJMV1: PTM PQC1932     2.3.0     @P7C* 00540000
*   $M7=RELID   RACF/240 970728 PDCAM1: SUPPORT RELEASE 2.4       @M7A* 00550000
*   $M8=RELID   RACF/260 970728 PDCAM1: SUPPORT RELEASE 2.6       @M8A* 00560000
*   $M9=RELID   HRF2608  980624 PDRDS2: SUPPORT RELEASE HRF2608   @M9A* 00570000
*   $MA=RELID   HRF7703  990429 PDRDS2: SUPPORT RELEASE HRF7703   @MAA* 00580000
*   $MB=RELID   HRF7705  000405 PDIFS2: SUPPORT RELEASE HRF7705   @MBA* 00590000
*   $MC=RELID   HRF7706  010430 PDRDC1: SUPPORT RELEASE HRF7706   @MCA* 00600000
*   $MD=RELID   HRF7707  020109 PDMSF1: SUPPORT RELEASE HRF7707   @MDA* 00610000
*   $ME=RELID   HRF7708  020118 PDMSF1: SUPPORT RELEASE HRF7708   @MEA* 00620000
*   $MF=DYNCDT  HBB7709  021114 PDLAW1: Dynamic CDT               @MFA* 00630000
*   $MG=RELID   HBB7720  040224 PDRIV1: Support SAF FMID HBB7720  @MGA* 00640000
*   $MH=RELID   HBB7730  050531 PDRIV1: Support SAF FMID HBB7730  @MHA* 00650000
*   $MI=RELID   HBB7740  060330 PDRIV1: Support SAF FMID HBB7740  @MIA* 00660000
*   $MJ=RELID   HBB7750  070302 PDRIV1: Support SAF FMID HBB7750  @MJA* 00670000
*   $MK=RELID   HBB7760  080522 PDJLW1: Support SAF FMID HBB7760  @MKA* 00680000
*   $ML=RELID   HBB7770  090511 PDJLW1: Support SAF FMID HBB7770  @MLA* 00690000
*   $MM=RELID   HBB7780  100513 PDJLW1: Support SAF FMID HBB7780  @MMA* 00700000
*   $MN=RELID   HBB7790  110117 PDJLW1: Support SAF FMID HBB7790  @MNA* 00710000
*   $MO=RELID   HBB77A0  130116 PDAWS1: Support SAF FMID HBB77A0  @MOA* 00720000
*   $MP=RELID   HBB77B0  150508 PDPGP1: Support SAF FMID HBB77B0  @MPA* 00730000
*   $MR=RELID   HBB77C0  180530 PDGTM1: ParmList Version Support  @MRA* 00740000
*                                                                     * 00750000
*                                                                     * 00760003
*                                                                     * 00770000
*                                                                     * 00780000
* CHANGE DESCRIPTIONS:                                                * 00790000
*   A000000-999999                                            @PC0039T  00800000
*   A - SUPPORT TO INVOKE RACSTAT VIA RACROUTE                    @M2A* 00810000
*   A - CHANGE A CONTINUATION LINE FOR ASSEMBLER F.               @P1A* 00820000
*   A - CORRECT M AND E FORM PLIST GENERATION THROUGH RACROUTE    @P2A* 00830000
*   A - CORRECT SUPPORT WHEN RACROUTE REQUEST=STAT IS CODED       @P3A* 00840000
*   C - CORRECT POSITION OF THE LABEL FROM THE RACROUTE           @P4A* 00850000
*   C - ALLOW RACF RELEASE 1.9.2 TO BE SPECIFIED                  @M3A* 00860000
*   C - STATUS TO CORRECTLY CORRESPOND TO MVS LEVEL               @P5A* 00870000
*   A - ALLOW RACF RELEASE 2.1 TO BE SPECIFIED                    @M4A* 00880000
*   A - ALLOW RACF RELEASE 2.2 TO BE SPECIFIED                    @M5A* 00890000
*   A - ADD NEW KEYWORDS COPY AND COPYLEN.                        @D1A* 00900000
*   C - CHANGE COPYLEN CMTS TO INDICATE VALUE INSTEAD OF ADDRESS. @P6A* 00910000
*   A - ALLOW RACF RELEASE 2.3 TO BE SPECIFIED                    @M6A* 00920000
*   C - CHANGE PROGRAM NUMBER                                     @P9C* 00930000
*   A - ALLOW RACF RELEASE 2.4 TO BE SPECIFIED                    @M7A* 00940000
*   A - ALLOW RACF RELEASE 2.6 TO BE SPECIFIED FOR FMID HRF2260   @M8A* 00950000
*   A - ALLOW RACF RELEASE 2608 TO BE SPECIFIED FOR FMID HRF2608  @M9A* 00960000
*   A - ALLOW RACF RELEASE 7703 TO BE SPECIFIED FOR FMID HRF7703  @MAA* 00970000
*   A - ALLOW RACF RELEASE 7705 TO BE SPECIFIED FOR FMID HRF7705  @MBA* 00980000
*   A - ALLOW RACF RELEASE 7706 TO BE SPECIFIED FOR FMID HRF7706  @MCA* 00990000
*   A - ALLOW RACF RELEASE 7707 TO BE SPECIFIED FOR FMID HRF7707  @MDA* 01000000
*   A - ALLOW RACF RELEASE 7708 TO BE SPECIFIED FOR FMID HRF7708  @MEA* 01010000
*   A - New keyword NEXT=                                         @MFA* 01020000
*   A - ALLOW RACF RELEASE 7709 TO BE SPECIFIED FOR FMID HRF7709  @MFA* 01030000
*   A - Add support for SAF Release FMID HBB7720                  @MGA* 01040000
*   A - Add support for SAF Release FMID HBB7730                  @MHA* 01050000
*   A - Add support for SAF Release FMID HBB7740                  @MIA* 01060000
*   A - Add support for SAF Release FMID HBB7750                  @MJA* 01070000
*   A - Add support for SAF Release FMID HBB7760                  @MKA* 01080000
*   A - Add support for SAF Release FMID HBB7770                  @MLA* 01090000
*   A - Add support for SAF Release FMID HBB7780                  @MMA* 01100000
*   A - Add support for SAF Release FMID HBB7790                  @MNA* 01110000
*   A - Add support for SAF Release FMID HBB77A0                  @MOA* 01120000
*   A - Add support for SAF Release FMID HBB77B0                  @MPA* 01130000
*   A - Support for Parameter List Version                            * 01140000
*       - Specify the parameter list version instead of               * 01150000
*         the last 4 characters of the FMID by specifying             * 01160000
*         RELEASE=PLV0001                                         @MRA* 01170000
*                                                                     * 01180000
*                                                                     * 01190003
*                                                                     * 01200003
*                                                                     * 01210000
*                                                                     * 01220000
* END OF SPECIFICATIONS *********************************************** 01230000
         MACRO                                                          01240000
&LABEL   RACSTAT &CLASS=,&ENTRY=,&MF=S,&RELEASE=,                      +01250000
               &COPY=,&COPYLEN=,&NEXT=                             @MFC 01260000
         LCLB  &MFLIST              1 => LIST FORM                      01270000
         LCLB  &MFEXEC              1 => EXECUTE FORM                   01280000
         LCLB  &MFSTAND             1 => STANDARD FORM                  01290000
         LCLB  &NOENT               1 => IGNORE ENTRY PARAMETER         01300000
         LCLB  &NOCOPY              1 => IGNORE COPY AND COPYLEN        01310000
.*                                       ON STANDARD FORM DUE TO        01320000
.*                                       INCORRECT SPECIFICATION OF     01330000
.*                                       ONE OR THE OTHER.         @D1A 01340000
         LCLB  &NONEXT              1 => Ignore NEXT on standard        01350000
.*                                       form if CLASS is also          01360000
.*                                       specified                 @MFA 01370000
         LCLB  &GENCOPY             1 => COPY & COPYLEN PARMS WILL BE   01380000
.*                                       GENERATED                      01390000
.*                                  (IF RELEASE=2.2 OR HIGHER)     @D1A 01400000
         LCLB  &GENNEXT             1 => NEXT parameter will be         01410000
.*                                       generated if                   01420000
.*                                       RELEASE=7708 or higher    @MFA 01430000
         LCLC  &RLVL                Release level character string @MOA 01440000
.*                                                                 @M2A 01450000
.* DEFINE GLOBAL SET SYMBOLS                                       @M2A 01460000
.*                                                                 @M2A 01470000
         GBLB  &ICHRAC           1 => RACSTAT INVOKED VIA RACROUTE @M2A 01480000
         GBLC  &ICHL             SETS ADDRESSABILITY TO THE        @M2A 01490000
.*                               PARAMETER LIST FOR MACRO RACROUTE @M2A 01500000
.*                                                                      01510000
.* PERFORM PARAMETER ANALYSIS AND DIAGNOSIS                             01520000
.*                                                                      01530000
.* VALIDATE RELEASE PARAMETER                                      @L7A 01540000
         AIF   ('&RELEASE' EQ '').CHKMF  Skip other release checks @MFC 01550000
         AIF   (N'&RELEASE GT 2).ERLVL1  INVALID RELEASE PARAMETER @L7A 01560000
         AIF   ('&RELEASE(1)' NE '1.6' AND                             X01570000
               '&RELEASE(1)' NE '1.7' AND '&RELEASE(1)' NE '1.8' AND   X01580000
               '&RELEASE(1)' NE '1.8.1').TESTG19                   @M4C 01590000
         AGO   .SKIP001                                            @M2A 01600000
.TESTG19 ANOP                                                      @M4C 01610000
         AIF   ('&RELEASE(1)' NE '1.9' AND '&RELEASE(1)' NE            X01620000
                '1.9.2' AND '&RELEASE(1)' NE '2.1'                     X01630000
                AND '&RELEASE(1)' NE '2.2'                             X01640000
                AND '&RELEASE(1)' NE '2.3'                             X01650000
                AND '&RELEASE(1)' NE '2.4'                             X01660000
                AND '&RELEASE(1)' NE '2.6'                             X01670000
                AND '&RELEASE(1)' NE '2608'                            X01680000
                AND '&RELEASE(1)' NE '7703'                            X01690000
                AND '&RELEASE(1)' NE '7705'                            X01700000
                AND '&RELEASE(1)' NE '7706'                            X01710000
                AND '&RELEASE(1)' NE '7707'                            X01720000
                AND '&RELEASE(1)' NE '7708'                            X01730000
                AND '&RELEASE(1)' NE '7709'                            X01740000
                AND '&RELEASE(1)' NE '7720'                            X01750000
                AND '&RELEASE(1)' NE '7730'                            X01760000
                AND '&RELEASE(1)' NE '7740'                            X01770000
                AND '&RELEASE(1)' NE '7750'                            X01780000
                AND '&RELEASE(1)' NE '7760'                            X01790000
                AND '&RELEASE(1)' NE '7770'                            X01800000
                AND '&RELEASE(1)' NE '7780'                            X01810000
                AND '&RELEASE(1)' NE '7790'                            X01820000
                AND '&RELEASE(1)' NE '77A0'                            X01830000
                AND '&RELEASE(1)' NE '77B0'                            X01840000
                AND '&RELEASE(1)' NE 'PLV0001').ERLVL1             @MRC 01850000
         AIF   (NOT  &ICHRAC ).ERR01     IS IT INVOKED BY RACROUTE @M2A 01860000
.ERTN01  ANOP                                                      @M2A 01870000
.SKIP001 ANOP                                                      @M2A 01880000
         AIF   (N'&RELEASE EQ 1).NORLVLC CHECK NOT SPECIFIED       @L7A 01890000
         AIF   ('&RELEASE(2)' NE 'CHECK').ERLVL1 INVALID VALUE     @L7A 01900000
         AIF   ('&MF(1)' NE 'E').ERLVL2 CHECK ONLY WITH MF=E       @L7A 01910000
.ERLVL2R ANOP                                                      @L7A 01920000
.NORLVLC ANOP                                                      @L7A 01930000
.ERLVL1R ANOP                                                      @L7A 01940000
         AIF   ('&RELEASE(1)' EQ '').NORLVL                        @MOA 01950000
.CHECKVER ANOP                                                     @MRA 01960000
         AIF   ('&RELEASE(1)' NE 'PLV0001').CHECKFMID              @MRA 01970003
.PLVER0001 ANOP                                                    @MRA 01980000
&RLVL    SETC  '46   '             Indicate the Parameter List     @MRA 01990000
.*                                 is at the RELEASE=77B0 level    @MRA 02000000
         AGO   .ENDRLVL                                            @MRA 02010000
.CHECKFMID ANOP                                                    @MRA 02020000
.RLVL77B0 ANOP                                                     @MRA 02030000
         AIF   ('&RELEASE(1)' NE '77B0').RLVL77A0                  @MPA 02040000
&RLVL    SETC  '46   '             INDICATE RELEASE=77B0           @MPA 02050000
         AGO   .ENDRLVL                                            @MPA 02060000
.RLVL77A0 ANOP                                                     @MPA 02070000
         AIF   ('&RELEASE(1)' NE '77A0').RLVL7790                  @MOA 02080000
&RLVL    SETC  '45   '             INDICATE RELEASE=77A0           @MOA 02090000
         AGO   .ENDRLVL                                            @MOA 02100000
.RLVL7790 ANOP                                                     @MOA 02110000
         AIF   ('&RELEASE(1)' NE '7790').RLVL7780                  @MOA 02120000
&RLVL    SETC  '44   '             INDICATE RELEASE=7790           @MOA 02130000
         AGO   .ENDRLVL                                            @MOA 02140000
.RLVL7780 ANOP                                                     @MOA 02150000
         AIF   ('&RELEASE(1)' NE '7780').RLVL7770                  @MOA 02160000
&RLVL    SETC  '43   '             INDICATE RELEASE=7780           @MOA 02170000
         AGO   .ENDRLVL                                            @MOA 02180000
.RLVL7770 ANOP                                                     @MOA 02190000
         AIF   ('&RELEASE(1)' NE '7770').RLVL7760                  @MOA 02200000
&RLVL    SETC  '42   '             INDICATE RELEASE=7770           @MOA 02210000
         AGO   .ENDRLVL                                            @MOA 02220000
.RLVL7760 ANOP                                                     @MOA 02230000
         AIF   ('&RELEASE(1)' NE '7760').RLVL7750                  @MOA 02240000
&RLVL    SETC  '41   '             INDICATE RELEASE=7760           @MOA 02250000
         AGO   .ENDRLVL                                            @MOA 02260000
.RLVL7750 ANOP                                                     @MOA 02270000
         AIF   ('&RELEASE(1)' NE '7750').RLVL7740                  @MOA 02280000
&RLVL    SETC  '40   '             INDICATE RELEASE=7750           @MOA 02290000
         AGO   .ENDRLVL                                            @MOA 02300000
.RLVL7740 ANOP                                                     @MOA 02310000
         AIF   ('&RELEASE(1)' NE '7740').RLVL7730                  @MOA 02320000
&RLVL    SETC  '39   '             INDICATE RELEASE=7740           @MOA 02330000
         AGO   .ENDRLVL                                            @MOA 02340000
.RLVL7730 ANOP                                                     @MOA 02350000
         AIF   ('&RELEASE(1)' NE '7730').RLVL7720                  @MOA 02360000
&RLVL    SETC  '38   '             INDICATE RELEASE=7730           @MOA 02370000
         AGO   .ENDRLVL                                            @MOA 02380000
.RLVL7720 ANOP                                                     @MOA 02390000
         AIF   ('&RELEASE(1)' NE '7720').RLVL7709                  @MOA 02400000
&RLVL    SETC  '37   '             INDICATE RELEASE=7720           @MOA 02410000
         AGO   .ENDRLVL                                            @MOA 02420000
.RLVL7709 ANOP                                                     @MOA 02430000
         AIF   ('&RELEASE(1)' NE '7709').RLVL7708                  @MOA 02440000
&RLVL    SETC  '36   '             INDICATE RELEASE=7709           @MOA 02450000
         AGO   .ENDRLVL                                            @MOA 02460000
.RLVL7708 ANOP                                                     @MOA 02470000
         AIF   ('&RELEASE(1)' NE '7708').RLVL7707                  @MOA 02480000
&RLVL    SETC  '35   '             INDICATE RELEASE=7708           @MOA 02490000
         AGO   .ENDRLVL                                            @MOA 02500000
.RLVL7707 ANOP                                                     @MOA 02510000
         AIF   ('&RELEASE(1)' NE '7707').RLVL7706                  @MOA 02520000
&RLVL    SETC  '34   '             INDICATE RELEASE=7707           @MOA 02530000
         AGO   .ENDRLVL                                            @MOA 02540000
.RLVL7706 ANOP                                                     @MOA 02550000
         AIF   ('&RELEASE(1)' NE '7706').RLVL7705                  @MOA 02560000
&RLVL    SETC  '33   '             INDICATE RELEASE=7706           @MOA 02570000
         AGO   .ENDRLVL                                            @MOA 02580000
.RLVL7705 ANOP                                                     @MOA 02590000
         AIF   ('&RELEASE(1)' NE '7705').RLVL7703                  @MOA 02600000
&RLVL    SETC  '32   '             INDICATE RELEASE=7705           @MOA 02610000
         AGO   .ENDRLVL                                            @MOA 02620000
.RLVL7703 ANOP                                                     @MOA 02630000
         AIF   ('&RELEASE(1)' NE '7703').RLVL2608                  @MOA 02640000
&RLVL    SETC  '31   '             INDICATE RELEASE=7703           @MOA 02650000
         AGO   .ENDRLVL                                            @MOA 02660000
.RLVL2608 ANOP                                                     @MOA 02670000
         AIF   ('&RELEASE(1)' NE '2608').RLVL260                   @MOA 02680000
&RLVL    SETC  '30   '             INDICATE RELEASE=2608           @MOA 02690000
         AGO   .ENDRLVL                                            @MOA 02700000
.RLVL260 ANOP                                                      @MOA 02710000
         AIF   ('&RELEASE(1)' NE '2.6').RLVL240                    @MOA 02720000
&RLVL    SETC  '2.6  '             INDICATE RELEASE=2.6            @MOA 02730000
         AGO   .ENDRLVL                                            @MOA 02740000
.RLVL240 ANOP                                                      @MOA 02750000
         AIF   ('&RELEASE(1)' NE '2.4').RLVL230                    @MOA 02760000
&RLVL    SETC  '2.4  '             INDICATE RELEASE=2.4            @MOA 02770000
         AGO   .ENDRLVL                                            @MOA 02780000
.RLVL230 ANOP                                                      @MOA 02790000
         AIF   ('&RELEASE(1)' NE '2.3').RLVL220                    @MOA 02800000
&RLVL    SETC  '2.3  '             INDICATE RELEASE=2.3            @MOA 02810000
         AGO   .ENDRLVL                                            @MOA 02820000
.RLVL220 ANOP                                                      @MOA 02830000
         AIF   ('&RELEASE(1)' NE '2.2').RLVL210                    @MOA 02840000
&RLVL    SETC  '2.2  '             INDICATE RELEASE=2.2            @MOA 02850000
         AGO   .ENDRLVL                                            @MOA 02860000
.RLVL210 ANOP                                                      @MOA 02870000
         AIF   ('&RELEASE(1)' NE '2.1').RLVL192                    @MOA 02880000
&RLVL    SETC  '2.1  '             INDICATE RELEASE=2.1            @MOA 02890000
         AGO   .ENDRLVL                                            @MOA 02900000
.RLVL192 ANOP                                                      @MOA 02910000
         AIF   ('&RELEASE(1)' NE '1.9.2').RLVL190                  @MOA 02920000
&RLVL    SETC  '1.9.2'             INDICATE RELEASE=1.9.2          @MOA 02930000
         AGO   .ENDRLVL                                            @MOA 02940000
.RLVL190 ANOP                                                      @MOA 02950000
         AIF   ('&RELEASE(1)' NE '1.9').RLVL181                    @MOA 02960000
&RLVL    SETC  '1.9  '             INDICATE RELEASE=1.9            @MOA 02970000
         AGO   .ENDRLVL                                            @MOA 02980000
.RLVL181 ANOP                                                      @MOA 02990000
         AIF   ('&RELEASE(1)' NE '1.8.1').RLVL180                  @MOA 03000000
&RLVL    SETC  '1.8.1'             INDICATE RELEASE= 1.8.1         @MOA 03010000
         AGO   .ENDRLVL                                            @MOA 03020000
.RLVL180 ANOP                                                      @MOA 03030000
         AIF   ('&RELEASE(1)' NE '1.8').RLVL17                     @MOA 03040000
&RLVL    SETC  '1.8  '             INDICATE RELEASE=1.8            @MOA 03050000
         AGO   .ENDRLVL                                            @MOA 03060000
.RLVL17  ANOP                                                      @MOA 03070000
         AIF   ('&RELEASE(1)' NE '1.7').RLVL16                     @MOA 03080000
&RLVL    SETC  '1.7  '             INDICATE RELEASE=1.7            @MOA 03090000
         AGO   .ENDRLVL                                            @MOA 03100000
.RLVL16  ANOP                                                      @MOA 03110000
.NORLVL  ANOP                                                      @MOA 03120000
&RLVL    SETC  '1.6  '             INDICATE RELEASE=1.6            @MOA 03130000
.ENDRLVL ANOP                                                      @MOA 03140000
.*                                                                      03150000
.* DETERMINE WHETHER PARMLIST SHOULD CONTAIN COPY & COPYLEN PARMS. @D1A 03160000
.*                                                                      03170000
         AIF   ('&RLVL'(1,3) LT '2.2').SKPGENC          IF < 2.2...@MOC 03180000
         AIF   (NOT &ICHRAC).SKPGENC          ...OR NOT RACROUTE, THEN  03190000
.*                                     COPY/COPYLEN PARMS NOT ALLOWED.  03200000
.*                                     GENERATE OLD LENGTH PLIST.  @D1A 03210000
&GENCOPY SETB  1                       COPY/COPYLEN PARMS ALLOWED. @D1A 03220000
.SKPGENC ANOP                                                      @D1A 03230000
.*                                                                      03240000
.* DETERMINE WHETHER PARMLIST SHOULD CONTAIN NEXT PARAMETER        @MFA 03250000
.*                                                                      03260000
         AIF   ('&RLVL'(1,2) LT '36').SKPNXTC     IF < 7709        @MOC 03270000
         AIF   (NOT &ICHRAC).SKPNXTC          ...or not RACROUTE, then  03280000
.*                                     NEXT parameter not allowed,      03290000
.*                                     generate older length plist @MFA 03300000
&GENNEXT SETB  1                       NEXT parameter allowed      @MFA 03310000
.SKPNXTC ANOP                                                      @MFA 03320000
.*                                                                      03330000
.* VALIDATE MF PARAMETER                                                03340000
.*                                                                      03350000
.CHKMF   ANOP                                                      @MFA 03360000
         AIF   ('&MF' EQ 'S').STAT030                                   03370000
         AIF   ('&MF(1)' EQ 'E').STAT020                                03380000
         AIF   ('&MF' EQ 'L').STAT010                                   03390000
         AIF   (&ICHRAC AND '&MF(1)' EQ 'M').STAT020               @P3A 03400000
         MNOTE 8,'*** INVALID MACRO FORM PARAMETER ***'                 03410000
         AGO   .STAT030                                                 03420000
.STAT010 ANOP                                                           03430000
&MFLIST  SETB  1                                                        03440000
         AGO   .STAT040                                                 03450000
.STAT020 ANOP                                                           03460000
&MFEXEC  SETB  1                                                        03470000
         AGO   .STAT040                                                 03480000
.STAT030 ANOP                                                           03490000
&MFSTAND SETB  1                                                        03500000
.STAT040 ANOP                                                           03510000
.*                                                                      03520000
.* VALIDATE ENTRY PARAMETER                                             03530000
.*                                                                      03540000
         AIF   (NOT &MFSTAND OR                                        +03550000
               '&ENTRY' EQ '' OR                                       +03560000
               '&CLASS' NE '').STAT042                             @D1C 03570000
         MNOTE 4,'*** CLASS PARAMETER OMITTED, ENTRY PARAMETER IGNORED +03580000
               ***'                                                     03590000
&NOENT   SETB  1                                                        03600000
.STAT042 ANOP                                                      @D1A 03610000
.*                                                                      03620000
.* VALIDATE COPY PARAMETER                                         @D1A 03630000
.*                                                                      03640000
         AIF   ('&COPY' NE '' AND NOT &ICHRAC ).ERR10                   03650000
.*                     COPY IS ALLOWED ONLY THROUGH RACROUTE.      @D1A 03660000
.ERTN10  ANOP                                                      @D1A 03670000
.*                                                                      03680000
.* VALIDATE COPYLEN PARAMETER                                      @D1A 03690000
.*                                                                      03700000
         AIF   ('&COPYLEN' NE '' AND NOT &ICHRAC ).ERR20                03710000
.*                  COPYLEN IS ALLOWED ONLY THROUGH RACROUTE.      @D1A 03720000
.ERTN20  ANOP                                                      @D1A 03730000
         AIF   (NOT &MFSTAND OR                                        +03740000
                ('&COPY' EQ '' AND '&COPYLEN' EQ '') OR                +03750000
                ('&CLASS' NE '' OR '&NEXT' NE '')).STAT044         @MFC 03760000
         MNOTE 4,'*** ''CLASS'' AND ''NEXT'' PARAMETERS OMITTED, ''COPY+03770000
               '' AND ''COPYLEN'' PARAMETERS IGNORED ***'          @MFC 03780000
&NOCOPY  SETB  1                                                   @D1A 03790000
.STAT044 ANOP                                                      @D1A 03800000
         AIF   (NOT &MFSTAND OR                                        +03810000
                ('&COPY' NE '' AND '&COPYLEN' NE '')).STAT050      @D1A 03820000
         AIF   ('&COPY' EQ '' AND '&COPYLEN' EQ '').STAT050        @D1A 03830000
         AIF   ('&COPY' NE '' AND '&COPYLEN' EQ '').STAT046        @D1A 03840000
         MNOTE 4,'*** COPY PARAMETER OMITTED, COPYLEN PARAMETER IGNORED+03850000
                ***'                                               @D1A 03860000
         AGO   .STAT048                                            @D1A 03870000
.STAT046 ANOP                                                      @D1A 03880000
         MNOTE 4,'*** COPYLEN PARAMETER OMITTED, COPY PARAMETER IGNORED+03890000
                ***'                                               @D1A 03900000
.STAT048 ANOP                                                      @D1A 03910000
&NOCOPY  SETB  1                                                   @D1A 03920000
.STAT050 ANOP                                                           03930000
.*                                                                      03940000
.* Validate NEXT parameter                                         @MFA 03950000
.*                                                                      03960000
         AIF   ('&NEXT' EQ '').STAT052   No NEXT= specified, skip  @MFA 03970000
         AIF   (NOT &ICHRAC ).ERR21  Allow NEXT only thru RACROUTE @MFA 03980000
.ERTN21  ANOP                                                      @MFA 03990000
         AIF   (NOT &MFSTAND OR                                        +04000000
                '&CLASS' EQ '').STAT051  CLASS omitted? Skip error @MFA 04010000
         AGO   .ERR22       Else MNote for NEXT ignored            @MFA 04020000
.ERTN22  ANOP                                                      @MFA 04030000
         AGO   .SETNNXT     Go set NONEXT bit                      @MFA 04040000
.STAT051 ANOP                                                      @MFA 04050000
.*                                                                      04060000
.*       Make sure user did not specify literal for NEXT=.         @MFA 04070000
.*       CLASS= does allow a literal, but NEXT= does not because   @MFA 04080000
.*       it is an output parm also.  Give user a clear error       @MFA 04090000
.*       message instead of letting assembler generate cryptic     @MFA 04100000
.*       error message.                                            @MFA 04110000
.*                                                                      04120000
         AIF   ('&NEXT'(1,1) NE '''').STAT052  Check for NEXT='xx' @MFA 04130000
         AGO   .ERR23       Else MNote for error in NEXT           @MFA 04140000
.ERTN23  ANOP                                                      @MFA 04150000
.SETNNXT ANOP                                                      @MFA 04160000
&NONEXT  SETB  1      Set bit to ignore NEXT since CLASS specified     +04170000
                      or literal specified                         @MFA 04180000
.STAT052 ANOP                                                      @MFA 04190000
.*                                                                      04200000
.* VALIDATE USAGE OF REGISTERS FOR ADDRESSES                            04210000
.*                                                                      04220000
.* REGISTERS NOT ALLOWED FOR LIST FORM                                  04230000
.*                                                                      04240000
         AIF   (NOT &MFLIST).STAT070                                    04250000
         AIF   ('&CLASS' EQ '').STAT060                                 04260000
         AIF   ('&CLASS'(1,1) NE '(').STAT060                           04270000
         MNOTE 8,'*** REGISTER FORM OF ADDRESS PARAMETER NOT VALID WITH+04280000
                LIST FORM ***'                                          04290000
         AGO   .STAT070                                                 04300000
.STAT060 ANOP                                                           04310000
         AIF   ('&ENTRY' EQ '').STAT065                            @D1C 04320000
         AIF   ('&ENTRY'(1,1) NE '(').STAT065                      @D1C 04330000
         MNOTE 8,'*** REGISTER FORM OF ADDRESS PARAMETER NOT VALID WITH+04340000
                LIST FORM ***'                                          04350000
         AGO   .STAT070                                            @D1A 04360000
.STAT065 ANOP                                                      @D1A 04370000
         AIF   ('&COPY' EQ '').STAT068                             @D1A 04380000
         AIF   ('&COPY'(1,1) NE '(').STAT068                       @D1A 04390000
         MNOTE 8,'*** REGISTER FORM OF ADDRESS PARAMETER NOT VALID WITH+04400000
                LIST FORM ***'                                     @D1A 04410000
         AGO   .STAT070                                            @D1A 04420000
.STAT068 ANOP                                                      @D1A 04430000
         AIF   ('&COPYLEN' EQ '').STAT069                          @MFC 04440000
         AIF   ('&COPYLEN'(1,1) NE '(').STAT069                    @MFC 04450000
         MNOTE 8,'*** REGISTER FORM OF ADDRESS PARAMETER NOT VALID WITH+04460000
                LIST FORM ***'                                     @D1A 04470000
.STAT069 ANOP                                                           04480000
         AIF   ('&NEXT' EQ '').STAT070                             @MFA 04490000
         AIF   ('&NEXT'(1,1) NE '(').STAT070                       @MFA 04500000
         MNOTE 8,'*** REGISTER FORM OF ADDRESS PARAMETER NOT VALID WITH+04510000
                LIST FORM ***'                                     @MFA 04520000
.STAT070 ANOP                                                           04530000
.*                                                                      04540000
.* REGISTERS USED AS ADDRESSES MUST BE REGISTERS 2-12                   04550000
.*                                                                      04560000
         AIF   ('&CLASS' EQ '').STAT080                                 04570000
         AIF   (T'&CLASS(1) NE 'N').STAT080                             04580000
         AIF   ('&CLASS'(1,1) NE '(' OR                                +04590000
               ('&CLASS(1)' GT '1' AND                                 +04600000
               '&CLASS(1)' LT '13')).STAT080                            04610000
         MNOTE 8,'*** ONLY REGISTERS 2-12 VALID FOR ADDRESSES ***'      04620000
         AGO   .STAT090                                                 04630000
.STAT080 ANOP                                                           04640000
         AIF   ('&ENTRY' EQ '').STAT082                            @D1C 04650000
         AIF   (T'&ENTRY(1) NE 'N').STAT082                        @D1C 04660000
         AIF   ('&ENTRY'(1,1) NE '(' OR                                +04670000
               ('&ENTRY(1)' GT '1' AND                                 +04680000
               '&ENTRY(1)' LT '13')).STAT082                       @D1C 04690000
         MNOTE 8,'*** ONLY REGISTERS 2-12 VALID FOR ADDRESSES ***'      04700000
         AGO   .STAT090                                            @D1A 04710000
.STAT082 ANOP                                                      @D1A 04720000
         AIF   ('&COPY' EQ '').STAT084                             @D1A 04730000
         AIF   (T'&COPY(1) NE 'N').STAT084                         @D1A 04740000
         AIF   ('&COPY'(1,1) NE '(' OR                                 +04750000
               ('&COPY(1)' GT '1' AND                                  +04760000
               '&COPY(1)' LT '13')).STAT084                        @D1A 04770000
         MNOTE 8,'*** ONLY REGISTERS 2-12 VALID FOR ADDRESSES ***' @D1A 04780000
         AGO   .STAT090                                            @D1A 04790000
.STAT084 ANOP                                                      @D1A 04800000
         AIF   ('&COPYLEN' EQ '').STAT085                          @MFC 04810000
         AIF   (T'&COPYLEN(1) NE 'N').STAT085                      @MFC 04820000
         AIF   ('&COPYLEN'(1,1) NE '(' OR                              +04830000
               ('&COPYLEN(1)' GT '1' AND                               +04840000
               '&COPYLEN(1)' LT '13')).STAT085                     @MFC 04850000
         MNOTE 8,'*** ONLY REGISTERS 2-12 VALID FOR ADDRESSES ***' @D1A 04860000
         AGO   .STAT090                                            @MFA 04870000
.STAT085 ANOP                                                      @MFA 04880000
         AIF   ('&NEXT' EQ '').STAT090                             @MFA 04890000
         AIF   (T'&NEXT(1) NE 'N').STAT090                         @MFA 04900000
         AIF   ('&NEXT'(1,1) NE '(' OR                                 +04910000
               ('&NEXT(1)' GT '1' AND                                  +04920000
               '&NEXT(1)' LT '13')).STAT090                        @MFA 04930000
         MNOTE 8,'*** ONLY REGISTERS 2-12 VALID FOR ADDRESSES ***' @MFA 04940000
.STAT090 ANOP                                                           04950000
.*                                                                      04960000
.* GENERATE CODE                                                        04970000
.*                                                                      04980000
         AIF   (&MFEXEC).STAT170                                        04990000
         AIF   (&MFLIST).STAT100                                        05000000
         AIF   (&ICHRAC).STAT093                                   @P3A 05010000
         AIF   ('&CLASS' EQ '').STAT160                                 05020000
.STAT093 ANOP                                                      @P3A 05030000
&LABEL   CNOP  0,4                                                      05040000
         AIF   ('&CLASS' EQ '').STAT094                            @P3A 05050000
         AIF   ('&CLASS'(1,1) EQ '''').STAT095                          05060000
         AIF   (&ICHRAC).STAT094                                   @P3A 05070000
         BAL   1,*+12                                                   05080000
         AGO   .STAT110                                                 05090000
.STAT094 ANOP                                                      @P3A 05100000
         AIF   (&GENCOPY).STAT096                                  @D1A 05110000
         BAL   1,*+16                                              @P3A 05120000
         AGO   .STAT110                                            @P3A 05130000
.STAT096 ANOP                                                      @D1A 05140000
         AIF   (&GENNEXT).STAT09A                                  @MFA 05150000
         BAL   1,*+24                BRANCH PAST 5 WORD PARMLIST   @D1A 05160000
         AGO   .STAT110                                            @D1A 05170000
.STAT09A ANOP                                                      @MFA 05180000
         BAL   1,*+28                Branch past 6 word parmlist   @MFA 05190000
         AGO   .STAT110                                            @MFA 05200000
.STAT095 ANOP                                                           05210000
         AIF   (&ICHRAC).STAT097                                   @P3A 05220000
         BAL   1,*+20                                                   05230000
         AGO   .STAT110                                                 05240000
.STAT097 ANOP                                                      @P3A 05250000
         AIF   (&GENCOPY).STAT098                                  @D1A 05260000
         BAL   1,*+24                                              @P3A 05270000
         AGO   .STAT110                                            @P3A 05280000
.STAT098 ANOP                                                      @D1A 05290000
         AIF   (&GENNEXT).STAT099                                  @MFA 05300000
         BAL   1,*+32            BRANCH PAST NEW PLIST + CLASSNAME @D1A 05310000
         AGO   .STAT110                                            @D1A 05320000
.STAT099 ANOP                                                      @MFA 05330000
         BAL   1,*+36      Branch past 6 word parmlist + classname @MFA 05340000
         AGO   .STAT110                                            @MFA 05350000
.STAT100 ANOP                                                           05360000
&LABEL   DS    0F                                                       05370000
.STAT110 ANOP                                                           05380000
         AIF   (NOT  &ICHRAC ).STAT113   IS IT INVOKED BY RACROUTE @P4A 05390000
&ICHL    EQU   *                    SET ADDRESSIBILITY TO RACROUTE @P4A 05400000
.STAT113 ANOP                                                      @P4A 05410000
         AIF   ('&CLASS' EQ '' ).STAT120                                05420000
         AIF   ('&CLASS'(1,1) EQ '(').STAT120                           05430000
         AIF   ('&CLASS'(1,1) EQ '''').STAT115                          05440000
         DC    A(&CLASS)            ADDRESS OF CLASS PARAMETER          05450000
         AGO   .STAT130                                                 05460000
.STAT115 ANOP                                                           05470000
         DC    A(ICH0&SYSNDX)          ADDRESS OF CLASS PARAMETER       05480000
         AGO   .STAT130                                                 05490000
.STAT120 ANOP                                                           05500000
         DC    A(0)                 ADDRESS OF CLASS PARAMETER          05510000
.STAT130 ANOP                                                           05520000
         AIF   ('&ENTRY' EQ '' ).STAT140                                05530000
         AIF   ('&ENTRY'(1,1) EQ '(' OR                                +05540000
               &NOENT).STAT140                                          05550000
         DC    A(&ENTRY)            ADDRESS OF ENTRY PARAMETER          05560000
         AGO   .STAT141                                            @D1C 05570000
.STAT140 ANOP                                                           05580000
         DC    A(0)                 ADDRESS OF ENTRY PARAMETER          05590000
.STAT141 ANOP                                                      @D1C 05600000
         AIF   (NOT &ICHRAC).STAT152                               @P3A 05610000
         AIF   (&GENNEXT).STAT145                                  @MFA 05620000
         AIF   (&GENCOPY).STAT142                                  @D1A 05630000
         DC    H'12'                PARAMETER LENGTH IN BYTES      @P3A 05640000
         AGO   .STAT143                                            @D1A 05650000
.STAT142 ANOP                                                      @D1A 05660000
         DC    H'20'                PARAMETER LENGTH IN BYTES      @D1A 05670000
         AGO   .STAT143                                            @MFA 05680000
.STAT145 ANOP                                                      @MFA 05690000
         DC    H'24'                PARAMETER LENGTH IN BYTES      @MFA 05700000
.STAT143 ANOP                                                      @D1A 05710000
         DC    H'0'                 RESERVED                       @P3A 05720000
.STAT144 ANOP                                                      @D1A 05730000
         AIF   (NOT &GENCOPY).STAT152                              @D1A 05740000
         AIF   ('&COPY' EQ '' ).STAT146                            @D1A 05750000
         AIF   ('&COPY'(1,1) EQ '(' OR                                 +05760000
               &NOCOPY).STAT146                                    @D1A 05770000
         DC    A(&COPY)             ADDRESS OF COPY PARAMETER      @D1A 05780000
         AGO   .STAT148                                            @D1A 05790000
.STAT146 ANOP                                                      @D1A 05800000
         DC    A(0)                 ADDRESS OF COPY PARAMETER      @D1A 05810000
.STAT148 ANOP                                                      @D1A 05820000
         AIF   ('&COPYLEN' EQ '' ).STAT149                         @D1A 05830000
         AIF   ('&COPYLEN'(1,1) EQ '(' OR                              +05840000
               &NOCOPY).STAT149                                    @D1A 05850000
         DC    A(&COPYLEN)          COPYLEN PARAMETER              @P6C 05860000
         AGO   .STAT150                                            @MFC 05870000
.STAT149 ANOP                                                      @D1A 05880000
         DC    A(0)                 COPYLEN PARAMETER              @P6C 05890000
.STAT150 ANOP                                                      @MFA 05900000
         AIF   (NOT &GENNEXT).STAT152                              @MFA 05910000
         AIF   ('&NEXT' EQ '' ).STAT151                            @MFA 05920000
         AIF   ('&NEXT'(1,1) EQ '(' OR                                 +05930000
               &NONEXT).STAT151                                    @MFA 05940000
         DC    A(&NEXT)             Address of NEXT parameter      @MFA 05950000
         AGO   .STAT152                                            @MFA 05960000
.STAT151 ANOP                                                      @MFA 05970000
         DC    A(0)                 NEXT parameter set to zero     @MFA 05980000
.STAT152 ANOP                                                      @P3A 05990000
         AIF   ('&CLASS' EQ '').STAT155                                 06000000
         AIF   ('&CLASS'(1,1) NE '''').STAT155                          06010000
ICH0&SYSNDX DC    CL8&CLASS         CLASS NAME                          06020000
.STAT155 ANOP                                                           06030000
         AIF   (&MFSTAND).STAT180                                       06040000
         MEXIT                                                          06050000
.STAT160 ANOP                                                           06060000
         AIF   ('&LABEL' EQ '').STAT220                                 06070000
&LABEL   DS    0H                                                       06080000
         AGO   .STAT220                                                 06090000
.STAT170 ANOP                                                           06100000
&LABEL   IHBINNRA &MF(2)                                                06110000
         AIF   (NOT &ICHRAC).STAT180                            @P2A    06120000
         A     1,36(1)                                          @P2A    06130000
.STAT180 ANOP                                                           06140000
         AIF   ('&CLASS' EQ '').STAT200                                 06150000
         AIF   ('&CLASS'(1,1) EQ '(').STAT190                           06160000
         AIF   (&MFSTAND).STAT200                                       06170000
         LA    0,&CLASS                                                 06180000
         ST    0,0(1)               SET CLASS PARAMETER ADDRESS         06190000
         AGO   .STAT200                                                 06200000
.STAT190 ANOP                                                           06210000
         ST    &CLASS(1),0(1)       SET CLASS PARAMETER ADDRESS         06220000
.STAT200 ANOP                                                           06230000
         AIF   ('&ENTRY' EQ '' OR                                      +06240000
               &NOENT).STAT212                                     @D1C 06250000
         AIF   ('&ENTRY'(1,1) EQ '(').STAT210                           06260000
         AIF   (&MFSTAND).STAT212                                  @D1C 06270000
         LA    0,&ENTRY                                                 06280000
         ST    0,4(1)               SET ENTRY PARAMETER ADDRESS         06290000
         AGO   .STAT212                                            @D1C 06300000
.STAT210 ANOP                                                           06310000
         ST    &ENTRY(1),4(1)       SET ENTRY PARAMETER ADDRESS         06320000
.STAT212 ANOP                                                      @D1A 06330000
         AIF   (NOT &GENCOPY).STAT220                              @D1A 06340000
         AIF   ('&COPY' EQ '' OR                                       +06350000
               &NOCOPY).STAT216                                    @D1A 06360000
         AIF   ('&COPY'(1,1) EQ '(').STAT214                       @D1A 06370000
         AIF   (&MFSTAND).STAT216                                  @D1A 06380000
         LA    0,&COPY                                             @D1A 06390000
         ST    0,12(1)              SET COPY PARAMETER ADDRESS     @D1A 06400000
         AGO   .STAT216                                            @D1A 06410000
.STAT214 ANOP                                                      @D1A 06420000
         ST    &COPY(1),12(1)       SET COPY PARAMETER ADDRESS     @D1A 06430000
.STAT216 ANOP                                                      @D1A 06440000
         AIF   ('&COPYLEN' EQ '' OR                                    +06450000
               &NOCOPY).STAT220                                    @D1A 06460000
         AIF   ('&COPYLEN'(1,1) EQ '(').STAT218                    @D1A 06470000
         AIF   (&MFSTAND).STAT220                                  @D1A 06480000
         LA    0,&COPYLEN                                          @D1A 06490000
         ST    0,16(1)              SET COPYLEN VALUE              @P6C 06500000
         AGO   .STAT220                                            @D1A 06510000
.STAT218 ANOP                                                      @D1A 06520000
         ST    &COPYLEN(1),16(1)    SET COPYLEN VALUE              @P6C 06530000
.STAT220 ANOP                                                           06540000
         AIF   (NOT &GENNEXT).STAT222                              @MFA 06550000
         AIF   ('&NEXT' EQ '' OR                                       +06560000
               &NONEXT).STAT222     Leave Next address zero        @MFA 06570000
         AIF   ('&NEXT'(1,1) EQ '(').STAT221                       @MFA 06580000
         AIF   (&MFSTAND).STAT222                                  @MFA 06590000
         LA    0,&NEXT                                             @MFA 06600000
         ST    0,20(1)              SET NEXT PARAMETER ADDRESS     @MFA 06610000
         AGO   .STAT222                                            @MFA 06620000
.STAT221 ANOP                                                      @MFA 06630000
         ST    &NEXT(1),20(1)       SET NEXT PARAMETER ADDRESS     @MFA 06640000
.STAT222 ANOP                                                      @MFA 06650000
         AIF   (&ICHRAC).STAT240    NO CODE WHEN FROM RACROUTE     @P3A 06660000
         L     15,16(0,0)           ADDRESS OF CVT                      06670000
         L     15,X'03E0'(0,15)     ADDRESS OF RCVT                     06680000
         LTR   15,15                DOES RACF CVT EXIST                 06690000
         BZ    *+12                 NO, GO TO NON-EXISTENT R. C.        06700000
         CLI   X'AC'(15),X'02'      IS VERSION OF RACF CORRECT          06710000
         BNL   *+12                 YES, CONTINUE STATUS CHECK          06720000
         LA    15,24(0,0)           RACF CVT NON-EXISTENT RETURN CODE   06730000
         AIF   (&MFSTAND AND                                           +06740000
               '&CLASS' EQ '').STAT230                                  06750000
         B     *+10                 END STATUS CHECK                    06760000
         L     15,X'C0'(0,15)       ADDRESS OF STATUS ROUTINE           06770000
         BALR  14,15                CALL STATUS ROUTINE                 06780000
         AGO   .STAT240                                                 06790000
.STAT230 ANOP                                                           06800000
         B     *+32                 END STATUS CHECK                    06810000
         TM    X'35'(15),X'80'      WAS RACF IPLED ACTIVE               06820000
         BO    *+12                 NO, GO TO INACTIVE RETURN CODE      06830000
         TM    X'99'(15),X'80'      IS RACF CURRENTLY ACTIVE            06840000
         BNO   *+12                 YES, GO TO ACTIVE RETURN CODE       06850000
         LA    15,12(0,0)           RACF INACTIVE                       06860000
         B     *+8                  SKIP ACTIVE RETURN CODE             06870000
         LA    15,0(0,0)            RACF ACTIVE                         06880000
.STAT240 ANOP                                                           06890000
         MEXIT                                                          06900000
.*                                                                 @L7A 06910000
.* ERROR MESSAGES                                                  @L7A 06920000
.*                                                                 @L7A 06930000
.ERLVL1  MNOTE 8,'*** INCORRECT SPECIFICATION OF ''RELEASE'' ***'  @L7A 06940000
         AGO   .ERLVL1R                                            @L7A 06950000
.ERLVL2  MNOTE 4,'*** ''RELEASE-CHECK'' ONLY VALID WITH ''MF=E'' ***'  X06960000
                                                                   @L7A 06970000
         AGO   .ERLVL2R                                            @L7A 06980000
.ERR01   ANOP                                                      @M2A 06990000
         MNOTE 8,'*** RACSTAT HAS TO BE INVOKED VIA RACROUTE FOR RELEASX07000000
               E 1.9 AND LATER ***'                                @M2A 07010000
         AGO   .ERTN01                                             @M2A 07020000
.ERR10   ANOP                                                      @D1A 07030000
         MNOTE 8,'*** ''COPY'' ALLOWED ONLY IF RACSTAT IS INVOKED FROM X07040000
               THE RACROUTE MACRO ***'                             @D1A 07050000
         AGO   .ERTN10                                             @D1A 07060000
.ERR20   ANOP                                                      @D1A 07070000
         MNOTE 8,'*** ''COPYLEN'' ALLOWED ONLY IF RACSTAT IS INVOKED FRX07080000
               OM THE RACROUTE MACRO ***'                          @D1A 07090000
         AGO   .ERTN20                                             @D1A 07100000
.ERR21   ANOP                                                      @MFA 07110000
         MNOTE 8,'*** ''NEXT'' ALLOWED ONLY IF RACSTAT IS INVOKED FROM X07120000
               THE RACROUTE MACRO ***'                             @MFA 07130000
         AGO   .ERTN21                                             @MFA 07140000
.ERR22   ANOP                                                      @MFA 07150000
         MNOTE 4,'*** ''CLASS'' PARAMETER SPECIFIED, ''NEXT'' PARAMETER+07160000
                IGNORED ***'                                       @MFA 07170000
         AGO   .ERTN22                                             @MFA 07180000
.ERR23   ANOP                                                      @MFA 07190000
         MNOTE 4,'*** ''NEXT'' PARAMETER IGNORED.  LITERAL IS NOT ALLOW+07200000
               ED ***'                                             @MFA 07210000
         AGO   .ERTN23                                             @MFA 07220000
         MEND                                                           07230000
                                                                        07240000
