*********START OF SPECIFICATIONS*************************************** 00010000
*                                                                    *  00020000
*  $MAC(RACXTRT) COMP(SC1BN) PROD(RACF):                             *  00030000
*                                                                    *  00040000
*  DESCRIPTIVE NAME:                                                 *  00050000
*    INTERFACE TO RACF EXTRACT FUNCTION                          @M2C*  00060000
*                                                                    *  00070000
* *01* PROPRIETARY STATEMENT=                                         * 00080000
*  **PROPRIETARY_STATEMENT********************************************* 00090000
*                                                                     * 00100000
*                                                                     * 00110000
*   Licensed Materials - Property of IBM                              * 00120000
*   5650-ZOS Copyright IBM Corp. 1977, 2019                           * 00130000
*                                                                     * 00140000
*   STATUS= HBB77C0                                                   * 00150000
*                                                                     * 00160000
*  **END_OF_PROPRIETARY_STATEMENT************************************** 00170000
*                                                                    *  00180000
*01* EXTERNAL CLASSIFICATION:                                        *  00190000
*02* GUPI:                                                           *  00200000
*01* END OF EXTERNAL CLASSIFICATION  :                               *  00210000
*                                                                    *  00220000
*                                                                       00230000
*  FUNCTION:                                                            00240000
*    THE RACXTRT MACRO PROVIDES A STANDARD INTERFACE TO                 00250000
*    THE RACF EXTRACT ROUTINE                                           00260000
*    (MODULE NAME - IRRRXT00)                                      @M2C 00270000
*                                                                       00280000
*  INVOCATION:                                                          00290000
*    THE RACF EXTRACT ROUTINE IS INVOKED BY THE RACXTRT                 00300000
*    MACRO VIA SVC 132.                                            @M2C 00310000
*                                                                       00320000
*    REQUIREMENTS FOR USE - 1) USER MUST BE AUTHORIZED                  00330000
*                                                                       00340000
*  MODULE TYPE = MACRO                                                  00350000
*                                                                       00360000
*  CHANGE ACTIVITY:                                                     00370000
*    $L0=HRF1602,RACF/160,830620,CNTDSD:                                00380000
*    UZ90283                                                   @ZA90283 00390000
*    UZ90284                                                   @ZA90284 00400000
*    UZ90285                                                   @ZA90285 00410000
*    $L7=HRF1702,RACF/170,841205,CNTDSD:                           @L7A 00420000
*    OZ93034                                                   @ZA93034 00430000
*    OZ94352                                                   @ZA94352 00440000
*    OY08189                                                   @YA06719 00450000
*    $L8=HRF1802,RACF/180,860820,CNTDSD:                           @L8A 00460000
*    $P1=JRF1812,RACF/181,870902,CNTDSD: PFG0030                   @P1A 00470000
*    OY11600                                                   @YA11600 00480000
*    $M1= SP313   RACF/190 880615 PDPWB1: MVS/SP 3.1.3             @M1A 00490000
*    $P2= PGU0028 RACF/190 880803 PDPWB1: PGU0028,PGU0029,PGU0030 @P2A  00500000
*    OY13874 -$M1 INCORPORATES ONE LINE APAR CHANGE            @YA13874 00510000
*    $M2= VMSFS   RACF/190 881104 PDB_S1: SHARED FILE SYSTEM       @M2A 00520000
*    OY16140 THIS PROBLEM HAS BEEN FIXED IN 1.9 WITH M2 FLAG   @YA16140 00530000
*    $P3= PGP0489 RACF/190 890719 PDPWB1: PGP0489                  @P3A 00540000
*    $P4= PGP0409 RACF/190 890815 PDB_S1: PGP0409                  @P4A 00550000
*    $P5= PGP0611 RACF/190 890920 PDB_S1: PTM PGP0611              @P5A 00560000
*    $P6= PGP0615 RACF/190 890920 PDPWB1: PGP0615                  @P6A 00570000
*    $M3= RELID   RACF/192 900904 PDAHW1: SUPPORT FOR RACF 1.9.2   @M3A 00580000
*    $P7= PJA0029 RACF/192 910524 PDPSB1: PJA0029                  @P7A 00590000
*    $M4= OW04015 RACF/210 930427 PDKAF1: SUPPORT FOR RACF 2.1     @M4A 00600000
*    $M5= OW10709 RACF/220 940510 PDJMV1: SUPPORT FOR RACF 2.2     @M5A 00610000
*    $M6= RELID   RACF/230 960422 PDJMV1: SUPPORT FOR RACF 2.3     @M6A 00620000
*    $P8= PQC1932 RACF/230 960722 PDJMV1: PTM PQC1932 RACF 2.3     @P8C 00630000
*    $M7= RELID   RACF/240 960904 PDJMV1: SUPPORT FOR RACF 2.4     @M7A 00640000
*    $M8= BOSSTA  HBB6605  970627 PDMKL1: TRANSPORTABLE ACEES      @M8A 00650000
*    $01= OW24641 HBB6605  970831 PDAWC1: OW24641                  @01A 00660000
*    $M9= RELID   HRF2608  980624 PDRDS2: SUPPORT FOR HRF2608      @M9A 00670000
*    $MA= RELID  RACF/7703 990415 PDRDS2: SUPPORT FOR   HRF7703    @MAA 00680000
*    $MB= RELID   HRF7705  000405 PDIFS2: SUPPORT FOR   HRF7705    @MBA 00690000
*    $MC= RELID   HRF7706  010430 PDRDC1: SUPPORT FOR   HRF7706    @MCA 00700000
*    $MD= RELID   HRF7707  020109 PDMSF1: SUPPORT FOR   HRF7707    @MDA 00710000
*    $ME= MLS2    HRF7708  020204 PDER1:  MLS support              @MEA 00720000
*    $MF= RELID   HRF7708  020221 PDMSF1: SUPPORT FOR   HRF7708    @MFA 00730000
*    $MG= RELID   HRF7709  030430 PDMSD1: SUPPORT FOR   HRF7709    @MGA 00740000
*    $MH= RELID   HRF7720  040224 PDRIV1: Support SAF FMID HBB7720 @MHA 00750000
*    $MI= RELID   HRF7730  050531 PDRIV1: Support SAF FMID HBB7730 @MIA 00760000
*    $MJ= RELID   HRF7740  060330 PDRIV1: Support SAF FMID HBB7740 @MJA 00770000
*    $MK= RELID   HRF7750  070302 PDRIV1: Support SAF FMID HBB7750 @MKA 00780000
*    $ML= RELID   HRF7760  080522 PDJLW1: Support SAF FMID HBB7760 @MLA 00790000
*    $MM= RELID   HRF7770  090511 PDJLW1: Support SAF FMID HBB7770 @MMA 00800000
*    $MN= RELID   HRF7780  100513 PDJLW1: Support SAF FMID HBB7780 @MNA 00810000
*    $MO= RELID   HRF7790  110117 PDJLW1: Support SAF FMID HBB7790 @MOA 00820000
*    $MP= RELID   HRF77A0  130117 PDAWS1: Support SAF FMID HBB77A0 @MPA 00830000
*    $MQ= RELID   HRF77B0  150508 PDPGP1: Support SAF FMID HBB77B0 @MQA 00840000
*    $MR= RELID   HBB77C0  180530 PDGTM1: ParmList Version Support @MRA 00850003
*                                                                       00860000
*                                                                       00870001
*                                                                       00880000
*                                                                       00890000
*  CHANGE DESCRIPTIONS:                                                 00900000
*   A - ADD SUPPORT FOR BRANCH ENTRY EXTRACT                       @M1A 00910000
*   A - FLAG BRANCH AND RELEASE AS INVALID WHEN RELEASE < 1.9      @P2A 00920000
*       INITIALIZE BITS BEFORE SETTING FLAG BYTE ON MF=L           @P2A 00930000
*       ISSUE CORRECT MNOTE FOR INVALID MATCHGN VALUE              @P2A 00940000
*   A - SHARED FILE SYSTEM-LONG NAMES, SUPPORT FOR KEYWORD ENTITYX @M2A 00950000
*   A - INDICATE ENTITYX SPECIFIED WHEN BRANCH NOT SPECIFIED       @P3A 00960000
*   A - SUPPORT THAT THE PARAMETER FIELDS IS SPECIFIED WITH        @P4A 00970000
*       SEGDATA IN THE STANDARD MACRO FORM.                        @P4A 00980000
*   C - '&RELEASE' TO '&RELEASE'(1,3) FOR LOGICAL COMPARISON       @P5A 00990000
*       WITH '1.9'                                                 @P5A 01000000
*   A - DO NOT RESET BRANCH BIT OF BRANCH NOT CODED                @P6A 01010000
*   A - ALLOW RACF RELEASE 1.9.2 TO BE SPECIFIED                   @M3A 01020000
*   C - STATUS TO CORRECTLY CORRESPOND TO MVS LEVEL                @P7A 01030000
*   A - ALLOW RACF RELEASE 2.1 TO BE SPECIFIED                     @M4A 01040000
*   A - ALLOW RACF RELEASE 2.2 TO BE SPECIFIED                     @M5A 01050000
*   A - ALLOW RACF RELEASE 2.3 TO BE SPECIFIED                     @M6A 01060000
*   C - CHANGE PROGRAM NUMBER IN COPYRIGHT STATEMENT               @P8C 01070000
*   A - ALLOW RACF RELEASE 2.4 TO BE SPECIFIED                     @M7A 01080000
*   A - ALLOW RACF RELEASE 2.6 TO BE SPECIFIED AND                 @M8A 01090000
*       ALLOW TYPE=ENVRXTR AND ENVROUT KEYWORD TO BE SPECIFIED     @M8A 01100000
*   A - Add DATEFMT keyword for YR2000 support                     @01A 01110000
*   A - ALLOW RACF RELEASE 2608 TO BE SPECIFIED                    @M9A 01120000
*   A - ALLOW RACF RELEASE 7703 TO BE SPECIFIED                    @MAA 01130000
*   A - ALLOW RACF RELEASE 7705 TO BE SPECIFIED                    @MBA 01140000
*   A - ALLOW RACF RELEASE 7706 TO BE SPECIFIED                    @MCA 01150000
*   A - ALLOW RACF RELEASE 7707 TO BE SPECIFIED                    @MDA 01160000
*   A - ALLOW TYPE=EXTRACTN with BRANCH=YES                        @MEA 01170000
*   A - ALLOW RACF RELEASE 7708 TO BE SPECIFIED                    @MFA 01180000
*   A - ALLOW RACF RELEASE 7709 TO BE SPECIFIED                    @MGA 01190000
*   A - Add support for SAF Release FMID HBB7720                   @MHA 01200000
*   A - Add support for SAF Release FMID HBB7730                   @MIA 01210000
*   A - Add support for SAF Release FMID HBB7740                   @MJA 01220000
*   A - Add support for SAF Release FMID HBB7750                   @MKA 01230000
*   A - Add support for SAF Release FMID HBB7760                   @MLA 01240000
*   A - Add support for SAF Release FMID HBB7770                   @MMA 01250000
*   A - Add support for SAF Release FMID HBB7780                   @MNA 01260000
*   A - Add support for SAF Release FMID HBB7790                   @MOA 01270000
*   A - Add support for SAF Release FMID HBB77A0                   @MPA 01280000
*   A - Add support for SAF Release FMID HBB77B0                   @MQA 01290000
*   A - Support for Parameter List Version                              01300000
*       - Specify the parameter list version instead of                 01310000
*         the last 4 characters of the FMID by specifying               01320000
*         RELEASE=PLV0001                                          @MRA 01330000
*                                                                       01340001
*                                                                       01350000
*                                                                       01360000
*                                                                       01370000
*********END OF SPECIFICATIONS***************************************** 01380000
         MACRO                                                          01390000
&NAME    RACXTRT &ACEE=,                                               *01400000
               &ENCRYPT=,                                              *01410000
               &ENTITY=,                                               *01420000
               &ENTITYX=,                                          @M2A*01430000
               &ENVROUT=,                                          @M8A*01440000
               &FIELDS=,                                               *01450000
               &SUBPOOL=,                                              *01460000
               &TYPE=,                                                 *01470000
               &RELEASE=,                                              *01480000
               &CLASS=,                                            @L8A*01490000
               &SEGMENT=,                                          @L8A*01500000
               &SEGDATA=,                                          @L8A*01510000
               &VOLSER=,                                           @L8A*01520000
               &GENERIC=,                                          @L8A*01530000
               &DERIVE=,                                           @P1A*01540000
               &FLDACC=,                                           @L8A*01550000
               &BRANCH=,                                           @M1A*01560000
               &MATCHGN=,                                          @M1A*01570000
               &DATEFMT=,                                          @01A*01580000
               &MF=S                                                    01590000
.*  DEFINE LOCAL VARIABLES                                              01600000
         LCLA  &FN                 USED TO CONTAIN NUMERIC VALUE        01610000
.*                                 FOR FUNCTION                         01620000
         LCLA  &VERS               USED TO CONTAIN VERSION NUMBER  @L8A 01630000
.*                                 TESTS THAT LIST AND EXECUTE FORMS    01640000
.*                                 HAVE SAME RELEASE NUMBER.            01650000
         LCLA  &ENC                USED TO CONTAIN ADDRESS OF DATA      01660000
.*                                 TO BE ENCRYPTED                      01670000
         LCLA  &DFLTSP             USED TO SET DEFAULT SUBPOOL          01680000
.*                                 WHEN ENTERED AS A STRING             01690000
         LCLC  &SEG000             SEGMENT NAME (ADDRS OR CONST)   @L8A 01700000
         LCLC  &CLS000             SEGMENT NAME (ADDRS OR CONST)   @L8A 01710000
         LCLA  &GENFLG             GENERIC PROCESSING FLAG         @L8A 01720000
         LCLA  &DRVFLG             DFP PROCESSING FLAG             @L8A 01730000
         LCLA  &FLDACF             FLDACC PROCESSING FLAG          @L8A 01740000
         LCLA  &DAT0,&DAT1,&DAT2,&DAT3,&DAT4,&DAT5,&DAT6,&DAT7     @01A 01750000
         LCLA  &BIT0,&BIT1,&BIT2,&BIT3,&BIT4,&BIT5,&BIT6,&BIT7     @L8A 01760000
         LCLA  &BITA0,&BITA1,&BITA2,&BITA3                              01770000
         LCLA  &BITA4,&BITA5,&BITA6,&BITA7                              01780000
         LCLA  &DATA0,&DATA1,&DATA2,&DATA3                         @01A 01790000
         LCLA  &DATA4,&DATA5,&DATA6,&DATA7                         @01A 01800000
         LCLB  &RLVLCHK            USED TO CONTROL RELEASE-CHECK   @L7A 01810000
         LCLC  &METH               USED TO CONTAIN ENCRYPTION METHOD    01820000
         LCLC  &SP                 USED TO CONTAIN SUBPOOL VALUE        01830000
         LCLC  &NX                 USED TO CONTAIN SYSNDX FOR LABELS    01840000
         LCLB  &YCOPENT            0 => ENTITY IS SPECIFIED        @M2A 01850000
.*                                 1 => ENTITYX IS SPECIFIED       @M2A 01860000
         LCLC  &CMENTY             COMMON ENTITY VARIABLE          @M2A 01870000
         LCLC  &RLVL               RELEASE LEVEL CHARACTER STRING  @MPA 01880000
.*                                                                 @M2A 01890000
.*  DEFINE GLOBAL VARIABLES                                             01900000
         GBLC  &ICHL               USED FOR ADDRESS OF EXTRACT PARM     01910000
         GBLA  &ICHCT              ICHCT - A COUNTER USED TO KEEP       01920000
.*                                 TRACK OF WHERE IN THE PARAMETER      01930000
.*                                 LIST THE PARAMETER IS TO BE          01940000
.*                                 PLACED. ICHCT IS INITIALIZED TO      01950000
.*                                 THE FIRST FULLWORD IN THE LIST       01960000
.*                                 TO BE FILLED IN BY ICHMM,            01970000
.*                                 AND INCREMENTED BY THE INNER         01980000
.*                                 MACRO (ICHMM).                       01990000
         GBLB  &ICHRAC             ICHRAC - A FLAG WHICH IS             02000000
.*                                 INITIALIZED IN THE RACROUTE MACRO    02010000
.*                                 TO COMMUNICATE TO RACXTRT THAT IT    02020000
.*                                 IS BEING INVOKED AS AN INNER MACRO   02030000
.*                                 TO THE RACROUTE MACRO.               02040000
         GBLB  &ICHLIST            ICHLIST - A FLAG WHICH IS SET TO     02050000
.*                                 INDICATE THE FORMAT OF THE MACRO.    02060000
.*                                 FOR LIST FORMAT, ICHLIST IS ON       02070000
.*                                 FOR EXECUTE FORMAT, ICHLIST IS       02080000
.*                                 OFF. FOR STANDARD FORMAT, THERE      02090000
.*                                 ARE TWO PASSES DONE BY THE MACRO     02100000
.*                                 A LIST PASS AND AN EXECUTE PASS.     02110000
.*                                 INITIALLY, FOR STANDARD, THE         02120000
.*                                 FLAG  IS ON - FOR THE LIST PASS.     02130000
.*                                 IT IS THEN TURNED OFF FOR THE        02140000
.*                                 EXECUTE PASS.                        02150000
         GBLB  &ICHNTFY            ICHNTFY - A GLOBAL INDICATOR         02160000
.*                                 WHICH IS USED TO COMMUNICATE WITH    02170000
.*                                 ICHMM - THE INNER MACRO. IF ICHNTFY  02180000
.*                                 IS ON, THE INNER MACRO WILL NOT      02190000
.*                                 ISSUE ITS OWN MNOTE IF IT FINDS AN   02200000
.*                                 ERROR-IT WILL MERELY TURN ON THE     02210000
.*                                 ICHINER FLAG AS NOTIFICATION TO THE  02220000
.*                                 OUTER MACRO, WHICH WILL TAKE THE     02230000
.*                                 APPROPRIATE ACTION.                  02240000
.*                                 IF ICHNTFY IS OFF, THE INNER MACRO   02250000
.*                                 WILL TAKE ACTION ON ITS OWN,         02260000
.*                                 IE. ISSUE AN MNOTE WITH A SEVERITY   02270000
.*                                 CODE OF ITS CHOOSING.                02280000
         GBLB  &ICHINER            ICHINER - A GLOBAL INDICATOR         02290000
.*                                 WHICH IS USED BY ICHMM - AN INNER    02300000
.*                                 MACRO - TO TELL THE OUTER MACRO IF   02310000
.*                                 AN ERROR HAS BEEN DETECTED IN A      02320000
.*                                 PARAMETER.  IF ICHINER IS ON, AN     02330000
.*                                 ERROR HAS BEEN DETECTED.             02340000
         GBLC  &ICHMF              ICHMF - AN INDICATOR OF THE          02350000
.*                                 FORMAT - L, E, S OR M           @M1C 02360000
         GBLC  &ICHRLVL            SYMBOL TO BRANCH TO             @L7A 02370000
.*                                 WHEN INCOMPATIBLE MACRO LEVEL.  @L7A 02380000
.* VALIDATE RELEASE PARAMETER                                      @L7A 02390000
         AIF   (&ICHRAC).RLVL01                                    @L7A 02400000
&ICHRLVL SETC  'ICH&SYSNDX.X'      CREATE LABEL FOR SVC BYPASS     @L7A 02410000
.RLVL01  ANOP                                                      @L7A 02420000
&VERS    SETA  0                   DEFAULT VERSION NUMBER          @L8A 02430000
&YCOPENT SETB  0                   ASSUME THAT THE ENTITY IS       @M2A 02440000
&CMENTY  SETC  '&ENTITY'           SPECIFIED.                      @M2A 02450000
.*                                                                 @M2A 02460000
.* VALIDATE THE RELEASE PARAMETER                                  @M2A 02470000
.*                                                                 @M2A 02480000
         AIF   (N'&RELEASE GT 2).ERLVL1  INVALID RELEASE PARAMETER @L7A 02490000
         AIF   ('&RELEASE(1)' EQ '').VLIDREL                       @M2A 02500000
         AIF   ('&RELEASE(1)' EQ '1.6').VLIDREL                    @M2A 02510000
         AIF   ('&RELEASE(1)' EQ '1.7').VLIDREL                    @M2A 02520000
         AIF   ('&RELEASE(1)' EQ '1.8').VLIDREL                    @M2A 02530000
         AIF   ('&RELEASE(1)' EQ '1.8.1').VLIDREL                  @M2A 02540000
         AIF   ('&RELEASE(1)' EQ '1.9').VLIDREL                    @M2A 02550000
         AIF   ('&RELEASE(1)' EQ '1.9.2').VLIDREL                  @M3A 02560000
         AIF   ('&RELEASE(1)' EQ '2.1').VLIDREL                    @M4A 02570000
         AIF   ('&RELEASE(1)' EQ '2.2').VLIDREL                    @M5A 02580000
         AIF   ('&RELEASE(1)' EQ '2.3').VLIDREL                    @M6A 02590000
         AIF   ('&RELEASE(1)' EQ '2.4').VLIDREL                    @M7A 02600000
         AIF   ('&RELEASE(1)' EQ '2.6').VLIDREL                    @M8A 02610000
         AIF   ('&RELEASE(1)' EQ '2608').VLIDREL                   @M9A 02620000
         AIF   ('&RELEASE(1)' EQ '7703').VLIDREL                   @MAA 02630000
         AIF   ('&RELEASE(1)' EQ '7705').VLIDREL                   @MBA 02640000
         AIF   ('&RELEASE(1)' EQ '7706').VLIDREL                   @MCA 02650000
         AIF   ('&RELEASE(1)' EQ '7707').VLIDREL                   @MDA 02660000
         AIF   ('&RELEASE(1)' EQ '7708').VLIDREL                   @MFA 02670000
         AIF   ('&RELEASE(1)' EQ '7709').VLIDREL                   @MGA 02680000
         AIF   ('&RELEASE(1)' EQ '7720').VLIDREL                   @MHA 02690000
         AIF   ('&RELEASE(1)' EQ '7730').VLIDREL                   @MIA 02700000
         AIF   ('&RELEASE(1)' EQ '7740').VLIDREL                   @MJA 02710000
         AIF   ('&RELEASE(1)' EQ '7750').VLIDREL                   @MKA 02720000
         AIF   ('&RELEASE(1)' EQ '7760').VLIDREL                   @MLA 02730000
         AIF   ('&RELEASE(1)' EQ '7770').VLIDREL                   @MMA 02740000
         AIF   ('&RELEASE(1)' EQ '7780').VLIDREL                   @MNA 02750000
         AIF   ('&RELEASE(1)' EQ '7790').VLIDREL                   @MOA 02760000
         AIF   ('&RELEASE(1)' EQ '77A0').VLIDREL                   @MPA 02770000
         AIF   ('&RELEASE(1)' EQ '77B0').VLIDREL                   @MQA 02780000
         AIF   ('&RELEASE(1)' EQ 'PLV0001').VLIDREL                @MRA 02790005
         AGO   .ERLVL1                                             @M2A 02800000
.VLIDREL ANOP                                                      @M2A 02810000
.*                                                                 @M2A 02820000
.* IF SECOND OPERAND IS SPECIFIED TEST THAT IT IS "CHECK" AND THE  @M2A 02830000
.* THE MACRO FORMAT IS 'E'                                         @M2A 02840000
.*                                                                 @M2A 02850000
         AIF   (N'&RELEASE LE 1).NORLVLC     CHECK NOT SPECIFIED   @L7A 02860000
         AIF   ('&RELEASE(2)' NE 'CHECK').ERLVL1   INVALID VALUE   @L7A 02870000
         AIF   ('&MF(1)' NE 'E').ERLVL2     CHECK ONLY WITH MF=E   @L7A 02880000
&RLVLCHK SETB  1                          ACTIVATE RELEASE-CHECK   @L7A 02890000
.ERLVL2R ANOP                                                      @L7A 02900000
.NORLVLC ANOP                                                      @L7A 02910000
         AIF   ('&RELEASE(1)' EQ '').NORLVL                        @MPA 02920000
.CHECKVER ANOP                                                     @MRA 02930000
         AIF   ('&RELEASE(1)' NE 'PLV0001').CHECKFMID              @MRA 02940006
.PLVER0001 ANOP                                                    @MRA 02950000
&RLVL    SETC  '46   '         Indicate the Parameter List         @MRA 02960000
.*                             is at the RELEASE=77B0 level        @MRA 02970000
         AGO   .ENDRLVL                                            @MRA 02980002
.CHECKFMID ANOP                                                    @MRA 02990000
.RLVL77B0 ANOP                                                     @MRA 03000000
         AIF   ('&RELEASE(1)' NE '77B0').RLVL77A0                  @MQA 03010000
&RLVL    SETC  '46   '             INDICATE RELEASE=77B0           @MQA 03020000
         AGO   .ENDRLVL                                            @MQA 03030000
.RLVL77A0 ANOP                                                     @MQA 03040000
         AIF   ('&RELEASE(1)' NE '77A0').RLVL7790                  @MPA 03050000
&RLVL    SETC  '45   '             INDICATE RELEASE=77A0           @MPA 03060000
         AGO   .ENDRLVL                                            @MPA 03070000
.RLVL7790 ANOP                                                     @MPA 03080000
         AIF   ('&RELEASE(1)' NE '7790').RLVL7780                  @MPA 03090000
&RLVL    SETC  '44   '             INDICATE RELEASE=7790           @MPA 03100000
         AGO   .ENDRLVL                                            @MPA 03110000
.RLVL7780 ANOP                                                     @MPA 03120000
         AIF   ('&RELEASE(1)' NE '7780').RLVL7770                  @MPA 03130000
&RLVL    SETC  '43   '             INDICATE RELEASE=7780           @MPA 03140000
         AGO   .ENDRLVL                                            @MPA 03150000
.RLVL7770 ANOP                                                     @MPA 03160000
         AIF   ('&RELEASE(1)' NE '7770').RLVL7760                  @MPA 03170000
&RLVL    SETC  '42   '             INDICATE RELEASE=7770           @MPA 03180000
         AGO   .ENDRLVL                                            @MPA 03190000
.RLVL7760 ANOP                                                     @MPA 03200000
         AIF   ('&RELEASE(1)' NE '7760').RLVL7750                  @MPA 03210000
&RLVL    SETC  '41   '             INDICATE RELEASE=7760           @MPA 03220000
         AGO   .ENDRLVL                                            @MPA 03230000
.RLVL7750 ANOP                                                     @MPA 03240000
         AIF   ('&RELEASE(1)' NE '7750').RLVL7740                  @MPA 03250000
&RLVL    SETC  '40   '             INDICATE RELEASE=7750           @MPA 03260000
         AGO   .ENDRLVL                                            @MPA 03270000
.RLVL7740 ANOP                                                     @MPA 03280000
         AIF   ('&RELEASE(1)' NE '7740').RLVL7730                  @MPA 03290000
&RLVL    SETC  '39   '             INDICATE RELEASE=7740           @MPA 03300000
         AGO   .ENDRLVL                                            @MPA 03310000
.RLVL7730 ANOP                                                     @MPA 03320000
         AIF   ('&RELEASE(1)' NE '7730').RLVL7720                  @MPA 03330000
&RLVL    SETC  '38   '             INDICATE RELEASE=7730           @MPA 03340000
         AGO   .ENDRLVL                                            @MPA 03350000
.RLVL7720 ANOP                                                     @MPA 03360000
         AIF   ('&RELEASE(1)' NE '7720').RLVL7709                  @MPA 03370000
&RLVL    SETC  '37   '             INDICATE RELEASE=7720           @MPA 03380000
         AGO   .ENDRLVL                                            @MPA 03390000
.RLVL7709 ANOP                                                     @MPA 03400000
         AIF   ('&RELEASE(1)' NE '7709').RLVL7708                  @MPA 03410000
&RLVL    SETC  '36   '             INDICATE RELEASE=7709           @MPA 03420000
         AGO   .ENDRLVL                                            @MPA 03430000
.RLVL7708 ANOP                                                     @MPA 03440000
         AIF   ('&RELEASE(1)' NE '7708').RLVL7707                  @MPA 03450000
&RLVL    SETC  '35   '             INDICATE RELEASE=7708           @MPA 03460000
         AGO   .ENDRLVL                                            @MPA 03470000
.RLVL7707 ANOP                                                     @MPA 03480000
         AIF   ('&RELEASE(1)' NE '7707').RLVL7706                  @MPA 03490000
&RLVL    SETC  '34   '             INDICATE RELEASE=7707           @MPA 03500000
         AGO   .ENDRLVL                                            @MPA 03510000
.RLVL7706 ANOP                                                     @MPA 03520000
         AIF   ('&RELEASE(1)' NE '7706').RLVL7705                  @MPA 03530000
&RLVL    SETC  '33   '             INDICATE RELEASE=7706           @MPA 03540000
         AGO   .ENDRLVL                                            @MPA 03550000
.RLVL7705 ANOP                                                     @MPA 03560000
         AIF   ('&RELEASE(1)' NE '7705').RLVL7703                  @MPA 03570000
&RLVL    SETC  '32   '             INDICATE RELEASE=7705           @MPA 03580000
         AGO   .ENDRLVL                                            @MPA 03590000
.RLVL7703 ANOP                                                     @MPA 03600000
         AIF   ('&RELEASE(1)' NE '7703').RLVL2608                  @MPA 03610000
&RLVL    SETC  '31   '             INDICATE RELEASE=7703           @MPA 03620000
         AGO   .ENDRLVL                                            @MPA 03630000
.RLVL2608 ANOP                                                     @MPA 03640000
         AIF   ('&RELEASE(1)' NE '2608').RLVL260                   @MPA 03650000
&RLVL    SETC  '30   '             INDICATE RELEASE=2608           @MPA 03660000
         AGO   .ENDRLVL                                            @MPA 03670000
.RLVL260 ANOP                                                      @MPA 03680000
         AIF   ('&RELEASE(1)' NE '2.6').RLVL240                    @MPA 03690000
&RLVL    SETC  '2.6  '             INDICATE RELEASE=2.6            @MPA 03700000
         AGO   .ENDRLVL                                            @MPA 03710000
.RLVL240 ANOP                                                      @MPA 03720000
         AIF   ('&RELEASE(1)' NE '2.4').RLVL230                    @MPA 03730000
&RLVL    SETC  '2.4  '             INDICATE RELEASE=2.4            @MPA 03740000
         AGO   .ENDRLVL                                            @MPA 03750000
.RLVL230 ANOP                                                      @MPA 03760000
         AIF   ('&RELEASE(1)' NE '2.3').RLVL220                    @MPA 03770000
&RLVL    SETC  '2.3  '             INDICATE RELEASE=2.3            @MPA 03780000
         AGO   .ENDRLVL                                            @MPA 03790000
.RLVL220 ANOP                                                      @MPA 03800000
         AIF   ('&RELEASE(1)' NE '2.2').RLVL210                    @MPA 03810000
&RLVL    SETC  '2.2  '             INDICATE RELEASE=2.2            @MPA 03820000
         AGO   .ENDRLVL                                            @MPA 03830000
.RLVL210 ANOP                                                      @MPA 03840000
         AIF   ('&RELEASE(1)' NE '2.1').RLVL192                    @MPA 03850000
&RLVL    SETC  '2.1  '             INDICATE RELEASE=2.1            @MPA 03860000
         AGO   .ENDRLVL                                            @MPA 03870000
.RLVL192 ANOP                                                      @MPA 03880000
         AIF   ('&RELEASE(1)' NE '1.9.2').RLVL190                  @MPA 03890000
&RLVL    SETC  '1.9.2'             INDICATE RELEASE=1.9.2          @MPA 03900000
         AGO   .ENDRLVL                                            @MPA 03910000
.RLVL190 ANOP                                                      @MPA 03920000
         AIF   ('&RELEASE(1)' NE '1.9').RLVL181                    @MPA 03930000
&RLVL    SETC  '1.9  '             INDICATE RELEASE=1.9            @MPA 03940000
         AGO   .ENDRLVL                                            @MPA 03950000
.RLVL181 ANOP                                                      @MPA 03960000
         AIF   ('&RELEASE(1)' NE '1.8.1').RLVL180                  @MPA 03970000
&RLVL    SETC  '1.8.1'             INDICATE RELEASE= 1.8.1         @MPA 03980000
         AGO   .ENDRLVL                                            @MPA 03990000
.RLVL180 ANOP                                                      @MPA 04000000
         AIF   ('&RELEASE(1)' NE '1.8').RLVL17                     @MPA 04010000
&RLVL    SETC  '1.8  '             INDICATE RELEASE=1.8            @MPA 04020000
         AGO   .ENDRLVL                                            @MPA 04030000
.RLVL17  ANOP                                                      @MPA 04040000
         AIF   ('&RELEASE(1)' NE '1.7').RLVL16                     @MPA 04050000
&RLVL    SETC  '1.7  '             INDICATE RELEASE=1.7            @MPA 04060000
         AGO   .ENDRLVL                                            @MPA 04070000
.RLVL16  ANOP                                                      @MPA 04080000
.NORLVL  ANOP                                                      @MPA 04090000
&RLVL    SETC  '1.6  '             INDICATE RELEASE=1.6            @MPA 04100000
.ENDRLVL ANOP                                                      @MPA 04110000
.*                                                                 @M2A 04120000
.* TEST INCOMPATABILITY OF NEW KEYWORDS.                           @M2A 04130000
.*                                                                 @M2A 04140000
         AIF   ('&RELEASE(1)' EQ '').RLCHK16                       @P5A 04150000
         AIF   ('&RLVL'(1,3) GT '1.9').RLCHK92                     @MPC 04160000
         AIF   ('&RLVL'(1,5) GE '1.9.2').RLCHK92                   @MPC 04170000
         AIF   ('&RLVL'(1,3) GE '1.9').RLCHK19                     @MPC 04180000
         AIF   ('&RLVL'(1,5) GE '1.8.1').RLCHK18                   @MPC 04190000
         AIF   ('&RLVL'(1,3) GE '1.8').RLCHK18                     @MPC 04200000
.*                                                                 @M2A 04210000
.* KEYWORDS INTRODUCED IN RELEASE 1.8 ARE NOT SPECIFIED WITH       @M2A 04220000
.* PREVIOUS RELEASES.                                              @M2A 04230000
.*                                                                 @M2A 04240000
.RLCHK16 ANOP                                                      @P5A 04250000
         AIF   ('&SEGMENT&SEGDATA&ACEE&VOLSER&GENERIC&FLDACC&CLASS&DERIX04260000
               VE' NE  '').ERR14                RELEASE IS 1.6/1.7 @M2C 04270000
.ERTN14  ANOP                                                      @M2C 04280000
         AIF   ('&TYPE' NE 'EXTRACT' AND '&TYPE' NE '' AND             X04290000
               '&TYPE' NE 'ENCRYPT').ERR15                         @M2C 04300000
.ERTN15  ANOP                                                      @M2C 04310000
.*                                                                 @M2A 04320000
.* KEYWORDS INTRODUCED IN RELEASE 1.9 ARE NOT SPECIFIED WITH       @M2A 04330000
.* PREVIOUS RELEASES.                                              @M2A 04340000
.*                                                                 @M2A 04350000
.RLCHK18 ANOP                                                      @M2A 04360000
         AIF   ('&BRANCH&MATCHGN' NE '').ERR14X                    @M2C 04370000
.ERTN14X ANOP                                                      @M2A 04380000
         AIF   ('&ENTITYX' NE '').ERR26                            @M2A 04390000
.ERTN26  ANOP                                                      @M2A 04400000
.RLCHK19 ANOP                                                      @M2A 04410000
         AIF   ('&DATEFMT' NE '').ERR29                            @01A 04420000
.ERTN29  ANOP                                                      @01A 04430000
.RLCHK92 ANOP                                                      @01A 04440000
.*                                                                 @M2A 04450000
.* UPWARD COMPATBILITY OF THE CODE.                                @M2A 04460000
.*                                                                 @M2A 04470000
         AIF  ('&RELEASE' LE '1.7').RL17COD                        @M2A 04480000
         AIF  ('&RELEASE' EQ '1.8').RL18COD                        @M2A 04490000
         AIF  ('&RELEASE' EQ '1.8.1').RL18COD                      @M2A 04500000
         AIF   (NOT &ICHRAC).ERR23       NOT CALLED BY RACROUTE    @M2A 04510000
.ERTN23  ANOP                            ISSUE MNOTE.              @M2A 04520000
.************************************************************      @M1A 04530000
.* VALIDITY CHECK BRANCH KEYWORD                                   @M1A 04540000
.************************************************************      @M1A 04550000
         AIF   ('&BRANCH' EQ 'NO' OR '&BRANCH' EQ '').BRCH010      @M1A 04560000
         AIF   ('&BRANCH' NE 'YES').ERR24                          @M1A 04570000
         AIF   ('&TYPE' NE 'EXTRACT' AND                               X04580000
               '&TYPE' NE 'EXTRACTN' AND                               X04590000
               '&TYPE' NE 'ENVRXTR' AND                                X04600000
               '&TYPE' NE 'ENCRYPT').ERR22                         @MEC 04610000
.ERTN22  ANOP                                                      @M1A 04620000
.BRCH010 ANOP                                                      @M1A 04630000
.*                                                                 @M2A 04640000
.* TEST 1. ENTITY AND ENTITYX ARE MUTUALLY EXCLUSIVE.              @M2A 04650000
.*      2. SET FLAG "YCOPENTY" WHEN ENTITYX IS SPECIFIED.          @M2A 04660000
.*                                                                 @M2A 04670000
         AIF   ('&ENTITY' NE '' AND '&ENTITYX' NE '' ).ERR25       @M2A 04680000
.ERTN25  ANOP                                                      @M2A 04690000
         AIF   ('&ENTITYX' EQ '').NOCOPY                           @M2A 04700000
&YCOPENT SETB  1                  SET FLAG AS ENTITYX IS SPECIFIED @M2A 04710000
&CMENTY  SETC  '&ENTITYX'                                          @M2A 04720000
.NOCOPY  ANOP                                                      @M2A 04730000
.RL18COD ANOP                                                      @M2A 04740000
&VERS    SETA  1                                                   @M2A 04750000
.RL17COD ANOP                                                      @M2A 04760000
         AIF   ('&TYPE' NE 'ENCRYPT' AND T'&ENCRYPT NE 'O').ERR16  @M1C 04770000
.ERLVL1R ANOP                                                      @L7A 04780000
.************************                                               04790000
.*   INITIALIZE VARIABLES                                               04800000
.************************                                               04810000
.INITVAR ANOP                                                      @L8A 04820000
&NX      SETC  '&SYSNDX'                                                04830000
&DFLTSP  SETA  229                 DEFAULT SUBPOOL                      04840000
&ICHNTFY SETB  0                   WANT ICHMM TO ISSUE ERROR MSGS       04850000
&ICHINER SETB  0                   INITIALIZE ICHINER TO 0              04860000
.***********************************                                    04870000
.*   SET UP INDICATORS FOR MF FORMAT                                    04880000
.***********************************                                    04890000
.*  VALIDATE MF PARAMETER                                               04900000
         AIF   ('&MF' NE 'L' AND '&MF' NE 'S' AND '&MF(1)' NE          *04910000
               'E' AND '&MF(1)' NE 'M').ERR01                      @M1C 04920000
&ICHMF   SETC  '&MF(1)'        SET MF TYPE                              04930000
         AIF   ('&MF(1)' NE 'M').MFLSE                             @M1A 04940000
         AIF   (NOT &ICHRAC).ERR01  MF=M ONLY ALLOWED VIA RACROUTE @M1A 04950000
&ICHMF   SETC  'E'             TREAT MF=M SAME AS MF=E             @M1A 04960000
.MFLSE   ANOP                           MF=L, S OR E               @M1A 04970000
         AIF   ('&ICHMF' EQ 'E').EXT0030                           @M1C 04980000
&ICHLIST SETB  1               MF LIST OR STANDARD                      04990000
         AIF   (T'&SEGMENT EQ 'O').SEG000                          @L8A 05000000
         AIF   ('&SEGMENT'(1,1) EQ '''').SEGL000                   @L8A 05010000
.SEG000  ANOP                                                      @L8A 05020000
&SEG000  SETC  '&SEGMENT'                                          @L8A 05030000
         AGO   .SEGL999                                            @L8A 05040000
.SEGL000 ANOP  ,                                                   @L8A 05050000
&SEG000  SETC  'ICH&NX.S'                                          @L8A 05060000
.SEGL999 ANOP  ,                                                   @L8A 05070000
         AIF   (T'&CLASS EQ 'O').CLS000                            @L8A 05080000
         AIF   ('&CLASS'(1,1) EQ '''').CLSL000                     @L8A 05090000
.CLS000  ANOP                                                      @L8A 05100000
&CLS000  SETC  '&CLASS'                                            @L8A 05110000
         AGO   .CLSL999                                            @L8A 05120000
.CLSL000 ANOP  ,                                                   @L8A 05130000
&CLS000  SETC  'ICH&NX.L'                                               05140000
.CLSL999 ANOP  ,                                                        05150000
         AGO   .CONT01                                                  05160000
.EXT0030 ANOP                                                           05170000
         AIF   ('&MF(2)' EQ '' OR N'&MF NE 2).ERR01                     05180000
         AIF   (T'&SEGMENT EQ 'O').SEG001                          @L8A 05190000
         AIF   ('&SEGMENT'(1,1) EQ '''').ERR17                     @L8A 05200000
&SEG000  SETC  '&SEGMENT'                                          @L8A 05210000
.ERTN17  ANOP  ,                                                   @L8A 05220000
.SEG001  AIF   (T'&CLASS EQ 'O').CLS001                            @L8A 05230000
         AIF   ('&CLASS'(1,1) EQ '''').ERR18                       @L8A 05240000
&CLS000  SETC  '&CLASS'                                            @L8A 05250000
.CLS001  ANOP  ,                                                   @L8A 05260000
.ERTN18  ANOP  ,                                                   @L8A 05270000
&ICHLIST SETB  0               MF EXECUTE                               05280000
.****************************************************                   05290000
.*  DETERMINE FUNCTION SUPPLIED                                         05300000
.****************************************************                   05310000
.CONT01  ANOP                                                           05320000
.TYPECK  ANOP                                                      @L8A 05330000
         AIF   ('&TYPE' EQ '').ERR07                               @L8A 05340000
         AIF   ('&TYPE' EQ 'ENCRYPT').EXT0300                      @L8A 05350000
         AIF   ('&TYPE' EQ 'ENVRXTR').EXT0400                      @M8A 05360000
         AIF   ('&TYPE' EQ 'REPLACE').REP0100                      @L8A 05370000
         AIF   ('&TYPE' EQ 'EXTRACTN').EXT0200                     @L8A 05380000
         AIF   ('&TYPE' NE 'EXTRACT').ERR05                        @L8A 05390000
.****************************************************                   05400000
.*   VALIDATE PARAMETERS ALLOWABLE WITH                                 05410000
.*   TYPE=EXTRACT  TYPE=EXTRACTN TYPE=REPLACE                      @L8A 05420000
.****************************************************                   05430000
.EXT0100 ANOP                                                      @L8A 05440000
&FN      SETA  1                         TYPE=EXTRACT              @L8A 05450000
         AIF   ('&ICHMF' NE 'S').EXCONT1                           @L8A 05460000
         AIF   ('&SEGDATA' NE '').ERR03                            @L8A 05470000
         AGO   .EXCONT1                                            @L8A 05480000
.EXT0200 ANOP                                                      @L8A 05490000
&FN      SETA  3                         TYPE=EXTRACTN             @L8A 05500000
         AIF   ('&ICHMF' NE 'S').EXCONT1                           @L8A 05510000
         AIF   ('&SEGDATA' NE '').ERR03                            @L8A 05520000
         AGO   .EXCONT1                                            @L8A 05530000
.REP0100 ANOP                                                      @L8A 05540000
&FN      SETA  4                         TYPE=REPLACE              @L8A 05550000
         AIF   ('&MF' NE 'S').EXCONT1                              @L8A 05560000
         AIF   ('&SEGMENT&SEGDATA' EQ '').ERR19                    @L8A 05570000
         AIF   ('&SEGDATA' NE '' AND '&FIELDS' EQ '').ERR27        @P4A 05580000
.ERTN27  ANOP                                                      @P4A 05590000
.EXCONT1 ANOP                                                      @L8A 05600000
         AIF   ('&ENCRYPT' NE '').ERR03                            @L8A 05610000
         AIF   ('&SUBPOOL' EQ '').CONT01A                          @L8A 05620000
         AIF   (T'&SUBPOOL NE 'N').ERR09  SUBPOOL NON-NUMERIC      @L8A 05630000
         AIF   (&SUBPOOL LT 0 OR &SUBPOOL GT 255).ERR09            @L8A 05640000
&SP      SETC  '&SUBPOOL'       COPY SUBPOOL VALUE TO LOCAL AREA   @L8A 05650000
         AGO   .CONTSP                                             @L8A 05660000
.CONT01A ANOP  ,                                                        05670000
         AIF   ('&ICHMF' EQ 'E').CONTSP                            @L8A 05680000
&SP      SETC  '&DFLTSP'      SET DEFAULT SUBPOOL IN LOCAL AREA    @L8A 05690000
.CONTSP  ANOP  ,                                                        05700000
         AIF   ('&GENERIC' EQ '' ).DFP                                  05710000
         AIF   ('&GENERIC' NE 'ASIS' AND                               X05720000
               '&GENERIC' NE 'YES').ERR11                          @L8A 05730000
.DFP     ANOP  ,                                                   @L8A 05740000
         AIF   ('&DERIVE' EQ '' ).FLDACC                           @P1A 05750000
         AIF   ('&DERIVE' NE 'YES' AND                                 X05760000
               '&DERIVE' NE 'NO').ERR12                            @P1A 05770000
.FLDACC  ANOP  ,                                                   @L8A 05780000
         AIF   ('&FLDACC' EQ '' ).MATCHG                           @M1C 05790000
         AIF   ('&FLDACC' NE 'YES' AND                                 X05800000
                '&FLDACC' NE 'NO').ERR13                           @L8A 05810000
.MATCHG  ANOP  ,                                                   @M1A 05820000
         AIF   ('&MATCHGN' EQ '' ).DATE4                           @01C 05830000
         AIF   ('&MATCHGN' NE 'YES' AND                                X05840000
                '&MATCHGN' NE 'NO').ERR135                         @P2C 05850000
.DATE4   ANOP  ,                                                   @01A 05860000
         AIF   ('&DATEFMT' EQ '' ).NOFLDA                          @01A 05870000
         AIF   ('&DATEFMT' NE 'YYDDDF' AND                             X05880000
                '&DATEFMT' NE 'YYYYDDDF').ERR30                    @01A 05890000
.NOFLDA  ANOP                                                      @L8A 05900000
         AGO   .CONT02                                                  05910000
.****************************************************                   05920000
.*   VALIDATE PARAMETERS ALLOWABLE WITH                                 05930000
.*   TYPE=ENCRYPT                                                       05940000
.****************************************************                   05950000
.EXT0300 ANOP                                                           05960000
&FN      SETA  2                                                        05970000
         AIF   ('&FIELDS&SUBPOOL&DATEFMT' NE '').ERR03             @01A 05980000
         AIF   ('&ENCRYPT' EQ '').ERR10                                 05990000
         AIF   ('&ENCRYPT(2)' NE '' AND '&ENCRYPT(2)' NE 'DES' AND     X06000000
               '&ENCRYPT(2)' NE 'HASH' AND '&ENCRYPT(2)' NE 'STDDES'   X06010000
               AND '&ENCRYPT(2)' NE 'INST').ERR06                  @M1C 06020000
.*                                 INVALID ENCRYPTION METHOD       @M1A 06030000
         AIF   (N'&ENCRYPT GT 2).ERR04  TOO MANY SUBPARAMETERS          06040000
         AIF   ('&ICHMF' NE 'S').CONT02                                 06050000
         AIF   ('&ENCRYPT(1)' EQ '' OR '&ENCRYPT(2)' EQ '').ERR08       06060000
         AGO   .CONT02                                             @M8A 06070000
.****************************************************              @M8A 06080000
.*   VALIDATE PARAMETERS ALLOWABLE WITH                            @M8A 06090000
.*   TYPE=ENVRXTR                                                  @M8A 06100000
.****************************************************              @M8A 06110000
.EXT0400 ANOP                                                      @M8A 06120000
&FN      SETA  5                                                   @M8A 06130000
.* CHECK THE RELEASE                                               @M8A 06140000
         AIF  ('&RELEASE' LT '2.6').ERR28                          @M8A 06150000
.ERTN28  ANOP                                                      @M8A 06160000
.**************************************************************         06170000
.*  BEGIN THE PARAMETER LIST AND ESTABLISH ADDRESSABILITY TO IT         06180000
.**************************************************************         06190000
.CONT02  ANOP                                                           06200000
.* SET BITS FOR FLAG BYTE IN COMMON PART OF PLIST (OFFSET 5)       @M1A 06210000
&BITA0   SETA  1                                                   @M1A 06220000
&BITA1   SETA  1                                                   @P3C 06230000
&BITA2   SETA  1                                                   @M1A 06240000
&BITA3   SETA  1                                                   @M1A 06250000
&BITA4   SETA  1                                                   @M1A 06260000
&BITA5   SETA  1                                                   @M1A 06270000
&BITA6   SETA  1                                                   @M1A 06280000
&BITA7   SETA  1                                                   @M1A 06290000
&BIT0    SETA  0                                                   @M1A 06300000
&BIT1    SETA  0                                                   @P3C 06310000
&BIT2    SETA  0                                                   @M1A 06320000
&BIT3    SETA  0                                                   @M1A 06330000
&BIT4    SETA  0                                                   @M1A 06340000
&BIT5    SETA  0                                                   @M1A 06350000
&BIT6    SETA  0                                                   @M1A 06360000
&BIT7    SETA  0                                                   @M1A 06370000
         AIF   ('&TYPE' EQ 'ENVRXTR').CONT023                      @M8A 06380000
         AIF   ('&BRANCH' EQ '').CONT026   DON'T SET BRANCH BIT    @P6A 06390000
         AIF   ('&BRANCH' EQ 'YES').CONT023                        @M1A 06400000
&BITA0   SETA  0                           TURN OFF BRANCH BIT     @M1A 06410000
         AGO   .CONT026                    CONTINUE                @M1A 06420000
.CONT023 ANOP                              BRANCH=YES SPECIFIED    @M1A 06430000
&BIT0    SETA  1                           TURN ON BRANCH BIT      @M1A 06440000
.CONT026 ANOP                                                      @M1A 06450000
         AIF   ('&ENTITYX' EQ '').CONT027  ENTITYX SPECIFIED?      @P3A 06460000
&BIT1    SETA  1                           YES, INDICATE ENTITYX   @P3A 06470000
         AGO   .CONT028                    CONTINUE                @P3A 06480000
.CONT027 ANOP                                                      @P3A 06490000
         AIF   ('&ENTITY' EQ '').CONT028   ENTITY SPECIFIED?       @P3A 06500000
&BITA1   SETA  0                           YES, INDICATE ENTITY    @P3A 06510000
.CONT028 ANOP                                                      @P3A 06520000
         AIF   ('&ICHMF' NE 'E').EXT0215                                06530000
.* MF=E                                                                 06540000
         AIF   (&ICHRAC).EXT0212                                        06550000
&NAME    IHBINNRA &MF(2)          POINT R1 AT PARAMETER LIST            06560000
         AGO   .EXT0214                                                 06570000
.EXT0212 ANOP                                                           06580000
&NAME    A     1,36(1)            POINT R1 AT PARAMETER LIST            06590000
.* IF REQUESTED, CHECK TYPE PARAMETER IN L- VS. E-FORM             @L7A 06600000
.EXT0214 ANOP                                                      @L7A 06610000
         AIF   (NOT &RLVLCHK).RLVLX20                              @L7A 06620000
         AIF   (&FN NE 2).EXT0216                                  @L8A 06630000
         CLI   3(1),2                                              @L8A 06640000
         BNE   *+12                                                @L8A 06650000
         CLI   4(1),&VERS          VERSION SAME FOR L AND E FORM ? @L8A 06660000
         BE    *+12                YES                             @L8A 06670000
         LA    15,100              SET INCOMPATIBLE MACROS R.C.    @L7A 06680000
         B     &ICHRLVL                                            @L7A 06690000
.EXT0216 AIF   (&FN EQ 2).RLVLX20                                  @L8A 06700000
         CLI   3(1),2                                              @L8A 06710000
         BE    *+12                                                @L8A 06720000
         CLI   4(1),&VERS          VERSION SAME FOR L AND E FORM ? @L8A 06730000
         BE    *+12                YES                             @L8A 06740000
         LA    15,100              SET INCOMPATIBLE MACROS R.C.    @L7A 06750000
         B     &ICHRLVL                                            @L7A 06760000
.RLVLX20 ANOP                                                      @L7A 06770000
         AGO   .CONT03                                                  06780000
.EXT0215 ANOP                                                           06790000
.* MF=L/S                                                               06800000
         AIF   ('&MF' EQ 'S').EXT0222                          @YA08189 06810000
&NAME    DS    0F                                              @YA08189 06820000
         AIF   ('&MF' EQ 'L').EXT0223                          @ZA94352 06830000
.* MF=S                                                                 06840000
.EXT0222 ANOP                                                  @YA08189 06850000
         CNOP  0,4                                                      06860000
&NAME    BAL   1,ICH&NX.D         POINT R1 AT PARAMETER LIST   @YA11600 06870000
.EXT0223 ANOP                                                  @ZA94352 06880000
         AIF   (NOT &ICHRAC).EXT0224  INVOKER NOT RACROUTE     @ZA94352 06890000
&ICHL    DS    0F                                              @YA08189 06900000
.EXT0224 ANOP                                                           06910000
.* MF=L/S                                                               06920000
ICH&NX.A DS    0F                                              @YA08189 06930000
         DC    AL2(ICH&NX.C-ICH&NX.A) LENGTH OF LIST IN BYTES           06940000
         DC    XL1'82'            FUNCTION CODE FOR ICHRSV00            06950000
         DC    AL1(&FN)           REQUEST TYPE                          06960000
         DC    AL1(&VERS)         VERSION NUMBER                   @L8A 06970000
         DC    B'&BIT0&BIT1&BIT2&BIT3&BIT4&BIT5&BIT6&BIT7'         @M1A 06980000
         DC    AL2(ICH&NX.B-ICH&NX.A) OFFSET TO VARIABLE PART OF LIST   06990000
.CONT03  ANOP                                                           07000000
         AIF   ('&ICHMF' NE 'E').EXT0230                           @L8A 07010000
         MVI   3(1),&FN            REQUEST TYPE                         07020000
         AIF   ('&BIT0&BIT1&BIT2&BIT3&BIT4&BIT5&BIT6&BIT7' EQ          X07030000
               '00000000').CONT13                                  @M1A 07040000
.*                                 TURN ON BITS IN FLAG BYTE       @M1A 07050000
         OI    5(1),B'&BIT0&BIT1&BIT2&BIT3&BIT4&BIT5&BIT6&BIT7'    @M1A 07060000
.CONT13  ANOP  ,                                                   @M1A 07070000
         AIF   ('&BITA0&BITA1&BITA2&BITA3&BITA4&BITA5&BITA6&BITA7' EQ  X07080000
               '11111111').EXT0230                                 @M1A 07090000
.*                                 TURN OFF BITS IN FLAG BYTE      @M1A 07100000
         NI    5(1),B'&BITA0&BITA1&BITA2&BITA3&BITA4&BITA5&BITA6&BITA7' 07110000
.EXT0230 ANOP  ,                                                   @L8A 07120000
&ICHCT   SETA  2               INITIALIZE PARAMETER COUNTER             07130000
         ICHMM &CMENTY                                            @M2C  07140000
         AIF   (NOT &ICHLIST).EXT0231                                   07150000
ICH&NX.B EQU   *                  END OF FIXED PART                     07160000
.EXT0231 ANOP  ,                                                        07170000
         AIF   (&FN EQ 2).EXT0310   REQUEST IS ENCRYPT                  07180000
         AIF   (&FN EQ 5).EXT0350   REQUEST IS ENVRXTR             @M8A 07190000
.***************************                                            07200000
.* GENERATE LIST FOR                                                    07210000
.* TYPE=EXTRACT, TYPE=EXTRACTN OR TYPE=REPLACE                     @L8A 07220000
.***************************                                       @L8A 07230000
         ICHMM &CLS000         ADDRESS OF CLASS                         07240000
         ICHMM &SP             SUBPOOL NUMBER                           07250000
         ICHMM &FIELDS         ADDRESS OF VARIABLE FIELDS          @L8A 07260000
.EXTSL   ANOP                                                           07270000
         AIF   (&VERS LT 1 ).CONT04                                @L8A 07280000
         ICHMM &SEG000         ADDRESS OF SEGMENT                  @L8A 07290000
         ICHMM &SEGDATA        ADDRESS OF VARIABLE SEGDATA FIELDS  @L8A 07300000
         ICHMM &ACEE           ADDRESS OF ACEE                     @L8A 07310000
         ICHMM &VOLSER         ADDRESS OF VOLSER                   @L8A 07320000
.* INITIALIZE BITS SET VARIABLES                                        07330000
&BITA0   SETA  1                                                   @L8A 07340000
&BITA1   SETA  1                                                   @L8A 07350000
&BITA2   SETA  1                                                   @L8A 07360000
&BITA3   SETA  1                                                   @L8A 07370000
&BITA4   SETA  1                                                   @L8A 07380000
&BITA5   SETA  1                                                   @L8A 07390000
&BITA6   SETA  1                                                   @L8A 07400000
&BITA7   SETA  1                                                   @L8A 07410000
&BIT0    SETA  0                                                   @L8A 07420000
&BIT1    SETA  0                                                   @L8A 07430000
&BIT2    SETA  0                                                   @L8A 07440000
&BIT3    SETA  0                                                   @L8A 07450000
&BIT4    SETA  0                                                   @L8A 07460000
&BIT5    SETA  0                                                   @L8A 07470000
&BIT6    SETA  0                                                   @L8A 07480000
&BIT7    SETA  0                                                   @L8A 07490000
&DATA0   SETA  1                                                   @01A 07500000
&DATA1   SETA  1                                                   @01A 07510000
&DATA2   SETA  1                                                   @01A 07520000
&DATA3   SETA  1                                                   @01A 07530000
&DATA4   SETA  1                                                   @01A 07540000
&DATA5   SETA  1                                                   @01A 07550000
&DATA6   SETA  1                                                   @01A 07560000
&DATA7   SETA  1                                                   @01A 07570000
&DAT0    SETA  0                                                   @01A 07580000
&DAT1    SETA  0                                                   @01A 07590000
&DAT2    SETA  0                                                   @01A 07600000
&DAT3    SETA  0                                                   @01A 07610000
&DAT4    SETA  0                                                   @01A 07620000
&DAT5    SETA  0                                                   @01A 07630000
&DAT6    SETA  0                                                   @01A 07640000
&DAT7    SETA  0                                                   @01A 07650000
         AIF   ('&ICHMF' NE 'E').XTRFL10                           @P2M 07660000
         AIF   ('&DATEFMT' NE 'YYDDDF').XTRMCHG                    @01A 07670000
&DATA7   SETA  0                                                   @01A 07680000
.XTRMCHG ANOP  ,                                                   @01A 07690000
         AIF   ('&MATCHGN' NE 'NO').XTRGEN                         @M1A 07700000
&BITA4   SETA  0                                                   @M1A 07710000
.XTRGEN  ANOP                                                      @M1A 07720000
         AIF   ('&GENERIC' NE 'ASIS').XTRDFP                       @L8A 07730000
&BITA5   SETA  0                                                   @L8A 07740000
.XTRDFP  ANOP                                                      @L8A 07750000
         AIF   ('&DERIVE' NE 'NO').XTRFLDA                         @P1A 07760000
&BITA6   SETA  0                                                   @L8A 07770000
.XTRFLDA ANOP                                                      @L8A 07780000
         AIF   ('&FLDACC' NE 'NO').XTRFLGS                         @L8A 07790000
&BITA7   SETA  0                                                   @L8A 07800000
.XTRFLGS ANOP                                                      @L8A 07810000
         AIF   ('&BITA0&BITA1&BITA2&BITA3&BITA4&BITA5&BITA6&BITA7' EQ  X07820000
               '11111111').DATFLGS                                 @01C 07830000
         NI   43(1),B'&BITA0&BITA1&BITA2&BITA3&BITA4&BITA5&BITA6&BITA7' 07840000
.*  ADD BITA0 TO ABOVE BIT STRING                                  @M1C 07850000
.DATFLGS AIF   ('&DATA0&DATA1&DATA2&DATA3&DATA4&DATA5&DATA6&DATA7' EQ  X07860000
               '11111111').XTRFL10                                 @01A 07870000
         NI   42(1),B'&DATA0&DATA1&DATA2&DATA3&DATA4&DATA5&DATA6&DATA7' 07880000
.XTRFL10 ANOP                                                      @L8A 07890000
         AIF   ('&DATEFMT' NE 'YYYYDDDF').XORMCHG                  @01A 07900000
&DAT7    SETA  1                                                   @01A 07910000
.XORMCHG ANOP                                                      @01A 07920000
         AIF   ('&MATCHGN' NE 'YES').XTRT050                       @M1A 07930000
&BIT4    SETA  1                                                   @M1A 07940000
.XTRT050 ANOP                                                      @M1A 07950000
         AIF   ('&GENERIC' NE 'YES').XTRT100                       @L8A 07960000
&BIT5    SETA  1                                                   @L8A 07970000
.XTRT100 ANOP                                                      @L8A 07980000
         AIF   ('&DERIVE' NE 'YES').XTRT200                        @P1A 07990000
&BIT6    SETA  1                                                   @L8A 08000000
.XTRT200 ANOP                                                      @L8A 08010000
         AIF   ('&FLDACC' NE 'YES').XTRT300                        @L8A 08020000
&BIT7    SETA  1                                                   @L8A 08030000
.XTRT300 ANOP                                                      @L8A 08040000
         AIF   ('&ICHMF' NE 'E').CONTFLG                           @L8A 08050000
         AIF   ('&BIT0&BIT1&BIT2&BIT3&BIT4&BIT5&BIT6&BIT7' EQ          X08060000
               '00000000').DATFLG                                  @01C 08070000
         OI    43(1),B'&BIT0&BIT1&BIT2&BIT3&BIT4&BIT5&BIT6&BIT7'   @L8A 08080000
.DATFLG  AIF   ('&DAT0&DAT1&DAT2&DAT3&DAT4&DAT5&DAT6&DAT7' EQ          X08090000
               '00000000').CONTFLG                                 @01A 08100000
         OI    42(1),B'&DAT0&DAT1&DAT2&DAT3&DAT4&DAT5&DAT6&DAT7'   @01A 08110000
         AGO   .CONT04                                             @L8A 08120000
.CONTFLG ANOP  ,                                                   @L8A 08130000
         AIF   (NOT &ICHLIST).CONT04                               @L8A 08140000
.LISTFLG DC    AL2(0)          RESERVED                            @01C 08150000
         DC    B'&DAT0&DAT1&DAT2&DAT3&DAT4&DAT5&DAT6&DAT7'         @01A 08160000
         DC    B'&BIT0&BIT1&BIT2&BIT3&BIT4&BIT5&BIT6&BIT7'         @L8A 08170000
         AGO   .CONT04                                                  08180000
.************************************                                   08190000
.* GENERATE LIST FOR                                                    08200000
.* TYPE=ENCRYPT                                                         08210000
.************************************                                   08220000
.EXT0310 ANOP                                                           08230000
         ICHMM &ENCRYPT(1)   ADDRESS OF DATA TO BE ENCRYPTED            08240000
         AIF   ('&ENCRYPT(2)' EQ '').EXT0340                            08250000
         AIF   ('&ENCRYPT(2)' NE 'DES').EXT0330                         08260000
&METH    SETC  '1'           DES ENCRYPTION METHOD                      08270000
         AGO   .EXT0340                                                 08280000
.EXT0330 ANOP  ,                                                        08290000
         AIF   ('&ENCRYPT(2)' NE 'HASH').EXT0334                        08300000
&METH    SETC  '2'           HASHING ENCRYPTION METHOD                  08310000
         AGO   .EXT0340                                                 08320000
.EXT0334 ANOP  ,                                                        08330000
         AIF   ('&ENCRYPT(2)' NE 'INST').EXT0336                   @M1A 08340000
&METH    SETC  '3'           INSTALLATION-DEFINED METHOD                08350000
         AGO   .EXT0340                                            @M1A 08360000
.EXT0336 ANOP  ,                                                   @M1A 08370000
&METH    SETC  '4'           STANDARD DES ENCRYPTION METHOD        @M1A 08380000
.EXT0340 ANOP  ,                                                        08390000
         ICHMM  &METH        ENCRYPTION METHOD                          08400000
         AGO   .CONT04                                             @M8A 08410000
.************************************                              @M8A 08420000
.* GENERATE LIST FOR                                               @M8A 08430000
.* TYPE=ENVRXTR                                                    @M8A 08440000
.************************************                              @M8A 08450000
.EXT0350 ANOP                                                      @M8A 08460000
         ICHMM &ENVROUT      ADDRESS OF ENVROUT                    @M8A 08470000
         ICHMM &ACEE         ADDRESS OF ACEE                       @M8A 08480000
.***************************************************************        08490000
.*  AT THIS POINT, THE LIST AND EXECUTE FORMS ARE COMPLETED.  IF        08500000
.*  THE LIST PASS OF THE STANDARD FORM HAS JUST BEEN COMPLETED,         08510000
.*  RETURN FOR AN EXECUTE PASS.                                         08520000
.***************************************************************        08530000
.CONT04  ANOP                                                           08540000
         AIF   (NOT &ICHLIST).CONT05  SKIP END-OF-LIST LABEL            08550000
ICH&NX.C DS    0H                 END OF PARAMETER LIST                 08560000
         AIF   (T'&SEGMENT EQ 'O').SEGM999                         @L8A 08570000
         AIF   ('&SEGMENT'(1,1) NE '''').SEGM999                   @L8A 08580000
&SEG000  DC    CL8&SEGMENT                                         @L8A 08590000
.SEGM999 ANOP  ,                                                        08600000
         AIF   (T'&CLASS EQ 'O').CLSM999                           @L8A 08610000
         AIF   ('&CLASS'(1,1) NE '''').CLSM999                     @L8A 08620000
&CLS000  DC    CL8&CLASS                                                08630000
.CLSM999 ANOP  ,                                                        08640000
ICH&NX.D DS    0H                                                       08650000
.CONT05  ANOP                                                           08660000
         AIF   ('&ICHMF' NE 'S' OR NOT &ICHLIST).CONT06                 08670000
&ICHLIST SETB  0                                                        08680000
         AGO   .CONT03           DO EXECUTE PATH OF STANDARD FORM       08690000
.*****************************************************                  08700000
.*  THE SVC INSTRUCTION IS GENERATED IF RACXTRT IS                      08710000
.*  NOT INVOKED FROM THE RACROUTE MACRO OR IF THIS                      08720000
.*  IS NOT A LIST PASS.                                                 08730000
.*****************************************************                  08740000
.CONT06  ANOP                                                           08750000
         AIF   (&ICHRAC OR &ICHLIST).EROUTE                             08760000
         SVC   132                INVOKE EXTRACT ROUTINE                08770000
         AIF   (NOT &RLVLCHK).RLVLX40                              @L7A 08780000
&ICHRLVL DS    0H                                                  @L7A 08790000
.RLVLX40 ANOP                                                      @L7A 08800000
         AGO   .EROUTE                                                  08810000
.*****************                                                      08820000
.*  ERROR MESSAGES                                                      08830000
.*****************                                                      08840000
.ERR01   ANOP                                                           08850000
         MNOTE 12,'*** INVALID VALUE FOR ''MF'' PARAMETER'              08860000
         AGO   .EROUTE                                                  08870000
.ERR03   ANOP                                                           08880000
         MNOTE 12,'*** EXTRANEOUS PARAMETERS SPECIFIED FOR ''TYPE=&TYPEX08890000
               '''                                                      08900000
         AGO   .EROUTE                                                  08910000
.ERR04   ANOP                                                           08920000
         MNOTE 12,'*** TOO MANY PARAMETERS SPECIFIED FOR ''ENCRYPT'' PAX08930000
               RAMETER'                                                 08940000
         AGO   .EROUTE                                                  08950000
.ERR05   ANOP                                                           08960000
         MNOTE 12,'*** INVALID VALUE FOR ''TYPE'' PARAMETER'            08970000
         AGO   .EROUTE                                                  08980000
.ERR06   ANOP                                                           08990000
         MNOTE 12,'*** INVALID METHOD SPECIFIED FOR ''ENCRYPT'' PARAMETX09000000
               ER'                                                      09010000
         AGO   .EROUTE                                                  09020000
.ERR07   ANOP                                                           09030000
         MNOTE 12,'*** REQUIRED PARAMETER ''TYPE'' NOT SPECIFIED'       09040000
         AGO   .EROUTE                                                  09050000
.ERR08   ANOP                                                           09060000
         MNOTE 12,'*** BOTH SUBPARAMETERS MUST BE SPECIFIED FOR ''ENCRYX09070000
               PT'' PARAMETER'                                          09080000
         AGO   .EROUTE                                                  09090000
.ERR09   ANOP                                                           09100000
         MNOTE 12,'*** INVALID VALUE FOR ''SUBPOOL'' PARAMETER'         09110000
         AGO   .EROUTE                                                  09120000
.ERR10   ANOP                                                           09130000
         MNOTE 12,'*** ''ENCRYPT'' PARAMETER REQUIRED WITH ''TYPE=ENCRYX09140000
               PT'''                                                    09150000
         AGO   .EROUTE                                                  09160000
.ERR11   ANOP                                                           09170000
         MNOTE 12,'*** INVALID VALUE FOR '' GENERIC '' PARAMETER ' @L8A 09180000
         AGO   .EROUTE                                                  09190000
.ERR12   ANOP                                                           09200000
         MNOTE 12,'*** INVALID VALUE FOR '' DERIVE '' PARAMETER '  @P1A 09210000
         AGO   .EROUTE                                                  09220000
.ERR13   ANOP                                                           09230000
         MNOTE 12,'*** INVALID VALUE FOR '' FLDACC '' PARAMETER '  @L8A 09240000
         AGO   .EROUTE                                                  09250000
.ERR135  ANOP                                                           09260000
         MNOTE 12,'*** INVALID VALUE FOR '' MATCHGN '' PARAMETER ' @P2A 09270000
         AGO   .EROUTE                                             @P2A 09280000
.ERR14   MNOTE 4,'*** ''RELEASE'' INCOMPATIBLE WITH SPECIFIED KEYWORD(SX09290000
               ) ***'                                              @L8A 09300000
         AGO   .ERTN14                                             @M2C 09310000
.ERR14X  ANOP                                                      @M2A 09320000
         MNOTE 4,'*** ''RELEASE'' INCOMPATIBLE WITH SPECIFIED KEYWORD(SX09330000
               ) ***'                                              @M2A 09340000
         AGO   .ERTN14X                                            @M2A 09350000
.ERR15   ANOP                                                           09360000
         MNOTE 4,'INVALID TYPE FOR SPECIFIED RELEASE   '           @L8A 09370000
         AGO   .ERTN15                                             @M2C 09380000
.ERR16   MNOTE 8,'*** ''ENCRYPT'' ONLY ALLOWED WITH TYPE=ENCRYPT'  @L8A 09390000
         AGO   .EROUTE                                             @L8A 09400000
.ERR17   MNOTE 8,'*** ''SEGMENT'' FORM NOT ALLOWED WITH MF=E '     @L8A 09410000
         AGO   .ERTN17                                             @L8A 09420000
.ERR18   MNOTE 8,'*** ''CLASS'' FORM NOT ALLOWED WITH MF=E       ' @L8A 09430000
         AGO   .ERTN18                                             @L8A 09440000
.ERR19   MNOTE 4,'*** TYPE=REPLACE WAS CODED AND SEGMENT/SEGDATA NOT SPX09450000
               ECIFIED '                                           @L8A 09460000
         AGO   .EXCONT1                                            @L8A 09470000
.ERR22   MNOTE 8,'*** BRANCH=YES ONLY ALLOWED WITH TYPE=EXTRACT, EXTRACX09480000
               TN, ENCRYPT OR ENVRXTR ****'                        @MEC 09490000
         AGO   .ERTN22                                             @M1A 09500000
.ERR23   ANOP                                                      @M2C 09510000
         MNOTE  8,'*** RACXTRT CAN BE INVOKED ONLY THROUGH RACROUTE FORX09520000
                RELEASE 1.9 AND LATER ***'                         @M2A 09530000
         AGO   .ERTN23                                             @M1A 09540000
.ERR24   ANOP                                                      @M1A 09550000
         MNOTE  8,'*** INVALID VALUE FOR '' BRANCH '' PARAMETER '  @M1A 09560000
         AGO   .EROUTE                                             @M1A 09570000
.ERR25   ANOP                                                      @M2A 09580000
         MNOTE  8,'*** ENTITY AND ENTITYX ARE MUTUALLY EXCLUSIVE KEYWORX09590000
               DS ***'                                             @M2A 09600000
         AGO   .ERTN25                                             @M2A 09610000
.ERR26   ANOP                                                      @M2A 09620000
         MNOTE  8,'*** ''ENTITYX'' IS SUPPORTED BY RELEASE 1.9 AND LATEX09630000
               R ONLY, ENTITYX IS IGNORED ***'                     @M2A 09640000
         AGO   .ERTN26                                             @M2A 09650000
.ERR27   ANOP                                                      @P4A 09660000
         MNOTE  8,'*** PARAMETER ''FIELDS'' IS REQUIRED WITH ''SEGDATA'X09670000
               ' ***'                                              @P4A 09680000
         AGO   .ERTN27                                             @P4A 09690000
.ERR28   ANOP                                                      @M8A 09700000
         MNOTE 8,'*** TYPE=ENVRXTR NOT VALID FOR SPECIFIED RELEASE ***'X09710000
                                                                   @M8A 09720000
         AGO   .ERTN28                                             @M8A 09730000
.ERR29   ANOP                                                      @01A 09740000
         MNOTE  8,'*** ''DATEFMT'' IS SUPPORTED BY RELEASE 1.9.2 AND LAX09750000
               TER ***'                                            @01A 09760000
         AGO   .ERTN29                                             @01A 09770000
.ERR30   ANOP                                                           09780000
         MNOTE 12,'*** INVALID VALUE FOR '' DATEFMT '' PARAMETER ' @01A 09790000
         AGO   .EROUTE                                             @01A 09800000
.ERLVL1  MNOTE 8,'*** INCORRECT SPECIFICATION OF ''RELEASE'' ***'  @L7A 09810000
         AGO   .ERLVL1R                                            @L7A 09820000
.ERLVL2  MNOTE 4,'*** ''RELEASE-CHECK'' ONLY VALID WITH ''MF=E'' ***'  X09830000
                                                                   @L7A 09840000
         AGO   .ERLVL2R                                            @L7A 09850000
.EROUTE  ANOP                                                           09860000
.* RESET GLOBALS                                                        09870000
&ICHL    SETC  ''                                                       09880000
         MEND                                                           09890000
                                                                        09900000
