*%/*                                                                    00010000
         MACRO                                                          00020000
&NAME    RISGNL &FUNCTON,&CPU=,&EP=,&PARM=                              00030000
.**** START OF SPECIFICATIONS ***************************************** 00040000
.*                                                                      00050000
.*01*  MACRO NAME: RISGNL                                               00060000
.*                                                                      00070000
.*01*  DESCRIPTIVE NAME: REMOTE IMMEDIATE SIGNAL                        00080000
.*                                                                      00090000
.*01*  COPYRIGHT =                                                      00100000
.*            LICENSED MATERIALS - PROPERTY OF IBM                      00110000
.*            5650-ZOS COPYRIGHT IBM CORP. 1981, 2013                   00120000
.*                                                                      00130000
.*01*  STATUS = HBB7790                                                 00140000
.*                                                                      00150000
.*01*  EXTERNAL CLASSIFICATION: PI                                      00160001
.*01*  END OF EXTERNAL CLASSIFICATION:                                  00170000
.*                                                                      00180000
.*01*  FUNCTION:                                                        00190000
.*        PROVIDE THE INTERFACE TO THE REMOTE IMMEDIATE SIGNAL SERVICE  00200000
.*        ROUTINE                                                       00210000
.*                                                                      00220000
.*01*  COMPONENT: SUPERVISOR CONTROL (SC1C5)                            00230000
.*                                                                      00240000
.*01*  CHANGE ACTIVITY:                                                 00250000
.*      $01=OA07200  HBB7709  040410  PD00GD:  BIND-BREAK STAGE III     00260000
.*      $L1=ME20312  HBB7790  100110  PD00BS:  RCARRAY                  00270000
.*                                                                      00280000
.**** END OF SPECIFICATIONS ******************************************* 00290000
         GBLC  &MESSAGE                                                 00300000
         GBLC  &TYPE                                                    00310000
         AIF   ('&FUNCTON' NE '').PARLEL                                00320000
         IHBERMAC 24                                                    00330000
         MEXIT                                                          00340000
.PARLEL  AIF   ('&FUNCTON' NE 'PARALLEL').SERIAL                        00350000
&NAME    LA    0,128(0,0)              LOADS X'80', PARALLEL INDICATOR  00360000
         SLL   0,24(0)                 AND SHIFTS INTO HIGH ORDER BYTE  00370000
         AGO   .PCCAADR                                                 00380000
.SERIAL  AIF   ('&FUNCTON' NE 'SERIAL').ERR1                            00390000
&NAME    LA    0,64(0,0)               LOADS X'40', SERIAL INDICATOR    00400000
         SLL   0,24(0)                 AND SHIFTS INTO HIGH ORDER BYTE  00410000
         AGO   .PCCAADR                                                 00420000
.ERR1    ANOP                                                           00430000
         IHBERMAC 1001,FUNCTION,&FUNCTON                                00440000
         MEXIT                                                          00450000
.PCCAADR AIF   ('&CPU' EQ '(1)').EPADDR1                                00460000
         AIF   ('&CPU' NE '').EPADDR                                    00470000
         IHBERMAC 1006,CPU                                              00480000
         MEXIT                                                          00490000
.EPADDR  ANOP                                                           00500000
         AIF   ('&CPU'(1,1) EQ '(').ERREG1                              00510000
         LA    1,&CPU                  PHYSICAL CCA ADDRESS             00520000
.EPADDR1 ANOP                                                           00530000
         AIF   ('&EP' EQ '(12)').PARMAD1                                00540000
         AIF   ('&EP' NE '').PARMADR                                    00550000
         IHBERMAC 1006,EP                                               00560000
         MEXIT                                                          00570000
.PARMADR ANOP                                                           00580000
         AIF   ('&EP'(1,1) EQ '(').ERREG2                               00590000
         LA    12,&EP                  RECEIVING RTNS ENTRY POINT       00600000
.PARMAD1 ANOP                                                           00610000
         AIF   ('&PARM' EQ '(11)').MNLCDE                               00620000
         AIF   ('&PARM' NE '').LACDE                                    00630000
         LA    11,0(0,0)                                                00640000
         AGO   .MNLCDE                                                  00650000
.ERREG1  ANOP                                                           00660000
&TYPE    SETC  'CPU'                                                    00670000
         AGO   .ERREG                                                   00680000
.ERREG2  ANOP                                                           00690000
&TYPE    SETC  'EP'                                                     00700000
         AGO   .ERREG                                                   00710000
.ERREG3  ANOP                                                           00720000
&TYPE    SETC  'PARM'                                                   00730000
.ERREG   ANOP                                                           00740000
.*       IHB280 REGISTER NOTATION INVALID WITH XXX                      00750000
&MESSAGE SETC  'REGISTER NOTATION'                                      00760000
         IHBERMAC 1020,&MESSAGE,&TYPE                                   00770000
         MEXIT                                                          00780000
.LACDE   ANOP                                                           00790000
         AIF   ('&PARM'(1,1) EQ '(').ERREG3                             00800000
         L     11,&PARM       PARAMETER                                 00810000
.MNLCDE  ANOP                                                           00820000
         L     14,CVTPTR(0,0)          CVT ADDRESS                      00830000
         L     15,CVTIPCRI-CVT(0,14)   IEAVERI ENTRY POINT ADDRESS      00840000
         BALR  14,15                                                    00850000
         MEND                                                           00860000
* */                                                                    00870000
* RISGNL: MACRO KEYS(CPU,EP,PARM,ASID,RCARRAY); /*               @L1C*/ 00880000
* ANS('?'!!MACLABEL!!'RISGNLP '!!MACLIST!!MACKEYS!!'; ');               00890000
* %END;                                                                 00900000
