         MACRO                                                          00050000
&NAME    SAVE  &REG,&CODE,&ID                                           00100000
.********************************************************************** 00103500
.*                                                                    * 00107000
.* COPYRIGHT = 5694-A01                                               * 00110500
.*             THIS MODULE IS "RESTRICTED MATERIALS OF IBM"           * 00114000
.*             (C) COPYRIGHT IBM CORP. 1988,2001                      * 00117500
.*             LICENSED MATERIALS - PROPERTY OF IBM                   * 00121000
.*                                                                    * 00124500
.*01* EXTERNAL CLASSIFICATION: PI                                     * 00125900
.*01* END OF EXTERNAL CLASSIFICATION:                                 * 00127300
.*                                                                    * 00128700
.* STATUS =  HBB7706                                                  * 00130100
.*                                                                    * 00131500
.* CHANGE ACTIVITY =                                                  * 00135000
.*   $L1 =    AR    HBB3310 851105 PDXB: AR SUPPORT                   * 00138500
.*   $L2 = 64BIT    HBB7706 000123 PDXB: SAVEAREA FORMATS             * 00140200
.*   $01 = OW54354  HBB7706 020419 PDXB: FIX "J"                      * 00141100
.*                                                                    * 00142000
.********************************************************************** 00145500
         GBLC  &SYSAM64                                            @L2A 00146600
         GBLA  &SYSALVL                                            @L2A 00147700
         SYSSTATE TEST                                                  00148800
         LCLA  &A,&B,&C                                                 00150000
         LCLC  &E,&F,&G,&H                                              00200000
         LCLC  &ST,&STM,&R14O,&R0O                                      00203500
         AIF   ('&SYSAM64' EQ 'YES').AM641                         @L2A 00207000
&ST      SETC  'ST'                                                @L2A 00210500
&STM     SETC  'STM'                                               @L2A 00214000
&R14O    SETC  '12'                                                @L2A 00217500
&R0O     SETC  '20'                                                @L2A 00221000
         AGO   .AM31641                                            @L2A 00224500
.AM641   ANOP                                                      @L2A 00228000
&ST      SETC  'STG'                                               @L2A 00231500
&STM     SETC  'STMG'                                              @L2A 00235000
&R14O    SETC  '8'                                                 @L2A 00238500
&R0O     SETC  '24'                                                @L2A 00242000
.AM31641 ANOP                                                      @L2A 00245500
         AIF   ('&REG' EQ '').E1                                        00250000
         AIF   ('&ID' EQ '').NULLID                                     00300000
         AIF   ('&ID' EQ '*').SPECID                                    00350000
         AIF   ('&ID'(1,1) NE '''').NOQUOTE                    @ZA58263 00366600
&B       SETA  1                                               @ZA58263 00383200
&C       SETA  2                                               @ZA58263 00399800
.NOQUOTE ANOP                                                  @ZA58263 00416400
&A       SETA  ((K'&ID+2)/2)*2+4-&C                            @ZA58263 00433000
         AIF   (&SYSALVL GT 1).ALVL1A                              @L2A 00441500
&NAME    B     &A.(0,15)                         BRANCH AROUND ID       00450000
         AGO   .ALVL1B                                             @L2A 00460000
.ALVL1A  ANOP                                                      @L2A 00470000
&NAME    J     *+&A.                             BRANCH AROUND ID  @01C 00480000
.ALVL1B  ANOP                                                      @L2A 00490000
&A       SETA  K'&ID-&C                                        @ZA58863 00500000
         DC    AL1(&A)                           LENGTH OF IDENTIFIER   00550000
.CONTB   AIF   (&A GT 32).SPLITUP                                       00600000
.CONTAA  AIF   (&A GT 8).BRAKDWN                                        00650000
&E       SETC  '&ID'(&B+1,&A)                                           00700000
         DC    CL&A'&E'                          IDENTIFIER             00750000
         AGO   .CONTA                                                   00800000
.BRAKDWN ANOP                                                           00850000
&E       SETC  '&ID'(&B+1,8)                                            00900000
         DC    CL8'&E'                           IDENTIFIER             00950000
&B       SETA  &B+8                                                     01000000
&A       SETA  &A-8                                                     01050000
         AGO   .CONTAA                                                  01100000
.SPLITUP ANOP                                                           01150000
&E       SETC  '&ID'(&B+1,8)                                            01200000
&F       SETC  '&ID'(&B+9,8)                                            01250000
&G       SETC  '&ID'(&B+17,8)                                           01300000
&H       SETC  '&ID'(&B+25,8)                                           01350000
         DC    CL32'&E.&F.&G.&H'                      IDENTIFIER        01400000
&B       SETA  &B+32                                                    01450000
&A       SETA  &A-32                                                    01500000
         AGO   .CONTB                                                   01550000
.NULLID  ANOP                                                           01600000
&NAME    DS    0H                                                       01650000
         AGO   .CONTA                                                   01700000
.SPECID  AIF   ('&NAME' EQ '').CSECTN                                   01750000
&E       SETC  '&NAME'                                                  01800000
&A       SETA  1                                                        01850000
.CONTQ   AIF   ('&E'(1,&A) EQ '&E').LEAVE                               01900000
&A       SETA  &A+1                                                     01950000
         AGO   .CONTQ                                                   02000000
.LEAVE   ANOP                                                           02050000
&B       SETA  ((&A+2)/2)*2+4                                           02100000
         AIF   (&SYSALVL GT 1).ALVL2A                              @L2A 02125000
&NAME    B     &B.(0,15)                         BRANCH AROUND ID       02150000
         AGO   .ALVL2B                                             @L2A 02160000
.ALVL2A  ANOP                                                      @L2A 02170000
&NAME    J     *+&B.                             BRANCH AROUND ID  @01C 02180000
.ALVL2B  ANOP                                                      @L2A 02190000
         DC    AL1(&A)                                                  02200000
         DC    CL&A'&E'                          IDENTIFIER             02250000
         AGO   .CONTA                                                   02300000
.CSECTN  AIF   ('&SYSECT' EQ '').E4                                     02350000
&E       SETC  '&SYSECT'                                                02400000
&A       SETA  1                                                        02450000
         AGO   .CONTQ                                                   02500000
.E4      IHBERMAC 78,360                    CSECT NAME NULL             02550000
.CONTA   AIF   (T'&REG(1) NE 'N').E3                                    02600000
         AIF   ('&CODE' EQ 'T').CONTC                                   02650000
         AIF   ('&CODE' NE '').E2                                       02700000
         AIF   ('&SYSAM64' EQ 'YES').AM641A                        @L2A 02725000
&A       SETA  &REG(1)*4+20                                             02750000
         AIF   (&A LE 75).CONTD                                         02800000
&A       SETA  &A-64                                                    02850000
         AGO   .AM641B                                                  02857100
.AM641A  ANOP                                                           02864200
&A       SETA  &REG(1)*8+24                                             02871300
         AIF   (&A LE 120).CONTD                                        02878400
&A       SETA  &A-128                                                   02885500
.AM641B  ANOP                                                           02892600
.CONTD   AIF   (N'&REG NE 2).CONTE                                      02900000
         &STM  &REG(1),&REG(2),&A.(13)           SAVE REGISTERS         02950000
         MEXIT                                                          03000000
.CONTE   AIF   (N'&REG NE 1).E3                                         03050000
         &ST   &REG(1),&A.(0,13)                 SAVE REGISTER     @L1C 03100000
         MEXIT                                                          03150000
.CONTC   AIF   (&REG(1) GE 14 OR &REG(1) LE 2).CONTF                    03200000
         &STM  14,15,&R14O.(13)                  SAVE REGISTERS         03233300
         AIF   ('&SYSAM64' EQ 'YES').AM642A                        @L2A 03266600
&A       SETA  &REG(1)*4+20                                             03300000
         AGO   .AM642B                                                  03310000
.AM642A  ANOP                                                           03320000
&A       SETA  &REG(1)*8+24                                             03330000
.AM642B  ANOP                                                           03340000
         AIF   (N'&REG NE 2).CONTG                                      03350000
         &STM  &REG(1),&REG(2),&A.(13)           SAVE REGISTERS         03400000
         MEXIT                                                          03450000
.CONTG   AIF   (N'&REG NE 1).E3                                         03500000
         &ST   &REG(1),&A.(0,13)                 SAVE REGISTER     @L1C 03550000
         MEXIT                                                          03600000
.CONTF   AIF   (N'&REG NE 2).CONTH                                      03650000
         &STM  14,&REG(2),&R14O.(13)             SAVE REGISTERS         03700000
         MEXIT                                                          03750000
.CONTH   AIF   (N'&REG NE 1).E3                                         03800000
         &STM  14,&REG(1),&R14O.(13)             SAVE REGISTERS         03850000
         MEXIT                                                          03900000
.E1      IHBERMAC 18,360                    REG PARAM MISSING           03950000
         MEXIT                                                          04000000
.E2      IHBERMAC 37,360,&CODE              INVALID CODE SPECIFIED      04050000
         MEXIT                                                          04100000
.E3      IHBERMAC 36,360,&REG               INVALID REGS. SPECIFIED     04150000
         MEND                                                           04200000
