         MACRO                                                          00050000
&NAME    STACK &PARM=,&UPT=,&ECT=,&ECB=,&TERM=,&STORAGE=,&DELETE=,     *00100000
               &ENTRY=,&MF=,&DATASET=,&INQUIRE=,&BARRIER=,&ENVIRON=     00133300
.*                                                             E1502C1* 00166600
.********************************************************************** 00200000
.*                                                                    * 00250000
.*COPYRIGHT:                                                          * 00280000
.*        5685-025 COPYRIGHT IBM CORP 1988                     E1502C1* 00310000
.*        THIS PRODUCT CONTAINS RESTRICTED MATERIALS OF IBM,          * 00340000
.*        REFER TO COPYRIGHT INSTRUCTIONS FORM NUMBER G120-2083       * 00370000
.*                                                                    * 00400000
.*STATUS:                                                             * 00450000
.*                                                                    * 00483300
.*        HTE21D2  TSO/E VERSION 2 RELEASE 1                   E1502C1* 00516600
.*                                                                    * 00550000
.*FUNCTION:                                                           * 00600000
.*   THE STACK MACRO EXAMINES PARAMETERS SPECIFIED IN THE STACK MACRO * 00650000
.*   INSTRUCTION AND BUILDS A PARAMETER BLOCK TO BE USED BY THE STACK * 00700000
.*   SERVICE ROUTINE                                                  * 00750000
.*   IN THE LIST FORM, THE STACK MACRO GENERATES THE STACK            * 00850000
.*   PARAMETER BLOCK CONSISTING OF ONE WORD OF CONTROL (OPERATION AND * 00900000
.*   CODE) AND THE ADDRESSES OF THE STORAGE LIST SOURCE DESCRIPTOR,   * 00914200
.*   THE INPUT DD NAME, THE OUTPUT DD NAME, A MEMBER NAME,AND  E1502C1* 00928400
.*   ECT ADDRESS WHICH WILL BE USED WHEN THE CREATE BIT IS ON @E1502C1* 00942600
.*   TO GET TO THE STACK THAT THE CALLER WANTS,AND BUILD ONE  @E1502C1* 00956800
.*   LIKE IT,WHEN THE DESTROY BIT IS ON THEN IT WILL BE USED  @E1502C1* 00971000
.*   TO GET TO THE STACK THAT THE CALLER WANTS TO DELETE.     @E1502C1* 00985200
.*   IN THE EXECUTE FORM OF THE STACK MACRO, CODE IS GENERATED        * 01000000
.*   WHICH WILL RESET THE PARAMETER BLOCK IF REQUIRED AND LOAD THE    * 01050000
.*   ADDRESSES OF THE UPT, ECT, ECB, AND PARAMETER BLOCK INTO THE     * 01100000
.*   SERVICE ROUTINE PARAMETER LIST IF SPECIFIED. A LINK MACRO WILL   * 01150000
.*   BE GENERATED TO INVOKE THE STACK SERVICE ROUTINE UNLESS AN       * 01200000
.*   ENTRY POINT IS SPECIFIED. IF AN ENTRY POINT IS SPECIFIED, OR IF  * 01250000
.*   THE ENTRY POINT ADDR IS IN THE CVT, A BALR WILL BE GENERATED.    * 01300000
.*                                                                    * 01350000
.*ENTRY POINTS:                                                       * 01400000
.*   STACK MACRO CALL - ONLY ENTRY POINT.                             * 01450000
.*                                                                    * 01500000
.*INPUT:                                                              * 01550000
.*   PARAMETERS SPECIFIED IN THE STACK MACRO FORMAT.                    01600000
.*                                                                    * 01700000
.*OUTPUT:                                                             * 01750000
.*   IN THE L-FORM, A 5-WORD PARAMETER BLOCK CONSISTING OF CONTROL    * 01800000
.*   WHICH IS SET BY THE MACRO, THE ADDRESS OF THE STORAGE LIST       * 01850000
.*   SOURCE DESCRIPTOR, AND THE ADDR OF AN INPUT AND OUTPUT DD NAME.  * 01900000
.*   IN THE E-FORM, CODE WHICH RESETS CONTROL IN THE PARAMETER BLOCK, * 01950000
.*   PLACES THE ADDRESSES OF THE SERVICE ROUTINE PARAMETER BLOCK,     * 02000000
.*   UPT, ECT, AND ECB IN THE SERVICE ROUTINE PARAMETER LIST AS       * 02050000
.*   SPECIFIED, AND INVOKES THE SERVICE ROUTINE.                      * 02100000
.*                                                                    * 02150000
.*EXTERNAL REFERENCES:                                                * 02200000
.*   LINK MACRO.                                                      * 02250000
.*                                                                    * 02300000
.*EXITS,NORMAL:                                                       * 02350000
.*   IN THE L-FORM, RETURN TO CALLER.                                 * 02400000
.*   IN THE E-FORM, CODE IS GENERATED TO INVOKE THE STACK SERVICE     * 02450000
.*   ROUTINE ACCORDING TO THE STANDARD LINKAGE CONVENTIONS            * 02500000
.*                                                                    * 02600000
.*EXITS,ERROR:                                                        * 02650000
.*   INVALID INPUT.                                                   * 02700000
.*                                                                    * 02750000
.*TABLES/WORK AREAS:                                                  * 02800000
.*   SERVICE ROUTINE PARAMETER LIST - A TABLE OF POINTERS TO THE UPT, * 02850000
.*   ECT, ECB, AND SERVICE ROUTINE PARAMETER BLOCK.                   * 02900000
.*   SERVICE ROUTINE PARAMETER BLOCK - A CONTROL TABLE SET ACCORDING  * 02950000
.*   TO THE SPECIFIED MACRO PARAMETERS AND THE ADDRESS OF THE STORAGE * 03000000
.*   LIST SOURCE DESCRIPTOR.                                          * 03050000
.*                                                                    * 03100000
.*ATTRIBUTES:                                                         * 03150000
.*   SERIALLY REUSABLE.                                               * 03200000
.*                                                                    * 03250000
.*NOTES:                                                              * 03300000
.*   CURRENT RELEASE :                                                * 03350000
.*      TSO/E RELEASE 5                                       @E1502C1* 03400000
.*   PREVIOUS RELEASE DATES :                                         * 03450000
.*      09/1/86                                               @E2367I5* 03460000
.*      02/15/74                                                      * 03470000
.*      03/15/73                                                      * 03480000
.*      01/22/70                                                      * 03490000
.*      12/12/69                                                      * 03500000
.*      10/22/69                                                      * 03550000
.*                                                                    * 03600000
.*                                                                    * 03650000
.*CHANGE ACTIVITY                                                     * 03655500
.*               C 000000-999999                               Y30PQJM* 03661000
.* A069250   CLEAR CODE BYTES                                 @ZA75363* 03666500
.*        REMOVE FIX FOR APAR OZ75363                         @ZA82490* 03672000
.* E2367I5   TSO/E RELEASE 3 SUPPORT FOR RUNNING CLISTS THROUGH       * 03677500
.*           THE TSO SERVICE FACILITY. THESE CHANGES SUPPORT THREE    * 03683000
.*           NEW FUNCTIONS THAT THE STACK SERVICE ROUTINE WILL PROVIDE* 03688500
.*           FOR TSF/CLIST. THEY ARE:                                 * 03694000
.*                                                                    * 03700000
.*                STACK BARRIER=*                                     * 03710000
.*                STACK DELETE=BARRIER                                * 03720000
.*                STACK INQUIRE=ATTN                                  * 03730000
.*                STACK INQUIRE=ERROR                                 * 03740000
.*                                                                    * 03750000
.*           SEE THE STACK SERVICE ROUTINE FOR FURTHER DESCRIPTIONS   * 03752900
.*           OF THESE NEW FUNCTIONS.                                  * 03755800
.*                                                                    * 03758700
.*  @PBY0239   TSO/E RELEASE 3 SUPPORT FOR RUNNING CLIST THROUGH THE  * 03761600
.*             TSO SERVICE FACILITY. THESE CHANGES SUPPORT THE NEW    * 03764500
.*             STACK FUNCTIONS OF "BARRIER=*" AND "DELETE=BARRIER".   * 03767400
.*                                                                    * 03770300
.*             SEE THE STACK SERVICE ROUTINE FOR FURTHER DESCRIPTION  * 03773200
.*             OF THIS NEW OPTION.                            @PBY0239* 03776100
.*                                                                    * 03779000
.*  @E1402S4   TSO/E RELEASE 4 - ADD THE INQUIRE=TYPE FUNCTION        * 03781900
.*                                                            @E1402S4* 03784800
.*  @E1502C1   TSO/E RELEASE 2.1-ADD THE ENVIRON FUNCTION     @E1502C1* 03787700
.*  @PEI0852   TSO/E RELEASE 2.1.0 - ADD ENVIRON=RESET        @PEI0852* 03790600
.*             (XA PTM IS PFZ0428)                            @PEI0852* 03793500
.*  @OY37640   ADD BARRIER=NONEST PARAMETER                   @YA37640* 03796400
.*                                                                    * 03800000
.********************************************************************** 03850000
         LCLA  &A,&NUM                                                  03880000
         LCLB  &PROC,&CLOSE,&INDD,&OUTDD,&PROMPT,&LIST,&CNTL,&SEQ       03910000
         LCLB  &MEMBR                                                   03940000
         LCLC  &C,&DDOUT,&DDIN,&MEMAD                                   03970000
         AIF   (T'&MF EQ 'O').ERR1           NO MF PARAMETER            04000000
         AIF   (N'&SYSLIST EQ 0).MF1   POSITIONAL PARAMETERS INVALID    04050000
         AIF   (T'&SYSLIST(1) NE 'O' OR N'&SYSLIST NE 1).ERR6           04100000
.MF1     AIF   ('&MF' EQ 'L').L0        BRANCH ON LIST FORM   @E1502C1* 04150000
.********************************************************************** 04200000
.*                                                                    * 04250000
.*                               EXECUTE FORM                         * 04300000
.*                                                                    * 04350000
.********************************************************************** 04400000
         AIF   ('&MF(1)' NE 'E').ERR1                                   04450000
         AIF   (T'&NAME EQ 'O').E1                                      04500000
&NAME    DS    0H                                                       04550000
.E1      AIF   (T'&MF(2) EQ 'O').ERR1                                   04600000
         AIF   ('&MF(2)' EQ '(1)').E2                                   04650000
         AIF   ('&MF(2)'(1,1) EQ '(').WARN3                             04700000
.E1A     LA    1,&MF(2)       LOAD PARM LIST ADDR                       04750000
.E2      AIF   (T'&UPT EQ 'O').E3       UPT OMITTED                     04800000
         AIF   ('&UPT'(1,1) EQ '(').E2A                                 04850000
         LA    14,&UPT        LOAD UPT ADDR                             04900000
         ST    14,0(0,1)     STORE UPT ADDR                             04950000
         AGO   .E3                                                      05000000
.E2A     ANOP                                                           05050000
&A       SETA  K'&UPT-2                                                 05100000
&C       SETC  '&UPT'(2,&A)                                             05150000
         ST    &C,0(0,1)     STORE UPT ADDR IN PARM LIST                05200000
.E3      AIF   (T'&ECT EQ 'O').E4     ECT OMITTED                       05250000
         AIF   ('&ECT'(1,1) EQ '(').E3A                                 05300000
         LA    14,&ECT                  LOAD ECT ADDR                   05350000
         ST    14,4(0,1)               STORE ECT ADDR IN PARM LIST      05400000
         AGO   .E4                                                      05450000
.E3A     ANOP                                                           05500000
&A       SETA  K'&ECT-2                                                 05550000
&C       SETC  '&ECT'(2,&A)                                             05600000
         ST    &C,4(0,1)               STORE ECT ADDR IN PARM LIST      05650000
.E4      AIF   (T'&ECB EQ 'O').E5       ECB OMITTED                     05700000
         AIF   ('&ECB'(1,1) EQ '(').E4A                                 05750000
         LA    14,&ECB        LOAD ECB ADDR                             05800000
         ST    14,8(0,1)     STORE ECB ADDR IN PARM LIST                05850000
         AGO   .E5                                                      05900000
.E4A     ANOP                                                           05950000
&A       SETA  K'&ECB-2                                                 06000000
&C       SETC  '&ECB'(2,&A)                                             06050000
         ST    &C,8(0,1)     STORE ECB ADDR IN PARM LIST                06100000
.E5      AIF   (T'&PARM EQ 'O').E5B     PARM OMITTED                    06150000
         AIF   ('&PARM'(1,1)  EQ '(').E5A                               06200000
         LA    14,&PARM       LOAD PARM ADDR                            06250000
         ST    14,12(0,1)    STORE PARM ADDR IN PARM LIST               06300000
         AGO   .E6                                                      06350000
.E5A     ANOP                                                           06400000
&A       SETA  K'&PARM-2                                                06450000
&C       SETC  '&PARM'(2,&A)                                            06500000
         ST    &C,12(0,1)    STORE PARM ADDR IN PARM LIST               06550000
         AIF   (T'&TERM EQ 'O' AND N'&STORAGE EQ 0 AND T'&DELETE       *06587500
               EQ 'O' AND N'&DATASET EQ 0 AND T'&INQUIRE EQ 'O' AND    *06625000
               T'&BARRIER EQ 'O' AND T'&ENVIRON EQ 'O').E12    @E1502C1 06662500
         LR    14,&C          LOAD PARM ADDR                            06700000
         AGO   .E6                                                      06750000
.E5B     AIF   (T'&TERM EQ 'O' AND N'&STORAGE EQ 0   AND T'&DELETE     *06800000
               EQ 'O' AND N'&DATASET EQ 0 AND T'&INQUIRE EQ 'O' AND    *06833300
               T'&BARRIER EQ 'O' AND T'&ENVIRON EQ 'O').E12    @E1502C1 06866600
         L     14,12(0,1)     LOAD PARM BLOCK ADDR INTO REGISTER        06900000
.E6      AIF   (T'&TERM EQ 'O' AND N'&STORAGE EQ 0   AND T'&DELETE     *06950000
               EQ 'O' AND N'&DATASET EQ 0 AND T'&INQUIRE EQ 'O' AND    *06953200
               T'&BARRIER EQ 'O' AND T'&ENVIRON EQ 'O').E12    @E1502C1 06956400
         AIF   (T'&BARRIER EQ 'O').E6A  BARRIER OMITTED        @PBY0239 06959600
         AIF   (T'&TERM NE 'O' OR N'&STORAGE NE 0 OR T'&DELETE NE 'O'  *06962800
               OR N'&DATASET NE 0 OR T'&INQUIRE NE 'O' OR              *06966000
               T'&ENVIRON NE 'O').ERR3                         @YA37640 06969200
         AIF   ('&BARRIER' NE 'NONEST').E61                    @YA37640 06972400
         MVI   0(14),X'80'             BARRIER=NONEST          @YA37640 06975600
         MVI   1(14),X'80'             SET OPERATION AND       @YA37640 06978800
         MVI   2(14),X'88'             CODE FIELDS             @YA37640 06982000
         AGO   .E12                                            @YA37640 06985200
.E61     AIF   ('&BARRIER' NE '*').ERR11 INVALID PARAMETER     @YA37640 06988400
         MVI   0(14),X'80'             BARRIER=* SPECIFIED     @PBY0239 06991600
         MVI   1(14),X'80'             SET OPERATION AND       @PBY0239 06994800
         MVI   2(14),X'80'             CODE FIELDS             @PBY0239 06998000
         AGO   .E12                                            @E1502C1 07001200
.E6A     ANOP                                                  @PBY0239 07004400
         AIF   (T'&INQUIRE EQ 'O').E7   INQUIRE OMITTED        @E2367I5 07007600
         AIF   (T'&TERM NE 'O' OR T'&DELETE NE 'O'                     *07010800
               OR N'&DATASET NE 0 OR N'&STORAGE NE 0 OR                *07014000
               T'&ENVIRON NE 'O').ERR3                         @E1502C1 07017200
         AIF   ('&INQUIRE' NE 'ATTN').E6B                      @PBY0239 07020400
         MVI   0(14),X'04'             INQUIRE=ATTN SPECIFIED  @E2367I5 07023600
         AGO   .E12                                            @E1502C1 07026800
.E6B     AIF   ('&INQUIRE' NE 'ERROR').E6C                     @E1402S4 07030000
         MVI   0(14),X'02'             INQUIRE=ERROR SPECIFIED @E2367I5 07033200
         AGO   .E12                                            @E1502C1 07036400
.E6C     AIF   ('&INQUIRE' NE 'TYPE').ERR10                    @E1402S4 07039600
         MVI   0(14),X'01'             INQUIRE=TYPE SPECIFIED  @E1402S4 07042800
         AGO   .E12                                            @E1502C1 07046000
.E7      AIF   (T'&TERM EQ 'O').E8      TERM OMITTED                    07050000
         AIF   (N'&STORAGE NE 0   OR T'&DELETE NE 'O'                  *07083300
               OR N'&DATASET NE 0 OR T'&ENVIRON NE 'O').ERR3   @E1502C1 07116600
         AIF   ('&TERM' NE '*').ERR4                                    07150000
         MVI   0(14),X'80'         SET OPERATION FIELD                  07200000
         MVI   1(14),X'80'         SET CODE FIELD                       07250000
         AGO   .E12                                            @E1502C1 07300000
.E8      AIF   (N'&STORAGE EQ 0).E9          STORAGE OMITTED            07350000
         AIF   (T'&TERM NE 'O' OR T'&DELETE NE 'O'                     *07383300
               OR N'&DATASET NE 0 OR T'&ENVIRON NE 'O').ERR3   @E1502C1 07416600
         MVI   0(14),X'80'         SET OPERATION FIELD                  07450000
         AIF   ('&STORAGE' EQ '()').E8E      ALL OPERANDS OMITTED       07500000
&A       SETA  N'&STORAGE                                               07550000
         AIF   (&A GT 3).ERR2           TOO MANY OPERANDS               07600000
         AIF   (&A EQ 1 OR T'&STORAGE(2) EQ 'O').E8E   LSD ADDR ONLY    07650000
.E8B     AIF   ('&STORAGE(2)' NE 'PROCN').E8C                           07700000
         MVI   1(14),X'42'         SET CODE FIELD                       07750000
         AGO   .E8D1                                                    07800000
.E8C     AIF   ('&STORAGE(2)' NE 'PROCL').E8D                           07850000
         MVI   1(14),X'43'         SET CODE FIELD                       07900000
         AGO   .E8D1                                                    07910000
.E8D1    AIF   (&A NE 3).E8F                                            07920000
         AIF   ('&STORAGE(3)' NE 'PROMPT').ERR9                         07930000
         OI    1(14),B'00000100'                                        07940000
         AGO   .E8F                                                     07950000
.E8D     AIF   ('&STORAGE(2)' NE 'SOURCE').ERR2                         08000000
.E8E     MVI   1(14),X'40'         SET CODE FIELD                       08050000
.E8F     AIF   (T'&STORAGE(1) EQ 'O' OR '&STORAGE' EQ '()').WARN1       08100000
         AIF   ('&STORAGE(1)'(1,1) EQ '(').E8G                          08150000
         LA    0,&STORAGE(1)       LOAD STORAGE SOURCE DESCRIPTOR ADDR  08200000
         ST    0,4(0,14)          STORE STORAGE SOURCE DESCRIPTOR ADDR  08250000
         AGO   .E12                                           @E1502C1  08300000
.E8G     ANOP                                                           08350000
&A       SETA  K'&STORAGE(1)-2                                          08400000
&C       SETC  '&STORAGE(1)'(2,&A)                                      08450000
         ST    &C,4(0,14)         STORE STORAGE SOURCE DESCRIPTOR ADDR  08500000
         AGO   .E12                                         @E1502C1    08550000
.E9      AIF   (T'&DELETE EQ 'O').E10        DELETE OMITTED             08600000
         AIF   (T'&TERM NE 'O' OR N'&STORAGE NE 0                      *08633300
               OR N'&DATASET NE 0 OR T'&ENVIRON NE 'O').ERR3 @E1502C1   08666600
.E9A     AIF   ('&DELETE' NE 'TOP').E9B                                 08700000
         MVI   0(14),X'40'    SET OPERATION FIELD                       08750000
         AGO   .E12                                          @E1502C1   08800000
.E9B     AIF   ('&DELETE' NE 'PROC').E9C                                08850000
         MVI   0(14),X'20'    SET OPERATION FIELD                       08900000
         AGO   .E12                                          @E1502C1   08950000
.E9C     AIF   ('&DELETE' NE 'ALL').E9D                      @E2367I5   09000000
         MVI   0(14),X'10'    SET OPERATION FIELD                       09050000
         AGO   .E12                                          @E1502C1   09053000
.E9D     AIF   ('&DELETE' NE 'BARRIER').ERR5                 @PBY0239   09056000
         MVI   0(14),X'08'    SET OPERATION FIELD            @E2367I5   09059000
         AGO   .E12                                          @E1502C1   09062000
.E10     AIF   (T'&DATASET EQ 'O').E11   DATASET OMITTED                09065000
         AGO   .DD0          GO TO DATASET PARSE ROUTINE                09068000
.RETURNE ANOP                RETURN POINT FROM PARSE ROUTINE            09071000
         MVI   0(14),X'80'              SET OPERATION FIELD             09074000
         MVI   1(14),B'10&INDD.&OUTDD.0&PROMPT.&PROC.&LIST.' OPTION     09077000
         MVI   3(14),B'0000&MEMBR.&SEQ.&CNTL.&CLOSE.'  SET CLOSE OPTION 09080000
.E106    AIF   (&MEMBR NE 1).E108B                                      09083000
         AIF   ('&MEMAD'(1,1) EQ '(').E108RR                            09086000
         LA    0,&MEMAD                                                 09089000
&MEMAD   SETC  '0'                                                      09092000
         AGO   .E108AA                                                  09095000
.E108RR  ANOP                                                           09098000
&MEMAD   SETC   '&MEMAD'(2,K'&MEMAD-2)                                  09101000
.E108AA  ST    &MEMAD,16(0,14)              STORE MEMBER NAME ADDR      09104000
.E108B   AIF   (&INDD EQ B'0').E10AA1   INDD NOT SPECIFIED              09107000
         AIF   ('&DDIN'(1,1) EQ '(').E10RR1  INDD IN A REGISTER         09110000
         LA    0,&DDIN         LOAD ADDRESS OF INPUT DDNAME             09113000
&DDIN    SETC  '0'                                                      09116000
         AGO   .E10RX1        GO TO STORE INSTRUNCTION                  09119000
.E10RR1  ANOP                                                           09122000
&DDIN    SETC  '&DDIN'(2,(K'&DDIN-2))   STRIP PARENS FROM REGISTER      09125000
.E10RX1  ST    &DDIN,8(0,14)       STORE ADDRESS OF INPUT DDNAME        09128000
.E10AA1  AIF   (&OUTDD EQ B'0').E10AA2   OUTDD NOT SPECIFIED            09131000
         AIF   ('&DDOUT'(1,1) EQ '(').E10RR2   OUTDD IN A REGISTER      09134000
         LA    0,&DDOUT       LOAD ADDRESS OF OUTPUT DDNAME             09137000
&DDOUT   SETC  '0'                                                      09140000
         AGO   .E10RX2        GO TO STORE INSTRUCTION                   09143000
.E10RR2  ANOP                                                           09146000
&DDOUT   SETC  '&DDOUT'(2,(K'&DDOUT-2))  STRIP PARENS FROM REGISTER     09149000
.E10RX2  ST    &DDOUT,12(0,14) STORE ADDRESS OF OUTPUT DDNAME           09152000
.E10AA2  ANOP                                                           09155000
.E11     AIF   (T'&ENVIRON EQ 'O').E12   ENVIRON WAS OMITTED  @E1502C1  09158000
         AIF   ('&ENVIRON' NE 'CREATE').E11A                  @E1502C1  09161000
         MVI   0(14),X'00'             ZEROED OUT FIRST BYTE  @E1502C1  09164000
         MVI   2(14),X'40'             SET OPERATION FIELD    @E1502C1  09167000
         AGO   .E12                                           @E1502C1  09170000
.E11A    AIF   ('&ENVIRON' NE 'DESTROY').E11B                 @PEI0852  09173000
         MVI   0(14),X'00'           ZEROED OUT FIRST BYTE    @E1502C1  09176000
         MVI   2(14),X'20'           SET OPERATION FIELD      @E1502C1  09179000
         AGO   .E12                                           @PEI0852  09182000
.E11B    AIF   ('&ENVIRON' NE 'RESET').ERR12                  @PEI0852  09185000
         MVI   0(14),X'00'          ZERO OUT FIRST BYTE       @PEI0852  09188000
         MVI   2(14),X'10'          ENVIRON=RESET SPECIFIED   @PEI0852  09191000
.E12     AIF   (T'&ENTRY EQ 'O').E13      ENTRY POINT OMITTED @E1502C1  09194000
         AIF   ('&ENTRY' EQ '(15)').E12B                      @E1502C1  09197000
         AIF   ('&ENTRY'(1,1) EQ '(').WARN4                             09200000
.E12A    LA    15,&ENTRY      LOAD EP ADDR                    @E1502C1  09250000
.E12B    BALR  14,15     BRANCH TO SERVICE ROUTINE            @E1502C1  09300000
         MEXIT                                                          09350000
.E13     L     15,16(0,0)          LOAD CVT POINTER           @E1502C1  09361100
         TM    472(15),B'10000000'   IS STACK ADDR HERE ?               09372200
         BNO   IKJ@&SYSNDX          NO- BRANCH TO LINK                  09383300
         L     15,472(15)            YES- BALR TO STACK                 09394400
         BALR  14,15                                                    09405500
         B     IKJ$&SYSNDX         BRANCH AROUND LINK                   09416600
IKJ@&SYSNDX LINK  EP=IKJSTCK          LINK TO STACK                     09427700
IKJ$&SYSNDX DS    0H                                                    09438800
         MEXIT                                                          09450000
.********************************************************************** 09500000
.*                                                                    * 09550000
.*                                 LIST FORM                          * 09600000
.*                                                                    * 09650000
.********************************************************************** 09700000
.L0      AIF   (T'&ENVIRON EQ 'O').L1  ENVIRON WAS OMITTED    @E1502C1* 09704600
         AIF   (T'&TERM NE 'O' OR N'&STORAGE NE 0 OR T'&DELETE NE 'O'  *09709200
               OR N'&DATASET NE 0 OR T'&INQUIRE NE 'O' OR              *09713800
               T'&BARRIER NE 'O').ERR3                         @E1502C1 09718400
         AIF   ('&ENVIRON' NE 'CREATE').L0A                    @E1502C1 09723000
&NAME    DC    X'00004000'        SET OPERATION FIELD          @E1502C1 09727600
         DC    5A(0)     STORAGE SOURCE DESCRIPTOR ADDRESS     @E1502C1 09732200
         MEXIT                                                 @PBY0239 09736800
.L0A     AIF   ('&ENVIRON' NE 'DESTROY').L0B                   @PEI0852 09741400
&NAME    DC    X'00002000'                                     @E1502C1 09746000
         DC    5A(0)     STORAGE SOURCE DESCRIPTOR ADDRESS     @E1502C1 09750600
         MEXIT                                                 @PBY0239 09755200
.L0B     AIF   ('&ENVIRON' NE 'RESET').ERR12                   @PEI0852 09759800
&NAME    DC    X'00001000'          ENVIRON=RESET SPECIFIED    @PEI0852 09764400
         DC    5A(0)     STORAGE SOURCE DESCRIPTOR ADDRESS     @E1502C1 09769000
         MEXIT                                                 @PBY0239 09773600
.L1      DS    0F                                              @E1502C1 09778200
         AIF   (T'&BARRIER EQ 'O').L2    BARRIER OMITTED       @PBY0239 09782800
         AIF   (T'&TERM NE 'O' OR N'&STORAGE NE 0 OR T'&DELETE NE 'O'  *09787400
               OR N'&DATASET NE 0 OR T'&INQUIRE NE 'O').ERR3   @YA37640 09792000
         AIF   ('&BARRIER' NE 'NONEST').L1A                    @YA37640 09796600
&NAME    DC    X'80808800'        SET OPERATION FIELD          @YA37640 09801200
         DC    5A(0)     STORAGE SOURCE DESCRIPTOR ADDRESS     @YA37640 09805800
         MEXIT                                                 @YA37640 09810400
.L1A     AIF   ('&BARRIER' NE '*').ERR11 INVALID PARAMETER     @YA37640 09815000
&NAME    DC    X'80808000' SET OPERATION AND CODE FIELDS       @YA37640 09819600
         DC    5A(0)       STORAGE SOURCE DESCRIPTOR ADDR      @E1502C1 09824200
         MEXIT                                                 @PBY0239 09828800
.*                                                                      09833400
.*                                                                      09838000
.L2      AIF   (T'&TERM EQ 'O').L2A     TERM OMITTED           @E2367I5 09842600
         AIF   ('&TERM' NE '*').ERR4                                    09850000
         AIF   (N'&STORAGE NE 0   OR T'&DELETE NE 'O'                  *09883300
               OR N'&DATASET NE 0 OR T'&INQUIRE NE 'O').ERR3   @E2367I5 09916600
&NAME    DC    X'80800000'         SET OPERATION AND CODE FIELDS        09950000
         DC    5A(0)      STORAGE SOURCE DESCRIPTOR ADDR       @E1502C1 10000000
         MEXIT                                                          10050000
.L2A     AIF   (T'&INQUIRE EQ 'O').L3   INQUIRE OMITTED        @E2367I5 10053800
         AIF   (N'&STORAGE NE 0   OR T'&DELETE NE 'O'                  *10057600
               OR N'&DATASET NE 0).ERR3                        @E2367I5 10061400
         AIF   ('&INQUIRE' NE 'ATTN').L2B                      @E2367I5 10065200
&NAME    DC    X'04000000'             INQUIRE=ATTN SPECIFIED  @E2367I5 10069000
         AGO   .L3E                                            @E2367I5 10072800
.L2B     AIF   ('&INQUIRE' NE 'ERROR').L2C                     @E1402S4 10076600
&NAME    DC    X'02000000'             INQUIRE=ERROR SPECIFIED @E2367I5 10080400
         AGO   .L3E                                            @E2367I5 10084200
.L2C     AIF   ('&INQUIRE' NE 'TYPE').ERR10                    @E1402S4 10088000
&NAME    DC    X'01000000'             INQUIRE=TYPE SPECIFIED  @E1402S4 10091800
         AGO   .L3E                                            @E1402S4 10095600
.L3      AIF   (T'&DELETE EQ 'O').L4    DELETE OMITTED                  10100000
         AIF   (T'&TERM NE 'O' OR N'&STORAGE NE 0                      *10133300
               OR N'&DATASET NE 0).ERR3                                 10166600
.L3A     AIF   ('&DELETE' NE 'TOP').L3B                                 10200000
&NAME    DC    X'40000000'         SET OPERATION AND CODE FIELDS        10250000
         AGO   .L3E                                            @E2367I5 10300000
.L3B     AIF   ('&DELETE' NE 'PROC').L3C                                10350000
&NAME    DC    X'20000000'         SET OPERATION AND CODE FIELDS        10400000
         AGO   .L3E                                            @E2367I5 10450000
.L3C     AIF   ('&DELETE' NE 'ALL').L3D                                 10500000
&NAME    DC    X'10000000'         SET OPERATION AND CODE FIELDS        10550000
         AGO   .L3E                                            @E2367I5 10570000
.L3D     AIF   ('&DELETE' NE 'BARRIER').ERR5                   @PBY0239 10590000
&NAME    DC    X'08000000'   SET OPERATION AND CODE FIELDS     @E2367I5 10610000
.L3E     DC    5A(0)      STORAGE SOURCE DESCRIPTOR ADDR       @E1502C1 10630000
         MEXIT                                                          10650000
.L4      AIF   (N'&STORAGE EQ 0).L5     NO STORAGE OPERANDS             10700000
         AIF   (N'&DATASET NE 0).ERR3                          @E2367I5 10750000
         AIF   ('&STORAGE' EQ '()').L4E      ALL OPERANDS OMITTED       10800000
&A       SETA  N'&STORAGE                                               10850000
&LIST    SETB  0                                                        10866600
&PROMPT  SETB  0                                                        10883200
         AIF   (&A EQ 1 OR T'&STORAGE(2) EQ 'O').L4E   LSD ADDR ONLY    10900000
.L4B     AIF   ('&STORAGE(2)' NE 'PROCN').L4C                           10950000
         AGO   .L4D1                                                    10972700
.L4C     AIF   ('&STORAGE(2)' NE 'PROCL').L4D1                          10995400
&LIST    SETB  1                                                        11018100
.L4D1    AIF   (&A LT 3).L4D2                                           11040800
         AIF   ('&STORAGE(3)' NE 'PROMPT').ERR9                         11063500
&PROMPT  SETB  1                                                        11086200
.L4D2    ANOP                                                           11108900
&NAME    DC    X'80'                                                    11131600
         DC    B'01000&PROMPT.1&LIST.'                                  11154300
         DC    X'0000'                                                  11177000
         AGO   .L4F                                                     11200000
.L4D     AIF   ('&STORAGE(2)' NE 'SOURCE').ERR2                         11250000
.L4E     ANOP                                                           11300000
&NAME    DC    X'80400000'         SET OPERATION AND CODE FIELDS        11350000
.L4F     AIF   (T'&STORAGE(1) EQ 'O' OR '&STORAGE' EQ '()').WARN2       11400000
         DC    A(&STORAGE(1))      STORAGE SOURCE DESCRIPTOR ADDR       11450000
         DC    4A(0)                                          @E1502C1  11475000
         MEXIT                                                          11500000
.L5      AIF   (T'&DATASET EQ 'O').L6  IF DATASET OPERAND OMITTED       11507100
         AGO   .DD0      GO PARSE DATASET OPERANDS                      11514200
.RETURNL ANOP      RETURN POINT FROM DATASET PARSE                      11521300
&NAME    DC    X'80'     SET OPERATION FIELD                            11528400
         DC    B'10&INDD.&OUTDD.0&PROMPT.&PROC.&LIST.' OPTION           11535500
         DC    X'00'                                                    11542600
         DC    B'0000&MEMBR.&SEQ.&CNTL.&CLOSE.'   SET CLOSE OPTION      11549700
         DC    A(0)     ADDRESS OF LSD                                  11556800
         DC    A(&DDIN.)    ADDRESS OF DDNAME                           11563900
         DC    A(&DDOUT.)   ADDRESS OF DDNAME                           11571000
         DC    A(&MEMAD.)   ADDRESS OF MEMBERNAME                       11578100
         MEXIT                                                          11585200
.L6      ANOP                                                           11592300
&NAME    DC    X'00000000'         SET OPERATION AND CODE FIELDS        11600000
         DC    5A(0)      STORAGE SOURCE DESCRIPTOR ADDR      @E1502C1  11650000
         MEXIT                                                          11700000
.DD0     ANOP                                                           11700900
&DDIN    SETC  '0'                                                      11701800
&DDOUT   SETC  '0'                                                      11702700
&MEMAD   SETC  '0'                                                      11703600
&MEMBR   SETB  0                                                        11704500
&PROC    SETB  0                                                        11705400
&PROMPT  SETB  0                                                        11706300
&CLOSE   SETB  0                                                        11707200
&LIST    SETB  0                                                        11708100
&INDD    SETB  0                                                        11709000
&OUTDD   SETB  0                                                        11709900
&SEQ     SETB  0                                                        11710800
&CNTL    SETB  0                                                        11711700
         AIF   (T'&TERM NE 'O' OR T'&STORAGE NE 'O' OR                 *11712600
               T'&DELETE NE 'O').ERR3                                   11713500
&NUM     SETA  N'&DATASET                                               11714400
         AIF   (&NUM EQ 0).DD7                                          11715300
.DD1     AIF   (&NUM NE 1 OR '&DATASET(&NUM)' NE 'CLOSE').DD2           11716200
&CLOSE   SETB  1                                                        11717100
         AGO   .DD7                                                     11718000
.DD2     AIF   ('&DATASET(&NUM)' EQ '*').DD7                            11718900
.DD3     AIF   ('&DATASET(&NUM)' NE 'PROMPT').DD4A                      11719800
&PROMPT  SETB  1                                                        11720700
         AGO   .DD7                                                     11721600
.DD4A    AIF   ('&DATASET(&NUM)' NE 'CNTL').DD4B                        11722500
&CNTL    SETB  1                                                        11723400
         AGO   .DD7                                                     11724300
.DD4B    AIF   ('&DATASET(&NUM)' NE 'LIST').DD5                         11725200
&LIST    SETB  1                                                        11726100
         AGO   .DD7                                                     11727000
.DD5     AIF   ('&DATASET(&NUM)'(1,5) NE 'INDD=').DD5B                  11727900
&INDD    SETB  1                                                        11728800
&PROC    SETB  1                                                        11729700
&DDIN    SETC  '&DATASET(&NUM)'(6,(K'&DATASET(&NUM)-5))                 11730600
         AGO   .DD7                                                     11731500
.DD5B    AIF    ('&DATASET(&NUM)'(1,7) NE 'MEMBER=').DD6                11732400
&MEMBR   SETB   1                                                       11733300
&MEMAD   SETC   '&DATASET(&NUM)'(8,(K'&DATASET(&NUM)-6))                11734200
         AGO     .DD7                                                   11735100
.DD6     AIF   ('&DATASET(&NUM)'(1,6) NE 'OUTDD=').DD65                 11736000
&OUTDD   SETB  1                                                        11736900
&PROC    SETB  1                                                        11737800
&DDOUT   SETC  '&DATASET(&NUM)'(7,(K'&DATASET(&NUM)-6))                 11738700
         AGO   .DD7                                                     11739600
.DD65    AIF   ('&DATASET(&NUM)' NE 'SEQ').ERR7                         11740500
&SEQ     SETB  1                                                        11741400
.DD7     ANOP                                                           11742300
&NUM     SETA  &NUM-1                                                   11743200
         AIF   (&NUM GT 0).DD2                                          11744100
         AIF   ('&MF' EQ 'L').RETURNL                                   11745000
         AGO   .RETURNE                                                 11745900
.WARN1   MNOTE 0,'FIRST STORAGE OPERAND IS ASSUMED TO BE IN PARM BLOCK' 11750000
         AGO   .E10                                                     11800000
.WARN2   MNOTE 0,'FIRST STORAGE OPERAND IS OMITTED'                     11850000
         DC    5A(0)           STORAGE SOURCE DESCRIPTOR ADDR @E1502C1  11900000
         MEXIT                                                          11950000
.WARN3   MNOTE 0,'PARAMETER LIST ADDR IN MF PARAMETER IS NOT IN REG 1'  12000000
         AGO   .E1A                                                     12050000
.WARN4   MNOTE 0,'ENTRY POINT ADDR IN ENTRY PARAMETER IS NOT IN REG 15' 12100000
         AGO   .E12A                                          @E1502C1  12150000
.ERR1    MNOTE 8,'INVALID OR OMITTED MF PARAMETER'                      12200000
         MEXIT                                                          12250000
.ERR2    MNOTE 8,'INVALID STORAGE PARAMETER OPERAND'                    12300000
         MEXIT                                                          12350000
.ERR3    MNOTE 8,'TERM, BARRIER, DELETE, ENVIRON, INQUIRE, STORAGE, AND*12380000
                DATASET ARE MUTUALLY EXCLUSIVE -- CODE ONLY ONE OF THES*12410000
               E OPTIONS'                                               12440000
.*                                                             @YA37640 12470000
.ERR4    MNOTE 8,'INVALID TERM OPERAND'                                 12500000
         MEXIT                                                          12550000
.ERR5    MNOTE 8,'INVALID DELETE OPERAND -- USE TOP, ALL, PROC, OR TSFL*12583300
               EVEL ONLY'                                               12616600
         MEXIT                                                          12650000
.ERR6    MNOTE 8,'POSITIONAL PARAMETERS ARE INVALID'                    12700000
         MEXIT                                                          12750000
.ERR7    MNOTE 8,'INVALID DATASET PARAMETER'                            12753100
         MEXIT                                                          12756200
.ERR9    MNOTE 8,'PROCN OR PROCP SPECIFIED AND KEYWORD OTHER THAN PROMP*12759300
               T FOUND'                                                 12762400
         MEXIT                                                          12765500
.ERR10   MNOTE 8,'INVALID INQUIRE PARAMETER -- USE ATTN, ERROR, OR TYPE*12768600
                ONLY'                                                   12771700
.*                                                             @E1402S4 12774800
         MEXIT                                                 @PBY0239 12777900
.ERR11   MNOTE 8,'INVALID BARRIER OPERAND - USE * OR NONEST ONLY'       12781000
.*                                                             @YA37640 12784100
         MEXIT                                                 @YA37640 12787200
.ERR12   MNOTE 8,'INVALID ENVIRON PARAMETER -- USE CREATE, DESTROY, OR *12790300
                RESET ONLY'                                    @PEI0852 12793400
         MEXIT                                                 @PBY0239 12796500
         MEND                                                           12800000
