*/*                                                                     00000800
*********************************************************************** 00001600
*PROPRIETARY V3 STATEMENT                                               00003800
*LICENSED MATERIALS - PROPERTY OF IBM                                   00006000
*"RESTRICTED MATERIALS OF IBM"                                          00008200
*5650-ZOS                                                               00011390
*Copyright IBM Corp. 1989,2013                                          00012380
*END PROPRIETARY V3 STATEMENT                                           00014800
.* STATUS = z/OS 1.13 DFSMS                                        @L2A 00015100
*                                                                       00015500
*    CHANGE ACTIVITY:                                                   00016200
* $L1=STIFF  ,HDZ1A10,110505,SJPLTX: STIFF SUPPORT                 @L1A 00016600
* $L2=64BIT,JDZ1D10,20100303,SVLJH: 64 bit message                 @L2A 00017000
* $L3=PDSEGENS,HDZ2210,20130115,SVLDM: PDSE Generations            @L3A 00017300
*********************************************************************** 00017600
         MACRO                                                          00020000
&NAME    STOW  &DCB,&AREA,&TYP                                          00040000
         GBLC  &SYSAM64    AMODE64=YES set by SYSSTATE macro       @L2A 00043300
         GBLC  &SYSASCE    ASCENV=AR or ANY set by SYSSTATE macro  @L2A 00046600
         SYSSTATE TEST     Test now macros are to expand           @L2A 00049900
         AIF   ('&SYSAM64' EQ 'YES').ERR4    GO IF AMODE64=YES     @L2A 00053200
         AIF   (('&SYSASCE' NE '') AND ('&SYSASCE' NE 'P')).ERR5   @L2A 00056500
         AIF   ('&DCB' EQ '').ERR1                                      00060000
.D1      AIF   ('&AREA' EQ '' AND '&TYP' NE 'I').ERR2                   00068000
.D2      AIF   ('&TYP' NE '' AND '&TYP' NE 'A' AND '&TYP' NE 'C' AND   *00076000
               '&TYP' NE 'D' AND '&TYP' NE 'R' AND '&TYP' NE 'I' AND   *00081300
               '&TYP' NE 'DISC' AND '&TYP' NE 'IFF' AND                *00087590
               '&TYP' NE 'DG' AND '&TYP' NE 'RG' AND                   *00088580
               '&TYP' NE 'RECOVERG').ERR3                          @L9A 00089570
         AIF   ('&DCB' EQ '' OR ('&AREA' EQ '' AND '&TYP' NE 'I')).MEND 00092000
&NAME    IHBINNRA &DCB,&AREA                                            00100000
         AIF   ('&TYP' EQ '' OR '&TYP' EQ 'A').ISVC                     00120000
         AIF   ('&TYP' EQ 'DISC').DISC                                  00125000
         AIF   ('&TYP' EQ 'IFF').IFF                               @L1A 00127500
         AIF   ('&TYP' EQ 'I').SR00                                     00130000
         AIF   ('&TYP' EQ 'DG').DG                                 @L3A 00132000
         AIF   ('&TYP' EQ 'RG').RG                                 @L3A 00134000
         AIF   ('&TYP' EQ 'RECOVERG').RECG                         @L3A 00136000
         AIF   ('&TYP' NE 'R').TSTD                                     00140000
         AGO   .LCR1                                                    00144400
.DISC    LR    15,0                     TO BE USED AS BASE REG          00148800
         STCM  1,B'0111',5(15)          STORE DCB ADR IN LIST           00153200
         XC    2(3,15),2(15)            CLEAR FUNC & RESERVED           00157600
         OI    2(15),X'80'              INDICATE TYPE DISC              00162000
         SR    1,1                      INDICATE LIST INPUT             00166400
         AGO   .ISVC                                                    00170800
.IFF     LR    15,0                     TO BE USED AS BASE REG     @L1A 00171400
         STCM  1,B'0111',5(15)          STORE DCB ADR IN LIST      @L1A 00172000
         XC    2(3,15),2(15)            CLEAR FUNC & RESERVED      @L1A 00172600
         OI    2(15),X'40'              INDICATE TYPE IFF          @L1A 00173200
         SR    1,1                      INDICATE LIST INPUT        @L1A 00173800
         AGO   .ISVC                                               @L1A 00174400
.RG      LR    15,0                     TO BE USED AS BASE REG     @L3A 00174500
         STCM  1,B'0111',5(15)          STORE DCB ADR IN LIST      @L3A 00174600
         XC    2(3,15),2(15)            CLEAR FUNC & RESERVED      @L3A 00174700
         OI    2(15),X'20'              INDICATE TYPE RG           @L3A 00174800
         SR    1,1                      INDICATE LIST INPUT        @L3A 00174900
         AGO   .ISVC                                               @L3A 00175000
.DG      LR    15,0                     TO BE USED AS BASE REG     @L3A 00175100
         STCM  1,B'0111',5(15)          STORE DCB ADR IN LIST      @L3A 00175200
         XC    2(3,15),2(15)            CLEAR FUNC & RESERVED      @L3A 00175300
         OI    2(15),X'10'              INDICATE TYPE DG           @L3A 00175400
         SR    1,1                      INDICATE LIST INPUT        @L3A 00175500
         AGO   .ISVC                                               @L3A 00175600
.RECG    LR    15,0                     TO BE USED AS BASE REG     @L3A 00175700
         STCM  1,B'0111',5(15)          STORE DCB ADR IN LIST      @L3A 00175800
         XC    2(3,15),2(15)            CLEAR FUNC & RESERVED      @L3A 00175900
         OI    2(15),X'08'              INDICATE TYPE RECG         @L3A 00176000
         SR    1,1                      INDICATE LIST INPUT        @L3A 00176100
         AGO   .ISVC                                               @L3A 00176200
.LCR1    LCR   1,1                      INDICATE TYPE R                 00177200
         AGO   .ISVC                                                    00180000
.SR00    SR    0,0                      NO PARMLIST FOR TYPE I          00186600
         AGO   .ISVC                                                    00193200
.TSTD    AIF   ('&TYP' NE 'D').TSTC                                     00200000
         LCR   0,0                      INDICATE TYPE D                 00220000
         AGO   .ISVC                                                    00240000
.TSTC    LCR   1,1                      INDICATE TYPE C                 00250000
         LCR   0,0                                                      00260000
.ISVC    SVC   21                       ISSUE STOW SVC                  00280000
         MEXIT                                                          00300000
.ERR1    IHBERMAC 6                                                     00320000
         AGO   .D1                                                      00340000
.ERR2    IHBERMAC 13                                                    00360000
         AGO   .D2                                                      00370000
.ERR3    IHBERMAC 48,,&TYP                                              00380000
         MEXIT                                                     @L2A 00430000
.ERR4    IGGERMAC 203,STOW    THE STOW MACRO DOES NOT SUPPORT      @L2A 00480000
         MEXIT                  SYSSTATE AMODE64=YES               @L2A 00530000
.ERR5    IGGERMAC 204,STOW    THE STOW MACRO DOES NOT SUPPORT      @L2A 00580000
         MEXIT                  SYSSTATE ASCENV=AR OR ANY          @L2A 00630000
.MEND    MEND                                                           40380000
* */%STOW: MACRO KEYS(0:1(DCB_NAME,DCB_ADDR),0:1(AREA_NAME,AREA_ADDR),  40430000
*                     RETCODE,RSNCODE,TYPE_STOW);                       40480000
* ANS('?'!!MACLABEL!!' STOWP '!!MACLIST!!MACKEYS!!';') RESCAN SKIP;     40549990
* %END STOW;                                                            40580000
