*    %GOTO MTABPRO  ; /* BEGIN COMMENT UNTIL LABLE MTABPRO              00050000
         MACRO                                                          00100000
         TCOMTAB                                                        00150000
.*/ %MTABPRO: ;                                                         00200000
*        %GOTO MTABLBL  ;                                               00250000
TCOM     DSECT                DSECT FOR TCOMTAB PREFIX AREA    @E2115B8 00300000
TCOMPREF DS    0F  -          TCOMTAB PREFIX                   @E2115B8 00350000
TCOMID   DS    CL8 -          TCOMTAB IDENTIFIER: 'TCOMTAB'    @E2115B8 00400000
TCOMPREL EQU   *-TCOMPREF     LENGTH OF TCOMTAB PREFIX         @E2115B8 00450000
         SPACE 1                                               @E2115B8 00500000
TCOMTAB  DSECT                                                          00550000
         SPACE 1                                                        00600000
*** Start of Specifications ******************************************* 00650000
*                                                                     * 00660000
***01* PROPRIETARY STATEMENT=                                         * 00700000
*****PROPRIETARY_STATEMENT********************************************* 00750000
*                                                                     * 00800000
*                                                                     * 00850000
*   LICENSED MATERIALS - PROPERTY OF IBM                              * 00900000
*   5650-ZOS COPYRIGHT IBM CORP. 1977, 2015                           * 01000000
*                                                                     * 01050000
*   STATUS= HTE77A0                                                   * 01100000
*                                                                     * 01150000
*****END_OF_PROPRIETARY_STATEMENT************************************** 01350000
*                                                                     * 01400000
*01* External Classification:                                         * 01410000
*02* DMTI: BASE                                                       * 01420000
*02* GUPI: FIELDS                                                     * 01430000
*          INBUF TPLPTR TSTECT TSTUPT                                 * 01440000
*01* End of External Classification:                                  * 01441000
*                                                                     * 01442000
* Descriptive name: Test Command Processor Communication Table        * 01450000
* Macro name: TCOMTAB                                                 * 01500000
* Acronym: TCOMTAB                                                    * 01550000
* Dsect name: TCOMTAB                                                 * 01600000
* Component: TSO/E TEST (28503)                                       * 01650000
* Eye catcher: TCOMTAB                                                * 01700000
*         offset: 0                                                   * 01750000
*         length: 8                                                   * 01800000
* Storage attributes:                                                 * 01850000
*    main storage:                                                    * 01900002
*    virtual storage:                                                 * 01950002
*    auxiliary storage:                                               * 02000002
*    subpool: 78                                                      * 02050000
*    key    : 8                                                       * 02100000
*    data space: No                                                   * 02150000
*    residency: Above 16MB                                            * 02200000
* Size: TCOMTAB 808 bytes                                             * 02250000
*       TCOM 816 bytes                                                * 02260000
* Created by: IGC0009G on request by IKJEGINT                         * 02300000
* Method of access:                                                   * 02350000
*                   ASM = by macro invocation                         * 02400000
*                   PLS = by percent include                          * 02450000
* Pointed to by: Register 9                                           * 02500000
*                                                                     * 02510000
* Serialization: None                                                 * 02550000
*                                                                     * 02950000
* Function:                                                           * 03000000
*        This macro maps the TEST command processor communication     * 03050000
*        table (TCOMTAB) used by all subcommand processors and        * 03100000
*        service routines which make up the TSO/E TEST command.       * 03150000
*                                                                     * 03200000
*                                                                     * 03250000
*01* CHANGE ACTIVITY =                                        @E2115B8* 03300000
*                   E2115B8 - JBB2115 TSO/E FOR MVS/XA        @E2115B8* 03350000
*OZ92954 ADD BIT TELLING IKJEGATN TO BYPASS ATTENTION PROCESSING      * 03400000
*                                                             @ZA92954* 03450000
*                   E1402C4 - HTE1402 TSO/E RELEASE 4 VECTOR  @E1402C4* 03500000
*                             ARCHITECTURE ENHANCEMENTS.      @E1402C4* 03550000
*    E21D2MP - HTE21D2 TSO/E Version 2 Release 1 PARMLIB              * 03600000
*              Support.                                       @E21D2MP* 03650000
*    E21D2XX - HTE21D2 TSO/E Version 2 Release 1 for                  * 03700000
*              MVS SP 3 Architecture Enhancements.            @E21D2XX* 03750000
*    PEI0136 - Loss of Exit Command and SubCommand User Word          * 03800000
*              Key and Length data.                           @PEI0136* 03850000
*    PEI0170 - Add pointer to E-type opcode table ("01")      @PEI0170* 03900000
*    PEI0220 - Footprinting                                   @PEI0220* 03950000
*    PEI0431 - Area for original INBUF to be saved in         @PEI0431* 04000000
*    PEI0661 - RUN processing completed flag added            @PEI0661* 04050000
*    PEI0810 - Add a flag to signify that the condition       @PEI0810* 04100000
*              code must be saved.                            @PEI0810* 04150000
*  OY13125 - ADD FIELD TO SAVE THE PSW CC FOR IKJEGLDF AND            * 04200000
*            ADD BIT TO INDICATE TO SVC97 TO RESTORE PSWCC.           * 04250000
*            See PEI0810 line flags.                          @YA13125* 04300000
*  PHN0013 - Add pointer to E5 opcode table                   @PHN0013* 04350000
*  OY16440 - ADD BIT FOR LIST PROCESSING THAT WILL INDICATE THAT      * 04400000
*            IGC0009G ROUTINE VALIDCHK WILL BE INVOKED TO CHECK THE   * 04450000
*            BEGINNING AND END ADDRESS OF THE RANGE USED BY           * 04500000
*            IKJEGLST'S LSTBPT ROUTINE.  ALSO ADD TWO WORDS FOR USE   * 04550000
*            BY IKJEGLST FOR WORKAREAS.                       @YA16440* 04600000
*  PHN0041 - Remove unwanted (extra) lines                    @PHN0041* 04650000
*  PHN0042 - Remove extra field                               @PHN0042* 04700000
*  E23D2D9 - ENHANCEMENT FOR APPC TEST                        @E23D2D9* 04750000
*              1. ADD TREQACTV (TEST REQUEST ACTIVE) BIT      @E23D2D9* 04800000
*              2. ADD TKEEPTP  (WHETHER TO KEEP TP) BIT       @E23D2D9* 04850000
*              3. ADD TSTMNLW2 (POINTER TO IKJEGMNL WORKAREA) @E23D2D9* 04900000
*  E24D2B1 - 2.4.0 PDSE load module support                   @E24D2B1* 04950000
*  PMH0149 - Add a flag for Initialization exit invoked       @PMH0149* 05000000
*  PMH0160 - Added CDPI information to prolog                 @PMH0160* 05050000
*                                                                     * 05100000
*  FLAG   REASON   RELEASE DATE     ORIGIN                        @L1A* 05108300
*  ----   -------  ------- -------- ------                        @L1A* 05116600
*  $L1=   SVC97    HTE7708 020412   MPK : SVC 97 z/Arch support   @L1A* 05124900
*                                                                 @L1A* 05133200
*  $L2=   OPCODE   HTE7709 030127   PDD3: 64-bit opcode support   @L2A* 05133300
*                                                                 @L2A* 05133400
* End of specifications                                               * 05150000
*********************************************************************** 05200000
         SPACE 1                                                        05250000
ECBPP    DS    A -            PP DISPATCHABILITY ECB.                   05300000
         SPACE 1                                                        05350000
ECBLIST  EQU   * -            BEGINNING OF ECBLIST FOR WAIT.            05400000
ECBTST   DS    A -            PTR TO TEST DISPATCHABILITY ECB.          05450000
ECBTERM  DS    A -            PTR TO PP TERMINATION ECB.                05500000
ECBTMPS  DS    A -            PTR TO STAI ECB.                          05550000
ECBTMPA  DS    A -            PTR TO ATTENTION ECB.                     05600000
         SPACE 1                                                        05650000
ECBLOG   DS    A -            PTR TO STOP/MODIFY ECB.                   05700000
         SPACE 1                                                        05750000
TSTTCB   DS    A -            PTR TO THE TEST TCB.             @E2115B8 05800000
         SPACE 1                                                        05850000
PPTCB    DS    A -            PTR TO THE PROBLEM PROGRAM TCB.  @E2115B8 05900000
IBMCTAB  DS    A -            PTR to the IBM command table.    @E21D2C6 05950000
USRCTAB  DS    A -            PTR to the User command table.   @E21D2C6 06000000
         SPACE 1                                                        06050000
OUTBUF   DS    A -            PTR TO GENERAL OUTPUT BUFFER.             06100000
OUTBUFRL EQU   256 -          LENGTH OF OUTPUT BUFFER.                  06150000
BLDLAREA DS    0A -           ADDRESS OF BLDL ENTRY USED BY             06200000
*                             IKJEGINT AND IKJEGLDR.                    06250000
CONAREA  DS    A -            PTR TO OUTPUT AREA USED BY CONVERT RTN.   06300000
CONAREAL EQU   72 -           LENGTH OF CONVERT WORK AREA.              06350000
WORKAREA DS    A -            PTR TO GENERAL WORK AREA.                 06400000
REGSAVEL EQU   72*6 -         LENGTH OF 6 REGISTER SAVE AREAS.          06450000
REGSAVE1 DS    A -            PTR TO SAVE AREA FOR MAINLINE.            06500000
REGSAVE2 DS    A -            PTR TO SAVE AREA FOR COMMANDS.            06550000
REGSAVE3 DS    A -            PTR TO SAVE AREA FOR VALIDITY CHECKERS.   06600000
REGSAVE4 DS    A -            PTR TO SAVE AREA FOR IKJEGCVT.            06650000
REGSAVE5 DS    A -            PTR TO SAVE AREA FOR IKJEGIO.             06700000
REGSAVE6 DS    A -            PTR TO SAVE AREA FOR IKJEGSRH.            06750000
TSTIODSL DS    H -            LTH OF IKJEGIO DSNAM QUE ELEMENT @E2115B8 06800000
TSTDCBL  DS    H -            LTH OF DCB USED BY IKJEGIO       @E2115B8 06850000
         SPACE 1                                                        06900000
TPLPTR   DS    A -            PTR TO TPL                                06950000
TMPLL    DS    H -            LINE LENGTH                               07000000
         DS    X -            *** RESERVED SPACE ***           @E2115B8 07050000
TSTESTRC DS    X -            ESATE ERROR RETURN CODE                   07100000
TSTWHR   DS    A -            PTR TO COMMAND LIB DCB.                   07150000
         SPACE 1                                                        07200000
PARMLIST DS    0F -           PARM LIST FOR CALLING SERVICE ROUTINES    07250000
TSTUPT   DS    A -            PTR TO UPT                                07300000
TSTECT   DS    A -            PTR TO ECT                                07350000
TSTCPECB DS    A -            PTR TO CP ECB                             07400000
         SPACE 1                                                        07450000
TSTANSPL DS    A -            ANSWER PLACE FOR PARSE SERVICE ROUTINE.   07500000
         SPACE 1                                                        07550000
TSTVSMAD DS    A -            ADDRESS OF AREA REQUIRED FOR     @E2115B8 07600000
*                              VSMLIST INVOCATIONS             @E2115B8 07650000
TSTVSML  DS    A -            LENGTH OF AREA PASSED TO VSMLIST @E2115B8 07700000
TSTRTYCD DS    X -            SUBCOMMAND ID.                            07750000
TSTPSWCC DS    X              Problem programs condition code  @PEI0810 07800000
         DS    CL2            *** Reserved space ***           @PEI0810 07850000
         SPACE 1                                                        07900000
INBUF    DS    A -            PTR TO BUFFER CONTAINING SUBCMD           07950000
TSTIODSN DS    A -            HEAD OF DSNAME CHAIN FOR IKJEGIO 'PRINT'. 08000000
TSTIO    DS    A -            ENTRY POINT OF GET ROUTINE IKJEGIO.       08050000
TSTFLGSX DS    0X -           ADDITIONAL WORD FOR TEST FLAGS.  @E2115B8 08100000
TSTAMODE DS    X -            IF HIGH ORDER BIT IS ON THEN     @E2115B8 08150000
*                                TESTED PROGRAM IS IN 31-BIT   @E2115B8 08200000
*                                ADDRESSING MODE.              @E2115B8 08250000
TSTAMD31 EQU   B'10000000'    Tested program is in AMode31         @L1A 08275000
*                             TSTAMODE is ORed with the first byte @L1A 08281200
*                             of RBOPSW so the other bits must be  @L1A 08287400
*                             set to all zeros and can not be used @L1A 08293600
TSTFLGSA DS    X -            RESERVED FOR TEST FLAGS          @E2115B8 08300000
RUNSW2   EQU   B'10000000'    RUN processing complete          @PEI0661 08350000
TSTLOOP  EQU   B'01000000'    BIT TO INDICATE THAT IKJEGLST IS          08400000
*                          VALIDITY CHECKING AN ADDRESS RANGE  @YA16440 08450000
TREQACTV EQU   B'00100000'    REGISTER_TP call made and inbound         08500000
*                             attach request has not been     @E23D2D9  08550000
*                             intercepted                     @E23D2D9  08600000
TREQAOFF EQU   B'11011111'    used to turn off TREQACTV       @E23D2D9  08650000
TKEEPTP  EQU   B'00010000'    should keep the TP when end or abend      08700000
*                                                             @E23D2D9  08750000
TSTAMD64 EQU   B'00001000'    Tested program is in AMode64         @L1A 08760000
*                             TSTAMD31 must also be set to one as  @L1A 08770000
*                             these bits replace bits 31 and 32 of @L1A 08780000
*                             the PSW to set up the correct AMode  @L1A 08790000
TSTFLGSB DS    X -            RESERVED FOR TEST FLAGS          @E2115B8 08800000
TSTFLGSC DS    X -            RESERVED FOR TEST FLAGS          @E2115B8 08850000
         SPACE 2                                               @E2115B8 08900000
ASMADOPP DS    A -            Pointer to opcode service            @L2C 08950000
TSTCONVT DS    A -            ENTRY POINT OF IKJEGCVT.                  09000000
TSTADDR  DS    A -            ENTRY POINT OF ADDRESS BUILD SUBROUTINE.  09050000
TSTSTAE  DS    A -            ENTRY POINT OF STAE EXIT RTN. (IKJEGSTA). 09100000
         SPACE 2                                                        09150000
TSTFLGS  DS    0X -           NAME FOR 4 BYTES OF FLAGS        @E2115B8 09200000
TSTFLGS1 DS    X -            TEST FLAGS, BYTE 1.                       09250000
         SPACE 1                                                        09300000
PCHLSTVL EQU   B'10000000' -  PATCH LIST SWITCH.                        09350000
FORGOUSE EQU   B'01000000' -  USED BY IKJEGGO ONLY             @E211533 09400000
TSTPRINT EQU   B'00100000' -  PRINT SWITCH.                             09450000
TSTFIRST EQU   B'00010000' -  FIRST TIME SWITCH.                        09500000
RANGESW  EQU   B'00001000' -  INDICATES PDE IS FOR ADDRESS RANGE.       09550000
TSTBUILD EQU   B'00000100' -  'AT' SWITCH FOR DEFER CHECK.              09600000
ENDSW    EQU   B'00000010' -  INDICATES 'END' TO MAINLINE.              09650000
RUNSW    EQU   B'00000001' -  INDICATES 'RUN' TO MAINLINE.              09700000
         SPACE 2                                                        09750000
TSTFLGS2 DS    X -            TEST FLAGS, BYTE 2.                       09800000
         SPACE 1                                                        09850000
TSTLDF   EQU   B'10000000' -  IKJEGLDF TASK-SWITCH INDICATOR.           09900000
TSTXCTL  EQU   B'01000000' -  STAE XCTL INDICATOR.                      09950000
TOFFDEF  EQU   B'00100000' -  NO ACTIVE BREAKPOINTS.                    10000000
TSTLDFX  EQU   B'00010000' -  ALET Addr checking or operation  @E21D2C6 10050000
TADDROUT EQU   B'00001000' -  LOAD MODULE FOUND UNDER TCB.              10100000
TWHRLOAD EQU   B'00000100' -  VALID LOAD MODULE CHECK.                  10150000
TSTQUAL  EQU   B'00000010' -  QUALIFICATION IS IN PROCESS               10200000
TMYIOMSG EQU   B'00000001' -  IKJEGIO MESSAGE SWITCH.                   10250000
         SPACE 2                                                        10300000
TSTFLGS3 DS    X -            TEST FLAGS, BYTE 3.                       10350000
         SPACE 1                                                        10400000
TSTGOSW  EQU   B'10000000' -  SPECIAL BREAKPOINT TYPE SWITCH.           10450000
TSTSTAI  EQU   B'01000000' -  PROBLEM PROGRAM ABEND INDICATOR.          10500000
SYMMESG  EQU   B'00100000' -  SYM 'NO DIAGNOSTIC' SWITCH.               10550000
TCSECTCK EQU   B'00010000' -  CSECT ONLY DEFER QUEUE CLEAR.             10600000
TDUPNAME EQU   B'00001000' -  DEFER QUEUE DUPLICATE NAME BIT.           10650000
TSTLINK  EQU   B'00000100' -  SUB-CMD 'LINK FAILED' INDICATOR.          10700000
TSTHELP  EQU   B'00000010' -  INDICATES THAT TSO COMMAND IS    @E2115B8 10750000
*                             ATTACHED BY TEST.                @E2115B8 10800000
TSTTSOC  EQU   B'00000010' -  INDICATES THAT TSO COMMAND IS    @E2115B8 10850000
*                             ATTACHED BY TEST.                @E2115B8 10900000
NOPARMS  EQU   B'00000001' -  INDICATES NO PARAMETERS WITH COMMAND.     10950000
         SPACE 2                                                        11000000
TSTFLGS4 DS    X              TEST FLAGS, BYTE 4.                       11050000
         SPACE 1                                                        11100000
TSTA     EQU   B'10000000' -  TEST'S INPUT IS NOT FROM A STACK.         11150000
TSTB     EQU   B'01000000' -  A STACKED TERMINAL ELEM. IS PRESENT.      11200000
TSTFLUSH EQU   B'00100000' -  FORCE TCLEARQ AND POSSIBLE STACK FLUSH.   11250000
TSTRERTN EQU   B'00010000' -  A RETRY IS IN PROCESS                     11300000
TSTESTAE EQU   B'00001000' -  ESTAE IS INVOKING I/O FOR MESSAGE         11350000
TSTSVCAB EQU   B'00000100' -  SVC ABEND IS IN PROCESS                   11400000
TSTPERC  EQU   B'00000010' -  THIS RETRY ROUTINE WAS PERCOLLATED TO     11450000
TSTVALCK EQU   B'00000001' -  INDICATES PARSE VALIDITY CHECK IN PROCESS 11500000
         SPACE 2                                                        11550000
BREAKTAB DS    A -            PTR TO FIRST BREAK ELEMENT.               11600000
DEFERTAB DS    A -            PTR TO DEFER'ED CMD LIST                  11650000
PPLOAD   DS    A -            PTR TO CURRENT BASE FOR RELATIVES.        11700000
PPTEMP   DS    A -            TEMPORARY BASE FOR RELATIVES.             11750000
SUBCHAIN DS    A -            PTR TO BREAKPOINT SUBCOMMAND CHAIN.       11800000
         SPACE 1                                                        11850000
TSTGO    DS    0X -           RESUME ADDRESS AFTER BREAKPOINT.          11900000
TSTGOPSW DS    F -            SECOND WORD OF RBOPSW FIELD.              11950000
TSTGOWCF DS    X -            WAIT COUNT FROM RBWCF FIELD.              12000000
TSTFLGS5 DS    X -            TEST FLAGS, BYTE 5.             @ZA92954  12050000
SKIPATTN EQU   B'10000000' -  BYPASS ATTENTION PROCESSING     @ZA92954  12100000
TSTNOALT EQU   B'01000000' -  Suppress ALET on an address     @E21D2C6  12150000
TSTALETY EQU   B'00100000' -  ALET associated with address    @E21D2C6  12200000
TSTMSGL2 EQU   B'00010000' -  Bypass message for next occurrence of     12250000
*                             conversion of an address in CVT @E21D2C6  12300000
TSTSYMAL EQU   B'00001000' -  ALET Associated with symbol     @E21D2C6  12350000
TSTRESCC EQU   B'00000100' -  Restore the problem programs CC @PEI0810  12400000
TSTFOUND EQU   B'00000010' -  Command found flag              @E21D2C6  12450000
TSTPARM  EQU   B'00000001' -  Parmlib support is enabled      @E21D2C6  12500000
TSTSVC   DS    H -            AN SVC 97 INSTRUCTION (0A61).             12550000
PPRB     DS    A -            CURRENT PROBLEM PROGRAM RB ADDRESS.       12600000
         SPACE 1                                                        12650000
TSTIODCB DS    A -            PTR TO OPEN PRINT DCB.                    12700000
CALLPARM DS    A -            HEAD OF CHAIN FOR PARMS BUILT BY 'CALL'.  12750000
         DS    A -            *** RESERVED SPACE ***                    12800000
INTSTDDN DS    0CL8           DDNAME FOR DATA SET SPECIFIED ON THE TEST 12850000
*                             COMMAND - USED BY IKJEGINT AND IKJEGLDR.  12900000
TSTCURLD DS    CL8 -          CURRENTLY QUALIFIED LOAD NAME.            12950000
TERMDD   DS    0CL8 -         DDNAME FOR TERMINAL USED BY OS LOADER.    13000000
TSTCURCT DS    CL8 -          CURRENTLY QUALIFIED CSECT NAME.           13050000
TSTSYMBA DS    A -            CURRENTLY QUALIFIED SYMBOLIC ADDR BASE.   13100000
TSTTRN   DS    A -            HEAD OF SAVE INFORMATION CHAIN            13150000
SICHAIN  DS    A -            HEAD OF SYMBOL INFORMATION CHAIN          13200000
TSTSYMWK DS    A -            PTR TO SYMBOL PROCESSING WORK AREA.       13250000
SYMTABLE DS    A -            PTR TO IN-CORE SYMBOL TABLE.              13300000
         SPACE 1                                                        13350000
PPEXIT   DS    0A -           BREAKPOINT & EXIT SVC'S FOR PP TERM.      13400000
PPEXIT1  DS    H -            AN SVC 97 INSTRUCTION (0A61).             13450000
PPEXIT2  DS    H -            AN SVC 3 INSTRUCTION (0A03).              13500000
TSTDCB   DS    A -            HEAD OF OVLY DCB CHAIN.                   13550000
OPCODTAB DS    A -            PTR TO TABLE OF VALID OPERATION CODES.    13600000
TSTOPCD2 DS    F -            PTR TO TABLE FOR TWO BYTE S/370           13650000
*                             OPERATION CODES.                          13700000
TSTCADDR DS    A -            CURRENT ADDRESS BEING VALIDITY   @YA16440 13750000
*                         CHECKED BY IKJEGLST 'LSTBPT' ROUTINE @YA16440 13800000
TSTOPCD3 DS    A -            Address of E5 Opcode table       @PHN0013 13850000
TSTHTCB  DS    0A -           POINTER TO THE TCB FOR ATTACHED  @E2115B8 13900000
*                             TSO COMMAND.                     @E2115B8 13950000
TSTOTCB  DS    A -            POINTER TO THE TCB FOR ATTACHED  @E2115B8 14000000
*                             TSO COMMAND.                     @E2115B8 14050000
TSTAQUAL DS    CL8 -          AUTOMATIC QUALIFICATION          @E2115B8 14100000
*                             CONTROL                          @E2115B8 14150000
TSTAQEP  DS    A -            ENTRY POINT OF LOAD MODULE.               14200000
TSTRSTRT DS    A -            RESTART ADDRESS FOR STAE PROCESSING       14250000
TSTSRHRT DS    A -            ADDRESS OF RESIDENT ADDRESS VALIDITY      14300000
*                             CHECK ROUTINE.                            14350000
         SPACE 1                                                        14400000
TSTSTAX  DS    5F -           STAX PARAMETER LIST.                      14450000
TSTDSECB DS    F -            TEST DISPATCHABILITY ECB.                 14500000
TSTMNLWK DS    14F -          WORK AREA FOR EXCULSIVE USE    @E2115B8   14550000
*                             OF MNL                         @E2115B8   14600000
TSTIOPRM DS    CL84           IO PARAMETER BLOCK USE BY SIO             14650000
TSTSVCM1 DS    F              SVC FIRST LEVEL MESSAGE NO.               14700000
TSTSVCM2 DS    F              SVC SECOND LEVEL MESSAGE NO.              14750000
TSTOPCD4 DS    A              ADDRESS OF A4 OPCODE TABLE     @E1402C4   14800000
TSTOPCD5 DS    A              ADDRESS OF A5 OPCODE TABLE     @E1402C4   14850000
TSTOPCD6 DS    A              ADDRESS OF A6 OPCODE TABLE     @E1402C4   14900000
ABNDTCB  DS    F              ABENDING TCB ADDR              @E2115B8   14950000
TSTECTSV DS    14F            ECT SAVE AREA.                 @E2115B6   15000000
TSTOPCD7 DS    A              ADDRESS OF E4 OPCODE TABLE     @E1402C4   15050000
TSTVPARM DS    0F             VECTOR FACILITY PARAMETERS     @E1402C4   15100000
TSTVSS   DS    H              VECTOR SECTION SIZE            @E1402C4   15150000
TSTVPS   DS    H              VECTOR PARTIAL SUM NUMBER      @E1402C4   15200000
TSTALET1 DS    F              ALET value for address         @E21D2C6   15250000
TSTALET2 DS    F              ALET value for second address of a range  15300000
*                                                            @E21D2S6   15350000
TSTMSGCD DS    0D             Message code fields            @E21D2S6   15400000
TSTMSG1N DS    F              First Level message number     @E21D2S6   15450000
TSTMSG2N DS    F              Second Level message number    @E21D2S6   15500000
TSTEGARM DS    A              Address of IKJEGARM            @E21D2S6   15550000
TSTEGCOM DS    A              Address of IKJEGCOM            @E21D2S6   15600000
TSTEGAR1 DS    A              Address of IKJEGAR1            @E21D2B1   15650000
TSTEGAR2 DS    A              Address of IKJEGAR2            @E21D2B1   15700000
TSTEGAR3 DS    A              Address of IKJEGAR3            @E21D2B1   15750000
TSTGEN   DS    F              Current Parmlib Generation #   @E21D2MP   15800000
TSTCBLK  EQU   *              Address of pseudo-command block@E21D2MP   15850000
TSTCBCL  DS    X              Length of command name = 8     @E21D2MP   15900000
TSTCBCN  DS    CL8            Command name storage           @E21D2MP   15950000
TSTCBAL  DS    X              Length of alias = 0            @E21D2MP   16000000
TSTCBLN  DS    CL8            Load module name storage       @E21D2MP   16050000
TSTCBCI  DS    X              Command ID storage             @E21D2MP   16100000
         DS    X              *** Reserved space ***         @E21D2MP   16150000
TSTTSOCD DS    A              Pointer to local copy of IKJEGTCT         16200000
*                                                            @E21D2C6   16250000
TSTSUBCD DS    A              Pointer to local copy of IKJEGSCT         16300000
*                                                            @E21D2C6   16350000
TSTTSOLN DS    H              Length of local copy of IKJEGTCT          16400000
*                                                            @E21D2C6   16450000
TSTSUBLN DS    H              Length of local copy of IKJEGSCT          16500000
*                                                            @E21D2MP   16550000
TSTPDECM DS    A              PDE ptr returned from prompt   @E21D2S6   16600000
TSTALERC DS    F              ALET addr check RC             @E21D2S6   16650000
TSTS9G01 DS    CL20           S9G macro workarea             @E21D2S6   16700000
REGSAVE7 DS    A              Save area ptr                  @E21D2S6   16750000
REGSAVE8 DS    A              Save area ptr                  @E21D2S6   16800000
REGSAVE9 DS    A              Save area ptr                  @E21D2S6   16850000
TSTFTPRT DS    CL48           TEST Footprint Area            @E21D2S6   16900000
         ORG   TSTFTPRT                                      @E21D2S6   16950000
TSTFTCUR DS    CL24           Current module                 @E21D2S6   17000000
TSTFTOLD DS    CL24           Previous module                @E21D2S6   17050000
TSTOPCD8 DS    A              Address of 01 OPcode table     @PEI0170   17100000
TSTFTTMP DS    CL24           Footprint Temporary Save       @PEI0220   17150000
TSTECOMB DS    F              Exit Command buffer pointer    @PEI0136   17200000
TSTESUBB DS    F              Exit Sub Commnand buff pointer @PEI0136   17250000
TSTUWENT DS   0F              Exit User Word Entry           @PEI0136   17300000
TSTUWKEY DS    F              Exit Communication Word Key    @PEI0136   17350000
TSTUWLEN DS    F              Exit Communication Word Length @PEI0136   17400000
TSTUWORD DS    F              Exit Communication Word Data   @PEI0136   17450000
TSTSWENT DS   0F              Exit SubCommand UserWord Entry @PEI0136   17500000
TSTSWKEY DS    F              Exit SubCommand UserWord Key   @PEI0136   17550000
TSTSWLEN DS    F              Exit SubCommand UserWord Len   @PEI0136   17600000
TSTSWORD DS    F              Exit SubCommand UserWord Data  @PEI0136   17650000
TSTORIGI DS    F              Original INBUF save area       @PEI0431   17700000
TSTCPAGE DS    A -            CURRENT PAGE ADDRESS USED BY     @YA16440 17750000
*                             IKJEGLST 'LSTBPT' ROUTINE        @YA16440 17800000
TCOMTPID DS    CL8            TPID for the TPI being tested   @E23D2D9  17850000
TSTMNLW2 DS    A              ADDR OF SECOND PART MNL WORK AREA         17900000
*                                                             @E23D2D9  17950000
SMSPDSE  DS    CL8            PDSE STARTD/ENDD Token          @E24D2B1  18000000
TSTFLGS6 DS    X -            TEST FLAGS, BYTE 6.             @PMH0149  18050000
INITEINV EQU   B'10000000'    Init exit has been invoked      @PMH0149  18100000
TSTCVTMG EQU   B'01000000'    Issue message if convert fails      @L1A  18110000
         DS    CL3            Reserved                        @PMH0149  18150000
         DS    5F             *** Reserved space ***         @E21D2C6   18200000
TCOMLTH  EQU   (*-TCOMTAB)+TCOMPREL       LENGTH OF TCOMTAB  @E2115B8   18250000
*                                         INCLUDING PREFIX   @E2115B8   18300000
         MEND                                                           18350000
**/                                                                     18400000
* %MTABLBL :  ;                                                         18450000
* DECLARE                                                               18500000
*   1 TCOMTAB BASED BDY(WORD),                                          18550000
*/********************************************************************/ 18600000
*/*                                                                  */ 18650000
*/*      THIS MACRO MAPS THE TEST COMMAND PROCESSOR COMMUNICATION    */ 18700000
*/*      TABLE (TCOMTAB) USED BY ALL SUBCOMMAND PROCESSORS AND       */ 18750000
*/*      SERVICE ROUTINES WHICH MAKE UP THE TSO/TEST COMMAND.        */ 18800000
*/*                                                                  */ 18850000
*/*                                                                  */ 18900000
*/* CHANGE ACTIVITY --                                       @E2115B8*/ 18950000
*/*                 E2115B8 - JBB2115 TSO/E FOR MVS/XA       @E2115B8*/ 19000000
*/*OZ92954    ADD BIT TO TELL IKJEGATN TO BYPASS ATTENTION PROCESSING*/ 19050000
*/*                                                          @ZA92954*/ 19100000
*/*                 E1402C4 - HTE1402 TSO/E RELEASE 4 VECTOR @E1402C4*/ 19150000
*/*                           ARCHITECTURE ENHANCEMENTS.     @E1402C4*/ 19200000
*/*  E21D2MP - HTE21D2 TSO/E Version 2 Release 1 PARMLIB             */ 19250000
*/*            Support.                                      @E21D2MP*/ 19300000
*/*  E21D2XX - HTE21D2 TSO/E Version 2 Release 1 for                 */ 19350000
*/*            MVS SP 3 Architecture Enhancements.           @E21D2XX*/ 19400000
*/*  PEI0136 - Loss of Exit Command and SubCommand User Word         */ 19450000
*/*            Key and Length data.                          @PEI0136*/ 19500000
*/*  PEI0170 - Add pointer to E-type opcode table ("01")     @PEI0170*/ 19550000
*/*  PEI0220 - Footprinting                                  @PEI0220*/ 19600000
*/*  PEI0431 - Area for original INBUF to be saved in        @PEI0431*/ 19650000
*/*  PEI0661 - RUN processing completed flag added           @PEI0661*/ 19700000
*/*  PEI0810 - Add a flag to signify that the condition      @PEI0810*/ 19750000
*/*            code must be saved.                           @PEI0810*/ 19800000
*/*OY13125 - ADD FIELD TO SAVE THE PSW CC FOR IKJEGLDF AND           */ 19850000
*/*          ADD BIT TO INDICATE TO SVC97 TO RESTORE PSWCC.          */ 19900000
*/*          See PEI0810 line flags.                         @YA13125*/ 19950000
*/*PHN0013 - Add pointer to E5 opcode table                  @PHN0013*/ 20000000
*/*OY16440 - ADD BIT FOR LIST PROCESSING THAT WILL INDICATE THAT     */ 20050000
*/*          IGC0009G ROUTINE VALIDCHK WILL BE INVOKED TO CHECK THE  */ 20100000
*/*          BEGINNING AND END ADDRESS OF THE RANGE USED BY          */ 20150000
*/*          IKJEGLST'S LSTBPT ROUTINE.  ALSO ADD TWO WORDS FOR USE  */ 20200000
*/*          BY IKJEGLST FOR WORKAREAS.                      @YA16440*/ 20250000
*/*PHN0041 - Remove unwanted (extra) lines                   @PHN0041*/ 20300000
*/*E23D2D9 - TSO/E 2.3.0 APPC TEST ENABLEMENT SUPPORT        @D23D2D9*/ 20350000
*/*E24D2B1 - 2.4.0 PDSE load module support                   @E24D2B1*/20400000
*/*                                                                  */ 20450000
*/********************************************************************/ 20500000
*/*A-000000-999999                                           @ZA25414*/ 20550000
*     2 ECBPP       PTR(31),   /* PP DISPATCHABILITY ECB.            */ 20600000
*     2 ECBLIST,               /* BEGINNING OF ECBLIST FOR WAIT.     */ 20650000
*       3 ECBTST    PTR(31),   /* PTR TO TEST DISPATCHABILITY ECB.   */ 20700000
*       3 ECBTERM   PTR(31),   /* PTR TO PP TERMINATION ECB.         */ 20750000
*       3 ECBTMPS   PTR(31),   /* PTR TO STAE ECB.                   */ 20800000
*       3 ECBTMPA   PTR(31),   /* PTR TO ATTENTION ECB.              */ 20850000
*     2 ECBLOG      PTR(31),   /* PTR TO STOP/MODIFY ECB.            */ 20900000
*     2 TSTTCB      PTR(31),   /* PTR TO THE TEST TCB.               */ 20950000
*     2 PPTCB       PTR(31),   /* PTR TO THE PROBLEM PROGRAM TCB.    */ 21000000
*     2 IBMCTAB     PTR(31),   /* PTR to the IBM cmd table   @E21D2C7*/ 21050000
*     2 USRCTAB     PTR(31),   /* PTR to the User cmd table  @E21D2C7*/ 21100000
*     2 OUTBUF      PTR(31),   /* PTR TO GENERAL OUTPUT BUFFER.      */ 21150000
*     2 BLDLAREA    PTR(31),   /* ADDRESS OF BLDL ENTRY USED BY         21200000
*                                 IKJEGINT AND IKJEGLDR.             */ 21250000
*       3 CONAREA   PTR(31),   /* PTR TO OUTPUT AREA USED BY            21300000
*                                 CONVERT RTN.                       */ 21350000
*     2 WORKAREA    PTR(31),   /* PTR TO GENERAL WORK AREA.          */ 21400000
*     2 REGSAVE1    PTR(31),   /* PTR TO SAVE AREA FOR MAINLINE.     */ 21450000
*     2 REGSAVE2    PTR(31),   /* PTR TO SAVE AREA FOR COMMANDS.     */ 21500000
*     2 REGSAVE3    PTR(31),   /* PTR TO SAVE AREA FOR VALIDITY         21550000
*                                 CHECKERS.                          */ 21600000
*     2 REGSAVE4    PTR(31),   /* PTR TO SAVE AREA FOR IKJEGCVT.     */ 21650000
*     2 REGSAVE5    PTR(31),   /* PTR TO SAVE AREA FOR IKJEGIO.      */ 21700000
*     2 REGSAVE6    PTR(31),   /* PTR TO SAVE AREA FOR IKJEGSRH.     */ 21750000
*     2 TSTIODSL    FIXED(15), /* LENGTH OF IKJEGIO DSNAME QUEUE        21800000
*                                                    ELEMENT @E2115B8*/ 21850000
*     2 TSTDCBL     FIXED(15), /* LENTH OF DCB USED BY IKJEGIO          21900000
*                                                            @E2115B8*/ 21950000
*     2 TPLPTR      PTR(31),   /* PTR TO TPL                         */ 22000000
*     2 TMPLL       FIXED(15), /* LINE LENGTH                        */ 22050000
*     2 *           FIXED(8),  /* *** RESERVED SPACE ***     @E2115B8*/ 22100000
*     2 TSTESTRC    FIXED(8),  /* ESTAE ERROR RETURN CODE            */ 22150000
*     2 TSTWHR      PTR(31),   /* PTR TO COMMAND LIB DCB.            */ 22200000
*     2 PARMLIST,              /* PARM LIST FOR CALLING SERVICE         22250000
*                                 ROUTINES.                          */ 22300000
*       3 TSTUPT    PTR(31),   /* PTR TO UPT.                        */ 22350000
*       3 TSTECT    PTR(31),   /* PTR TO ECT.                        */ 22400000
*       3 TSTCPECB  PTR(31),   /* PTR TO CP ECB.                     */ 22450000
*       3 TSTANSPL  PTR(31),   /* ANSWER PLACE FOR PARSE SERVICE        22500000
*                                 ROUTINE.                           */ 22550000
*     2 TSTVSMAD    PTR(31),   /* ADDRESS OF AREA REQUIRED FOR          22600000
*                                 VSMLIST INVOCATIONS        @E2115B8*/ 22650000
*     2 TSTVSML     FIXED(31), /* LENGTH OF AREA PASSED TO VSMLIST      22700000
*                                                            @E2115B8*/ 22750000
*     2 TSTRTYCD    FIXED(8),  /* SUBCOMMAND ID.             @E2115B8*/ 22800000
*     2 TSTPSWCC    CHAR(1),   /*The problem programs CC     @PEI0810*/ 22850000
*     2 *           CHAR(2),   /* *** Reserved Space ***     @PEI0810*/ 22900000
*     2 INBUF       PTR(31),   /* PTR TO BUFFER CONTAINING SUBCMD.   */ 22950000
*     2 TSTIODSN    PTR(31),   /* HEAD OF DSNAME CHAIN FOR IKJEGIO      23000000
*                                 'PRINT'.                           */ 23050000
*     2 TSTIO       PTR(31),   /* ENTRY POINT OF GET ROUTINE IKJEGIO.*/ 23100000
*     2 TSTFLGSX,              /* WORD OF FLAGS FOR TEST     @E2115B8*/ 23150000
*       3 TSTAMODE  CHAR(1),   /* IF HIGH ORDER BIT IS ON    @E2115B8*/ 23200000
*                              /*  THEN TESTED PROGRAM IS IN @E2115B8*/ 23250000
*                              /*  31-BIT ADDRESSING MODE.   @E2115B8*/ 23300000
*         5 TSTAMD31 BIT(1),   /* Tested program is in AMode31          23306600
*                                 TSTAMODE is ORed with the firstbyte   23313200
*                                 of the RBOPSW so the other bits must  23319800
*                                 be set to zeros and not reused @L1A*/ 23326400
*         5 *        BIT(7),   /* Reserved                       @L1A*/ 23333200
*       3 TSTFLGSA  CHAR(1),   /*  TEST Flags A              @PEI0661*/ 23350000
*         5 RUNSW2  BIT(1),    /*   RUN process complete     @PEI0661*/ 23400000
*         5 TSTLOOP  BIT(1),   /* BIT TO INDICATE THAT IKJEGLST IS      23450000
*                         VALIDITY CHECKING AN ADDRESS RANGE @YA16440*/ 23500000
*         5 TREQACTV BIT(1),   /*   APPC test requset active         */ 23550000
*         5 TKEEPTP  BIT(1),   /*   whether to keep TP when test        23600000
*                                   ends                     @E23D2D9*/ 23650000
*         5 TSTAMD64 BIT(1),   /* Tested program is in AMode64          23655500
*                                 TSTAMD31 must also be set to one as   23661000
*                                 these bits will be used to replace    23666500
*                                 bits 31 and 32 of the RBOPSW and      23672000
*                                 AMode64 needs a '11'B pattern  @L1A*/ 23677500
*         5 *        BIT(3),   /* Reserved                       @L1A*/ 23683200
*       3 TSTFLGSB  CHAR(1),   /*  RESERVED FOR TEST FLAGS.  @E2115B8*/ 23700000
*       3 TSTFLGSC  CHAR(1),   /*  RESERVED FOR TEST FLAGS.  @E2115B8*/ 23750000
*     2 ASMADOPP    PTR(31),   /* Pointer to opcode service      @L2C*/ 23800000
*     2 TSTCONVT    PTR(31),   /* ENTRY POINT OF IKJEGCVT.           */ 23850000
*     2 TSTADDR     PTR(31),   /* ENTRY POINT OF ADDRESS BUILD          23900000
*                                 SUBROUTINE.                        */ 23950000
*     2 TSTSTAE     PTR(31),   /* ENTRY POINT OF STAE EXIT RTN          24000000
*                                 (IKJEGSTA).                        */ 24050000
*     2 TSTFLGS,               /* NAME FOR 4 BYTES FLAGS     @E2115B8*/ 24100000
*       3 TSTFLGS1    BIT(8),  /* TEST FLAGS, BYTE 1.                */ 24150000
*         4 PCHLSTVL  BIT(1),  /* PATCH LIST SWITCH.                 */ 24200000
*         4 FORGOUSE  BIT(1),  /* USED BY IKJEGGO ONLY       @E211533*/ 24250000
*         4 TSTPRINT  BIT(1),  /* PRINT SWITCH.                      */ 24300000
*         4 TSTFIRST  BIT(1),  /* FIRST TIME SWITCH.                 */ 24350000
*         4 RANGESW   BIT(1),  /* INDICATES PDE IS FOR ADDRESS RANGE.*/ 24400000
*         4 TSTBUILD  BIT(1),  /* 'AT' SWITCH FOR DEFER CHECK.       */ 24450000
*         4 ENDSW     BIT(1),  /* INDICATES 'END' TO MAINLINE.       */ 24500000
*         4 RUNSW     BIT(1),  /* INDICATES 'RUN' TO MAINLINE.       */ 24550000
*       3 TSTFLGS2    BIT(8),  /* TEST FLAGS, BYTE 2.                */ 24600000
*         4 TSTLDF    BIT(1),  /* IKJEGLDF TASK-SWITCH INDICATOR.    */ 24650000
*         4 TSTXCTL   BIT(1),  /* STAE XCTL INDICATOR.               */ 24700000
*         4 TOFFDEF   BIT(1),  /* NO ACTIVE BREAKPOINTS.             */ 24750000
*         4 TSTLDFX   BIT(1),  /* ALET addr checking         @E21D2S6*/ 24800000
*         4 TADDROUT  BIT(1),  /* LOAD MODULE FOUND UNDER TCB.       */ 24850000
*         4 TWHRLOAD  BIT(1),  /* VALID LOAD MODULE CHECK.           */ 24900000
*         4 TSTQUAL   BIT(1),  /* QUALIFICATION IS IN PROCESS        */ 24950000
*         4 TMYIOMSG  BIT(1),  /* IKJEGIO MESSAGE SWITCH.            */ 25000000
*       3 TSTFLGS3    BIT(8),  /* TEST FLAGS, BYTE 3.                */ 25050000
*         4 TSTGOSW   BIT(1),  /* SPECIAL BREAKPOINT TYPE SWITCH.    */ 25100000
*         4 TSTSTAI   BIT(1),  /* PROBLEM PROGRAM ABEND INDICATOR.   */ 25150000
*         4 SYMMESG   BIT(1),  /* SYM 'NO DIAGNOSTIC' SWITCH.        */ 25200000
*         4 TCSECTCK  BIT(1),  /* CSECT ONLY DEFER QUEUE CLEAR.      */ 25250000
*         4 TDUPNAME  BIT(1),  /* DEFER QUEUE DUPLICATE NAME BIT.    */ 25300000
*         4 TSTLINK   BIT(1),  /* SUB-CMD 'LINK FAILED' INDICATOR.   */ 25350000
*         4 TSTHELP   BIT(1),  /* INDICATES THAT A TSO COMMAND IS       25400000
*                                   ATTACHED BY TEST         @E2115B8*/ 25450000
*           5 TSTTSOC   BIT(1),  /* INDICATES THAT A TSO COMMAND IS     25500000
*                                   ATTACHED BY TEST         @E2115B8*/ 25550000
*         4 NOPARMS   BIT(1),  /* INDICATES NO PARAMETERS WITH CMD.  */ 25600000
*       3 TSTFLGS4    BIT(8),  /* TEST FLAGS, BYTE 4.                */ 25650000
*         4 TSTA      BIT(1),  /* TEST'S INPUT IS NOT FROM A STACK.  */ 25700000
*         4 TSTB      BIT(1),  /* A STACKED TERMINAL ELEM. IS PRESENT*/ 25750000
*         4 TSTFLUSH  BIT(1),  /* FORCE TCLEARQ AND POSSIBLE STACK      25800000
*                                 FLUSH.                             */ 25850000
*         4 TSTRERTN  BIT(1),  /* A RETRY IS IN PROCESS.             */ 25900000
*         4 TSTESTAE  BIT(1),  /* ESTAE IS INVOKING I/O FOR MESSAGE. */ 25950000
*         4 TSTSVCAB  BIT(1),  /* SVC ABEND IS IN PROCESS            */ 26000000
*         4 TSTPERC   BIT(1),  /* THIS RETRY ROUTINE WAS PERCOLLATED */ 26050000
*         4 TSTVALCK  BIT(1),  /* INDICATES PARSE VALIDITY CHECK IN     26100000
*                                 PROCESS.                           */ 26150000
*     2 BREAKTAB    PTR(31),   /* PTR TO FIRST BREAK ELEMENT.        */ 26200000
*     2 DEFERTAB    PTR(31),   /* PTR TO DEFERRED CMD LIST.          */ 26250000
*     2 PPLOAD      PTR(31),   /* PTR TO CURRENT BASE FOR RELATIVES. */ 26300000
*     2 PPTEMP      PTR(31),   /* TEMPORARY BASE FOR RELATIVES.      */ 26350000
*     2 SUBCHAIN    PTR(31),   /* PTR TO BREAKPOINT SUBCOMMAND CHAIN.*/ 26400000
*     2 TSTGO       FIXED(32), /* RESUME ADDRESS AFTER BREAKPOINT.   */ 26450000
*       3 TSTGOPSW  FIXED(32), /* SECOND WORD OF RBOPSW FIELD.       */ 26500000
*     2 TSTGOWCF    FIXED(8),  /* WAIT COUNT FROM RBWCF FIELD.       */ 26550000
*     2 TSTFLGS5    BIT(8),    /* TEST FLAGS, BYTE 5.        @ZA92954*/ 26600000
*       3 SKIPATTN  BIT(1),   /* BYPASS ATTENTION PROCESSING @ZA92954*/ 26650001
*       3 TSTNOALT  BIT(1),     /* Suppress ALET on an address          26700000
*                                                            @E21D2S6*/ 26750000
*       3 TSTALETY  BIT(1),    /* ALET associated with address          26800000
*                                                            @E21D2S6*/ 26850000
*       3 TSTMSGL2  BIT(1),    /* Bypass message for next occurrence of 26900000
*                            conversion of an address in CVT @E21D2S6*/ 26950000
*       3 TSTSYMAL  BIT(1),    /* ALET Associated W/ symbol  @E21D2S6*/ 27000000
*       3 TSTRESCC  BIT(1),    /*Restore problem programs CC @PEI0810*/ 27050000
*       3 TSTFOUND  BIT(1),    /* Command found flag         @E21D2MP*/ 27100000
*       3 TSTPARM   BIT(1),    /* Parmlib support is enabled @E21D2C7*/ 27150000
*     2 TSTSVC      FIXED(15), /* AN SVC 97 INSTRUCTION (0A61).      */ 27200000
*     2 PPRB        PTR(31),   /* CURRENT PROBLEM PROGRAM RB ADDRESS.*/ 27250000
*     2 TSTIODCB    PTR(31),   /* PTR TO OPEN PRINT DCB.             */ 27300000
*     2 CALLPARM    PTR(31),   /* HEAD OF CHAIN FOR PARMS BUILT BY      27350000
*                                 'CALL'.                            */ 27400000
*     2 *           PTR(31),   /* *** RESERVED SPACE ***             */ 27450000
*     2 INTSTDDN    CHAR(8),   /* DDNAME FOR DATA SET SPECIFIED ON      27500000
*                                 THE TEST COMMAND - USED BY IKJEGINT   27550000
*                                 AND IKJEGLDR.                      */ 27600000
*       3 TSTCURLD  CHAR(8),   /* CURRENTLY QUALIFIED LOAD NAME.     */ 27650000
*     2 TERMDD      CHAR(8),   /* DDNAME FOR TERMINAL USED BY           27700000
*                                 OS LOADER.                         */ 27750000
*       3 TSTCURCT  CHAR(8),   /* CURRENTLY QUALIFIED CSECT NAME.    */ 27800000
*     2 TSTSYMBA    PTR(31),   /* CURRENTLY QUALIFIED SYMBOLIC          27850000
*                                 ADDR BASE.                         */ 27900000
*     2 TSTTRN      PTR(31),   /* HEAD OF SAVE INFORMATION CHAIN.    */ 27950000
*     2 SICHAIN     PTR(31),   /* HEAD OF SYMBOL INFORMATION CHAIN.  */ 28000000
*     2 TSTSYMWK    PTR(31),   /* PTR TO SYMBOL PROCESSING WORK AREA.*/ 28050000
*     2 SYMTABLE    PTR(31),   /* PTR TO IN-CORE SYMBOL TABLE.       */ 28100000
*     2 PPEXIT      FIXED(32), /* BREAKPOINT & EXIT SVC'S FOR PP TERM*/ 28150000
*       3 PPEXIT1   FIXED(15), /* AN SVC 97 INSTRUCTION (0A61).      */ 28200000
*       3 PPEXIT2   FIXED(15), /* AN SVC 3 INSTRUCTION (0A03).       */ 28250000
*     2 TSTDCB      PTR(31),   /* HEAD OF OVLY DCB CHAIN.            */ 28300000
*     2 OPCODTAB    PTR(31),   /* PTR TO TABLE OF VALID OPERATION       28350000
*                                 CODES.                             */ 28400000
*     2 TSTOPCD2    PTR(31),   /* PTR TO TABLE FOR TWO BYTE S/370       28450000
*                                 OPERATION CODES.                   */ 28500000
*     2 TSTCADDR    PTR(31),   /* CURRENT ADDRESS BEING VALIDITY        28550000
*                       CHECKED BY IKJEGLST 'LSTBPT' ROUTINE @YA16440*/ 28600000
*     2 TSTOPCD3    PTR(31),   /* Address of E5 Opcode table @PHN0013*/ 28650000
*     2 TSTHTCB     PTR(31),   /* POINTER TO THE TCB FOR AN ATTACHED    28700000
*                                 TSO COMMAND.               @E2115B8*/ 28750000
*       3 TSTOTCB     PTR(31),   /* POINTER TO THE TCB FOR AN ATTACHED  28800000
*                                 TSO COMMAND.               @E2115B8*/ 28850000
*     2 TSTAQUAL    CHAR(8),   /* EBCDIC LOAD MODULE NAME.   @E2115B8*/ 28900000
*     2 TSTAQEP     PTR(31),   /* ENTRY POINT OF LOAD MODULE.        */ 28950000
*     2 TSTRSTRT    PTR(31),   /* RESTART ADDRESS FOR STAE PROCESSING*/ 29000000
*     2 TSTSRHRT    PTR(31),   /* ADDRESS OF RESIDENT ADDRESS           29050000
*                                 VALIDITY CHECK ROUTINE.            */ 29100000
*     2 TSTSTAX     CHAR(20),  /* STAX PARAMETER LIST                */ 29150000
*     2 TSTDSECB    FIXED(31), /* TEST DISPATCHABILITY ECB.          */ 29200000
*     2 TSTMNLWK    CHAR(56),  /* WORK AREA FOR EXCLUSIVE    @E2115B8*/ 29250000
*                              /* USE OF MNL                 @E2115B8*/ 29300000
*     2 TSTIOPRM    CHAR(84),  /* IO PARAMETER BLOCK         @E2115B8*/ 29350000
*     2 TSTSVCM1    CHAR(4),   /* SVC FIRST LEVEL MESSAGE NO.        */ 29400000
*     2 TSTSVCM2    CHAR(4),   /* SVC SECOND LEVEL MESSAGE NO.       */ 29450000
*     2 TSTOPCD4    PTR(31),   /* ADDRESS OF A4 OPCODE TABLE @E1402C4*/ 29500000
*     2 TSTOPCD5    PTR(31),   /* ADDRESS OF A5 OPCODE TABLE @E1402C4*/ 29550000
*     2 TSTOPCD6    PTR(31),   /* ADDRESS OF A6 OPCODE TABLE @E1402C4*/ 29600000
*     2 ABNDTCB     PTR(31),   /* ABENDING TCB  ADDR         @E2115B8*/ 29650000
*     2 TSTECTSV    CHAR(56),  /* ECT SAVE AREA.             @E2115B6*/ 29700000
*     2 TSTOPCD7    PTR(31),   /* ADDRESS OF E4 OPCODE TABLE @E1402C4*/ 29750000
*     2 TSTVPARM    FIXED(31), /* VECTOR FACILITY PARAMETERS @E1402C4*/ 29800000
*       3 TSTVSS    FIXED(15), /* VECTOR SECTION SIZE        @E1402C4*/ 29850000
*       3 TSTVPS    FIXED(15), /* VECTOR PARTIAL SUM NUMBER  @E1402C4*/ 29900000
*     2 TSTALET1    FIXED(32), /* ALET value for address     @E21D2S6*/ 29950000
*     2 TSTALET2    FIXED(32), /* ALET value for second address of a    30000000
*                                 range                      @E21D2S6*/ 30050000
*     2 TSTMSGCD,              /* Message code fields        @E21D2S6*/ 30100000
*       3 TSTMSG1N  FIXED(32), /* First level message number @E21D2S6*/ 30150000
*       3 TSTMSG2N  FIXED(32), /* Second level message number           30200000
*                                                            @E21D2S6*/ 30250000
*     2 TSTEGARM    PTR(31),   /* Address of IKJEGARM        @E21D2S6*/ 30300000
*     2 TSTEGCOM    PTR(31),   /* Address of IKJEGCOM        @E21D2S6*/ 30350000
*     2 TSTEGAR1    PTR(31),   /* Address of IKJEGAR1        @E21D2B1*/ 30400000
*     2 TSTEGAR2    PTR(31),   /* Address of IKJEGAR2        @E21D2B1*/ 30450000
*     2 TSTEGAR3    PTR(31),   /* Address of IKJEGAR3        @E21D2B1*/ 30500000
*     2 TSTGEN      FIXED(32), /* Current Parmlib generation number     30550000
*                                                            @E21D2MP*/ 30600000
*     2 TSTCBLK,               /* Pseudo-command entry generated by     30650000
*                                 last command scan          @E21D2MP*/ 30700000
*       3  TSTCBCL   FIXED(8), /* Length of command name = 8 @E21D2MP*/ 30750000
*       3  TSTCBCN   CHAR(8),  /* Storage for command name   @E21D2MP*/ 30800000
*       3  TSTCBAL   FIXED(8), /* Length of alias name = 0   @E21D2MP*/ 30850000
*       3  TSTCBLN   CHAR(8), /* Name of command load module @E21D2MP*/ 30900001
*       3  TSTCBCI   FIXED(8), /* ID of command name         @E21D2MP*/ 30950000
*     2 *            FIXED(8), /* *** Reserved space ***     @E21D2MP*/ 31000000
*     2 TSTTSOCD     PTR(31),  /* Pointer to local copy of IKJEGTCT     31050000
*                                                            @E21D2MP*/ 31100000
*     2 TSTSUBCD     PTR(31),  /* Pointer to local copy of IKJEGSCT     31150000
*                                                            @E21D2MP*/ 31200000
*     2 TSTTSOLN     FIXED(16),/* Length of local IKJEGTCT   @E21D2MP*/ 31250000
*     2 TSTSUBLN     FIXED(16),/* Length of local IKJEGSCT   @E21D2MP*/ 31300000
*     2 TSTPDECM    PTR(31), /* PDE ptr returned from prompt @E21D2S6*/ 31350000
*     2 TSTALERC    CHAR(4),   /* ALET addr check RC         @E21D2S6*/ 31400000
*     2 TSTS9G01    CHAR(20),  /* S9G macro workarea         @E21D2S6*/ 31450000
*     2 REGSAVE7    PTR(31),   /* Save area ptr              @E21D2S6*/ 31500000
*     2 REGSAVE8    PTR(31),   /* Save area ptr              @E21D2S6*/ 31550000
*     2 REGSAVE9    PTR(31),   /* Save area ptr              @E21D2S6*/ 31600000
*     2 TSTFTPRT    CHAR(48),  /* TEST Footprint Area        @E21D2S6*/ 31650000
*       3 TSTFTCUR  CHAR(24),  /* Current module             @E21D2S6*/ 31700000
*       3 TSTFTOLD  CHAR(24),  /* Previous module            @E21D2S6*/ 31750000
*     2 TSTOPCD8    PTR(31),   /* Address of 01 OPcode table @PE10170*/ 31800000
*     2 TSTFTTMP    CHAR(24),  /* Footprint Temporary Save   @PEI0220*/ 31850000
*     2 TSTECOMB    ,          /* Exit Command buffer ptr    @PEI0136*/ 31900000
*     2 TSTESUBB    ,          /* Exit SubCommand buffer ptr @PEI0136*/ 31950000
*     2 TSTUWENT    ,          /* Exit Communication word entry         32000000
*                                                            @PEI0136*/ 32050000
*       3 TSTUWKEY  FIXED(32), /* Exit Communication word Key           32100000
*                                                            @PEI0136*/ 32150000
*       3 TSTUWLEN  FIXED(32), /* Exit Communication word Length        32200000
*                                                            @PEI0136*/ 32250000
*       3 TSTUWORD  FIXED(32), /* Exit Communication word Data          32300000
*                                                            @PEI0136*/ 32350000
*     2 TSTSWENT    ,          /* Exit SubCmd UserWord Entry @PEI0136*/ 32400000
*       3 TSTSWKEY  FIXED(32), /* Exit SubCmd UserWord Key   @PEI0136*/ 32450000
*       3 TSTSWLEN  FIXED(32), /* Exit SubCmd UserWord Len   @PEI0136*/ 32500000
*       3 TSTSWORD  FIXED(32), /* Exit SubCmd UserWord Data  @PEI0136*/ 32550000
*     2 TSTORIGI  FIXED(32),   /* Original INBUF save area   @PEI0431*/ 32600000
*     2 TSTCPAGE    PTR(31),   /* CURRENT PAGE ADDRESS USED BY          32650000
*                                 IKJEGLST 'LSTBPT' ROUTINE  @YA16440*/ 32700000
*     2 TCOMTPID    CHAR(8),   /* TPID for the TP being tested       */ 32750000
*     2 TSTMNLW2    PTR(31),   /* ADDR of second part MNL workarea      32800000
*                                                            @E24D2B1*/ 32850000
*     2 SMSPDSE     CHAR(8),   /* PDSE STARTD/ENDD Token     @E24D2B1*/ 32900000
*     2 TSTFLGS6    BIT(8),    /* TEST flags, byte 6.        @PMH0149*/ 32950000
*       3 INITEINV  BIT(1),    /* Initialization exit invokd @PMH0149*/ 33000000
*       3 TSTCVTMG  BIT(1),    /* Issue message if convert fails @L1A*/ 33010000
*     2 *           CHAR(3),   /* *** Reserved Space ***     @PMH0149*/ 33050000
*     2 *           CHAR(20);  /* *** Reserved space ***     @E21D2C7*/ 33100000
* DCL 1                                                                 33150000
*   TCOM   BASED(ADDR(TCOMTAB)-LENGTH(TCOMID)), /* NAME FOR             33200000
*                                 TCOMTAB INCLUDING PREFIX   @E2115B8*/ 33250000
*     2 TCOMPREF,              /* TCOMTAB PREFIX             @E2115B8*/ 33300000
*       3 TCOMID CHAR(8),      /* TCOMTAB ID: 'TCOMTAB'      @E2115B8*/ 33350000
*     2 * CHAR(LENGTH(TCOMTAB));/* TCOMTAB PROPER            @E2115B8*/ 33400000
* DCL TCOMPREL FIXED(31) CONSTANT(LENGTH(TCOMPREF)); /* LENGTH OF       33450000
*                                 TCOMTAB PREFIX             @E2115B8*/ 33500000
* DCL TCOMLTH FIXED(31) CONSTANT(LENGTH(TCOMTAB)+LENGTH(TCOMPREF)); /*  33550000
*                               LENGTH INCLUDING PREFIX AREA @E2115B8*/ 33600000
* DCL OUTBUFRL FIXED(31)       /* LENGTH OF                          */ 33650000
*              CONSTANT(256);  /* OUTPUT BUFFER.                     */ 33700000
* DCL CONAREAL FIXED(31)       /* LENGTH OF                          */ 33750000
*              CONSTANT(72);   /* CONVERT WORK AREA                  */ 33800000
* DCL REGSAVEL FIXED(31)       /* LENGTH OF                          */ 33850000
*              CONSTANT(432);  /* 6 REGISTER SAVE AREAS.             */ 33900000
* DCL TREQAOFF BIT(8) CONSTANT('11011111'B); /*              @E23D2D9*/ 33950000
