*/* COPYRIGHT = 5650-ZOS                                             */ 00050000
*/*            COPYRIGHT IBM CORP. 1988, 2015                        */ 00150000
*/*            LICENSED MATERIALS - PROPERTY OF IBM                  */ 00200000
*/*                                                                  */ 00350000
*/* STATUS  = HBB77A0                                                */ 00370000
*/*                                                                  */ 00390000
*/*01* EXTERNAL CLASSIFICATION: PI                                   */ 00410000
*/*01* END OF EXTERNAL CLASSIFICATION:                               */ 00430000
*/*                                                                  */ 00450000
*/* CHANGE ACTIVITY =                                                */ 00500000
*/*   $L1 =    AR    HBB3310 850901 PDXB: AR SUPPORT                 */ 00550000
*/*   $L2= 64BITCSV  HBB7703 981204 PD00XB: ESAME                    */ 00575000
*/*   $P1= PYM0373   HBB7706 010726 PD00XB: PLIST8                   */ 00587500
*/*   $L3= ARALETS   HBB7770 090501 PDXB: ALETS FOR AMODE 64 AR-MODE */ 00587600
*/*   $L4= ME26814   HBB77A0 131031 PDXB: PLISTARALETS               */ 00587708
*%/*                                                                    00600000
         MACRO                                                          00650000
&NAME    XCTLX &REG,&EP=,&EPLOC=,&DE=,&DCB=,&PARAM=,&VL=,&HIARCHY=,    X00700000
               &SF=I,&MF=I,&LSEARCH=,&PLIST8=,&PLIST4=,                X00750000
               &PLIST8ARALETS=,&PLISTARALETS=SYSTEM                @L4C 00760004
.********************************************************************** 00800000
.*                                                                    * 00850000
.* NAME = XCTLX                                                       * 00900000
.*                                                                    * 00950000
.********************************************************************** 01000000
         GBLB  &IHBSWA,&IHBSWB                                @G381P2A  01050000
         LCLC  &L,&LR                                              @MXA 01052500
         GBLC  &SYSAM64                                            @MXA 01055000
         SYSSTATE TEST                                             @MXA 01057500
         AIF   ('&SYSAM64' EQ 'YES').AM640                         @MXA 01060000
&L       SETC  'L'                                                 @MXA 01062500
&LR      SETC  'LR'                                                @MXA 01065000
         AGO   .AM31640                                            @MXA 01067500
.AM640   ANOP                                                      @MXA 01070000
&L       SETC  'LLGT'                                              @MXA 01072500
&LR      SETC  'LGR'                                               @MXA 01075000
.AM31640 ANOP                                                      @MXA 01077500
         GBLC  &SYSPLIST8            8-BYTE PARAMETER LIST         @L2A 01080000
         GBLC  &SYSPLIST8ARALETS                                   @L3A 01081000
         GBLC  &SYSPLISTARALETS                                    @L4A 01082004
         LCLC  &SAVEPLIST8           SAVED VALUE                   @L2A 01090000
         LCLA  &CTR                                           @G381P2A  01100000
         LCLC  &SAVEPLIST8ARALETS                                  @L3A 01101000
         LCLC  &SAVEPLISTARALETS                                   @L4A 01101104
&SAVEPLIST8 SETC '&SYSPLIST8'                                      @L2A 01101700
&SYSPLIST8 SETC ''                                                 @L2A 01103400
&SAVEPLIST8ARALETS SETC '&SYSPLIST8ARALETS'                        @L3A 01103500
&SAVEPLISTARALETS SETC '&SYSPLISTARALETS'                          @L4A 01103604
.********************************************************************** 01105900
.*   VALIDATE PLIST4, PLIST8                                          * 01106800
.********************************************************************** 01108500
         AIF   ('&PLIST8' EQ '').PLIST8END                         @L2A 01110200
         AIF   ('&PLIST8' EQ 'YES' OR '&PLIST8' EQ 'NO').PLIST8END @L2A 01111900
         IHBERMAC 1001,PLIST8,&PLIST8                              @L2A 01113600
         AGO   .EXIT                                               @L2A 01115300
.PLIST8END ANOP                                                    @L2A 01117000
         AIF   ('&PLIST4' EQ '').PLIST4END                         @L2A 01118700
         AIF   ('&PLIST4' EQ 'YES' OR '&PLIST4' EQ 'NO').PLIST4END @L2A 01120400
         IHBERMAC 1001,PLIST4,&PLIST4                              @L2A 01122100
         AGO   .EXIT                                               @L2A 01123800
.PLIST4END ANOP                                                    @L2A 01125500
         AIF   ('&PLIST8' EQ '' OR '&PLIST4' EQ '').PLIST84END     @L2A 01127200
         IHBERMAC 1304,PLIST4,PLIST8                               @L2A 01128900
.PLIST84END ANOP                                                   @L2A 01130600
         AIF   ('&PLIST8' EQ 'YES').YESPL8                         @L2A 01132300
         AIF   ('&PLIST4' EQ 'NO').YESPL8                          @L2A 01134000
         AIF   ('&SYSAM64' NE 'YES').NOPL8                         @L3C 01135700
.YESPL8  ANOP                                                      @L2A 01139100
&SYSPLIST8 SETC 'YES'                                              @L2A 01140800
.NOPL8   ANOP                                                      @L2A 01142500
         AIF   ('&PLIST4' NE 'YES').NOPL4                          @L2A 01144200
&SYSPLIST8 SETC ''                                                 @P1C 01145900
.NOPL4   ANOP                                                      @L2A 01147600
.********************************************************************** 01147700
.*   VALIDATE PLIST8ARALETS                                           * 01147800
.********************************************************************** 01147900
         AIF   ('&PLIST8ARALETS' EQ '').PLIST8ARALETSEND           @L3A 01148000
         AIF   ('&PLIST8ARALETS' EQ 'NO').PLIST8ARALETSEND         @L3A 01149000
         AIF   ('&PLIST8ARALETS' EQ 'YES').PLIST8ARALETSEND        @L3A 01149100
         IHBERMAC 1001,PLIST8ARALETS,&PLIST8ARALETS                @L3A 01149200
         AGO   .EXIT                                               @L3A 01149300
.PLIST8ARALETSEND ANOP                                             @L3A 01149400
&SYSPLIST8ARALETS SETC 'NO'                                        @L3A 01149500
         AIF   ('&SYSPLIST8' NE 'YES').DONEPLIST8ARALETS           @L3A 01149600
         AIF   ('&PLIST8ARALETS' NE 'YES').DONEPLIST8ARALETS       @L3A 01149700
&SYSPLIST8ARALETS SETC 'YES'                                       @L3A 01149800
.DONEPLIST8ARALETS ANOP                                            @L3A 01149900
.********************************************************************** 01150001
.*   VALIDATE PLISTARALETS                                            * 01151004
.********************************************************************** 01152001
&SYSPLISTARALETS SETC '&PLISTARALETS'                              @L4A 01152104
         AIF   ('&PLISTARALETS' EQ 'NO').PLISTARALETSVALID         @L4A 01154005
         AIF   ('&PLISTARALETS' EQ 'SYSTEM').PLISTARALETSVALID     @L4A 01155005
         IHBERMAC 1001,PLISTARALETS,&PLISTARALETS                  @L4A 01156004
         AGO   .EXIT                                               @L4A 01157001
.PLISTARALETSVALID ANOP                                            @L4A 01158005
         AIF   ('&PLISTARALETS' NE 'NO').PLISTARALETSNOTNO         @L4A 01159004
         AIF   ('&PLIST8ARALETS' NE 'YES').PLISTARALETSNOTNO       @L4A 01159104
         IHBERMAC 1020,''PLISTARALETS=NO'',''PLIST8ARALETS=YES''   @L4A 01159207
.PLISTARALETSNOTNO ANOP                                            @L4A 01159304
&IHBSWA  SETB  ('&VL' EQ '1')                                           01160001
&IHBSWB  SETB  1                                                        01200000
         AIF   ('&PARAM&VL' NE '' AND '&MF(1)' NE 'E').E1               01250000
         AIF   ('&MF' EQ 'L').E2                                        01300000
         AIF   ('&SF' EQ 'L' AND '&MF&PARAM&VL&REG' NE 'I').E3          01350000
         AIF   ('&HIARCHY' NE '').E0                                    01400000
.CONT    AIF   ('&NAME' EQ '' OR '&SF' EQ 'L').CONTA                    01450000
&NAME    DS    0H                                                       01500000
.CONTA   AIF   ('&MF(1)' NE 'E').CONTB                                  01550000
.PROCESS ANOP                                                 @G381P2A  01600000
         IHBOPLTX  ,&PARAM,MF=&MF                             @G381P2A  01650000
.CONTB   ANOP                                                 @G381P2A  01700000
&NAME    IHBINNRY &EP,&EPLOC,&DE,&DCB,&LSEARCH,               @G381P2A X01750000
               XCTL,&PARAM,&MF,                               @G381P2A X01800000
               SF=&SF,                                        @G381P2A X01833300
               PLIST4=&PLIST4,PLIST8=&PLIST8                       @L2C 01866600
.CONTC   ANOP                                                 @G381P2A  01900000
         AIF   ('&SF' EQ 'L').EXIT                                      01950000
         AIF   ('&REG' EQ '').SVC                                       02000000
         AIF   (T'&REG(1) NE 'N').E4                                    02050000
         AIF   (&REG(1) LT 2 OR &REG(1) GT 12).E4                       02100000
         AIF   (N'&REG EQ 1).CONTD                             @G381P2A 02150000
         AIF   (N'&REG NE 2).E4                                         02200000
         AIF   (T'&REG(2) NE 'N').E4                                    02250000
         AIF   (&REG(2) LE &REG(1) OR &REG(2) GT 12).E4                 02300000
         AIF   ('&SYSAM64' EQ 'YES').AM641                         @MXA 02325000
&CTR     SETA  &REG(1)*4+20                                             02350000
         LM    &REG(1),&REG(2),&CTR.(13)         RESTORE REGISTERS      02400000
         AGO   .SVC                                                     02450000
.AM641   ANOP                                                 @G381P2A  02460000
&CTR     SETA  &REG(1)*8+32                                        @MXA 02470000
         LMG   &REG(1),&REG(2),&CTR.(13)         RESTORE REGISTERS @MXA 02480000
         AGO   .SVC                                                @MXA 02490000
.CONTD   ANOP                                                 @G381P2A  02500000
         AIF   ('&SYSAM64' EQ 'YES').AM642                         @MXA 02525000
&CTR     SETA  &REG(1)*4+20                                   @G381P2A  02550000
         L     &REG(1),&CTR.(0,13)           RESTORE REGISTER @G381P2A  02600000
         AGO   .SVC                                                @MXA 02608300
.AM642   ANOP                                                      @MXA 02616600
&CTR     SETA  &REG(1)*8+32                                        @MXA 02624900
         LG    &REG(1),&CTR.(0,13)           RESTORE REGISTER      @MXA 02633200
         AGO   .SVC                                                     02641500
.SVC     ANOP                                                 @G381P2A  02650000
         LA    15,8                XCTL EXTENDED SVC ROUTING CODE       02700000
.*                                                            @G381P2A  02750000
         SVC   122                 ISSUE EXTENDED SVC         @G381P2A  02800000
         AGO   .EXIT                                                    02850000
.E0      AIF   ('&HIARCHY' LT '0' OR '&HIARCHY' GT '1').E5              02900000
         AGO   .CONT                                                    02950000
.E4      IHBERMAC 36,,&REG                                              03000000
         AGO   .EXIT                                                    03050000
.E1      IHBERMAC 95                                                    03100000
         AGO   .EXIT                                                    03150000
.E2      IHBERMAC 84                                                    03200000
         AGO   .EXIT                                                    03250000
.E3      IHBERMAC 75                                                    03300000
         AGO   .EXIT                                                    03350000
.E5      IHBERMAC 195                                                   03400000
.EXIT    ANOP                                                           03425000
&SYSPLIST8 SETC '&SAVEPLIST8'                                      @L2A 03450000
&SYSPLIST8ARALETS SETC '&SAVEPLIST8ARALETS'                        @L3A 03460000
&SYSPLISTARALETS SETC '&SAVEPLISTARALETS'                          @L4A 03470004
         MEND                                                           03475000
**/                                                                     03500000
*XCTLX:  MACRO                                                          03550000
*        KEYS(DCB,DE,EP,REGS,PARAM,SF,VL,MF,LSEARCH,PLIST8,PLIST4       03600000
*            );                                           /*     @L2C*/ 03650000
*        ANS('?'!!MACLABEL!!'XCTLXP '!!MACLIST!!MACKEYS!!';');          03700000
*                                                         /* @ZMB0056*/ 03750000
*%END;                                                    /* @ZMB0056*/ 03800000
